{
  "id": "topic_5408899",
  "title": "autumnleaf",
  "author": "autumnleaf",
  "created_time": "August 06, 2022, 07:14:29 AM",
  "content": "Does anyone think Bitcoin first as a digital currency or a computer program?First of all, Bitcoin is really a computer program. Yes, a computer program that allows machines all over the world to share a secure file.Then, how did Bitcoin come to be known as digital currency? You execute the program at that point. It will establish a connection with other computers that are using this program, and they will begin sharing a file with you. New bitcoins are created, or mined, when computers on the network process and verify transactions.All of these transactions rely on cryptography to send and receive digital output. These outputs are merely holding structures for various bitcoin amounts. Because of this, a universal electronic payment system—what we now refer to as \"digital currency\"—is created.Sources:https://learnmeabitcoin.com/https://www.bankrate.com/investing/what-is-bitcoin-mining/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408899",
  "comments": [
    {
      "author": "Wind_FURY",
      "created_time": "August 06, 2022, 07:25:36 AM",
      "body": "OP, it's actually a complete protocol for a \"hard money\", and much much more. If you ask me, I believe that \"Bitcoin\" is actually hard to \"define\", because it can be one definition for one person like a cryptocurrency for personal finance, and an absolutely another definition for another person like a censorship-resistant protocol that can weaken political strongholds. It's actually the world's first time to have a breakthrough of a true decentralized network like Bitcoin. We might actually not know what it is, or what it might be yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "August 06, 2022, 07:29:44 AM",
      "body": "There are lots of subtle distinctions and nuances in words which we associate with bitcoin and cryptocurrency.For example, it is believed that wallets hold our bitcoins for us, but in reality, the wallets grant us assess to those bitcoins on the chain through our proof of ownership - Private keys.It can function both as a computer program on one end and a digital currency on the other, as there has to be a bit [lot rather] of computer programming in digital technology.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 06, 2022, 07:59:45 AM",
      "body": "It's a computer program that implements a decentalized digital currency. How else would you make one? Even the contemporary credit system that banks use is just a bunch of (brittle, written on ancient IBM mainframes) computer programs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 06, 2022, 11:25:03 AMLast edit: August 06, 2022, 11:41:18 AM by franky1",
      "body": "Quote from: autumnleaf on August 06, 2022, 07:14:29 AMDoes anyone think Bitcoin first as a digital currency or a computer program?First of all, Bitcoin is really a computer program. Yes, a computer program that allows machines all over the world to share a secure file.\"share a file\"? nopeshare data, yes. where that data is financial utility based.. im not gonna knitpick the other issues with topic creators descriptions..anywaybitcoin is many things.trying to define bitcoin as just one thing, just ignores and hides the other features, utility, benefits it has being other thingslets compare it to something else that is many things: is Apple a company?, a phone manufacturer?, a software producer?, a retailer?, etc,etc .. answer = all of themApple is many things including an investment on the nasdaqis Visa a company?, a plastic card?, a tap and pay merchant tool(hardware) provider?, a payment system?, etc,etc .. answer = all of themVisa is many things including an investment on the nasdaqbitcoin, apple, visa is not 'just' X.. they all have utility and purpose for different reasons.but cryptocurrency [bitcoin being the main one] is able to operate, without needing to be a company that requires certain central points of management/delegation.for mebitcoin is my financial accountant and lawyer. able to facilitate my value to be stored 'offshore' without the need of physical middlemen having to be involved.bitcoin is my currency, storing spendable value in a different form that is not pounds, dollars or eurosbitcoin is my future retirement pension plan/wealthbitcoin is my [insert many examples]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "August 06, 2022, 05:37:59 PM",
      "body": "I would say it's both and more...The base is a computer program, but its nodes are connected over the network. And the process can be apply to our current economical system. There is where human decide to adopt it as a digital currency.But the program is more complex than that, you can send a message on each transaction, but that doesn't make from Bitcoin a text message system.You can sign a message with bitcoin, but people don't say bitcoin is the new pgp.So, you can learn about what to do with this technology, and adopt it as it works better for you. At the end if most of the people decide BTC is money, then it will be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 06, 2022, 05:44:44 PM",
      "body": "How else would Bitcoin be created (and run) than through a computer program? Literally almost anything digital is created through computer programs.Asking \"a digital currency or a computer program?\" in the context of Bitcoin is just like saying \"an automobile or a machine?\" in the context of cars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "August 06, 2022, 06:28:46 PM",
      "body": "Bitcoin is p2p electronic cash. So definitely have to use a computer program. Because blockchain solves computing systems when you transfer data (make transactions). We are just transferring data and Bitcoin always exists on the blockchain hence its accessible from the worldwide computing system. It's coin because a code has been deployed to the decentralized blockchain where we can use the unit to hold or transfer like money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "August 06, 2022, 08:25:47 PM",
      "body": "Quote from: autumnleaf on August 06, 2022, 07:14:29 AMDoes anyone think Bitcoin first as a digital currency or a computer program? sometimes we just like complicating things for ourselves of which are obviously simple, from the definition when you google the word bitcoin, it said to be the first digital and decentralized currency, the definition simply gives an accurate answer to this. Quote from: autumnleaf on August 06, 2022, 07:14:29 AMFirst of all, Bitcoin is really a computer program. Yes, a computer program that allows machines all over the world to share a secure file.here you already assume the answer for yourself, but i will advise or suggest you read about bitcoin mining and relate it to your answer provided here. Quote from: autumnleaf on August 06, 2022, 07:14:29 AMThen, how did Bitcoin come to be known as digital currency? You execute the program at that point. It will establish a connection with other computers that are using this program, and they will begin sharing a file with you. New bitcoins are created, or mined, when computers on the network process and verify transactions.have you ever paid for a service that is of more technical IQ within a little time than manual or physical labor that consume energy and time, do you think you're been paid for the little time spent? but instead the value and efforts given, miners were not just rewarded with bitcoin, solving a complex mathematical equations couldn't have just been an easy task like eating rice and beans, and just as you can have your fiat with banks in digits and still have to withdraw thesame digits into fiat notes, apply same to bitcoin in this regard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "August 06, 2022, 11:58:48 PM",
      "body": "Quote from: autumnleaf on August 06, 2022, 07:14:29 AMDoes anyone think Bitcoin first as a digital currency or a computer program?It's both of them, it's a computer program that has its own protocol that no one owns and no one will change on it.It's also an open-source code that can be publicly seen but you can't modify it.  Due to the limited supply, this becomes a digital currency that the creator purposed to become a digital currency and its financial freedom.For more information, I think you need to read the Bitcoin Whitepaper to understand what the purpose of Bitcoin was created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 07, 2022, 03:06:11 AM",
      "body": "There are two programs in BTC right?The blockchain and the Bitcoin. One is the currency and one is the program I believe that shares the data as public ledger. Many people will have a hard time understanding how the program works. In the end, people look at Bitcoin as an investment asset, not a computer program and some digital currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 07, 2022, 03:33:25 AM",
      "body": "maybe the topic creator would have got more responses if he had the title\"bitcoin is:\"then asking people to list everything that bitcoin is to people. because the truth is that bitcoin is many things to many people. its not one thing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frengki_cisco",
      "created_time": "August 07, 2022, 05:50:08 AM",
      "body": "Quote from: autumnleaf on August 06, 2022, 07:14:29 AMDoes anyone think Bitcoin first as a digital currency or a computer program?Computers and the internet as a vehicle or transportation to connect Bitcoin to other vehicles, Bitcoin as a human program to be transported and loaded into vehicles and traded around the world, I don't think of bitcoin as a computer program.It can be seen how Bitcoin works, without a computer you can still make buying and selling Bitcoin transactions through ATMs, Visa and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "August 07, 2022, 06:21:44 AM",
      "body": "You can say that it is a computer program, although it implements a monetary system that a lot of people and organizations around the world recognize. What if I tell you that the balances you see on bank accounts are nothing but numbers inputted in a system with, most of the time, no actual money backing them unless you decided to withdraw it from your account? It's essentially the same in our current banking system, just that the other is more established and has been in existence longer than bitcoin.Money's value is worth on trust of a lot of people using it. Anything can be money, even computer programs, if enough people believed on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "August 07, 2022, 08:26:29 AM",
      "body": "That's very hard to give it a name and many people have different ideas about it, however, there is no need to say only one of them is true because a currency can be also a computer program. But regardless of these two, I would say more than anything bitcoin be counted as an asset people can invest in it and buy it just like gold and other assets which can be used to save people from the inflation rate all over the world, buy still bitcoin a computer if look technically because in the end, you are facing which an opensource project in github.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "August 07, 2022, 08:42:56 AM",
      "body": "I think Bitcoin is a lot more than just a computer programe or a digital currency. It's a universal currency which can replace fiat. it is foundation block of future decentralised financial system which is fast efficient. Cost effective and scalable. All these feature make Bitcoin a great asset for investment as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "August 07, 2022, 08:57:22 AM",
      "body": "Quote from: autumnleaf on August 06, 2022, 07:14:29 AMAll of these transactions rely on cryptography to send and receive digital output. These outputs are merely holding structures for various bitcoin amounts. Because of this, a universal electronic payment system—what we now refer to as \"digital currency\"—is created.Yeah, and when it is created, it has an actual utility, one of which is that it is money/currency that can be effectively used as a medium of exchange, but this very money isn't physical, it is spent online/digitally, that is why it is a digital currency. You prolly do not know about Bitcoin's usefulness, you don't know it is a currency/money, that is why you are confused. Having said that, in summary, i think we can call it a computer program that produces a digital currency that can be spent where accepted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Republikcoin.com",
      "created_time": "August 07, 2022, 09:02:26 AM",
      "body": "Quote from: autumnleaf on August 06, 2022, 07:14:29 AMDoes anyone think Bitcoin first as a digital currency or a computer program?I never thought like that in the past and also now although every digital product that cannot be touched directly with bare hands is usually made through a computer system.QuoteFirst of all, Bitcoin is really a computer program. Yes, a computer program that allows machines all over the world to share a secure file.Then, how did Bitcoin come to be known as digital currency? You execute the program at that point. It will establish a connection with other computers that are using this program, and they will begin sharing a file with you. New bitcoins are created, or mined, when computers on the network process and verify transactions.All of these transactions rely on cryptography to send and receive digital output. These outputs are merely holding structures for various bitcoin amounts. Because of this, a universal electronic payment system—what we now refer to as \"digital currency\"—is created.But for now almost everything new that is related to financial matters or digital money is always computer related and it is a worthy thing to make to make it easier for everyone when they want to send some money. So I think that Bitcoin was created to make it easier for everyone when transacting with each other with a predetermined network and it would not be wrong to continue to be developed in this modern era.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "August 07, 2022, 09:14:30 AM",
      "body": "I guess this is not a case of either-or. Neither is this a case of which comes first. Bitcoin was born as a digital currency in the form of a computer program. I think it's not hard to imagine this because something could be both at the same time. It's like a person who is both a father and a son at the same time. This is not some kind of a mind-boggling invention that is both a circle and a square at the same time. Bitcoin was meant to be a digital currency and for it to happen a program has to be made. And then Bitcoin was born.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "August 07, 2022, 09:28:02 AM",
      "body": "Quote from: autumnleaf on August 06, 2022, 07:14:29 AMDoes anyone think Bitcoin first as a digital currency or a computer program?This topic confirms a fact that Bitcoin has yet reached to a massive adoption globally. When people use Bitcoin without a question what is it and big reason for profit hunting as their main reason to buy Bitcoin, it will reach to a massive global adoption.Think of the Internet, online payment applications ie. Nowadays, we are using them very naturally without questions like what is it, a program, a software, an application and even don't mind about history behind it.Of course I don't say learning basics of Bitcoin is bad if you are a Bitcoiner.The Bitcoin Origins - Explore Bitcoin History and SecretsThe Bitcoin origins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}