{
  "id": "topic_5418924",
  "title": "aliitp2",
  "author": "aliitp2",
  "created_time": "October 31, 2022, 10:27:14 AM",
  "content": "I need to buy some btc for a family member in Canada using Canadian Bank debit card, I tried most known exchanges binance, crypto.com etc none of them worked as Canadian banks and card issuers block crypto exchanges, any successful experience and reputed exchanges to buy btc with low fees in Canada will be greatly appreciated, I only found those  other sure how legit they are: mybtc.caHelp appreciated thanks..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418924",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "October 31, 2022, 10:33:13 AMLast edit: October 31, 2022, 10:46:02 AM by OmegaStarScream",
      "body": "Take a look at BitBuy[1]. It looks good. I haven't tried the exchange myself though, so make sure to do more research.As for the site you mentioned, then you should look into these posts first[2][3].[1] https://bitbuy.ca/ [2] https://www.reddit.com/r/BitcoinCA/comments/ar28aq/do_not_use_mybtcca_the_person_running_is/[3] https://www.reddit.com/r/BitcoinCA/comments/ibhypi/mybtcca_offers_unique_payment_and_id_verification/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BD Crypto",
      "created_time": "October 31, 2022, 12:37:17 PM",
      "body": "For you Bitbuy.ca will be a perfect choice to buy Bitcoin from Canada. I just knew about it from the social sites and you should research by own before using any exchange in Canada. You may learn about other good exchanges from your country by searching through the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "October 31, 2022, 02:15:56 PM",
      "body": "Quote from: aliitp2 on October 31, 2022, 10:27:14 AMI need to buy some btc for a family member in Canada using Canadian Bank debit card, I tried most known exchanges binance, crypto.com etc none of them worked as Canadian banks and card issuers block crypto exchanges, any successful experience and reputed exchanges to buy btc with low fees in Canada will be greatly appreciated, I only found those  other sure how legit they are: mybtc.caHelp appreciated thanks..Since their is a restrictions of so many of this exchanges to process buying of cryptocurrency over there, i think the best thing to do concerning these, is to use VPN, because it's like cryptocurrency is not supported in such country by using of the direct ip address of the country to operate on exchange like binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "October 31, 2022, 02:45:41 PM",
      "body": "Have you known those sites and tried searching from them?https://exchangewar.info/https://blockspot.io/exchange/https://www.cryptowisser.com/exchanges/Maybe you can wait for someone who are from Canada to help you with more details and real experience. In the meantime, you should try it yourself with those sites and use their filters for searching.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "October 31, 2022, 11:12:12 PM",
      "body": "I heard there are lots of Bitcoin ATM in Canada why not withdraw money instead from the Bank ATMs? And then buy Bitcoin directly to Bitcoin ATMs(Cash to Bitcoin).Check the list of cities in Canada below if there is Bitcoin ATM near you.- https://coinatmradar.com/country/38/bitcoin-atm-canada/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "November 01, 2022, 06:04:50 AM",
      "body": "I just did a search for them and except from crypto.com, they've got bitbuy on this list and some other exchange that may be helpful to you.--> https://www.yoreoyster.com/blog/best-crypto-exchange-canada/The article was just published a few days ago and there are some reasonings why the author considers these exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 01, 2022, 07:34:17 AM",
      "body": "If they are blocked or restricted all you should do is to visit their local board here in the forum and run a p2p service then you could transfer fiat to those in Canada for you to receive bitcoin, that is the cheapest means and way to deal with the country restricted area.I could remembered when FG restricted our account and card from associating directly with cryptocurrency transaction we located ourselves here in fourm and started transacting before binance p2p came up and was dealing direct from them.At this stage I don't advice to use any vpn or ip otherwise your account could be frozen, instead p2p is the best options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "November 01, 2022, 04:12:01 PM",
      "body": "Quote from: aliitp2 on October 31, 2022, 10:27:14 AMI need to buy some btc for a family member in Canada using Canadian Bank debit card, I tried most known exchanges binance, crypto.com etc none of them worked as Canadian banks and card issuers block crypto exchanges, any successful experience and reputed exchanges to buy btc with low fees in Canada will be greatly appreciated, I only found those  other sure how legit they are: mybtc.caHelp appreciated thanks..This means that crypto is not regularised in your country. So if you try to buy the coins using a centralised exchange, then definitely you will land up in trouble. I won’t recommend you exchanges that I haven’t tried, but you can go to P2P sites and can try to buy there.They just need basic KYC and you will be ready to buy Bitcoins from thousand of dealers through remitly or transferwise using your debit card or debit bank account. Try at paxful or localbitcoins .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 01, 2022, 07:28:47 PM",
      "body": "A strange question.. i think you know about P2P or may be you have ever heard about the largest crypto exchanges as Binance Coinbase as you can easily buy Bitcoins from there as its so simple now a days to buy Bitcoin with Fiat money as even now Visa alllows to buy Bitcoin directly into your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "November 02, 2022, 12:23:53 PM",
      "body": "Quote from: aliitp2 on October 31, 2022, 10:27:14 AMI need to buy some btc for a family member in Canada using Canadian Bank debit card, I tried most known exchanges binance, crypto.com etc none of them worked as Canadian banks and card issuers block crypto exchanges, any successful experience and reputed exchanges to buy btc with low fees in Canada will be greatly appreciated, I only found those  other sure how legit they are: mybtc.caHelp appreciated thanks..You have to first be specific about the city in Canada you want to buy the Bitcoin. I've read about this exchanges having restrictions on some cities and locations in Canada.I wanted you being specific about your location because I think Canada has Bitcoin machine around some major cities and since you want to use a debit card, you can firstly make a Fiat withdrawal possibly through an ATM and then you proceed to using a physical Bitcoin machine, if you have anyone closer to your the actual buyer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 02, 2022, 01:57:58 PM",
      "body": "If the payments are small, non-recurring and not limited to a certain time pattern, why not trade peer-to-peer, the process is easy, and you can do it here in the forum (just be careful, always ask here and don't believe anyone because scammers are many)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aliitp2",
      "created_time": "November 02, 2022, 05:58:14 PM",
      "body": "Quote from: GeorgeJohn on October 31, 2022, 02:15:56 PMQuote from: aliitp2 on October 31, 2022, 10:27:14 AMI need to buy some btc for a family member in Canada using Canadian Bank debit card, I tried most known exchanges binance, crypto.com etc none of them worked as Canadian banks and card issuers block crypto exchanges, any successful experience and reputed exchanges to buy btc with low fees in Canada will be greatly appreciated, I only found those  other sure how legit they are: mybtc.caHelp appreciated thanks..Since their is a restrictions of so many of this exchanges to process buying of cryptocurrency over there, i think the best thing to do concerning these, is to use VPN, because it's like cryptocurrency is not supported in such country by using of the direct ip address of the country to operate on exchange like binance. its not about VPN as i said i need to use my CANADIAN issued debit card to purchase crypto, and most if not all canadian banks block transactions from crypto EXCHANGES !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aliitp2",
      "created_time": "November 02, 2022, 05:59:45 PM",
      "body": "Quote from: BitMaxz on October 31, 2022, 11:12:12 PMI heard there are lots of Bitcoin ATM in Canada why not withdraw money instead from the Bank ATMs? And then buy Bitcoin directly to Bitcoin ATMs(Cash to Bitcoin).Check the list of cities in Canada below if there is Bitcoin ATM near you.- https://coinatmradar.com/country/38/bitcoin-atm-canada/they charge at least 10% commission +other fees trust me i asked them !...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "November 02, 2022, 06:29:17 PM",
      "body": "Quote from: aliitp2 on November 02, 2022, 05:59:45 PMthey charge at least 10% commission +other fees trust me i asked them !...How many ATM owners did you try to ask?At least you tried it with 3 different owners to make sure about the commission fee. There are some ATMs only ask for a 2% to 5% commission fee you might just be unlucky today to find them.How about the list from here https://bitcoin.org/en/exchanges#north-america I hope some of them will work with less fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "November 02, 2022, 09:48:23 PM",
      "body": "Have you tried asking the locals in r/BitcoinCA? it's likely that they would know better.Their wiki is also worth checking for exchanges you may have overlooked, see: https://www.reddit.com/r/BitcoinCA/wiki/index/#wiki_buy_bitcoin.3A",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 03, 2022, 01:59:22 AM",
      "body": "Quote from: aliitp2 on November 02, 2022, 05:59:45 PMthey charge at least 10% commission +other fees trust me i asked them !...And mybtc.ca rates are better?Current rates for card purchases are at 1BTC=CA$ 31870, spot prices are  CA$ 27739, you're already paying a 14% premium on it.Coinstation has way better rates:https://www.coinstation.ca/en/locations/$ 29888 ($ 1 + 7.8%*)Anyhow, try bitbuy.ca, they are fully licensed but be aware they require and id even for express verification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "November 03, 2022, 03:51:54 AM",
      "body": "You might as well use an exchange like Kraken and just do a bank transfer. You can use other exchanges like Gemini or Binance but you need to do a wire transfer for those which is more work.Yes you will need to KYC but you need to show ID at most Bitcoin ATMs anyways. At least that’s how it is in my province. Gone are the days when you could buy thousands at the ATM without KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "November 03, 2022, 04:10:16 AM",
      "body": "Quote from: adaseb on November 03, 2022, 03:51:54 AMYou might as well use an exchange like Kraken and just do a bank transfer. You can use other exchanges like Gemini or Binance but you need to do a wire transfer for those which is more work.The OP said he/she has tried almost known exchange binance, crypto.com but the Canadian bank and credit card company block every transaction that has to do with crypto exchange since this happened I don't think Kraken or Gemini exchange will work. What the OP need will be a Canadian local crypto exchange and if the bank/credit card company block the transaction then the best option is P2P on Binance or a reputable DEX that offer P2P crypto trading because the bank doesn't want to handle any transaction that has to do with crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}