{
  "id": "topic_5523503",
  "title": "DPHOR",
  "author": "DPHOR",
  "created_time": "December 19, 2024, 06:07:54 PM",
  "content": "Yesterday was passing through and reading some interesting news on twitter (x) I came across the tweet of Robert Kiyosaki, the Author of \"Rich Dad Poor Dad\" tweeting his concerns about bitcoin to hit $350k by 2025.I want to know, is this tweet specifically for his interest as he is already holding or what?Let discuss why he though that amount is possible next year. But then another respond to his tweet got my attention which i also needs to show here.Do you think we have another bitcoin critic?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5523503",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "December 19, 2024, 06:53:43 PM",
      "body": "Quote from: DPHOR on December 19, 2024, 06:07:54 PMLet discuss why he though that amount is possible next year. But then another respond to his tweet got my attention which i also needs to show here.You can't discuss someone's prediction except they give more information behind their thought process. I can say I think Bitcoin will get to $150k before the end of December, that's just a random number, nothing to pull out from that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "December 19, 2024, 06:56:02 PM",
      "body": "bitcoin could reach $350k or more than that or less than that, no one knows for sure how the price of bitcoin will be in 2025. so an investor needs to understand the risks to the assets they invest in, because no one knows for sure the intention of someone saying something positive about bitcoin, it could be just to support their interests or they really care about it. just be smart, don't follow people's words carelessly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 19, 2024, 06:58:13 PM",
      "body": "Robert Kiyosaki does not know how to make good bitcoin price prediction. I have noticed from his post on X. But I noticed what he did not get wrong. That bitcoin is an appreciative asset that its value will be increasing over long period of time. Bitcoin may not increase up to $200 thousand in 2025 but bitcoin will one day get to $350000 and more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "December 19, 2024, 07:25:36 PM",
      "body": "Quote from: DPHOR on December 19, 2024, 06:07:54 PMDo you think we have another bitcoin critic?There are more critics than you can encounter. There will always be critics no matter how much adoption bitcoin gets or world wide usage it gets. I only engage critics who have constructive arguments, the screenshot you shared does not contain any constructive criticism so should be ignored and not further shared, giving it some credibility.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "December 19, 2024, 07:40:52 PM",
      "body": "Robert Kiyosaki is a very knowledgeable man, but that doesn't mean his good at bitcoin prediction, his just one with good investment knowledge bitcoin price is pretty unpredictable but can be determined with technical analysis yet will only produce price in a close range not an exact price. 2025 we are going fully bullish which is certain but not price is certain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "December 19, 2024, 07:48:15 PM",
      "body": "Quote from: DPHOR on December 19, 2024, 06:07:54 PMI want to know, is this tweet specifically for his interest as he is already holding or what? Let discuss why he though that amount is possible next year. Yeah, Robert Kiyosaki is a Bitcoin hodler, but if I were you I wouldn't take what he said seriously because he's only speculating. No one knows what the peak price would be and I don't think $350k is feasible in 2025. Except you choose not to sell during the bull but if you'd, try not to be too greedy. Sell at a price that's profitable and realistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "December 19, 2024, 07:48:58 PM",
      "body": "No one knows.  The only thing we do know is that the trajectory over 15+ years has been up and anyone who has bought and held for any reasonable length of time has done well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "December 19, 2024, 08:35:16 PM",
      "body": "He has claimed he owns bitcoin so perhaps he actually does -- obviously, I can't confirm his holdings haha. I've always seen him supporting bitcoin as well.As for the price prediction, who knows lol. But in hindsight, such bull posting is pretty common when the market is so much up. You'd see more of them. Some may predict a so much bigger amount, too lol.The response tweet was from someone who doesn't know bitcoin and some basic economic principles so just ignore them. Good luck replicating bitcoin and hoping for the same amount of success or increasing its supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "December 19, 2024, 09:00:06 PM",
      "body": "Quote from: Potato Chips on December 19, 2024, 08:35:16 PMHe has claimed he owns bitcoin so perhaps he actually does -- obviously, I can't confirm his holdings haha. I've always seen him supporting bitcoin as well.As for the price prediction, who knows lol. But in hindsight, such bull posting is pretty common when the market is so much up. You'd see more of them. Some may predict a so much bigger amount, too lol.The response tweet was from someone who doesn't know bitcoin and some basic economic principles so just ignore them. Good luck replicating bitcoin and hoping for the same amount of success or increasing its supply.I can't recall, but he is also anti-Bitcoin in the beginning right? And then he suddenly flip in the last 4 years or so and then preaching about Bitcoin.And if I'm not mistaken, some of us might have heard his name before as a author, but again, in recent years, he suddenly appear in social media and predicting about this and that. He also predicting a financial crash every year, and so I'm not sure if I will listen to this guy or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "December 19, 2024, 09:26:04 PM",
      "body": "He is just like every other guy who makes a bitcoin prediction based on what they feel will happen and with present force chasing to own Bitcoin. $300k plus is a big amount, and I don’t think Bitcoin can cross that level next year. We are just a few days ahead to reach that 2025 Bitcoin needs a lot of support in order to even break through to $250k. Next year I would rather prefer to keep my speculation down below the $200k level; $100k was long speculated before it was finally reached. $350k can be achieved but not in 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "December 19, 2024, 09:56:43 PM",
      "body": "At this point, I think most of us are on board with the idea that 2025 could shape up to be a pretty solid year for Bitcoin.  But honestly, taking investing advice from Kiyosaki is sketchy at best - his track record on predictions makes him about as reliable as some used car salesman promising you the deal of a lifetime.  Although I did kind of dig that other forecast he threw out there about Bitcoin possibly hitting $10 million someday.Thats the kind of hyper-optimistic speculation I can get behind!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "December 19, 2024, 10:01:55 PM",
      "body": "Quote from: DPHOR on December 19, 2024, 06:07:54 PMI want to know, is this tweet specifically for his interest as he is already holding or what?Let discuss why he though that amount is possible next year.how would we know? did he show any basis for his opinion? to me it seems that he didn’t so like a lot of investors he is also just assuming or predicting there’s not much weight to his wordsQuoteDo you think we have another bitcoin critic?there are always bitcoin critics everywhere and this man whoever he is is not an exception he’s not special either because his reasoning is flawed he doesn’t care about bitcoin but others do which gives it its value and increases the demand for it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "December 19, 2024, 10:56:40 PM",
      "body": "Is Robert Kiyosaki even famous? I don't think many people outside the US know him, so his price prediction for Bitcoin doesn't seem worth talking about. And what does it mean that Trump is the Bitcoin president? That's ridiculous. Bitcoin could see $350,000. This could happen in 2025, or much later. But we can't tell from a single tweet why and for what reasons. On the internet, anyone can tweet and say a number. They can do this with thousands of tweets, and in the future they can keep only the one that happens and delete the others. Don't give importance to such tweets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "December 19, 2024, 11:14:45 PM",
      "body": "Quote from: DPHOR on December 19, 2024, 06:07:54 PMI want to know, is this tweet specifically for his interest as he is already holding or what?Let discuss why he though that amount is possible next year. But then another respond to his tweet got my attention which i also needs to show here.This might be the reason he talks about Bitcoin always because he's now a hodler. This is one way to spot a hodlers because of their constant talk about Bitcoin with the platforms they get as a known individual because they know they can have some impact on the way others picture Bitcoin as a good investment or not. They benefit from people investing and this doesn't happen to only Bitcoin but all investments that people with large audience invest into. Robert Kiyosaki is only giving out his own speculations on Bitcoin hence his words shouldn't be used as a sign to make purchases of Bitcoin that you're not already to hodl. Bitcoin is going to increase buy it mightn't get to that price hence our minds shouldn't be thinking about that price only before we get disappointed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "December 19, 2024, 11:30:09 PM",
      "body": "Robert Kiyosaki is a good author, but he is not a good predictor with btc price. Or let’s say no one does a good and right prediction with bitcoin seeing how unpredictable it is. Although I’ve no doubt that $350k will be achieved one of these days, but if we are talking about price prediction by 2025, I prefer to predict bitcoin price reaching $150k-$180k, that’s how I see bitcoin. We can make various predictions, but much better if we can create a more practical and realistic one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "finaleshot2016",
      "created_time": "December 19, 2024, 11:37:00 PM",
      "body": "Bitcoin’s move is kinda unpredictable at the moment, no one knows wether it will reach 350k or just below than that. It’s a prediction after all, it can be wrong and it can be right at the same time. In theory, if all of the countries supported bitcoin, it’s possible and can happen but of course some countries are having a hard time for crypto’s regulation. Even if your profession is related to finance, a prediction is just a prediction, a lot can happen in tha span of 2025, we should just wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "December 19, 2024, 11:50:29 PM",
      "body": "Quote from: DPHOR on December 19, 2024, 06:07:54 PMI want to know, is this tweet specifically for his interest as he is already holding or what?Let discuss why he though that amount is possible next year. But then another respond to his tweet got my attention which i also needs to show here.Everyone has their own beliefs, even a few years ago there was someone who predicted the price of Bitcoin to be 1 million dollars, and let anyone say what they believe including the people who replied to his tweet. It seems like he does have it, if not then he is the one who loses because he does not get the benefit of the increase in the price of Bitcoin that he predicted",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 19, 2024, 11:53:48 PM",
      "body": "Quote from: DPHOR on December 19, 2024, 06:07:54 PMI want to know, is this tweet specifically for his interest as he is already holding or what?He's been holding for few years already, as well as other physical gold, silver and he's been bullish to bitcoin since then and keep posting like this — a mere speculation without giving any supporting text or even dates, he will just say it will go there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "December 20, 2024, 02:12:48 AM",
      "body": "Quote from: DPHOR on December 19, 2024, 06:07:54 PMYesterday was passing through and reading some interesting news on twitter (x) I came across the tweet of the Author of \"Rich Dad Poor Dad\" tweeting his concerns about bitcoin to hit $350k by 2025.I want to know, is this tweet specifically for his interest as he is already holding or what?Any predictions made is base on speculation and any one has the right or liberty to make their prediction and I don't see his speculation different from others because others has made such proclamation of higher figure or less. Bitcoin hitting $350k is even least compared to the speculated price of $1m. Quote from: DPHOR on December 19, 2024, 06:07:54 PMLet discuss why he though that amount is possible next year. But then another respond to his tweet got my attention which i also needs to show here.Athough there are speculation roaming about Donald  Trump making bitcoin a Federal Reserve asset by 2025 and many believe it will be massive just as Michael saylor of microstrategy has been doing. And people believe this will increase the level of adoption by next year and that this will push bitcoin so high. But for now everything remains a speculation until igbjs implimented. But even as that we expect more from bitcoin. Then his second statement should not give us any concerns still. Because many people find no good reason to invest in a digital asset but just find themselves investing and complaining and still making profit.  I call them profitable critics, who maximize the use of bitcoin and sound thus like they don't fucking care about digital assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}