{
  "id": "topic_5453759",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "May 23, 2023, 11:05:29 AMLast edit: May 23, 2023, 11:58:02 AM by NotATether",
  "content": "Source: https://lightning.engineering/posts/2023-05-16-taproot-assets-v0.2/https://cointelegraph.com/news/lightning-labs-launches-updated-protocol-bitcoin-brc20-congestionI hope everyone here agrees with me that writing Ordinals/BRC20 in the blockchain using JSON is a massive space monster. (You might also believe that Ordinals are negative in their entirety and should be removed. Well there's another thread on this board for saying that.)The good news is that Lightning Labs appears to have actually done something about this mess.First off, Taproot Assets is actually just Taro, but they had to change the name.Second, This is a new version of Taproot Assets (v0.2) with a far more efficient way of storing the Ordinals, but on the Lightning network and not the mainnet.So if you are a \"Layer 1 purist\", this release will be very good for you, provided that someone can convince all these shitcoiners to move their tokens there.Also, if you happen to be the one guy on this forum who hates LN, this is also good news for you because it will soon become \"business as usual\" on Layer 1 (and that is all you need to know, you may promptly bow out of this thread now).There's just one problem with this. Lightning adoption needs to be more widespread for this to work, or else the very spammers who are supposed to be using this protocol will never hear about it.That means more wallets, and more advocation for Lightning Network wallets going forward.Of course, it is semi-known around here that custodial LN channels are more usable than the non-custodial variants. So if you want to start with the onboarding immediately, you can send these Ordinals users to these kind of Lightning wallets without worry. As judging by their antics, they are probably minting BRC-20 using a custodial Bitcoin wallet anyway.*edited for spelling",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453759",
  "comments": [
    {
      "author": "_act_",
      "created_time": "May 23, 2023, 11:21:59 AM",
      "body": "Quote from: NotATether on May 23, 2023, 11:05:29 AMI hope everyone here agrees with me that writing Ordinals/BRC20 in the blockchain using JSON is a massive space monster. (You might also believe that Ordinals are negative in their entirety and should be removed. Well there's another thread on this board for saying that.)I can agree that some people may buy some of the tokens and lose, while some people may gain. Despite the negative aspects, there are tokens existing on other blockchains.Bitcoin miners are profiting from transaction fee than ever before. It is a good thing that we are seeing ways that bitcoin mining reward can be replaced fully by transaction fee. I read about this on cointelegraph or a one news before, but I do not know they will be fast to do this. Thanks that some developers are finding alternative ways, not that something good should be eradicated with censorship from developers.I wish bitcoin will continue to be decentralized as it is now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "May 23, 2023, 11:32:22 AM",
      "body": "Quote from: NotATether on May 23, 2023, 11:05:29 AM....There's just one problem with this. Lightning adoption needs to be more widespread for this to work, or else the very spammers who are supposed to be using this protocol will never hear about it.That means more wallets, and more avocation for Lightning Network wallets going forward.Of course, it is semi-known around here that custodial LN channels are more usable than the non-custodial variants. So if you want to start with the onboarding immediately, you can send these Ordinals users to these kind of Lightning wallets without worry. As judging by their antics, they are probably minting BRC-20 using a custodial Bitcoin wallet anyway.Actually, most people getting into Ordinals/BRC20 are the same people who got into IEOs, ICOs, and everything else and have NO idea what any of it is. They just know it's te next big thing and have FOMO. So they use whatever wallet / app that the person talking about it on YouTube / Telegram or wherever tells them to.So in the end they will move to whatever wallet is being talked about by whatever scammer is doing the talking that day.Kind of like the people that go and buy gold because the commercial on TV told them it was a good investment.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "May 23, 2023, 02:38:29 PM",
      "body": "i quote here OmegaStarScream's post, which has already mentioned this a few days ago:Quote from: OmegaStarScream on May 20, 2023, 08:04:50 PMSomeone from the Arabic local board just brought this to my attention[1]: It looks like Taro has rebranded to \"The Taproot assets\"[2] and released a new update (0.20.0v) a few days ago[1] https://bitcointalk.org/index.php?topic=5453391.0[2] https://docs.lightning.engineering/the-lightning-network/taproot-assets[3] https://github.com/lightninglabs/taproot-assets/releasesand no less a person than Micheal Saylor has also already commented on these brc20 tokenshttps://en.cryptonomist.ch/2023/05/23/micheal-saylor-brc-20-tokens-legal/i personally like the approach of taproot assets 0.20, because it moves the whole ordinals/brc20 thing to ln network and thus unburdens the blockchain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "May 23, 2023, 05:05:12 PM",
      "body": "I've been saying it all along: do this stuff on Lightning using RGB or Taro! It's better for everyone. Cheaper and faster for NFT users, no mempool congestion for L1 users who just want to efficiently spend / receive Bitcoin as well as Lightning operators that need to open new channels.Quote from: NotATether on May 23, 2023, 11:05:29 AMThere's just one problem with this. Lightning adoption needs to be more widespread for this to work, or else the very spammers who are supposed to be using this protocol will never hear about it.In case this motivated anyone to finally spin up their own Lightning node; here's my obligatory pitch (since the topic always gets pushed down quickly) for my (usually) up-to-date FULL NODE installation guide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "May 23, 2023, 10:20:41 PM",
      "body": "Well, finally. I hope all that NFT crap migrates to LN ASAP. I was going to send some BTC to another wallet today and my wallet kept telling me minimum fee not met. It turned out minimum fee today was about 18sat/byte! If the fee is lower than that, blockchain won't even accept the transaction! For my amount (not big) this fee was about 7-8% which was about 10% of the amount. I guess that's even more expensive than Paypal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "May 24, 2023, 02:53:12 AM",
      "body": "Taproot Assets is a highly interesting technology, but what I was missing until now was a really good \"ELI5\".I've found this video now (it's already a year old so I simply missed it), so I'll describe in this post what seems to be the main benefits of TA with respect to competing technologies (not only BRC-20 but also systems like Counterparty or OmniLayer).1) TA transactions look like regular Bitcoin (Taproot) transactions, which increases privacy. Due to the structure of transactions, a \"Merkle Sum, Sparse Merkle Tree\" (MS-SMT) embedded in a Taproot tree, it is easy to realize proofs (e.g. about token balances/quantities) without revealing other information like the transaction history.2) TA transactions can transfer multiple kinds of assets or tokens at a time, as they can all be stuffed into a MS-SMT. This also allows to issue tokens to multiple accounts in single and relatively small transactions. Thus also on-chain TA transactions need less blockchain space than the competitors. (I am not 100% sure about the first part, maybe somebody can confirm this  )3) There is a way to transfer TA assets over Lightning without all nodes between sender and receiver needing to support TA. As far as I have understood it, you need to be connected to a node which can do an atomic swap to Bitcoin, then route through Bitcoin Lightning nodes until another TA atomic swap node connected with the receiver of the payment. Basically you do 2 exchange operations in such a transfer, but as they're all instant it doesn't feel complicated. This looks however that some significant fees could be needed for the swaps, but for sure that depends on the liquidity of the token.What would be also interesting for me are common characteristics and differences with RGB (another Lightning-supporting token/smart contract protocol). The RGB documentation is even more technical than TA's, and it seems it's an even more abstract/low level protocol than TA. It was said that TA took some concepts from RGB and the dev team was even accused of plagiarism, but I don't know the details so I don't want to adhere to this claim or not",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "May 24, 2023, 08:10:55 AM",
      "body": "Quote2) TA transactions can transfer multiple kinds of assets or tokens at a time, as they can all be stuffed into a MS-SMT. This also allows to issue tokens to multiple accounts in single and relatively small transactions. Thus also on-chain TA transactions need less blockchain space than the competitors. (I am not 100% sure about the first part, maybe somebody can confirm this  )I can confirm that. If you have a commitment, then it can contain anything, even as large as 1 GB file, and it can be created, passed to someone, or destroyed. The only thing that goes on-chain is the connection between your data, and your Taproot address. However, because that connection is based on public key alone (and is never pushed on-chain), nobody knows if something is connected or not, if you won't tell them. Also note that you can easily detach any data, just by moving it once into some address that contains no commitments.Quote3) There is a way to transfer TA assets over Lightning without all nodes between sender and receiver needing to support TA. As far as I have understood it, you need to be connected to a node which can do an atomic swap to Bitcoin, then route through Bitcoin Lightning nodes until another TA atomic swap node connected with the receiver of the payment. Basically you do 2 exchange operations in such a transfer, but as they're all instant it doesn't feel complicated. This looks however that some significant fees could be needed for the swaps, but for sure that depends on the liquidity of the token.Yes, any commitment can be stored behind some public key. And then, revealing that public key alone will not tell someone, if it is just some regular key, or if it contains some hidden commitments. For that reason, nodes in the middle don't know if they are processing any other assets than just coins or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "May 24, 2023, 07:42:59 PM",
      "body": "i don't know if this belongs to this particular topic, but there is now the polar v2.0 release which now also supports the taproot assets protocol daemon (tapd) nodes. if it is out of place here i apologize and you don't need to pay attention to it...QuoteFeaturestapd: add support for Taproot Assets Protocol nodes by @amovfx & @jamaljsrin #641, #656. #661, #667, #668, #669, #672, #683, #684, #685, #703network: automatically mine new blocks by @Jhoyola in #707images: add support for LND v0.16.1-beta and v0.16.2-beta by @jamaljsr in #709docker: support docker-compose v2 + minor improvements by @jamaljsr in #721https://github.com/jamaljsr/polar/releaseshttps://lightningpolar.com/https://github.com/lightninglabs/taproot-assets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "May 24, 2023, 10:07:19 PM",
      "body": "Thanks @vjudeu for explaining. This seems indeed very similar to RGB then where you use transactions only for commitments (not for data publication), even if RGB is more \"general\" and not so much focused on tokens/assets. If I understand correctly then, the idea is keeping most data off-chain as long as possible, and only in case of a conflict pushing it onchain.I'm currently reading some more text about Taproot Assets and would like to emphasize that Taproot Assets has also a disadvantage. It seems it is necessary that payment senders interact with the receiver before a payment occurs, the receiver has to generate an address containing the hash of the Taproot script (in a similar way like with P2SH, but they have to provide some \"private\" data so that address can't be generated from the sender alone, if I understand correctly) before a payment can be sent. That's of course solvable by technology but the payment receivers have to be online every now and then, although probably not as much as with Lightning invoices/transfers (where sender and receiver afaik have to be online at the same time during the transaction).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 25, 2023, 10:48:19 AM",
      "body": "Quote from: cygan on May 24, 2023, 07:42:59 PMi don't know if this belongs to this particular topic, but there is now the polar v2.0 release which now also supports the taproot assets protocol daemon (tapd) nodes. if it is out of place here i apologize and you don't need to pay attention to it...QuoteFeaturestapd: add support for Taproot Assets Protocol nodes by @amovfx & @jamaljsrin #641, #656. #661, #667, #668, #669, #672, #683, #684, #685, #703network: automatically mine new blocks by @Jhoyola in #707images: add support for LND v0.16.1-beta and v0.16.2-beta by @jamaljsr in #709docker: support docker-compose v2 + minor improvements by @jamaljsr in #721https://github.com/jamaljsr/polar/releaseshttps://lightningpolar.com/https://github.com/lightninglabs/taproot-assetsNah it's definitely in-place , the more software that supports Taproot Assets, the smaller the chance some minter discovers BRC20 minting software which is currently hosted on only a few online webapps.Quote from: d5000 on May 24, 2023, 10:07:19 PMI'm currently reading some more text about Taproot Assets and would like to emphasize that Taproot Assets has also a disadvantage. It seems it is necessary that payment senders interact with the receiver before a payment occurs, the receiver has to generate an address containing the hash of the Taproot script (in a similar way like with P2SH, but they have to provide some \"private\" data so that address can't be generated from the sender alone, if I understand correctly) before a payment can be sent. That's of course solvable by technology but the payment receivers have to be online every now and then, although probably not as much as with Lightning invoices/transfers (where sender and receiver afaik have to be online at the same time during the transaction).Don't worry about it (for now). The current crop of shitcoiners are using BRC20 to transact via (drum roll please....) exchanges.That means the BRC20 transactions that are being done between users in these marketplaces are completely custodial. So in this particular case, the exchanges will definitely set it up as the sender interacts with the exchange who then sells the asset to the exchange, and the buyer does the same. Especially those who want to make \"NFT marketplaces\". Because exchanges always want to make fat commissions. This arrangement inadvertently works in our favor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "May 26, 2023, 08:33:30 AM",
      "body": "OP, but the problem, Ordinals/NFT users want to store their dick pics and fart sounds in a bank vault, not in a museum. They believe it's part of the attraction, and part of what makes them \"more valuable\". BUT I believe some of them, especially the plebs, will concede that the inefficiency and the fees are not worth the costs on their capital. It also gives speculators some opportunities to do some shitcoinery.Stacks has a token, STX, which might surge during the next bull cycle, and there's also another offchain/layer 2 network called MintLayer, which will have its own token soon. The most compelling one is LayerTwo Labs. No token, just Drivechains, https://layertwolabs.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "May 26, 2023, 01:34:13 PM",
      "body": "Quote from: DaveF on May 23, 2023, 11:32:22 AMActually, most people getting into Ordinals/BRC20 are the same people who got into IEOs, ICOs, and everything else and have NO idea what any of it is. They just know it's te next big thing and have FOMO. So they use whatever wallet / app that the person talking about it on YouTube / Telegram or wherever tells them to.So in the end they will move to whatever wallet is being talked about by whatever scammer is doing the talking that day.Kind of like the people that go and buy gold because the commercial on TV told them it was a good investment.-DaveNot untrue. Surprised me a many years back to hear some people \"had Bitcoin\" on eToro until I learnt later it was heavily advertised in London.First wallet I ever used was Electrum, quite literally because the first legible guide I liked and thought was the most useful and not annoying said to use Electrum. It's still the one I use today, but if I hadn't heard of Ordinals from this forum first, I'd be using OrdinalsWallet (which is what Google shows first and what YTers seem to like).So you're right. If LL's new Taproot Assets proves to be as good and easy to use as claimed, and is picked up by the YTers and influencers etc.Quote from: Wind_FURY on May 26, 2023, 08:33:30 AMThe most compelling one is LayerTwo Labs. No token, just Drivechains, https://layertwolabs.com/That anything to do with BIP300, 301 I'm hearing about lately?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BrianH",
      "created_time": "May 27, 2023, 11:55:11 AM",
      "body": "Quote from: NotATether on May 23, 2023, 11:05:29 AMI hope everyone here agrees with me that writing Ordinals/BRC20 in the blockchain using JSON is a massive space monster. (You might also believe that Ordinals are negative in their entirety and should be removed. Well there's another thread on this board for saying that.)Lightning would be a nice way to solve this BRC-20 bug problem. I am in favor of moving these transactions off chain. I saw this article a few days ago. Unfortunately, wishing it onto the Lightning network won't make it happen. 1. The Lightning network has less than 5% of transactions, by volume. It's not being used. Moving this to Lightning would at best only solve 5% of the problem.2. Quote from: Wind FURYOP, but the problem, Ordinals/NFT users want to store their dick pics and fart sounds in a bank vault, not in a museum. They believe it's part of the attraction, and part of what makes them \"more valuable\". Wind FURY nailed it. This spam only has value because it is being immortalized in something valuable - the Bitcoin blockchain. Unfortunately, this is coming at the cost of Bitcoin's original purpose as a peer-to-peer method of exchange. It is destroying it's value. This bug is acting more like a parasite that is killing it's host. Lightning is not a real solution and this BRC-20 bug needs to be patched.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 27, 2023, 12:40:15 PM",
      "body": "Quote from: BrianH on May 27, 2023, 11:55:11 AMQuote from: NotATether on May 23, 2023, 11:05:29 AMI hope everyone here agrees with me that writing Ordinals/BRC20 in the blockchain using JSON is a massive space monster. (You might also believe that Ordinals are negative in their entirety and should be removed. Well there's another thread on this board for saying that.)Lightning would be a nice way to solve this BRC-20 bug problem. I am in favor of moving these transactions off chain. I saw this article a few days ago. Unfortunately, wishing it onto the Lightning network won't make it happen. 1. The Lightning network has less than 5% of transactions, by volume. It's not being used. Moving this to Lightning would at best only solve 5% of the problem.2. Quote from: Wind FURYOP, but the problem, Ordinals/NFT users want to store their dick pics and fart sounds in a bank vault, not in a museum. They believe it's part of the attraction, and part of what makes them \"more valuable\". Wind FURY nailed it. This spam only has value because it is being immortalized in something valuable - the Bitcoin blockchain. Unfortunately, this is coming at the cost of Bitcoin's original purpose as a peer-to-peer method of exchange. It is destroying it's value. This bug is acting more like a parasite that is killing it's host. Lightning is not a real solution and this BRC-20 bug needs to be patched.I know I commented in some places that all this live money on these tokens is preventing us from pulling the plug, but come to think of it, if we can get even a slice of these users to dump their spam on some off-chain protocol instead, using one of the new technologies, then that would be a good time to push a \"deprecation\" of unlimited Taproot data size and eventually shut it down on the rest of those BRC20 holdouts. Whatever \"live money\" is left on these tokens can be treated the same way as (hypothetically) legacy ECDSA bitcoin addresses that are disabled in a post-quantum world.Because the general sentiment of the dev mailing list, is that currently nothing is going to happen. Perhaps they are thinking that because they might still see a use case in unlimited Taproot witness size.Now with these alternate technologies springing up like Taproot Assets, Ark, and others, when people eventually script those things creatively on those protocols, it will hopefully be agreed on by core devs that nobody has actually used Taproot witness size for anything useful and go along with its deprecation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 29, 2023, 08:03:37 PM",
      "body": "Quote from: NotATether on May 23, 2023, 11:05:29 AM Think of all the unbanked people in the world who can't even use these apps, with LN everyone could.I very much agree with you that ordinals are a waste of space in the block, but regarding the question of LN development I had already mentioned it in my thread that in my opinion we don't need new portfolios because we already have so many and those can be improved but more applications are needed.  For example there are many apps (I say some at random) Uber, Ebay or less common sites that use PayPal or credit cards or new payment systems always through Fiat, instead if we were able to implement a payment through LN that would be the real victory .  Think of all the unbanked people in the world who can't even use these apps, with LN everyone could.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "May 30, 2023, 03:23:01 AM",
      "body": "So, when you are using a taproot address, you are actually revealing your public key? Are we going backwards now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "garlonicon",
      "created_time": "May 30, 2023, 05:13:46 AM",
      "body": "QuoteSo, when you are using a taproot address, you are actually revealing your public key?Yes, of course. It is called \"public\" for a reason.QuoteAre we going backwards now?No, because if you want to make a multisig, which could be properly aggregated, then you need public keys. Even if you have some LN channel, and on-chain there is some P2WSH, then still, another party in your channel has to know your public key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 30, 2023, 07:10:57 AM",
      "body": "Quote from: garlonicon on May 30, 2023, 05:13:46 AMQuoteSo, when you are using a taproot address, you are actually revealing your public key?Yes, of course. It is called \"public\" for a reason.QuoteAre we going backwards now?No, because if you want to make a multisig, which could be properly aggregated, then you need public keys. Even if you have some LN channel, and on-chain there is some P2WSH, then still, another party in your channel has to know your public key.With regards to the layer 1 and not to any auxiliary layer such as LN, I thought the whole (or at least one of the main) purpose of Taproot addresses was that the Schnorr signatures used to make Taproot transactions prevent public key recovery in the first place.Quote from: mendace on May 29, 2023, 08:03:37 PMQuote from: NotATether on May 23, 2023, 11:05:29 AM Think of all the unbanked people in the world who can't even use these apps, with LN everyone could.Where did you get that quote from, because as far as the OP topic is concerned, I never wrote those things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "May 30, 2023, 07:21:00 AM",
      "body": "Quote from: NotATether on May 30, 2023, 07:10:57 AMQuote from: mendace on May 29, 2023, 08:03:37 PMQuote from: NotATether on May 23, 2023, 11:05:29 AM Think of all the unbanked people in the world who can't even use these apps, with LN everyone could.Where did you get that quote from, because as far as the OP topic is concerned, I never wrote those things.I didn't say you wrote this I'm just motivating my comment.  If you read what I wrote then you should understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}