{
  "id": "topic_5473801",
  "title": "mineshop.eu",
  "author": "mineshop.eu",
  "created_time": "November 12, 2023, 12:05:15 PM",
  "content": "📦 First Look: IceRiver KS0 Pro 200gh/sWe recently got our hands on the IceRiver KS0 Pro, a new ASIC miner for Kaspa Coin. Let’s explore what makes this miner stand out.🔍 Design: Sleek and EfficientThe KS0 Pro looks similar to its predecessor, but it’s much more powerful. It boasts a mining power of 200 GH/s, doubling the performance of the original KS0.🎁 Inside the BoxThe package includes:The KS0 Pro miner.A strong power supply unit.An EU socket power adapter.A 120 mm cooling fan(not included in box but mandatory) to keep the miner cool, especially important since this version is overclocked for better performance.🛠 Easy SetupSetting up is simple. The power supply can handle up to 120 watts. Connect the cooling fan via USB, add the network cable, and you’re all set.🚀 Surpassing ExpectationsWhen we connected the KS0 Pro to a mining pool, it performed even better than advertised. It consistently hit 210 GH/s at just 90 watts. Chip temperatures stayed around 50-60°C, showing great heat management.🏠 Quiet and Perfect for Any SpaceWhat’s really impressive is how quiet the KS0 Pro is. It’s perfect for home or office use and doesn’t use much power, making it economical for long-term mining.💰 Kaspa Coin Mining: Worth Your InvestmentKaspa Coin is gaining traction, and the KS0 Pro is a great tool for both new and experienced miners. Its efficiency and low noise make it ideal for residential mining. Currently mining 6usd worth of KASPA coins.🌟 Our VerdictAfter extensive testing, we believe the KS0 Pro is a smart choice for anyone interested in crypto mining. It’s powerful, efficient, and quiet, making it suitable for various environments. As Kaspa Coin grows, the KS0 Pro is your key to getting involved in this exciting market.Stay tuned for more on the latest in crypto mining. The IceRiver KS0 Pro isn’t just a miner; it’s your gateway to efficient and accessible cryptocurrency mining. 🚀🔥🌐This sample Iceriver KS0 Pro 200Gh/s is currently mining and you can follow the mining performance in LIVE HERE. https://youtu.be/5KD3yKa6ouM?si=TbrQj2xGKg_ZVK82",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473801",
  "comments": [
    {
      "author": "FP91G",
      "created_time": "February 01, 2024, 08:09:02 AM",
      "body": "Free firmware for ASIC. Who checked?340Ghs firmware on KS0 Pro & Thermalshttps://www.youtube.com/watch?app=desktop&v=eBOlvy3JygU&noapp=1&ab_channel=SerpentXTechToday we push this Iceriver KS0 Pro Kaspa miner to 340 Ghs! However, we recommend you replace the thermal paste, and pads, and add heatsinks to the four main MOSFETs before doing so.Modified firmware for all IceRiver ASICs except KS0Pro, adding overclocking, voltage control and other goodiesCustomizable OC/OV, small fee benefitting the community, no unnecessary changes to your device.Firmware files can be downloaded from the Releases section on the right hand side of this page.If you have any issues, finding me (pbfarmer) in the Kaspa Discord will probably result in the fastest response/resolution.https://github.com/rdugan/iceriver-ocThird-party firmware can turn your ASIC into a brick. Be sure to read all the information before installing the firmware.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ccplz",
      "created_time": "February 01, 2024, 01:56:54 PM",
      "body": "Quote from: FP91G on February 01, 2024, 08:09:02 AMFree firmware for ASIC. Who checked?340Ghs firmware on KS0 Pro & Thermalshttps://www.youtube.com/watch?app=desktop&v=eBOlvy3JygU&noapp=1&ab_channel=SerpentXTechToday we push this Iceriver KS0 Pro Kaspa miner to 340 Ghs! However, we recommend you replace the thermal paste, and pads, and add heatsinks to the four main MOSFETs before doing so.Modified firmware for all IceRiver ASICs except KS0Pro, adding overclocking, voltage control and other goodiesCustomizable OC/OV, small fee benefitting the community, no unnecessary changes to your device.Firmware files can be downloaded from the Releases section on the right hand side of this page.If you have any issues, finding me (pbfarmer) in the Kaspa Discord will probably result in the fastest response/resolution.https://github.com/rdugan/iceriver-ocThird-party firmware can turn your ASIC into a brick. Be sure to read all the information before installing the firmware.There is no free ks0 pro firmware afaik. The one you linked at the bottom is for normal ks0. I am using one of the paid ones for ks0 pro and I'm doing 290 gh by just getting a good fan and unscrewing the sides. I bought that fw for 250 KAS. I have also ordered the heatsinks from ebay and will upgrade to the 340 gh firmware when they arrive. No issues so far, as stable as they come",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sxemini",
      "created_time": "February 05, 2024, 11:29:30 AM",
      "body": "It is not worth. You paid 250 Kas for a firmware + heatsinks .... to make 3 or 4 kas more and this will go down for sure. So how long do you need to get this 250 Kas back? Same for purchase. $349 = 3500 Kas, how long need a KS0 to mine 3500 Coins and the difficulty increasing everyday?Don´t buy Kas Asics, always better to buy the coins because of the increase of hashrate and this will continues. Keep in mind you can only mine Kas with this Asics",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mineshop.eu",
      "created_time": "February 17, 2024, 12:43:28 PM",
      "body": "Quote from: sxemini on February 05, 2024, 11:29:30 AMIt is not worth. You paid 250 Kas for a firmware + heatsinks .... to make 3 or 4 kas more and this will go down for sure. So how long do you need to get this 250 Kas back? Same for purchase. $349 = 3500 Kas, how long need a KS0 to mine 3500 Coins and the difficulty increasing everyday?Don´t buy Kas Asics, always better to buy the coins because of the increase of hashrate and this will continues. Keep in mind you can only mine Kas with this AsicsIf anyone only had a crystal ball .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}