{
  "id": "topic_5446765",
  "title": "betzus",
  "author": "betzus",
  "created_time": "March 29, 2023, 10:45:25 AMLast edit: August 10, 2023, 01:40:23 PM by betzus",
  "content": "betzus.com - Online Casino,Sportsbook,Slots,Games About betzus* Fully licensed by government of Curaçao. * Crypto & Fiat Casino.* Over 5000 Games.* Instant Deposits and Withdrawals.* 24/7 customer support. Loyalty Club* Play to earn points, and climb through the levels.* Start earning points from the first cent you spend. Bonuses* Get a 100% deposit bonus on your first four deposits, up to $2000 each.* Unlock an extra 100% bonus on your won bet when you correctly predict 10 positions in a single bet.* Boosted Odds on selected matches.  Sports Book* Experience the ultimate sports betting thrill at our sports book. With us, you'll find the best odds available, ensuring that you get the most out of your wagers. Whether it's football, basketball, tennis, or any other sport, we offer a wide range of positions for you to bet on, so you can support your favorite teams and players. Plus, we keep the excitement going with regular promotions and bonuses exclusively for our sports book users.  Game providers* Experience a premium gaming selection at betzus. Featuring top game providers like Playtech, Pragmatic Play, Yggdrasil, Red Tiger, Evolution, and more. Security * At betzus, we prioritize the security of our players above all else. With our commitment to safe transactions and ensuring your anonymity, we take great care to  protect your privacy and ensure that your sensitive data remains secure. Reach us at* betzus.com* Twitter.com/betzuscom* Instagram.com/betzuscomOn behalf of Team betzus, we wish all of our players an entertaining and fun-filled gambling experience. Good luck to each and every one of you! Let's keep this thread alive! Share your thoughts, ask questions, and join the active discussions. Together, we'll make the betzus community thrive!Start Earning Loyalty Club Points from your 1 cent bet on betzus.com become Our Loyalty Club Member.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446765",
  "comments": [
    {
      "author": "Hirose UK",
      "created_time": "March 29, 2023, 11:42:04 AM",
      "body": "Welcome to the forum.From the casino that you are promoting and which will be launched soon, it looks very attractive, plus there is a deposit bonus which is quite large, even reaching a value of 1 Bitcoin and there are 4 times the deposit bonus that is given.In addition, your casino accepts not only crypto but also fiat currency which can provide more currency options for gamblers who will make deposits.Your promotional image contains the theme of roulette, cards and dice. Will these three games be the flagship games of your casino?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "March 29, 2023, 11:43:00 AM",
      "body": "Hi Betzus!Welcome to BitcoinTalk Forum. The design of the casino looks decent. I liked the animated game images. Look like you guys support a lot of Fiat payment methods. I checked your General Terms and Condition[1] page and searched for a few things. I was looking for if your casino restricts VPN usage. But I wasn't able to find any information about it. I searched the Keyword \"KYC,\" and still, there was nothing. But in 2.1.1, you described that players must write their accurate information, including their residential address, which is a part of KYC. Does it mean players have to verify their identity on registration? [1] https://www.betzus.com/en/?helpPageContent=45420",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "March 29, 2023, 11:55:48 AM",
      "body": "hi betzus, welcome to the forum, even though this site has been registered since 2017 but this is your first ANN thread on this forum.  loading of this site is very fast in my browser, apart from that the UI/UX also looks professional, it seems that your site also requires KYC on users.  do you guys have any more vigorous marketing plans in this forum, there are a lot of great campaign manager options available in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "March 29, 2023, 12:08:02 PM",
      "body": "You are welcome onboard the bitcointalk platform. It is nice having you here. At first I will commend you for taking such step by getting a copper member account this shows you are a good marketer who abide by rules. With this members here can have a view of how your casino looks like before attempt.I tried accessing your website from my end but to no avail as it is inaccessible. Do you have restrictions on countries and if you do can you let us know. Do you conduct KYC for members too ? If yes at what point is the KYC needed? Tell us so we could know.As a matter of fact, you are new here as you are yet to gain recognition and popularity here but in other to get that, I will suggest you do a campaign because you will have other casinos to contend with if you must remain relevant in this platform, you must seek the expertise of a good campaign manager @Royse777 for your campaign management.Lastly, o assume you are the representative of this casino and this should be your official announcement thread for your casino so I would advise you to be active online in responding to members here as this will tell how fast and responsive your customer care service is because members here pay attention to it as it has to do with their funds and care as well.Once again welcome onboard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 29, 2023, 12:12:38 PM",
      "body": "Your website design looks good and welcome you to the forum.I saw you already bought a Copper Membership but has yet maximized its use cases. I advise you to make a better graphics for your announcement as the current one looks is not professional and attractive enough. In case you want to find someone doing it for you, let's check [Overview] Bitcointalk services from Bitcointalk members like jayce, icalical.If you want to advertise via a signature campaign, I can help you with my service. Feel free to contact me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "March 29, 2023, 12:54:08 PM",
      "body": "Quote from: macson on March 29, 2023, 11:55:48 AMhi betzus, welcome to the forum, even though this site has been registered since 2017 but this is your first ANN thread on this forum.  loading of this site is very fast in my browser, apart from that the UI/UX also looks professional, it seems that your site also requires KYC on users.  do you guys have any more vigorous marketing plans in this forum, there are a lot of great campaign manager options available in this forum.Where do you read this site was operated since 2017? if you check below of the site, it's operated since 2022 which is a fairly new casino.I don't have any connection issue, but the site doesn't loaded fast in my PC, I tried to create a new account but sadly I always got a message to reload the page, not sure what's the reason behind this.Signature campaign can help promoting their brands, but if it's not long term it's will be useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "March 29, 2023, 01:05:22 PM",
      "body": "Quote from: macson on March 29, 2023, 11:55:48 AMhi betzus, welcome to the forum, even though this site has been registered since 2017 but this is your first ANN thread on this forum.  loading of this site is very fast in my browser, apart from that the UI/UX also looks professional, it seems that your site also requires KYC on users.  do you guys have any more vigorous marketing plans in this forum, there are a lot of great campaign manager options available in this forum.They should have one, even if not right away a casino that have been existing for five years should already have done the right thing opening announcement here, I wonder why it took you so long to launch an announcement here unless this is a new owner but anyway it's not yet late.  I just wonder, if it's true that your casino is running for over 6 years why there's little information available online about your casino, I just want to clarify if this is a new casino and it's the domain that is 6 years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 29, 2023, 01:26:50 PM",
      "body": "Alright, let me give my little feedback from what I have seen so far although I have created an account yet for two reasons although the second reason is out of FOMO.Let me start be commending you guys on the user interface, the design is cool for the eyes, it's not too bright and also the dark nature makes it less detrimental to the eyes.I tried creating an account but had to stop because of the promotion code space, I thought maybe since you created an ANN thread here and probably would be needing more traction to the website you could atleast try to create a promotion code for bitcointalk member that way most of us might be tempted to register and try out the casino thoroughly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panjul07",
      "created_time": "March 29, 2023, 01:55:15 PM",
      "body": "Quote from: Apocollapse on March 29, 2023, 12:54:08 PMSignature campaign can help promoting their brands, but if it's not long term it's will be useless.Useless or not is not depending on how long the campaign runs, long terms campaign can be useless as well if the site itself can compete with other existing casinos. Always bear in mind that signature campaign is just a marketing tool to make people aware about the casino but what makes people attracted to be customers is always depending on what are offered by the casino. Quote from: Apocollapse on March 29, 2023, 12:54:08 PMI don't have any connection issue, but the site doesn't loaded fast in my PC, I tried to create a new account but sadly I always got a message to reload the page, not sure what's the reason behind this.It load fast for me, I can create a through away account (for checking purpose) without any issue. Your connection must be a bit unstable when you tried it so you always get message to reload the page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "March 29, 2023, 02:48:35 PM",
      "body": "Quote from: Apocollapse on March 29, 2023, 12:54:08 PMQuote from: macson on March 29, 2023, 11:55:48 AMhi betzus, welcome to the forum, even though this site has been registered since 2017 but this is your first ANN thread on this forum.  loading of this site is very fast in my browser, apart from that the UI/UX also looks professional, it seems that your site also requires KYC on users.  do you guys have any more vigorous marketing plans in this forum, there are a lot of great campaign manager options available in this forum.Where do you read this site was operated since 2017? if you check below of the site, it's operated since 2022 which is a fairly new casino.I don't have any connection issue, but the site doesn't loaded fast in my PC, I tried to create a new account but sadly I always got a message to reload the page, not sure what's the reason behind this.Signature campaign can help promoting their brands, but if it's not long term it's will be useless.[1] https://lookup.icann.org/en/lookupi use the tools above to see when a site has been registered and betzus has been registered since 2017 but was updated in January 2023 past.what about your account now, are you able to register?  i just created an account on this site and I didn't encounter any problems!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "March 29, 2023, 03:03:14 PM",
      "body": "Quote from: Hirose UK on March 29, 2023, 11:42:04 AMWelcome to the forum.From the casino that you are promoting and which will be launched soon, it looks very attractive, plus there is a deposit bonus which is quite large, even reaching a value of 1 Bitcoin and there are 4 times the deposit bonus that is given.In addition, your casino accepts not only crypto but also fiat currency which can provide more currency options for gamblers who will make deposits.Your promotional image contains the theme of roulette, cards and dice. Will these three games be the flagship games of your casino?Sounds too good to be true. But maybe they have huge capital to start with. They would need more than just a signature campaign to build trust when something is not true about this generous deposit bonus offer. More than just the vouches of reputable users. I have to refresh it over and over because the website seems loaded with huge size images. Quote503 Service UnavailableNo server is available to handle this request.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "March 29, 2023, 03:17:11 PM",
      "body": "Welcome to the forum betzus, check directly on your gambling site and it's quite impressive to see the appearance of your gambling site. All of them load quickly when checking one tab to another, only the sports section will load longer than the other sections, even when refreshing it just keeps loading with nothing to show, is sports betting not available yet? because if it's because of my internet connection then all the parts shouldn't load perfectly, and also when trying to register by click register button will popup a notification about the internet connection and refreshing the sites several time doesn't change anything, while my internet connection is fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "March 29, 2023, 03:20:36 PM",
      "body": "The casino is not accessible when I click the link attached on the main thread. You should use the official website and not a tracking link because it’s not working. Quote from: betzus on March 29, 2023, 10:45:25 AMOnly on betzus you CAN HAVE 100% deposit bonus up to 1BTCAll casino has this kind of bonus feature. This is the most common promotion being offered by the casino and some of them offer higher bonus percentage. Using only is not appropriate because there’s no exclusivity on this.I don’t understand the bonus structure of your bonus deposit program, You are offering up to 1BTC as bonus but only 2000$ when using other currency?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "March 29, 2023, 03:25:52 PM",
      "body": "Welcome to bitcointalk forum!I think you made a mistake with some website links posted above in first post, it is sending me to error page and showing 400 Bad Request text, so maybe try fix this and edit post with correct link.I like that you are offering MMA sports betting, there are UFC; Bellator, PFL, Rizin and others available, but I want to see more options for that, not just 1 or 2 bet.Can you pitch me your best line why I should try Betzus casino if I am happy with other casinos I am using now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "March 29, 2023, 04:11:59 PM",
      "body": "Quote from: panjul07 on March 29, 2023, 01:55:15 PMUseless or not is not depending on how long the campaign runs, long terms campaign can be useless as well if the site itself can compete with other existing casinos. Always bear in mind that signature campaign is just a marketing tool to make people aware about the casino but what makes people attracted to be customers is always depending on what are offered by the casino. I would say the same. The signature Campaign should be to make aware of their existence. Do not expect massive traffic from the signature campaign. Signature campaigns show the capability of casinos. It will build its reputation on the forum day by day. If they expect significant result from signature campaign within a couple of weeks, I would say don't go for it. Signature campaign is not to boost traffic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "March 29, 2023, 04:25:17 PM",
      "body": "Welcome to the world wide forum. The first link is not working but the second link is ok and the graphic designer is very good. I believed the purpose of coming to the forum is to make more advertisements for more popularity and that aim will be achieved by hiring a manager to do the needful. Your games are are good to play. Quote from: notblox1 on March 29, 2023, 03:25:52 PMI think you made a mistake with some website links posted above in first post, it is sending me to error page and showing 400 Bad Request text, so maybe try fix this and edit post with correct link.The Betzus.com is working so you can check there to see the features of the casino website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sujonali1819",
      "created_time": "March 29, 2023, 04:53:28 PM",
      "body": "Welcome to bitcointalk community. It's another new casino that is starting to promote them here. Best of luckI have visited the site, Looks smooth to me and the whole design of the site is really cool. The registration process is also quite simple. At first look, I also noticed the site is accepting a lot of fiat payment methods besides crypto like Bitcoin, USDT, and Litecoin. So this is also a positive vibe for the player.BTw the announcement thread design could be cooler than what you have now. You can hire a designer or contact me I will help to do it. And other things to get a good result while you are entering into this forum, you should start to run some promotional campaigns like a signature campaign. This helps a lot for projects if you can run a campaign in a proper way like a good budget, a good campaign manager, and for long duration. Regarding Marketing campaign if you need more info , you can pm me here or in Telegram @sujonali1819. I will try my best to help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "March 29, 2023, 06:59:34 PM",
      "body": "Hello and welcome to the forum.Your Ann's design looks good but could be better with a little touch. Having said that, your term and condition say \"registered as a player, an individual must register personally and submit an application registration\" Does it include ID?Nonetheless, I hope you intend to market your casino on this forum and if yes, you hit me up for Bitcointalk marketing with the right tactics. Best wishes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "March 29, 2023, 08:29:14 PM",
      "body": "Quote from: Mate2237 on March 29, 2023, 04:25:17 PMThe Betzus.com is working so you can check there to see the features of the casino website. I know it's working, how could I otherwise wrote about features of their website and markets that are offered  First link they posted on the top of this ANN page is not working correctly like I said, so better read carefully what I wrote before replying anything Here is the broken link, and this is what they have to fix and update:Quote from: betzus on March 29, 2023, 10:45:25 AMbetzus.com - Online Casino,Sportsbook,Slots,Games",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}