{
  "id": "topic_5416420",
  "title": "Ecomm1",
  "author": "Ecomm1",
  "created_time": "October 08, 2022, 04:41:16 PM",
  "content": "Looking into the feasibility of piping miner exhaust into existing HVAC system during the winter. Does anyone know what the CFM generated by the S19XP on the exhaust side?I checked the Bitmain site but did not see it listed in the specs.https://support.bitmain.com/hc/en-us/articles/8906244096409-S19XP-SpecificationsAny issues supplementing heating costs with miner exhaust?Thanks,Ron",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416420",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "October 08, 2022, 08:28:34 PMLast edit: October 08, 2022, 08:40:55 PM by philipma1957",
      "body": "the 2 fans blow out between 300 to 450 cfm depends on how fast they blow.the answer as to is it possible is yes.here is a direct link to the fan on bitmain.https://shop.bitmain.com/product/detail?pid=00020220313175827439iOt7prxc071Bthese are variations on the delta's which do 200 to 250 cfm each depend on which one.so you will have 2 exhausting so max will be 400 to 450 cfm and if they blow slower due to a cool room they will drop to 300cfm or so.this will help you setup exhausthttps://www.ebay.com/itm/165362811412?_please note I have no connection to the seller on ebayhere is a link to some delta fans the 120mm by 38 mm are the size on s19'shttps://www.digikey.com/en/product-highlight/d/delta-electronics/afb-120mm-case-fans?a slower onehttps://www.digikey.com/en/products/detail/delta-electronics/1-NPT-603-1549/5066865a faster onehttps://www.digikey.com/en/products/detail/delta-electronics/1-NPT-603-1325/5066860it is likely to be this one or a clone of it since delta are costly now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ecomm1",
      "created_time": "October 09, 2022, 09:01:23 AM",
      "body": "Thanks for the great information! According to the Farmer's Almanac, we're supposed to have an exceptionally cold winter this year. Will be nice to know Bitcoin will be keeping us warm and cozy this winter.Perhaps I'll figure out a way to cook our meals with it during the summer  Thanks once again,Ron",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}