{
  "id": "topic_5451139",
  "title": "virasisog",
  "author": "virasisog",
  "created_time": "May 03, 2023, 05:54:13 PMLast edit: June 01, 2023, 05:13:45 PM by virasisog",
  "content": "I have been in the crypto world for a couple of years and many Bitcoin opportunities have come my way. Last year, I decided to pledge my crypto earnings from signature campaigns, trading profits, and investments to help the Aeta community in our province. I'm in the corporate world while doing crypto as my side job. I've seen the struggle of the native community in our province so I decided to sacrifice my one-year earnings to help them even in the simplest way I know. I collaborated and seek help from the local government sector to pursue this simple charity event. I have realized that Bitcoin won't just help the economy, and us users, but also can reach people who are deeply in need. As I've seen the smile on our native people's faces, all my sleepless nights of hard work have paid off. Bitcoin has opened lots of opportunities for everyone but it could also be a way to reach out to people who are in the poorest of the poor sector. I'm just so overwhelmed with my experience and hope to inspire others to help not just through charity events but in simple ways we can because not everyone is capable of accessing and grabbing Bitcoin opportunities because of their poor situation such as lack of devices and internet supply.Here are some photos that I would love to share. God Bless, everyone!UPDATE: My colleagues and former classmates have heard about the simple charity that I've done and they told me that they will join my plan to run another charity event by the end of the year. It was unexpected and my heart is full knowing that there would be more people who will extend their hands to less fortunate native community. We had a zoom meeting and I shared how I earned to run that gift giving program and they were surprised that I got the funds from my crypto earnings. I also discovered that three of them are also investing in Bitcoin. We still have almost half a year to prepare for it but I hope that we could reach out to higher number of native people. Thanks for your heart warming encouraging words. You've made me feel more motivated to grind and earn so I could help more of them. I know that everyone could do helping in different ways but I'm just so glad that crypto industry has been opening lots of opportunities for us. I believe that all our hard work will pay off in the future.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451139",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "May 03, 2023, 06:15:18 PM",
      "body": "I was moved when I saw your story how you actually devoted a part of your earnings to help out your native people and community. I wish I had more people like you in my country, You really are a God sent. Your experience shows us another true potential of  Bitcoin not just to earn and save but also to help out the people in need. This shows that we all can actually make positive difference in the world no matter how big or small it is, we should try to help. May your efforts continue to inspire others to do same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 03, 2023, 06:34:24 PM",
      "body": "Quote from: virasisog on May 03, 2023, 05:54:13 PM I've seen the struggle of the native community in our province so I decided to sacrifice my one-year earnings to help them even in the simplest way I know. Such a sacrifice requires someone with a good heart. I am impressed by your desire to help the needy and underprivileged with your one-year savings; I know it will not be enough, but it will go a long way toward supporting the community.I hope Bitcoin adoption will go a long way if the community knows you got the money through Bitcoin investment and that the support you provide them will make them realize how important Bitcoin is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 03, 2023, 06:44:24 PM",
      "body": "This is a kind act of generosity from you, mate. I know it really takes some time and a bit of stress to organize this kind of stuff, but you taking out your time to do this shows how kind you are. At least with this act, you will always be remembered by most of those kids, for putting a smile on their faces.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "May 03, 2023, 07:09:14 PM",
      "body": "Good job, it’s always a good thing to be generous and I always appreciate such act when I see such but I think we should try to protect the privacy of people, I know you doing a good thing for them but it’s proper to protect their image and maybe blur there faces out of the picture.Personally I am the type of person that like to give out in silent because that’s the best way to give to those in need without making them feel less of a human and to actually give without the intentions of popularity or any other thing, but since the forum is an anonymous one I would say kudos OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "May 03, 2023, 07:20:52 PM",
      "body": "Yes, bitcoin is one thing that has gone far beyond expectations of just transacting anonymously and making these transactions for something betterment. It’s good that you are thinking about community like that and putting all the efforts through use of bitcoin. We have already seen mega world wide donation ti Ukraine and various natural calamities and disaster. I’m pretty sure bitcoins name is being taken positively. You can also open up trust portal for donations and have bitcoin for good cause. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "May 03, 2023, 07:25:25 PM",
      "body": "Quote from: virasisog on May 03, 2023, 05:54:13 PMI'm just so overwhelmed with my experience and hope to inspire others to help not just through charity events but in simple ways we can because not everyone is capable of accessing and grabbing Bitcoin opportunities because of their poor situation such as lack of devices and internet supply.It's very great to see people striving to help others in whatever small ways they can; it's especially heartwarming when it's done sincerely. Campaigns like this one remind people that they have not been forgotten and that they are still a part of society.But, if I may, could you please blur out the faces of those whose faces are visible in the image? Because this is a public forum and you never know who is behind an account, it is safer to blur them out so that no one can identify those in the image.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "May 03, 2023, 08:36:04 PM",
      "body": "This is very nice community service work that you have carry out. I am excited whenever I see people helping the needies at their end from the earning in the forum. The forum has helped plenty people. According to a saying, those who give freely receive in abundant freely. The opportunities bitcoin has given to the forum users and beyond are many. There are not only campaigns but also learning and knowing and many people are also really using it to help others in their localities. And that is good. Those who did not give up the journey benefit from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "death69",
      "created_time": "May 03, 2023, 09:01:04 PM",
      "body": "Whoa, bro! Way to plonk your cash on the ticker of love! I gotta admit, color me awestruck – and ignited!You know, peeps can get lost in the cryptoverse and leave the tangible realm in the rearview. But yarns like these jolt us back to what the mighty Bitcoin can do – beyond fattening wallets, it’s a catalyst for awesomeness!The cherry on top? You don't need to be the crypto King Midas to rock the boat. Even tiny acts of generosity or compassion can snowball into epic impact.So, let’s all tip our hats to this big-hearted crypto-dynamo and join the revolution! Be it showering Bitcoin love, donating your time, or just being the resident ray of sunshine, that’s what'll make a dent in the universe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "May 03, 2023, 09:12:30 PM",
      "body": "I am at a loss for words, unsure of how to adequately express my gratitude towards you. Your act of charity is a rare and admirable one, and it warms my heart to know that you used your cryptocurrency earnings towards this cause. It doesn't matter what the amount was; sacrificing an entire year's worth of earnings is no easy feat. Your selflessness is truly inspiring, and we can all learn from your example. While we may not be able to make the same level of sacrifice, we can still use our crypto earnings to help others on occasion and experience the same feelings of fulfillment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "May 03, 2023, 10:04:17 PM",
      "body": "Your kind of person is uncommon to find. You have used your one year earnings from the forum for charity,this shows how simple you are for thinking of the poor ones around you to help them. So many people are accumulating their bitcoin for the next bull run but you used yours to spread love to the poor and needy. You have done something very great to those people and they will keep on praying for you.I admire your actions and will learn from you on how to help people who are in need with the little that I have. Giving relief materials to the poor is the most caring thing one needs to do,continue with your good work as this is another way to promote bitcoin. I am overwhelmed with this action of yours. Keep it up",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "May 03, 2023, 10:09:50 PM",
      "body": "I am not entirely sure if it would be considered the same thing, but back when the big earthquake happened here in Turkey, there were people donating crypto as well. I am not entirely sure how much was raised to be fair, but there were millions and millions of dollars raised without a doubt, and in fiat too obviously. The organization that raised this money went to the government and asked to help, and the government showed them what they can do, so now that money is getting spent to build stuff for the people who lost everything, and I mean everything. People who lost their loved ones, children, spouses, parents, jobs, houses, schools, hospitals, everything. Thanks to this money raised, we can at least build some of that back, not all of it of course, but even if we can help just a bit, that is all we can hope for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crunck",
      "created_time": "May 03, 2023, 10:39:18 PM",
      "body": "Well done, buddy, I bet there won't be too many people sacrificing for the poor like you. Many people always say nice things, but they never do charity or help others. But many people do it silently, without receiving any benefit in return. Good to see nice bitcoin users. God bless you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "May 03, 2023, 10:55:07 PM",
      "body": "Quote from: virasisog on May 03, 2023, 05:54:13 PMI have been in the crypto world for a couple of years and many Bitcoin opportunities have come my way. Last year, I decided to pledge my crypto earnings from signature campaigns, trading profits, and investments to help the Aeta community in our province. I'm in the corporate world while doing crypto as my side job. I've seen the struggle of the native community in our province so I decided to sacrifice my one-year earnings to help them even in the simplest way I know. This is selfless and really wonderful. Many people need help and it is up to us who can offer this help to do what is within our power to try to be of some kind of assistance. Some members of this forum render these kind of assistance in form of sharing of knowledge, but as that is good, sharing of relief items to people who we see are in need of them first can be better in some cases. I will like to see this continue and hope that some other people in the community who can render help as well come to realise it and join you so the burden will be less on you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "May 03, 2023, 11:20:48 PM",
      "body": "I don't know where are you from but I can see in this picture these people really needs help from people like you. We appreciate your wholesome effort to make them happy and feed them while you have the blessings of bitcoin and a good fortune. Keep up doing the great work while you can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "May 04, 2023, 02:18:12 AM",
      "body": "Quote from: virasisog on May 03, 2023, 05:54:13 PMI'm just so overwhelmed with my experience and hope to inspire others to help not just through charity events but in simple ways we can because not everyone is capable of accessing and grabbing Bitcoin opportunities because of their poor situation such as lack of devices and internet supply.Thanks for sharing your experience which actually inspired me to do the same with you. I have some situation poor people with you in my country. Sometimes I can't do anything how to help them much, but a couple of years ago with my earned bitcoin from the signature campaign, I separate 1% of my income a year to give them. But of course, is still very lacking because there are still many of them do not receive equality. I still regret didn't give them again last year ago, because of the situation of covid and the recession that make several goods rises, so that situation, I can't give money again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "May 04, 2023, 02:27:26 AM",
      "body": "That's super nice. Bitcoin really did it. It gave opportunity for many people to make money in a different way. I am glad that you can share it with others, and I wish they also know where it came from just so to open the eyes of those people who cannot be reached by the technology that we are enjoying. I mean, who knows, that might an eye opener for one or two people that you helped, and it can become a big deal to inspire others and also do the helping hands unto those who are in need.For others, this is not an easy task, they want to help but are shy about it. You had the courage to do that so congratulations and thank you. May more blessings come to you in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "May 04, 2023, 02:41:00 AM",
      "body": "With what's been shared in this section lately, I truly hope that you're doing this for real. I truly do. There's no way for us to verify whether this is true or not, but I hope it is.Anyway, we're all victims of the natural lotteries in life. For those of us who are lucky enough, it is always best to not forget those who are at the other end. It makes me extremely sad seeing indigenous people not just taken for granted but also become the butt of people's jokes because of how they look like. They're displaced. They're stolen of the very land the ancestors of their ancestors used to roam and hunt. They're deprived of all kinds of opportunities. You've done a truly great job!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "May 04, 2023, 03:54:02 AM",
      "body": "It's nice to think that there are people who are willing to sacrifice their income just to reach people who are far away from civilization or cities that are difficult to reach because they are in the mountains.But you were able to reach these people with the help of the Bitcoin you earned in this cryptocurrency industry. And for sure in the future, many people will be helped because of the advocacy that you have in your heart. May there be more people like you OP, God bless you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "May 04, 2023, 04:12:39 AM",
      "body": "Quote from: virasisog on May 03, 2023, 05:54:13 PMso I decided to sacrifice my one-year earnings to help them even in the simplest way I know.This is a great sacrifice you made to your people. Having your one year earning to give out as charity is what not many people can do. I show my appreciation to you because is not easy thing to do. This action will get your people to know more about bitcoin . This is the easy way to introduce others into bitcoin when they can see in you that you have benefited in your bitcoin investment, they will come to you for more understanding. You done something good to help the people in need in your province.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}