{
  "id": "topic_5422348",
  "title": "Ojima-ojo",
  "author": "Ojima-ojo",
  "created_time": "November 20, 2022, 02:42:48 PM",
  "content": "After I started my Bitcoin holding journey a few months ago, At that time, my close friend Sam! also have some capital he want to put away in cryptocurrency, and I advised him to buy Bitcoin instead of an altcoin. But instead of him to have a long-term potential mentality, he was looking for a quick profit so he filled up his portfolio with shitcoin, while I went in on a single portfolio of Bitcoin and when the unexpected of FTX hack happen the whole market in shamble and his altcoin portfolio have dropped above %800+ but my bitcoin holding still maintains some level of stability.This gives me more confidence in Bitcoin and newbie who are looking for long-term holding should hold more bitcoin, in their private wallet to avoid exchange, but your knowledge to always have a good entry price.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422348",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "November 20, 2022, 03:16:04 PM",
      "body": "Many people come into the crypto space with a quick to get rich intention and they feel these altcoins could come good ahead of bitcoin and that's why we read daily of people losing there entire live savings in them.It wasn't the FTX saga that's affecting the market, we have in the bear market throughout this year maybe FTX or exchanges just add to it a little bit.Another thing, bitcoin doesn't have a good entry price as you stated. Every price is a good entry price just that those that gets to buy at lower price have a double advantage of it been a store of value and also gets more profit when it pumps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "November 20, 2022, 04:24:38 PM",
      "body": "Quote from: Ojima-ojo on November 20, 2022, 02:42:48 PMwhile I went in on a single portfolio of Bitcoin and when the unexpected of FTX hack happen the whole market in shamble and his altcoin portfolio have dropped above %800+ but my bitcoin holding still maintains some level of stability.Just to point the obvious out, FTX collapses wasn't caused by the hack that later happened to the exchange and I won't be surprised if that hack was organized to hide the true scam that Sam Bankman-Fried was into which was making used of customers funds for personal gains. I see news media blaming the collapse on the hack but that's not true and the community shoudn't be misinformed. With or without the hack, FTX would had still gone down because their unethical practice was exposed and trust was been lost by their customers which triggered the massive withdrawal of funds from the exchange.That been said, as a newbie, the best decision you can make for yourself is investing in Bitcoin and hoarding enough before the price get out of reach of affording a whole Bitcoin. Altcoins are never the best way to get introduced into the market. When you have the right information and experience then you can play with that side of the market but your main focus should always be accumulating as much Bitcoin as possible and you'll be safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "November 20, 2022, 04:40:22 PM",
      "body": "Altcoins have always been short-term cryptocurrencies one buys and sells quickly, if you do things that way you might be lucky enough to accrue some ROI, other times you might not; but if you consider hodling them for the long-run the chances are sky high that you'd never be lucky as they have no/fake utility, quite a lot of altcoins have their utility only in the promises of the owners, which more often than not never comes to fruition. Having said that, Bitcoin has an actual utility, that is what makes the difference, and that's why you'd always expect the price to appreciate again, even if it has been down for so long, it's also the reason why Bitcoin can't basically die/go into oblivion like most altcoins do after a few years/months/weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "November 20, 2022, 07:25:31 PM",
      "body": "If you are honest with yourself you would state you had a drop also in your Bitcoin investment, and guess what that is not really bad because crypto-currency is volatile. Yes just like you I prefer Bitcoin over Altcoin and I am also yet to get any Altcoin but I don't down play them out rightly.Your friend did not lose because he invested in Altcoin but rather he invested wrongly, there are still Altcoins that has there heads above waters even after the FTX saga, advice Sam your friend to stop going for Hype, FOMO or FUD but rather do his research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "November 20, 2022, 07:36:58 PM",
      "body": "It's not just for newbies, mate; it's for all inexperienced crypto traders. Because I fucked up a few times with shit coin. Every time you buy a shitcoin, you have to sell it at a loss because the price has not recovered, even if the entire market has recovered. So, if you're not a pro trader, avoid the shitcoin. Simply use Bitcoin, or enter one of the top ten altcoins. However, due to the volume of drama in the crypto market, it is still risky to invest in altcoins. Just be more cautious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "November 20, 2022, 08:04:32 PM",
      "body": "That's the usual mistake of many new comers to the market. They want to make a lot of money short time and they choose the wrong crypto and that results in them having that loss. Good job on what you did because that's what it should be for most of the newbies of the market. It's better to stick and get bitcoin at the beginning and when you're accustomed to the market, then that's when you'll start exploring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "November 20, 2022, 08:12:50 PM",
      "body": "It is a wise decision to stay away from shitcoins as a newbie since you have little experience in cryptocurrency. Invest in bitcoins that everyone who has been here for a longer time than you are investing in. Investing in bitcoins directly is choosing to leverage on the the experience of other people. Investing in shitcoins is deciding to make the adventure and have your own experience and that can be a dangerous voyage for a newbie to take. Stay away from shitcoins and invest only in credible coins like bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "November 20, 2022, 08:18:50 PM",
      "body": "Quote from: Rruchi man on November 20, 2022, 08:12:50 PMIt is a wise decision to stay away from shitcoins as a newbie since you have little experience in cryptocurrency. Invest in bitcoins that everyone who has been here for a longer time than you are investing in. Investing in bitcoins directly is choosing to leverage the experience of other people. Investing in shitcoins is deciding to make the adventure and have your own experience and that can be a dangerous voyage for a newbie to take. Stay away from shitcoins and invest only in credible coins like bitcoin.I do better leverage on the experience of other than to discover my one adventure of shitcoin as you mentioned, I made my decision on investing in only Bitcoin and avoiding all the shitcoins around because an altcoin is a refurbished Ponzi because most altcoins do not have the real volume to sustain them as a long-term asset like Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "November 20, 2022, 10:13:38 PM",
      "body": "It is not all altcoins that is shitcoins. Definitely your friend may have bought loads of shit to fill his wallet and this is why they have pulled the value of his wallet down. Etheruem is also a good coin after bitcoin that you can hodl for long. Your friend wants the quick way to riches. I think the time of quick riches is not hear for now except he can try his luck during the bull season , quick riches don't happen during bear time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "November 20, 2022, 10:32:53 PM",
      "body": "Quote from: Ojima-ojo on November 20, 2022, 02:42:48 PMAfter I started my Bitcoin holding journey a few months ago, At that time, my close friend Sam! also have some capital he want to put away in cryptocurrency, and I advised him to buy Bitcoin instead of an altcoin. But instead of him to have a long-term potential mentality, he was looking for a quick profit so he filled up his portfolio with shitcoin, while I went in on a single portfolio of Bitcoin and when the unexpected of FTX hack happen the whole market in shamble and his altcoin portfolio have dropped above %800+ but my bitcoin holding still maintains some level of stability.This gives me more confidence in Bitcoin and newbie who are looking for long-term holding should hold more bitcoin, in their private wallet to avoid exchange, but your knowledge to always have a good entry price.His altcoin portfolio has dropped above %800+ you say? Don't you think you are exaggerating a little bit his loss actually? That would mean for $100 invested, he lost $800. I know that crypto market can be hard but it's not possible in reality. You can only lose 100% of your investment actually, when all your cryptos go to 0. Cryptos can't go below 0, you will never have to pay someone to get rid of it , because you will always be able to send them to a random address without asking anything to anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 20, 2022, 10:54:57 PM",
      "body": "Quote from: Ojima-ojo on November 20, 2022, 02:42:48 PMAfter I started my Bitcoin holding journey a few months ago, At that time, my close friend Sam! also have some capital he want to put away in cryptocurrency, and I advised him to buy Bitcoin instead of an altcoin. But instead of him to have a long-term potential mentality, he was looking for a quick profit so he filled up his portfolio with shitcoin, while I went in on a single portfolio of Bitcoin and when the unexpected of FTX hack happen the whole market in shamble and his altcoin portfolio have dropped above %800+ but my bitcoin holding still maintains some level of stability.This gives me more confidence in Bitcoin and newbie who are looking for long-term holding should hold more bitcoin, in their private wallet to avoid exchange, but your knowledge to always have a good entry price.And that is the mentality of newbies, they didn't understand the risk involved with altcoins, it's high risk as compare to Bitcoin. Of course, as we are in a bear market, the price of BTC will go down hard and maybe that is the reason why they don't like to invest on it and go for altcoins that they thought will bring them huge profits, but as I have said, the risk is high as well.And so it is an easy choice, specially if you are hear for the long term kind of investment, bitcoin is the best asset in crypto and I think one of the best if you are going to compare it with traditional investments like stocks and golds.So good for you to stick with bitcoin in this bear market and just continue to accumulate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 20, 2022, 11:40:02 PM",
      "body": "Even if your friend's investment went up by 1000%, that still wouldn't mean that altcoins are better than Bitcoin. Altcoins have no future, they will have no adoption and it means there's no reason why they should have value. Their current value is purely based on the bigger fool theory and nothing else. This makes them closer to gambling than to investment, and the #1 rule of gambling is that the house always wins. So even if you manage to make profit on altcoins, you won't be able to repeat it, you will be losing more than you gain in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "November 21, 2022, 03:31:30 AM",
      "body": "Of course, wherever a beginner hears about crypto it will come to mind that it is a get-rich-quick scheme. What makes them intrigued is the high volatility charts, so bitcoin is far from the investment radar early in their journey.If advice can't change their minds, let the experience make it work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 21, 2022, 04:36:38 AM",
      "body": "Quote from: Ojima-ojo on November 20, 2022, 02:42:48 PMwhile I went in on a single portfolio of Bitcoin and when the unexpected of FTX hack happen the whole market in shamble and his altcoin portfolio have dropped above %800+ but my bitcoin holding still maintains some level of stability.To be fair if you look at the long term history of bitcoin and altcoins (meaning over the past 10 years for example) you can see that altcoins are always dumping without needing something like FTX hack happening. Such hacks only speed up that dump in short term. But when it comes to bitcoin the same thing only causes a drop in short term due to panic sells which will be recovered, something that won't happen for most altcoins (although some would recover before dumping again).P.S. You can't lose more than 100%. Only gain can be higher than 100%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "November 21, 2022, 05:23:29 AM",
      "body": "Quote from: Ojima-ojo on November 20, 2022, 02:42:48 PMThis gives me more confidence in Bitcoin and newbie who are looking for long-term holding should hold more bitcoin, in their private wallet to avoid exchange, but your knowledge to always have a good entry price.This experience will open your friend's eyes in investing. it was a rewarding experience. I hope your friend doesn't decide to close the account and get out of the investment he started.You have given good advice to your friend. and the market proves it all. your friend must regret not following you. he must learn well in asset selection and smart investment planning. and most importantly in long term investment, always keep your assets in your wallet. do not leave it on the exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "November 21, 2022, 07:33:49 AM",
      "body": "Not only beginners, there are still many investors who believe in shitcoin not because of FTX profit reasons but they don't realize that shitcoin will trap you in the future and especially beginners he must understand about the portfolio he has at least to avoid shitcoin.I have warned that there are things going on around me especially for those who have invested in cryptocurrencies I just make sure to say bitcoin is a good coin the rest I don't trust other coins, and it's a fact that shitcoins have lost a lot after they trusted them , therefore we still have to be aware of how good the coin is and build hype we must be careful of these traps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "November 21, 2022, 07:57:03 AM",
      "body": "Quote from: Ojima-ojo on November 20, 2022, 02:42:48 PMThis gives me more confidence in Bitcoin and newbie who are looking for long-term holding should hold more bitcoin, in their private wallet to avoid exchange, but your knowledge to always have a good entry price.What a good determination from you OP, if as many as possible newbies we have canbset thier priority to stick on single investment with bitcoin and hold their coins in their wallet and not on exchanges, there will be less need to keep on the emphasis for the need to make the right investment with bitcoin and stay off centralized exchanges, but everyone of them want something huge in profit and very fast in result, forgetting that those things only present them unrealistic expectations of making money quick, they will end up loosing than earnings at the longrun, but for the smart ones, they follow the right path, channel and choose the best option with bitcoin for their investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "November 21, 2022, 02:33:46 PM",
      "body": "Quote from: Zaguru12 on November 20, 2022, 03:16:04 PMMany people come into the crypto space with a quick to get rich intention and they feel these altcoins could come good ahead of bitcoin and that's why we read daily of people losing there entire live savings in them...At the same time, we should not forget that investing in new coins brings a very large profit, which cannot be compared with the profit from holding bitcoin. But such investments can only be made by an experienced investor who allocates a small part of his deposit for this. In this case, the OP's actions are correct, since he does not yet have enough knowledge to trade altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "November 21, 2022, 02:36:12 PM",
      "body": "Shitcoin is for fast shooters. It is a shoot and run scheme where investors time quick profits when it clicks and run off the system. It is not for everyone and because its not for everyone Bitcoin then becomes the best recommendable coin that can suit any class of crypto enthusiast because as long has the goal is long term there will always be a time for good and quality rewards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}