{
  "id": "topic_5436625",
  "title": "summonerrk",
  "author": "summonerrk",
  "created_time": "January 24, 2023, 03:16:00 PM",
  "content": "Your successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.It's not just cryptocurrency that unites us all. We all became different after we learned about her, and went deeper into her knowledge. And now, even if someone is not very lucky to increase their deposit, then you probably have accumulated experience, and you can share it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436625",
  "comments": [
    {
      "author": "qwertyup23",
      "created_time": "January 24, 2023, 03:48:46 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.It's not just cryptocurrency that unites us all. We all became different after we learned about her, and went deeper into her knowledge. And now, even if someone is not very lucky to increase their deposit, then you probably have accumulated experience, and you can share it. Over the last five (5) years, I have participated in various signature campaigns and I have at least accumulated a good amount of BTCs throughout my journey. However, there was a time where I also got scammed when I invested in a ponzi-scheme last 2018. From there, I have learned various fundamentals and skills necessary for me to venture in this journey.Fortunately, also, majority of my BTCs were allocated towards funding my own education. I used my BTCs to purchase school materials, books, and other educational stuff when I was still in college. Currently, I am earning most of my BTCs (still from campaign signatures) in order to at least have some security for the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "summonerrk",
      "created_time": "January 24, 2023, 04:13:43 PM",
      "body": "Quote from: qwertyup23 on January 24, 2023, 03:48:46 PMQuote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.It's not just cryptocurrency that unites us all. We all became different after we learned about her, and went deeper into her knowledge. And now, even if someone is not very lucky to increase their deposit, then you probably have accumulated experience, and you can share it. Over the last five (5) years, I have participated in various signature campaigns and I have at least accumulated a good amount of BTCs throughout my journey. However, there was a time where I also got scammed when I invested in a ponzi-scheme last 2018. From there, I have learned various fundamentals and skills necessary for me to venture in this journey.Fortunately, also, majority of my BTCs were allocated towards funding my own education. I used my BTCs to purchase school materials, books, and other educational stuff when I was still in college. Currently, I am earning most of my BTCs (still from campaign signatures) in order to at least have some security for the future.I think everyone was wrong, the main thing is that this mistake does not discourage the desire to continue to believe in yourself. I liked your decision to buy books and other things. This reveals you as an independent person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 24, 2023, 04:30:26 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMHow well have you managed to increase the balance on your account during this time? Or have you lost everything?Gained so much more compared to if I just held BTC. How? I traded shitcoins. No — not by reading charts all day, but by trading narratives and buying platform tokens that seems to be getting a lot of usage and revenue/fees. My \"trades\" range from a few days to almost a year.^I wouldn't recommend doing this to anyone, though. As chances of picking shitcoins that will perform really badly is quite high if you don't know what you're doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "January 24, 2023, 04:36:28 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story. I have gained a lot and lost a lot in the last five years.  I bought a flat with the money I earned from crypto in various ways.  I fulfilled all my desires.  Bought a car, etc. These are my happy stories.  But I lost millions of dollars in the same way trading wrongly and trading futures that I could have spent the rest of my life comfortably. Now my condition is very bad.  Apart from my office work, I earn some extra money from signature campaigns and manage my family with this",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "summonerrk",
      "created_time": "January 25, 2023, 03:50:22 PM",
      "body": "Quote from: mk4 on January 24, 2023, 04:30:26 PMQuote from: summonerrk on January 24, 2023, 03:16:00 PMHow well have you managed to increase the balance on your account during this time? Or have you lost everything?Gained so much more compared to if I just held BTC. How? I traded shitcoins. No — not by reading charts all day, but by trading narratives and buying platform tokens that seems to be getting a lot of usage and revenue/fees. My \"trades\" range from a few days to almost a year.^I wouldn't recommend doing this to anyone, though. As chances of picking shitcoins that will perform really badly is quite high if you don't know what you're doing.An impressive strategy, without drawing lines on the price chart. This requires perseverance and understanding of the project economies! Thank you for the advice, good luck in your further choices of projects for investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "January 25, 2023, 03:55:10 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.It's not just cryptocurrency that unites us all. We all became different after we learned about her, and went deeper into her knowledge. And now, even if someone is not very lucky to increase their deposit, then you probably have accumulated experience, and you can share it. I have less crypto holdings now compared on my portfolio last 5 years because I take profit last year and invest most of money on stocks then leave few on crypto to secure my profit. I really believe that crypto will dump when it reach the ATH that makes me secure profit on less volatile asset and safe from cypto volatility or stablecoin failure. Right now I’m slowly building my portfolio again by doing DCA using my salary and part of my stock investment but I’m not planning to all in again on crypto since I decided that stock market will be more safer for my main investment.I accumulated most of my crypto during pandemic when the price drops due to covid panic. I’m planning to do the same timing when recession hits hard the global economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasisog",
      "created_time": "January 25, 2023, 04:30:50 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.It's not just cryptocurrency that unites us all. We all became different after we learned about her, and went deeper into her knowledge. And now, even if someone is not very lucky to increase their deposit, then you probably have accumulated experience, and you can share it. I could say that I had better gains over the past five years. I was able to sustain our necessities and save some because of my crypto earnings. It's just so challenging because when the pandemic happened, I've lost my job and I relied only on crypto trading and during that time, the market was on a bad situation. I spent some of my savings to survive.I could also say that I learned a lot in the past few years especially in my trading journey and those lessons are applicable up until now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "January 25, 2023, 04:56:18 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time?  By taking part in signature campaigns, I learnt alot of how people perceive cryptocurrency and how they compare it to different other things in our times like freedom and free speech and also the abuse of free speech.I did accumulate bitcoins during this time but I kept the altcoins to a bare minimum. I usually trade long term with ranges between months to a year. I dont have the need of quick earnings and neither do I have to loans to repay so I can invest at my ease and leisure. This I feel is lacking among many users of this forum. Short term day trading is not for everyone and I dont recommend it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "January 25, 2023, 05:21:16 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.There have been a lot of successes in the past 5 years, like having a family, and there are small wins like getting a new job and being able to purchase other things that were needed. I've grown a lot, matured, and can stand my ground, but the cons are that a lot of problems have struck you and you should be strong. Right now, we still don't have emergency savings, as we are just getting enough salary for our family and also paying for other things that need to be paid. But I'm confident that in another 5 years, I'll improved, and I'll be able to look back on the past and be proud of what I've accomplished, despite the numerous challenges I've faced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xxmodded",
      "created_time": "January 25, 2023, 07:40:04 PM",
      "body": "Have many good and bad experienced over past years with trading in cryptocurrency, no doubt with how much achievement and most thanks for many friend helped me guide earn money trough trading in Bitcoin and altcoin. Journey is not always running well and some time over 5 years I faced bad experience actually with bad news from cryptocurrency.Have impact when some altcoin in my portfolio price increase down and lately when FTX as bigger exchange have been collapse, but over 5 years my challenge with cryptocurrency most happiness and bad experience having, don't worry after darkness have lightness and optimist with your altcoin assets still drop will back later to higher price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "January 25, 2023, 08:51:02 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.It's not just cryptocurrency that unites us all. We all became different after we learned about her, and went deeper into her knowledge. And now, even if someone is not very lucky to increase their deposit, then you probably have accumulated experience, and you can share it. I can't give the entire detail but it's lovely to think about the five years that have passed so quickly and my bank account still doesn't have that much. But when I look at my portfolio, I'm happy to look at it every time even if the market isn't that good at all, there's an increase on it, thanks to DCA.It's hard and tough to be consistent into accumulation but if you've been there and saw the early sell offs that you've done personally, you'll be eager to have some more and will push for it if you believe on this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lalabotax",
      "created_time": "January 25, 2023, 09:11:45 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.To be honest, I still can't say that I've been successful in this crypto business, moreover I still haven't been able to make optimal use of the crypto business. In fact, I had missed 2 bullish periods almost in vain because my expectations were too high at that time, so I couldn't even take profits from some of the coins that I held at that time while the market continued to fall until now. It is undeniable that I have also made profits from crypto, but not extraordinary and on target. Hence this made me a great lesson due to the overly high expectations during 2 bullish periods. It would be better if I set some selling price targets so that at least I can feel the profits from the long term holding itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "January 25, 2023, 09:36:50 PM",
      "body": "I can say that since 2017, there have been positive developments in my life thanks to the forum. The forum taught me what it feels like to experience economic freedom. So here i am grateful. But i also had experiences that i wouldn't want to live because of my mistakes. Thanks to the campaigns, i started saving and everything was going well. I was only trading on the spot market and was patient. I would always realize profit realization when i reached the targets i set in the bull market. In this way, i was getting closer to my goals step by step. But after a while i lost my sense of satisfaction and decided to try futures. I can say that I lost almost all of my savings because i started futures experiments ignorantly. An ignorant futures attempt in a bull market can ruin your life. I closed the Futures ledger so that it would not open. Now i act like a patient bear, trying to reach my goals wisely rather than quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitpotter",
      "created_time": "January 25, 2023, 09:48:29 PM",
      "body": "During these 5 years, I have experienced many changes from having nothing to being a little better. I've only been active in crypto trading so far, but there have always been gains and losses sometimes, but for me it's normal and luckily I soon got up to forget it all. There aren't many stories that I can share, but I'm sure every experience, no matter how small, will be invaluable for moving forward in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "January 25, 2023, 09:51:11 PM",
      "body": "Quote from: blockman on January 25, 2023, 08:51:02 PMBut when I look at my portfolio, I'm happy to look at it every time even if the market isn't that good at all, I think it is the same story and we share the same measure of scam to it. Investing in Ponzi scheme is a scam already because it will eventually fail. Also back in the past ICO was all over the place and investing on it then seem like it was a sure way to financial independence but it never happened, it all ended in scam. This is the story so far but there is still light at the end because some investment still give you hope for increase soon during the bitcoin bull.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "January 25, 2023, 09:56:42 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.I’m on a better situation now though problem is still there but I can say that I already know how to solve it and I’m confident that I can survive on every trial, I guess bear market really helps me to be better. Trading is very challenging on a very volatile market like cryptocurrency but once you already have a good strategy and know how to approach the market, you will not worry anymore about your losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "January 25, 2023, 09:58:33 PM",
      "body": "Quote from: summonerrk on January 24, 2023, 03:16:00 PMYour successes over the past five years: How well have you managed to increase the balance on your account during this time? Or have you lost everything? Tell me your story.It's not just cryptocurrency that unites us all. We all became different after we learned about her, and went deeper into her knowledge. And now, even if someone is not very lucky to increase their deposit, then you probably have accumulated experience, and you can share it. I remember those bad old days that the main thing that drags me on here on this space is via into those hyip and ponzis but on the time that i did gain up some knowledge then im thriving to accumulate some coins.Although there are really times or moments that i do make out some snipping out of those funds and buy something that i do want.So far i had able to buy my own car which is fully paid cash out of crypto earningplus having other properties like house or something like that.This is why i could really say that my life had soo much improved wayback in the last 5 years which im very that thankful for this opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 25, 2023, 10:11:03 PM",
      "body": "The past five years have been full of gains and losses. I was not yet aware of bitcointalk back then, although I became aware of crypto in 2018, but I had little interest because I was doing some side hustles and furthering my education. I lost a couple of bucks with scam airdrops and a few shitcoins. In 2020, I lost a huge amount of money to a scam Forex trading company in my country that promised a 40% ROI per month. I also had a small business I was running then, but I lost everything due to the pandemic. In 2021, I made a huge profit from an altcoin that is not doing very well now and also profited from Bitcoin that same year. I now have a funitur business since last year, and it's doing so well that it has allowed me to accumulate some bitcoin last year compared to 2020 and 2021.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "January 25, 2023, 10:23:31 PM",
      "body": "Quote from: palle11 on January 25, 2023, 09:51:11 PMQuote from: blockman on January 25, 2023, 08:51:02 PMBut when I look at my portfolio, I'm happy to look at it every time even if the market isn't that good at all, I think it is the same story and we share the same measure of scam to it. Investing in Ponzi scheme is a scam already because it will eventually fail. Also back in the past ICO was all over the place and investing on it then seem like it was a sure way to financial independence but it never happened, it all ended in scam. This is the story so far but there is still light at the end because some investment still give you hope for increase soon during the bitcoin bull.Yeah, and it's not a scam like those that we've seen and those pump-and-dump altcoins that we probably managed to have in our portfolios. I'm happy that I've kept still a lot in bitcoin and now regretting that I've used a few from my original holdings just to buy those altcoins that did become nearly as of typing this. We're all hopeful to the bull run and we don't know when it's going to happen but most likely, after the halving which is we're just 1 year and a couple of months far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}