{
  "id": "topic_5417768",
  "title": "Team_MegaPari",
  "author": "Team_MegaPari",
  "created_time": "October 20, 2022, 12:38:21 PM",
  "content": "What's your favorite thing to do when you get a bad loss?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417768",
  "comments": [
    {
      "author": "Saisher",
      "created_time": "October 20, 2022, 12:51:13 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?I watch movies on Netflix usually about life and action to help overcome my bad loss, we should try to avoid having bad losses, bad losses are losses where we are not comfortable losing or a loss coming from chasing your losses, this is not good for your mental health, gambling in casinos should be fun and a source of entertainment if we keep on getting bad losses, we are gambling the wrong way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "October 20, 2022, 12:52:49 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?Bad loss meaning for a huge one or a loss using your hard earn money?Every gamblers have their own bad loss I guess, personally if it's already beyond my limit I will stop playing though I also experienced before to borrow some funds which I eventually lose as well. Self-control will play a bigger role here, that bad loss should not happen again and you should gamble only with your extra money, some bad loss might be more traumatic for you, so be responsible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "October 20, 2022, 12:56:39 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?First of all there is no worst feeling for a gambler than when he just had one such bad loss.Usually I promise myself to never get back to gambling after such a really bad happening but after sometimes have passed I am relaxed and go back again playing.However these moments as I have had a lot of them during the past year made me a better person in the sense that I now do not spend more than 10-20 dollars while in some rare cases a maximum of 50 dollars when I want to play a bit longer.These moments have helped me to become much better at self control and I am not an addicted person anymore.Regarding the favorite thing to do when I had these dark moments during the past year,I prefer to lay down and relax letting that bed moment sink in,I need to stay like this several hours before I am recovered from such happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 20, 2022, 01:31:47 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?The thing with gambling is you will suffer bad losses as you continue to play, and bad losses are something you need to overcome as soon as possible, the longer they linger in your mind the longer that you are going to suffer so you have something that you're doing to address it, in my case I just to go out play basketball or jog to take out the frustration of my bad loss, but when you're used to bad loss you'll just treat it as something that about to happen and you can easily move, its all about being responsible in how you play and knowing your limitation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "October 20, 2022, 01:45:22 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?In no case should you try to win back a bad loss, otherwise it will lead to even greater losses. The best solution to forget about losing is to switch your activity to something else from gambling. You need to keep yourself busy with things that help you relax. It does not matter what it will be, the main thing is that this activity is exciting for you, for example, some kind of hobby. Attempts to think less about the loss will still not be successful, and only filling your thoughts with something else will work. But for this you need to really be passionate about new activities. For example, watching a movie that will greatly interest what is happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "October 20, 2022, 01:47:31 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?After a bad loss i like to turn off the computer and stay away from it for some time. Go to enjoy the real life with some cold beers and chill with nice music.With time we learn that be sad about our loss is just a waste of time, that's why it's better to take it as a man, let it go and move on because life keeps going and we must move on without looking back.The fun fact is that i do the same after a good win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "October 20, 2022, 01:50:03 PM",
      "body": "What do I do if I get a lot of losses? Of course, I will close my browser and leave my computer for a while to forget about it. Maybe I'll get out of the house and go somewhere where I can forget the worst moments I had at gambling. But fortunately, I've never felt that much loss because I can control myself when playing gambling and don't use much money. Thanks to the lessons on self-control I have learned from many sources. I can refrain from spending too much money and always try to get out of gambling if I have lost a few times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "October 20, 2022, 01:51:10 PM",
      "body": "Close the website, take a coffee break. Play some video games and sleep it over. The feelings wear off eventually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "October 20, 2022, 01:51:34 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?in my case when I make a deposit at the casino I already take the deposit I made as lost money I don't create expectations about the money I put in the casino, of course if I win I'm very happy but if I lose I don't freak out either because even before I make a bet, I consider that money as lost, this is the best way to deal with gambling, this way it avoids creating stress and also the person is not disappointed. It is necessary to see that gambling is not a fixed income, even if the person tries hard he will always have losses and when the person pursues the losses he will continue to lose even more, so at the end of the day it is better for the person to be aware that that money that you put in the casino and money already lostQuote from: coin-investor on October 20, 2022, 01:31:47 PMin my case I just to go out play basketball or jog to take out the frustration of my bad loss, but when you're used to bad loss you'll just treat it as something that about to happen and you can easily move, its all about being responsible in how you play and knowing your limitation.I agree that it's really all a matter of being responsible and knowing each person's limitations, I see some people who put all their money into a bet, and it's as if for these people it's all or nothing. this type of movement makes people feel frustrated when they lose because they don't know their limitsQuote from: swogerino on October 20, 2022, 12:56:39 PMFirst of all there is no worst feeling for a gambler than when he just had one such bad loss.Usually I promise myself to never get back to gambling after such a really bad happening but after sometimes have passed I am relaxed and go back again playing.be careful with this type of attitude, the moment the person loses a lot and then promises he will stop playing and can't stop playing and goes back to playing and loses again and promises again that he will stop playing but he doesn't. can stop gambling then that person may be addicted to gambling. be careful in that partQuote from: Johnyz on October 20, 2022, 12:52:49 PMEvery gamblers have their own bad loss I guessbad loss and whenever a person bets a large amount to the point of breaking the bank, that person bets thinking they will have a guaranteed win, but then loses",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 20, 2022, 01:54:14 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?A bad loss like $500 is already a stressful for me. That's already a big amount for me. The game will keep replaying in my head like I can turn back the time but before I'd go crazy I'd take a walk. Taking a break to shake the bad luck and then watch some news, watching some news help me pass the time without thinking the loss. Same as I can forget how BTC price plummet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "October 20, 2022, 01:59:33 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?close the laptop and put it in a cupboard so I can relax more without having to think about it, distract me by listening to music and also movies on netflix through my cellphone, usually that way is enough to make me better from bad losses, after a few days usually I will open that laptop and play again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 20, 2022, 02:00:55 PM",
      "body": "I lost 500$ in a minute trading an altcoin, this is the money I planned to use for buying at least three different altcoins for long term, when I lost that money it hit very hard, I kept remembering for the whole week, I believe it's not the money I was prepared to lose. I hope this answers your question, if you are able to get over a loss very quick its because you are prepared to lose the money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "October 20, 2022, 02:11:24 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?By taking a break from gambling. Gambling hurts you, you hurt it back by not giving a shit about it lol.Basically, by taking a break from gambling you get to realize that chasing losses is not the thing you should do.You get to analyze your mistakes and it also gives you time to get out of the loss.You can continue gambling when you are back on track with your losses and ofcourse this time not repeating your mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "October 20, 2022, 02:13:49 PM",
      "body": "My favorite thing to do to get over bad loss is doing the regular thing I do.  Though there are regrets sometimes, it doesn't affect me much since I get over my losses easily.  That is probably because I often gamble on what I can afford to lose.  So I always have my fund planned beforehand.  But if the loss is really bad(sometimes we failed to have self-control and keep on playing way beyond our allocated budget), I just play games to forget about the \"horror\" of losing.Quote from: piebeyb on October 20, 2022, 01:59:33 PMQuote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?close the laptop and put it in a cupboard so I can relax more without having to think about it, I was thinking of saying pressing x that is located in the upper right corner of the browser",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "October 20, 2022, 02:21:03 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?I don't know. Have a depressive feeling for the rest of the day and depending on the amount of coins I lost, maybe have a bad week? What kind of question is that? What is my \"favorite thing\" to do after losing? Lol what.I think you might have meant what do you do after you lose to keep your mind off the fact that you lost money. Because thats the one thing everyone does after losing. Find something to take their minds off their losses. Basically what is your favorite coping mechanism should be the title of this thread.In which case,  my coping mechanism is ingesting large amounts of copium and watching movies or something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "October 20, 2022, 02:22:41 PM",
      "body": "Quote from: Crypt0Gore on October 20, 2022, 02:00:55 PMI lost 500$ in a minute trading an altcoin, this is the money I planned to use for buying at least three different altcoins for long term, when I lost that money it hit very hard, I kept remembering for the whole week, I believe it's not the money I was prepared to lose. I hope this answers your question, if you are able to get over a loss very quick its because you are prepared to lose the money. I believe that there are some people who don't move on fast after they lose the money they are prepared to lose for. I'm pretty sure there are people who are regretting their actions even they are prepared for the consequences. I've been on that situation multiple times before and I learned my lesson hard and learned to control myself from the temper of not spending money that I don't afford to lose. Usually I do take some breaks after having a bad loss, Thank to God I have a limit on what I spend on a casino. This helps me move on fast now and just recover to my normal state after I have a bad loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "October 20, 2022, 02:36:28 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?Hmm.. What do you actually mean by a Bad loss? Do you mean gambling with an amount too huge that you couldn't afford to lose? ( i.e betting $1000 with just 1.2 olds and still finally losing it) or Do you mean gambling with a significant amount? Because to me, what I do is try to console myself by either watching funny comedy videos on YouTube or Facebook in a lonely place all by myself, and trying to avoid further discussion that will make me remember such incident, because of what benefit will it be worrying over what I know I can't change. So it is better to just accept it that way and life goes on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "October 20, 2022, 02:49:25 PM",
      "body": "Quote from: lionheart78 on October 20, 2022, 02:13:49 PMQuote from: piebeyb on October 20, 2022, 01:59:33 PMclose the laptop and put it in a cupboard so I can relax more without having to think about it, I was thinking of saying pressing x that is located in the upper right corner of the browser  Should have closed it first by pressing x but I'm more interested in pressing shutdown, if only this laptop wasn't a gift from my wife I might have burned it when I had a loss whether it was in trading or playing on a gambling site, so it's best to put it in a cupboard and away from my view",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "October 20, 2022, 03:09:02 PM",
      "body": "Quote from: Team_MegaPari on October 20, 2022, 12:38:21 PMWhat's your favorite thing to do when you get a bad loss?You know what is my favorite thing to do, when I am in bad loss then I drink an alcohol and eating some of my favorites foods. Because what is in my mind is that it's better to eat than to lose again and that's the reason if when I loss a good amount of money then the rest of my money I spend it in eating my favorites food and also shopping as well. Actually in my history as A small gambler I  didn't loss big amount. because I gamble what I afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}