{
  "id": "topic_5450436",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "April 27, 2023, 11:55:04 PM",
  "content": "https://www.gazetadopovo.com.br/republica/lula-e-vaiado-e-cobrado-por-corrupcao-em-discurso-no-parlamento-portugal/O presidente Lula foi vaiado por deputados  portugueses, com cartazes mandando ele ir pra cadeia , ladrão e etc.Como é a popularidade do Lula em Portugal ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450436",
  "comments": [
    {
      "author": "alegotardo",
      "created_time": "April 28, 2023, 12:47:07 AM",
      "body": "Quote from: bitmover on April 27, 2023, 11:55:04 PMO presidente Lula foi vaiado por deputados  portugueses, com cartazes mandando ele ir pra cadeia , ladrão e etc.Super cool isso aí Mas... deixando rivalidades políticas de lado, todo brasileiro deve se sentir tão humilhado como o presidente Lula deveria estar lá em Portugal Eu já tinha lido sobre os protestos na rua e cartazes contra Lula em Portugal, mas acreditava que era apenas o grupo bolsonarista \"de sempre\" fazendo sua parte. Mas ver essa notícia de que até mesmo os deputados estão mandando o ladrão voltar pra casa, é de fato uma cena lamentável.Enfim... com tantos problemas que ainda precisam ser resolvidos aqui no Brasil, eu acho que o nosso presidente se precipitou demais em ir fazer seu tour ainda nos primeiros meses de seu mandato.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "April 28, 2023, 12:58:17 AM",
      "body": "Nada demais. Se fosse o Bolsonaro era o pessoal da esquerda levando cartaz de genocida; como é o Lula, é de ladrão, etc... Aqui mesmo era capaz de termos o Biden ou Xi sendo chamado de comunista pela extrema direita.Quote from: alegotardo on April 28, 2023, 12:47:07 AMEnfim... com tantos problemas que ainda precisam ser resolvidos aqui no Brasil, eu acho que o nosso presidente se precipitou demais em ir fazer seu tour ainda nos primeiros meses de seu mandato.Com o que ele tem conseguido, discordo...Brasil firma acordos da ordem de R$ 62,5 bi com China e EAU e Lula ressalta protagonismo internacional do paísLula e Xi assinam 15 acordos envolvendo governos de Brasil e China; veja a listaQuoteAlém disso, também foram assinados outros 20 acordos comerciais entre empresas e entes públicos; parte dos acordos já havia sido antecipada pelo analista da CNN Caio Junqueira.Lula e Pedro Sánchez assinam três acordos entre Brasil e Espanha; veja a listaÉ assim que se faz geopolítica. Tem que sair, conversar, e buscar investimento. O Brasil não para por que o presidente pegou um avião até outro país.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batmanoftheblock",
      "created_time": "April 28, 2023, 02:45:46 AM",
      "body": "Quote from: TryNinja on April 28, 2023, 12:58:17 AMNada demais. Se fosse o Bolsonaro era o pessoal da esquerda levando cartaz de genocida; como é o Lula, é de ladrão, etc... Aqui mesmo era capaz de termos o Biden ou Xi sendo chamado de comunista pela extrema direita.Quote from: alegotardo on April 28, 2023, 12:47:07 AMEnfim... com tantos problemas que ainda precisam ser resolvidos aqui no Brasil, eu acho que o nosso presidente se precipitou demais em ir fazer seu tour ainda nos primeiros meses de seu mandato.Com o que ele tem conseguido, discordo...Brasil firma acordos da ordem de R$ 62,5 bi com China e EAU e Lula ressalta protagonismo internacional do paísLula e Xi assinam 15 acordos envolvendo governos de Brasil e China; veja a listaQuoteAlém disso, também foram assinados outros 20 acordos comerciais entre empresas e entes públicos; parte dos acordos já havia sido antecipada pelo analista da CNN Caio Junqueira.Lula e Pedro Sánchez assinam três acordos entre Brasil e Espanha; veja a listaÉ assim que se faz geopolítica. Tem que sair, conversar, e buscar investimento. O Brasil não para por que o presidente pegou um avião até outro país. Ah, cara, tipo assim, eu acho que a gente não pode ficar muito preso às ideias políticas e sim olhar os fatos, sabe? Tipo, o Lula pode ter feito umas coisas erradas, mas também pode ter feito outras boas, e a gente não pode ignorar isso. Mas, sei lá, eu não sou muito ligado em política, tô até meio com sono agora, rsrs. Mas é isso aí, acho que o importante é o Brasil se desenvolver e ter boas relações com outros países.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "April 28, 2023, 11:09:23 AM",
      "body": "Quote from: TryNinja on April 28, 2023, 12:58:17 AMNada demais. Se fosse o Bolsonaro era o pessoal da esquerda levando cartaz de genocida; como é o Lula, é de ladrão, etc... Aqui mesmo era capaz de termos o Biden ou Xi sendo chamado de comunista pela extrema direita.Uma coisa  é um politico ser vaiado por sua posicao politica, outra é por seu historico criminal.Lembrando que o Lula foi julgado e condenado em todas as instancias, e nunca foi inocentado. O julgamento foi apenas anulado. Os crimes continuam la.Quote from: batmanoftheblock on April 28, 2023, 02:45:46 AMAh, cara, tipo assim, eu acho que a gente não pode ficar muito preso às ideias políticas e sim olhar os fatos, sabe? Tipo, o Lula pode ter feito umas coisas erradas, mas também pode ter feito outras boas, e a gente não pode ignorar isso. Mas, sei lá, eu não sou muito ligado em política, tô até meio com sono agora, rsrs. Mas é isso aí, acho que o importante é o Brasil se desenvolver e ter boas relações com outros países.Rouba mas faz né. No Brasil roubar dinheiro publico é \"cool\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "April 28, 2023, 04:37:13 PM",
      "body": "Lula é vaiado pela extrema direita no Parlamento português. São os parlamentares do partido \"Chega\" de Portugal. São os \"bolsonaristas\" portugueses. Que por sinal tem estreita ligação com bolsonaristas brasileiros e de neofascistas de outros lugares. É uma minoria no parlamento português.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 29, 2023, 08:37:41 AM",
      "body": "Eu como não sigo politica e não apoio nenhum partido ou ideologia partidária, apenas posso comentar o que vou ouvindo (que não se é certou ou errado, e nem quero saber...).Mas, vocês nem imaginam a polemica que foi essa visita do Lula a Portugal.Começou logo no convite, que alegadamente não partiu das instancias institucionais corretas. Logo ai, muitos do parlamento ficaram indignados (não foi só esse partido).Depois, esse partido, avisou logo que se fosse realmente aprovado o discurso do Lula no parlamento, iria fazer um protesto dentro do parlamento, que foi o que aconteceu.Agora, estão todos zangados (ainda mais) uns com os outros, e já existe ameaças de penalizações a esse partido/deputados. Enfim, uma grande palhaçada!Quote from: Paredao on April 28, 2023, 04:37:13 PMÉ uma minoria no parlamento português.Ainda, mas estão a crescer muito rápido e com força.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "April 30, 2023, 08:08:05 PM",
      "body": "Quote from: joker_josue on April 29, 2023, 08:37:41 AMAinda, mas estão a crescer muito rápido e com força.Esse fenômeno do crescimento da extrema-direita não acontece somente em Portugal. Em outros países da Europa eles também estão crescendo. Veja por exemplo a Itália, onde a primeira-ministra é da extrema direita. Parece que o pesadelo está voltando, depois de passados quase cem anos. Lembra de nosso debate sobre o Salazarismo e a falta de conhecimento dos jovens a respeito do assunto ? Olha ai.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "April 30, 2023, 10:22:26 PM",
      "body": "Li uma notícia interessante relativa a um assunto que falamos esses dias.O milionários da América Latina estão tirando o dinheiro dos países devida a onda esquerdista que domina o continente https://www.bloomberg.com/news/features/2023-04-27/latin-america-s-socialist-wave-has-wealthy-moving-137-billion-abroad?utm_campaign=instagram-bio-link&utm_medium=social&utm_source=Instagram",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "April 30, 2023, 10:54:59 PM",
      "body": "O Partido que levantou os cartazes é um partido português recente que se revê totalmente no popularismo, discurso populista de extrema direita. O líder deste partido tem recebido muita atenção do povo porque há muita falta de cultura política entre o povo e nós portugueses (sim, eu sou português), somos uns patos (expressão que serve para denegrir a actitude altamente passiva do povo português), não nos revoltamos a sério, não partimos coisas, não incendiamos lojas, não barricamos estradas com pneus a arder, etc... Simplesmente acatamos o que nos obrigam a aceitar e pronto. E o tipo de discurso deste partido berra (não fala, berra mesmo) o que o povo gosta de ouvir. Mas é só isso. E embora isso cause desconforto, não sei se tem algum efeito prático no dia a dia da agenda política dos nossos governantes!Isto não quer dizer que eu esteja a defender o Lula, muito menos o Bolsonaro, no entanto é preciso não levar a peito estas acções populistas que se viram contra o Lula durante a sua visita.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batmanoftheblock",
      "created_time": "May 01, 2023, 10:32:54 AM",
      "body": "Quote from: darkv0rt3x on April 30, 2023, 10:54:59 PMO Partido que levantou os cartazes é um partido português recente que se revê totalmente no popularismo, discurso populista de extrema direita. O líder deste partido tem recebido muita atenção do povo porque há muita falta de cultura política entre o povo e nós portugueses (sim, eu sou português), somos uns patos (expressão que serve para denegrir a actitude altamente passiva do povo português), não nos revoltamos a sério, não partimos coisas, não incendiamos lojas, não barricamos estradas com pneus a arder, etc... Simplesmente acatamos o que nos obrigam a aceitar e pronto. E o tipo de discurso deste partido berra (não fala, berra mesmo) o que o povo gosta de ouvir. Mas é só isso. E embora isso cause desconforto, não sei se tem algum efeito prático no dia a dia da agenda política dos nossos governantes!Isto não quer dizer que eu esteja a defender o Lula, muito menos o Bolsonaro, no entanto é preciso não levar a peito estas acções populistas que se viram contra o Lula durante a sua visita.Realmente, é importante entender que esse tipo de reação populista não necessariamente reflete a opinião da maioria da população. O fato de um partido extremista ter levantado cartazes contra o Lula durante sua visita a Portugal não deve ser visto como uma representação da opinião do povo português como um todo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}