{
  "id": "topic_5441554",
  "title": "Question:",
  "author": "MiliMil",
  "created_time": "February 28, 2023, 01:12:27 PM",
  "content": "We are a few days out from UFC 285 and the main event is Jon Jones vs Ciryl Gane.I think Jon Jones is going to win this fight comfortably and is a deserved favourite going in.Although Jones is 18kg (almost 40 pounds) lighter, he has a much longer reach advantage.I have watched a lot of Ciryl and to be honest I wasn't very impressed. He struggled against Ngannou and was dropped by Tuivasa.I think Jon Jones makes a statement and may even submit Gane.I'm curious on what everybody else thinks.Please post your predictions below.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441554",
  "comments": [
    {
      "author": "Cointxz",
      "created_time": "February 28, 2023, 01:43:06 PM",
      "body": "To be fair, Francis Ngannou is too lethal which Bones will have a problem once he faced him. It’s understandable that Gane will fall short against the previous champion. Bones has the advantage here because of his experience and previous record. If Bones maintain his skills set then he can win this easily. Gane movement is easy to read and we know that Bones is so good on counter and sharp attack due to his bloody elbow and knee.I’m not sure about the odds by my money will go to Bones since his skills is already proven by beating tons of much solid fighter during his active career. I believe he can easily outplayed Gane on this match. Probably submission or k.o on result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "February 28, 2023, 02:23:38 PM",
      "body": "Quote from: Coin_trader on February 28, 2023, 01:43:06 PMI’m not sure about the odds by my money will go to Bones since his skills is already proven by beating tons of much solid fighter during his active career. I believe he can easily outplayed Gane on this match. Probably submission or k.o on result.Jones @1.59 and Gane @2.33 on ML. I don't think this match is going the distance so I would rather add the method of winning into the bet. I'm still choosing between Jones by submission or Gane by knockout.Gane is powerful enough to stun jones with one or two punches while Jones is skillful enough to take down his opponent and choke.Jones will most likely keep his distance and take Gane down if he gets too close.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "February 28, 2023, 02:29:42 PM",
      "body": "I don't understand why we need have one more thread when there's an existing thread where you can discuss any players that will fight in UFC 285, while this thread is only focus to Jones vs Gane.Here's the thread which currently discuss about UFC 285 The UFC Info and Prediction Thread.Anyway I'd choose Gane to win, but I will bet when the date is closer because I want to see if the odds will swing or not, now betting Gane to win is profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "February 28, 2023, 02:52:23 PM",
      "body": "It's easy to side with Jones as he had been at the top as GOAT beating several opponents of a different caliber. Being at 35 and bloated his weight, it could be that his agility may be different by now. On some other threads I visited, some discussions were actually not about him losing but whether will he win by submission or by decision. They seem to be very confident bettors as if Gane can't also strike Jones to KO. We're about to find out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "February 28, 2023, 04:38:29 PM",
      "body": "Quote from: MiliMil on February 28, 2023, 01:12:27 PMPlease post your predictions below.If you talk about Jones' career in the world of UFC Fighting and Jones fans, maybe not argue I think it's true, many are in favor of Jones rather than CIRYL, especially for UFC sports betting bettors in general, of course those who think Jones is a fighter who can be considered professional and pound-for-pound, but Gane is also a bettor who cannot be underestimated, the proof was against Tai, Derrick, Santos etc., who ended up being KO'd in 2022.I predict the heavyweight champion in the UFC between Gane vs Jones believe Jones' career will be taken by Gane, with my own reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erep",
      "created_time": "February 28, 2023, 06:34:54 PMLast edit: February 28, 2023, 08:00:55 PM by erep",
      "body": "Quote from: Apocollapse on February 28, 2023, 02:29:42 PMI don't understand why we need have one more thread when there's an existing thread where you can discuss any players that will fight in UFC 285, while this thread is only focus to Jones vs Gane.Here's the thread which currently discuss about UFC 285 The UFC Info and Prediction Thread.The UFC thread is already available for discussion of UFC events every week or every PPV so we don't need another thread to specifically discuss UFC, that's what I think instead of discussing the same thing again in the main thread about UFC.Quote from: Apocollapse on February 28, 2023, 02:29:42 PMAnyway I'd choose Gane to win, but I will bet when the date is closer because I want to see if the odds will swing or not, now betting Gane to win is profitable.I have watched Gane the last few fights, he had one loss against Ngannou and he has corrected his mistake last fight beat Tai Tuivasa, he will train hard to get back the UFC Heavyweight Championship belt, but I am not familiar with Jones and his fight history maybe he might better than Gane, but he hasn't fought in the octagon for a long time and his last fight will be in 2020,I can't determine the current opportunities and will review the potential of the two, it's difficult to make a choice because both are great fighters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "March 01, 2023, 09:13:35 AM",
      "body": "I also think that Jon Jones is going to win this fight. It's time to prove again and that he is back with this huge statement win.There are videos of Jones circulating, and he working on that take down of his and probably this will be his bread and butter in this fight. I'm not expecting this fight to last the full distance though. The under 4.5 rounds looks very attractive at 2.xx odds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "March 01, 2023, 12:05:31 PM",
      "body": "Quote from: MiliMil on February 28, 2023, 01:12:27 PMWe are a few days out from UFC 285 and the main event is Jon Jones vs Ciryl Gane.I think Jon Jones is going to win this fight comfortably and is a deserved favourite going in.Although Jones is 18kg (almost 40 pounds) lighter, he has a much longer reach advantage.I have watched a lot of Ciryl and to be honest I wasn't very impressed. He struggled against Ngannou and was dropped by Tuivasa.I think Jon Jones makes a statement and may even submit Gane.I'm curious on what everybody else thinks.Please post your predictions below.I'm a fan of Jon Jones because of his speed and timing but we need also need to consider that Jon Jones has not fought for a long time while Ciryl Gane fought 6 months ago against TUIVASA, and besides Jones is fighting in a heavyweight for the first time, a division which we have not yet determined if he can carry his speed I voted for Ciryl Gane to win the match, but I'm also comfortable and happy if Jon Jones will pull this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "March 01, 2023, 02:49:22 PM",
      "body": "Quote from: Yaunfitda on March 01, 2023, 09:13:35 AMI also think that Jon Jones is going to win this fight. It's time to prove again and that he is back with this huge statement win.There are videos of Jones circulating, and he working on that take down of his and probably this will be his bread and butter in this fight. I'm not expecting this fight to last the full distance though. The under 4.5 rounds looks very attractive at 2.xx odds.Would work not unless Gane would work on this one out. Jon jones has the advantage over record and other stats but given that Gane would be the underdog in this fight, for sure he'd make way to be victorious. This could be a brighter spotlight on his end therefore we may assume a better fighter of him with this fight. As for Jon Jones, he became quiet for the recent years not to mention the unanimous decision which could leave him unsatisfied.Quote from: aioc on March 01, 2023, 12:05:31 PMQuote from: MiliMil on February 28, 2023, 01:12:27 PMWe are a few days out from UFC 285 and the main event is Jon Jones vs Ciryl Gane.I think Jon Jones is going to win this fight comfortably and is a deserved favourite going in.Although Jones is 18kg (almost 40 pounds) lighter, he has a much longer reach advantage.I have watched a lot of Ciryl and to be honest I wasn't very impressed. He struggled against Ngannou and was dropped by Tuivasa.I think Jon Jones makes a statement and may even submit Gane.I'm curious on what everybody else thinks.Please post your predictions below.I'm a fan of Jon Jones because of his speed and timing but we need also need to consider that Jon Jones has not fought for a long time while Ciryl Gane fought 6 months ago against TUIVASA, and besides Jones is fighting in a heavyweight for the first time, a division which we have not yet determined if he can carry his speed I voted for Ciryl Gane to win the match, but I'm also comfortable and happy if Jon Jones will pull this one.I agree. Experience wise, jones would be more dominant but recency of fight could also be a factor; drive.An interesting match up especially to fans of Bones who are really excited to see him again on the octagon. As for Gane I think he really has nothing to lose which could also be an advantage for him to be confident with this one. Odds are abit huge but I'd more mind enjoying this match up but will also be on Bones' side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "March 01, 2023, 03:16:24 PM",
      "body": "I don't like Jon Jones at all because there is always drama in his fights. There have been a lot of problems with doping, so, I don't know what to expect this time, but I can smell the drama. I feel like Jon Jones will win this fight, I don't like at all the low odds on Jon because even if he has a better reach I feel like Ciryl has a better KO power. And the fact that Jones hasn't fought in a long time is something that we should consider too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "March 01, 2023, 03:29:23 PM",
      "body": "Jones is a tactical fighter all his moves are calculated I'm sure he studied Gane's moves, his strong point, and weakness, I don't think Ciryl can match his vast experience in wrestling and kickboxing, I have Jon Jones winning here even if he has a long lay off, I have followed his social media account and he keeps himself fit.I think he knows that there's a huge match that will come along so he keeps himself busy and fit and this is the fight that will put his name on top again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "March 01, 2023, 05:07:06 PM",
      "body": "Quote from: YOSHIE on February 28, 2023, 04:38:29 PMQuote from: MiliMil on February 28, 2023, 01:12:27 PMPlease post your predictions below.If you talk about Jones' career in the world of UFC Fighting and Jones fans, maybe not argue I think it's true, many are in favor of Jones rather than CIRYL, especially for UFC sports betting bettors in general, of course those who think Jones is a fighter who can be considered professional and pound-for-pound, but Gane is also a bettor who cannot be underestimated, the proof was against Tai, Derrick, Santos etc., who ended up being KO'd in 2022.I predict the heavyweight champion in the UFC between Gane vs Jones believe Jones' career will be taken by Gane, with my own reasons.I think so too. Just like Jones, Gane is also an intelligent fighter who is big yet also can move as quickly as possible. A reason why he fell against Ngannnou was that of the takedowns which he might just avoid this time around with Jones. A mistake he can now correct but he should be the one taking down Jones since he has the shorter reach. It will really startle Jones fans if Gane can do t his and the result is upset by KO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eaLiTy",
      "created_time": "March 01, 2023, 06:24:46 PM",
      "body": "Quote from: Yogee on February 28, 2023, 02:23:38 PM~Jones @1.59 and Gane @2.33 on ML. I don't think this match is going the distance so I would rather add the method of winning into the bet. I'm still choosing between Jones by submission or Gane by knockout.Jon Jones usually fights according to the strengths of his opponents when he was in Light Heavyweight division, if he faces a striker, he usually tries to out strike the striker and if he is facing a wrestler he usually out wrestle his opponent to prove a point but in the Heavy Weight division i hope he will fight according to his strengths rather than proving a point to the opponent and Jon Jones has one of the best ground and pound in the game and he could finish Gane in the ground with strikes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "March 01, 2023, 09:58:42 PM",
      "body": "There are a lot of angles to the Jon Jones vs Ciryl Gane match up.Dontale Mayes fought Ciryl Gane back in 2019. It was a close fight up until Gane pulled out a submission win. Dontale Mayes is one of Jon Jones long time teammates. Which means Jones has a training partner who has spent 3 rounds in the cage with Gane. The fight between Dontale Mayes and Ciryl Gane being a close one, is probably the reason Jones isn't giving Gane much credit. Jones said he isn't certain if Gane deserves to be called the most technical kickboxer he has ever faced. But that comment was made towards 2019 Ciryl Gane who had a close fight with Dontale mayes.All of this could mean Jon Jones is overlooking Gane and not taking him seriously.I think that Gane has improved tremendously since he fought Jon Jones teammate Dontale Mayes in 2019. Game has become a more technical and dangerous kickboxer.It all comes down to Jon Jones health. If he spent his time off doing cocaine and drinking alcohol I think Ciryl Gane will beat him. But if Jones shows up healthy and motivated to fight I think he should be able to outwrestled and outgrapple Gane the way that Ngannou did.Some pros and analysts are claiming Jon Jones might be injured leading into this fight, which is why he's in the pool so often for UFC embeddeds. They say its to protect his injured joints. Which is a similar situation to the one Ngannou was in when he fought Gane. There were many rumors that Ngannou had an injured knee, which could have motivated Gane to pursue a knee lock on the knee he thought was injured. So we can see from history that Jon Jones being injured would not necessarily mean he will lose the fight. Considering Ngannou was confirmed as having an injured knee, when he fought Ciryl Gane.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "March 01, 2023, 10:28:11 PM",
      "body": "Quote from: seoincorporation on March 01, 2023, 03:16:24 PMI don't like Jon Jones at all because there is always drama in his fights. There have been a lot of problems with doping, so, I don't know what to expect this time, but I can smell the drama. I feel like Jon Jones will win this fight, I don't like at all the low odds on Jon because even if he has a better reach I feel like Ciryl has a better KO power. And the fact that Jones hasn't fought in a long time is something that we should consider too.While, some of that might be true. Jon Jones is an incredible wrestler, and that doesn't require as much explosive power or sharpness. Therefore, he won't feel the rust so much. Unless, Jon Jones decides to strike, and only strike I can him pretty much having this fight the way he wants. If he does just strike, he's basically choosing the hardest path to victory. Even then, he's a pretty damn good striker. Jon Jones in his prime walks this fight, but who knows what sort of state he's in with this lengthy layoff. Personally, I think he'll be alright.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "March 01, 2023, 10:51:27 PMLast edit: March 01, 2023, 11:18:42 PM by Saint-loup",
      "body": "Quote from: Yogee on February 28, 2023, 02:23:38 PMQuote from: Coin_trader on February 28, 2023, 01:43:06 PMI’m not sure about the odds by my money will go to Bones since his skills is already proven by beating tons of much solid fighter during his active career. I believe he can easily outplayed Gane on this match. Probably submission or k.o on result.Jones @1.59 and Gane @2.33 on ML. I don't think this match is going the distance so I would rather add the method of winning into the bet. I'm still choosing between Jones by submission or Gane by knockout.Gane is powerful enough to stun jones with one or two punches while Jones is skillful enough to take down his opponent and choke.Jones will most likely keep his distance and take Gane down if he gets too close.Those odds are ridiculous, and are insulting for Cyril le Bon Gamin. Jon Jones hasn't fought since 3 years (february 2020) and has never fought in the Heavyweight category before. He is clearly not a HW fighter while Cyril definitely is. So I will definitely bet my money on him because I think real odds are @1.80 for Gane. I think it's a mistake for Jon Jones, to start his come back by doing a fight with a such talented fighter, in a heavier category than his natural one.Quote from: MiliMil on February 28, 2023, 01:12:27 PMI have watched a lot of Ciryl and to be honest I wasn't very impressed. He struggled against Ngannou and was dropped by Tuivasa.What do you mean by that?Cyril just destroyed Tuivasa with a powerful KO.https://www.youtube.com/watch?v=c-6FeaNi-o8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "March 02, 2023, 01:07:23 AM",
      "body": "I'm for Jon Jones here. But I'm curious how he will be in this come back fight. It's been years since he last fought. That was still way back UFC 247 against Reyes which he only won via UD. Even before that, Jones only had a split decision against Thiago. Those couple of last fights might suggest something.And this come back fight of his will be in the heavyweight division. This is interesting. I agree with the odds, though. Jones will probably be the winner despite his inactivity. And Gane is not really a difficult opponent, although the weight will probably prove to be an issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "March 02, 2023, 01:16:12 AM",
      "body": "Quote from: Darker45 on March 02, 2023, 01:07:23 AMI'm for Jon Jones here. But I'm curious how he will be in this come back fight. It's been years since he last fought. That was still way back UFC 247 against Reyes which he only won via UD. Even before that, Jones only had a split decision against Thiago. Those couple of last fights might suggest something.And this come back fight of his will be in the heavyweight division. This is interesting. I agree with the odds, though. Jones will probably be the winner despite his inactivity. And Gane is not really a difficult opponent, although the weight will probably prove to be an issue. Everyone is really going to have to watch this fight, as you have said, he has been out for many years and this is going to be his comeback fight. Many of us here hates Jon Jones, but his body of work during his prime at LHW can't be denied as he clean up that division.And so to enhance his legacy he has to take this fight and move to HW.  And I think he is more capable to make a statement win in his comeback against Gane here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "March 02, 2023, 01:41:28 AM",
      "body": "I am also looking for Jones to win this fight as he has all the advantage and chances to take this fight but of course Gane is a goodfighter and we knew that a single hit can bring them down so meaning both has a opportunity to win and only needed a perfect timing .waiting for the Odds and will put my bet for this one as  I am waiting for Jones fight since last year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}