{
  "id": "topic_5440636",
  "title": "csgobettor",
  "author": "csgobettor",
  "created_time": "February 21, 2023, 03:30:07 AM",
  "content": "Hello, first of all, before creating this thread I tried to PM rollbit staff on this forum, (sort it out privately as people) but it's not possible because they do not accept messages from rookie accounts. I will delete this thread if my deposit is returnedI would like to inform you that I have been banned from the ROLLBIT.COM website where I had my first account. No withdrawal ever came to the withdrawal address. When I entered it, withdraw didn't arrive and I immediately contacted the live support to solve it. On live support I was told that everything will be fine but I have to go through the KYC process, the same minute I forwarded them my KYC photo ID, selfie with rollbit written on it. After checking the details we were supposed to go for a video call which however never happened because they stopped responding and after a week of trying to make contact and make arrangement I got a message that my account has been permanently blocked . I only have few screenshots here because the conversation somehow got DELETED (maybe by rollbit staff to hide evidence) but on the screenshots you can clearly see the icons that proves I was in contact with atleast 3 different live assistants.My account never violated any terms and conditions , has no suspicious bets /void, limited maxbet etc. I am a legitimate player.I politely ask ROLLBIT staff for the video call we agreed on and a refund of the deposit. KYC and Video call will prove that I was using this site for the first time ever.Rollbit account email: mrsergeib@gmail.comScammers Profile Link: https://bitcointalk.org/index.php?action=profile;u=3067300Scammed amount: 1600+USD (Deposit 1497 USD)Deposit ETH Tx hash: 0xa14b6c125c643aba3e0aa5d167eb7ce0ffa473fad8368ed0ab6cc988ba00d4b3https://imgur.com/a/Dp6A7WF proof",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440636",
  "comments": [
    {
      "author": "acroman08",
      "created_time": "February 21, 2023, 06:55:59 AM",
      "body": "from what I have seen on their ToS gamblers from the Czech republic are prohibited from using the gambling site(I assume you are from Czech republic after using google translate the language on the screenshot you shared), did you perhaps use a VPN to bypass this restriction? you can try posting this issue on their ANN thread if you want exposure on your issue and perhaps get more answers from the representative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "February 21, 2023, 09:08:22 AM",
      "body": "Quote from: acroman08 on February 21, 2023, 06:55:59 AMfrom what I have seen on their ToS gamblers from the Czech republic are prohibited from using the gambling site(I assume you are from Czech republic after using google translate the language on the screenshot you shared), did you perhaps use a VPN to bypass this restriction? Based on the email OP was tagged as multi accounting linking to other abusers that was banned to sportsbook. However, just like what we are seeing from other complaints on other casinos such tagged (multi accounting) have zero posts about the evidence on how the accounts are connected. When a casino labeled an account as multi accounting they wont give an explanation or even a mere evidence on why it happens lmao. Then confiscate the balance, that's it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "February 21, 2023, 01:25:25 PM",
      "body": "If your claim is truly genuine, is there any chance that you registered or accessed the platform using a VPN service?It looks like they have already made a decision to ban your account. I don't know if there is an option to appeal the ban, but you could try messaging this other representative of theirs Rollbit RazerI am sure they will notice this thread and give an explanation on what happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "February 21, 2023, 02:38:33 PM",
      "body": "Sorry for your lost. I have to through the post of other posters here and I see some sense in what they are talking. Rollbit I know is a popular and reputable casino here with no past records of any scam accusations levied on them. How come you are the first I have seen to label rollbit a scam casino without due diligence. Were you using vpn to access your account? How is it possible that your account would just get banned just like that without any default from account holder. It is not possible you must have defaulted somewhere so and it is advised I general that you do your best to save or screenshot your activities on casinos so if there be any issues in the nearest future, you would have evidence to present as fact but here there are no much evidence to back up your claims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "csgobettor",
      "created_time": "February 21, 2023, 02:48:48 PM",
      "body": "I never used any VPN service or public Wi-Fi, I used 4G data network from my operator (I know using VPN is prohibited). I can access and bet on this website from Czech Republic.as I mentioned before, I never meant to start a public thread and try to damage someone's reputation so I tried to send them private messages here, but every time it writes an error message that they don't accept messages from newbies. I'm asking the rollbit staff to private message me here and I'll delete this thread when they arrange the promised video call and return the deposit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "February 21, 2023, 03:13:10 PM",
      "body": "Quote from: csgobettor on February 21, 2023, 02:48:48 PMI never used any VPN service or public Wi-Fi, I used 4G data network from my operator (I know using VPN is prohibited). I can access and bet on this website from Czech Republic.as I mentioned before, I never meant to start a public thread and try to damage someone's reputation so I tried to send them private messages here, but every time it writes an error message that they don't accept messages from newbies. I'm asking the rollbit staff to private message me here and I'll delete this thread when they arrange the promised video call and return the depositnow, even if you can prove that you are not connected to the accounts that you are being linked to, you still broke their ToS(at least as far as their ToS say).the only way their reputation will be tarnished is if they actually scammed someone, so don't worry about posting complaints against a casino if you think you are being wronged. also, thread creator cannot delete their own thread, they can edit the thread but not delete it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "csgobettor",
      "created_time": "February 21, 2023, 03:27:21 PM",
      "body": "I can only see that Czech Republic is restricted from playing \"All NetEnt Casino Games\" in their Terms and conditions, I never played any casino game, I used sports betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sujonali1819",
      "created_time": "February 21, 2023, 03:57:49 PM",
      "body": "Quote from: csgobettor on February 21, 2023, 03:27:21 PMI can only see that Czech Republic is restricted from playing \"All NetEnt Casino Games\" in their Terms and conditions, I never played any casino game, I used sports betting.Yeah, this is what is mentioned in the terms and conditions of rollbit. I found the list of Restricted countries by them here: https://help.rollbit.com/en/articles/6176539-restricted-countries, I can not see Czech Republic republic is involved there. So it's really hard to guess the possible reason for blocking if you did not try any NetEnt Casino games except if they explain the reason. They are actively promoting them and I can see the official account was also active yesterday, I will suggest making a post on their announcement thread to let them know about this thread. Hopefully, they will come here to explain the issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "February 21, 2023, 04:22:33 PM",
      "body": "Quote from: csgobettor on February 21, 2023, 03:27:21 PMI can only see that Czech Republic is restricted from playing \"All NetEnt Casino Games\" in their Terms and conditions, I never played any casino game, I used sports betting.you are right, I checked again, and it seems the restriction to Czech republic only applied to netent games. anyway, I sent them a PM with a link to this thread but I still suggest posting on their ANN thread as I previously mention and sujonali1819 suggested, don't worry about their reputation, it won't be damaged if they didn't do anything wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "February 21, 2023, 10:38:56 PM",
      "body": "Quote from: csgobettor on February 21, 2023, 02:48:48 PMI'm asking the rollbit staff to private message me here and I'll delete this thread when they arrange the promised video call and return the depositHave you tried sending a PM to the second profile I shared in the reply?. If your rank is still blocked, please alert me and I will try to help you pass the message.Honestly, I don't see why they (rollbit) should block newbie rank users from sending messages to them here (it's a forum feature, but they are a service that will attract complaints from different ranks, not just higher ranks.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}