{
  "id": "topic_5470060",
  "title": "cryptoWODL",
  "author": "cryptoWODL",
  "created_time": "October 12, 2023, 09:58:28 AM",
  "content": "We all have a hobby or a dream, be it big or small.Like everyone else I have a dream from childhood that one day I will grow up and buy my dream bike.I tried many times to buy this bike of my dreams but failed time and time again due to not having enough money.I told the family a lot but they are not willing to buy the bike at such a price so I forced myself to save some money from my job salary and bought a small amount of bitcoins at the moment.I have currently bought about $750 worth of bitcoins to fulfill my dream.One of the reasons for this is that the Bitcoin halving will begin in the early 2024, after which the market is expected to grow again.At the moment, the price of Bitcoin is like this. I bought the amount of Bitcoin with 750 dollars in this situation. If the price of Bitcoin doubles from the current price, then my dream will be one step further.Was I right to invest in Bitcoin to buy my dream bike?I gave an example with this picture.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470060",
  "comments": [
    {
      "author": "Husires",
      "created_time": "October 12, 2023, 10:04:16 AM",
      "body": "$759 will not represent an investment that will change your life, but it is a step forward towards achieving more income, which may generate 3 times your investment in the future.Is the bike you are looking for a motorcycle or a regular bike, because the price of bikes on average here ranges from $200 to $800, and 750 will definitely buy you a bike, or you can wait until the Bitcoin price is 60,000 and you get your capital back and a bike.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 12, 2023, 10:06:13 AM",
      "body": "Quote from: cryptoWODL on October 12, 2023, 09:58:28 AMBitcoin halving will begin in the early 2024, after which the market is expected to grow again.Bitcoin halving would occur in early 2024 (likely in April), not that it would begin in 2023 because there has always been halving after every 210000 blocks mined. If you are expecting the price of bitcoin to increase, you will not be disappointed because 2024 and 2025 will favour bitcoin holders. Expect at least 5x profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "October 12, 2023, 10:22:30 AM",
      "body": "Quote from: cryptoWODL on October 12, 2023, 09:58:28 AMWe all have a hobby or a dream, be it big or small.Like everyone else I have a dream from childhood that one day I will grow up and buy my dream bike.I tried many times to buy this bike of my dreams but failed time and time again due to not having enough money.I told the family a lot but they are not willing to buy the bike at such a price so I forced myself to save some money from my job salary and bought a small amount of bitcoins at the moment.I have currently bought about $750 worth of bitcoins to fulfill my dream.One of the reasons for this is that the Bitcoin halving will begin in the early 2024, after which the market is expected to grow again.At the moment, the price of Bitcoin is like this. I bought the amount of Bitcoin with 750 dollars in this situation. If the price of Bitcoin doubles from the current price, then my dream will be one step further.Was I right to invest in Bitcoin to buy my dream bike?I gave an example with this picture.But how much is the bike you plan to buy worth? Because for 750$ in my country, you can easily buy a bike. And if your goal is just a bike, then I think with that bitcoin investment, you can realize your dream during the next bull season. But if your goal is to become rich or earn 10, 100 times profits, it is impossible. Bitcoin can't do that for you in just a few short years. More importantly, although history tells us that after the halving we will have a bull season, but there is no guarantee that things will repeat, you should think about it, history probably won't repeat and a new history will be created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "October 12, 2023, 10:24:43 AM",
      "body": "Quote from: cryptoWODL on October 12, 2023, 09:58:28 AMWas I right to invest in Bitcoin to buy my dream bike?I gave an example with this picture.Firstly, I quote your link to give readers the exact image of your dream bike. Secondly, this is a good investment to make your dream of owning a bike a reality because of the trust you have in Bitcoin. But you should be patient because there is no specific date for when the Bitcoin price will double, but there is hope that the price will go up in the years 2024–2025. That is why I said you should be patient and keep holding your Bitcoin until your dream comes true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "October 12, 2023, 10:34:43 AM",
      "body": "Achieving your dream bike is positively just some months away if you can continue hodling your bitcoin you have bought in that amount of $750 because with the halving followed by the bullrun to the next bitcoin ATH you will definitely make profit that can afford you that bike you desire be it a common bike or a motorcycle bike. I love the fact that people who never had an opportunity to achieve their dreams hobby are getting that opportunity through bitcoin and it's something to be happy about. Congratulations in advance op.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 12, 2023, 11:04:44 AM",
      "body": "You can do absolutely anything you want with your bitcoins. Nobody should tell you what you can or can't do with your money. Not even the banks that give you access to your money. That's why bitcoin was created actually, as you probably know.So if you hear anyone telling you that it was wrong and you should've invested it, keep that in mind. (Although if you literally emptied your wallet for it, you might want to make sure you have more money from somewhere else to call on.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "October 12, 2023, 11:33:54 AM",
      "body": "Quote from: Husires on October 12, 2023, 10:04:16 AM$759 will not represent an investment that will change your life, but it is a step forward towards achieving more income, which may generate 3 times your investment in the future.Is the bike you are looking for a motorcycle or a regular bike, because the price of bikes on average here ranges from $200 to $800, and 750 will definitely buy you a bike, or you can wait until the Bitcoin price is 60,000 and you get your capital back and a bike.I believe the bike he shared the picture of in the OP is what we refer here as Power bike, From what I know, power bikes can be referred to as high performance bike, and they are usually very much more expensive than $200 to $800 you mentioned. Though how expensive it is usually depends on the make, and the quality of the bike, as well as the performance.Like myself, I bought one regular bike last year for around $600, though not the kind is sophisticated bike like the OP wants, I would personally refer to mine as a motorcycle.What I will really advice OP is that, Bike is not the most important thing in life, no matter how much he loves it, he's investing in Bitcoin should be to change his life financially and not just to buy bike, Bike is a liability, he already invested $750 in bitcoin, he should try and invest even more in preparation for the coming halving and possible bull run, if this investment triples in growth, he should invest in a good business rather than use the entire money to buy a bike which will only take money away from him going forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 12, 2023, 11:39:29 AM",
      "body": "There should be nothing wrong in advising people so don't take this personally, I believe you are in rush to get a dream bike, what happens after that? See we are all meant to life a happy life but this bike won't set you up for long, they lose value over time. I am not trying to ruin your plan, I have dreams of getting some things too and I did, but I was able to get them when I made a lot of money. You want to be happy and get your dream bike? Make more money than your dream bike amount, you have invested $750? That's good enough, but Bitcoin will do more than 2x that you are expecting, so relax, there is no point in running, remember that in 2025 your age won't be the same, this dream bike can't start vomiting money for you. Be ready to keep the bike and to have something good going on for you, tomorrow's battle starts today, If I were you, since you are still struggling financially, I will keep working a job and slowly increase my Bitcoin bag, if you can't do this it's fine. Just make sure you take profit after Bitcoin reach at least $67,000 or more again because it's obvious that Bitcoin always beat its old all time high, so relax and it will be smarter if you think about how to make extra income now to get more Bitcoin, do not let the dream bike be your only goal, but like I've said its not a must if you can't afford extra income to keep dollar cost averaging. You my friend is on the right track and don't ever feel limited, you can do more than you think you can. All the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "October 12, 2023, 11:39:41 AM",
      "body": "Quote from: cryptoWODL on October 12, 2023, 09:58:28 AMI have currently bought about $750 worth of bitcoins to fulfill my dream.One of the reasons for this is that the Bitcoin halving will begin in the early 2024, after which the market is expected to grow again.You have a good intention for doing this, however, there are a number of things to consider before drawing a conclusion on what you should expect as a return from this, have you first considers the type of Bike you're intending to buy and the cost to it, also try to do the arithmetic behind your current investment amount to the present bitcoin market price and calculate what will turn the outcome for your investment if we get to $68,000 and form a new all time high with your $750 investment if the market price reach $100,000 after next year halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "October 12, 2023, 11:50:17 AM",
      "body": "we all here have different dreams about investing in bitcoin. some want to buy a house, become rich, etc., we all hope for the best from our investment in bitcoin. your decision to invest in bitcoin to buy a bicycle is right. it's possible that next year your current investment will increase in value and maybe you will be able to buy your bicycle with this investment.but it seems that in this process you will have other goals that make you think about investing in bitcoin for a longer period of time and if that is true i think investing and holding bitcoin for longer might be an even better decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 12, 2023, 12:07:46 PM",
      "body": "Quote from: cryptoWODL on October 12, 2023, 09:58:28 AMWas I right to invest in Bitcoin to buy my dream bike?We all have our own dreams and goals why we're investing on Bitcoin and yours won't be different to ours that are dreaming to buy our first house and land property, dream cars and etc. The discretion whether it's a good reason for you to invest to Bitcoin to buy your dream bike will depend on you since it's your goal and as you've said, that's your dream so let's just say that it's not wrong at all. Things like these are very satisfying and achieving not just to the physical after we purchase it but mentally, it gives us that satisfaction that can't be par with money. There's no need for you to get the approval of others if that's your plan in the first place because only you can give that validation to yourself that you're doing the right thing and you've got the reason why you invested on this market. If some people are telling you negatively about that plan of yours, don't hear them out and just let them say what they want to say. Don't mind what they say and just focus on what you're aiming and that's your goal to purchase that dream bike of yours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xcode7",
      "created_time": "October 12, 2023, 12:16:00 PMLast edit: October 12, 2023, 12:26:16 PM by Xcode7",
      "body": "Quote from: 348Judah on October 12, 2023, 11:39:41 AMQuote from: cryptoWODL on October 12, 2023, 09:58:28 AMI have currently bought about $750 worth of bitcoins to fulfill my dream.One of the reasons for this is that the Bitcoin halving will begin in the early 2024, after which the market is expected to grow again.You have a good intention for doing this, however, there are a number of things to consider before drawing a conclusion on what you should expect as a return from this, have you first considers the type of Bike you're intending to buy and the cost to it, also try to do the arithmetic behind your current investment amount to the present bitcoin market price and calculate what will turn the outcome for your investment if we get to $68,000 and form a new all time high with your $750 investment if the market price reach $100,000 after next year halving.Besides, at least he tried to make his wish come true.I think $750 is enough to invest in Bitcoin and of course whatever increases and decreases that occur later will be proportional to the capital he has.However, his belief in investing in Bitcoin thinking that there will be an increase after the halving is a quite positive first step in my opinion, with the amount of speculation currently available, people who believe and think that there will be an increase after the halving in my opinion are people who lucky, because I thought so too and did the same thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "October 12, 2023, 12:19:21 PM",
      "body": "Quote from: cryptoWODL on October 12, 2023, 09:58:28 AMI have currently bought about $750 worth of bitcoins to fulfill my dream.One of the reasons for this is that the Bitcoin halving will begin in the early 2024, after which the market is expected to grow again.At the moment, the price of Bitcoin is like this. I bought the amount of Bitcoin with 750 dollars in this situation. If the price of Bitcoin doubles from the current price, then my dream will be one step further.Was I right to invest in Bitcoin to buy my dream bike?It is a good decision you made to buy bitcoin, not shitcoins.Bitcoin is safe for you as an investment and because you don't hope higher than doubling your capital, you can get it in 2024 bull run after the halving. Maybe some months after the halving, your dream will come true. In the mean time, you must store your bitcoin safely. $750 is good amount so you can afford to pay withdrawal fee from exchange to your non custodial wallet where you can store your bitcoin more safely.Use free wallet (open source, non custodial) like Electrum wallet.Reminder: do not keep your money in online accountsHow to Safely Download and Verify Electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "October 12, 2023, 12:23:03 PM",
      "body": "In my country your dream bike sells for around $2,400, there is still a lot you need to collect if you have only collected $750 now. Your steps are very good for making your dreams come true, taking advantage of the Halving which is expected to start in early 2024 can increase the value of your investment if the price trades as you estimate. Continue to increase the amount of investment if you really believe that the price of Bitcoin can increase two or three times after the Halving, profits plus capital can make your dreams come true which have not yet come true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 12, 2023, 12:23:21 PM",
      "body": "@OP remember, someone can even sold their coins during bear market, it's not because they're weak hands, but they're need money urgently to pay medical bill. It's bad for sell Bitcoin for paying medical bill? nope, that's actually a good choice because you don't have any option, someone else health is valuable than money.So in short, you can do anything with your money and there's nothing wrong except you invest in a ponzi scheme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 12, 2023, 12:41:27 PM",
      "body": "You have already invested, so do not let scammers steal your efforts. Learn how to protect your seeds by either using an airgrapped system or purchasing a USB and burning an operating system on it, disconnecting all parts connected to the network and creating seeds using Electrum. Any wallet is well programmed and open source, and wait until it the price of Bitcoin be the same of that bike value",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "October 12, 2023, 12:43:00 PM",
      "body": "Quote from: cryptoWODL on October 12, 2023, 09:58:28 AM-snip-If you return the price 4 times, then you will get $3,000 and you will get your dream bicycle if calculated with the exchange rate of the Fiat currency that I use. That's just an example and you will get higher if the amount of Bitcoin you buy exceeds $750. Maybe you can buy other dreams other than the bicycle you want now.Can you make sure that the motorcycle model is your dream because when you reach the price return you invest, the company from the motorbike will issue the latest models that are more manly for you to use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dimitri94",
      "created_time": "October 12, 2023, 12:52:49 PM",
      "body": "Quote from: cryptoWODL on October 12, 2023, 09:58:28 AMWe all have a hobby or a dream, be it big or small.Like everyone else I have a dream from childhood that one day I will grow up and buy my dream bike.I tried many times to buy this bike of my dreams but failed time and time again due to not having enough money.I told the family a lot but they are not willing to buy the bike at such a price so I forced myself to save some money from my job salary and bought a small amount of bitcoins at the moment.I have currently bought about $750 worth of bitcoins to fulfill my dream.One of the reasons for this is that the Bitcoin halving will begin in the early 2024, after which the market is expected to grow again.At the moment, the price of Bitcoin is like this. I bought the amount of Bitcoin with 750 dollars in this situation. If the price of Bitcoin doubles from the current price, then my dream will be one step further.Was I right to invest in Bitcoin to buy my dream bike?It is definitely a good job that many people today have chosen Bitcoin to fulfill their dreams. Bitcoin is the only reliable coin in the crypto world that will definitely play a role in fulfilling the dream in the long run. Bitcoin has been bearish for a long time and still on going but as the halving approaches, the price of Bitcoin will continue to rise. Although there is no certainty, this can be easily assumed by reviewing past history. If you keep your money in a bank or financial institution, you will not be able to quickly double your money from there. You must wait a long time. But it is not impossible if we expect even 10 times the investment in Bitcoin. So Bitcoin will be a good investment medium for fulfill dreams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "October 12, 2023, 01:03:39 PM",
      "body": "If that's your dream since childhood, why not just buy a bicycle, why buy bitcoin? because if something happens to you but you haven't bought a bicycle, it will make your soul restless. LOL My question is how much does your dream bike cost?The choice to buy bitcoins instead of buying a bicycle is a good decision and I think you have studied bitcoins before deciding to invest. The decision you choose will be very visible when Bitcoin hits its next ATH moment and you can choose to buy a bike after that. You are on the right track now and keep maintaining those good wishes until what you want to achieve is realized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}