{
  "id": "topic_5445884",
  "title": "AlyattesLydia",
  "author": "AlyattesLydia",
  "created_time": "March 22, 2023, 07:24:53 AMLast edit: March 22, 2023, 09:16:18 AM by AlyattesLydia",
  "content": "Çevremde birçok kişi TOGG ön satış için başvurada bulundu ya da bulunmayı düşünüyor. Sizce şuan f/p olarak bu tarz bir başvuru yapmak mantıklı mı? Kendimce bir trade off çıkardım.Avantajları:- Elektrikli araç, özelliklerine göre fiyatı düşük sayılır,- Türk malı olacağı için funları olacaktır ve piyasasını kısa sürede yükseltebilir,- Yakıt maliyeti oldukça düşük olabilir,- Bakım maliyeti ilk zamanlar düşük olabilir,- Togg'a özel cazip kredi imkanları olabilir,- Devrim'den sonra gelen ilk araç olması hasebiyle çok özenilmiş olabilir.Dezavantajları:- Güvenlik testleri henüz yapılmamış,- Araç hakkında çok şikayet gelmesi durumunda sıkıntı olabilir,- Aracın farklı kronik problemleri olabilir,- Yaygın bir servis ağı yok, (Bosh ile anlaşmış olsalalar bile)- Yaygın bir şarj istasyon desteği yok,- Yedekparça desteği sorun olabilir,- Global bilinirlik yok.Çekilişin noter huzurunda online yayınlanacağı söyledikleri için çıkma ihtimali var. Başvuru için 60 bin tl gibi bir rakam istiyorlar. Dolar kurunun ne yapacağının belli olmadığı şu dönemde parayı direk bağlamak istemem ama kredi kartı ile alınabilir. Kredi kartı kesim tarihim 25 Mart, 26 Mart'da satın alıp, çıkmıyorsa 14 gün içinde iade edilirse maddi bir kaybım olmaz. Araç çıkarsa, bir süre kullanıp memnun kalırsam devam ederim yok memnun kalmazsam ve fiyatı 400-500 bin TL artarsa satarak kar almayı amaçlıyorum. Bu biraz launchpad gibi kısa sürede güzel para da kazandırabilir. Her şeyin kötü gitmesi durumunda biraz para da kaybettirebilir ama kredi olursa ve araçta çok kötü çıkmazsa, bu enflasyon ortamında yatırılan paranın çok kaybetmemesini öngörüyorum.Son olarak TOGG ile Akp'yi ayrı tutuyorum. Doğru, Akp destekli bir proje olduğu için göstermelik bir şeyler yapıp bizi zora düşürürler mi emin değilim ama Gürcan Karakaş en azından güvenilir bir isim olduğu için bu riski alıyorum. Siyaset bağımsız olarak TOGG'un başarılı olmasına ihtiyacımız var.Peki siz ne düşünüyorsunuz?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445884",
  "comments": [
    {
      "author": "trendcoin",
      "created_time": "March 22, 2023, 08:32:24 AM",
      "body": "ilk olarak fabrikası yok diyenler vardı, birkaç ay önce üretim bandı yok diyenleri gördük (fatih altay mıdır nedir o malum kişi ve cevheri güven gibi bazı gazetecimsiler benzer şeyler yazdı), bugün \"başvuralım mı yoksa başvurmayalım mı\" noktasına doğru bir gidişat var. :)gördüğünüz gibi zaman her şeyi değiştiriyor; zor olan yapılmış ise bugün dezavantaj gibi görülen bazı ufak problemler de zamanla muhakkak aşılacaktır bence... ki bunların hiçbiri şimdiye kadar yapılmış olan işten daha zor olan şeyler değil.Quote from: AlyattesLydia on March 22, 2023, 07:24:53 AM...Kredi kartı kesim tarihim 25 Mart, 26 Mart'da satın alıp, çıkmıyorsa 14 gün içinde iade edilirse maddi bir kaybım olmaz. ...birkaç kişiden kredi kartı ile yapılan başvurular aynı ekstre döneminde iade edilecekmiş diye duydum ama teyit edilmiş bir bilgi olmadığı için emin değilim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "March 22, 2023, 08:57:30 AM",
      "body": "Fiyatı gerçekten çok uygun, özellikle muadillerine göre bedava sayılır, toki usulü canlı yayınla çıkanların belli olması da ayrıca biraz daha objektif izlenimi yaratıyor, şans denemeli mi kişiye göre değişir, şu an kenarda boş 1 m param olsaydı bende bu şekilde değerlendirme ihtimalini düşünürdüm, dezavantajları ise şimdilik gündelik yaşamda çok sıkıntı yaratabileceği için gündelik kullanım için çok uygun olmadığı (en azından şimdilik ) kanaatindeyim,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AlyattesLydia",
      "created_time": "March 22, 2023, 09:15:07 AM",
      "body": "Quote from: trendcoin on March 22, 2023, 08:32:24 AMilk olarak fabrikası yok diyenler vardı, birkaç ay önce üretim bandı yok diyenleri gördük (fatih altay mıdır nedir o malum kişi ve cevheri güven gibi bazı gazetecimsiler benzer şeyler yazdı), bugün \"başvuralım mı yoksa başvurmayalım mı\" noktasına doğru bir gidişat var. gördüğünüz gibi zaman her şeyi değiştiriyor; zor olan yapılmış ise bugün dezavantaj gibi görülen bazı ufak problemler de zamanla muhakkak aşılacaktır bence... ki bunların hiçbiri şimdiye kadar yapılmış olan işten daha zor olan şeyler değil.Quote from: AlyattesLydia on March 22, 2023, 07:24:53 AM...Kredi kartı kesim tarihim 25 Mart, 26 Mart'da satın alıp, çıkmıyorsa 14 gün içinde iade edilirse maddi bir kaybım olmaz. ...birkaç kişiden kredi kartı ile yapılan başvurular aynı ekstre döneminde iade edilecekmiş diye duydum ama teyit edilmiş bir bilgi olmadığı için emin değilim.Resmi duyurularda ve tüm haber sitelerinde iade süresi 14 gün olarak belirtilmiş, bu süre uzarsa zaten şikayetler oluşacağı için o konuda bir sorun çıkacağını sanmıyorum.Quote from: kriminall on March 22, 2023, 08:57:30 AMFiyatı gerçekten çok uygun, özellikle muadillerine göre bedava sayılır, toki usulü canlı yayınla çıkanların belli olması da ayrıca biraz daha objektif izlenimi yaratıyor, şans denemeli mi kişiye göre değişir, şu an kenarda boş 1 m param olsaydı bende bu şekilde değerlendirme ihtimalini düşünürdüm, dezavantajları ise şimdilik gündelik yaşamda çok sıkıntı yaratabileceği için gündelik kullanım için çok uygun olmadığı (en azından şimdilik ) kanaatindeyim, Bulunduğum binada hızlı şarj istasyonu bulunuyor. En yüksek menzilliyi (+500 km) seçtiğim için gündelik olarak sorun yaşamam diye düşünüyorum. Sizin burada sorun olabileceğini düşündüğünüz farklı bir konu var mı? Bildiğim kadarıyla şehirler arası çoğu benzin istasyonunda da hızlı şarj noktaları kuruldu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "March 24, 2023, 10:50:18 AM",
      "body": "Ben başvurmayacağım da hocam şimdiden başvuru sayısı 100 bin kişiyi geçmiş. Bu kadar başvurudan size çıkarsa büyük şans. Bir süre sonra yüzde 50 kârla ilanları görebiliriz belki sizde öyle bir kâr elde edebilirsiniz. Şu aşamada talep o kadar yüksek ki TOGG kara borsaya düşerse devlet ne yapar bilmiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "March 24, 2023, 11:31:00 PM",
      "body": "Şuanda başvuracağımı sanmam ama ilerleyen senelerde alım yapabilirim, ilk seri bir çıksın bakalım herhangi bir hata vs olacak mı? Ondan sonraki seriler daha iyi çıkacaktır, hem müşterilerden olumsuz dönüşlere göre revize alacaktır diye düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pulsar77",
      "created_time": "March 27, 2023, 02:56:37 PM",
      "body": "Araçla ilgili gördüğüm tek problem, ki o da önemli bir problem gerçekten, hala çarpışma testlerinin paylaşılmamış olması. Güvenlik testleri hakkında en ufak bir fikrim olmadan araba almak bana hiçbir şekilde mantıklı gelmiyor. Tabi ki yerli dediğimiz bir aracın yapılmış olması çok güzel ama böyle önemli detayların da atlanmaması gerekiyor.Euro NCAP testlerinden başarıyla geçmesi durumunda aklımda herhangi bir soru işareti kalmayacak. Şu anki fiyatı da piyasaya göre gayet iyi bu arada ama tabi bakalım ne kadar satacak merakla bekliyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "March 27, 2023, 03:05:04 PM",
      "body": "İlk etapta düşünmüyorum bir kaç yıl geçmesi lazım. Bu geçen birkaç yıl bize artılarını ve eksilerini daha fazla gösterecektir. Tabi ki emsallerine göre fiyatı uygun ama uygun dediğimiz fiyat da bizlere göre pahalı. Bu yüzden de acele etmemek gerek. Zaten sipariş miktarları oldukça fazla verildi önce bir görelim ona göre yol haritası çizelim. Gönül istiyor tabi ki ilk başta hemen alıp sürmeyi ama her gönül istediğinde de bazı şeyler olmuyor. Umarım ilk yıllarda bir sorunla karşılaşılmaz ve sağlam bir şekilde yoluna devam eder. Bizlere de sahibi olmak nasip olur umarım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "March 27, 2023, 03:20:01 PM",
      "body": "Quote from: eightdots on March 27, 2023, 03:05:04 PMİlk etapta düşünmüyorum bir kaç yıl geçmesi lazım. Bu geçen birkaç yıl bize artılarını ve eksilerini daha fazla gösterecektir. Tabi ki emsallerine göre fiyatı uygun ama uygun dediğimiz fiyat da bizlere göre pahalı. Bu yüzden de acele etmemek gerek. Zaten sipariş miktarları oldukça fazla verildi önce bir görelim ona göre yol haritası çizelim. Gönül istiyor tabi ki ilk başta hemen alıp sürmeyi ama her gönül istediğinde de bazı şeyler olmuyor. Umarım ilk yıllarda bir sorunla karşılaşılmaz ve sağlam bir şekilde yoluna devam eder. Bizlere de sahibi olmak nasip olur umarım.Başvurulara istinaden verilecek TOGG araç sayısını 20 bin adete çıkarmışlar. Elektrikli araçlar Türkiye’de fazla popüler değil, TOGG ile ne kadar popüler olacağını başvuru sayısıyla anlıyoruz. Yine de bu araçların teknik bilgileri, arıza durumları, satış sonrası servis durumları çok önemli. İlk teslimatlardan sonra takip edeceğim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "March 28, 2023, 06:43:27 PM",
      "body": "Hayır başvuruda bulunmayacağım, bulunamayacağım çünkü basit bir memur maaşıyla ikinci el kıçı kırık bir arabayı zorla alabilirken varımı yoğumu krediye bağlayıp bir araba almak bana mantıklı gelmiyor tabi benim gelirim aylık 100 bin lira olsaydı o zaman düşünebilirdim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "March 28, 2023, 10:36:38 PM",
      "body": "Bulunmayacağım fakat tek sevindiğim yanı araba piyasasını darmaduman edebilecek potansiyele sahip.Denildiği gibi bu kadar talep varsa diğer sıfır araçların fiyatlarının düşmesinin olası bir ihtimal olduğunu gözler önüne seriyor.Umarım 120-150 bin arası gerçekten talep vardır da bir an önce satılır ve teslim edilir.Tek temennim bu yönde.Bu aracın alınmasının hem avantajları hem dezavantajları var.Bana göre bu şartlar altında alınmaması gerekiyor.Çünkü birçok şeyi eksik veya gösterilmedi.Sanırım teknik servis olarak Bosch ile anlaşılmış bu bile dezavantaj gibi geliyor bana. Çoğu ilimizde şarj istasyonu yok ve şarj etme konusunda sıkıntılar yaşanacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "March 29, 2023, 12:17:30 AM",
      "body": "Quote from: execijutiere on March 28, 2023, 10:36:38 PMBulunmayacağım fakat tek sevindiğim yanı araba piyasasını darmaduman edebilecek potansiyele sahip.Denildiği gibi bu kadar talep varsa diğer sıfır araçların fiyatlarının düşmesinin olası bir ihtimal olduğunu gözler önüne seriyor.Umarım 120-150 bin arası gerçekten talep vardır da bir an önce satılır ve teslim edilir.Tek temennim bu yönde.Bu aracın alınmasının hem avantajları hem dezavantajları var.Bana göre bu şartlar altında alınmaması gerekiyor.Çünkü birçok şeyi eksik veya gösterilmedi.Sanırım teknik servis olarak Bosch ile anlaşılmış bu bile dezavantaj gibi geliyor bana. Çoğu ilimizde şarj istasyonu yok ve şarj etme konusunda sıkıntılar yaşanacak.Her şeyinize katılıyorum hocam ama merak ettiğim konu Bosch ile anlaşılmasının neyi dezavantaj yani aracın normal teknik desteğini mi Bosch verecek yoksa pillerin desteğini mi?Orayı tam anlayamadığım için soruyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "March 29, 2023, 06:24:41 AM",
      "body": "Bir kaç seneye ederinin 2 katı olacak Elektrikli otomobildir. Şu an fiyatı muadillerine göre ucuz kaldı ama servis ağının zayıflığı ve güvenlik testleri soru işareti oluşturuyor. Bunlar hızla tamamlanır ve sonrasında fiyat oturmaya başlar o zaman da keşke ilk çıktığında alsaydık deriz. İlk alanların satarken güzel kâr edeceğini düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "March 29, 2023, 06:34:43 PM",
      "body": "Bugün son gündü sanırım. Euroncap ve şarj istasyonlarının sayısı şimdilik önemli bir problem. Gerçi şarj istasyonlarının sayısı zamanla artar çünkü elektrikli arabaların sayısının artacağı belli. Tesla ülkemizde satışa başlıyor. Kia alt segmenlerde bir ürün geliştiriliyor. Şarj istasyonları zaman içerisinde muhakkak artar. Ben TOGG alacak olsaydım şarj istasyonlarını düşünmezdim. Geriye Euroncap testi kalıyor. Onu da geçerlerse daha çok talep gören bir ürüne dönüşebilir TOGG.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "March 29, 2023, 09:28:09 PM",
      "body": "Quote from: MK-74 on March 29, 2023, 12:17:30 AMQuote from: execijutiere on March 28, 2023, 10:36:38 PMBulunmayacağım fakat tek sevindiğim yanı araba piyasasını darmaduman edebilecek potansiyele sahip.Denildiği gibi bu kadar talep varsa diğer sıfır araçların fiyatlarının düşmesinin olası bir ihtimal olduğunu gözler önüne seriyor.Umarım 120-150 bin arası gerçekten talep vardır da bir an önce satılır ve teslim edilir.Tek temennim bu yönde.Bu aracın alınmasının hem avantajları hem dezavantajları var.Bana göre bu şartlar altında alınmaması gerekiyor.Çünkü birçok şeyi eksik veya gösterilmedi.Sanırım teknik servis olarak Bosch ile anlaşılmış bu bile dezavantaj gibi geliyor bana. Çoğu ilimizde şarj istasyonu yok ve şarj etme konusunda sıkıntılar yaşanacak.Her şeyinize katılıyorum hocam ama merak ettiğim konu Bosch ile anlaşılmasının neyi dezavantaj yani aracın normal teknik desteğini mi Bosch verecek yoksa pillerin desteğini mi?Orayı tam anlayamadığım için soruyorum.https://www.cnnturk.com/turkiye/togg-ile-bosch-car-service-arasinda-is-birligiEğer teknik servisi bosch verecekse bence zayıf kalır anlamında söyledim. Daha iyi bir şirketle anlaşılabilirdi bu bakımdan.Arabayı dağıtma bakımından anlaşıldıysa kimle anlaşıldığı çok da önemli değil.Haberin detayına bakılacak olursa buna evriliyor.Pil desteğini geçtim araç elektrikli olduğu için herhangi bir arıza verdiğinde bunu sanayiye götüremezsin.Sanayiye götüreceğin elektrikli aracı onaracak kapasite şuan orada yok ve bunu servislerin de pek hızlı yapabileceklerini düşünmüyorum.Elektrikli araçlar günümüzde yeni yeni yaygınlaşırken bu riski almak insanın kendisine kalmıştır sonuçta.Ben olaya kendi yönümden baktığım zaman bu ikinci el araç fiyatlarını ve sıfır araç fiyatlarını düşürmesini bekliyorum.Umarım öyle olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "March 30, 2023, 09:24:55 AM",
      "body": "Türkiye’nin Otomobili Girişim Grubu, dün yaptığı çekiliş ile araçlarını alacak talihlileri tespit etmiş. OP arkadaşımız da başvuruda bulundu herhalde. Sonucunu merak ediyorum umarım buraya da yazar. 177 bin başvuru ve 20 bin araç teslimi olacağı için şansı çok düşük. 1/9 ihtimalle ona çıkmıştır. Bakan Varank, kendi ve eşi adına yaptığı başvurudan olumsuz sonuç aldığını, çekilişte ismi çıkmadığını ve çekilişin adil olduğunu söylemiş. Tabi isterse alamayacağı bir şey yok. Biraz PR yapıyorlar. Otomobili teslim alanların yapacakları incelemeleri merak ediyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "March 30, 2023, 03:40:23 PM",
      "body": "Quote from: Silence Scream on March 30, 2023, 09:24:55 AMTürkiye’nin Otomobili Girişim Grubu, dün yaptığı çekiliş ile araçlarını alacak talihlileri tespit etmiş. OP arkadaşımız da başvuruda bulundu herhalde. Sonucunu merak ediyorum umarım buraya da yazar. 177 bin başvuru ve 20 bin araç teslimi olacağı için şansı çok düşük. 1/9 ihtimalle ona çıkmıştır. Bakan Varank, kendi ve eşi adına yaptığı başvurudan olumsuz sonuç aldığını, çekilişte ismi çıkmadığını ve çekilişin adil olduğunu söylemiş. Tabi isterse alamayacağı bir şey yok. Biraz PR yapıyorlar. Otomobili teslim alanların yapacakları incelemeleri merak ediyorum. TOGG için 20 bin çekiliş yapıldı ama bakanlar ve kamu ayrı bir şekilde sipariş eder, edecektir bence.O yüzden sayın bakana çıkmasa bile o araca zaten ilk binenlerden birisi kendisi.Ayrıca bu ülkede aracı alıp yüzde 100 farkla sarı sitede satmaya çalışacaklar da olacağı için parası olan verir alır oradan farklı fiyattan.Devlet bunu takip edecektir muhtemelen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "March 30, 2023, 05:38:47 PM",
      "body": "Bakana çıkmamış olması şaşırtıcı değil, zaten kendi imkanları ile istediği gibi satın alabilir. Kendine çıksa çok daha fazla tepki çekerdi bunu herkes biliyor. Benim asıl merak ettiğim ne kadar yandaşlara çıktı, onlar al sat yapacak mı ya da orada bir oyun döndürdüler mi. Mutlaka burada bile bir şey olacağını düşünüyoruz güven sıfır oldu artık",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "March 30, 2023, 07:19:58 PM",
      "body": "Quote from: xzone on March 30, 2023, 05:38:47 PMBakana çıkmamış olması şaşırtıcı değil, zaten kendi imkanları ile istediği gibi satın alabilir. Kendine çıksa çok daha fazla tepki çekerdi bunu herkes biliyor. Benim asıl merak ettiğim ne kadar yandaşlara çıktı, onlar al sat yapacak mı ya da orada bir oyun döndürdüler mi. Mutlaka burada bile bir şey olacağını düşünüyoruz güven sıfır oldu artık Benim de merak ettiğim bu 20 bin kişi içerisinde kaç kişi Suriyeli ! Suriyeli kişiler Türkiye’nin ürettiği otomobile binerken, Türkler binemezlerse işte o zaman en büyük sorun çözülmemiş olacak! Zaten Suriyeli kişileri vatandaş yapan sistemin saçmalığı sona ermedikten sonra bizim elde edemeyeceğimiz çok makama gelirler. Milletvekili de olurlar, bakan da yapılırlar, devletin önemli kademelerinde de çalışırlar. Hatta orduya bile alınırlar. Her şey bu sistemle mümkün çünkü ellerinde kapı gibi kimlikleri var! Keşke o 20 bin kişiyi yayımlasalar da görsek kaç kişi bunlardan !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "March 30, 2023, 07:59:21 PM",
      "body": "Benim arkadaşım son gün başvuruyu tamamlamıştı ve kendisine 19 bin gibi bir numaradan sıraya dahil olmuş. Asıl merak konusu bu 19 bininci aracın teslim zamanı ne zaman olacak araç hangi fiyattan satın alınmış olacak yani diyelim ki aracı 1 yıl sonra teslim ettiler bu süreçte araç fiyatı artacak fark yansıtılacakmı nasıl olacak bilemiyorum birde yönetim değişirse bu süreç nasıl işleyecek tam bir bilmece gibi duruyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}