{
  "id": "topic_5436569",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "January 24, 2023, 08:15:23 AM",
  "content": "If this is your first time knowing about crypto make sure you tighten your security, there is no such thing as too much security because belief me scammers aren't playing, they are ready to prey on any mistake or stupid things you do unknowingly.  Here are a few guides on how to tighten your security • If you are a PC user always keep your software and operating system up to date because they come with the latest security patches, this discourages known vulnerability to hackers.• Get used to Firewall, it's very good for blocking unknown networks or unauthorized access on your computer. • Always scan your PC using a reputable Antivirus program, I have been able to detect and remove malware this way a few times before. • Public WiFI network is a big Red Flag, avoid using them, there are ways hackers nailed you hard using Public WiFI 📶 network. • It's not bad using a VPN to encrypt your internet connection, it protects your data from hijackers. • Be careful of the information you share online, for example through messaging apps like Telegram or Twitter, scammers are very active on them and they are waiting for their next victim to prey on, personal information should remain personal. • Do not open links or mails that you receive from unknown senders, this is going rampant as one of the most dangerous way of scamming people online today. Do not sleep on these advice as hacks happens every minute online this day, be very vigilant and always look into your network just to make sure no one is connected to your network ( through IP addresses ). Stay blessed and stay safe.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436569",
  "comments": [
    {
      "author": "Obari",
      "created_time": "January 24, 2023, 10:37:12 AM",
      "body": "You did a great job fam with this advice and most times it seems easier said than done for people to follow strict and positive advice as such.The issue with security can't be over emphasized as there are several millions of malwares out there and at the end, people are just there to scam innocent people of their hard earned money and one one is above been scammed as this scams are always evolving with the world and technology as well.Just to add to all you've said above, I would advice that your seed phrase should be one of your greatest possessions and should be handled as such too becahe there is this saying that \"not your key, not your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "January 24, 2023, 01:09:15 PM",
      "body": "Anyone can see these helpful about wallet cyber security: Good topics on security and privacyNo one that will passionately read the topics that will not know how to avoid scam and hack. In addition, ad blockers can be of help against ads which are mostly the origin of malware download, ublock origin can be very helpful as a browser extension while using personal computer to browser online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}