{
  "id": "topic_5505053",
  "title": "Value.Virtue",
  "author": "Value.Virtue",
  "created_time": "August 03, 2024, 06:04:16 PM",
  "content": "BTC 51% Attack Potential Entirely LostAt the early stages of Bitcoin, 51% attack potential by group of persons was higher due to the low cost of 1BTC then, numbers of BTC circulations at that time or mined BTC available, Market valuability, low global acceptability, etc but today, BTC 51% attack potential is entirely lost because the cost of even attempting or increasing the chances of attacks on the network is very higher than the individual benefits if goal was to be achieved.The strength of BTC lies on the community or masses at large (decentralized) and decentralization means that BTC is everywhere and held by many or anyone around the globe and it's not centered at one place and nobody or group of persons can fight what's everywhere (decentralized) and who tries to fight what is everywhere like BTC will just be like one who tries to challenge his God (Creator) Who is the only living Supreme Being and yet invisible that happens to be everywhere to a wrestling contest and will surely end up loosing.Please it's just an opinion, you can as well drop your thoughts, opinions, corrections, comments etc let's continue learning. Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5505053",
  "comments": [
    {
      "author": "seoincorporation",
      "created_time": "August 03, 2024, 07:17:11 PM",
      "body": "Looks like you are confused, the price of the coin doesn't affect the chance of a 51% attack, it would affect if the coin were Pos like ETH where some one who holds 51% of the coins can do de attack with staking, but in bitcoin and Pos coins the attack comes from the miners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "August 04, 2024, 12:53:19 AM",
      "body": "Quote from: seoincorporation on August 03, 2024, 07:17:11 PMLooks like you are confused, the price of the coin doesn't affect the chance of a 51% attack, it would affect if the coin were Pos like ETH where some one who holds 51% of the coins can do de attack with staking, but in bitcoin and Pos coins the attack comes from the miners. Honestly, you got me confused now.  Either I do not get it just like OP did not or we confused each other.Is OP not partially correct?  It was much less costly to provoke a 51 percent attack on Bitcoin back when Bitcoin was so much cheaper.  Though the Price does not have a direct relationship to how successful or possible an attack is, I think it is much less likely to provoke one as long as the Price of Bitcoin is up and bound to increase.  Because implicitly, it means a lot more interest is gained and I do not think we have ever had a Bull Run with out having a significant increase of the Hash Rate at the same time.It is curious even.  The higher the demand, the less possible it is to attack Bitcoin.  And similarly, the higher the demand, the more likely it is for bad actors to want and try to find ways to attack it.  So as it is always said, Bitcoin truly is becoming more and more Secure the more Full Nodes, Miners and Users we have.  I always found this fascinating to say the least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "August 04, 2024, 01:38:34 AM",
      "body": "It can't be entirely lost. The possibility will always be there. That 51% of the network's hashing power is controlled by a single mining entity or group is a possibility that doesn't completely go away. But the odds or probability of it happening may change. The cost of attacking the network grows over time. Mining isn't cheap. Getting more than half of the network's hash rate is extremely costly. The mining environment is highly competitive. As a matter of fact, just a couple of days ago, the network's difficulty has once again registered another ATH. Further, vis-à-vis the high cost of the attack is a poor return. It simply isn't cost-beneficial. If it's used supporting the network though, there is a nice profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "August 04, 2024, 02:01:01 AM",
      "body": "@seoincorporation, @PrivacyG and @OP, you three in my opinion are partly right and partly wrong. The attack cost (cost to buy hardware/rent hashrate for an 51% attack) is higher than in Bitcoin's early days (OP is right here), and it is difficult to imagine a way to profit from an attack. However, it is maybe possible to imagine an attack where short sales play a major role. For example, imagine you short both Bitcoin, all wrapped Bitcoin chains/sidechains, most other cryptos (Ethereum, Solana ...) and also the stocks of mining pools and crypto exchanges. Today there may be too few coins to short, but in the future, if more mining pools and exchanges go public for example, then that may be different. So I think it's premature that the potential to attack Bitcoin is \"completely lost\".This of course applies to all cryptocurrencies, not only Bitcoin. It is however still extremely difficult. We have seen 51% attacks only on small chains, the biggest having been ETC (Ethereum Classic) but in times when ETH still used PoW (so it was easy for ETH miners to attack ETC).With @seoincorporation I also partly agree that price is not directly related to attack cost. But indirectly it is, because the difficulty and hashrate will grow in time if the miner income is higher as a consequence of a higher price. However, you also have to take into account block rewards (and its reductions by halvings) and transaction fees. (I think this is what @PrivacyG meant).And with @PrivacyG, I agree with what you wrote about the hashrate/price relation. But this relation may change in the future if transaction fees become more important in the security puzzle. The period from the late 21. century on could be challenging for Bitcoin in this regard. Its security will be probably still high enough to fend off most attacks but lower than now. There are however possible mitigation strategies as I have just recently argumented in several threads, like a tail emission by merged-mining (mainly sidechains, but also other altchains).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "August 04, 2024, 02:29:25 AM",
      "body": "Quote from: Value.Virtue on August 03, 2024, 06:04:16 PM   BTC 51% Attack Potential Entirely LostFirst, the 51% attack is hardly or nearly impossible to happen. In the past, some big mining pools have dominant hashrate but did not make 51% attack. They were aware that if they do it, it will be only bad for everyone in Bitcoin market, includes Bitcoin miners so they don't do attack to harm themselves.Second, Bitcoin community, miners, nodes can react quickly with very good automatic bots nowadays.Cost of 51% attacks is very high and benefit is very low.Lastly, you understood incorrectly, that even 51% attack happens, it won't steal all your bitcoin if your bitcoin is from a past transaction that is very deep under the ground, with many confirmations like thousand confirmations or more, 51% attack won't affect you. Because basically with one more confirmation, your bitcoin becomes more safely.How many bitcoin confirmations is enoughhttps://jlopp.github.io/bitcoin-confirmation-risk-calculator/https://web.archive.org/web/20181231045818/https://people.xiph.org/~greg/attack_success.htmlhttps://howmanyconfs.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Value.Virtue",
      "created_time": "August 07, 2024, 04:05:53 AM",
      "body": "Quote from: PrivacyG on August 04, 2024, 12:53:19 AMQuote from: seoincorporation on August 03, 2024, 07:17:11 PMLooks like you are confused, the price of the coin doesn't affect the chance of a 51% attack, it would affect if the coin were Pos like ETH where some one who holds 51% of the coins can do de attack with staking, but in bitcoin and Pos coins the attack comes from the miners. Honestly, you got me confused now.  Either I do not get it just like OP did not or we confused each other.Is OP not partially correct?  It was much less costly to provoke a 51 percent attack on Bitcoin back when Bitcoin was so much cheaper.  Though the Price does not have a direct relationship to how successful or possible an attack is, I think it is much less likely to provoke one as long as the Price of Bitcoin is up and bound to increase.  Because implicitly, it means a lot more interest is gained and I do not think we have ever had a Bull Run with out having a significant increase of the Hash Rate at the same time.It is curious even.  The higher the demand, the less possible it is to attack Bitcoin.  And similarly, the higher the demand, the more likely it is for bad actors to want and try to find ways to attack it.  So as it is always said, Bitcoin truly is becoming more and more Secure the more Full Nodes, Miners and Users we have.  I always found this fascinating to say the least. You are correct Sir that the higher the demand,the less possible it will be to attack Bitcoin despite the bad actors too that will arise, I think from 20 years and above that may be after more than 4 BTC halving, we could dig in deep and predict with a little more precision in Bitcoin and it's unfolding potentials and benefits, but for now let's keep enjoying it and keep hope alive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "August 13, 2024, 06:22:49 PM",
      "body": "Quote from: Value.Virtue on August 03, 2024, 06:04:16 PMThe strength of BTC lies on the community or masses at large (decentralized) and decentralization means that BTC is everywhere and held by many or anyone around the globe and it's not centered at one place and nobody or group of persons can fight what's everywhere (decentralized) and who tries to fight what is everywhere like BTC will just be like one who tries to challenge his God (Creator) Who is the only living Supreme Being and yet invisible that happens to be everywhere to a wrestling contest and will surely end up loosing.Please it's just an opinion, you can as well drop your thoughts, opinions, corrections, comments etc let's continue learning. Thank you.Saying that because BTC is not held by a single individual or entity, that it is held by different people in the different part of the world is the reason behind the decentralization is not entire correct. I say so because coins like BNB is also owned by different people in the world. There's no coin that is owned by only one person.When we talk about decentralization, we should look at the security method of the coin, the codes, the decision making and lots more.Quote from: seoincorporation on August 03, 2024, 07:17:11 PMLooks like you are confused, the price of the coin doesn't affect the chance of a 51% attack, it would affect if the coin were Pos like ETH where some one who holds 51% of the coins can do de attack with staking, but in bitcoin and Pos coins the attack comes from the miners. 51% attack would be possible when a few people hold the valueless BTC, than when millions of people hold the high price BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Value.Virtue",
      "created_time": "August 17, 2024, 07:09:09 PM",
      "body": "Quote from: Darker45 on August 04, 2024, 01:38:34 AMIt can't be entirely lost. The possibility will always be there. That 51% of the network's hashing power is controlled by a single mining entity or group is a possibility that doesn't completely go away. But the odds or probability of it happening may change. The cost of attacking the network grows over time. Mining isn't cheap. Getting more than half of the network's hash rate is extremely costly. The mining environment is highly competitive. As a matter of fact, just a couple of days ago, the network's difficulty has once again registered another ATH. Further, vis-à-vis the high cost of the attack is a poor return. It simply isn't cost-beneficial. If it's used supporting the network though, there is a nice profit.  You are right, the cost of attacking the network keeps on increasing, well BTC is yet to unfold more of it's potentials and weaknesses as we embrace more sophisticated web3 technologies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}