{
  "id": "topic_5413081",
  "title": "Crypto Library",
  "author": "Crypto Library",
  "created_time": "September 10, 2022, 02:53:42 PMLast edit: September 10, 2022, 03:20:02 PM by Crypto Library",
  "content": "Flexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.(USDT,BUSD) Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413081",
  "comments": [
    {
      "author": "virasog",
      "created_time": "September 10, 2022, 03:04:51 PMLast edit: September 10, 2022, 03:15:08 PM by virasog",
      "body": "Quote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.  Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?I don't know about binance but usually, the fixed taking gives you more rewards, and the Flexible staking should give you fewer rewards as you can withdraw anytime, don't know why Binance is doing this or maybe there can be some issues in the understanding.Can you tell with source how much binance is giving APR for fixed and flexible staking.  Even on google search it suggests otherwise.  Binance Earn – Flexible Savings and Locked Staking",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "September 10, 2022, 04:15:16 PM",
      "body": "Quote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.(USDT,BUSD) Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?Most of the time it is \"promotional\". You will see that the flexible staking APR will go down in few weeks. They increase the rate so more people stake their coins which they can use it for lending it to other traders.   Once they have enough coins staked, they will usually lower down the rate. I mean they have some internal quotas of their own. They change the rate based on this quota. So make sure you keep an eye on the APR. When it drops, it never notifies you (and you agree to those terms when you start staking).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "September 10, 2022, 08:58:31 PM",
      "body": "Quote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is also a benefit for us, then why are they giving more APR on it?Do you have an example for that? In general, fixed staking gives better yields. Maybe you are comparing different coins? Maybe there is some kind of promotion, as adzino already mentioned?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "September 10, 2022, 09:55:44 PM",
      "body": "If you check the flexible staking, there's also the maximum amount for that high APR that they're giving and if you happen to deposit more than that, that's where the percentage goes down. Unlike in locked staking, it seems that it's been maximized and no changes with certain requirements like maximum amount and the percentage that you get to earn. Like if you stake USDT or BUSD there, it is 10% APY but with only a max of $2k worth of those and if you deposit more than that, that's where the percentage decreases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "September 10, 2022, 10:08:20 PM",
      "body": "Quote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.(USDT,BUSD) Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?Most probably to encourage more investors since not all prefer to staked longer and many wants to do staking and liquidate it any time. They don’t give exact explanation for this but we can all assume it’s related to their promotions, i also see the maximum amount to get that higher APR, and once you do go beyond that maybe the interest will start to go down as well. Nevertheless, we can benefit from this and if you want to do staking, this might be a good option for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 10, 2022, 11:58:41 PM",
      "body": "Actually, it's not staking its savings both flexible and locked are saving if you trying to understand these better go to Binance FAQ here below- https://www.binance.com/en/support/faq/c-140?navId=140They have flexible and locked savings and they also have locked staking and Defi staking. Savings gives you less APY compared to staking but take note of those staking coins most of the coins there are new so there is a big chance it will die early even if the reward is big you will still sell the token/coins at a very cheap price due to the price drop of that coin/token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "September 11, 2022, 03:35:53 AM",
      "body": "Quote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.(USDT,BUSD) Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?    The only danger that I see is that if the exchange suddenly has a problem whether it is centralized or decentralized which usually according to my research they suddenly freeze the assets of their client users. And when that happens, there's nothing you can do but wait for their update if it's resolved or not.    But if there is no issue or any problem it is fine to do it, just like in the Binance exchange when you want to stake the assets you can tell if this is a platform that is good to use when it comes to staking assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 11, 2022, 04:15:34 AM",
      "body": "Does stablecoins even have locked staking? If I remember correctly with Binance's locked staking, they're actually staking the coins/tokens on-chain; and USDC/USDT/BUSD definitely doesn't have revenue-sharing on-chain locked staking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 11, 2022, 04:23:43 AM",
      "body": "Quote from: adzino on September 10, 2022, 04:15:16 PMMost of the time it is \"promotional\". You will see that the flexible staking APR will go down in few weeks. They increase the rate so more people stake their coins which they can use it for lending it to other traders.   Once they have enough coins staked, they will usually lower down the rate. I mean they have some internal quotas of their own. They change the rate based on this quota. When using them for lending they had a very high variation on their rates (they went up and down a lot) so this makes a lot of sense. Also running a promotional things like this might incentivise more users to lock up their funds for a fixed term saving after the rate deviates back to being below an instant withdrawal one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "September 11, 2022, 10:36:11 AM",
      "body": "Seems the only issue with these savings flexible or locked is the exchange itself, we all know Binance is the centralized exchange, so if there is something happens to the exchange, our savings there maybe will get affected too.On flexible, maybe if there is something will happen on the asset you stake, like lost its value and much worst is the locked savings where you can't withdraw it anytime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 11, 2022, 05:13:23 PM",
      "body": "Not always, but if you want reasons, I'll give you some: - The platform’s need for liquidity: If the platform urgently needs liquidity for something that is profitable, it may do so, and then they can share the profit with you or adjust the percentage after a period of time, because the word “flexible” means that they can give you 5%, 8%, or 3%, and so on. - Icreasing Pool investment: This money is usually put in a pool and its purposes for others, and if the interest rate is high, they will give you some. - Bumping BUSD price: When you buy them coin, you give them more power.and more ...>",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "September 11, 2022, 05:22:08 PM",
      "body": "Quote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.(USDT,BUSD) Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?I think you didn’t notice that Binance Flexible Staking has tier based system which only allows certain amount of money in able to benefits on high APY. I post the example below for BUSD Tier Rate.Tier 1:  0-2000BUSD ; 8% Apy Tier 2: 2000-20000BUSD ; 0.8% ApyThe greater your capital means you will have less APR on flexible staking while lock staking doesn’t have this kind of limitation. Flexible taking is good if you are using only small capital that is not greater on the first Tier to enjoy the highest APY.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "September 11, 2022, 05:42:55 PM",
      "body": "Quote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.(USDT,BUSD) Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?Probably the double bluff strategy is playing the role here, the returns supposed to be higher in the actual staking however people may not show much interest with the return of 8 to 10% because the same returns can be made with high riskier trading in a day or in a week.So cryptocurrencies are covering the users by offering more convenience so the exchange get the funds and starts pooling it to make a lot of profits with small technical move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "September 11, 2022, 08:12:44 PM",
      "body": "Quote from: GreatArkansas on September 11, 2022, 10:36:11 AMOn flexible, maybe if there is something will happen on the asset you stake, like lost its value .I don't think that staked coins lose the value of it that it is staked with. I mean the unit remains same and returned with interest but except the selling value reduced but exchange return same unit and interest to you.Quote from: GreatArkansas on September 11, 2022, 10:36:11 AMand much worst is the locked savings where you can't withdraw it anytimeLocked staking is done within certain duration of time (like 10 days, 30 days, 60 days, 90 days) and when it is done based on the duration taken then it is locked for that particular time to elapes before it can be returned for withdrawal but except it is a flexible staking that can be withdrawn on intervals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 12, 2022, 06:10:06 AM",
      "body": "Quote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.(USDT,BUSD) Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?Giving more APR? I cant feel some of those with their figure or percentage. They are giving a huge apr but with a trick. You cant stake there a lot of tokens and they have a minimal amount only. Means you cant really take advantage of that APR that much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheGreatPython",
      "created_time": "September 12, 2022, 08:02:33 AM",
      "body": "Quote from: GreatArkansas on September 11, 2022, 10:36:11 AMSeems the only issue with these savings flexible or locked is the exchange itself, we all know Binance is the centralized exchange, so if there is something happens to the exchange, our savings there maybe will get affected too.On flexible, maybe if there is something will happen on the asset you stake, like lost its value and much worst is the locked savings where you can't withdraw it anytime.That's not what you called an issue but that is a risk. Long term staking or the one where your funds are locked from a long period of time is the one that is riskier because an exchange might get hacked or what if they can turn into a scam later on? But this is rare for a big exchange because I believe their security is robust and I don't think they will choose money over the reputation that they build after a long time.In a flexible term, once you pull out your assets you have the option to sell it if you are doubting that the value of your coin will dump but you can't do that when your funds are locked inside a crypto exchange but if that is a promising coin, it's still possible for it to recover soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue_hurricanger",
      "created_time": "September 12, 2022, 09:12:50 AM",
      "body": "Quote from: dimonstration on September 11, 2022, 05:22:08 PMQuote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.(USDT,BUSD) Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?I think you didn’t notice that Binance Flexible Staking has tier based system which only allows certain amount of money in able to benefits on high APY. I post the example below for BUSD Tier Rate.Tier 1:  0-2000BUSD ; 8% Apy Tier 2: 2000-20000BUSD ; 0.8% ApyThe greater your capital means you will have less APR on flexible staking while lock staking doesn’t have this kind of limitation. Flexible taking is good if you are using only small capital that is not greater on the first Tier to enjoy the highest APY.This is the same with the Binance Saving system, APR on flexible staking at 20% for BUSD/USDT only at below $200. From $200-2000, it was 10% APR. Any more than that, 0.3% APR.I think it was a way for Binance to attract smaller fund accounts. Or people didn't have a Binance account yet to encourage them to open up an account there and make less than $2000 deposit for 10% APR. Sort of Binance wants both whales, big fish, and small fish too. Tho, with the APR at less than 0.8% APR for staking and 0.3% for saving in stablecoins, the bank interest rate is much more attractive than Binance. Maybe they don't want to flex on the bank's turf, yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "September 12, 2022, 01:04:58 PM",
      "body": "Quote from: blue_hurricanger on September 12, 2022, 09:12:50 AMQuote from: dimonstration on September 11, 2022, 05:22:08 PMQuote from: Crypto Library on September 10, 2022, 02:53:42 PMFlexible staking is one that I can withdraw whenever I want, and locked staking is one that is locked for a certain period of time to earn interest.(USDT,BUSD) Now my question is, is there any risk in flexible staking?  Flexible staking is also a benefit for us, then why are they giving more APR on it?I think you didn’t notice that Binance Flexible Staking has tier based system which only allows certain amount of money in able to benefits on high APY. I post the example below for BUSD Tier Rate.Tier 1:  0-2000BUSD ; 8% Apy Tier 2: 2000-20000BUSD ; 0.8% ApyThe greater your capital means you will have less APR on flexible staking while lock staking doesn’t have this kind of limitation. Flexible taking is good if you are using only small capital that is not greater on the first Tier to enjoy the highest APY.This is the same with the Binance Saving system, APR on flexible staking at 20% for BUSD/USDT only at below $200. From $200-2000, it was 10% APR. Any more than that, 0.3% APR.I think it was a way for Binance to attract smaller fund accounts. Or people didn't have a Binance account yet to encourage them to open up an account there and make less than $2000 deposit for 10% APR. Sort of Binance wants both whales, big fish, and small fish too. Tho, with the APR at less than 0.8% APR for staking and 0.3% for saving in stablecoins, the bank interest rate is much more attractive than Binance. Maybe they don't want to flex on the bank's turf, yet.They are doing this to attract retail users to deposit on flexible saving and later on attract them on lock savings APR when they have the capital greater than Tier 1. Actually those 8% APY for 2000$ Max deposit is very small which is the reason for Binance to use it as bait to be interested on lock savings and enjoy higher APY for no maximum amount of deposit.I agree that Binance don’t want to compete on giving a high a APY on flexible savings because many whales will abused it and might result for too much rewards given to users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 13, 2022, 08:43:52 AM",
      "body": "I think the APR is exact, and they probably have a lot of calculations just to ensure that they will earn with what they currently have. It will be a lower risk, but the reward is probably lower. I think that's the problem with long-term holdings because it's going to be dependent on what the market is; it's going to be hard to assess anymore with what you will do with your investment. Be careful with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}