{
  "id": "topic_5441575",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "February 28, 2023, 04:20:28 PM",
  "content": "William Shakespear said,  'there is nothing either good or bad, but thinking makes it so. The nature of things is neutral and it is our perception and thinking that gives them a positive or negative meaning. In the same vein I say, there is nothing either good or bad with gambling, but our actions and inactions make it so. People who gamble their entire savings and have the guts and shamelessness to come online and say \"Gambling is Bad. Stay away from it\" must understand that gambling itself is neither good nor bad, but our actions and behaviors surrounding it determine whether it is beneficial or detrimental.This is why I cringe whenever I hear or read stories of people who blame gambling for the loss of their entire life's saving or some negative consequence. The act of Gambling in itself is neutral. It is not to be blame for the harm that has befallen the individual but rather the individual's inability to control their emotions, finances, and time. I strongly encourage every newbie gambler as well as experienced gamblers to take responsibility for their actions and not using gambling as a scapegoat for their lack of discipline. If you approach gambling with discipline and self-control you will find that that it can be a fun and relaxing activity. Who else thinks so too?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441575",
  "comments": [
    {
      "author": "MiliMil",
      "created_time": "February 28, 2023, 05:46:17 PM",
      "body": "It depends on the person.If someone doesn't have discipline gambling can totally destroy them.I have heard horror stories of people losing 5-6 houses and businesses to fund their gambling habit.I always say if you can't control yourself or you have addictive personality disorder then don't gamble.It is a vice, just like alcohol and cigarettes and drugs and fast food. Self-control is needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shogun47",
      "created_time": "February 28, 2023, 05:50:38 PM",
      "body": "Quote from: alastantiger on February 28, 2023, 04:20:28 PMWilliam Shakespear said,  'there is nothing either good or bad, but thinking makes it so. The nature of things is neutral and it is our perception and thinking that gives them a positive or negative meaning. In the same vein I say, there is nothing either good or bad with gambling, but our actions and inactions make it so. People who gamble their entire savings and have the guts and shamelessness to come online and say \"Gambling is Bad. Stay away from it\" must understand that gambling itself is neither good nor bad, but our actions and behaviors surrounding it determine whether it is beneficial or detrimental.This is why I cringe whenever I hear or read stories of people who blame gambling for the loss of their entire life's saving or some negative consequence. The act of Gambling in itself is neutral. It is not to be blame for the harm that has befallen the individual but rather the individual's inability to control their emotions, finances, and time. I strongly encourage every newbie gambler as well as experienced gamblers to take responsibility for their actions and not using gambling as a scapegoat for their lack of discipline. If you approach gambling with discipline and self-control you will find that that it can be a fun and relaxing activity. Who else thinks so too?This would be correct if you talk about two people with the exact same pre-conditions and one risks to gamble away all their savings while the other person does not. Judging actions while entirely neglecting individual causal chains in my opinion is short-sighted and ignorant of our human abilities. While this is not related to gambling, it clearly shows that some people are way harder predisposed to addictions than others. Hence, they will need much more will power to decide against something and sometimes their situation becomes so bad that it is nearly impossible to stop. The individual's inability to control their emotions is, well, individual. And this is where generalizations become problematic. If someone falls off the cliff because a number of horrible events happened and the person seeks to compensate for that in a state of emotional chaos, we all know that most of us can make quite some stupid decisions. Also, the starting point is important as well. If my savings are 500 USD and I try to double them up, it might be a very stupid decision but not the end of life. If I go to the bank and take a mortgage on my house just to then go nuts in a casino and lose it all, that is probably a very stupid active decision. Compulsive gambling is a bit under the radar although it is an acknowledged addiction. Drug examples are easier to comprehend in regards to the complexities involved. In how far is a 13 year old to blame for a potential addiction to dope or even harder stuff when he grew up with drug addicted parents? Our brains develop in certain ways depending on our exposure to certain things. It is an interesting discussion anyway, but one that is most likely going to turn into a never ending story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "February 28, 2023, 05:52:04 PM",
      "body": "I wholeheartedly agree with your assessment of \"gambling is neither good nor bad\".  That is really the way people should look at it.  It's kind of like doing certain drugs, they may not be bad for you if you do them in moderation and don't let them take over and consume your life.  Sure there can be some negative effects, but there's also plenty of positive effects (for certain drugs)..so it's really all about ones mentality of mental strength.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "February 28, 2023, 06:04:25 PM",
      "body": "Well there's nothing much to deliberate about because in every gambling site there are some rules that says is +18 and I believe anyone above that can control their emotions and also managed their funds carefully.If it happens that gambler couldn't managed their funds or control the risk of losing their money doesn't mean others would also loose like them. I have seen someone who became successful with gambling and yet his living wealthily fine, I mean living luxuriously. So those who lose their entire savings to gambling are just trying to make fortune out of gambling without knowing it's a game of joy and mostly gambling to ease stress and pains, attaching much value to it will as well makes them to lose valuables.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "February 28, 2023, 06:09:33 PM",
      "body": "Gambling is good and i can tell you this because millions of gamblers were doing it and getting being fulfilled with loads of fun and pleasurable moment in gambling, we choose what we want to experience with gambling, it's bit what we do to get frustrated, those that have the bad side of gambling probably have their own weakness that contributed to the failure they experienced with gambling, if you know your moderacy then you will enjoy gambling to the fullest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "February 28, 2023, 06:10:06 PM",
      "body": "Gambling is a bad habit especially if you are overdoing it. That is a known fact. We don’t need to have a debate over this. However, by playing responsibly you can minimize the bad effects of gambling in your life. Playing responsibly means that you shouldn’t lose your control. You can bet a hundred times in one day and still be a responsible gambler as long as you don’t wager too much.If gambling makes you forget about the bad stuff you have in your life then you might even consider it a good thing. But like I said, you should play responsibly otherwise gambling will be just another problem for you to fix.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "February 28, 2023, 06:10:17 PM",
      "body": "You are right excess of everything is bad and it is a sin. When you are a discipline gambler, you will not be carried away with your gambling activities because you can control it. A discipline gambler sees gambling as fun and entertains himself with it.Gambling destroys those people who see gambling as a means of earning a living for themselves,which is very wrong. Such people will keep on chasing their loss by allowing themselves to be controlled by their emotions. Destruction and frustration becomes the order of the day to them,due to greed and lack of self control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "February 28, 2023, 06:21:08 PM",
      "body": "Once a person has money to gamble, they can always do what they wanted to do even if they see it as bad. The majority thinks gambling is a vice though, you can never argue with that since society indeed sees it that way and one has to conform with the society to which they belong. You can however negotiate that gambling is one cure for boredom and while you're old enough and have money, you can gamble. The rest of it will have to be learned like controlling the addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "February 28, 2023, 06:35:32 PM",
      "body": "Quote from: alastantiger on February 28, 2023, 04:20:28 PM The act of Gambling in itself is neutral.Gambling is good when you can keep it under control, but bad when it is now out of control and now controls you. Not all activities that are out of control have negative effects, but gambling does, and its effect can have huge financial consequences, mental consequences, social consequences and can even lead to suicidal thoughts. You tell someone gambling is bad because people have seen how dangerous it can be and how it has destroyed lives and relationships, so you are informed first that it is bad before you choose to start gambling because many people cannot put the habit of gambling under control and you may be one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "February 28, 2023, 06:43:44 PM",
      "body": "It all sums up with how we see gambling. Those people that really have terrible experience will look for someone or something to blame for with their misfortune. Especially, if they don't want to accept their losses and it's hard to imagine thinking that it would be a great move for them to just accept that they've loss but they won't.Also, it's all about our free will. Nobody forced us to gamble so if there's anyone to blame for, it should be ourselves and our decisions. It's true that it's neither bad or good but depends on the perception who sees it and the feedback that he'll give to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "February 28, 2023, 06:48:38 PM",
      "body": "Gambling isnt good nor even bad, it is really just on how people do able to approach and make their actions because if we do think up the real way on which it is really that gambling is really for fun and something that do really make someone do enjoy his vacant time but of course it would really be the expense of someones money for the entertainment he do seek.Things goes bad on the time that he do make out actions and decisions which would causes for his/here life to mess up because of the bad decisions that he's making.If you do find yourself that spending too much money and really that impulsive into your decisions or simply your behavior is really starting up to change then this is where wrong things do happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "February 28, 2023, 07:16:20 PM",
      "body": "This is pure philosophy! Gambling is neither good nor bad in itself. It's the same with fire, fire is neither good nor bad (for example, but you can find any other, I am sure there are plenty) it can provide a lot, but if you're not careful, you can get burned a lot... Basically, you need to know what you are doing, and if you are not aware of your actions, you will get into a problem. That is a bottom line I guess, always do some research before you jump into something, that can save you from many \"unpleasant situations\".But we are all human in the end, with feelings and all that stuff. We like to try different things and take risks without much thinking, especially at some younger ages. I guess we live to learn, and learning comes from trying things... and some things are incredibly tempting... it's hard to resist, but we need to find a way to control our wishes and actions. Each of us is in the same battle, you can find many quotations about \"the worst enemy you can meet will always be yourself\".  We are all trying to find some balance and control in life, somehow...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "February 28, 2023, 07:35:05 PM",
      "body": "Blaming gambling for losing a lot of money and savings is a stupid thing to do alone. No one can be blamed, gambling or not is a choice not a compulsion. Maybe the gambler who always loses is just after an instant win by risking all his money. Management in gambling is even necessary, not just in trading. Gambling requires financial management so that there will be an allocation that is provided for gambling and some others to back up when the first gambling fails. besides that, mental health when gambling is very necessary. people sometimes are not ready for defeat when gambling, so many bad things will happen. Gambling, which only has a bad impact, depends on how you can do gambling, not only to seek continuous wins so that they are too addicted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "February 28, 2023, 07:53:27 PM",
      "body": "Quote from: livingfree on February 28, 2023, 06:43:44 PMIt all sums up with how we see gambling. Those people that really have terrible experience will look for someone or something to blame for with their misfortune. Especially, if they don't want to accept their losses and it's hard to imagine thinking that it would be a great move for them to just accept that they've loss but they won't.Also, it's all about our free will. Nobody forced us to gamble so if there's anyone to blame for, it should be ourselves and our decisions. It's true that it's neither bad or good but depends on the perception who sees it and the feedback that he'll give to it.The way we see things doesn't change the nature of these things. A person can be seen a s good or bad depending on what views those judging said person have, but it doesn't make that person good or bad. If you shoot a deer, hunters will say you're a good man, and animal rights activists will say you're bad, but it doesn't make you good or bad. A gambler who steals to feed his habit is bad beyond doubt, but gambling itself isn't bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "February 28, 2023, 08:13:00 PM",
      "body": "Quote from: 348Judah on February 28, 2023, 06:09:33 PMGambling is good and i can tell you this because millions of gamblers were doing it and getting being fulfilled with loads of fun and pleasurable moment in gambling, we choose what we want to experience with gambling, it's bit what we do to get frustrated, those that have the bad side of gambling probably have their own weakness that contributed to the failure they experienced with gambling, if you know your moderacy then you will enjoy gambling to the fullest.  if you say gambling is good, there are people who do not play bets and would want to argue with you that nothing good comes from gambling. Yes I have met such kind of people that almost manipulated my brain to stop gambling but at the end I remember how far I have gone and there points and idea should not make me to just leave gambling without a reason. Nothing and nothing is bad. If we do things in the wrong way then we will be seen as a bad person not what we are doing that tagged us bad but the way we do it. Gambling is good if we do or play it in the right manner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rahmad2nd",
      "created_time": "February 28, 2023, 08:14:34 PM",
      "body": "As I often say in my posts, how does one view gambling itself and how do we define it. as William Shakespeare said, \"nothing is neither good nor bad\". I can really understand what he's talking about. but because the theme of our discussion is gambling, so we discuss it from a gambling perspective.For me, it's all about how we perceive gambling itself and how we define it. all of that returns to each individual, every gambler has a different perspective on gambling. what William Shakespeare said, we can apply to our lives and not just to gambling.Gambling, is part of the fun entertainment in the modern era like today. we are offered something that is entertaining with all the conveniences thanks to sophisticated technology. but the negative impact of gambling, can affect a person's life to be problematic. therefore, we must react wisely. someone who actively gambles like me, will really need a big responsibility, as well as an understanding of gambling itself and how we deal with it. something fun, can have a negative impact if we do not have good self-control. therefore too, one must understand deeply to have self-control, good understanding. also, responsibility. although sometimes, in practice it is difficult.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "February 28, 2023, 08:25:08 PM",
      "body": "Moderation is a key factor to self discipline in every activity we as humans engages in, and the lack of the consciousness of it leads to indiscipline which in gambling it leads to irresponsible gambling among gamblers and they end up blaming gambling as being bad activity to engage in. Whereas it's the gambler act of moderation  or lack of it towards gambling that either makes it look good or bad. The endpoint is that gambling is not for boys but for men and real men knows when to stop, takes responsibility and moves on even on abad day as if nothing happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "February 28, 2023, 08:26:07 PM",
      "body": "I don't know if Shakespeare is a gambler but what he said is really applicable to us, gamblers. The one who thinks it's bad really sees the bad in it and that can be seen in those irresponsible gamblers that are selling all they've got because they've lost a lot and then want to recover them. But because of having a lack of funds, they do crazy things such as selling all their stuff, even the important ones so that they can still keep on track. Now then the person who saw that from an actual gambler will think that gambling is bad because of how the gambler interacted with his losses and still want to continue. But, that's it, he's right that thinking of it as bad or good really will show how it is being said based on other's opinions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "February 28, 2023, 08:27:55 PM",
      "body": "I said bad.Even my self as the gambler, I always said is bad and never-ever want to ask or try to invited my friend from non-gambling user to gambler. I mean look at the cost, the problem is not only the person who are gambling.But also, other people who are can get the effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}