{
  "id": "topic_5476228",
  "title": "Mia Chloe",
  "author": "Mia Chloe",
  "created_time": "December 01, 2023, 06:38:18 PM",
  "content": "A lot of persons who despise Bitcoin or crypto currencies in General were once involved in them.some of these persons hated Bitcoin and crypto in general because of some common reasons.Some of these persons may never have ventured the crypto space nor Bitcoin investments before because of some government restrictions against Crypto especially in countries like china etc where the government is strictly against it. Others are just afraid due to possible stories they have heard of people who lost drastically in the crypto space either due to hacks or scam.However my main interest here is solely towards those who have invested in crypto in the past.Most of these persons hate Bitcoin and other Crypto currencies due to the great loss they suffered from dips in alt coins .most of these losses were as a result of improper understanding and experience before attempting massive investments.Of course some early adopters of Bitcoin who sold or lost access to Their coins have also lost faith in the crypto verse.My question is should altcoins really be blamed for hate some persons have for Bitcoin due to their loss in alt coins?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476228",
  "comments": [
    {
      "author": "Pmalek",
      "created_time": "December 01, 2023, 06:49:18 PM",
      "body": "Bitcoin stands on a throne of its own. No one else is on that throne that you can compare it with. Monero is a good altcoin but it doesn't and probably never will have even close to the users and holders of bitcoin. The rest are altcoins, many of which are shitcoins. There is no reason to mention them in the same sentence. Can you make money with alts? Yes, you can, and that's all they are there for. To make a small circle of developers and creators rich and leave you with the hype bags in your possession if you didn't sell on time.A person with common sense will never blame Bitcoin or crypto in general for mistakes they committed. If you lost your coins or got hacked, it's not the network's fault that you didn't learn how to protect your keys. Volatility is normal in bitcoin, and if you can't handle it or expect a constant uptrend, then you will be surprised. Learn from your mistakes and take responsibility for your actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "December 01, 2023, 06:49:45 PM",
      "body": "Quote from: Mia Chloe on December 01, 2023, 06:38:18 PMMy question is should altcoins really be blamed for hate some persons have for Bitcoin due to their loss in alt coins?If I’m to give my two cents in this issue I’ll say that; lack of knowledge and impatience also contributed to the hate. Those sets of people you mentioned were most involved because they heard someone else was able to make that amount from it, and instead of them to research on it they just jumped into it and invested large amounts of money thinking that crypto is a get rich quick scheme without knowing the risks involved and when things went south ways they just labeled bitcoin as a scam. Although some altcoins still played a role in creating this false image of bitcoin most especially those that rug pulled but when traced to the roots you’ll still discover that 80% were not properly educated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "December 01, 2023, 06:54:50 PM",
      "body": "The fact is everyone is responsible for their action and decision, you can't blame shitcoins for your failure or lack of knowledge. Your failure in shitcoin is approximately the success of the owners of the shitcoins, identifying the difference between shitcoin and Bitcoin should be a paramount duty of everyone going into crypto space. you can't go into what you don't really know about and expect the best out of it. Shitcoins are solely for personal success of the creator not to be compared with Bitcoin a paradigm that has never fail since launched. If any coin promises you success as bitcoin and you eventually you got convinced and invest in it then it's you cup of tea. The generalization in hate of crypto is absolutely as a result of lack of knowledge of what Bitcoin is and the difference between Bitcoin and every other coin that pose to have same characteristics as Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "December 01, 2023, 07:30:36 PM",
      "body": "The whole idea of wanting to invest in Bitcoin but then buying alts is ridiculous to me. People buying alts aren’t hoping to invest in good tech that is changing the world. They’re hoping their altcoin follows Bitcoin’s value rise so they can get rich quick and easy. Those types of people will always go broke and blame something. It’s best to not pay attention to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "December 01, 2023, 08:49:03 PM",
      "body": "Knowledge is power, the lack of knowledge should be blamed for the hate on Bitcoin not altcoin, I don't own Altcoins and I don't plan to own any but I don't see them as the real problem.It's lack of knowledge that makes someone invest in an altcoin that was built on hype and when it falls they go hating crypto-currency in general, it's lack of knowledge that makes one leave their Bitcoin on an exchange and loses it afterwards go hating Bitcoin, it is also lack of knowledge that makes newbies vulnerable to scammers, hackers and fraudster, it is also lack of knowledge that makes newbies think Bitcoin guarantees them success in a short time.I think with the right information and knowledge about Bitcoin the hate on it would reduce.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "December 01, 2023, 08:54:10 PM",
      "body": "It is the greed of people that should be blamed, remember Bitcoin has nothing to do with any person's altcoin investment.  There is no reason to blame Bitcoin for a fail altcoin investment.  Same goes with blaming altcoin because of the hate of people to Bitcoin.  If there is someone to blame, a person can blame himself because of not doing his own research.  Because of his own greed, he is blinded by scam advertisements and offers thus losing his investment to fraud and scams. Besides, someone hating Bitcoin because they lose money on altcoin investment makes no sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "December 01, 2023, 08:55:42 PM",
      "body": "Quote from: Mia Chloe on December 01, 2023, 06:38:18 PMA lot of persons who despise Bitcoin or crypto currencies in General were once involved in them.some of these persons hated Bitcoin and crypto in general because of some common reasons.Some of these persons may never have ventured the crypto space nor Bitcoin investments before because of some government restrictions against Crypto especially in countries like china etc where the government is strictly against it. Others are just afraid due to possible stories they have heard of people who lost drastically in the crypto space either due to hacks or scam.However my main interest here is solely towards those who have invested in crypto in the past.Most of these persons hate Bitcoin and other Crypto currencies due to the great loss they suffered from dips in alt coins .most of these losses were as a result of improper understanding and experience before attempting massive investments.Of course some early adopters of Bitcoin who sold or lost access to Their coins have also lost faith in the crypto verse.My question is should altcoins really be blamed for hate some persons have for Bitcoin due to their loss in alt coins?Well my best gains are in Doge. Less effort less gear and more profit.So I do not hate Alts.I do hate all POS and would want to punish all pos holders, but since I just a guy in NJ I simply can not punish the millions that made or lost on Pos coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "December 01, 2023, 08:57:48 PM",
      "body": "Honestly, the fault shouldn’t be to the medium, but instead to those who actually perpetrate the crime. Scammers, hackers, and thieves who make a living out of taking advantage of other people should be the one to be put at the stake and not bitcoin nor altcoins for that matter. If anything, I’d say the notion of banning or condemning altcoins is wuite similar to banning smartphones cause you can use them to scam people too. Wouldn’t that be stupid?Again, the blame should be to the criminals, not the method they use to commit the act thereof. It’s off-putting and upsetting, yes, considering that we can’t even really find a good way to have these people be put to justice but it’s what makes the most sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distinctin",
      "created_time": "December 01, 2023, 08:59:22 PM",
      "body": "It's not bitcoin or altcoins that should take the blame, but the kind of investor who decides to take the risk from investing in crypto. If you lose on them, simply because you don't have the qualities that suit for a good and reputable investor. And not that you blame altcoins for your losses and made people hate bitcoin in general.However, if you are being hacked or scammed, still the blame should not only for those criminals but also you need to take charge of the responsibility you have by doing initial research first before you jump into a conclusion of investing into altcoins or any project that is making too good to be true promises.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "December 01, 2023, 09:05:07 PM",
      "body": "The key issues here are illiteracy and a lack of basic knowledge and comprehension. Most of these people don't know the difference between Bitcoin and Altcoin; they don't even know about them, and they may not be eager to learn; they simply invest in them, and when they are cheated, they blame Bitcoin.Some people ventures into altcoins that have no future if truly he/she did research before investing in them because Bitcoin and altcoins are two different things that can only be compared with the word crypto, but they are two different currencies with different dimensions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "December 01, 2023, 09:14:01 PM",
      "body": "Many times it has been discovered that, most of those who blame a situation on a particular cycle of events are either ignorant or suffered from the pain of ignorance that may have pushed them into investing in those coins but regardless of what the investment is in altcoins, it still going to become. worthless and only good for short-term speculations and gambling since many of them end up as worthless coins within a short period.But then also we have to look at some other factors that make me call most of those misunderstanding Bitcoin to mean a cheat wrong investment as ignorant is the fact that, some of them also take Bitcoin as altcoin when they make reference and use the term crypto, this is why many time we may have to take a closer look at such speculation and wrong assumptions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 01, 2023, 09:19:43 PM",
      "body": "Quote from: Mia Chloe on December 01, 2023, 06:38:18 PMMy question is should altcoins really be blamed for hate some persons have for Bitcoin due to their loss in alt coins?How does this matter or even make sense, why should the reason why people became anti-bitcoiners worry you, and even if we agree that the reason you gave is true, so what? Sorry, but i don't know what we are supposed to discuss in this topic, if someone doesn't want to buy or use BTC for any reason, then that is that. BTC would surely get users who understand the network and want to use it for its use cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "December 01, 2023, 09:32:24 PM",
      "body": "Quote from: Mia Chloe on December 01, 2023, 06:38:18 PMMy question is should altcoins really be blamed for hate some persons have for Bitcoin due to their loss in alt coins?Blame themselves. We're learning our lessons through the brutal way of this highly volatile market. Even before they get in, they for sure have understood that this market will make you either win or lose. That's should be clear at least from the beginning when they have entered to invest to Bitcoin or any other cryptocurrencies that they've chosen because it's their choice.Please, let us be done with the blaming game. All actions that have been taken and done by each of us should be relied to ourselves and blamed to us whether we make it or break it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 01, 2023, 09:39:07 PM",
      "body": "Altcoins aren't to be blamed in any way, and this is because, altcoin did not force itself on any body, those who invested in altcoins, and are still investing in altcoin rather than investing in bitcoin are all doing so out of their own will, they were forced, so why should altcoins be blamed?And besides, the existence of altcoins have made bitcoin a much more healthy cryptocurrency and blockchain.Just imagine if there was no altcoin at all, that we all had to transact only in bitcoin, I believe that by now, only the rich will be able to buy and transact in bitcoin because, the price of bitcoin must have become very expensive at the moment, and also, cost of transaction confirmation on the blockchain would have become very expensive, most especially in times when the mempool is congested.So, altcoins have helped bitcoin grow, and not the other way round.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunkieMiner",
      "created_time": "December 01, 2023, 09:41:01 PM",
      "body": "Quote from: Mia Chloe on December 01, 2023, 06:38:18 PMA lot of persons who despise Bitcoin or crypto currencies in General were once involved in them.some of these persons hated Bitcoin and crypto in general because of some common reasons.Some of these persons may never have ventured the crypto space nor Bitcoin investments before because of some government restrictions against Crypto especially in countries like china etc where the government is strictly against it. Others are just afraid due to possible stories they have heard of people who lost drastically in the crypto space either due to hacks or scam.However my main interest here is solely towards those who have invested in crypto in the past.Most of these persons hate Bitcoin and other Crypto currencies due to the great loss they suffered from dips in alt coins .most of these losses were as a result of improper understanding and experience before attempting massive investments.Of course some early adopters of Bitcoin who sold or lost access to Their coins have also lost faith in the crypto verse.My question is should altcoins really be blamed for hate some persons have for Bitcoin due to their loss in alt coins? We can never blame a coin just because of the other coin in the crypto. In crypto when we started our first step we should know the fact that anything on anytime we can expect from crypto. Even we can see those coins which price were above 100$ and now they are below 1$ so this is the craze of crypto in which we should have to accept this fact that in crypto coins are volatile. Most probably when bitcoin falls mostly the price of the coins we knew most of them are also changed. So this can happen but changing like other coins can't be blamed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ginsan",
      "created_time": "December 01, 2023, 09:57:35 PM",
      "body": "What Pmalek said is quite right, where those who hate Bitcoin are those who suffer from altcoins. Didn't they learn from the losses of many people when choosing to invest in altcoins like terra luna and Ftx. Terra luna and Ftx are altcoins that went to 0 and it is a big fact that at the end of last year many of them became poor because they invested in altcoins.So it's all up to them how they should act with their finances and that decision is something they should think about early.I don't hate altcoins but altcoins have a greater level of risk than we think because in one hour or one day our assets become zero like ftx and terra luna. I think they should change their mindset to be more genius and just choose Bitcoin as a big asset in their portfolio. For example 98% for Bitcoin and only 2% for altcoins is quite a wise thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 01, 2023, 09:58:03 PM",
      "body": "Quote from: Mia Chloe on December 01, 2023, 06:38:18 PMA lot of persons who despise Bitcoin or crypto currencies in General were once involved in them.some of these persons hated Bitcoin and crypto in general because of some common reasons.Some of these persons may never have ventured the crypto space nor Bitcoin investments before because of some government restrictions against Crypto especially in countries like china etc where the government is strictly against it. Others are just afraid due to possible stories they have heard of people who lost drastically in the crypto space either due to hacks or scam.However my main interest here is solely towards those who have invested in crypto in the past.Most of these persons hate Bitcoin and other Crypto currencies due to the great loss they suffered from dips in alt coins .most of these losses were as a result of improper understanding and experience before attempting massive investments.Of course some early adopters of Bitcoin who sold or lost access to Their coins have also lost faith in the crypto verse.My question is should altcoins really be blamed for hate some persons have for Bitcoin due to their loss in alt coins?Huh? Altcoins was likely just a tool of investment and it's your responsibility if you invest your money in something you should know you have knowledge about, don't invest on things you don't know. If you lost access to your coins nor you invest at the top, the only thing to be blame was yourself, not the coins nor the people that says to you to FOMO in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "December 01, 2023, 10:46:59 PM",
      "body": "Quote from: Mia Chloe on December 01, 2023, 06:38:18 PMMy question is should altcoins really be blamed for hate some persons have for Bitcoin due to their loss in alt coins?Only the greed of anyone who invested in other cryptos aside from Bitcoin should be blamed. At this point, it's clear that investment returns are no guaranteed and their centralized nature with an organization-like structure (CEO, team, Labs) make them a more riskier venture instead of investing in Bitcoin.Altcoin are generally a high-risk high-reward kinda play and anyone indulging in them should know better rather than outright blame bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oktana",
      "created_time": "December 01, 2023, 11:09:52 PM",
      "body": "And my own question is, should Bitcoin be blamed based on the hatred people have for altcoins? First understand that altcoins and Bitcoin are in the same family with the family name of “Cryptocurrency”. So, it isn’t unusual or necessarily wrong if one takes blame for the other. After all, it’s not one sided because some persons have “bad experience” with Bitcoin while some with altcoins. Unfortunately, it is majorly caused by FOMO and lack of understanding/information before participating in the investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}