{
  "id": "topic_5401603",
  "title": "MARK21",
  "author": "MARK21",
  "created_time": "June 06, 2022, 09:03:02 PM",
  "content": "Viendo noticias, se dio que en este período de 8 semanas, bitcoin ha caído más del 40%, pero no todo es malo.QuoteEl precio de bitcoin (BTC) cerró a la baja nuevamente la semana pasada. Con este último periodo de 7 días, ya son 8 semanas consecutivas cerrando en rojo para la criptomoneda. Algo que nunca antes había sucedido.Dicha información se puede apreciar con la siguiente grafica:Bitcoin cayó por octava semana consecutiva. Fuente: Trading View.Mas info: https://criptoides.com/por-primera-vez-en-la-historia-el-mercado-de-bitcoin-cae-durante-8-semanas-seguidas/Sin embargo, luego de 9 semanas consecutivas en rojo, Bitcoin logra remontar con un alza de 2%.QuoteLlega a máximo histórico la cantidad de direcciones con más de 1 BTCEl precio de bitcoin consigue primera semana en alza, superando los USD 29.300, luego de nueve semanas consecutivas a la baja, el periodo histórico más largo en caída. El cual se puede apreciar en la siguiente grafica:Bitcoin abrió la semana a USD 29.300 y la cerró por encima de ese precio, consiguiendo así los primeros siete días en alza en más de dos meses. Fuente: TradingView.Noticia de: https://www.criptonoticias.com/mercados/bitcoin-corta-mala-racha-dos-meses-primera-semana-alza/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401603",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "June 07, 2022, 08:45:44 AM",
      "body": "Las noticias se generan por haber que generar contenido en los medios a todo trapo y con una alta frecuencia. No obstante, muchas dicen algo que tiene que ser desdicho por la siguiente notica, y este es uno de esos casos. La subida de los 29,9K $ a los 31,5K $ duró un día aproximadamente, habiendo ya regresado de los 29,6K$. La noticia de la subida (que no era tampoco para tanto) pilló al editor justo cuando se inició la escalada, y hoy deberá escribir sobre la bajada, y la probable trampa que supuso. Puede que mañana se vuelva a escribir sobre una nueva subida …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}