{
  "id": "topic_5406579",
  "title": "Wincob",
  "author": "Wincob",
  "created_time": "July 17, 2022, 05:59:30 AM",
  "content": "There are many projects today that only gives liquid staking solution to Ethereum like Lido Dao for example, my question is what will be the fate of such projects once Ethereum PoS is live? Will there be any reason for such project to still be as good as today?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406579",
  "comments": [
    {
      "author": "livingfree",
      "created_time": "July 17, 2022, 01:36:00 PM",
      "body": "Quote from: Wincob on July 17, 2022, 05:59:30 AMThere are many projects today that only gives liquid staking solution to Ethereum like Lido Dao for example, my question is what will be the fate of such projects once Ethereum PoS is live? Will there be any reason for such project to still be as good as today? Well, currently it is a project that's hard to see going down. And I think with it transitioning into PoS, this is going to build the rich richer.IMHO, it will still be good as it is even it changes from PoW to PoS but honestly, I'd like to see it stay for being PoW. Too many miners that will be affected on it and they'll be dominated by the whales. There are discussions of how good to talk about its transition and what are the pros and cons when it's done being PoS. Just lurk specifically on this section and you'll see it on the few pages forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaya11",
      "created_time": "July 17, 2022, 02:17:46 PM",
      "body": "Quote from: livingfree on July 17, 2022, 01:36:00 PMIMHO, it will still be good as it is even it changes from PoW to PoS but honestly, I'd like to see it stay for being PoW. Too many miners that will be affected on it and they'll be dominated by the whales. Stopped mining already just recently because of sudden drop of prices. I can't afford to pay my bills anymore as the source of my free electricity is gone. Too bad it came to this point however I did  not regretted it at all. It was fun mining at the same time having extra profits. Glad I got my ROI before these migrations is going to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 17, 2022, 03:00:02 PM",
      "body": "Ethereum is currently considered by everyone to be the 2nd in the crypto money world, which all crypto money investors accept. While I don't want mining to end completely, it can be good for the environment and for excessive use of electricity. But vitalik presented an enormous project. The person presenting such an enormous project certainly has precautions in it. That's why I think ethereum will have nothing to lose and I think it will keep its old power even if it changes the version.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 17, 2022, 03:22:09 PM",
      "body": "Quote from: Wincob on July 17, 2022, 05:59:30 AMThere are many projects today that only gives liquid staking solution to Ethereum like Lido Dao for example, my question is what will be the fate of such projects once Ethereum PoS is live? Will there be any reason for such project to still be as good as today? Some agreed with the migration to PoS and it will be much cheaper to multiply your eth by means of staking. Also its up to the eth miners they can always shift to other coins to mine after the complete transfer. For me the result is a 50% chance to progress or become worse cause for others being on PoS means centralization due to whales controls over this but who knows what might be the fate of eth.But one thing for sure, a limited supply could be a good indication of scarcity which means a possible demand in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "July 17, 2022, 05:53:34 PM",
      "body": "I think the interest rates offered to dao investors will have to just rise to compete with the pos mining.Afaik, you need 30+ eth to start staking anyway so smaller investers that don't trust pools to handle their staking might think it's a better alternative to invest in defi. I think investors will still put a lot of stables into defi too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "July 17, 2022, 08:15:32 PM",
      "body": "statisticshttps://pro.nansen.ai/eth2-deposit-contractvalidator rewards are small so I think validator rewards will be increased to get more users to participatehttps://www.stakingrewards.com/while ethereum validators receive not the best rewards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trx3",
      "created_time": "July 18, 2022, 05:26:17 AM",
      "body": "EasyI believe it's going to be like this Dao Staking will requires small Eth for their APY while Ethereum requires up to 30 ETH, this was why I said to myself im never going to stake ETH because 30 ETH is way too much for me, with Dao platforms it will be possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "July 18, 2022, 08:55:15 AM",
      "body": "Quote from: kaya11 on July 17, 2022, 02:17:46 PMQuote from: livingfree on July 17, 2022, 01:36:00 PMIMHO, it will still be good as it is even it changes from PoW to PoS but honestly, I'd like to see it stay for being PoW. Too many miners that will be affected on it and they'll be dominated by the whales. Stopped mining already just recently because of sudden drop of prices. I can't afford to pay my bills anymore as the source of my free electricity is gone. Too bad it came to this point however I did  not regretted it at all. It was fun mining at the same time having extra profits. Glad I got my ROI before these migrations is going to happen.Well, good news.As you can see, Ethereum's price has recently surged and it's time to open your rig again if it's profitable to you. How long you've been having free electricity for your mining rig?If that's already long enough and you've made a lot of profit from mining ETH, I think you should have bought a solar for the sustainability of your continuous operations. But I know, it's easier to say than done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "July 18, 2022, 11:28:13 AM",
      "body": "I don't think people will consider which platform to stake as long as it is trustworthy and the interest rate is high, the other platform have competitive interest rate to the Ethereum own staking, then  most people will not just move to stake on Ethereum Platform. But if somehow Ethereum could give another benefit to the stakers of their platform then the competitor should worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "July 18, 2022, 01:01:17 PM",
      "body": "Only the whales will really benefit from it if it really happens, eth is expensive even at this current price, and in other to earn a reasonable staking reward it will require you to have a good amount of eth, and not very many people can afford to own much, in essence, i don't think much will change those project will keep operating despite PoS. let it go live first without any further delay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}