{
  "id": "topic_5467122",
  "title": "SilverDesert",
  "author": "SilverDesert",
  "created_time": "September 17, 2023, 05:32:29 PM",
  "content": "Hi,My Antminer S19XP stopped working and was still under Bitmain's warranty. I sent it for repairs and they told me that the miner is scrapped so no warranty applies to it. They said: \"If you would like us to return all the scrapped products to you, please CONTACT US within 5 days otherwise they will be discarded. You need to pay for the additional cost incurred including the return shipping cost, local customs duties and taxes\".I am just appalled that such a big company has such a poor customer service and warranty. Just because a hashboard is not repairable they want to scrap the whole miner?! They could easily replace the faulty hashboard. Why such a frail warranty? I even offered to pay for a replacement hashboard.They did not give me any feedback on why it was scrapped. After emailing them several times, they sent me this low resolution blurry picture. And again after more emails they told me that the hashboard no 2 is scrapped. Can someone please make out what is wrong with the hashboard in the picture?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467122",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "September 17, 2023, 06:05:41 PM",
      "body": "I don't know exactly what Bitmain means about scrapped but I guess they are pointing to ASIC chips and maybe they think that you replaced these chips.This means you already voided the warranty if you replaced these ASIC chips or touched/modified anything on the hardware without their approval this will void the warranty because it's an unauthorized modification.Did you do something on this 2nd hashboard? Or did you bring this to the repair technician before you sent it back to Bitmain?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverDesert",
      "created_time": "September 17, 2023, 06:25:39 PM",
      "body": "It was a virgin S19XP under warranty. I did not tamper with it because of the warranty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 17, 2023, 06:53:28 PM",
      "body": "Quote from: SilverDesert on September 17, 2023, 06:25:39 PMIt was a virgin S19XP under warranty. I did not tamper with it because of the warranty.Sorry for your loss. One chip looks burnt. They will say you overclocked it or failed to keep the gear in a cool room.If you are in the usa i have a good guy very trusted. he has a location in New York State.https://vmssecuritycloud.com/he may be able to fix it or replace it.his name is gregtell him philipma1957 from bitcointalk sent you.good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 17, 2023, 07:04:15 PM",
      "body": "Quote from: SilverDesert on September 17, 2023, 06:25:39 PMIt was a virgin S19XP under warranty. I did not tamper with it because of the warranty.Well, there's nothing we can do that's their assumption.That's why most of their customers end up looking for a closer/near repair center to avoid such issues and to avoid shipping costs and taxes.I think you can try to convince them that the 2nd hash board is not scrapped and you didn't open/change/modify anything on that unit.You can have more chance to convince them if you call them directly to their hotline number +65-3138-9024About the image, it's not clear to me but the one ASIC chip looks like there's a crack.If ever you're looking for a repair center near your location you can check this link below and scroll down you can find the list of ASIC repair centers.- https://www.zeusbtc.com/ASIC-Miner-Repair/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverDesert",
      "created_time": "September 17, 2023, 07:28:55 PM",
      "body": "Thanks for your kind help guys. I have already paid Bitmain to send it back to me. Now I will follow your advice and send it to someone who can fix it.I am just disappointed with Bitmain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "September 18, 2023, 10:50:12 AM",
      "body": "Quote from: SilverDesert on September 17, 2023, 07:28:55 PMThanks for your kind help guys. I have already paid Bitmain to send it back to me. Now I will follow your advice and send it to someone who can fix it.I am just disappointed with Bitmain.At least with an independent repairer you will probably just send the faulty hashboard and keep the rest of your S19 with you.Anyway, we probably have here one more proof of Bitmain's consistency in exaggerating with the guarantee terms and customer support..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "September 19, 2023, 10:13:23 AM",
      "body": "Quote from: SilverDesert on September 17, 2023, 07:28:55 PMThanks for your kind help guys. I have already paid Bitmain to send it back to me. Now I will follow your advice and send it to someone who can fix it.I am just disappointed with Bitmain.I wouldn't be disappointed. After all they don't care about single costumers. They only care about the big fish. Of course they don't want to spend money with your single miner... That's how big companies will always work. No surprise here!This way of dealing with costumers is kind of a way for them to sell more miners and to get more money out of small costumers, in my view!Why don't they have repairing centres all over the world? Why don't they have resellers? This is just to benefit big players imo...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kiwixmr",
      "created_time": "September 20, 2023, 01:45:53 AM",
      "body": "Quote from: SilverDesert on September 17, 2023, 07:28:55 PMThanks for your kind help guys. I have already paid Bitmain to send it back to me. Now I will follow your advice and send it to someone who can fix it.I am just disappointed with Bitmain.PAES in NC can probably help you get it fixed under warranty. I have a miner that got refused warranty and they helped me out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kiwixmr",
      "created_time": "September 20, 2023, 02:18:38 AM",
      "body": "Quote from: SilverDesert on September 17, 2023, 05:32:29 PMHi,My Antminer S19XP stopped working and was still under Bitmain's warranty. I sent it for repairs and they told me that the miner is scrapped so no warranty applies to it. They said: \"If you would like us to return all the scrapped products to you, please CONTACT US within 5 days otherwise they will be discarded. You need to pay for the additional cost incurred including the return shipping cost, local customs duties and taxes\".I am just appalled that such a big company has such a poor customer service and warranty. Just because a hashboard is not repairable they want to scrap the whole miner?! They could easily replace the faulty hashboard. Why such a frail warranty? I even offered to pay for a replacement hashboard.They did not give me any feedback on why it was scrapped. After emailing them several times, they sent me this low resolution blurry picture. And again after more emails they told me that the hashboard no 2 is scrapped. Can someone please make out what is wrong with the hashboard in the picture?https://www.talkimg.com/images/2023/09/17/6vNXw.pngWhich repair center did you send it to?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverDesert",
      "created_time": "September 20, 2023, 10:48:37 AM",
      "body": "I used the UAE-DXB service center.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 20, 2023, 06:03:02 PM",
      "body": "Quote from: BitMaxz on September 17, 2023, 06:05:41 PMI don't know exactly what Bitmain means about scrapped but I guess they are pointing to ASIC chips and maybe they think that you replaced these chips.This means you already voided the warranty if you replaced these ASIC chips or touched/modified anything on the hardware without their approval this will void the warranty because it's an unauthorized modification.Did you do something on this 2nd hashboard? Or did you bring this to the repair technician before you sent it back to Bitmain?I also cannot determine the reason for the malfunction under warranty, but the official service center must first write the reason for the refusal of warranty obligations.If the warranty conditions were violated or the ASIC was repaired out of warranty, then this should be indicated in the service center report.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "September 22, 2023, 10:27:02 PM",
      "body": "Quote from: SilverDesert on September 17, 2023, 07:28:55 PMThanks for your kind help guys. I have already paid Bitmain to send it back to me. Now I will follow your advice and send it to someone who can fix it.I am just disappointed with Bitmain.Well, what did you expect? Like many other manufacturers they're trying to earn and save as much as they possibly can. You could also try to find a used hashboard on our local classifieds website or on ebay. Labor is very expensive these days, perhaps a second-hand unit selling for parts could be cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 24, 2023, 12:05:39 PM",
      "body": "Did you buy it new from Bitmain or new from somebody else?There are a lot of miners out there now that are 'new' from places that are doing really nice refurbs and unless you really look close or know what to look at it's tough to tell that they are not fresh out of the boxI just got an L7 from a person who refurbished it and it's sitting in a rack mining, but when I took it out of the box it looked like it just rolled out of the factory. No dust, no dirt, all fans perfect, all boards washed, and so on. Just some discoloration here and there and that fact that I knew it was a well done refurb were the only reasons I would not have said new from Bitmain. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gabrics",
      "created_time": "September 25, 2023, 08:25:19 AM",
      "body": "Quote from: SilverDesert on September 17, 2023, 06:25:39 PMIt was a virgin S19XP under warranty. I did not tamper with it because of the warranty.I believe it is not tampering. Bitmain's warranty (a read the fine prints some time ago) works this way:You send it in and they try to repair it. BUT: if can't be repaired by their methods/policy then they WON'T replace the board or anything. They will \"scrap it\" as not repairable. Meaning no warranty for you and you are screwed (out of your money).You can get it back (for a price) and hope a 3rd party shop can fix it (which they can if they are good).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverDesert",
      "created_time": "September 25, 2023, 11:27:05 AM",
      "body": "Quote from: DaveF on September 24, 2023, 12:05:39 PMDid you buy it new from Bitmain or new from somebody else?I bought it brand new from Bitmain directly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverDesert",
      "created_time": "September 25, 2023, 11:32:08 AM",
      "body": "QuoteYou can get it back (for a price) and hope a 3rd party shop can fix it (which they can if they are good).A large company like Bitmain surely has all the means to fix stuff they make. They are just not bothered like you said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "September 26, 2023, 11:44:44 AM",
      "body": "There is one thing many mining beginners don't understand, when it comes to warranty, you can't escaped a tampered hardware that's under warranty, if something bad happens to the hardware you are to return and believe me, they are the engineers, they coupled that thing up themselves, you use screwdriver, they will know, you do anything on the board? They will know it, so do not think you are smart, next time return it immediately. When you hear no warranty applied, it's either the warranty expired or you have become the upper smart engineer yourself. As for the picture, was this before or after you sent it back for checkup? Anyway, if you want to fix this I don't know the level of your skills with such hardware and if you don't have any please don't add more problems, send it to a qualified repairer that's not too far from your country.  There are valid repairers in China that I used to send dead GPUs and miners back to, I think you should just ask around, if you are qualified you will still need extra parts and that's going to cost you some money, whatever you might be looking for is available in China. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "September 27, 2023, 05:38:10 PM",
      "body": "Quote from: DaveF on September 24, 2023, 12:05:39 PMDid you buy it new from Bitmain or new from somebody else?There are a lot of miners out there now that are 'new' from places that are doing really nice refurbs and unless you really look close or know what to look at it's tough to tell that they are not fresh out of the boxI just got an L7 from a person who refurbished it and it's sitting in a rack mining, but when I took it out of the box it looked like it just rolled out of the factory. No dust, no dirt, all fans perfect, all boards washed, and so on. Just some discoloration here and there and that fact that I knew it was a well done refurb were the only reasons I would not have said new from Bitmain. -DaveIf the ASIC was under repair, then the authorized service center writes in the report that the ASIC was subjected to unqualified repairs. But the main thing is to contact the client and check where he sent the ASIC for repair. And if the service center does not write the reason in the inspection report, that means they have doubts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gabrics",
      "created_time": "October 13, 2024, 08:57:56 AM",
      "body": "Quote from: SilverDesert on September 17, 2023, 06:25:39 PMIt was a virgin S19XP under warranty. I did not tamper with it because of the warranty.Unfortunately, their warranty states this for years. You send it in and they try to repair. REPAIR, not replace parts. If deemed not repairable it will be scrapped. Pretty bad policy, but they can get away with it as there is still no better offer. After a decade, so I guess we shouldn't hold our breath.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}