{
  "id": "topic_5460743",
  "title": "Jacqueline Tjoa",
  "author": "Jacqueline Tjoa",
  "created_time": "July 23, 2023, 04:24:53 AM",
  "content": "Syalom Salam kenal semuanya, nama saya Jacqueline Tjoa.Baru beberapa hari yang lalu saya mendapatkan tawaran pekerjaan di salah satu start-up asal singapore, sebelumnya saya bekerja untuk agensi periklanan dan karena saat ini saya akan bekerja dengan perusahaan kripto, saya terpaksa harus mempelajari banyak hal tentang kripto.Bergabung di forum ini juga atas dasar rekomendasi bestie saya, katanya dia juga ada di forum ini dan dengan bergabung di forum, kita bisa selangkah lebih mengerti daripada orang yang tidak bergabung. Saya harap apa yang dikatakan teman saya itu benar.Saya sudah membaca peraturan yang ada, apakah ada hal lain yang harus saya baca sebagai noob yang baru join?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460743",
  "comments": [
    {
      "author": "Lukmanfirdaus1",
      "created_time": "July 23, 2023, 05:58:35 AM",
      "body": "Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMSaya sudah membaca peraturan yang ada, apakah ada hal lain yang harus saya baca sebagai noob yang baru join?saya kira agan sudah menjawab pertanyaanya sendiri, saya sarankan agan mulai membaca daripada menulis. bisa dimulai dari topik yang agan sukai, misalnya gambling atau topik yang relevan terhdap pekerjaan agannya.  cara mencarinya bisa via search atau bisa langsung exsplor di forum dan sub forum baik yang utama maupun yang lokal. semoga membantu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "July 23, 2023, 07:45:02 AM",
      "body": "Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMBergabung di forum ini juga atas dasar rekomendasi bestie saya, katanya dia juga ada di forum ini dan dengan bergabung di forum, kita bisa selangkah lebih mengerti daripada orang yang tidak bergabung. Saya harap apa yang dikatakan teman saya itu benar.Saya sudah membaca peraturan yang ada, apakah ada hal lain yang harus saya baca sebagai noob yang baru join?Selamat datang dan salam kenal.Teman kamu benar, bergabung dengan forum ini membuat kita selangkah bahkan lebih dari satu langkah yang akan membuat kita mengerti daripada orang yang tidak bergabung.Forum bitcointalk lengkap dan terupdate seputar informasi tentang kripto khususnya Bitcoin dan secara umum juga update tentang informasi lain.Ketika kamu login, akan terlihat banyak board diskusi mulai dari board Bitcoin Discussion hingga board Local tiap-tiap negara.Temukan diskusi yang sesuai dengan keinginan.Semoga motivasi kamu bergabung lebih luas.Titip salam buat bestie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "July 23, 2023, 06:31:40 PM",
      "body": "Selamat datang di forum bitcointalk dan salam kenal juga gan..Forum ini memang terupdate, tetapi tergantung apa yang agan cari disini, karena semuanya tidak di update juga dalam forum ini, namun disini kami memiliki banyak diskusi tentang permasalahan dan perkembangan, juga banyak gagasan yang terarsipkan dengan baik di forum tentang perkembangan bitcoin atau crypto currency lainnya yang berkaitan, mungkin untuk lebih dalamnya lagi bisa mempertanyakannya kepada anggota forum yang sudah lama disini.Tetapi anda baru masuk hari ini, dan saya pikir anda perlu membaca peraturan forum lebih lengkap supaya tidak menjadi masalah untuk anda kedepannya dalam berinteraksi dengan anggota lainnya di papan diskusi. #Salam hangat bangjoe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "July 24, 2023, 02:17:58 PM",
      "body": "Selamat datang gan dan semoga niat anda untuk belajar tentang crypto di forum ini bisa berjalan dengan lancar.Dan jika agan sudah membaca semua peraturan di forum ini maka langkah selanjutnya cukup simple yaitu tinggal menjelajahi dan mulai beraktivitas saja dalam forum. Baik itu dalam membaca-baca topik yang dibutuhkan untuk menambah wawasan ataupun ikut berinteraksi dalam diskusi. Dan yang paling penting adalah mematuhi peraturan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryu_Ar1",
      "created_time": "July 24, 2023, 04:59:31 PM",
      "body": "Salam kenal semoga anda betah disini Bestie anda cukup tepat menyarankan untuk mencari informasi lebih jauh disini karena memang ini adalah forum yang tepat.Sebenarnya ada banyak yang perlu dibaca sebelum anda mencoba untuk menulis dan saya akan menyisipkan beberapa diantaranya yang menurut saya cukup penting untuk difahami terlebih dahulu.Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQNewbies - Read before postingForum ranks/positions/badges (What do those shiny coins under my name mean?)FAQ: Everything you need to know about forum 'activity, account ranks and meritSebenarnya masih ada banyak sekali informasi yang bisa anda temukan dan itu hanya sebagian kecil yang menurut saya bisa sangat membantu anda untuk mengetahui aturan forum dan apa yang harus anda lakukan. Sisanya silahkan anda explore sendiri",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "July 25, 2023, 07:17:14 AM",
      "body": "Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMSalam kenal semuanya, nama saya Jacqueline Tjoa.Salam kenal, ane harap Jacqueline Tjoa bukan nama asli ente, kalau iya, tentu privasi ente sudah tidak bagus lagi di awal. Karena hampir rata-rata kita di sini pakai nama dumay, mengikuti apa yang dilakukan oleh founding father kita Satoshi Nakamoto.Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMBergabung di forum ini juga atas dasar rekomendasi bestie saya, katanya dia juga ada di forum ini dan dengan bergabung di forum, kita bisa selangkah lebih mengerti daripada orang yang tidak bergabung. Saya harap apa yang dikatakan teman saya itu benar.Paling tdk ente menang 1 langkah dari yang lain, Jas Merah, jangan sesekali lupakan sejarah, karena sejarah bitcoin berawal dari forum ini. Namun, jangan semerta-merta dari forum ini saja ya Jacqueline , ente baiknya nyari juga referensi dari buku lain jika ingin bobot pengatahuannya bertambah dan lebih gacor lagi dalam berposting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "July 25, 2023, 07:27:32 PM",
      "body": "Quote from: blue Snow on July 25, 2023, 07:17:14 AMJas Merah, jangan sesekali lupakan sejarah, karena sejarah bitcoin berawal dari forum ini.Konsepnya salah itu mas bro, bitcoinlah yang justru telah menciptakan sejarah untuk forum ini. Satoshi lebih dulu menciptakan bitcoin sebelum forum bitcointalk diciptakan, bahkan bitcointalk bukanlah forum pertama untuk user bitcoin karena ada forum sebelumnya yang diperuntukkan bagi pengguna bitcoin pada masa-masa awalnya.Salah satunya adalah: https://bitcoin.sourceforge.net/boards/index.php",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "July 25, 2023, 07:50:19 PM",
      "body": "Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMSyalom Salam kenal semuanya, nama saya Jacqueline Tjoa.Baru beberapa hari yang lalu saya mendapatkan tawaran pekerjaan di salah satu start-up asal singapore, sebelumnya saya bekerja untuk agensi periklanan dan karena saat ini saya akan bekerja dengan perusahaan kripto, saya terpaksa harus mempelajari banyak hal tentang kripto.syalom kak jacqueline, salam kenal juga dan selamat bergabung untuk kakaknya di forum ini, beruntung ya kak bisa dapet kerjaan ke singapura di start up kripto lagi, monggo di baca2 ules yang ada ya kak, jangan terlewatkan karena sangat penting apalagi untuk, minta bantuan juga ama temannya atau member SFI yang cukup senior jika nemu kesulitan ya kak, jangan sungkan.jangan merasa terpaksa harus mempelajari banyak hal tentang mata uang kripto kak, karena di masa depan, mata uang kripto adalah hal yang sangat penting dalam kehidupan manusia dan mungkin aja akan menggantikan sistem keuangan yang ada sekarang, jadi ilmu2 seputar mata uang kripto dan teknologi blockchain itu penting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "July 25, 2023, 11:38:25 PMLast edit: July 25, 2023, 11:54:49 PM by komisariatku",
      "body": "Quote from: Lukmanfirdaus1 on July 23, 2023, 05:58:35 AMsaya kira agan sudah menjawab pertanyaanya sendiri, saya sarankan agan mulai membaca daripada menulis. bisa dimulai dari topik yang agan sukai, misalnya gambling atau topik yang relevan terhdap pekerjaan agannya.  cara mencarinya bisa via search atau bisa langsung exsplor di forum dan sub forum baik yang utama maupun yang lokal. semoga membantu.Kalo bisa, biasakan membaca dan menulis juga. Kalo cuma membaca dan menulisnya (post) jarang nanti aktivitynya ga nambah - nambah dong. Selamat datang dan salam kenal agan Jacqueline Tjoa, nicknamenya terlihat bagus gan. Semoga bisa betah dan konsisten untuk terus aktif di forum. Sedikit saran, mungkin agan bisa memulai dengan membaca peraturan yang di sematkan di masing-masing threadSelanjutnya , mungkin agan bisa buka-buka board dan thread yang agan minati, selama agan tidak copy paste (plagiarism),  posting menggunakan AI, dan tidak mencoba menipu siapapun, maka agan akan baik baik saja do forum disini. mungkin agan bisa mencoba memahami mekanisme bagaimana akun bekerja [GUIDE] Sistem Rank, Activity, dan Merit. Selebihnya, mungkin mencoba tetap aktif adalah kunci utamanya..  goodluck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "July 26, 2023, 08:42:44 PM",
      "body": "Quote from: komisariatku on July 25, 2023, 11:38:25 PMSedikit saran, mungkin agan bisa memulai dengan membaca peraturan yang di sematkan di masing-masing threadMungkin maksudnya aturan pada masing-masing board atau sub-board ya gan? Tepatnya sih begitu.Saran pertama; wajib belajar terlepas OP mempelajarinya secara otodidak dengan beberepa referensi yang disarankan atau belajar bersama mentor yang memperkenalkannya forum. Cara belajar dan kecepatan pemahaman tergantung kemampuan kognitif masing-masing, tapi itu bukan masalah selama anda memiliki minat yang tinggi untuk belajar. Konsisten dan jangan menyerah, itu adalah saran lainnya setelah memahami aturan-aturan yang berlaku.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "July 26, 2023, 10:47:09 PM",
      "body": "Quote from: ShowOff on July 26, 2023, 08:42:44 PMQuote from: komisariatku on July 25, 2023, 11:38:25 PMSedikit saran, mungkin agan bisa memulai dengan membaca peraturan yang di sematkan di masing-masing threadMungkin maksudnya aturan pada masing-masing board atau sub-board ya gan? Tepatnya sih begitu.Oya benar, terimakasih sudah di koreksi ganQuote from: ShowOff on July 26, 2023, 08:42:44 PMSaran pertama; wajib belajar terlepas OP mempelajarinya secara otodidak dengan beberepa referensi yang disarankan atau belajar bersama mentor yang memperkenalkannya forum. Cara belajar dan kecepatan pemahaman tergantung kemampuan kognitif masing-masing, tapi itu bukan masalah selama anda memiliki minat yang tinggi untuk belajar. Konsisten dan jangan menyerah, itu adalah saran lainnya setelah memahami aturan-aturan yang berlaku.Sepakat gan, itu saran yang sangat bagus. Walaupun mungkin saran untuk konsisten dan jangan menyerah itu terlihat sederhana tetapi memang disitu kunci utamanya. Apalagi sekarang yang bisa di katakan bahwa hanya signatur bayaran btc yang masih menjanjikan maka member baru paling tidak harus kuat selama 4 atau 5 bulan agar bisa ikutan, dan sepertinya tidak banyak yang kuat sampai sejauh itu, aplagi jika merit tak kunjung dapat maka kebanyakan akan loyo dan perlahan meninggalkan forumSaya masih sepakat dengan agan terkait adanya mentor atau tidak itu tidak terlalu berpengaruh karena pemahaman orang berbeda-beda dan tetep butuh kretifitas individu agar bisa membuat konten yang menarik. Saya sempat mengajari seseorang yang katanya butuh penghasilan tambahan, dan saya kenalkan forum ini tetapi dia tidak bertahan lama, paling kuat 2 bulan dan lama-lama undur diri karena tidak mampu konsisten dan menyerah dengan sistem merit yang ada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "July 27, 2023, 03:15:59 AM",
      "body": "Quote from: komisariatku on July 26, 2023, 10:47:09 PMSepakat gan, itu saran yang sangat bagus. Walaupun mungkin saran untuk konsisten dan jangan menyerah itu terlihat sederhana tetapi memang disitu kunci utamanya. Apalagi sekarang yang bisa di katakan bahwa hanya signatur bayaran btc yang masih menjanjikan maka member baru paling tidak harus kuat selama 4 atau 5 bulan agar bisa ikutan, dan sepertinya tidak banyak yang kuat sampai sejauh itu, aplagi jika merit tak kunjung dapat maka kebanyakan akan loyo dan perlahan meninggalkan forumSaya masih sepakat dengan agan terkait adanya mentor atau tidak itu tidak terlalu berpengaruh karena pemahaman orang berbeda-beda dan tetep butuh kretifitas individu agar bisa membuat konten yang menarik. Saya sempat mengajari seseorang yang katanya butuh penghasilan tambahan, dan saya kenalkan forum ini tetapi dia tidak bertahan lama, paling kuat 2 bulan dan lama-lama undur diri karena tidak mampu konsisten dan menyerah dengan sistem merit yang ada.Saya memahaminya OP bergabung kesini itu untuk menunjang pengetahuannya perihal cryptocurrency, karena bisa dikatakan masih ada hubungannya dengan jenis pekerjaan di perusahaan yang akan ditempatinya. Jadi asumsi saya OP mestinya tidak akan terlalu memusingkan perihal naik rank, merit atau semisalnya karena tujuannya sedari awal juga bukan semata untuk itu.Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMBaru beberapa hari yang lalu saya mendapatkan tawaran pekerjaan di salah satu start-up asal singapore, sebelumnya saya bekerja untuk agensi periklanan dan karena saat ini saya akan bekerja dengan perusahaan kripto, saya terpaksa harus mempelajari banyak hal tentang kripto.Bergabung di forum ini juga atas dasar rekomendasi bestie saya, katanya dia juga ada di forum ini dan dengan bergabung di forum, kita bisa selangkah lebih mengerti daripada orang yang tidak bergabung. Saya harap apa yang dikatakan teman saya itu benar.Saya sudah membaca peraturan yang ada, apakah ada hal lain yang harus saya baca sebagai noob yang baru join?Karena informasi di forum ini rata-rata tersebar di berbagai board dan bisa dikatakan tidak runut, jadi saran saya agan bisa menyesuaikan dengan keperluan informasi yang terkait dengan perusahaan agan tersebut kemudian bisa membuka diskusi langsung dengan pertanyaan atau dengan mencari thread yang sekiranya sudah ada lalu agan ikut berdiskusi disana*.Contoh, jika perusahaannya merupakan exchanger, agan bisa cari informasi terkait trading; Jika bergerak di pengembangan blockchain, agan bisa fokus ke diskusi seputar blockhain, dll.* Bisa menggunakan menu Search dari forum Bitcointalk, bisa juga menggunakan salah satu tool berikut: https://ninjastic.space/search.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "July 27, 2023, 11:04:12 AM",
      "body": "Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMSalam kenal semuanya, nama saya Jacqueline Tjoa.Salam kenal juga dari saya om, semoga om bisa sangat betah di forum ini dengan terus mencari ilmu lewat tulisan-tulisan yang sudah ada didalam forum ini om.QuoteBaru beberapa hari yang lalu saya mendapatkan tawaran pekerjaan di salah satu start-up asal singapore, sebelumnya saya bekerja untuk agensi periklanan dan karena saat ini saya akan bekerja dengan perusahaan kripto, saya terpaksa harus mempelajari banyak hal tentang kripto.Bergabung di forum ini juga atas dasar rekomendasi bestie saya, katanya dia juga ada di forum ini dan dengan bergabung di forum, kita bisa selangkah lebih mengerti daripada orang yang tidak bergabung. Saya harap apa yang dikatakan teman saya itu benar.Saya sudah membaca peraturan yang ada, apakah ada hal lain yang harus saya baca sebagai noob yang baru join?Sebenarnya tidak harus terpaksa juga sih om untuk masuk kesini kalau hanya ingin mempelajari lebih banyak tentang kripto karena om sudah bekerja di perusahaan kripto, meskipun akan lebih baik juga sih kalau om mau masuk kesini untuk mempelajari hal-hal tentang kripto. Karena sekarang sudah ada banyak website yang bisa om gunakan untuk sumber bacaan seputar kripto yang mungkin website tersebut juga bisa membantu om dalam mempelajari tentang kripto, salah satunya adalah https://cointelegraph.com/ Rekomendasi dari bestie om tersebut sama sekali tidak salah karena mungkin bestie om telah melihat banyak diskusi unik dan juga menarik didalam forum ini sehingga bestie om mau merekomendasikan forum ini juga untuk om. Tetapi selain itu, om sendiri juga bisa membuat perkembangan pada diri om sendiri supaya suatu hari nanti om juga bisa mendapatkan penghasilan lewat forum ini meskipun om sudah memiliki gaji dari tempat kerja pada perusahaan kripto yang om katakan itu. Dan untuk apa-apa saja yang harus om baca disini, saya lihat teman-teman SFI yang lainnya juga sudah memberikan sarannya disini untuk om sehingga saya pikir tidak perlu lagi memberikan saran yang sama karena om bisa langsung membaca pada link yang diberikan oleh @Ryu_Ar1 om.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "July 28, 2023, 06:46:28 AM",
      "body": "Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMBergabung di forum ini juga atas dasar rekomendasi bestie saya, katanya dia juga ada di forum ini dan dengan bergabung di forum, kita bisa selangkah lebih mengerti daripada orang yang tidak bergabung. Saya harap apa yang dikatakan teman saya itu benar.Sebenarnya tanpa bergabung dengan forum ini anda juga akan bisa meningkatkan pengetahuan anda tentang cryptocurrency dengan membaca berbagai website yang membahas mengenai cryptocurrency. Di google anda bisa mencari website-website yang membahas mengenai crypto dan blockchain dan jumlahnya itu ada banyak, jadi tidak perlu harus bergabung ke forum ini baru anda bisa lebih mengerti mengenai cryptocurrency.Bergabung ke forum ini sebenarnya juga jangan dengan paksaan, itu harusnya diawali dari niat anda untuk bisa berinteraksi dan berbagi ilmu bersama dengan member lainnya yang ada di forum ini. Kalau anda masuk ke forum ini dengan paksaan, saya pikir bahwa mayoritas member disini akan menghiraukan pertanyaan-pertanyaan anda tentang cryptocurrency karena untuk apa juga menjawab pertanyaan dari seorang member yang terpaksa masuk kedalam forum ini, tidak ada untungnya juga buat kami. Apalagi anda masuk kedalam forum ini karena masalah pekerjaan, artinya anda memanfaatkan forum ini hanya untuk urusan bisnis semata dan harusnya anda paham bahwa tipikal orang seperti ini tidak akan diterima di forum manapun itu. Maaf misalnya saya sedikit keras disini, tapi anda harus paham bahwa ini bukan forum untuk bermain-main.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "July 28, 2023, 08:37:34 PM",
      "body": "Quote from: retreat on July 28, 2023, 06:46:28 AMBergabung ke forum ini sebenarnya juga jangan dengan paksaan, itu harusnya diawali dari niat anda untuk bisa berinteraksi dan berbagi ilmu bersama dengan member lainnya yang ada di forum ini. Kalau anda masuk ke forum ini dengan paksaan, saya pikir bahwa mayoritas member disini akan menghiraukan pertanyaan-pertanyaan anda tentang cryptocurrency karena untuk apa juga menjawab pertanyaan dari seorang member yang terpaksa masuk kedalam forum ini, tidak ada untungnya juga buat kami.Mau terpaksa bergabung atau tidak, pada intinya ane kira OP bergabung ke forum karena ingin mempelajari sesuatu, bukan untuk mencari keuntungan dari signature campaign seperti kebanyakan member lainnya. Terserah OP bergabungnya karena apa, selama dia tidak melanggar aturan forum maka setiap pengguna akan disambut hangat. Lagian menjawab beberapa pertanyaan pemula dan membimbingnya di forum memiliki beberapa manfaatnya. Setidaknya anda bisa mendapatkan bayaran dari signature campaign, bisa dapat merit karena kualitas jawabannya atau juga bisa menjadi cara untuk menambah dan menjaga pengetahuan tetap melekat. Quote from: retreat on July 28, 2023, 06:46:28 AMApalagi anda masuk kedalam forum ini karena masalah pekerjaan, artinya anda memanfaatkan forum ini hanya untuk urusan bisnis semata dan harusnya anda paham bahwa tipikal orang seperti ini tidak akan diterima di forum manapun itu.Tapi di forum bitcointalk bebas, OP akan diterima dengan hangat, terlepas dari apa alasan yang membawanya kesini. Urusan bisnis itu urusannya, urusan komunitas adalah membimbing pengguna yang ingin mempelajari sesuatu tentang bitcoin atau lain sebagainya. Anda bisa mengabaikan OP jika anda tidak menyukainya, itu jauh lebih baik daripada menjatuhkannya dengan keras.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "July 28, 2023, 08:58:46 PM",
      "body": "Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMBaru beberapa hari yang lalu saya mendapatkan tawaran pekerjaan di salah satu start-up asal singapore, sebelumnya saya bekerja untuk agensi periklanan dan karena saat ini saya akan bekerja dengan perusahaan kripto, saya terpaksa harus mempelajari banyak hal tentang kripto.Harusnya itu bukan paksaan tapi sudah selayaknya mempelajari crypto karena urusan pekerjaan. Memilih pekerjaan tersebut juga bukan paksaan kan? Tapi saya yakin itu atas keputusan agan sendiri, entah karena peluang karirnya lebih menjanjikan atau karena gajinya lebih besar nominalnya.Quote from: Jacqueline Tjoa on July 23, 2023, 04:24:53 AMBergabung di forum ini juga atas dasar rekomendasi bestie saya, katanya dia juga ada di forum ini dan dengan bergabung di forum, kita bisa selangkah lebih mengerti daripada orang yang tidak bergabung. Saya harap apa yang dikatakan teman saya itu benar.Kalau agan punya bestie yang sudah berpengalaman di forum, agan bisa belajar banyak dari bestie agan sendiri. Tentu akan lebih mudah mempelajari hal-hal yang ada di forum jika ada yang mengarahkan atau membimbing. Walaupun belajar otodidak juga tidak masalah, saya yakin hampir sebagian besar member SFI pun belajar otodidak.Quote from: BITCOIN4X on July 28, 2023, 08:37:34 PMMau terpaksa bergabung atau tidak, pada intinya ane kira OP bergabung ke forum karena ingin mempelajari sesuatu, bukan untuk mencari keuntungan dari signature campaign seperti kebanyakan member lainnya.Alasannya jelas karena terkait pekerjaan atau profesinya saat ini. Memang ada redaksi \"terpaksa\" kalau kita simak di threadnya, tapi harusnya itu bukan paksaan tapi lebih ke sebuah keharusan karena tuntutan pekerjaannya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Arenga pinnata",
      "created_time": "July 28, 2023, 11:35:47 PM",
      "body": "Salam kenal dan selamat datang juga mas.Semoga dengan bergabungnya anda ke forum ini bisa membawa warna baru dalam forum lokal indonesia. Dan semoga anda juga mendapatkan apa yang anda cari di forum ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "July 29, 2023, 05:50:15 PM",
      "body": "Quote from: kawetsriyanto on July 28, 2023, 08:58:46 PMQuote from: BITCOIN4X on July 28, 2023, 08:37:34 PMMau terpaksa bergabung atau tidak, pada intinya ane kira OP bergabung ke forum karena ingin mempelajari sesuatu, bukan untuk mencari keuntungan dari signature campaign seperti kebanyakan member lainnya.Alasannya jelas karena terkait pekerjaan atau profesinya saat ini. Memang ada redaksi \"terpaksa\" kalau kita simak di threadnya, tapi harusnya itu bukan paksaan tapi lebih ke sebuah keharusan karena tuntutan pekerjaannya.Mungkin kata yang lebih cocok untuk alasan OP belajar adalah tuntutan pekerjaan om, bukan sebuah paksaan dalam artian umum. Ya mau tidak mau OP harus mempelajarinya terlepas dari apapun alasannya karena pada akhirnya pengetahuannya akan membantunya dalam menekuni pekerjaan itu dengan baik. Tapi kalau hanya karena alasan itu OP tidak diterima di forum, maka jelas itu adalah tanggapan yang kurang tepat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "July 30, 2023, 03:11:37 PM",
      "body": "Quote from: BITCOIN4X on July 29, 2023, 05:50:15 PMQuote from: kawetsriyanto on July 28, 2023, 08:58:46 PMQuote from: BITCOIN4X on July 28, 2023, 08:37:34 PMMau terpaksa bergabung atau tidak, pada intinya ane kira OP bergabung ke forum karena ingin mempelajari sesuatu, bukan untuk mencari keuntungan dari signature campaign seperti kebanyakan member lainnya.Alasannya jelas karena terkait pekerjaan atau profesinya saat ini. Memang ada redaksi \"terpaksa\" kalau kita simak di threadnya, tapi harusnya itu bukan paksaan tapi lebih ke sebuah keharusan karena tuntutan pekerjaannya.Mungkin kata yang lebih cocok untuk alasan OP belajar adalah tuntutan pekerjaan om, bukan sebuah paksaan dalam artian umum. Ya mau tidak mau OP harus mempelajarinya terlepas dari apapun alasannya karena pada akhirnya pengetahuannya akan membantunya dalam menekuni pekerjaan itu dengan baik. Tapi kalau hanya karena alasan itu OP tidak diterima di forum, maka jelas itu adalah tanggapan yang kurang tepat.Op perlu menyesuaikan diri dengan pekerjaan barunya dengan mempelajari hal-hal yang berkaitan dengan crypto. Menurut sudut pandang ane niat Op ingin mempelajari crypto murni karena tuntutan pekerjaan, bukan karena ada unsur keterpaksaan. Berkaitan dengan tuntutan pekerjaan akan lebih mudah dipahami daripada sebuah paksaan, keputusannya bergabung di forum akan memberinya kesempatan untuk mempelajari sesuatu yang dibutuhkan dalam pekerjaannya, dia perlu juga beradaptasi dengan baik apalagi perusahaan tempat dia bekerja bergerak di bidang crypto.Dia perlu melakukan sesuatu yang bisa menghilangkan kebingungan dengan apa yang akan dibicarakan di sekitar tempat kerjanya, dengan bergabung di forum bisa bisa mempelajari dasar-dasar atau kata istilah yang sering digunakan dalam crypto. Semoga Op bisa menjadi lebih baik dan pengetahuan tentang crypto lebih meningkat setelah bergabung di forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}