{
  "id": "topic_5403266",
  "title": "virtualdn",
  "author": "virtualdn",
  "created_time": "June 19, 2022, 09:34:49 PMLast edit: June 19, 2022, 09:48:33 PM by virtualdn",
  "content": "Some people never learn. This is not the end of the world. BTC has the capacity to grow like 50% in 1 week so people should learn that every drama is temporarily in the crypto world. Poor naysayers. Poor Peter Schiff. Such unhappy people. All the gold still doesn't make them happy. Cheers to you all happy Bitcoiners",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403266",
  "comments": [
    {
      "author": "AmoreJaz",
      "created_time": "June 19, 2022, 09:53:34 PM",
      "body": "well, that's life. some people panic when they saw BTC plunging below 20k and saw the 17k level. but for those who bought at that price range, they can even sell it right now at a profit. people act differently when the market is fluctuating so bad, and some holders are weak for so many reasons. we can't blame them because they have their own reasons. but for those who are still keeping their coins, for sure, they are starting to feel a lil bit of relief because they are seeing green again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 19, 2022, 10:14:58 PMLast edit: June 19, 2022, 10:37:40 PM by franky1",
      "body": "i do not believe that there were alot of idiots selling at a loss down to $17k.i believe it was the old whales that were giving up but still selling at a profit (coins they held from days where they acquired them way below $17k from the good old day)to which. now they are out and no longer holding coins they acquired and valued as profitable at below $17kthe new holders that bought at $17k+ are setting their 'limit' to (being smart) never sell below $17k+ break evenand thus less people with coins acquired below $17k. and more people with coins acquired above $17k. thus supporting $17k as a stronger \"bottom\". disclaimer:that said i acquired a hoard in 2012 and im still in profit all the way down to extreme low prices.. but i have no intention to sell at low prices... im not saying there is no one else left with coins that can still profit below $17k.. but there are far far less of us left that could.. and now far far more people with a $17k+ base break even limit they wont sell below..anywaythose buying at $17k. can sell at $20k and make 10% profit in one day. thats alot better then bank account savings interest that only offers 0.05% a year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sterbens",
      "created_time": "June 19, 2022, 10:29:35 PM",
      "body": "Quote from: virtualdn on June 19, 2022, 09:34:49 PMSome people never learn. This is not the end of the world. BTC has the capacity to grow like 50% in 1 week so people should learn that every drama is temporarily in the crypto world. Poor naysayers. Poor Peter Schiff. Such unhappy people. All the gold still doesn't make them happy. Cheers to you all happy Bitcoiners Hopefully, it's a good price bounce and stays above $20K. Those who have already picked it up at $17K may be quite happy and may not find another $17K in the future. On the other hand, the bad news that has been affecting market prices for a while is expected to pass. The panicked sellers actually felt a thousand regrets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "June 19, 2022, 11:08:27 PM",
      "body": "Quote from: Sterbens on June 19, 2022, 10:29:35 PMQuote from: virtualdn on June 19, 2022, 09:34:49 PMSome people never learn. This is not the end of the world. BTC has the capacity to grow like 50% in 1 week so people should learn that every drama is temporarily in the crypto world. Poor naysayers. Poor Peter Schiff. Such unhappy people. All the gold still doesn't make them happy. Cheers to you all happy Bitcoiners Hopefully, it's a good price bounce and stays above $20K. Those who have already picked it up at $17K may be quite happy and may not find another $17K in the future. On the other hand, the bad news that has been affecting market prices for a while is expected to pass. The panicked sellers actually felt a thousand regrets.Not so many would sell at the $17k price, only a few that don't believe bitcoin has a future about it and fall for the crap that, bitcoin is set to crash. Although, it made people panic and I had friends that were telling me to sell/withdraw all I've got but, I surely know better.It would be a shame to have been on the forum and been into cryptocurrency for a couple of years now and still, not get to understand how the bear market works. The bears have been surprising lately and as such, I can't count on the current $20k price to be something to be hopeful over but, its a good place for a start and something to smile at.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "June 19, 2022, 11:17:38 PM",
      "body": "Those who had been getting FUD might already be sold out their Bitcoin and they might be at this moment scratching their head seeing the market slowly recovering.  Selling your Bitcoin at a loss is totally insane or you can be called an idiot, they didn't patiently wait until the market will recover. For the old Bitcoiners, it seems who already understand this situation, and those newcomers that easily get FUD might have regretted it now. I have a lot of friends investing at $17k since the market has grown a bit a little for sure they are very happy right now and I will try to contact them later to know what they feel like. Quote from: virtualdn on June 19, 2022, 09:34:49 PMPoor Peter Schiff. Such unhappy people. All the gold still doesn't make them happy. Cheers to you all happy Bitcoiners We may laugh at them now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TelolettOm",
      "created_time": "June 19, 2022, 11:30:17 PM",
      "body": "Quote from: virtualdn on June 19, 2022, 09:34:49 PMSome people never learn. This is not the end of the world. BTC has the capacity to grow like 50% in 1 week so people should learn that every drama is temporarily in the crypto world. Poor naysayers. Poor Peter Schiff. Such unhappy people. All the gold still doesn't make them happy. Cheers to you all happy Bitcoiners I ma sure that the price of Bitcoin will be changing soon because the market is still very unstable. The bearish is till ongoing. The price may be dropped again.So silly to see people who panic enough with this current market, moreover who sold their Bitcoin because of price drops that made panic situation.But, it will be different if those people are selling the Bitcoin because they are  traders, this will have different purpose. Holders or traders may be worthy as long as we know the ways. The worse is that we want to be a holder but we are too panic every time we see the market red and dropped",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EdenHazard",
      "created_time": "June 19, 2022, 11:35:16 PM",
      "body": "Quote from: Sterbens on June 19, 2022, 10:29:35 PMQuote from: virtualdn on June 19, 2022, 09:34:49 PMSome people never learn. This is not the end of the world. BTC has the capacity to grow like 50% in 1 week so people should learn that every drama is temporarily in the crypto world. Poor naysayers. Poor Peter Schiff. Such unhappy people. All the gold still doesn't make them happy. Cheers to you all happy Bitcoiners Hopefully, it's a good price bounce and stays above $20K. Those who have already picked it up at $17K may be quite happy and may not find another $17K in the future. On the other hand, the bad news that has been affecting market prices for a while is expected to pass. The panicked sellers actually felt a thousand regrets.We can still go down though .Just don't forget that the bearish season might continue and the current flash bouncing are temporary only , wait and see if the price break 21k and stay there for a coiple weeks then i believe the bottom were indeed at 17.7k .Im cutting losses at 19k though but get backup now as i got some more below 18k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "June 19, 2022, 11:59:13 PM",
      "body": "Very few users could've invested in bitcoin and have sold it on loss. Most of the users could've known much about the risk of cryptocurrency market. You can accumulate when you build-up trust over bitcoin. This is the fluctuation of the market. Users who were with worries out of the market can make use to earn something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jatiluhung",
      "created_time": "June 20, 2022, 12:13:50 AM",
      "body": "most who sell at $ 17k are beginners who still can't control their psychology so they panic easily. and when prices rise again they will panic again and move quickly to buy back. because for those who are experienced then the price of $ 17k is not the time to sell but the right time to buy. sometimes people get caught up in the news. and they even sell when the market is red and buy when the market is green. of course they become losers and losers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "June 20, 2022, 12:37:03 AM",
      "body": "Quote from: Jatiluhung on June 20, 2022, 12:13:50 AMmost who sell at $ 17k are beginners who still can't control their psychology so they panic easily. I have no doubt that a bunch of people sold because their technical indicators broke through resistance. And none of them will say anything because TA people always talk about their successes but never about their failures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 20, 2022, 01:17:58 AM",
      "body": "Quote from: Jatiluhung on June 20, 2022, 12:13:50 AMmost who sell at $ 17k are beginners people keep inferring that the sellers at $17k are newbies that sold at a loss..heres some logic..firstly to push the price down this low required a heck of alot of BTC to do so...now lets imagine 2 groups of say 20,000 people..they all invest say $2k (1-2 months of salary at minimum wage for most western countries)meaning each group totals $40,000,000now imagine one group is old investors from 2016. ($500/btc)their total combined btc haul is 80,000btcimagine the other group bought in 2021-2 ($40k/btc)their total combined btc haul is 1,000btcnow which group 1k or 80k btc do you think has the most potential yield to push the price down significantly..logic is the older group with 80x more coins. and psychologically they would happily do it because they are in a 17-40x profit in prices when pushing it down from $40k-$17k in recent months.now imagine in this demonstration of randomly chosen number of users..20,000 less people wiling to sell down to $1k because they have sold somewhere between $40k->$17kand imagine there are now more holders holding value $17k+",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "June 20, 2022, 01:20:32 AM",
      "body": "Quote from: virtualdn on June 19, 2022, 09:34:49 PMSome people never learn. This is not the end of the world. BTC has the capacity to grow like 50% in 1 week so people should learn that every drama is temporarily in the crypto world. Poor naysayers. Poor Peter Schiff. Such unhappy people. All the gold still doesn't make them happy. Cheers to you all happy Bitcoiners It's stupid to sell BTC at a loss. A smart investor will \"hodl\" the BTC until prices rise back up again. If people think that BTC going down in price is the end of the world, then they truly don't understand what the cryptocurrency is all about. It's not really about the price, but rather BTC's underlying technology to change our world for the better. Bitcoin is just like the Internet which is truly unstoppable. Market prices wouldn't be much of an issue if Bitcoin was used as the standard unit of account. This means pricing goods and services in Bitcoin terms (not Fiat). Bitcoin by itself, is as stable and sound as you can imagine.Ultimately, we'll be the ones laughing at the end as BTC soars towards new All-time-highs. Just buy the dip and don't sell no matter what.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 20, 2022, 02:47:13 AM",
      "body": "It’s too early to tell. Selling at $17.7K was good if it keeps going down again into the $15K or so.Most likely since tomorrow is a holiday we will get sideways actual. Don’t think the low will break. However if the stock market keeps crashing again then it will take Bitcoin along for the ride. Right now there is very little liquidity everywhere and everything can very quickly move up and down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "June 20, 2022, 02:51:03 AM",
      "body": "Quote from: virtualdn on June 19, 2022, 09:34:49 PMSome people never learn. This is not the end of the world. BTC has the capacity to grow like 50% in 1 week so people should learn that every drama is temporarily in the crypto world. Poor naysayers. Poor Peter Schiff. Such unhappy people. All the gold still doesn't make them happy. Cheers to you all happy Bitcoiners I mean there should be no surprises, the price is going to recover after going that low at $17,500. Actually I didn't bother to look at the price, the last time is that the price is around $19k'ish and so it went down as low as $17k? But look at the price now, good bounce isn't it.And that is the problem with inexperience investors, maybe they bought at $60k or even $30k. But doesn't have the mentally to hold and just simply panic before their portfolio is going down and they are nervous that it will be wipe out. And 24 - 48 hours later, around 8%-12% increased.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sir Legend",
      "created_time": "June 20, 2022, 03:53:03 AM",
      "body": "I'm happy because today the bitcoin price returned to the $20k level, experiencing the worst trend since the last 2 years, I hope there won't be another dip like the last 8 days which made many holders panic and sell at low prices, and the better news is that I bought at $18k and if I sell now of course I will profit, but I think the opportunity for rising is bigger so I will buy again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "June 20, 2022, 04:05:04 AM",
      "body": "It's hard to learn something, especially if we are talking about the emotions of people around us. Imagine someone who has been investing in BTC for the first time and then experiencing a loss of 50%; who wouldn't have a hard time dealing with it? Even at times, I worry about the times when it goes lower and lower. I think of the possibility of just buying more at a lower price. Averaging it at a higher price would be great.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "June 20, 2022, 04:53:04 AM",
      "body": "The price now stands to 20k abovehttps://coinmarketcap.com/currencies/bitcoin/and Indeed those who sold their coin at 17k are really hurting nowadays because  look how increases the price now, and the price are still strongly holding to this level but still not having assurance to stay at this and many says this will drops down again sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "June 20, 2022, 04:55:24 AM",
      "body": "Quote from: virtualdn on June 19, 2022, 09:34:49 PMSome people never learn. This is not the end of the world. BTC has the capacity to grow like 50% in 1 week so people should learn that every drama is temporarily in the crypto world. Poor naysayers. Poor Peter Schiff. Such unhappy people. All the gold still doesn't make them happy. Cheers to you all happy Bitcoiners As per the subject, there is no reason to sell at 17k or even at 20k. We are very near to the bottom and this is not a wise decision to sell at thewe low prices. Wise people buy at these prices and not sell. A month ago no one could have dreamt to see bitcoin below 20k. A lifetime opportunity to buy now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wilhelm",
      "created_time": "June 20, 2022, 06:39:37 AM",
      "body": "I think someone \"got sold\" after some whale-play",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}