{
  "id": "topic_5473606",
  "title": "Bitcoin Smith",
  "author": "Bitcoin Smith",
  "created_time": "November 10, 2023, 12:46:00 PM",
  "content": "The Narcotics Control Bureau and the Indian Cyber Crime Coordination Centre trained 141 officials and over 2,800 officers in the financial year 2022–2023.The annual report from India’s Ministry of Home Affairs (MHA) revealed that officials from various cybercrime and police departments were trained in cryptocurrency forensics and investigation during the financial year 2022–2023.The MHA highlighted that, under the Narcotics Control Bureau — India’s central law enforcement and intelligence agency — 141 officers were trained on the investigations of darknet and cryptocurrencies and other workshops related to digital footprints and gathering intelligence and evidence from open source and social media, to name a few.Additionally, the Indian Cyber Crime Coordination Centre trained more than 2,800 cyber police officials in crypto forensics and investigations and other emerging technologies like anonymization networks and investigating misuse of mobile applications in cyberspace.SourceThis is really a great news for the Indian crypto community and a step forward in the cyber security, the numbers are negligible comparing the size population which exceeds 1.4 Billion still the government is taking their infant step now which will encourage people to report their scams to cyber cells and possibly we can track down the scammers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473606",
  "comments": [
    {
      "author": "Bureau",
      "created_time": "November 10, 2023, 01:15:09 PM",
      "body": "Quote from: Bitcoin Smith on November 10, 2023, 12:46:00 PMThis is really a great news for the Indian crypto community and a step forward in the cyber security, the numbers are negligible comparing the size population which exceeds 1.4 Billion still the government is taking their infant step now which will encourage people to report their scams to cyber cells and possibly we can track down the scammers.This is really a good news! Considering how much functionally illiterate our Indian cops are when there is a crime related to cryptocurrency. Getting them onboard will help the innocent community and get hold of criminals. How long are they able to remember it is a big question. Like cyber crime there should be a dedicated unit within it to handle such issues. I am unaware whether Indian local police has such a unit. I am aware that the NIA, CBI, RAW and IB has such dedicated unit. India needs such law enforcement units locally and they should be fully equipped and have proper knowledge to investigate such crimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "November 10, 2023, 02:43:39 PM",
      "body": "Quote from: Bureau on November 10, 2023, 01:15:09 PM.Like cyber crime there should be a dedicated unit within it to handle such issues. I am unaware whether Indian local police has such a unit. I am aware that the NIA, CBI, RAW and IB has such dedicated unit. India needs such law enforcement units locally and they should be fully equipped and have proper knowledge to investigate such crimes. Crypto scams should comes under cyber crime and that is how even currently works but the India lacks laws against cyber security/scams/threats like EU that is why EU doesn't allow any app to collect user data but in India there is no regulations against it but in few cases government banned such apps but a clear cut rules and regulations should be in practice.Local police stations doesn't even have any knowledge even when you want to report something related to online shopping scams so expecting them to have any knowledge about crypto is too much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "November 10, 2023, 03:09:23 PMLast edit: November 11, 2023, 09:41:46 AM by cafter",
      "body": "Quote from: Bureau on November 10, 2023, 01:15:09 PMLike cyber crime there should be a dedicated unit within it to handle such issues. I am unaware whether Indian local police has such a unit. India have dedicated units to report cyber crime:Cyber Crime Investigation Cells (CCIC): These are specialized police teams found in different parts of India. Their main job is to handle cybercrimes, such as online fraud and hacking.Check the hyperlinked site to view all cells in different regions of india.National Cyber Crime Reporting Portal: It's an online platform available nationally to report cybercrimes. it is easy to report incidents like online fraud/hacking quickly online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "November 10, 2023, 05:29:03 PM",
      "body": "It's a really good thing for the crypto community of India. the reputation of cryptocurrency in India is really low due to all the negative publicities by the bank's. Also whatever global hacking incidence are happening, those are also getting publicised by the media keeping cryptocurrency in bad light. So if the police force is able to track down the crypto criminals effectively. The usage of cryptocurrency for illegal means should get reduced. All we want is a good reputation of cryptocurrency in India.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "November 10, 2023, 09:31:45 PM",
      "body": "This should have been implemented long time ago but regardless it's a really good step which the government of India has taken as these scammers has to be tracked down and put behind bars, educational about crypto will still remain a challenging task considering the total population and there has been a lot of online related frauds happening in India and if you are not aware then see a documentary called \"Jamtara\" on Netflix it will shed light on how innocent people are getting scammed, when they are able to scam people by impersonating as Ecommerce, food delivery app and banks where sensitive information is required then imagine the level at which they can scam people with crypto. I just wish these coos don't hand in glove with the scammers like they did in a recent crypto scandal uncovered. Not only India but whole world needs to take steps to educate people on crypto and identifying scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "November 11, 2023, 08:35:05 AM",
      "body": "Quote from: cafter on November 10, 2023, 03:09:23 PMIndia have dedicated units to report cyber crimeBut what about the efficinecy of the cyber related compaints, its pretty low as far as I know and India needs to grow a lot in this sector and need to hire the actual professional who equipped with the knowledge from top universities and train them to make the system more effective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "November 11, 2023, 09:42:21 AM",
      "body": "Quote from: Bitcoin Smith on November 11, 2023, 08:35:05 AMQuote from: cafter on November 10, 2023, 03:09:23 PMIndia have dedicated units to report cyber crimeBut what about the efficinecy of the cyber related compaints, its pretty low as far as I know and India needs to grow a lot in this sector and need to hire the actual professional who equipped with the knowledge from top universities and train them to make the system more effective.The next level of crime in India and abroad is cybercrime. We as Indians recently got the privacy law which has been pending for quite some time now. just imagine what kind of officers are working in cybercrime. India has tons of call centers that are scam centers that commit international crimes by calling people abroad and then trying to get money from them. These call centers are being reported by scam-busting Youtubers but our cyber cell does not have a clue about them. Only after the FBI reports them to India that the cybercrime division of the local Police take some action. I do not expect anything great after these guys get trained as they still do not have any clue what they are dealing with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "November 11, 2023, 09:57:25 AM",
      "body": "Quote from: pakhitheboss on November 11, 2023, 09:42:21 AMsnipMany Indians often don't show much interest in exploring technology due to their mindset. Only a handful of people in India pick courses or study topics they are genuinely interested in. A lot go for fields that promise good salary with less work effort.I am confident that in the future, upcoming generations will focus more on education, leading to positive changes in India.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "November 11, 2023, 03:58:50 PM",
      "body": "Quote from: cafter on November 11, 2023, 09:57:25 AMQuote from: pakhitheboss on November 11, 2023, 09:42:21 AMsnipMany Indians often don't show much interest in exploring technology due to their mindset. Only a handful of people in India pick courses or study topics they are genuinely interested in. A lot go for fields that promise good salary with less work effort.I am confident that in the future, upcoming generations will focus more on education, leading to positive changes in India.India is the IT hub of this world right now, almost all the technology company is managed by Indians and number of engineers produced by world from India maybe around 10x of what is actually required then how can you say that Indian's don't have the knowledge?As I said cybercells need to recruit the IT professionals and it needs good salary and the problem is they have same criteria for every police training and same salary package if I am not wrong so why someone will work for 20K when they can get 1.5L in a private companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "November 11, 2023, 04:02:15 PM",
      "body": "This is something new. It's good to hear that the government of India is taking certain measures to protect their citizens from crypto related cyber crimes and scams.As many others have said, it should have already been done a long time ago but at least it is being done now.It is also a high time because when the citizens of India have started using crypto so much and the crimes are increasing every year, it's about time that the cyber crime department and police officials cope up with the technology too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 11, 2023, 05:10:27 PM",
      "body": "The number needs to grow in a steady pace because cryptocurrency is only a single part of the entire cybercrime scenario and knowledge and awareness about it among the law enforcement means quick actions from their side. Of course lets not put in the fact that corruption is high among officials, at least they attempt to stop call centers from scamming cancer patients in the West.Eventually the cybercrime punishment machinery needs to become more rigorous and only that can deter the criminals involved in this section. All these things can become reality if the government becomes more lenient about crypto and does not blame it to be the root cause of this type of crime - a biased statement that politicians love to make.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 11, 2023, 05:25:13 PM",
      "body": "if its purpose is to bust Indian scammers in crypto that would be good but you'll have to consider also that these police officials can also hunt down big crypto holders in the end especially when the laws turn against crypto. Indian government is also confusing with regards to the regulation on crypto, sometimes i hear news their government will be banning BTC, but the next day it explains not actually.Narcotics Control Bureau is involved in this and it sounded like there will be a crackdown on users using crypto to buy drugs. did the Indians have their own Silk Road?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "November 12, 2023, 11:07:06 AM",
      "body": "Quote from: electronicash on November 11, 2023, 05:25:13 PMif its purpose is to bust Indian scammers in crypto that would be good but you'll have to consider also that these police officials can also hunt down big crypto holders in the end especially when the laws turn against crypto. Indian government is also confusing with regards to the regulation on crypto, sometimes i hear news their government will be banning BTC, but the next day it explains not actually.Narcotics Control Bureau is involved in this and it sounded like there will be a crackdown on users using crypto to buy drugs. did the Indians have their own Silk Road? Cryptocurrency is already taxed in India, therefore there won't be a ban. Rather now the debate is about the 1 percentage TDS that applies for every transaction. Recently I came across an article on coindesk where it talks how the Indian government has lost $420 million because of TDS. NCB is doing its job but I doubt Indian would have their own Silk Road. But our western neighborhood has something similar in one of its biggest province. Yes, there have been gangs caught within India that have use the darknet and crypto to make drug deal. Unfortunately for them they got busted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}