{
  "id": "topic_5433429",
  "title": "BlackBoss_",
  "author": "BlackBoss_",
  "created_time": "January 08, 2023, 03:19:47 AMLast edit: March 04, 2024, 06:02:56 AM by BlackBoss_",
  "content": "Buying your first bitcoin is amazing and you want to share it, the topic is for it.You accept bitcoin for your business, barber shop, beauty shop, salon shop, whatever business, the topic is for it.You have update for your Bitcoin-accepted business, the topic is for it.You have Bitcoin classes, courses for people, the topic is for it.You receive first salary in bitcoin and are excited to share, the topic is for it.You sell your first bitcoin, the topic is for it.Many topic about first bitcoin purchase, bitcoin-accepted business and I hope they will all come here.Pizza for bitcoins?My first pizza purchase using Bitcoin in lightning networkEDUCATIONUser|Topic|NotATether|Bitcoincleanup.com: a website to stop Greenpeace's bitcoin FUD.|Mr. Magkaisa|I have started teaching Bitcoin to my Neighbors|Mr. Magkaisa|EPISODE 2: I TEACH YOUNG ADULTS ON BITCOIN TRADING|Spaceman1000$|Bitcoin class with my students.|Bushdark|My first sponsored Bitcoin seminar |JamesBorn|Bitcoin Program Done With Students |Merit.s|Teaching teenagers about bitcoin.|tjtonmoy|It's been 2 months and now I am doing well.(I guess).|RockBell|Live Bitcoin radio broadcast with My Local Community as the presenter|Lida93|Arming others with Crypto-knowledge for times of recession.|Agbe|Bitcoin Class in the Church (14TH August, 2022)|Agbe|Bitcoin Class in my Village High School|Agbe|I Have Donated My Campaign BTC to buy Laptop for Practical Classes|Frankolala|Invitation to teach Bitcoin in a school|Frankolala|Invitation to teach Bitcoin in a school 2|re-start|Teaching Bitcoin To My Friends| You're invited too |re-start|Teaching Bitcoin To My Friends| You're invited too (Online class) part 2|fennic|I became Independent Because of Cryptocurrency |Godlovesyou|Introducing bitcoin to local communities/villagers|AirtelBuzz|Young student teaching his classmates about Bitcoin |Cryptoprincess101|Succeeded in introducing Bitcoin to a friend |Sim_card|Introducing bitcoin to the orphans on my birthday|BUY (FIRST) BITCOINUser|Topic|Obari|My First Bitcoin Purchase.|zhangshuo163|This week, I acquired my first Bitcoin, which is a milestone for me.|Mr.suevie|am now a bitcoin investor(first purchase) |SmartGold01|How I decided to buy some fractions of BTC after discussion with members here|Bitcoin_people|Investing in Bitcoin with Tiffin money of my college life.|Nwada001|Helped my neighbor to purchase some Bitcoins |knight22|I just bought my first bitcoins!!|DiMarxist|My First Bitcoin on the New Year Day 2023.|DaNNy001|My First Purchases of Bitcoin|Mr.corol|My first investment for Bitcoin|rachael9385|Am now a bitcoin investor. |Makus|I just purchased my first satoshis|DubemIfedigbo001|My bitcoin journey has started again|AirtelBuzz|Investing in Bitcoins with Masonry Earnings.|Su-asa|Finally I did it (I am happy to join).|Fuso.hp|I bought some ornaments for my mother with investment and signature money.|Bright0515|My first Bitcoin|DiMarxist|Well Prepared For the Bull Market And So Far In Bitcoin Investment.|SELLING SOMETHING TO BUY BITCOIN / BUYING SOMETHING WITH BITCOINUser|Topic|Fivestar4everMVP|Finally, I Bought Something With Full Payment In Bitcoin.|Fuso.hp|Life's first investment in Bitcoin by selling bicycles|LDL|Invest in Bitcoin by selling wife's jewelry|uche6215|A word of motivation|Litzki1990|Dream of buying a bike with Bitcoin came true thanks to Bitcoin and my parents|Kaliandra|I sell motorbikes to buy bitcoins|paid2|Guys!! I was finally able to buy my home thanks to Bitcoin!!!|Victorybit1|Evidence that I actually invested for my baby|Victorybit1|Early bitcoin investment for my baby|uche6215|A word of inspiration and hint.|SmartGold01|Bold steps leads to another bitcoin achievement (New phone launched)|Essential10|I want to fulfill my mother's dream of building a house with Bitcoin.|cryptoWODL|Wedding expenses and party celebrations with Bitcoin money.|SELLING (FIRST) BITCOINUser|Topic|NicNacCoin|Bitcoin in times of danger|Bitcoin_people|Bitcoin support for various essential tasks.|RECEIVE (FIRST) SALARY IN BITCOINUser|Topic|Cynthia_sinach042|Finally got my boss to pay me in Bitcoin|Nwada001|First Bitcoin earning (Signature)|Maxre|I have bought my Dream Mobile Phone Because of Signature Compaign earnings|SmartGold01|How do you feel on your first payment?|wd1|I recently convinced my employer to start paying me in BTC, it has been great|SUCCESSFUL HODLINGUser|Topic|AVE5|My rewards for hodling despites the challenges.|BUSINESSUser|Topic|sokani|The bolt driver experience: promoting bitcoin in my business|Nwada001|Physical Bitcoin Shop in Port Harcourt (Nigeria)|SatoPrincess|Giving customized Bitcoin-themed Gifts to my clients |SatoPrincess|I now accept bitcoin payments in my Beauty shop|Dr.Bitcoin_Strange|One Month of Accepting Bitcoin for Payment|Merit.s|Advantage of accepting bitcoin in business|tjtonmoy|I started business many days ago. Now it's time to accept Crypto as a payment.|wnet|I started accepting Bitcoin at my store in September 2021, here's an update.|Rockson1|Bitcoin as means of exchange in happy day supermarket|Dr.Bitcoin_Strange|(Bitcoin payment success) 3-month statistics|Onyeeze|Gas station payment with bitcoin. |CHARITYUser|Topic|Obari|[CHARITY] Improving lives through Bitcoin - Bitcoin gathering in church|virasisog|Bitcoin Opportunities as a gateway to Community service|Frankolala|Prize day (Awards to students)|CryptoHeadlineNews|Touching the life of random poor kids with all my 3wks campaign BTC|CryptoHeadlineNews|How I was able to donate Books to school pupils with my little Campaign Bitcoin |GIFTsUser|Topic|Wakate|What if she receives Bitcoin as gift|uche6215|Bitcoin as gift|Z390|I want to surprise a friend |Edcrypto91|Giving out to promote Bitcoin |Vaskiy|Small Birthday Gift - Bitcoin|EluguHcman|Effects of introverts against successful investment|Bd officer|Bitcoin gift to wife.|USING BITCOIN ATMUser|Topic|Nwada001|Bitcoin ATM Deposit Exchange Rate shocks|OGsmall|My first time utilizing the Bitcoin ATM|MEETINGUser|Topic|lizarder|BITCOIN ADOPTION THROUGH SOCIAL VALUE, THANKS SATOSHI (SN) and Duelbits(Hhampuz)|",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433429",
  "comments": [
    {
      "author": "_act_",
      "created_time": "January 08, 2023, 08:25:16 AMLast edit: January 08, 2023, 09:26:30 AM by _act_",
      "body": "What I just know is that some of those topics could be lies, we should have a way to verify that what the OPs are saying is true. It may not be lies but we should have evidence that it is true.You created a thread about your 2022 work and you locked it: BlackBoss_ Works. What if other people too started to create their 2022 topics, is it going to be fine?If you do not want things like that, why are you not following yourself as an example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "January 08, 2023, 11:36:24 AM",
      "body": "All post seems identical you show something to relate it to bitcoin then post. And some write a note then tell it was for bitcoin education.Maybe this is their way to get some merit and many got baited. I do hope all of those thread are legitimate not done only for one day just to have topic to post and get  merit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "January 08, 2023, 12:06:41 PM",
      "body": "Quote from: BlackBoss_ on January 08, 2023, 03:19:47 AMBitcoin Class in the Church (14TH August, 2022)Bitcoin Class in my Village High SchoolI Have Donated My Campaign BTC to buy Laptop for Practical ClassesDo you have something against Agbe? I see you listed his thread multiple times here that had nothing to do with the subject of the topic, why is that?. Beside if there was to be a thread for this purpose it shouldn't be in the reputation section as it has nothing to do with this board. Maybe off topic or Bitcoin discussion as it is initially there without getting moved or deleted by moderators. Also I think this are all different topic and make no sense to put them all in one thread, it'll just congest the whole thread and it'll be hard for people to pass information or give correction to the OP when necessary especially those that had to do with teaching of Bitcoin to others. While this whole practice only give me one idea (merit hurting) it seems they succeeded as I see lots of merits on their thread and maybe that's what is driving up the interest in this type of threads on the Bitcoin discussion board. You know people love seeing positive things towards the adoption of Bitcoin no matter how small. We can only hope they're all legitimate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "January 08, 2023, 01:27:35 PM",
      "body": "Quote from: BlackBoss_ on January 08, 2023, 03:19:47 AMMany topic .......I am very smart! I collect links everywhere!Do you honestly believe that someone will look through your directory to see how and who received their first bitcoin or uses it as a payment method?IMHO, but I'm interested in reading this at a time when it's relevant. Someone opened their own salon, someone teaches the basics of bitcoin in the church, and someone else added bonuses for going to the salon. It's all interesting once, so I don't think it needs to be cataloged. Unless someone does not understand, how are such subjects created? Let people grow, at least even using fantasy; they should do something on their own and not rewrite others' links, implying orderliness on the forum. The same fishing merits. Just don't interfere with each other.Quote from: _act_ on January 08, 2023, 08:25:16 AMYou created a thread about your 2022 work and you locked it: BlackBoss_ Works. What if other people too started to create their 2022 topics, is it going to be fine?If you do not want things like that, why are you not following yourself as an example. I agree with you, @_act_, that all these \"helpful\" links look very fake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "January 08, 2023, 06:44:58 PM",
      "body": "OP how’s this a problem? Twelve topics in one year is a small number in my opinion. As long as they are not asking for money or trying to scam I think it’s fine. Some of the topics you referenced gave me the momentum to add bitcoin payments in my business. I don’t think they should be in your thread. It’s not the same as “a new rank thread”, I think your so called educational memes is worthless than any of the topics you referenced in OP. So much for keeping the forum clean. Word of advice, focus on yourself and you will grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 08, 2023, 07:20:59 PM",
      "body": "We can all agree that most of these threads are for merit fishing but do know why merits are still been spread on them by mostly experienced members? It’s simply because of the effort put into it. If we are to come to conclusion that all are for merit fishing then me might miss the opportunity of appreciating genuine or legitimate ones. So without evidence we shouldn’t point fingers towards anyone. As for people who disguise for just merit i will just advise them to have a chill there are other means to get it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "January 08, 2023, 08:08:49 PM",
      "body": "Quote from: _act_ on January 08, 2023, 08:25:16 AMWhat I just know is that some of those topics could be lies, we should have a way to verify that what the OPs are saying is true. It may not be lies but we should have evidence that it is true.On this, I would agree!It's a bitcoin forum and threads like that just fits hence, it tends to find the soft spot to the many that wants crypto to be the new order. Certainly we all want to but, these seems like the new means to fish for them 'm'. I just don't want to mention it as its just been said one-two many times.I do hope they are getting patronage though and actually balancing up there crypto and fiat accounts. Keeping track of them profit and lose, expense on fees, stationeries and other petty stuff.Having them all them threads here don't seem like a bad idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DiMarxist",
      "created_time": "January 08, 2023, 10:22:15 PM",
      "body": "Everyone has his or her own opinion on issuesMr man (BlackBoss_), I am making this comment here because my post is also mentioned in your list to be inserted in your so call thread. In these days I have been on tour to navigate the forum to read more. So I have been readind threads. I have also seen your comments and threads. One thing I discovered from your writing is that you are not here to know more on bitcoin but to make eye service...you want people to notice your present at all time, you have not made any educative phrase.. And you are making mistakes that can be avoided if really your are reading and making research before postingDid you read this before asking fillippone to review your post?Quote from: fillippone on September 06, 2022, 10:22:55 PMEach user can submit 5 posts at maximum per entry. Quote from: BlackBoss_ on December 16, 2022, 05:37:54 PMRound 1CBBI index can help to find bottom range for DCACategory: Sharing toolBoard: Bitcoin DiscussionWebsites to check token unlock scheduleCategory: Sharing websitesBoard: Beginners & HelpCheck honeypot scam tokensCategory: Sharing guides to avoid scam by phishing tokensBoard: Altcoin DiscussionRe: BTC will always prevail Category: OpinionBoard: Beginners & Helptheymos! Please use the forum account on Twitter to tweetCategory: Forum discussionBoard: MetaOfficial Bitcointalk forum accountsCategory: Forum discussionBoard: MetaRe: Where can I find my user, server, message ID?Category: Help to get Discord User IDBoard: ServiceTruflation - Get inflation rates (daily updated, real time, independent)Category: Data on Inflation ratesBoard: Beginners & HelpWhat is Bitcoin Core and Escrow?Category: Discussion about EscrowBoard: Beginners & HelpRe: Why you should be very careful with altsCategory: Discussion about risk of altcoinsBoard: Altcoin discussionDon't buy altcoins because they are top altcoinsCategory:Board: Beginners & HelpCase Bitcoin (useful)Category: EducationalBoard: Bitcoin DiscussionAlso even this your thread  Announce your first Bitcoin purchase, Bitcoin acceptance for your business here is a copycat in which you  paraphrase the topic from Announce your rank up, merit or any achievements that makes you feel great!.If those Threads you mentioned (listed) are to be inserted in any thread, it is this 👇 and not yours Announce your rank up, merit or any achievements that makes you feel great! and not in this  Announce your first Bitcoin purchase, Bitcoin acceptance for your business here. I will advise you to lock and archive this thread because there an already existing thread on your idea, if really you were reading, you wouldn't create this thread, but you deliberately ignore the search button to copycat (double) create threads for attention. Please build your house well before outside. Even your topic is contradicting your content. OP your topic or subject has nothing to do with your content.Archive this thread because it is a paraphrasing of BitcoinGirl.Club thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitDane",
      "created_time": "January 08, 2023, 10:34:11 PM",
      "body": "Quote from: CryptopreneurBrainboss on January 08, 2023, 12:06:41 PMQuote from: BlackBoss_ on January 08, 2023, 03:19:47 AMBitcoin Class in the Church (14TH August, 2022)Bitcoin Class in my Village High SchoolI Have Donated My Campaign BTC to buy Laptop for Practical ClassesDo you have something against Agbe? I see you listed his thread multiple times here that had nothing to do with the subject of the topic, why is that?. Beside if there was to be a thread for this purpose it shouldn't be in the reputation section as it has nothing to do with this board. Maybe off topic or Bitcoin discussion as it is initially there without getting moved or deleted by moderators. Also I think this are all different topic and make no sense to put them all in one thread, it'll just congest the whole thread and it'll be hard for people to pass information or give correction to the OP when necessary especially those that had to do with teaching of Bitcoin to others. I think @OP can make 3 different threads on his stated topics.1. Entrepreneur/Business adoption2. Bitcoin education3. Bitcoin transactionsThese I think are the major categories of topic  list stated by @OP so that the thread won't be saturated and readers will be able to see progress of each category.Quote from: CryptopreneurBrainboss on January 08, 2023, 12:06:41 PMWhile this whole practice only give me one idea (merit hurting) it seems they succeeded as I see lots of merits on their thread and maybe that's what is driving up the interest in this type of threads on the Bitcoin discussion board. You know people love seeing positive things towards the adoption of Bitcoin no matter how small. We can only hope they're all legitimate. Well, there is no other way to earn merit but to post so every post is subject to merit hunting    But honestly I do not mind giving merit when it is due even if the purpose of creating the thread is to farm merit (which I think is likely the case).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "January 09, 2023, 03:49:53 AM",
      "body": "Quote from: Zaguru12 on January 08, 2023, 07:20:59 PMWe can all agree that most of these threads are for merit fishing but do know why merits are still been spread on them by mostly experienced members? It’s simply because of the effort put into it. If we are to come to conclusion that all are for merit fishing then me might miss the opportunity of appreciating genuine or legitimate ones. So without evidence we shouldn’t point fingers towards anyone. As for people who disguise for just merit i will just advise them to have a chill there are other means to get it.Ascertaining the intentions of the OPs of these threads might be difficult because none of them would ever accept that their sole aim is to get merit. I cannot also conclude because they would give you many genuine reasons why they started the thread. But one striking benefit I have seen from this thread is that they offer some basic guidelines or lessons about Bitcoin. Most times the OP of some of these threads seek advice from the community about a better way of using Bitcoin personally and in their business, while others on how to teach or create Bitcoin awareness better in their area. And we have seen some members giving uncommon Ideas that have even helped me personally.My humble advice is that if you suspect that any thread is for merit hunting or fishing, don't give any merit. If these merit fishers realize that their baits are getting nothing, they would stop. We shouldn't discourage people with genuine intentions from sharing their stories and getting relevant advice or information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 09, 2023, 08:28:51 PM",
      "body": "You have done a very good job collecting those links and threads. But you have made your own board here for people to come and post their threads but don't we already have boards for posting these activities? I don't have the energy to check all the threads you have listed here but I have opened the first five links to check the details. Two of these five threads are from 2023, and the pizza one from legendary laszo is from 2010, one is from 2012 and one is from 2022. My point is why you have to choose threads and create another topic with all this randomly. While we can see them on the board already. I can tell, you have an obsession with creating lists mate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "January 09, 2023, 09:02:05 PM",
      "body": "Quote from: BitDane on January 08, 2023, 10:34:11 PMWell, there is no other way to earn merit but to post so every post is subject to merit hunting    But honestly I do not mind giving merit when it is due even if the purpose of creating the thread is to farm merit (which I think is likely the case).They just need to post and post whatever the purpose is, it doesn't matter as long as it doesn't break the rules. My consideration is that every user has the right to speak, but if it is an attempt to get merit or fishing for merit then of course it will be difficult for other users to get it. Making it up or really low effort might come across easily, so it's okay if they don't get support.I just try to stay positive in any effort they have, sometimes it's true but they can't convey it well because of the limitations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "January 10, 2023, 09:26:56 PM",
      "body": "You can visit my posts here1. Re: I started business many days ago. Now it's time to accept Crypto as a payment.2. Re: It's been 2 months and now I am doing well.(I guess).I have included every details on these posts, and you can go and check them out. Business is going well, but the crypto payments are very less now. Almost to zero. So I will update the forum after some time of observation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "January 10, 2023, 09:39:29 PM",
      "body": "Quote from: _act_ on January 08, 2023, 08:25:16 AMWhat I just know is that some of those topics could be lies, we should have a way to verify that what the OPs are saying is true. It may not be lies but we should have evidence that it is true.You created a thread about your 2022 work and you locked it: BlackBoss_ Works. What if other people too started to create their 2022 topics, is it going to be fine?If you do not want things like that, why are you not following yourself as an example. I don't mean to doubt, but I really agree with what you said because with the many threads included by the OP, I actually don't really believe in some of the stories that are shared, especially since the patterns that are actually carried out are almost the same and in the same area, so I doubt this, even though this is true just my personal.But as long as someone does prove that it's true I don't think that's too much of a problem with that and think they're cool for daring to innovate further with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "February 19, 2023, 11:29:54 PM",
      "body": "Quote from: Raflesia on January 10, 2023, 09:39:29 PMI don't mean to doubt, but I really agree with what you said because with the many threads included by the OP, I actually don't really believe in some of the stories that are shared, especially since the patterns that are actually carried out are almost the same and in the same area, so I doubt this, even though this is true just my personal.But as long as someone does prove that it's true I don't think that's too much of a problem with that and think they're cool for daring to innovate further with bitcoin.I don't have reasons to believe or disbelieve in those threads. It can be patterns to find merit or it is a pattern to help Bitcoin education and adoption. Only posters who created those threads can know what they do.I believe many people did educational classes and meetings about Bitcoin in their communities or bought, sold their first bitcoin but they did not share their stories. They have reasons to not share it and they have reasons to share it too.January to February, I got some more topics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "February 24, 2023, 11:52:42 PM",
      "body": "Topic is reorganized and I really hope that people will bring their announcements here.They can announce their first buying, first selling, first salary in BTC, educational class/ seminar/ short meeting / podcast, first buying something with BTC, first selling something to buy BTC, business accepted BTC, first BTC received from customer for their business, charity, help someone to buy, sell, trade first BTC ...Announce your rank up, merit or any achievements that makes you feel great! is for ranking up announcements and people joined it happily.This topic is for BTC adoption worldwide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "March 03, 2023, 01:15:59 AM",
      "body": "I am shocked when I see this Invest in Bitcoin by selling wife's jewelryI hope none of you have same plan to do this. It can destroy your life especially if you don't have a consensus of your lover (wife or husband) before you sell his or her jewelries or precious assets.I would like to work and use my salary to invest in something that can be anything I feel good with potential to help me gaining profit. It can be Bitcoin, real estate, stock but I want to pick a safer plan.The Bitcoin family say they lost $1M in value this year. It's hard to reach a consensus between wife and husband and more important that consensus can affect your children too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "August 04, 2023, 04:25:10 AM",
      "body": "Another successful story from a woman who is successfully ranked up with ranks to Senior member and got income from signature campaign to support her family and bought a new phone. Congratulate!Bold steps leads to another bitcoin achievement (New phone launched)A new phone can help her to type her posts better and it can be used as one of device to store his bitcoin with Electrum wallet or as a co-signer for her wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "September 13, 2023, 04:22:23 PM",
      "body": "Quote from: BlackBoss_ on August 04, 2023, 04:25:10 AMAnother successful story from a woman who is successfully ranked up with ranks to Senior member and got income from signature campaign to support her family and bought a new phone. Congratulate!Bold steps leads to another bitcoin achievement (New phone launched)A new phone can help her to type her posts better and it can be used as one of device to store his bitcoin with Electrum wallet or as a co-signer for her wallet.Op I am excited to see that you have already update my post in your thread, thanks.I want to also add that i just ranked up to the member rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}