{
  "id": "topic_5399834",
  "title": "dumbo65",
  "author": "dumbo65",
  "created_time": "May 23, 2022, 12:28:46 PM",
  "content": "Hello,I want to create a company to make individuals invest in cryptos. Is the following scheme possible ?:- people send money in a company account - this money is collectively used to buy a cryptocurrency on an exchange platform- the company keeps the register of the holdings of each user. There is therefore no wallet (address) per user.If possible, does this mean that the company is a cryptocurrency custodian on behalf of its customers?Is there a better scheme?If anyone can help me understand the best pattern before I get started! In advance thank you for enlightening a neophyte",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399834",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "May 23, 2022, 01:35:08 PM",
      "body": "Quote from: dumbo65 on May 23, 2022, 12:28:46 PM- people send money in a company account - this money is collectively used to buy a cryptocurrency on an exchange platform- the company keeps the register of the holdings of each user. There is therefore no wallet (address) per user.You basically want to create a Bitcoin trust fund. A trust fund could serve any asset and the company holds the said asset on behalf of investors, which would be an individual or cooperation; Grayscale is an example of a Bitcoin trust.Quote from: dumbo65 on May 23, 2022, 12:28:46 PMIf possible, does this mean that the company is a cryptocurrency custodian on behalf of its customers?Is there a better scheme?Yes, that's what it basically means.Yes, there's a better way and that would be the investors actually buying directly and storing in their non-custodian wallet. Some institutional investors could have legal issues buying directly and this is where trust funds serve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "May 23, 2022, 02:26:15 PM",
      "body": "As explained in the previous post what you've requested is similar to the service that is being offered by Grayscale. It was into digital currency related services since 2013. This adds more trust over the platform. So, people invest over the bitcoin trust fund even when the funds weren't into the individual wallets. You can't expect the same to happen with the start of the service. To gain trust is important and an individual to do such a big task is really tedious. For now OP can start with small number of people, which can be 10-20 members. Here itself can understand whether people will invest or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dumbo65",
      "created_time": "May 23, 2022, 02:34:10 PM",
      "body": "OK. Cool. thks for your reply. Is there another way than creating a trust ? What about services that provide an app to invest in crypto. Does it means that such a service needs a wallet per user ? They never combine tiny user orders in one large ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 23, 2022, 03:32:57 PM",
      "body": "Quote from: dumbo65 on May 23, 2022, 02:34:10 PMOK. Cool. thks for your reply. Is there another way than creating a trust ?An ETF does basically the same.These kind of funds are highly regulated and there are a lot of paper work related to them.QuoteWhat about services that provide an app to invest in crypto. Does it means that such a service needs a wallet per user ? They never combine tiny user orders in one large ?You can create an APP which has some kind of partnership to crypto x crypto swap services (there are a lot of them, changelly, shapeshift, etc etc). There are even some wallets which have these services integrated.If you want to accept payments in your local fiat currency, things get more complicated as you need to comply with your local legislations.You would need a partnership with a local exchange that would allow you to convert fiat / crypto for your clients and transfer to their wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 23, 2022, 05:33:55 PM",
      "body": "If you will do this without getting proper permit, you might face serious legal trouble, depending on your country's laws. Also, consult your local lawyers, no one here can fully answer your question, because each country's laws and regulations are different.I doubt that a Bitcoin trust fund can be realistically established as a small company, usually you need many millions of starting capital for such type of company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "May 23, 2022, 05:51:35 PM",
      "body": "Quote from: bitmover on May 23, 2022, 03:32:57 PMQuote from: dumbo65 on May 23, 2022, 02:34:10 PMOK. Cool. thks for your reply. Is there another way than creating a trust ?An ETF does basically the same.These kind of funds are highly regulated and there are a lot of paper work related to them.QuoteWhat about services that provide an app to invest in crypto. Does it means that such a service needs a wallet per user ? They never combine tiny user orders in one large ?You can create an APP which has some kind of partnership to crypto x crypto swap services (there are a lot of them, changelly, shapeshift, etc etc). There are even some wallets which have these services integrated.If you want to accept payments in your local fiat currency, things get more complicated as you need to comply with your local legislations.You would need a partnership with a local exchange that would allow you to convert fiat / crypto for your clients and transfer to their wallets.In this case, the service that you may want to offer with your clients need to be legally registered under your jurisdiction.Because if you will accept your local fiat, definitely, you would need to comply with your local laws.Otherwise, you will be running like in the black market. And I don't think people will trust their hard-earned savings in your platform.An app alone won't attract interest if they know the services are not tied to legal authorities.Because it is easy to abandon the app and get all those funds if the team decided to exit this market.People need assurance these days, otherwise, they can just do their own trading using reputable exchanges, even utilizing other financial services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "May 23, 2022, 06:42:00 PM",
      "body": "Quote from: dumbo65 on May 23, 2022, 12:28:46 PMHello,I want to create a company to make individuals invest in cryptos. Is the following scheme possible ?:- people send money in a company account - this money is collectively used to buy a cryptocurrency on an exchange platform- the company keeps the register of the holdings of each user. There is therefore no wallet (address) per user.If possible, does this mean that the company is a cryptocurrency custodian on behalf of its customers?Is there a better scheme?If anyone can help me understand the best pattern before I get started! In advance thank you for enlightening a neophyte Honestly if you are asking these questions you should not be considering launching such a service within the next 5 years and there are already other platforms out there which are dominating this market. Everyone should seek to learn and embrace new knowledge, but it feels like you are so naive on this topic that it will be extremely dangerous for you to be anywhere near the custodian of someones money in the cryptocurrency field. You will need a lot of money and be able to find programmers who are of sufficient quality to produce such a system, without even going into the details of how you would possibly attract new customers. Basically you will need to outsource all the stuff or pay vast amounts to make this a worthwhile endeavor for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 26, 2022, 04:28:45 PM",
      "body": "It can technically work, but what's the point of using your service if your users can use other existing full-fledged platforms such as Binance? Building such a platform will be so easier than building an exchange from scratch, but doing it that way is going to limit you platform so so much due to lack of features.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "May 28, 2022, 03:03:06 AM",
      "body": "Quote from: dumbo65 on May 23, 2022, 02:34:10 PM-snip-Is there another way than creating a trust ? Trust is the thing that is offered in the first place, it cannot be ignored. You must offer two trusts at once here, that your service is legit and manageable.Just my thought, to gain first trust you should at least have a history of this kind of service and a legal license for sure. And achieve second trust by having a good investment portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 28, 2022, 09:11:19 AM",
      "body": "If your question is related to a company, meaning that you mean a normal company that wants to invest people's money, it will need a lot of trust, which is difficult to gain for the following reasons: - Investing in Bitcoin is not difficult, you can buy from any platform and keep it. - Most altcoins are difficult to predict, and it is impossible to guarantee profits to users. - Most countries have a lot of laws regarding such investments and therefore the company may not be registered. - As a simple company and in the short term this idea will not work. That's why rich people and institutional investors turn to something more trusted like trust fund or ETFs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "May 29, 2022, 01:40:57 AM",
      "body": "Although this isn't my cup of tea, this might benefit certain people, especially those who would want to have a stake in the market yet wouldn't go through all the hassles and issues, legal or otherwise. However, and considering your admission that you are a neophyte in the space, this is a lot harder to accomplish in reality. For one, registering both a cryptocurrency and investment company is certainly not an easy thing to do wherever you are from. After succeeding through this stage, you still have to prove that people could trust their hard-earned money on your platform. This entails a convincing approach to more or less promise them of ROI and a guarantee that security is paramount and that their funds are safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 29, 2022, 05:36:37 AM",
      "body": "Quote from: Darker45 on May 29, 2022, 01:40:57 AMAlthough this isn't my cup of tea, this might benefit certain people, especially those who would want to have a stake in the market yet wouldn't go through all the hassles and issues, legal or otherwise. Not sure why so much people are against it, but this is precisely why we somewhat need a Bitcoin spot ETF. The technologically-illiterate boomers need some love too!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}