{
  "id": "topic_5461913",
  "title": "aoluain",
  "author": "aoluain",
  "created_time": "August 03, 2023, 07:02:34 AM",
  "content": "Hi All, I thought I would share this artist infoBitcoin Apex Art - Daniel Kränkel - https://www.bitcoinapexart.com/I won one of his prints in the Auction for Coldkey Victims run by smoothie and over the weekI have been sorting, cataloging and filing my modest collection of Bitcoin collectibles.After doing a search for this print which I knew was Bitcoin Apex a new world has opened upto me about this skilled artist woking in pencil. Some works are like something I would expectto see in some 16th century cathedrals. There are a lot of details and the look almost likemarble and stone sculptures, I am very impressed with the skill involved and with the themes.I cannot opy any of the images from th website but below is a screenshot of the first page of the gallery.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461913",
  "comments": [
    {
      "author": "Kryptowerk",
      "created_time": "August 03, 2023, 12:17:57 PM",
      "body": "Cool stuff, thanks for the info, aoluain.Pretty incredible skill to draw like that.I see normal prints and limited art prints - wonder if the original drawings are ever sold? Would be awesome to have an original.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Humble Bitcoiners",
      "created_time": "August 03, 2023, 12:33:02 PM",
      "body": "Bitcoin Apex's drawings are just incredible. Bought several of his 21 Edition high quality prints.Can share 4 of them with forum members. All of them in #2 with COA. Price is 0.01 Btc a piece shipped worldwide😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tldr-hodl",
      "created_time": "August 03, 2023, 01:49:09 PM",
      "body": "I know about these:https://plebeian.market/stall/bitcoin__apex#pastQuote from: Kryptowerk on August 03, 2023, 12:17:57 PMCool stuff, thanks for the info, aoluain.Pretty incredible skill to draw like that.I see normal prints and limited art prints - wonder if the original drawings are ever sold? Would be awesome to have an original.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JanEmil",
      "created_time": "August 03, 2023, 02:52:01 PM",
      "body": "Looks fantastic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}