{
  "id": "topic_5406463",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "July 15, 2022, 10:50:07 PM",
  "content": "Eu não sei o que ta rolando, mas recentemente eu ando recebendo VÁRIAS tentativas do mesmo golpe no Twitter. A pessoa diz que é uma estudante e que não sabe como vender o USDT dela e compartilha a chave privada. O valor varia, o usuário varia, mas a chave-privada é a mesma e todos compartilham o mesmo ''address encoding'' que é clicável. Imagino que o golpe esteja em clicar no link, o que eu não cliquei e não sei o que rola. Mas fiquei curiosa com esse golpe, existe algum risco em tentar exportar essa wallet, por exemplo?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406463",
  "comments": [
    {
      "author": "alegotardo",
      "created_time": "July 16, 2022, 01:10:54 AM",
      "body": "Quote from: Disruptivas on July 15, 2022, 10:50:07 PMImagino que o golpe esteja em clicar no link, o que eu não cliquei e não sei o que rola. Não me dei ao trabalho de pesquisar, mas provavelmente essa wallet aí esteja vazia, principalmente se é re-utilizada para todas as tentativas do golpe.Me parece que o fato de expor a chave privada seja apenas mais um chamariz para que a pessoa clique no link e lá todo tipo de golpe deve ser possível, desde o mais simples: roubo de informações pessoais, uma engenharia social para conseguir a chave privada de uma wallet sua ou até mesmo o download de um programa malicioso (vírus).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 16, 2022, 08:40:22 AM",
      "body": "Quote from: Disruptivas on July 15, 2022, 10:50:07 PMImagino que o golpe esteja em clicar no link, o que eu não cliquei e não sei o que rola. Se você clicar no link o mais provável é abrir o telefone.Esse link é gerado automaticamente pelo sistema, visto que é uma sequencia de números que parece um contacto telefónico.Qualquer das formas não vale a pena clicar.Esse deve ser um tipo de fraude de nível social. Você não consegue fazer nada com essa informação, então responde a dizer isso, e nesse momento começa o esquema talvez pedido ajuda para fazer uma compra, etc etc etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 16, 2022, 09:46:32 AM",
      "body": "Como o joker falou, esse link é gerado pela própria plataforma (Twitter) que detecta uma parte do string como um número de telefone. Mesma coisa que acontece quando você manda um número via SMS ou WhatsApp (pelo menos no iOS).O golpe é o seguinte:1. O scammer manda DMs em massa para todo mundo, pedindo ajuda para transferir os seus USDTs.2. Você recebe essa mensagem, restaura a seed em uma carteira, e vê que ele realmente tem 580 USDT lá.3. Você se acha o esperto e tenta roubar os USDTs.4. \"Oh! Não tem TRX/ETH (depende da chain) suficiente para pagar a taxa... vou comprar um pouco e rapar esses tethers de lá\"5. Você compra uns $10 de TRX/ETH e envia para o endereço.6. O scammer usa um bot para detectar os $10 e os envia para OUTRO endereço, que só ele controla, antes que você possa fazer qualquer coisa.Você claramente não consegue rapar os 580 USDT e ainda perdeu o TRX/ETH que mandou com o intuito de scammar o rapaz.Olha o endereço desse cidadão ai: https://tronscan.org/#/address/TUtxJyrAVH9yZ9gYBAy8wHasByuQRtX5mzEle tem $961 USDT e um padrão de transações que é o seguinte:1. Recebe X TRX.2. Poucos segundos depois, envia esse mesmo X TRX para outro endereço.Ou seja... está dando resultado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 16, 2022, 12:44:29 PM",
      "body": "Quote from: TryNinja on July 16, 2022, 09:46:32 AMO golpe é o seguinte:...Ou seja... está dando resultado.Cara, que engenhoso, eu não tinha pensado nessa possibilidadeSó me passou na cabeça também o roubo de informações devido a pessoa clicar no link, levar a alguma página maliciosa e fazer a pessoa executar algum script, algo do tipoO cara basicamente joga uma isca e quem se achar o espertinho vai se dar mal  E também fora a \"ingenuidade\" do possível espertinho de achar que realmente alguém que não conhece e nunca viu na vida vai entrar em contato para ajudar com um resgate numa carteira de criptos  Ainda mais em USDT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 16, 2022, 08:39:56 PM",
      "body": "É o famoso golpe do \"bilhete premiado ou também chamado golpe do paco\" agora de forma digital. Os estelionatários também entraram na era da informática.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "July 16, 2022, 09:52:15 PM",
      "body": "Quote from: TryNinja on July 16, 2022, 09:46:32 AMVocê claramente não consegue rapar os 580 USDT e ainda perdeu o TRX/ETH que mandou com o intuito de scammar o rapaz.Eu tinha CERTEZA ABSOLUTA que envolvia algum tipo de golpe, mas eu não tinha ideia do que era. Eu estava desconfiada que não era nada relacionado a engenharia social porque são vários perfils diferentes, então a pessoal precisaria ter um exército a disposição pra 'conversar' com todo mundo. Então não fazia sentido pra mim. Faz bastante sentido essa sua explicação. Tu já tinha lido sobre esse golpe ou descobriu olhando o padrão das transações do endereço?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 17, 2022, 11:24:07 AM",
      "body": "Quote from: Disruptivas on July 16, 2022, 09:52:15 PMFaz bastante sentido essa sua explicação. Tu já tinha lido sobre esse golpe ou descobriu olhando o padrão das transações do endereço?Já conhecia o golpe e fui olhar o padrão das transações para confirmar. Também já vi um caso onde o user teve a sua carteira hackeada, tinha uns tokens de DeFi sendo destravados aos poucos, e ele ficava lutando com o hacker para ver quem transferia os tokens... um mandava o ETH para as taxas, o outro rapava, depois tentavam ficar com os tokens, etc... então já estava com essa ideia na cabeça.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 17, 2022, 10:33:38 PM",
      "body": "Quote from: TryNinja on July 17, 2022, 11:24:07 AMJá conhecia o golpe e fui olhar o padrão das transações para confirmar. Também já vi um caso onde o user teve a sua carteira hackeada, tinha uns tokens de DeFi sendo destravados aos poucos, e ele ficava lutando com o hacker para ver quem transferia os tokens... um mandava o ETH para as taxas, o outro rapava, depois tentavam ficar com os tokens, etc... então já estava com essa ideia na cabeça. Mas o bot faz isso automaticamente, a transferência do valor? Ou o bot só dá o alerta, e depois o hacker faz a transferência?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 18, 2022, 06:07:10 PM",
      "body": "Quote from: joker_josue on July 17, 2022, 10:33:38 PMQuote from: TryNinja on July 17, 2022, 11:24:07 AMJá conhecia o golpe e fui olhar o padrão das transações para confirmar. Também já vi um caso onde o user teve a sua carteira hackeada, tinha uns tokens de DeFi sendo destravados aos poucos, e ele ficava lutando com o hacker para ver quem transferia os tokens... um mandava o ETH para as taxas, o outro rapava, depois tentavam ficar com os tokens, etc... então já estava com essa ideia na cabeça. Mas o bot faz isso automaticamente, a transferência do valor? Ou o bot só dá o alerta, e depois o hacker faz a transferência?Como é muito rápido, tudo indica que o bot faz a transferência automaticamente. Isso não é díficil de fazer.No final, é um golpe que rouba outros ladrões kkk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "July 18, 2022, 06:15:02 PMLast edit: July 20, 2022, 05:01:42 AM by TryNinja",
      "body": "Quote from: joker_josue on July 17, 2022, 10:33:38 PMMas o bot faz isso automaticamente, a transferência do valor? Ou o bot só dá o alerta, e depois o hacker faz a transferência?Por que eles iriam fazer tudo isso só para ter que fazer a transferência de forma manual no final das contas? Claro que é automatico.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 18, 2022, 08:13:29 PM",
      "body": "Quote from: TryNinja on July 18, 2022, 06:15:02 PMPor quê eles iriam fazer tudo isso só para ter que fazer a transferência de forma manual no final das contas? Claro que é automatico.Só perguntei, porque a outra pessoa que tem acesso também ao endereço, pode também ela criar um bot para fazer isso.Ou estou enganado?Peço desculpa, porque estou um pouco desfaçado com esses automatismos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 18, 2022, 08:27:57 PM",
      "body": "Quote from: joker_josue on July 18, 2022, 08:13:29 PMSó perguntei, porque a outra pessoa que tem acesso também ao endereço, pode também ela criar um bot para fazer isso.Ou estou enganado?Voce faz um bot para fazer transações dos seus endereços, ou voce simplesmente abre sua carteira e transfere?O que voce está sugerindo é justamente isso. Que você faça um bot para fazer transações pra voce, em vez de fazê-las voce mesmo.O que esse golpista tem é um motivo para um bot fazer as transaçoes pra ele: ele precisa ser muito rapido, pois assim que os fundos chegarem ele precisa tirar o dinheiro de lá.Uma pessoa normal que achou uma chave privada com fundos vai simplesmente gastar os fundos, nao vai fazer um bot pra isso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 19, 2022, 12:37:10 AM",
      "body": "Quote from: bitmover on July 18, 2022, 08:27:57 PMUma pessoa normal que achou uma chave privada com fundos vai simplesmente gastar os fundos, nao vai fazer um bot pra isso.Mas pode fazer... será um ladrão a roubar outro ladrão no seu próprio esquema.  Agora, claro que a probabilidade de isso acontecer é muito baixa. E se acontecer o \"primeiro ladrão\" já roubou mais do que irá eventualmente perder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "July 20, 2022, 06:56:23 PM",
      "body": "curiosamente a primeira vez que ouvi falar desse bot já fazem alguns anos, mas realmente voltou com força agorame faz pensar se os golpistas não estão fazendo os mesmos golpes repetidamente, só com uma roupagem novao \"envie um e receba dez de volta\" e os golpes de engenharia social com gatilhos emocionais + urgência + autoridade já acontecem desde a Babilônia antiga hahhah",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 21, 2022, 12:42:48 AM",
      "body": "Quote from: TryNinja on July 17, 2022, 11:24:07 AMJá conhecia o golpe e fui olhar o padrão das transações para confirmar. Também já vi um caso onde o user teve a sua carteira hackeada, tinha uns tokens de DeFi sendo destravados aos poucos, e ele ficava lutando com o hacker para ver quem transferia os tokens... um mandava o ETH para as taxas, o outro rapava, depois tentavam ficar com os tokens, etc... então já estava com essa ideia na cabeça. Muito engenhoso mesmo, assim como os demais aqui... eu sequer tinha pensado nessa possibilidade.Eu acho que quem tenta roubar o ladrão tem mais é que se f*** ferrar mesmo, pois uma pessoa honesta iria avisar o dono ou no máximmo deixar quieto, mas não tentar sacar.Esse tipo de golpe me faz lembrar daquelas pegadinhas onde eles deixam uma nota de dinheiro no chão preso à um fio de naylon e puxam quando o \"aproveitador\" tenta pegar ela, ou então aquele da carteira perdida que dá choque.não estou apoiando o ladrão (o verdadeiro, não o aproveitador da situação), até porque isso alimenta um ciclo, onde quem foi lesado acaba angustiado e muitas vezes com ação de querer descontar esse sentimento em um próximo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "July 21, 2022, 03:53:53 PM",
      "body": "Nesse caso específico, como eu recebi a mesma mensagem de vários usuários diferentes, imagino que seja quase impossível a pessoa não saber que é um golpe, então acho até legal que aquele a aplicar o golpe no golpista desenvolva novos métodos de roubo. HAHAHAHAHMas é isso, sempre bom conhecer as engenharia por trás dos golpes. Se conhecerem outros '' nesse sentido'' até gostaria de saber mais, uma listinha de golpes curiosos para nunca cair hahaha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 21, 2022, 11:56:48 PM",
      "body": "Quote from: Disruptivas on July 21, 2022, 03:53:53 PMNesse caso específico, como eu recebi a mesma mensagem de vários usuários diferentes, imagino que seja quase impossível a pessoa não saber que é um golpe, então acho até legal que aquele a aplicar o golpe no golpista desenvolva novos métodos de roubo. HAHAHAHAHMas é isso, sempre bom conhecer as engenharia por trás dos golpes. Se conhecerem outros '' nesse sentido'' até gostaria de saber mais, uma listinha de golpes curiosos para nunca cair hahahaVerdade,Geralmente as pessoas que aplicam esses golpes sempre cometem uma falha ridícula que quase sempre é visual, onde a principal delas é uma péssima tradução.Gente burra, se preocupa tanto em fazer um esquema \"bem bolado\" na programação mas peca no exagero em disseminar o golpe e assim deixá-lo.Mas como já foi divulgado acima... parece que mesmo assim o golpe tem dado resultado ao meliante, infelizmente.Ainda bem que você, Disruptivas, é uma pessoa desconfiada, cautelosa e honesta acima de tudo... nunca teria caído nesse golpe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 22, 2022, 06:32:10 AM",
      "body": "Quote from: alegotardo on July 21, 2022, 11:56:48 PMVerdade,Geralmente as pessoas que aplicam esses golpes sempre cometem uma falha ridícula que quase sempre é visual, onde a principal delas é uma péssima tradução.Gente burra, se preocupa tanto em fazer um esquema \"bem bolado\" na programação mas peca no exagero em disseminar o golpe e assim deixá-lo.Gente burra!? Quem? O golpista ou a vitima?Para o golpista, só lhe interessa que 1% dos 100000 contactos, cai no seu esquema. O que por mais incrível que pareça, é bem mais de 1%.As vitimas é que são bem burras, por continuarem a cair nesses esquemas.Mas, mesmo assim os golpistas estão cada vez a melhorar a forma como contactam. Eu no meu trabalho, as vezes recebe emails muito bem elaborados, que facilmente enganam até os mais atentos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "July 23, 2022, 01:16:06 AM",
      "body": "Quote from: joker_josue on July 22, 2022, 06:32:10 AMMas, mesmo assim os golpistas estão cada vez a melhorar a forma como contactam. Eu no meu trabalho, as vezes recebe emails muito bem elaborados, que facilmente enganam até os mais atentos.Falando de golpe, lembrei de um na semana passada em que quase caí...Estava querendo adquirir uma fechadura digital para meu AP e atravez do comparador de preços \"google shopping\" eu descobri que na Amazon ela estava com um preço bastante atraente, e desconto maior ainda para pagamento em criptos.Após dar mais uma pesquisada decidi comprar lá mesmo, mas fiquei com dó de gastar meus Bitcoins por um pouquinho a mais de desconto e isso foi a minha salvação, pois graças ao método escolhido (pix) eu percebi já no app do banco que o beneficiário era uma pessoa física e só então notei que estava tentando fazer a compra em um site fraudulento.Se tivesse pago em cripto talvéz não tivesse percebido... ainda bem que sou \"diamonds hands\".Não sabia que o Google Shopping permitia a listagem de sites fraudulentos, pensei que haveria algum controle nisso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}