{
  "id": "topic_5457661",
  "title": "OscarFM",
  "author": "OscarFM",
  "created_time": "June 26, 2023, 04:15:10 PM",
  "content": "Hello Bitcoin community!I am excited to present a unique and innovative project that combines the power of blockchain technology with user engagement and brand ratings. This project aims to revolutionize the way we interact with brands, and I am currently seeking talented developers to collaborate on its development.Although the project is still in its early stages and does not have any existing code or application, it holds tremendous potential. With your expertise and passion for blockchain technology, we can bring this idea to life and create something truly remarkable.Key Project Highlights:Brand Reputation and Ratings: The platform will allow users to rate and provide feedback on various brands, influencing their reputation scores. This will help other users make informed decisions and encourage brands to improve their products and services.Incentives and Rewards: To foster user participation, we plan to introduce a rewards system where users can earn digital assets or other incentives for their active involvement in rating brands and providing valuable feedback.User-Friendly Interface: The application will feature a user-friendly interface designed to provide a seamless and enjoyable experience. We will prioritize intuitive navigation, appealing visuals, and responsive design to ensure maximum engagement.Secure and Transparent: Leveraging the power of blockchain technology, the platform will provide a secure and transparent environment for users to interact with brands. Data integrity, privacy, and accountability will be key priorities in the development process.This project is a fantastic opportunity for developers interested in working with blockchain technology and building a disruptive platform. Your contributions will have a direct impact on shaping the future of brand interactions and user engagement.If you are passionate about blockchain, have experience in web development, and are excited about the possibilities of this project, I encourage you to get in touch. Let's collaborate, bring this vision to life, and create a lasting impact in the world of brand ratings.Please reach out to me via private message or reply to this post if you're interested in joining the development team. Let's build something extraordinary together!Looking forward to hearing from you!Read more information in website project -> https://wiki.odicforcesounds.com Best regards,Note: In reference of the sticky post of this sub-forum, I need to say that this project aims to include only bitcoin, but if bitcoin community doesn't wish to contribute to this project, other alternatives may come up.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457661",
  "comments": [
    {
      "author": "Ucy",
      "created_time": "June 28, 2023, 09:38:42 AM",
      "body": "Hope to hear from you on what rules/standards the reputation  or ratings system will be based on. Basing them on the right rules/standards is one of the best ways to create a reliable rating system, which should also be evidence-based rating system, otherwise fools could give whatever ratings they want without reliably proving that the ratings are deserved. If you want people to reliably rate for example Cryptocurrency Exchanges based on how decentralized & blockchain-friendly they are, you could have a list of criteria, rules or standards they will need to follow while rating. The list could say rate from 1 to 100% How decentralized an exchange is, 2. How transparent is it, 3. How privacy/anonymity friendly it is , 4.How immutable it is, 5. How permissionless/trustless it is etc... The raters then rate accordingly, for example exchange1 gets 30% rating under Decentralized (which means it's 30% decentralized) , with proofs why the exchange deserves 30%,   40% under Privacy, with proofs, etc.  If any issue is observed in the ratings anyone can downvote them with proofs why the exchange deserves more or less than 30% under decentralized, or 40% under privacy. Everyone is free to check for issues in the ratings until no issue is found.  And you can have a ranking mechanism to rank up best raters. The higher ranks should have more power and stronger effect on the rating system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OscarFM",
      "created_time": "June 29, 2023, 12:10:15 AMLast edit: June 29, 2023, 12:26:57 AM by OscarFM",
      "body": "The project is not focus in fact in bitcoins, but a challenge for the bitcoin community, in the sense of associating some value or bitcoins, for each \"approved\" action. As described  in the site, the challenge aims to produce social actions and motivate industry to choose healthier products, healthier actions. The challenge is to \"agree\" to associate value that at the first moment is just a \"point\" or \"a singular number that indicates someone choice\" in society. Is like a \"game\" mechanism, that points into reality \"for good\", in the sense of the objective or vision..  Industry and business focus in a \"healthier\" direction, so that in Time, they may change  their choices.So I am trying to find people who agree to pay attention to the quality of the community while doing business. The Application is just a groups of qualities that anyone can choose in others \"users\" to rate their choices. ( nothing more ) Maybe \"good\" choices have value.. ( maybe ) For now, is just a dream or \"fantasy\" .. Fantasy ( Idea ) + Logic ( code ) = application ( Expression of fantasy in reality ) Maybe some day this project will be reality,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "June 29, 2023, 10:25:56 AM",
      "body": "Our method (the one I listed above) is actually applicable in every sphere of life including in Bitcoin/crypto sphere. Since you mentioned religion on the site I will advice that yours should be based on Love,which my religious law is actually based on - First of all, Love for the CREATOR of every Good Thing:  Heaven, Earth & Entire Existence, and love for Neighbors . If you truely love the CREATOR, you will not abuse or misuse things HE created because that will displease HIM as HE created everything for the good of HIS Creations. Love is about doing good to the Creations, especially humans, and not wronging anyone. *Love = strong desire to treat others good/well *Good =  A solution to problem that does not cause more problem/harm. Better still, anything that increases the quality of existence. So let's based everything you seek to achieve on the two simple Golden Rules of Love for the CREATOR and Love for neighbor and see how well the rules work: Participants should focus on identifying problems and solving them. Their works or solutions to problems should be good. Only good work or contribution should be rewarded. Everyone is free to correct issues in other participant works until there is no issue left to correct. I believe this is how we could help in making the world a better place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OdicforceSounds",
      "created_time": "July 03, 2023, 09:31:08 PM",
      "body": "Hey, I am not trying to discuss how big is my love about the creator is. In the name of the Creator many innocent persons die in history, and in the name of money or business too. In fact, actual news point to several criminal groups in the depths of religious groups. You know, like Italian Mafia Movies in Reality. ( old subject in fact ), I thought people would learn the lesson, but in fact they just reproduce what was produced in Time. That is why Fascism and Communism and others perspective continue in life, since their creators already die and the time and condition that events happen, already gone. So please, try to be real.So, put away that subject if you can, because when I say Religious groups, I mean just anther group who represent a logo. The creator gave us free will of choice, so don't blame others for their choices. I only wish to implement a Rate system within Industry and Business. That is my try ( since is not my choice, but can be industry choice to accept the challenge ) Since to implement the same to non-business, it would violate the principles of free choice that any community need to have to live in peace, with this mechanism we can motivate industry to be less corrupt. Is another historical fact, so please.. don't put God in the middle of our path. God will be God in 10000000 years.. we will be just dust or memory. \"If you Love, you are living happy. Don't be mistaken, Love is not happiness\". In fact, Love have a lot of sacrifice, so, it would be great that business be less criminal, or at least, have a mechanism to motivate them to be less corrupt. ( another historical fact ) Without a mechanism that motivate others to be good to others, and in a world full of mechanisms that motivate others to be stronger that others.. we can see who will win in the news ... right? ( just another historical fact )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OdicforceSounds",
      "created_time": "July 04, 2023, 11:54:29 PM",
      "body": "I can tell you just one thing about \"God\" 1 + 1 = 1 OR 3 ( Tao / Dao ) https://art.odicforcesounds.com/pages/YinYang/Dao/index.htmlThat is the simplification of the representation of what is the meaning the the Dao:\"path\", that is a \"old Chinese knowledge\". Is what we do, is what we became, is what we create.I am trying to create a mechanism where each one do actions in reality and those actions represent value, not only by the action it self, but by the classification of the action, which is already focused in solving problems in a rational and peaceful way, to accomplish the result. The result is that each action will expose brand or company above or below others. Is like a Marketing system that depends on the company it self, not an \"external investment\" to create the notion that the company is having a healthier attitude to the community that is exploring to obtain more economical value. The Dream, project this system to everyone in the world, saying that even in the poor countries of this world, people could earn money in form of actions that benefit others, because was helpful in some way. You see, for \"civilian\" that are in cities they already need to have that notion so the community can grow healthier.  In the other hand, we feel like \"gods\" when we have money to make a choice. For money everything was produced. The \"Good\" and the \"Evil\", For \"being good in the picture\", the \"Good\" and the \"Evil\", was produced. So maybe we can join both, and create the good one, since the evil one, already exist  Well, is a \"moral\" challenge, that in my perspective can be good to all. Industry it self as a business. An explosion of Marketing almost \"free\", ( cost paying attention to simple things and try to be fair ) Since everyone in the world can have good or evil attitudes with others, why not, we give value to those little things that represent value, but \"no one\" give value to them?Sometimes I thing within myself: Is this a moral contradiction? Can be. The school try to guide choices. Bad choices happen, but the school is trying to educate. Not all schools educate with practices, but with theory, and not all the teaching techniques promote \"good choices\", they only \"punish\" bad ones. Since we can quantify and qualify every single \"data\" that we wish to \"rate\", why not \"rate and educate? This is focused in the \"good\" but even for the \"bad\" or \"evil\" can be good.  My intention is not to know how bad or evil each can be, but how helpful each can be, within this idea that the value is mainly in the action that was made, not so far in the value of the bitcoin. If \"random\" data without meaning, can have so much value, why data with meaning should have no value at all?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}