{
  "id": "topic_5465285",
  "title": "Charles-Tim",
  "author": "Charles-Tim",
  "created_time": "September 01, 2023, 11:28:13 AM",
  "content": "The margin between buy and sell on BinanceP2P has become wider recently:This may lead to arbitrage trading.   Comparing it with Kucoin:   What do you think? Is this not profit for some people?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465285",
  "comments": [
    {
      "author": "Hyphen(-)",
      "created_time": "September 01, 2023, 11:55:06 AM",
      "body": "It will be a profit to some people with huge capital to go for Arbitrage trading, one can buy on Binance and still sell on that same Binance; or buy on Binance and sell on KuCoin but the transaction fee might take the profit if you have low capital.This price difference is only favorable for people buying with high amounts of money, I filter the price on Binance down to 100k NAIRA and the price increases in the buying order while it decreases on selling order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "September 01, 2023, 01:09:55 PM",
      "body": "Omor which kind offer be this?, Wattin this people dey up to?, see as binance use this offer take disrespect kucoin rates, if to say binance nor dey verified due to some reasons I for say na ponzi be this, because the difference from the rates alone na blast, though na advertising strategy to draw more customer wey go give dem more profit but the deal too dey massive for eye.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 01, 2023, 01:25:02 PM",
      "body": "Quote from: Hyphen(-) on September 01, 2023, 11:55:06 AMIt will be a profit to some people with huge capital to go for Arbitrage trading, one can buy on Binance and still sell on that same Binance; or buy on Binance and sell on KuCoin but the transaction fee might take the profit if you have low capital.You can even use Binance to do it, but I do not know if that is against their terms of service, but I do not think so. I can see the opposite on OKX:   There are some Nigerians that can use this to make money. In short, they are using it to make money. For the fee, sending from Binance to OKX and some other exchanges can be though lightning network. Bitcoin transaction fee on OKX is one of the cheapest on exchanges. So from Binance -> OKX -> the destination exchange.Converting to altcoin, send altcoin to the other exchange and convert back to bitcoin can be helpful, depending on the amount.Quote from: Makus on September 01, 2023, 01:09:55 PMOmor which kind offer be this?, Wattin this people dey up to?, see as binance use this offer take disrespect kucoin rates, if to say binance nor dey verified due to some reasons I for say na ponzi be this, because the difference from the rates alone na blast, though na advertising strategy to draw more customer wey go give dem more profit but the deal too dey massive for eye.Not Ponzi scheme though. Individual having ads, set their own price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "September 01, 2023, 02:58:37 PM",
      "body": "Omo within Binance to Binance as well one can make money. And this will definitely cause arbitrary trading and I believed people have started the trading. And these are the things Binance is using to pass those other exchange. And I was also wanted to use KuCoin exchange for my transactions but seen the margin is too high so I will prefer to use Binance for my transactions. Though I normally use different exchange, there are some times I use direct p2p while sometimes to exchanges. I just checked KuCoin and Paxful omen, no go area. The gap we Binance take pass them e too much. In fact in my calculation, you can buy in Binance and still seel in Binance and for those who are not using Binance can buy from there sell it to Binance vendor. Even the Binance buying price better than others and also the selling price. If there is money, people can make money from it daily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "September 01, 2023, 03:01:22 PM",
      "body": "Quote from: Charles-Tim on September 01, 2023, 01:25:02 PMThere are some Nigerians that can use this to make money. In short, they are using it to make money. For the fee, sending from Binance to OKX and some other exchanges can be though lightning network. Bitcoin transaction fee on OKX is one of the cheapest on exchanges. So from Binance -> OKX -> the destination exchange.Converting to altcoin, send altcoin to the other exchange and convert back to bitcoin can be helpful, depending on the amount.It looks profitable from looking at the screen prices but in reality is it not, in fact your always going to be at loss if you are thinking about running an arbitraging between OKX and Binance, i use two of these CEX and I've tried practically and it never worked. the average BUY price on Binance is low N23,845,772.55 as compared to the BUY price on OKX at average N28- 30,004,0027 but the SELL price on both are 23,500,461.19 or less. what does it means ? It means if you buy from Binance at 23,845,77.55 and sell on OKX at 23,500,461.19 you are going to be in a minimum loss of about 3k +gas fees.If you buy from OKX at 28- 30,004,0027.19 and sell on Binance at 23,500,461.19 you are going to be at a big loss of about 5-10k +gas fees.So mathematically OKX and Binance arbitraging doesn't work. I don't know about other exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 01, 2023, 03:07:42 PM",
      "body": "Quote from: Mate2237 on September 01, 2023, 02:58:37 PMOmo within Binance to Binance as well one can make money. Yes I guess, if Binance do not see it as manipulation. Part of what I am implying.Quote from: Igebotz on September 01, 2023, 03:01:22 PMIt looks profitable from looking at the screen prices but in reality is it not, in fact your always going to be at loss if you are thinking about running an arbitraging between OKX and Binance, i use two of these CEX and I've tried practically and it never worked. So mathematically OKX and Binance arbitraging doesn't work. I don't know about other exchanges.On the images, the Binance buy and sell P2P is the opposite of OKXP2P. That would be losses. It is about bitcoin transaction to other exchanges with cheaper fee. Not about arbitraging it on both Binance and OKX. Just using OKX in between to transfer to other exchanges for low fee.I have not tried it before, but it is not about OKX at all. For example, it is about Binance and Kucoin, but in a way you will first send to OKX from Binance using lightning network and send from OKX to Kucoin using on-chain. Or first converting to altcoin before and back to bitcoin after making the transaction directly, but this depends on the amount because spot trading fee is in percentage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "September 01, 2023, 07:24:05 PM",
      "body": "First, arbitrage in trading is allowed and not illegal, it's only at the risk of the arbitrageurs, and once such could be smart enough, then it's all good. From time immemorial, banks/BDC and even the black market operators' rates have never been the same and could be very wide in difference at times, especially in different states. This same thing is what I see here just as it's always in different exchanges, their rates can't be the same, but could be alarming with much difference and will always amount to more money for arbitrageurs.Also according to my observation, this might not be as pronounced as it seems on Binance to Binance platform because of the difference in range of the amount listed in Buy and Sell orders. Smaller amounts were selected for the Buy orders while Big amounts were selected for Sell orders, which makes it look like a big difference. It should have been the same price range if you are comparing the two fairly within the same exchange, and by this, I'm sure that the difference can't be a big deal. It will be a normal spread as it's in all exchange rates.But for the difference between Binance and Kucoin, it's a good business for arbitrageurs who detect it. And if my brain serves me right, you will not do the whole business with P2P, else, it will not amount to any profit. You would rather do it with P2P and Bitcoin transfer of both exchanges as the case may be for such to yield good results.However, be warned about this, exchanges could suspect it as well if it's often, which might cause issues for your account. They could suspect the large amount entering and leaving the same account frequently. I don't know how they react to this though, but they would know something is fishy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chilwell",
      "created_time": "September 02, 2023, 08:43:08 PM",
      "body": "Quote from: Charles-Tim on September 01, 2023, 03:07:42 PMYes I guess, if Binance do not see it as manipulation. Part of what I am implyingSir does this happen as mistake or what because I just dey notice this post now and I decided to check it again but I noticed the selling price is higher than the buying price, why price different is it do to their negligent. I see arbitrage has a risky stuff because I have once texted when chipper cash was buying crypto for the first time and it favor me but the next time I try it chop almost 50% of my money. So now what I want to know is that does the price difference happen deliberately or a mistake or it happen due to the market conditions?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 03, 2023, 10:50:25 AM",
      "body": "Quote from: Chilwell on September 02, 2023, 08:43:08 PMSir does this happen as mistake or what because I just dey notice this post now and I decided to check it again but I noticed the selling price is higher than the buying price, why price different is it do to their negligent.Buyers and sellers that set ads on the exchanges are the ones that set their own price, not Binance.Quote from: Chilwell on September 02, 2023, 08:43:08 PMI see arbitrage has a risky stuff because I have once texted when chipper cash was buying crypto for the first time and it favor me but the next time I try it chop almost 50% of my money. So now what I want to know is that does the price difference happen deliberately or a mistake or it happen due to the market conditions? The only usefulness of Chipper cash is to use it like naira bank account and for recharge card. If you want to use it to convert to anything other than naira, they are like scammers. Try and look at the buy rate and sell rate of dollar on their site to see how scam they are. Quote from: Charles-Tim on July 28, 2023, 07:33:58 AMChipper Cash dollar conversion rate is not favorable. Let me show you in a screenshot:   Buy at ₦901Sell at ₦788Is that not like a scam? If you are using Chipper virtual card for buying bitcoin and other cryptocurrencies, you are making the platform to scam you, there is nothing better than P2P for now in Nigeria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "September 03, 2023, 12:25:45 PM",
      "body": "Quote from: Charles-Tim on September 03, 2023, 10:50:25 AMIf you are using Chipper virtual card for buying bitcoin and other cryptocurrencies, you are making the platform to scam you, there is nothing better than P2P for now in Nigeria.I was directed to chipper cash some time back when I wanted to pay for something in dollar online through AliExpress. I ordered something from AliExpress and could only pay using dollar even though at AliExpress the price conversion of dollar to naira is the government regulated price. When converting your naira to dollar using chipper cash, they’ll sell the dollar to you at black market rate. So you’ll end up paying X2.5 or X3 of the amount you’re shown on AliExpress to pay. After seeing that, I got discouraged of using their virtual dollar card to make payment online. I haven’t tried selling dollar to them, but I know the reverse will be the case. I got discouraged and stopped using their services. I don’t know or sure if on exchanges you can make payment of order online, that’s not their main purpose but if they can add that to their services, they’ll get more users and patronage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}