{
  "id": "topic_5455209",
  "title": "E Julius",
  "author": "E Julius",
  "created_time": "June 05, 2023, 07:34:54 PMLast edit: June 09, 2023, 02:08:45 PM by E Julius",
  "content": "The Joint Health Sector Unions and Assembly of Healthcare Professional Associations have suspended its indefinite strike for 21 days.The suspension was announced after the leadership of the unions held a meeting with President Bola Tinubu on Monday.The Acting National Secretary, Matthew Ajirotu, in a text message sent to our correspondent, said the president promised to approve their demands.https://punchng.com/breaking-johesu-suspends-strike-for-21-days-after-meeting-tinubu/?amp",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455209",
  "comments": [
    {
      "author": "CryptoHeadlineNews",
      "created_time": "June 06, 2023, 06:04:18 AMLast edit: June 06, 2023, 06:15:42 AM by CryptoHeadlineNews",
      "body": "Thanks for the information once again, but I must say that this information is not yet complete without the link to the blog or website which you got this from. Because though I can see you are still a \"Newbie\" and yet to fully master how to effectively post a thread without having issues (i.e if the words are copied verbatim) by adding the source link, to avoid plagiarism case, because I just ran a plagiarism check and got to find out the site this thread was taken from even without you providing it, as given below;https://punchng.com/breaking-johesu-suspends-strike-for-21-days-after-meeting-tinubu/?ampSo, please I will advise you to hurry up and add this link above as the source where you got your information from to your thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "June 06, 2023, 11:33:54 AM",
      "body": "Quote from: CryptoHeadlineNews on June 06, 2023, 06:04:18 AMThanks for the information once again, but I must say that this information is not yet complete without the link to the blog or website which you got this from. Because though I can see you are still a \"Newbie\" and yet to fully master how to effectively post a thread without having issues (i.e if the words are copied verbatim) by adding the source link, to avoid plagiarism case, because I just ran a plagiarism check and got to find out the site this thread was taken from even without you providing it, as given below;https://punchng.com/breaking-johesu-suspends-strike-for-21-days-after-meeting-tinubu/?ampSo, please I will advise you to hurry up and add this link above as the source where you got your information from to your thread.Thank you for making that point noted to the OP, funny enough this is his first post in the forum, though he might not be aware of some of the forum rules, he should make the needed changes in the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "June 06, 2023, 12:03:23 PM",
      "body": "OP I will applaud and commend your efforts to bringing to our notice the suspension of strike by the JOHESU group. Atleast yobhave done well as a newbie for providing us with such information here but just as you have been told earlier, refferencing of copied work is very much important here because the rules states so. If you fail to reference possible copied work, you might be banned for plagiarism and the chances of your appeal is not guaranteed. So therefore, next time do well to put your reference from where you got any update of  any nature that was not composed by you.Lastly, feel free to ask questions here as a new member do that you will get to know more as the case maybe.Welcome to bitcointalk platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "June 08, 2023, 11:33:10 PM",
      "body": "Quote from: CryptoHeadlineNews on June 06, 2023, 06:04:18 AMThanks for the information once again, but I must say that this information is not yet complete without the link to the blog or website which you got this from. Because though I can see you are still a \"Newbie\" and yet to fully master how to effectively post a thread without having issues (i.e if the words are copied verbatim) by adding the source link, to avoid plagiarism case, because I just ran a plagiarism check and got to find out the site this thread was taken from even without you providing it, as given below;https://punchng.com/breaking-johesu-suspends-strike-for-21-days-after-meeting-tinubu/?ampSo, please I will advise you to hurry up and add this link above as the source where you got your information from to your thread.Omo, this message dey enough to out this person o. As e be now, e never even take correction for watin you tell am and with the way I read watin you provide for the link way dey there, na straight up word to word for the first set of the content en just carry paste o. Worst self, na en very first and only post still, na plagiarised content. E cast!Abeg, make person try pm am make e know watin e suppose do via say, e just dey survive now via say people no too dey put eye here as na pighin way we dey speak for here.Make una way never know how e dey be for here try to dey slow down, make una dey read an ask questions make you no buy problem for una self.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 09, 2023, 02:43:37 PM",
      "body": "Quote from: E Julius on June 05, 2023, 07:34:54 PMThe Joint Health Sector Unions and Assembly of Healthcare Professional Associations have suspended its indefinite strike for 21 days.The suspension was announced after the leadership of the unions held a meeting with President Bola Tinubu on Monday.The Acting National Secretary, Matthew Ajirotu, in a text message sent to our correspondent, said the president promised to approve their demands.https://punchng.com/breaking-johesu-suspends-strike-for-21-days-after-meeting-tinubu/?ampIt a very pathetic experience that at this age we are still battling with the effect of strick action by many sectors of the economy, are the government to be blame on these or the people themselves, i don't even expect this coming from the health sector because they deals with people's lives, how will it appears it the president of the nation is not well and no any health or medical personel could attend to him due to strike action they have embacked on, but isn't it the poor and masses they were being affected with the consequences and not been attended to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "E Julius",
      "created_time": "June 10, 2023, 08:58:59 AM",
      "body": "This is what you get when corruption has taken over the day. Tracing back to the root of the issue, the fuel subsidy saga, there you find one of the greatest lie been told to Nigerians. Let's just fold our hands and watch as events unfold",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}