{
  "id": "topic_5528977",
  "title": "_act_",
  "author": "_act_",
  "created_time": "February 04, 2025, 08:05:26 PM",
  "content": "I think it is very obvious that almost all altcoins are securities. QuoteA commodity is a basic good or raw material like oil, gold, or wheat, which is traded based on its physical characteristics and supply and demand, while a security is a financial instrument representing ownership in a company, such as a stock or bond, and is primarily valued based on the company's performance and future potential; essentially, commodities are tangible goods, while securities represent ownership rights in an entity. Satoshi did a great work by leaving and he remain anonymous. Altcoins that are heavily influenced like how ethereum is heavily influenced by the ethereum foundation and Vitalik Buterin, bitcoin is not like that.Why is Proof of Stake. That is not like mining which is like mining gold. Almost all these altcoins are securities.I posted this because the new United States SEC is considering if those altcoins are securities Quote from: https://cointelegraph.com/news/hester-peirce-sec-plans-crypto-overhaulThe US Securities and Exchange Commission is carving out a new path for the cryptocurrency sector, including evaluating the security status of crypto assets and potentially providing “retroactive relief” for certain token offerings. It is very easy to know that they are securities if they have founders, and are centralized and also having PoS.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5528977",
  "comments": [
    {
      "author": "bestcandy",
      "created_time": "February 04, 2025, 08:22:57 PM",
      "body": "Quote from: _act_ on February 04, 2025, 08:05:26 PMI think it is very obvious that almost all altcoins are securities. QuoteA commodity is a basic good or raw material like oil, gold, or wheat, which is traded based on its physical characteristics and supply and demand, while a security is a financial instrument representing ownership in a company, such as a stock or bond, and is primarily valued based on the company's performance and future potential; essentially, commodities are tangible goods, while securities represent ownership rights in an entity. Satoshi did a great work by leaving and he remain anonymous. Altcoins that are heavily influenced like how ethereum is heavily influenced by the ethereum foundation and Vitalik Buterin, bitcoin is not like that.Why is Proof of Stake. That is not like mining which is like mining gold. Almost all these altcoins are securities.I posted this because the new United States SEC is considering if those altcoins are securities Quote from: https://cointelegraph.com/news/hester-peirce-sec-plans-crypto-overhaulThe US Securities and Exchange Commission is carving out a new path for the cryptocurrency sector, including evaluating the security status of crypto assets and potentially providing “retroactive relief” for certain token offerings. It is very easy to know that they are securities if they have founders, and are centralized and also having PoS.It's so obvious that Bitcoin is a viable commodity considering the demand and future potential of Bitcoin and if we corelate the value and performance of Bitcoin to altcoin it will be well establish that altcoin are just securities that is hyp and influence by their foundation.Irrespective the hyping of some altcoin there performance is still stagaring to make a significant potential in the digital economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "haircombint",
      "created_time": "February 04, 2025, 08:24:53 PM",
      "body": "Haircomb is a commodity too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OfficialGratejoy",
      "created_time": "February 04, 2025, 09:17:11 PM",
      "body": "It sounds funny,because people believe that commodities are only raw materials that is being processed in other to produce other products, think of this,from bitcoin,other altcoins was created,so now I'm telling you nothing but the truth, bitcoin is nothing else but commodity.If you are doubting You can carry out your own reach on commody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "February 04, 2025, 09:19:22 PM",
      "body": "This is why I don't even bother about talks of an altcoin surpassing Bitcoin in price, market cap or market dominance. These coins just do not have what it takes. They were made to make the owners profit and that is all they will ever be. take a look at Ethereum and how it's performing. This is supposed to be the next best thing after bitcoin yet it has not been able to get close to its ATH, no matter how bullish the market has been recently. A coin that is centrally owned and controlled by an entity cannot have the amount of trust Bitcoin has, and trust is what determines the price of a coin. When people trust a thing, it gives it more value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "February 04, 2025, 10:02:12 PM",
      "body": "Quote from: OfficialGratejoy on February 04, 2025, 09:17:11 PMIt sounds funny,because people believe that commodities are only raw materials that is being processed in other to produce other products, think of this,from bitcoin,other altcoins was created,so now I'm telling you nothing but the truth, bitcoin is nothing else but commodity.If you are doubting You can carry out your own reach on commody.In fact, monitoring the characteristics and workings of altcoins is the best way to ensure that Bitcoin is a commodity and not a security. According to the definition set by the Securities and Exchange Commission, Bitcoin alone is a commodity compared to other altcoins. Now, what does this classification mean for cryptocurrencies in particular? It facilitates the establishment of bills regulating the sector, and this is often overseen by the legislative chamber in Congress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 04, 2025, 10:47:14 PM",
      "body": "Quote from: _act_ on February 04, 2025, 08:05:26 PMI think it is very obvious that almost all altcoins are securities. QuoteA commodity is a basic good or raw material like oil, gold, or wheat, which is traded based on its physical characteristics and supply and demand, while a security is a financial instrument representing ownership in a company, such as a stock or bond, and is primarily valued based on the company's performance and future potential; essentially, commodities are tangible goods, while securities represent ownership rights in an entity. to clarify the commodities market is not tangible, they are not a farmers street market of real people handling real fruit and selling them for cash. a commodities market is digital certificates of a underlying asset that has certain characteristicsthese characteristics are a raw product used to create other products EG oil=gasoline/plastic.. gold=jewellery/electronicsbitcoin 2009-2016 was just a currency asset but became a commodity when it produced secondary coins/pegged tokens via subnetworks, sidechains and bridged networksQuote from: _act_ on February 04, 2025, 08:05:26 PMSatoshi did a great work by leaving and he remain anonymous. Altcoins that are heavily influenced like how ethereum is heavily influenced by the ethereum foundation and Vitalik Buterin, bitcoin is not like that.satoshi did leave when he was beginning to feel that he was being treated as the governor of bitcoin.. however not so long later(2014) core become a centralised entity under the management of blockstream, paying the key critical devs that decide on bitcoins path(roadmap) where by core now act as governors of bitcoin, heavily influencing bitcoins path(roadmap)blockstream then split into 3 subsidiaries (blockstream, chaincodelabs, brinks) to pretend to not be centralised. but monitoring the github privileged devs reveals they still act in unison in their centralised votes of bitcoin function/upgrades/priority and timeline.. and also the technical discussion platforms are all moderated by the same privileged few that are sponsored by the same entities mentionedQuote from: _act_ on February 04, 2025, 08:05:26 PMWhy is Proof of Stake. That is not like mining which is like mining gold. Almost all these altcoins are securities.I posted this because the new United States SEC is considering if those altcoins are securities Quote from: https://cointelegraph.com/news/hester-peirce-sec-plans-crypto-overhaulThe US Securities and Exchange Commission is carving out a new path for the cryptocurrency sector, including evaluating the security status of crypto assets and potentially providing “retroactive relief” for certain token offerings. It is very easy to know that they are securities if they have founders, and are centralized and also having PoS.PoS vs PoW is not a criteria of discerning category. though we all know that PoW offers a real underlying cost of production of the main asset where as PoS is near costless to produce the underlying asset",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "February 04, 2025, 10:53:18 PM",
      "body": "The U.S. has precedent to put many people in jail over ICOs, altcoin launches etc. Virtually any coin with a public sale has U.S. holders. How could that be when they claim to not allow US buyers? Well simply the platforms handling the sale of their token don't bother to check sufficiently, which is obviously on purpose. Sadly or not Ripple XRP ruling kind of muddied the water for what security means in the crypto world. In my view this sets Bitcoin back s few years, but whatever. Ripple will eventually die a painful death. People are stupid enough to invest in moondust but eventually a market crash would wipe the shit other than Bitcoin out, like it has done so many times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "February 05, 2025, 03:12:29 AM",
      "body": "Quote from: _act_ on February 04, 2025, 08:05:26 PMI posted this because the new United States SEC is considering if those altcoins are securities It is very easy to know that they are securities if they have founders, and are centralized and also having PoS.It's a big question that a former SEC. chair, Gensler failed to answer even over years, he as a leader of SEC tried to attack many altcoin companies, projects and alternative cryptocurrencies.Rep. Patrick McHenry Confronts Gary Gensler: Is Ether a Security or a Commodity?This question will come back again and again before we have new Act on this new industry. Howey Test might need to be updated or a new test needs to be launched too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "February 05, 2025, 07:37:51 AM",
      "body": "Quote from: franky1 on February 04, 2025, 10:47:14 PMbitcoin 2009-2016 was just a currency asset but became a commodity when it produced secondary coins/pegged tokens via subnetworks, sidechains and bridged networksNo. Those coins like ether, binance coin and others are like what you said but they are securities. Also what you see 1 BTC, 2 BTC and other amount representation of bitcoin is the currency part. But bitcoin is money. I mean the intrinsic value that bitcoin has is the money and what makes bitcoin a money. Also it is never the tokens it has that makes it a commodity, it is because of how it is in design and not centralized.Quote from: franky1 on February 04, 2025, 10:47:14 PMPoS vs PoW is not a criteria of discerning category. though we all know that PoW offers a real underlying cost of production of the main asset where as PoS is near costless to produce the underlying assetStaking is what the makes them more centralized and make them similar to what securities can offer. You do not need to have a coin before you can get reward. Unlike mining which is better and similar to how commodities are produced. You do not need to have bitcoin before you can mine bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 05, 2025, 08:26:51 AMLast edit: February 05, 2025, 12:40:02 PM by franky1",
      "body": "Quote from: _act_ on February 05, 2025, 07:37:51 AMQuote from: franky1 on February 04, 2025, 10:47:14 PMbitcoin 2009-2016 was just a currency asset but became a commodity when it produced secondary coins/pegged tokens via subnetworks, sidechains and bridged networksNo. Those coins like ether, binance coin and others are like what you said but they are securities. Also what you see 1 BTC, 2 BTC and other amount representation of bitcoin is the currency part. But bitcoin is money. I mean the intrinsic value that bitcoin has is the money and what makes bitcoin a money. Also it is never the tokens it has that makes it a commodity, it is because of how it is in design and not centralized.ether should be a commodity due to its own tokenisation ability(secondary product creation)but gensler didnt want to makes rules for bitcoin but did want to make rules for ethereum so he put them in categories for own personal(departmental) control reasonsas for your assertions of the \"centralisation\".. well both ethereum and bitcoin have their own monarchy of github devs and hierarchy of who has privelige of controlling the force-merge of new features.. so that debate is neither here nor there in the bases of which is which concerning security vs commodityits more about as you said the \"raw material\" meaning used to create other productsfor instance a company share is just a share. it doesnt create anything from itwhere as derivatives are a different financial tool that can create further financial tools beyond it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}