{
  "id": "topic_5402553",
  "title": "Awwal08",
  "author": "Awwal08",
  "created_time": "June 14, 2022, 10:11:29 AM",
  "content": "There are several telegram channels/groups that act as arbitrage channels; when I first saw the advertisement, I assumed it was legitimate since I saw Binance exchange, which is well-known as a trustworthy exchange, and then there's Bnax exchange.Here's a link to how it looks with different group names.https://i.imgur.com/HJXYabM.jpg\\shttps://i.imgur.com/jqfqpjM.jpg\\shttps://i.imgur.com/xNCLyye.jpg游대Binance.com buy - 30061.12 游대Bnax.nl sell - 32466.00 Profit per btc traded - 2404.88 Profit % - 8.00To profit, you will purchase from Binance and sell in bnax.Then I test it out with a small quantity to see whether it's genuine. I bought BTC from Binance, transferred it to Bnax, sold it for USDT, and then transferred it back to Binance. This was my first successful transaction, and I made a profit. I was so pleased with the return that I decided to invest all of my money in order to make a large profit, but I was unable to withdraw both my profit and my cash from the exchange this time. They require that I reach their institutional level, which requires a sum of $25,000. This is how I was scammed and lost my money.My recommendation to newbies is to not believe everything they see on Telegram, especially when it comes to free money.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402553",
  "comments": [
    {
      "author": "examplens",
      "created_time": "June 14, 2022, 10:33:41 AM",
      "body": "I suggest you move this thread to the scam accusation section and use the proper reporting formatCode:[b][color=black]What happened:: [/color][/b][b][color=black]Scammers Profile Link: [/color][/b][b][color=black]Reference Link: [/color][/b][b][color=black]Amount Scammed: [/color][/b][b][color=black]Payment Method: [/color][/b][b][color=black]Proof of Payment: [/color][/b][b][color=black]PM/Chat Logs: [/color][/b][b][color=black]Additional Notes: [/color][/b]unfortunately, I saw so many scams on the telegram and you haven't told us anything we don't already know. I would say that no serious reputable service will enter individual trades or exchanges through telegram.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "June 14, 2022, 11:37:55 PM",
      "body": "Quote from: Awwal08 on June 14, 2022, 10:11:29 AM I was so pleased with the return that I decided to invest all of my money in order to make a large profit, but I was unable to withdraw both my profit and my cash from the exchange this time. They require that I reach their institutional level, which requires a sum of $25,000. This is how I was scammed and lost my money.My recommendation to newbies is to not believe everything they see on Telegram, especially when it comes to free money.This is just a simple trade using different platform, well, yeah, how arbitrage work.So the instructions came from telegram? You did a successful trade in the first place, right? Who are these \"they\" asking for 25,000? Why you lost your money? you sent the 25,000 to them? For what? I'm confused, literally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "June 14, 2022, 11:52:38 PM",
      "body": "Lol, some sort of arbitrage scamYou should have been a little smart to release this. If there is an opportunity to make money, whey does some random stranger tell you to make money out of it, yet they could make it too silently?It means they are sending you into their scam trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "June 15, 2022, 12:00:04 AM",
      "body": "How much is the amount that you've deposited?So you mean you can't withdraw unless it will reach $25,000 total in your balance?That's why I don't trust Telegram and suggested anyone avoid those people sending their service offers.Telegram is a house of scammers and avoids strangers people out there, I'm using Telegram but of course, only give responses to those accounts whom you know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "June 15, 2022, 01:59:30 AM",
      "body": "Quote from: PX-Z on June 14, 2022, 11:37:55 PMQuote from: Awwal08 on June 14, 2022, 10:11:29 AM I was so pleased with the return that I decided to invest all of my money in order to make a large profit, but I was unable to withdraw both my profit and my cash from the exchange this time. They require that I reach their institutional level, which requires a sum of $25,000. This is how I was scammed and lost my money.My recommendation to newbies is to not believe everything they see on Telegram, especially when it comes to free money.This is just a simple trade using different platform, well, yeah, how arbitrage work.So the instructions came from telegram? You did a successful trade in the first place, right? Who are these \"they\" asking for 25,000? Why you lost your money? you sent the 25,000 to them? For what? I'm confused, literally.Here, arbitrage is to lure one into their scam exchange. First, people try to pocket the difference, then bnax won't allow to withdraw unless you trade $25k, some may deposit that amount and their funds will get forever stuck, ie, scammed. Some may even do kyc (don't expect they will allow to withdraw) and that's double fucked. Whatever social media you use, disable adding to groups by strangers from settings. Other people also got scammed similar way, you can read here: https://www.reddit.com/r/Bitcoin/comments/stt0pt/bnax_exchange/Should have searched before depositing there. Sometimes you get blinded by potential profit and don't give enough attention.. well that's how greed works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "June 15, 2022, 03:53:48 AMLast edit: June 15, 2022, 07:22:09 PM by PX-Z",
      "body": "Quote from: libert19 on June 15, 2022, 01:59:30 AMHere, arbitrage is to lure one into their scam exchange. First, people try to pocket the difference, then bnax won't allow to withdraw unless you trade $25k, some may deposit that amount and their funds will get forever stuck, ie, scammed. Some may even do kyc (don't expect they will allow to withdraw) and that's double fucked. Whatever social media you use, disable adding to groups by strangers from settings. Other people also got scammed similar way, you can read here: https://www.reddit.com/r/Bitcoin/comments/stt0pt/bnax_exchange/Should have searched before depositing there. Sometimes you get blinded by potential profit and don't give enough attention.. well that's how greed works. Oh i see, thanks, I thought this bnax is somewhat reputable that's why i got confused. But if op is claiming that the first trade is successful then the scammer risk some of its fund to get a huge caught, or just like how ponzi works.Although, this seems a new thing but when it comes to telegram, people should be wary from people making noise and claim a too good to be true offers there, or even in any kind of platform to avoid such thing. Imagine it's a $25k, that's a huge amount sending to a random exchange with good offers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "June 15, 2022, 05:22:39 AM",
      "body": "Quote from: PX-Z on June 15, 2022, 03:53:48 AMQuote from: libert19 on June 15, 2022, 01:59:30 AMHere, arbitrage is to lure one into their scam exchange. First, people try to pocket the difference, then bnax won't allow to withdraw unless you trade $25k, some may deposit that amount and their funds will get forever stuck, ie, scammed. Some may even do kyc (don't expect they will allow to withdraw) and that's double fucked. Whatever social media you use, disable adding to groups by strangers from settings. Other people also got scammed similar way, you can read here: https://www.reddit.com/r/Bitcoin/comments/stt0pt/bnax_exchange/Should have searched before depositing there. Sometimes you get blinded by potential profit and don't give enough attention.. well that's how greed works. But if op is claiming that the first trade is successful then the scammer risk some of its fund to get a huge caught, or just like how ponzi works.That profitable trade was on exchange itself, they won't allow you to withdraw in first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "June 15, 2022, 09:01:23 AM",
      "body": "Use image BB codes to display the images properly, you are a junior member already. Use the the one below.Code:[img][/img]The images also looks too stretched, upload them the way you took the screenshots or resize the width, the height will adjust itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Munir575",
      "created_time": "June 15, 2022, 10:35:13 AM",
      "body": "This looks like free money and i don't believe such things any more. Telegram is one place to avoid because the rate of scam that takes place there is high. Good of you to bring this to our notice, a brother of mine got scammed on Telegram once so lets be careful and try to avoid being scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "June 15, 2022, 11:17:03 AM",
      "body": "Quote from: Munir575 on June 15, 2022, 10:35:13 AMThis looks like free money and i don't believe such things any more. Leave off the scammy exchange, method its arbitrage and its real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 15, 2022, 12:02:56 PM",
      "body": "The most common scam is They are waiting for a client with the so-called \"big fish.\" And always, according to human psychology, it is necessary to show that the company is supposedly loyal. The first withdrawal of a small amount will be impeccable. Having received dopamine and, that is, the joy of the transaction, a person naturally hurries to repeat, and already with larger amounts, and then sadness awaits him.But OP, this is the most common pattern of scammers. And while there are such naive people, scammers will not even lift a finger to change something.And besides, this whole story takes place in telegrams. There is nothing to say at all; just spread your arms.Nevertheless, thank you for understanding your mistake. I would like to believe that people will begin to learn from the mistakes of other people and not their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "June 16, 2022, 05:39:35 AM",
      "body": "Quote from: lovesmayfamilis on June 15, 2022, 12:02:56 PM...I would like to believe that people will begin to learn from the mistakes of other people and not their own.People learn most from their own mistakes, however its better to learn from other's mistakes so you don't repeat same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 16, 2022, 09:26:44 PM",
      "body": "Quote from: Munir575 on June 15, 2022, 10:35:13 AM Telegram is one place to avoid because the rate of scam that takes place there is high. Good of you to bring this to our notice, a brother of mine got scammed on Telegram once so lets be careful and try to avoid being scammed. Telegram is the main home scammer, they always make use o the channels as they are sure they will still get the victim to be scammed. It is always wired whenever someone got scammed, but the experience now matters a lot. OP these form scams are very common and they've been using the method to scam many people. sorry or your lost",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 16, 2022, 10:42:03 PM",
      "body": "Quote from: Awwal08 on June 14, 2022, 10:11:29 AMTo profit, you will purchase from Binance and sell in bnaxIts not until its coming from the Binance exchange service before one can make his profit realization a thing of reality, but why much awareness is been made in this manners i believe is to make scam users fall into extinction, because they all believe in getting more victims using those reputed platforms with all their intention in making steady flow of income on them, the earlier the better and safe it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jordansteph",
      "created_time": "June 17, 2022, 02:00:42 PM",
      "body": "Quote from: libert19 on June 16, 2022, 05:39:35 AMQuote from: lovesmayfamilis on June 15, 2022, 12:02:56 PM...I would like to believe that people will begin to learn from the mistakes of other people and not their own.People learn most from their own mistakes, however its better to learn from other's mistakes so you don't repeat same. Does that mean crypto arbitrage doesn't exit?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "June 17, 2022, 02:10:43 PM",
      "body": "Quote from: Awwal08 on June 14, 2022, 10:11:29 AMThere are several telegram channels/groups that act as arbitrage channels; when I first saw the advertisement, I assumed it was legitimate since I saw Binance exchange, which is well-known as a trustworthy exchange, and then there's Bnax exchange.Here's a link to how it looks with different group names.https://i.imgur.com/HJXYabM.jpg\\shttps://i.imgur.com/jqfqpjM.jpg\\shttps://i.imgur.com/xNCLyye.jpg游대Binance.com buy - 30061.12 游대Bnax.nl sell - 32466.00 Profit per btc traded - 2404.88 Profit % - 8.00To profit, you will purchase from Binance and sell in bnax.Then I test it out with a small quantity to see whether it's genuine. I bought BTC from Binance, transferred it to Bnax, sold it for USDT, and then transferred it back to Binance. This was my first successful transaction, and I made a profit. I was so pleased with the return that I decided to invest all of my money in order to make a large profit, but I was unable to withdraw both my profit and my cash from the exchange this time. They require that I reach their institutional level, which requires a sum of $25,000. This is how I was scammed and lost my money.My recommendation to newbies is to not believe everything they see on Telegram, especially when it comes to free money.Sorry that had to happen to you  Scammers suck and we are only human so everyone falls for a scammer at some point in their long lives. So really nothing to be ashamed of. Thanks for warning others!However I noticed your warning would serve better in the scam accusation thread: https://bitcointalk.org/index.php?board=83.0Please be sure to post it in the correct format",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "June 17, 2022, 02:16:59 PM",
      "body": "Quote from: jordansteph on June 17, 2022, 02:00:42 PMQuote from: libert19 on June 16, 2022, 05:39:35 AMQuote from: lovesmayfamilis on June 15, 2022, 12:02:56 PM...I would like to believe that people will begin to learn from the mistakes of other people and not their own.People learn most from their own mistakes, however its better to learn from other's mistakes so you don't repeat same. Does that mean crypto arbitrage doesn't exit?It exists, op got scammed due to scam exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jordansteph",
      "created_time": "June 17, 2022, 03:43:49 PM",
      "body": "Quote from: libert19 on June 17, 2022, 02:16:59 PMQuote from: jordansteph on June 17, 2022, 02:00:42 PMQuote from: libert19 on June 16, 2022, 05:39:35 AMQuote from: lovesmayfamilis on June 15, 2022, 12:02:56 PM...I would like to believe that people will begin to learn from the mistakes of other people and not their own.People learn most from their own mistakes, however its better to learn from other's mistakes so you don't repeat same. Does that mean crypto arbitrage doesn't exit?It exists, op got scammed due to scam exchange. How can one know the right crypto arbitrage? Any guide on that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "June 17, 2022, 05:19:01 PM",
      "body": "Quote from: Awwal08 on June 14, 2022, 10:11:29 AM~snipe~After going through and being a victim of this scam scheme, what becomes your reason to have fallen into this scam? Nothing else but greed. Immediately you saw the chance of making a whole lot of profit of over $2.8k in one trade by a simple back and forth movement, you had to try and exploit the system and I'm sure should it have gone well, you would have continued with the back and forth trading and accumulate even more. That alone should be a warning to you that something is up with this platform. With price being different from other exchanges on the crypto space and nt slightly but a significant amount at that, its a flag up. Unfortunately, you had to find out the hard way, always know that there are no too good opportunities in the crypto space.Meanwhile in bitcointalkforum, we try to do things orderly. Your post might be targeted to warn the newbies amongst other beginner categories but still, its best you move this thread to the scam accusation board as have been directed by Examplens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}