{
  "id": "topic_5445416",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "March 18, 2023, 05:34:36 PM",
  "content": "Алик БахшиФюрер Путин уголовный преступник     Наконец свершилось! Международный уголовный суд (МУС) выдал ордер на арест Путина за кражу детей в Украине. Теперь Путин не может появиться в странах, где действует юрисдикция МУС. Даже переговоры с Украиной, на которые настаивает Путин, не могут состояться. Никто не отважится вести переговоры с уголовником. Раннее я писал, что Путин является уголовным преступником за организацию массового применения допинга российскими спортсменами на зимней Олимпиаде в Сочи в 2014 году.  Путин уголовный преступник    Президенту России Путину не миновать судебного расследования, и как это не странно, ни как политического хулигана (1,2), нарушавшего международные договора и виновного в гибели десятков тысяч людей, а за преступление в области спорта, конкретно за массовое применение допинга российскими спортсменами и подмену допинг-проб сотрудниками ФСБ, что квалифицируется, как уголовное преступление. Путин, конечно, отрицает участие государства в афере с допинг-пробами, однако дело усложняется тем, что Совет Международной ассоциация легкоатлетических федераций (IAAF), проходивший в Монако 3-4 декабря, решил продлить дисквалификацию российской федерации легкой атлетики до тех пор, пока не будут выполнены два условия:Первое, - Россия должна оплатить все счета связанные с расходами IAAF по выявлению аферы, а также необходимо будет оплатить расходы за контроль по соблюдению условий восстановления.Второе условие, наиболее неприятное для Путина, - до 31 декабря должен быть обеспечен доступ к пробам московской антидопинговой лаборатории, и по результатам перепроверки все виновные понесут наказание.    Без сомнения, что среди виновных нарисуется бывший министр спорта Российской Федерации Виталий Мутко, которого с самого начала допингового скандала подозревают в организации массового скармливания российских спортсменов запрещенными препаратами и который может заложить Путина. В этом плане Мутко следует опасаться за свою жизнь. От несчастного случая никто не гарантирован и, как сказал у Михаила Булгакова Воланд, «Кирпич ни с того ни с сего никому и никогда на голову не свалится». Интересный факт, Мутко как-то грозился обратиться в гражданский суд за клевету, но что-то мешает ему осуществить этот шаг. То, что Мутко не решился бы пойти на преступление без указания Путина бесспорно. Организация власти в России, созданная Путиным, такова, что без его ведома ни один госслужащий не волен ослушаться. Нацист и реваншист Путин подобно Гитлеру использует спортивные достижения русских спортсменов для поднятия духовной составляющей русского народа, как доказательство исключительности и значимости «русского мира», в защите которого фюрер Путин нашел себя и определил целью своей жизни (3.4). Но вот, что удивительно и заранее известно, эти благие намерения, как и у Гитлера, закончатся весьма печально.1. Путин и его новый мировой беспорядок. https://alikbahshi.livejournal.com/35844.html2. Who is Putin? https://alikbahshi.livejournal.com/32817.html 3. Путин – пастырь русского мира. https://alikbahshi.livejournal.com/36544.html4. Великорусский шовинизм, и Путин его фюрер. https://alikbahshi.livejournal.com/21133.html   07.12.18",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445416",
  "comments": [
    {
      "author": "Snork1979",
      "created_time": "March 18, 2023, 07:32:29 PM",
      "body": "Quote from: Alik Bahshi on March 18, 2023, 05:34:36 PM^Ничтожный в юридическом смысле ордер нах никем не признанного МУС на арест Президента РФ, санкции укро-усть-засранского \"суда\" против законного Президента Сирии ...Мне вот очень любопытно, какой следующий маразм отмочит Главный укро-клоун, чтобы над ним снова поржал #весьмир? Или он уже достиг дна и ниже падать ему некуда?Что думаете, пацаны?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "March 18, 2023, 07:44:44 PM",
      "body": "Quote from: Snork1979 on March 18, 2023, 07:32:29 PM.Что думаете, пацаны?Думаю что карта у вас уже есть, Чтобы решать, никем непризнанный МУС или кем-то признанный",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Warrior Dance",
      "created_time": "March 18, 2023, 07:58:11 PM",
      "body": "Quote from: Snork1979 on March 18, 2023, 07:32:29 PMЧто думаете, пацаны?Думаю что всё-таки придётся тебе, леонеле и прочей шушаре влашиватся в пластику в попытке скрыться от выше упомянутого суда  Представил тебя на скамье подсудимых с силиконовыми губищами",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "March 19, 2023, 04:26:15 AM",
      "body": "Русский фюрер вновь нарушил Конституцию, объявив охоту на бизнесменов. Они обязаны часть доходов \"добровольно\" отдать на войну. Короче как и во времена военного коммунизма в России произойдёт экспроприация экспроприаторов. В очередь суки, в очередь! Эра Коммунизма вернулась! Ура, товарищи.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "March 19, 2023, 10:39:43 AM",
      "body": "Опять все забывают, с чего все началось.Был вердикт ЕСПЧ. Который НЕ НИЧТОЖЕН в юридическом смысле. Что Навальный - НЕ ВИНОВЕН.И что было потом - Навального арестовали. А ведь РФ тогда была подписана на ЕСПЧ и ОБЯЗАЛАСЬ соблюдать все его предписания.И что? РФ на ЕСПЧ положила болт.Как-то надо было реагировать?Вот и отреагировали.  И это только  начало. Я почти уверен, что в ближайшие месяцы ордера на арест будут выписаны еще на десятков высших руководителей России. Ибо есть такая тема - НЕИСПОЛНЕНИЕ ордеров на арест. То есть, те, кто отказываются сейчас арестовать Путина - автоматически будут внесены в список преступников рано или поздно. Начало положено. Я бы рекомендовал всем олигархам и их родственникам незамедлительно покинуть страны НАТО и вернуться в РФ. Потому что в любой момент за ними могут придти.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "March 24, 2023, 05:02:20 AM",
      "body": "Quote from: bonfire66 on March 19, 2023, 10:39:43 AMОпять все забывают, с чего все началось.Был вердикт ЕСПЧ. Который НЕ НИЧТОЖЕН в юридическом смысле. Что Навальный - НЕ ВИНОВЕН.И что было потом - Навального арестовали. А ведь РФ тогда была подписана на ЕСПЧ и ОБЯЗАЛАСЬ соблюдать все его предписания.И что? РФ на ЕСПЧ положила болт.Как-то надо было реагировать?Вот и отреагировали.  И это только  начало. Я почти уверен, что в ближайшие месяцы ордера на арест будут выписаны еще на десятков высших руководителей России. Ибо есть такая тема - НЕИСПОЛНЕНИЕ ордеров на арест. То есть, те, кто отказываются сейчас арестовать Путина - автоматически будут внесены в список преступников рано или поздно. Начало положено. Я бы рекомендовал всем олигархам и их родственникам незамедлительно покинуть страны НАТО и вернуться в РФ. Потому что в любой момент за ними могут придти.  Так в России их Путин ограбит, в России сегодня времена военного коммунизма.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crypto_trader#43xzEXrP",
      "created_time": "March 25, 2023, 02:55:37 AM",
      "body": "Уголовным преступником, хуйло было бы, если бы оно просто совершило уголовное преступление.То, что мы видим, это не просто уголовное преступление - это серия военных преступлений,предательство народа СССР, и примитивный - оголтелый терроризм, блеать!Впрочем, ещё в 1999-м году, хуйло взрывало дома. Ну дык хули удивляться?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "April 05, 2023, 02:58:27 AM",
      "body": "Quote from: crypto_trader#43xzEXrP on March 25, 2023, 02:55:37 AMУголовным преступником, хуйло было бы, если бы оно просто совершило уголовное преступление.То, что мы видим, это не просто уголовное преступление - это серия военных преступлений,предательство народа СССР, и примитивный - оголтелый терроризм, блеать!Впрочем, ещё в 1999-м году, хуйло взрывало дома. Ну дык хули удивляться?  Русский фюрер за всё заплатит, так устроен Мир.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 19, 2023, 08:28:23 PM",
      "body": "Русский фюрер Путин не будет представлять Россию на саммите БРИКС в ЮАР, по причине выданного на него ордера МУС на арест. Путин настолько боится, что даже в своей стране большую часть жизни проводит в подземном бункере.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "July 21, 2023, 04:47:33 PM",
      "body": "Жалко и обидно. Вот что бы было бы, если бы ЮАР бы пригласило бы Путина. К себе на саммит. А вместо Путина прилетел бы двойник. ЮАР бы арестовали бы двойника, а тут из Москвы из бункера вылезает НАСТОЯЩИЙ путин и говорит, что он - конкретно настоящий. А в ЮАР был двойник. И начинает войну с ЮАР. Засылает туда недоремонтированный недоАвианосец Кузю. Который будет туда плыть примерно месяц. А также самолеты времен СССР. Которые туда будут лететь сутки. Если их не собъют сомалийские пираты. Вот примерно как-то так я думаю, будет будущая война России и ЮАР. А что думаете вы?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "July 21, 2023, 07:34:42 PM",
      "body": "Quote from: Alik Bahshi on July 19, 2023, 08:28:23 PMРусский фюрер Путин не будет представлять Россию на саммите БРИКС в ЮАР, по причине выданного на него ордера МУС на арест. Путин настолько боится, что даже в своей стране большую часть жизни проводит в подземном бункере. Ну выступит по видеосвязи, делов то. А за руку Лавров со всеми подержится. Ты чё такой дремучий, Алик, после пандемии удалёнка вроде никому уж не в диковинку. Лучше зырь чё там на серьёзных чешет некто Анил Суклал, южноафриканский амбассадор. Говорит дескать уже 22 страны подали официальные заявки на вступление в БРИКС и ещё примерно столько же на низком старте. По всем признакам дохуя делов, тут уж всяким Гэ-7 самое время впору насторожиться. Могут там на сходке в Южной Африке толпой то допиздеться до всякого, вроде на повестке дня массовая дедолларизация и прочий многополярный мир.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 22, 2023, 05:46:26 AM",
      "body": "Quote from: bonfire66 on July 21, 2023, 04:47:33 PMЖалко и обидно. Вот что бы было бы, если бы ЮАР бы пригласило бы Путина. К себе на саммит. А вместо Путина прилетел бы двойник. ЮАР бы арестовали бы двойника, а тут из Москвы из бункера вылезает НАСТОЯЩИЙ путин и говорит, что он - конкретно настоящий. А в ЮАР был двойник. И начинает войну с ЮАР. Засылает туда недоремонтированный недоАвианосец Кузю. Который будет туда плыть примерно месяц. А также самолеты времен СССР. Которые туда будут лететь сутки. Если их не собъют сомалийские пираты. Вот примерно как-то так я думаю, будет будущая война России и ЮАР. А что думаете вы? Не знаю как насчет двойника законченного Мудака, но то, что с ним никто не хочет разговаривать. - это точно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "July 24, 2023, 01:40:44 PM",
      "body": "Меня во всей этой схеме больше всего беспокоит ТОЛЬКО тот факт, почему до сих пор, только  ПУтин и Львова-Белова признаны уголовными преступниками. А почему это ДО СИХ пор не сделано в отношении как минимум 50% населения России оптом?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 24, 2023, 05:01:09 PM",
      "body": "Quote from: bonfire66 on July 24, 2023, 01:40:44 PMМеня во всей этой схеме больше всего беспокоит ТОЛЬКО тот факт, почему до сих пор, только  ПУтин и Львова-Белова признаны уголовными преступниками. А почему это ДО СИХ пор не сделано в отношении как минимум 50% населения России оптом?  Вы имеете ввиду, что 50% населения это не русские? Да и потом, а кто тогда будет участвовать в грядущей гражданской войне?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "July 24, 2023, 08:12:39 PM",
      "body": "Quote from: Alik Bahshi on July 24, 2023, 05:01:09 PMQuote from: bonfire66 on July 24, 2023, 01:40:44 PMМеня во всей этой схеме больше всего беспокоит ТОЛЬКО тот факт, почему до сих пор, только  ПУтин и Львова-Белова признаны уголовными преступниками. А почему это ДО СИХ пор не сделано в отношении как минимум 50% населения России оптом?  Вы имеете ввиду, что 50% населения это не русские? Да и потом, а кто тогда будет участвовать в грядущей гражданской войне?аха-х)) никакой гражданской войны не будет, я считаю. Современное поколение россиян настолько \"каблуки\" , они даже этого процесса не заметят . Какая нахуй \"гражданская война \"?, вы о чем?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 25, 2023, 05:05:08 AM",
      "body": "Quote from: The0ldl_lser on July 24, 2023, 08:12:39 PMQuote from: Alik Bahshi on July 24, 2023, 05:01:09 PMQuote from: bonfire66 on July 24, 2023, 01:40:44 PMМеня во всей этой схеме больше всего беспокоит ТОЛЬКО тот факт, почему до сих пор, только  ПУтин и Львова-Белова признаны уголовными преступниками. А почему это ДО СИХ пор не сделано в отношении как минимум 50% населения России оптом?  Вы имеете ввиду, что 50% населения это не русские? Да и потом, а кто тогда будет участвовать в грядущей гражданской войне?аха-х)) никакой гражданской войны не будет, я считаю. Современное поколение россиян настолько \"каблуки\" , они даже этого процесса не заметят . Какая нахуй \"гражданская война \"?, вы о чем? В Российской империи кроме русских проживают десятки других народов, которые хотят быть свободными.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "July 25, 2023, 06:11:07 PM",
      "body": "Quote from: Alik Bahshi on July 25, 2023, 05:05:08 AMВ Российской империи кроме русских проживают десятки других народов, которые хотят быть свободными.... остаётся лишь вспомнить, что в Российской империи (когда она существовала уж больше сотни лет назад) жили и украинцы и финны. И особо то не выебывались они тогда.И что \"независимого\" государства (в том плане, что от них воообще ничего не зависит) с названием \"Украина\" вообще ни на одной карте мира не было до 1991 года ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "July 25, 2023, 06:48:21 PM",
      "body": "Quote from: Alik Bahshi on July 25, 2023, 05:05:08 AMQuote from: The0ldl_lser on July 24, 2023, 08:12:39 PMQuote from: Alik Bahshi on July 24, 2023, 05:01:09 PMQuote from: bonfire66 on July 24, 2023, 01:40:44 PMМеня во всей этой схеме больше всего беспокоит ТОЛЬКО тот факт, почему до сих пор, только  ПУтин и Львова-Белова признаны уголовными преступниками. А почему это ДО СИХ пор не сделано в отношении как минимум 50% населения России оптом?  Вы имеете ввиду, что 50% населения это не русские? Да и потом, а кто тогда будет участвовать в грядущей гражданской войне?аха-х)) никакой гражданской войны не будет, я считаю. Современное поколение россиян настолько \"каблуки\" , они даже этого процесса не заметят . Какая нахуй \"гражданская война \"?, вы о чем? В Российской империи кроме русских проживают десятки других народов, которые хотят быть свободными.Ой да ладно вам заливать... Большинство нацреспублик мечтают присосаться к Москве и тянуть с нее бабло. Сейчас не найду статью, там подробно исследовали и выяснили что московская огломерация генерирует огромную прибыль, даже в сравнении со всей страной, а не то что с отдельными регионами",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "July 26, 2023, 10:39:55 AM",
      "body": "Чечня получает ЕЖЕДНЕВНО около 1 миллиарда рублей. Сам Кадыров в этом признался недавно (1-2 года назад). Но почему-то до сих пор Чечня остается одной из САМЫХ БЕДНЫХ республик РФ. Что-то там явно не так... не в количестве отправляемого бабла дело, ИМХО!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}