{
  "id": "topic_5454667",
  "title": "Yatsan",
  "author": "Yatsan",
  "created_time": "May 31, 2023, 04:11:09 PMLast edit: May 31, 2023, 04:23:08 PM by Yatsan",
  "content": "May Akda: CyrusOrihinal na paksa: [Bitcointalk Party - Discord sv] Bitcoin Pizza bake-off contest! Enter by June 1Dumating na naman araw na pinakahihintay! Ipinapaalam namin ang pagsasagawa ng isang Bitcoin Pizza Contest ngayong taon! Ang patimpalak ay magsisimula ngayon at matatapos sa ika-1 araw ng Hunyo, pagkasimula ng botohan. Matatapos ang botohan sa ika-10 ng Hunyo.11:59GMT sa lahat ng mga petsaUpang makita ang mga palatuntunan at makasali, maaari na lamang na sumali sa #pizza-day-event-2023 channel (ang paanyaya ay mula kay Cyrus )Ang nilalaman ng patimpalak ay kaparehas ng mga nauna na iyong makikita sa #pizza-day-event-2022, #pizza-day-event-2021 and #pizza-day-event-2020 na mga channel.Nakapaloob sa mga sumusunod ang mga premyo ngayong taon:Bitcoin Pizza Bitcointalk 1yr badge (maaari kaming mamigay pa ng karagdagang badge sa limitadong panahon)Betnomi Custom Ledger Nano X7 12mBTCHabang lumalaki ang BTC mga premyo, magkakaroon ng ika-una't ikalawang parangal at baka magkaroon pa ng mga karagdagang premyo dipende sa kung paano tatakbo ang patimpalak.Maaari akong kontakin kung nais mong magdagdag sa premyong maaaring mapanaluhan.Sino kaya ang maglalakas loob na makuha ang @fillippone's pizza badge? Makakayanan niya kayang dipensahan ang titulo? Nasa inyong kamay ang boto!Salamat theymos sa pagsuporta sa event ng karagdagang 5mBTC, at sa Betnomi para sa pisikal na premyo at unang-una ay kay Laszlo  sa pagpunan  ng aming hilig sa pizza!Pagsasalin mula sa:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454667",
  "comments": [
    {
      "author": "Eternad",
      "created_time": "June 01, 2023, 05:22:53 PM",
      "body": "Duplicate translated thread na ito bro dahil meron na nito na gawa ni @Peanutswar sa Others section natin https://bitcointalk.org/index.php?topic=5454295.0.Siguro dapat coordinated ang mga translator na kasali sa AOBT para hindi masayang yung effort sa pag translate kung duplicate copy na.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}