{
  "id": "topic_5421115",
  "title": "ZekiBeyy",
  "author": "ZekiBeyy",
  "created_time": "November 15, 2022, 01:41:34 PM",
  "content": "2020 Yılında başlayan daha öncesi var mı? bilemiyorum özellikle Dapper iş birliği ile bir çok NFT projesi çıktı halende anlaşmalar yapılıyor. Son yaşanan boğa döneminde NFT projelerinde genel olarak bir patlama yaşandı diyebiliriz, bir çok şirket farklı tarzlarda NFT'ler çıkardılar. Merak ettiğim özellikle Dapper projelerindeki NFT'ler bir sonraki boğada tekrar ivme kazanabilir mi? yoksa böyle ufaktan değer kaybederek sabit bir noktada kalır mı? düşünceleriniz nelerdir. Cüzdanımda az bir miktar NFT mevcut bazen dip fiyatlardan biraz daha alsam mı? acaba diye düşünüyorum yada nokta koymayı.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421115",
  "comments": [
    {
      "author": "kriminall",
      "created_time": "November 15, 2022, 07:59:38 PM",
      "body": "Herkes sadece tahmin edebilir, bana da nft gibi sanal arsa işi patlayacak gibi geliyor, bir dönemde herkes sanal arsalara hücum edecek tekrar, fiyatları çok yüksek şu anda bile, düşerse birkaç m2 arsa alayım diyorum belki üzerine bir kaç bina dikeriz ileride  nft ile birlikte yükselecek diğer değer bence metaverse arazileri, bunun için sadece bana öyle geliyor diyebilirim,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "November 15, 2022, 09:27:26 PM",
      "body": "NFT projelerinin çoğunun bir kullanım alan olmadığı için zamanla kaybolacakları belliydi. Bir ekosistemin parçası olan, kullanım alanı olanlar zaten değerlerini koruyor veya daha da değerleniyor. Hiçbir işe yaramayan sırf koleksiyonluk diye pazarlanan şeylerse doğal olarak düşüyor. Dapper Labs güzel liglerle anlaştı ama ürünlerine değer katacak hiçbir şey yapamadı. Sırf lisanslamadan dolayı bir süre daha değerlerinin olacağını düşünüyorum ama şirket ciddi bir vizyon değişikliğine gitmezse beş on sene sonraya kalmaz gibi görünüyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "November 15, 2022, 09:49:54 PM",
      "body": "Quote from: kriminall on November 15, 2022, 07:59:38 PMHerkes sadece tahmin edebilir, bana da nft gibi sanal arsa işi patlayacak gibi geliyor, bir dönemde herkes sanal arsalara hücum edecek tekrar, fiyatları çok yüksek şu anda bile, düşerse birkaç m2 arsa alayım diyorum belki üzerine bir kaç bina dikeriz ileride  nft ile birlikte yükselecek diğer değer bence metaverse arazileri, bunun için sadece bana öyle geliyor diyebilirim, Ben de böyle düşünüyorum yeni bir Metaverse patlaması olacak gibi.Uzun süredir almak istediğim arsayı geçenlerde Otherside Otherdeed aldım ApeCoin kendi Metaverse evrenini hazırlıyor daha piyasaya çıkmadı. Otherside evreninde sanırım APE MUTANT NFT'ler başta olmak üzere piyasada zirvede bulunan bir çok NFT kullanılacak gibi duruyo.Taşaklı bir Metaverse evreni hazırlıyo gibiler aldım bir arsa attım kenara şans artık tutarsa güzel olur tutmazsa yapacak birşey yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 15, 2022, 10:16:12 PM",
      "body": "O zamanlar da ciddi tepki almama rağmen ısrarla söylüyordum, şimdi de aynı noktadayım. Evet nft olayı sanat, koleksiyonculuk, oyun ve spor alanlarında karşılığını buldu ama bu karşılık görünen pazarın BENCE %25'i bile değildi. İnsanlar çok heveslendi, yapmak ya da almak konusunda agresif bir piyasa oluştu ancak bu da bilinçli bir taktikti çünkü esas amaç için bir pazar oluşması gerekiyordu, Farkındayım, o zamanlar güzel para kazananlar da oldu ama esas mevzu illegal veya vergisiz parayı sisteme sokmaktı. Bazıları kendi gibilerle işbirliği yoluna gitti, bir kısmı ise zaten direkt sağ cepten sol cebe yaptı.Beş yaşındaki bir çocuğun bile daha iyisini yapacağı saçma sapan şekillere insanların öyle değer biçtikleri için 50-100 Eth verdiklerine gerçekten inanıyor musunuz?Tabii şunu da belirtmem lazım, fiziki sanat eserleri de eskiden beri, daha doğrusu her zaman para aklamanın bir yoludur ama orada yine de yapılması gereken bir şeyler var, nftde ise hiçbir şey yok, internette zibilyon tane olan tasarım sitelerinden birine gir, bir şeyler uydur, mintle ve abuk bir fiyattan satışa koy, bu kadar. Kimse demez ki sen buna hangi kafayla böyle paralar istiyorsun? (Ama mesela ressamsan derler)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "November 17, 2022, 01:35:38 PM",
      "body": "NFT projelerine daha çok play2earn, Blockchain üzerine kurgulanmış oyunlarla ilgileniyorum. Gelecekte çok önemli bir yerlerinin olacağını düşünüyorum. Bu sezonda çok fazla sürdürebilir oyun piyasaya çıkmadı bir iki tane var hala geliştirilmeye devam ediyorlar. Koleksiyonculuğu da ayrıyetten severim, dapper bütün ligleri kendine bağlayarak aslında büyük bir hype yakaladı devamında ne olacak çok fazla kestiremiyorum farklı bir kullanım alanı açarlarsa o zaman sürdürebilir olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}