{
  "id": "topic_5437806",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "February 02, 2023, 04:56:50 PM",
  "content": "I have few questions about Bitcoin and some parts of other bitcoin wallet I may not know of, since I have been using Bitcoin wallet I have never choose to set gas fee myself, like how you do with Metamask when sending Ethereum tokens so.1. Is there any way to generate bitcoin address offline without the help of the internet ?2. Since Bitcoin launched is there any wallet that supports auto editing the gas fee of Bitcoin straight from your android or IOS machine? 3. Does high gas fee means faster-sending speed on bitcoin wallet?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437806",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "February 02, 2023, 05:04:10 PM",
      "body": "1. Yes it's possible. Most of them do.2. Yes, there are plenty of wallets that allow you to edit your fees. To mention a few: Electrum, Exodus, etc. Which wallet have you been using?3. Correct. A lot of wallets allow you to choose \"High, medium, and low\" fees. You can go with that or If you want to fully customize the fees on your own, you should probably look into mempool.space so you don't end up overpaying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "February 02, 2023, 05:06:45 PM",
      "body": "Additionally, since transactions on the bitcoin network aren't interacting with smart contacts, you can edit the fees to whatever you want (in a lot of cases, the lowest fee you can set will still get a confirmation - compared with eth which uses \"gas\" and can have smart contracts that fail if they're not executed fast enough).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "February 02, 2023, 05:07:37 PM",
      "body": "If you can't create an address offline, your not using a wallet.There is no gas in Bitcoin. That term comes from a centralized premined shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "February 02, 2023, 05:07:48 PM",
      "body": "1. With paper wallet generator or good non custodial wallet software, you can create your wallet and public receiving addresses offline. This is one part of creating air-gappped wallets.2. Electrum is available for Android and iOS. You can edit transaction fee rates too with three options: ETA, Static or Mempool.3. Fee rate is one part of your transaction fee that is by fee rate x transaction size. With same transaction size, if you increase fee rate, you are paying more transaction fee to miners. It boosts your transaction to tip of mempools and makes more quickly to be confirmed.[General] Bitcoin wallets - Which, What, Why?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "February 02, 2023, 05:12:27 PM",
      "body": "Customize fee is for advanced users because a newbie may set a wrong fee amount that may lead to the transactions never getting confirm, but aside from that I don't see any big deal in doing and at most cases you are at liberty to set the amount you want to pay for fees. We have quite a lot of wallets that allow for such settings of fees, such as blockchain wallet, trust wallet and metamask and electrum are the popular ones I have used a few times. Quote from: KiaKia on February 02, 2023, 04:56:50 PM3. Does high gas fee means faster-sending speed on bitcoin wallet? Yes, when you pay high fees it allows miners to pick your transaction and confirm it as a priority before the transaction from those with smaller fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "February 02, 2023, 05:12:44 PM",
      "body": "Quote from: KiaKia on February 02, 2023, 04:56:50 PM1. Is there any way to generate bitcoin address offline without the help of the internet ?Yes. You can download almost any bitcoin wallet, disable internet connection, and generate thousands if not millions of addresses. Quote2. Since Bitcoin launched is there any wallet that supports auto editing the gas fee of Bitcoin straight from your android or IOS machine? Bitcoiners don't like when the term \"gas fee\" is being applied to bitcoin because there is no gas. But yes, there are many mobile wallets that support manual fee adjustments, one of them is Electrum.Quote3. Does high gas fee means faster-sending speed on bitcoin wallet? Higher fees may increase your chances of getting into the next block,  it doesn't increase the chances of finding a new block. Your transaction paying a sufficient fee can be confirmed no faster than 10 minutes on average.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "February 02, 2023, 05:31:31 PM",
      "body": "Quote from: KiaKia on February 02, 2023, 04:56:50 PM1. Is there any way to generate bitcoin address offline without the help of the internet ?OP your question will take us abit back to discussing about types of wallet and their categories as well since i think this most important aspect is part of what you must have missed before going further into bitcoin, but remember that we have offline and online wallets, which if you had ever come across this while reading you may not have asked this question, so you can generate your wallet address offline, example is paper wallet, electrum on air gapped device etc.Quote from: KiaKia on February 02, 2023, 04:56:50 PM2. Since Bitcoin launched is there any wallet that supports auto editing the gas fee of Bitcoin straight from your android or IOS machine? Yes, a good example also is the electrum wallet, transaction fees are adjustable before a transaction is sent and after the transaction is made and not confirmed yet, you can customize the fee, to make it more easier, always check the mempool before making a transaction if fully busy or not.Quote from: KiaKia on February 02, 2023, 04:56:50 PM3. Does high gas fee means faster-sending speed on bitcoin wallet? Yes, it gives you higher priority over other unconfirmed transactions on the mempool by placing yours to the next to be confirmed transactions if you increase your transactions fee or if the mempool is not busy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "February 02, 2023, 05:36:26 PM",
      "body": "Quote from: Ojima-ojo on February 02, 2023, 05:12:27 PMYes, when you pay high fees it allows miners to pick your transaction and confirm it as a priority before the transaction from those with smaller fees. Take note that miners prioritize the transactions based on their fee rate, not the absolute fee. It's possible that a transaction paying lower fee has more chance of getting confirmed than a transaction paying higher fee. Quote from: tbct_mt2 on February 02, 2023, 05:07:48 PM2. Electrum is available for Android and iOS. Electrum is available on Android, but there is no IOS version of electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "February 02, 2023, 07:03:57 PM",
      "body": "Quote from: KiaKia on February 02, 2023, 04:56:50 PM1. Is there any way to generate bitcoin address offline without the help of the internet ?Yes, I've read about this some time in the past, though I didn't really pay attention to understand most parts of the article, but I know that some service have made it possible to even send and receive bitcoin without internet connectivity.You can google this to find out how.Quote2. Since Bitcoin launched is there any wallet that supports auto editing the gas fee of Bitcoin straight from your android or IOS machine? Yes, you download and try Mycelium wallet, the app is available both on Android and iOS devices, the wallet offers the ability to adjust the amount of bitcoin you want to spend as a gas fee to have your transaction confirmed on the blockchain, but remember that the lower the fee you choose to pay, the longer your transactions stays without confirmation, and in some cases, you might end up not getting your transaction confirmed if the fee set is extremely low. Quote3. Does high gas fee means faster-sending speed on bitcoin wallet? Yes, the higher the bitcoins you choose to spend as a gas fee for your transaction, the faster the transaction will get confirmed on the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newbiedev",
      "created_time": "February 02, 2023, 07:56:49 PMLast edit: February 02, 2023, 08:17:55 PM by Newbiedev",
      "body": "Quote from: KiaKia on February 02, 2023, 04:56:50 PM1. Is there any way to generate bitcoin address offline without the help of the internet ?Yep. You can easily do this yourself. You don’t even need to do this using wallet apps. Writing the code to do this for some of the older address formats is pretty easy and an interesting exercise to go through. I’ve found that very few wallets allow you to import the older addresses directly (for good reasons). Blue Wallet does actually though.The way wallets do it nowadays with seed phrases is more involved, but you can even do that yourself without any wallet software using sites like this one: https://iancoleman.io/bip39/Edit: Forgot to add. If you’re talking about wallet addresses that you’re going to use for actual transactions for funds you don’t want to lose then of course don’t use random sites or your own code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "February 02, 2023, 09:05:04 PM",
      "body": "Yes, generating a Bitcoin address offline is possible and even recommended option. This method of creating a new wallet and generating addresses without the use of the internet enhances the security of your funds. As for transaction fees, there are numerous wallets that support automatic and manual fee adjustment for Bitcoin transactions. And, just a heads up, don't call it \"gas fee\". That's not a term typically used for Bitcoin network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "February 02, 2023, 10:27:26 PM",
      "body": "Quote from: hosseinimr93 on February 02, 2023, 05:36:26 PMQuote from: Ojima-ojo on February 02, 2023, 05:12:27 PMYes, when you pay high fees it allows miners to pick your transaction and confirm it as a priority before the transaction from those with smaller fees. Take note that miners prioritize the transactions based on their fee rate, not the absolute fee. It's possible that a transaction paying lower fee has more chance of getting confirmed than a transaction paying higher fee. Thanks man for the correction, all the while I thought the higher the fees the higher priority is given by the miners, until I read on this your comment that it doesn't entirely work that way, but I want to ask just a question I need more clarification on. What are the differences between the fee rate and the actual fee amount I was thinking both mean the same, please I will be glad if you can share more explanation for that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "February 02, 2023, 11:01:48 PM",
      "body": "Quote from: Ojima-ojo on February 02, 2023, 10:27:26 PMWhat are the differences between the fee rate and the actual fee amount I was thinking both mean the same, please I will be glad if you can share more explanation for that? The fee you pay for a transaction is equal to the fee rate (which is measured in sat/vbyte) multiplied by virtual size of your transaction (vbyte). So, the larger the transaction size, the more transaction fee you have to pay.The virtual size of your transaction depends on the addresses type and number of inputs and outputs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 03, 2023, 05:56:17 AM",
      "body": "Quote from: Ojima-ojo on February 02, 2023, 05:12:27 PMCustomize fee is for advanced users because a newbie may set a wrong fee amount that may lead to the transactions never getting confirm, but aside from that I don't see any big deal in doing and at most cases you are at liberty to set the amount you want to pay for fees. While most wallets list this option as an \"advanced\" option, it's really not that complicated. Most decent wallets have nooby-friendly fee options like slow/med/fast options with their sats/b equivalent displayed, so it's easier for the user to choose a sats/b fee if they want to overpay significantly just to make sure the transaction gets confirmed in the next block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "February 03, 2023, 06:44:36 AM",
      "body": "Quote from: OmegaStarScream on February 02, 2023, 05:04:10 PM1. Yes it's possible. Most of them do.2. Yes, there are plenty of wallets that allow you to edit your fees. To mention a few: Electrum, Exodus, etc. Which wallet have you been using?3. Correct. A lot of wallets allow you to choose \"High, medium, and low\" fees. You can go with that or If you want to fully customize the fees on your own, you should probably look into mempool.space so you don't end up overpaying.Thanks for your answers 1. I will like to know how to generate a bitcoin wallet offline without using a paper wallet generator. 2. I am using Trust wallet and whatever transaction fee been asked of me when sending bitcoin is what I have to go with, though it's not very high but it feels suck not to edit yourself. 3. Thanks, I asked because someone send me Bitcoin and I have to wait for like 15 hours before it finally gets approved in my wallet, I guess he used very low gas fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "February 03, 2023, 06:51:12 AM",
      "body": "Quote from: KiaKia on February 03, 2023, 06:44:36 AMThanks for your answers 1. I will like to know how to generate a bitcoin wallet offline without using a paper wallet generator. 2. I am using Trust wallet and whatever transaction fee been asked of me when sending bitcoin is what I have to go with, though it's not very high but it feels suck not to edit yourself. 3. Thanks, I asked because someone send me Bitcoin and I have to wait for like 15 hours before it finally gets approved in my wallet, I guess he used very low gas fee. 1. As I said, most noncustodial (desktop or mobile) wallets allow that. Although I don't really think that Trustwallet is the best wallet choice for BTC, you should be able to create a wallet and generate your seed phrase even if you're not connected to the internet.2. Trustwallet does allow you to edit your fees. See this guide[1].[1] https://community.trustwallet.com/t/how-to-change-the-btc-network-fee/67205",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "February 03, 2023, 06:57:03 AMLast edit: February 03, 2023, 07:18:51 AM by hosseinimr93",
      "body": "Quote from: KiaKia on February 03, 2023, 06:44:36 AM1. I will like to know how to generate a bitcoin wallet offline without using a paper wallet generator. You can install electrum and run it offline. (If you want your wallet to be completely secure, you should run electrum on an airgapped device.)Quote from: KiaKia on February 03, 2023, 06:44:36 AM2. I am using Trust wallet and whatever transaction fee been asked of me when sending bitcoin is what I have to go with, though it's not very high but it feels suck not to edit yourself. Since trustwallet is close-source, I wouldn't recommend anyone to use it. But it allows you to set the fee rate manually. To set the fee rate on trustwallet, tap on \"Setting\" button at top right corner of the screen before confirming transaction details.Quote from: KiaKia on February 03, 2023, 06:44:36 AM3. Thanks, I asked because someone send me Bitcoin and I have to wait for like 15 hours before it finally gets approved in my wallet, I guess he used very low gas fee. As already said, there is no gas fee in bitcoin. The transaction in question took a long to be confirmed, because it used a low fee rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "February 06, 2023, 12:59:11 PM",
      "body": "Quote from: KiaKia on February 03, 2023, 06:44:36 AMQuote from: OmegaStarScream on February 02, 2023, 05:04:10 PM1. Yes it's possible. Most of them do.2. Yes, there are plenty of wallets that allow you to edit your fees. To mention a few: Electrum, Exodus, etc. Which wallet have you been using?3. Correct. A lot of wallets allow you to choose \"High, medium, and low\" fees. You can go with that or If you want to fully customize the fees on your own, you should probably look into mempool.space so you don't end up overpaying.3. Thanks, I asked because someone send me Bitcoin and I have to wait for like 15 hours before it finally gets approved in my wallet, I guess he used very low gas fee. This takes my mind back to an experience in my early stage as a bitcoiners I had to send sum amount of BTC to someone and I decided to use a very low transaction fee rate and like over 8hours the BTC didn't dropped into the receiver wallet. I had to tell a friend about it, who recommended I should redo the transaction but with a higher fee rate, which I did and it didn't took up to 30mins to drop.The only consequence in that experience was that I ended up incurring high (double) transaction fee rate which at first I was avoiding. An experience I wish never to reiterate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "February 06, 2023, 01:21:23 PM",
      "body": "Quote from: Lida93 on February 06, 2023, 12:59:11 PMI had to tell a friend about it, who recommended I should redo the transaction but with a higher fee rate, which I did and it didn't took up to 30mins to drop.Take note that you can't always do this.In the case the original transaction hasn't been flagged as RBF, nodes reject the second transaction even if it pays much higher fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}