{
  "id": "topic_5466538",
  "title": "EluguHcman",
  "author": "EluguHcman",
  "created_time": "September 12, 2023, 03:04:25 PM",
  "content": "First I want let my defined \"introvert\" according to the Oxford dictionary.Introvert is a quiet person who is more interested in their own thoughts and feelings than spending times with other people.Now I want to talk about the infrastructure being that affects your aim to building of wealths and and how your lifestyle can affect your ventures.Being an introvert can weaken your self esteem with the nature of nurturing your ability to hindering situations that requires a confrontation where could be a challenge (competitive).Now, let's call for a discussion.>>>Do you know that people are out there networking while you an introvert is behind confidently alone by yourself without a concern to check programs that could help to boost and motivate you to actualize your dreams?Do you realizes that there are hosts who holds programs on how to create wealths through digital process yet you missed those golden opportunities without giving a damn?Of course there are indeed different ways to create wealths but before making it count you most be ready to get out of your comfort zone as an introvert.We fails so much to invest in our knowledges and putting to practice on what we have invested in too.Okay, let's look at a scenero of you being an introvert and you steps out to your daily market place you as an Investor/contractor where as you don't have skills of selling and attracting to your products or a one source of gaining contracts because you only relies on your regular customers (patrons)and if they don't come to you for patronage there would be no sales of account, if you are not called by your popular known companies there would be no for contract for you, if you don't have a white range collar job no job for you. But this is a system whereas, you have the energies and abilities to create wealths but the bridges is that you enjoys being indoors by yourself and does not want to mix with other people likely even if you do, you would easily get exhausted because you always focuses on picking errors and offenses.It is basically bit how long in demand to make wealths but your readiness to come out of your comfort zone and be socialized with the people that can impact your ability to generate and create wealths.Hence, you have to redirect your moves and schedules engaging on social Converses that could produce you a productive and positive outcomes.Sometimes you goes out to mix up with the people but still find nothing good to write about your association because your introverted nature of being is still in you.Although by my self research, being and introvert and living a reserve does not totally tags you all that errors and faulty but at the point of it depriving you from reaching to your goals is where the problems tagged a bad one Life is a survival of the fittest and so, you either dances by the winds or against the winds. Being exposed has a potential of doors opening with the qualities that determines your integrities by your transparencies. And little did you know that exposure is a skyrocket to lunch your deeds as steps to achieve your goals where investment is concerned.On no controversial, introvert is a tough barrier to the road or success.Let me share a recent experience I would love to tag \" Networking to attain a greater height to success\".Along the lines, I have always enjoyed being indoors by myself at all times and at most my friend has always been on the track to pull me out but a faithful day, I decided to give that my friend a chance and then we stepped out  out for a hangout at a bar,At a point while we sat out there, I saw a beautiful and adorable well looking lady who I was attracted on from a distance,  I wished to approach her but doesn't feel the momentum courageousness but I was otherwise encouragingly boosted by my friend which I was able to take the lead towards this lady. And of course we sat together, had lot of conversations as we talked about ourselves, exchanged contacts. Oh my goodness. Neither did I know she likes me as much as I like her too despite the first at seights. As times goes we keep talking on the phone with all those positive responsible talks and we do have the outdoors dates at times til we scheduled to met other days as usual. We embarked on sharing our dreams to lives, talks about the fair and the unfair life has treated us in our individual places. She asked what I do for a living and I told her I am into Crypto investment Bitcoin specifically but not yet at the height of my dreams but I hope in time of patient because Bitcoin is a reliable source of investment for patient and tactical investors like I am.I also asked about what she does for a living which she said she is an artistical stylist and a designer and doing prosperously successful.I felt a low self-esteem  like I am a second class comparing to her status but guess what, time goes on as we keep being in contacts and has already been on a relationship. The the hope and motive of going into a long distance relationship that would earn us a future planning together in due time, then she asked what is required to install a firm in other to keep a stable  and confidence reliances towards my ventures on the area of my BTC investment which I literally told her I needed to upgrade my invested capital on my BTC investments at an average of 0.20 BTC currently worth $5,217.8 to booster my target on  a diversification and also an efficient interrupted device (laptop) is required for a proactive networking system.Oh yeah. behold I got my wishes granted even beyond my expectations as she has gifted me  a pair of K2 boots, a Gucci foot wears (Pam's) and a HP laptop/capacity 4GB/250HDD.Shown on the images below>>>Now I am about to make my dream to BTC investment a reality as I am about to lunch a purchase of 0.20 BTC worth a $5,217.8 value at now. I am up getting to a greater height my fellow investors.This has really made me believe you don't have to fold your hands and expects manners from above. You just have to take a step and when is destined time of success and explorations you don't even need pulling the muscles.I brought about this up here because it is said that an appreciation is an application for more. I sometimes feels to extend gratitudes to those who has made efforts to my posts on one way and the others. Of course my expressed experience stories really called for a testimony and appreciations because I have always been indoors all those while without getting to these multiple height to success and of getting married alongside. This is what it takes about being an associate and socialism.I want to ask, are you one of this introverts? Why and how did you become one?Is it as a result of being molested or a result of parental and guidance?Things you must know about being an introvert on the business sector>>>* Do you know if you are an employee and your company needed a presentative you would not be. Considered if you are one of the introverts and could also cause you a setback or delays to promotions?.Do you know that most crashed business is a result of inability to socialize and set a literarily public campaigns?Do you know that your inability to speak could earn you a missed lottery ticket?Do you know that your introvertial lifestyle could earn you a defenceless?Come on guys let's discuss things out and get those who needed to be out of an imprisonment believing they are okay of their comfort zones.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466538",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "September 12, 2023, 03:34:42 PM",
      "body": "If you are going to write in a forum and tell us a story that we cannot verify if it is true, no matter how many pictures you attach, you could at least summarize it better.As a summary I will tell you that, assuming what you say is true, things have been going well for you in spite of being an introvert, and not because of it. In life and in business it is better to be extroverted, without going overboard. There are only a few small fields, like mathematics for example, where being introverted can help you, or at least it is not a priori an impediment to progress. The lady's story is too fantastic but I'm going to give you the benefit of the doubt, what I'm not going to go into is commenting on it.To summarize, I don't think there is a relationship between being introverted or extroverted and the success you can have with investments you make alone with a computer. If we go on to talk about business or large investments where you are going to deal with other people, obviously it is better to be extroverted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 12, 2023, 03:45:08 PM",
      "body": "Quote from: Poker Player on September 12, 2023, 03:34:42 PMIfTo summarize, I don't think there is a relationship between being introverted or extroverted and the success you can have with investments you make alone with a computer. If we go on to talk about business or large investments where you are going to deal with other people, obviously it is better to be extroverted.Fully agree. While investing you don't need to interact with other people, so it just doesn't make any real difference. Talking to a lot of different people when making investment decisions is usually bad, because other people have different goals and different necessities. So usually we get bad advice",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "September 12, 2023, 04:12:34 PM",
      "body": "Quote from: bitmover on September 12, 2023, 03:45:08 PMQuote from: Poker Player on September 12, 2023, 03:34:42 PMIfTo summarize, I don't think there is a relationship between being introverted or extroverted and the success you can have with investments you make alone with a computer. If we go on to talk about business or large investments where you are going to deal with other people, obviously it is better to be extroverted.Fully agree. While investing you don't need to interact with other people, so it just doesn't make any real difference. Talking to a lot of different people when making investment decisions is usually bad, because other people have different goals and different necessities. So usually we get bad adviceYou are absolutely right!And also I think it depends on the forms or kinds of investment we are about to venture into, most times seating with those who aren't crypto oriented might even made someone loose hope of investment because they aren't knowledgeable enough or fully routed in bitcoin so, the next is to  discouraged op especially when they are introvert this could easily affects their ways of reasoning because the only single person (s) they tried sharing a business idea got them knocked down or discouraged so they wouldn't have that capacity to visit the next person for advice or sharing investment plans.In summary, it's not always advisable to seek for investment advice to anyone who is not into same line of business with him, because they may not give him full support of go ahead order if such person is an extrovert and that could be the end of his dreams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 12, 2023, 04:18:57 PM",
      "body": "Quote from: bitmover on September 12, 2023, 03:45:08 PMQuote from: Poker Player on September 12, 2023, 03:34:42 PMIfTo summarize, I don't think there is a relationship between being introverted or extroverted and the success you can have with investments you make alone with a computer. If we go on to talk about business or large investments where you are going to deal with other people, obviously it is better to be extroverted.Fully agree. While investing you don't need to interact with other people, so it just doesn't make any real difference. Talking to a lot of different people when making investment decisions is usually bad, because other people have different goals and different necessities. So usually we get bad adviceEliminating the characters of an introvert as the case maybe in the section of investment just as discussed in the paragraphs tends to raise and boost the potentials of an individual who feels a low esteemed that he/she can make a huge different to explore beyond it's unsuccessful comfortability. Just as stated, coming out of your comfort zones and mingling with those who has the potentials to support your need of achieving your goals is a necessity but at this scenario bitmover, if you can convince me on how to go about being successful with my characteristics of being an introvert without affecting my investment of course I would dance to the tunes. The goal of all investors is to grow in a profitable impact and not a play adamant ignorantic role of arguements if am to me one of the controversial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "September 12, 2023, 04:21:45 PM",
      "body": "With that definition of Introvert, I mean everyone should be an introvert in the decision-making for Bitcoin or any other form of asset investment. You really want your mind to be calm, not influenced by others in the market, and able to make your own decisions without trying to make a new decision every day after a 1D red candle.That Gucci foot wear looks so clean, I am going to order one for myself. Thanks for showing it to me haha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "September 12, 2023, 04:28:43 PM",
      "body": "This feels like a dream coming true. You found a beautiful lady and she also liked you. She even gifted you all those things plus the amount to buy 0.2 BTC. I mean wow. I think you are the luckiest person ever I have seen in the field of BTC. Well, I will not raise any objection to your story but to be honest I liked it and I very much agree with you. For example. let's say if you listen to your introverted side and do not have the courage to go to her then you might not be in relation with her today. My friend, believe me, Being an introvert is bad, I lost the person but you found her. And I am happy for you. I hope you will stay together as wife and husband. Besides that, I totally agree with the fact that being introverted and being in your comfort zone will only bring comfort to you that you have to think of. But if you want to experience a level of comfort beyond your expectations then you have to leave your comfort zone and must become an extrovert. That's 100% true. And in investment, introvert people sometimes lack communication skills and sometimes they even do not try to bargain the deal while extroverts speak openly and share their emotions and ideas openly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 12, 2023, 05:03:49 PM",
      "body": "Quote from: Faisal2202 on September 12, 2023, 04:28:43 PMThis feels like a dream coming true. You found a beautiful lady and she also liked you. She even gifted you all those things plus the amount to buy 0.2 BTC. I mean wow. I think you are the luckiest person ever I have seen in the field of BTC. Well, I will not raise any objection to your story but to be honest I liked it and I very much agree with you. For example. let's say if you listen to your introverted side and do not have the courage to go to her then you might not be in relation with her today. My friend, believe me, Being an introvert is bad, I lost the person but you found her. And I am happy for you. I hope you will stay together as wife and husband. Besides that, I totally agree with the fact that being introverted and being in your comfort zone will only bring comfort to you that you have to think of. But if you want to experience a level of comfort beyond your expectations then you have to leave your comfort zone and must become an extrovert. That's 100% true. And in investment, introvert people sometimes lack communication skills and sometimes they even do not try to bargain the deal while extroverts speak openly and share their emotions and ideas openly. A mission is easy to be executed when you walk with those on thesame mission as you and at most when you dance to the lyrics as the mission is demanded. @ faisal2202, if really you understood the aim and objectives of my post with an experience shared alongside, I appreciates you but yet I want the best out of me. I stand not to be cheered when I am going contrary against a goal of aim but still, when you know what you are after of, you stands firm to it but without being unresistant to be corrected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 12, 2023, 05:30:21 PM",
      "body": "Quote from: Poker Player on September 12, 2023, 03:34:42 PMIf you are going to write in a forum and tell us a story that we cannot verify if it is true, no matter how many pictures you attach, you could at least summarize it better.As a summary I will tell you that, assuming what you say is true, things have been going well for you in spite of being an introvert, and not because of it. In life and in business it is better to be extroverted, without going overboard. There are only a few small fields, like mathematics for example, where being introverted can help you, or at least it is not a priori an impediment to progress. The lady's story is too fantastic but I'm going to give you the benefit of the doubt, what I'm not going to go into is commenting on it.To summarize, I don't think there is a relationship between being introverted or extroverted and the success you can have with investments you make alone with a computer. If we go on to talk about business or large investments where you are going to deal with other people, obviously it is better to be extroverted.@ dear poker player, I think you based on picking points otherwise, you will figure where I stated the computer being amongst the gifted items as also a requirement I needed in sitting on the page of my investments platform moreso, if things were going well with me I would not point at having a new computer else I would basically point at a capital. I just hope you don't get it twisted and meanwhile.... Businesses has rules on how demands could be created which is as skills.There is no legit business structure that tends to be on a low with the sake of being an extroverted but there are business hindered with the reasons of being an introvert.Buttressing on this, tell me what prove of verification you wanted and then you would have it because my intentions about my story lines was all to share an occured experience and I am confident to myself. I don't live by this with any assorted atoms of sugarcoated.I am at my willingness to adopting new ideas and learning new things as long it is profiled to make positive outcomes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "September 12, 2023, 06:00:19 PM",
      "body": "You're not going far in career and in relationships with people if you're an introvert, because all about success is focusing, in my opinion. If you're focusing on your own thoughts, as an introvert does, you'll definitely going to have a hard time with communicating properly with people, having fun with people-- generally, living outside your apartment. However, that being said, I'm not a psychologist, and I may be inaccurate-- or even completely wrong. I'm just expressing my experience with introverts.  Quote from: EluguHcman on September 12, 2023, 03:04:25 PMCome on guys let's discuss things out and get those who needed to be out of an imprisonment believing they are okay of their comfort zones.I don't think it's as easy as just saying that. In fact, I get the impression that if you ever tell to an introvert to \"get off their comfort zone\", they're going to be worse. You're just harming them at this point, they need different treatment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "September 12, 2023, 06:06:29 PM",
      "body": "Nicely done for yourself, after all, you did something you are glad about. But one thing I know is that being an introvert doesn't translate to being a fool/dullard, and there are introverted people who do great in the real world in any facet of endeavour.They could be the best marketers, gig solvers and all that, just like any other human being. And there are many extroverts that will err in their social and marketing responsibilities. When it gets to the bridge, people often cross it irrespective of their extroversion or introversion personality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 12, 2023, 06:23:28 PM",
      "body": "Quote from: EarnOnVictor on September 12, 2023, 06:06:29 PMNicely done for yourself, after all, you did something you are glad about. But one thing I know is that being an introvert doesn't translate to being a fool/dullard, and there are introverted people who do great in the real world in any facet of endeavour.They could be the best marketers, gig solvers and all that, just like any other human being. And there are many extroverts that will err in their social and marketing responsibilities. When it gets to the bridge, people often cross it irrespective of their extroversion or introversion personality.There should absolutely be no point in time necessary to trash nor fail to learning by experiences other than how literarily a similar situation would want to convince you. Stick to what works for you .@  EarnOnVictor, I clearly aired it out that \"being and introvert doesn't tag an error or faulty\" but \" as where it stands to hinder your chances to succeed to your successfulness is where the negative lies\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "September 12, 2023, 06:57:18 PM",
      "body": "Actually, introverts have a hard time earning their money, as they lack social skills to build an efficient network of contacts and to be popular on their social medias, what is a must nowadays for almost every professionals. Without digital marketing, you don't highlight yourself on your career. Therefore, there isn't money to invest and there are no Bitcoins on the pocket... That is the problem.There is so much romance and idolism over introverts nowadays, as it was a proof of being a strong person who is able to live by himself, but in fact it's a very miserable existence, full of emptiness and loneliness, besides the negative effects mentioned on this thread regards the professional aspect of the individual's life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "September 12, 2023, 07:29:33 PM",
      "body": "Quote from: EluguHcman on September 12, 2023, 03:04:25 PMNow I am about to make my dream to BTC investment a reality as I am about to lunch a purchase of 0.20 BTC worth a $5,217.8 value at now. I am up getting to a greater height my fellow investors.For someone who is about to make such a huge bitcoin purchase, it’s surprising to me that  you could not afford a $500 laptop, the excitement you show about a pair of slippers from your girlfriend makes me wonder if this story has any substance. Quote from: EluguHcman on September 12, 2023, 03:04:25 PMI want to ask, are you one of this introverts? Why and how did you become one?Is it as a result of being molested or a result of parental and guidance?Things you must know about being an introvert on the business sector>>>* Do you know if you are an employee and your company needed a presentative you would not be. Considered if you are one of the introverts and could also cause you a setback or delays to promotions?.Do you know that most crashed business is a result of inability to socialize and set a literarily public campaigns?Do you know that your inability to speak could earn you a missed lottery ticket?Do you know that your introvertial lifestyle could earn you a defenceless?Come on guys let's discuss things out and get those who needed to be out of an imprisonment believing they are okay of their comfort zones.Now this is no longer a topic for bitcoin discussion. There are jobs like computer programming that are more suited to an introvert personality while there are jobs like sales and marketing that extroverts easily excel in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "September 12, 2023, 07:46:42 PM",
      "body": "I'll be honest, it seemed like a rather strange story to me, all that talk about introverts and I didn't understand what I actually meant.  You added photos that don't bring value to the text and finally you talk about this lady, but I would like to understand one thing: you explained this story to us but exactly should we be interested?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "September 12, 2023, 07:59:38 PM",
      "body": "Quote from: bitmover on September 12, 2023, 03:45:08 PMQuote from: Poker Player on September 12, 2023, 03:34:42 PMIfTo summarize, I don't think there is a relationship between being introverted or extroverted and the success you can have with investments you make alone with a computer. If we go on to talk about business or large investments where you are going to deal with other people, obviously it is better to be extroverted.Fully agree. While investing you don't need to interact with other people, so it just doesn't make any real difference. Talking to a lot of different people when making investment decisions is usually bad, because other people have different goals and different necessities. So usually we get bad adviceAlso, it would really be making your mind be boggled up with things specially if you do hear out different sentiments or approach by other people which you would really be trying out to make some comparison into your own then it would really be that tough for you to have on a fix decision because you are really that being influenced by others suggestion or ideas which will really be changing up your plans too. Im not saying that its bad to hear out others ideas but its not really necessary for you to follow. Nothing beats out if you do really make out such investment decision or step according into your own approach and analysis. Its true that it doesnt really need for you to meet up or having talks with lots of people in regarding about investment decisions because you could eventually do such thing without them and also having your own and following through it would be always advisable or something that i do prefer so that in case if it do end up negative then you wont really be having that kind of regret deep inside.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "September 12, 2023, 11:48:28 PM",
      "body": "Quote from: EarnOnVictor on September 12, 2023, 06:06:29 PMNicely done for yourself, after all, you did something you are glad about. But one thing I know is that being an introvert doesn't translate to being a fool/dullard, and there are introverted people who do great in the real world in any facet of endeavour.-snip-An Introvert is just the psychological state of someone who has been alone, does not like crowds and tends to focus on what he is doing, and has a strong imagination. Introvert does not reduce intelligence, even an introvert I know is more intelligent and has many followers on social media but with anonymous accounts.A successful trader can also be an introvert but have vast knowledge because they are focused and really study the crypto market well. Quote from: Pokapoka124 on September 12, 2023, 07:29:33 PM-snip-Now this is no longer a topic for bitcoin discussion. There are jobs like computer programming that are more suited to an introvert personality while there are jobs like sales and marketing that extroverts easily excel in. It seems that Too OP is deviating from the discussion of Bitcoin and Introverts.  The work of an introvert is almost the same as people in general. If we talk about Bitcoin, being a good trader, investor, crypto advisor, and bitcoin marketer. an introvert can do without identity. they move anonymously. I know some people whose lives are not very prominent and always alone but they have a big impact.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "September 13, 2023, 05:42:24 AM",
      "body": "Introvert is introvert where extrovert is extrovert, both of them will need to communicate with other people except you're have antisocial disorder. Introvert doesn't mean they can't become a good public speaker, motivator, comedian etc that need to meet a lot people, they only put them as a professional/job/career even though it's not their passion.After all either introvert, extrovert or even an antisocial disorder can invest in Bitcoin and become successful as long as they have a lot money and diamond hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Afnan_faizah",
      "created_time": "September 13, 2023, 06:13:08 AM",
      "body": "I think I am an ambivert but now I become introvert for a while as there are too many bad influence that I get from my friends when I become an extrovert. I have chosen the wrong friends. I need to purify my self for awhile. As a person who know how to become an introvert and extrovert, I think it's not a significant factors which will influence our investments result. I studied business management at university and there I also learn about business communication, whether we introvert or not, the most important thing is we know how to communicate with people. it is part of human relationship skill which every manager need to have this skill. so I think it doesn't matter if we introvert or not, the most important thing is we have to learn and acquire all required skills in our field. also we need to choose the right friends which will help us to success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "September 13, 2023, 07:09:58 AM",
      "body": "Quote from: taufik123 on September 12, 2023, 11:48:28 PMQuote from: EarnOnVictor on September 12, 2023, 06:06:29 PMNicely done for yourself, after all, you did something you are glad about. But one thing I know is that being an introvert doesn't translate to being a fool/dullard, and there are introverted people who do great in the real world in any facet of endeavour.-snip-An Introvert is just the psychological state of someone who has been alone, does not like crowds and tends to focus on what he is doing, and has a strong imagination. Introvert does not reduce intelligence, even an introvert I know is more intelligent and has many followers on social media but with anonymous accounts.A successful trader can also be an introvert but have vast knowledge because they are focused and really study the crypto market well. Quote from: Pokapoka124 on September 12, 2023, 07:29:33 PM-snip-Now this is no longer a topic for bitcoin discussion. There are jobs like computer programming that are more suited to an introvert personality while there are jobs like sales and marketing that extroverts easily excel in. It seems that Too OP is deviating from the discussion of Bitcoin and Introverts.  The work of an introvert is almost the same as people in general. If we talk about Bitcoin, being a good trader, investor, crypto advisor, and bitcoin marketer. an introvert can do without identity. they move anonymously. I know some people whose lives are not very prominent and always alone but they have a big impact. There is absolutely no necessity room for me to argue towards this topic relating how to an introvert in the business sector and as a thought to behold about emphasizing directly on Bitcoin. Meanwhile... It was clearly stated that being an introvert doesn't really mean one exhibits an error not even on the wrong track but at a situation where it has you a set back lacking the aid to speak out or when it is necessary to indulge on a social activities that is supposed to bring your investment a growth is where the problems lies.Apparently I am sure of adapting to new ideal at where necessary.I sometimes had a thread titled \" Learn to unlearn and unlearn to learn\". This is about not being to relaxed with the knowledge in you hoping it has the best amongst all so, it is advisable letting go what you think was best learnt when you finds a better knowledge.I am at my utmost submissions in learning and if by means this topic was not supposed to be on this Bitcoin Discussion forum, please I tends to appeal for move of motion to a suitable forum where this topic is best fit in here within around Bitcoin talk. I appreciates every one contributing effortfully on this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}