{
  "id": "topic_5408816",
  "title": "Vvang",
  "author": "Vvang",
  "created_time": "August 05, 2022, 12:06:25 PM",
  "content": "I am confused right now,  I did some research on the solana hack I I came to understand that slope wallet is the main issue, my question is why are wallets backing up users recovery phrases in a log file? Yeah it got compromised somehow that's how hackers get those files but why in the first place is wallet doing this? Are other wallets like this?...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408816",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "August 05, 2022, 12:12:38 PM",
      "body": "Quote from: Vvang on August 05, 2022, 12:06:25 PMmy question is why are wallets backing up users recovery phrases in a log file? Yeah it got compromised somehow that's how hackers get those files but why in the first place is wallet doing this? Are other wallets like this?...I'm not into that altcoin (actually I care only of 1-2 altcoins), so I don't know about that altcoin and that particular wallet.But you have to keep in mind that the newer the altcoin, or the wallet, or whatever software is, the more likely to have bugs or even logic errors.Now to your question: logging recovery phrases is clearly a newbishly stupid mistake, I expect that the vast majority doesn't do that. Bitcoin Core and Electrum don't do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "August 05, 2022, 12:19:22 PM",
      "body": "Quote from: Vvang on August 05, 2022, 12:06:25 PMI am confused right now,  I did some research on the solana hack I I came to understand that slope wallet is the main issue, my question is why are wallets backing up users recovery phrases in a log file? Yeah it got compromised somehow that's how hackers get those files but why in the first place is wallet doing this? Are other wallets like this?...I don't follow this accident on Solana but \"why are wallets backing up users recovery phrases in a log file\" means you don't own keys of your wallet.The wallet has a backup (recovery phrase) of your wallet and it is terrible. It means at least two entities own wallet keys: you and that wallet company. Do you think they won't do scam exit and steal all your money?A good wallet to use is a non custodial wallet:You are the only entity to own your wallet key.That wallet software does not own your wallet key in any format (log file, wallet file etc.)Even with non custodial wallet, to increase your safety, you should turn off Internet connection before creating a wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ketesnuko",
      "created_time": "August 05, 2022, 01:10:36 PM",
      "body": "Wallet recovery seed stored in a log file? If that doesn't turn you off I don't know what will, this shows that this wallet sucks, even if the team behind the wallet are loyal their ways of handling security sucks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "August 05, 2022, 01:52:40 PM",
      "body": "QuoteOn Thursday morning, Otter, a security firm focused on Solana, reported that the Slope’s wallet app sent out users' seed phrases to a centralized server. Slope hired this server from a company called Sentry. It added that seed phrases passed to Slope's server were saved in the form of readable text. Since the phrases were not encrypted, anybody with access to this specific Sentry server could potentially access users’ private keys. The low security standard likely led to the breach giving hackers the ability to acquire the seed phrases and drain funds.https://www.theblock.co/post/161425/slope-wallet-provider-saved-user-seed-phrases-in-plain-text-solana-security-researchers-findThis wallet have very bad security since they save the seed phrases on plain text and were not encrypted, if hacker can find the vulnerabilities of the server, he can get the seed phrases very easy. More offer this is a web wallet where it's have higher chance to get hacked.Did other wallet will do same like this one? Yes, especially to those web wallet that didn't care with their security. That's why you need to use hardware wallet or air gapped wallet to prevent this kind attack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoATM",
      "created_time": "August 05, 2022, 02:10:52 PM",
      "body": "I am not surprised, many new projects like exchanges and wallets are growing this days and many of them don't know what they are doing, the majority aren't even qualified personal but most investors don't care, I have a reason for using trust wallet and that's because its from binance exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 05, 2022, 02:21:18 PM",
      "body": "Quote from: Vvang on August 05, 2022, 12:06:25 PM-snip-my question is why are wallets backing up users recovery phrases in a log file? I think it's used to remember login credentials or when authorization permissions to third party apps are enabled.Quote from: Vvang on August 05, 2022, 12:06:25 PMYeah it got compromised somehow that's how hackers get those files but why in the first place is wallet doing this? Are other wallets like this?...Generally, the app will create a separate log file in a special folder elsewhere.I don't know where you got this information from, if it's true then it means they have the most vulnerable security system for a crypto wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FirmWars",
      "created_time": "August 05, 2022, 04:27:17 PM",
      "body": "Very soon people will be more friendly with hardware wallets wether they like it or not, no one will have peace of mind holding tokens and coins in any wallet except hardware wallets and truth be told, nothing beats hardware wallets, better use 200$ to buy hardware wallet or risk losing 1000$ worth of token in such manner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "August 05, 2022, 04:43:08 PM",
      "body": "https://nitter.net/Zellic_io/status/1554936143220617216Quote from: https://twitter.com/Zellic_io/status/15549361432206172161/ First, the following theories are considered very unlikely and entirely rejected: - issues in Solana core- issues in SPL token- crypto issues (e.g. weak RNGs)- widespread user devices compromise- supply chain (compromised libraries)2/ In the war room, we first hypothesized that wallets may be leaking mnemonics or private keys to Sentry.After further investigation with the community, this is what we found:3/ First, let's talk about Sentry.Sentry is an event logging platform used for reporting errors in apps.If a certain event occurs in the app, a request containing the details & environment is logged to the company's Sentry.Many companies use Sentry on websites & mobile.4/ The Slope Wallet for iOS and Android uses Sentry for event logging.Any interaction in the app would trigger an event log.Unfortunately, Slope didn't configure Sentry to scrub sensitive info. Thus, mnemonics were leaked to Sentrys/o to @sniko_ for this screenshot: https://pbs.twimg.com/media/FZQ-MU6VQAAHh0a?format=jpg&name=4096x40965/ However, Slope has been using Sentry for only 1 week now.**Hypothetically**, an attacker *with access to Sentry* could go through event logs and steal the thousands of mnemonics leaked in the past weekThen drain thousands of wallets.~https://nitter.net/osec_io/status/1555087555351420928Quote from: https://twitter.com/osec_io/status/1555087555351420928We have independently confirmed that Slope’s mobile app sends off mnemonics via TLS to their centralized Sentry server. -These mnemonics are then stored in plaintext, meaning anybody with access to Sentry could access user private keys.-Slope has been very helpful in sharing data related to the hack. We received the database 4:45 PM UTC August 3rd and immediately began our investigation. The Sentry logs spanned between July 28th and August 3rd.-Approximately 1,400 of the addresses in the exploit were present in Sentry logs. Notably, this does not account for all the hacked addresses. We are still investigating this discrepancy and possible other vectors.-Over 5,300 private keys which were not a part of the exploit were found in the Sentry instance. 2,358 of these addresses have tokens in them. If you used Slope, PLEASE MOVE YOUR FUNDSQuote from: Vvang on August 05, 2022, 12:06:25 PMmy question is why are wallets backing up users recovery phrases in a log file? Yeah it got compromised somehow that's how hackers get those files but why in the first place is wallet doing this?It is because Slope Wallet is a shitty wallet. The fact it's closed-source should be enough reason to stay away from those kinds of wallets.And to be precise, the wallet does not back up the seed phrase into a log file, instead, it is undue diligence from their developer to not put enough effort to wholly comprehend what the freaking third-party software(Sentry) does into their app. As in result, users' funds are stolen.Considering the two referenced Twitter accounts, which is a blockchain audit companies, does indeed indicate the main issue, an interesting take is this:Quote**Hypothetically**, an attacker *with access to Sentry* could go through event logs and steal the thousands of mnemonics leaked in the past weekUser seed phrases are logged into the log file which is being sent into a centralized server ownedmanaged by Slope. By that fact, who else could access and compromise the main issue of a leaked seed phrase?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "August 05, 2022, 07:20:43 PM",
      "body": "I haven’t gotten Solana yet and infact there aren’t any Altcoins owned by me personally reasons but why aren’t people just consistent with more renounced exchange like Trust wallet (I know no exchange is completely safe but you better off with them) Altcoins has resulted into the use of several exchanges that can just fit into the particular coin people want to purchase this and more reasons has made it a no go area for me yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lousie9",
      "created_time": "August 05, 2022, 11:11:30 PM",
      "body": "I also have never found a wallet that is really safe because any crime can be committed if they want especially with some third party wallet companies then all of them are very vulnerable to crime so when we decide to invest in crypto then we are 50% willing to lose money. Therefore  the most important thing is to choose a wallet company that has clear people in it so that when something happens they can be held accountable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inanilujimi",
      "created_time": "August 06, 2022, 07:41:20 AM",
      "body": "Maybe they want to secure our wallets if something happens like lost phrases and ask them to be able to return the phrase, but it's a bit strange with this kind of thing, maybe they really want to sabotage as if it was an accident, but actually this is all slope itself .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "August 06, 2022, 11:30:53 AM",
      "body": "Quote from: inanilujimi on August 06, 2022, 07:41:20 AMMaybe they want to secure our wallets if something happens like lost phrases and ask them to be able to return the phrase, but it's a bit strange with this kind of thing, maybe they really want to sabotage as if it was an accident, but actually this is all slope itself .I would say it's just an excuses and it's really a bad idea to do that in order to recover someone coins. Honestly I don't really believe if it's a hacker who hack their database, what if Slope team is the one who steal the coins and act like if they got hacked? Who knows. Trust is the main role here, if you can't trust Slope team is really genuine and trustworthy, it's better to use better wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "August 06, 2022, 11:56:15 AM",
      "body": "Quote from: Vvang on August 05, 2022, 12:06:25 PMI am confused right now,  I did some research on the solana hack I I came to understand that slope wallet is the main issue, my question is why are wallets backing up users recovery phrases in a log file? Yeah it got compromised somehow that's how hackers get those files but why in the first place is wallet doing this? Are other wallets like this?...Obviously, that shouldn't be the case, no mnemonic phrase should be save anywhere in the internet, not in a 3rd party centralized server. And so this is the biggest mistakes that the Slope wallet developer or who ever is in charge, it's clearly negligence on their part. So that is the answer to your question, no, wallet backups should not be in any log file. Majority of us go into writing it and keeping it safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "August 06, 2022, 12:06:30 PM",
      "body": "Quote from: Vvang on August 05, 2022, 12:06:25 PMI am confused right now,  I did some research on the solana hack I I came to understand that slope wallet is the main issue, my question is why are wallets backing up users recovery phrases in a log file? Yeah it got compromised somehow that's how hackers get those files but why in the first place is wallet doing this? Are other wallets like this?...If you need secure storage, then use hardware wallets. They are configured without connecting to a computer and your seed phrase is safe. Mobile wallets are not secure and are the most vulnerable to hacking. For solana, you can use a ledger or trezor, they are compatible with the defi ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "August 06, 2022, 02:01:23 PM",
      "body": "Quote from: zasad@ on August 06, 2022, 12:06:30 PMQuote from: Vvang on August 05, 2022, 12:06:25 PMI am confused right now,  I did some research on the solana hack I I came to understand that slope wallet is the main issue, my question is why are wallets backing up users recovery phrases in a log file? Yeah it got compromised somehow that's how hackers get those files but why in the first place is wallet doing this? Are other wallets like this?...If you need secure storage, then use hardware wallets. They are configured without connecting to a computer and your seed phrase is safe. Mobile wallets are not secure and are the most vulnerable to hacking. For solana, you can use a ledger or trezor, they are compatible with the defi ecosystem.Or maybe an air-gap wallet could also be a good options for us. Regarding the question about the Slope wallet, yes they are to liable. Although they said that they are cooperating with Ottersec to collect all data so that they can make a post mortem report.They even have an address now for the hackers if ever they decided to return and get the bounty they offered (I doubt it though). So maybe there could be people who can monitor this wallet: DyQ96GwjkHkGSzYEB4NaPk2NxsXyRTMNHKJQd3fziABfhttps://twitter.com/slope_finance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}