{
  "id": "topic_5449086",
  "title": "cygan",
  "author": "cygan",
  "created_time": "April 16, 2023, 09:22:31 PMLast edit: May 18, 2023, 09:58:50 AM by cygan",
  "content": "Autor: fillipponeOriginal Thema: Securing Your Seed Phrase with WashersEinleitungDie Verwahrung der Seeds ist ein Thema, das mir schon immer am Herzen lag. Bitcoin ist ein System, das zum ersten Mal die Verantwortung für die finanzielle Souveränität in die Hände der Nutzer legt. Diese Eigenschaft birgt ein komplexes Gleichgewicht von Chancen, aber auch Risiken, da der Bitcoin von Natur aus ein Inhabermedium ist. Das Eigentum an einem Bitcoin gehört der Person, die eine Transaktion mit dem entsprechenden privaten Schlüssel digital signieren kann - keinem anderen Subjekt. Ob Person, Institution oder Bot, wer immer den privaten Schlüssel kontrolliert, kontrolliert die Bitcoins.Das bedeutet, dass die Verwahrung von Bitcoin von grundlegender Bedeutung ist, wenn es um die tatsächliche Möglichkeit geht, Transaktionen zu unterzeichnen, und um die Möglichkeit gegenwärtiger oder zukünftiger negativer Ereignisse persönlicher, sozialer oder technologischer Art, denen jeder Bitcoiner innerhalb weniger Jahre begegnen kann.Bei der Entscheidung für eine Speicheroption müssen technologische, persönliche und rechtliche Gefahren berücksichtigt werden:Einen umfassenden Leitfaden für die Wahl der Art und Weise, wie Sie Ihre Seedphrase sichern, finden Sie in diesem neuen Artikel, ebenfalls von Jameson:So sichern Sie eine SeedphraseDas Wichtigste ist natürlich, dass Bitcoin die im traditionellen Finanzwesen ausgeschlossenen Optionen der Selbstverwahrung ermöglicht. Dies ist ein einzigartiges Merkmal, das Bitcoin Besitzer in verschiedenen ungünstigen Szenarien, die in einigen Jahren leider immer häufiger vorkommen werden, unterstützt.Das Problem ist, dass die Selbstverwahrung komplex ist, und die Menge der verlorenen Bitcoins ist eine Warnung für alle, die diesen Weg gehen wollen: Herausforderungen nehmen die unterschiedlichsten Formen an.Ich recherchiere schon seit einigen Jahren zu diesem Thema, und einer der ersten Artikel, der meine Neugierde weckte, war:Satoshis an künftige Generationen verschenkenQuoteKürzlich wurde ich damit beauftragt, einem neugeborenen Baby einige Satoshis zu schenken, die es einlösen soll, wenn es erwachsen ist, also in etwa 18 Jahren. Die Herausforderung war kniffliger als ursprünglich erwartet, da es viele verschiedene Möglichkeiten gibt, Bitcoin zu speichern, jede mit unterschiedlichen Kompromissen. Gleichzeitig ist es schwer, den Zustand der Bitcoinindustrie in zwei Jahrzehnten vorherzusagen.Beim Lesen dieses Artikels wurde mir klar, dass die Verwahrung eines privaten Schlüssels in einer physischen Brieftasche einige unbestreitbare Vorteile hat:Unabhängigkeit von der technologischen Entwicklung im Bereich der Wallets/IT-UnterstützungSicherheit in Bezug auf den Verfall der physischen Unterstützungdie Benutzerfreundlichkeit für den Empfänger meines Geschenks.Beim Stöbern im Internet fand ich dann eine Seite auf der Website von Jameson Lopp, einem bekannten Cypherpunk und Sicherheitsexperten, auf der er verschiedene Metal Seed Lagerungen getestet hat:Stresstest für Metall Bitcoin Seed LagerungIn der ersten Testrunde erregte vor allem eines meine Aufmerksamkeit, denn es war die erste Umsetzung der Idee, den Seed auf Unterlegscheiben zu stanzen, durch SAFU Ninja:SAFU Ninja BerichtDie brillante Idee wird im Blog beschrieben:Günstige und einfache DIY Metall Bitcoin Seed Lagerung - Safu NinjaDie Innovation besteht darin, den Lagerung mit Teilen einzurichten, die man leicht in einem typischen Baumarkt findet, um den Seed zu stanzen.Der kritischste Teil der Arbeit war das Stanzen der Buchstaben auf die Unterlegscheiben, was sich als ziemlich langwieriger und anstrengender Prozess herausstellte, der nicht immer perfekte Ergebnisse lieferte, wenn er freihändig durchgeführt wurde.Deshalb haben einige Tüftler eine Vorrichtung entwickelt, die die richtige Ausrichtung, Trennung und den korrekten Stanz der Buchstaben erleichtert.Die berühmteste Vorrichtung ist von Cryptocloacks.Mit dieser Vorrichtung können die Buchstaben mit korrekten Abständen und Positionierungen gestanzt werden.Die n0nce Vorrichtung ist auch auf bitcointalk.org erhältlich.n0nce's Stahlunterlegscheiben SicherungsvorrichtungDer Vorteil dieser Vorrichtung ist ein doppelter: Erstens ist das Projekt modular aufgebaut. Daher ist es an verschiedene Größen der Unterlegscheiben anpassbar (das Projekt wurde entwickelt, um größere Unterlegscheiben zu bestanzen) und vor allem an die verschiedenen Abmessungen der Stanzen.Zweitens hat n0nce ein verbessertes Design der Blockmit Vorrichtung entwickelt, sie in mehreren Teilen verstärkt und die Erfindung mit kleineren Toleranzen versehen, um das mechanische Spiel zwischen den Komponenten zu verringern.Im weiteren Verlauf des Leitfadens werde ich die n0nce Vorrichtung verwenden, aber der Vorgang ist derselbe. Im Anhang werden wir schließlich die Unterschiede zwischen den beiden Projekten im Detail analysieren.Wie Federico Tenga richtig feststellte, birgt die BIP39-Norm \"Veralterungsrisiken\" und vor allem Risiken aufgrund des verwendeten Ableitungspfads. Aus diesem Grund hat er in seinem Test das WIF-Format verwendet.Obwohl ich seine Bedenken sehr gut verstehe und teile, habe ich mich entschieden, das üblichere BIP39-Format anstelle der ersten Iteration dieses Projekts zu verwenden. Ich glaube, dass es ein besseres Risiko-Nutzen-Verhältnis in Bezug auf die praktische Möglichkeit der Wiederherstellung durch den Empfänger der Nachricht darstellt. Nichts hindert Sie daran, den Schlüssel in diesem Format auf den Unterlegscheiben zu hacken: Es handelt sich um eine Zeichenkette von 51 Zeichen, so dass Sie nur sieben Unterlegscheiben benötigen würden.Im Internet hat econoalchemist den gesamten Prozess als Erster beschrieben:Sicherung eines Bitcoin Seeds in Unterlegscheiben aus Edelstahl (gekürzt)Was soll ich sagen? Er ist ein super cooler Typ. Ein kompletter Test mit einer Lötlampe! Ich strebe nicht so viel an und begnüge mich damit, die Beständigkeit der Unterlegscheiben gegen Brandkorrosion und Druck auszudrucken, was ich möglicherweise tun könnte. Ich fürchte, es würde sich nicht wesentlich von den Tests von econoalchemist und Lopp unterscheiden.[OBEN]EinkaufslisteWie bereits erwähnt, besteht der Vorteil des Unternehmens darin, dass es leicht verfügbare Teile verwendet. Diese Wahl hilft sicherlich, ein gewisses Maß an Sicherheit durch Unklarheit zu haben, da niemand jemals wirklich wissen wird, was Sie tun. Wie im Safu-Leitfaden direkt vorgeschlagen wird, sollten Sie, wenn Sie etwas Geeignetes zu Hause haben, dieses verwenden, ohne es zu kaufen. Wenn Sie jemanden kennen, der diese Stanzen bereits besitzt, leihen Sie sie aus, indem Sie sagen, dass Sie Schlüssel ausstanzen müssen, anstatt sie zu kaufen (erwähnen Sie natürlich niemals Bitcoin).Nehmen Sie diese Modelle als Anregung:UnterlegscheibenUnterlegscheiben mit einem Außendurchmesser von 24 mm, einem Innendurchmesser von 8 mm und aus rostfreiem Stahl sind ausreichend. Sie sind in jedem Baumarkt erhältlich. Vierundzwanzig Unterlegscheiben werden für den Schlüssel und vier Unterlegscheiben für die zusätzlichen Sicherheitsvorrichtungen benötigt. Rüsten Sie sich mit vielen zusätzlichen Unterlegscheiben aus, um mit Versuchen und unvermeidlichen Fehlern fertig zu werden.Ich empfehle, dass sie aus rostfreiem Stahl hergestellt werden. Die korrosionsbeständigsten Stähle sind 304 und 321.SchraubeWir brauchen eine 60-mm-Schraube mit einer Mutter, die einen Durchmesser von 8 mm hat (die Aufmerksamsten werden bemerkt haben, dass der Durchmesser der gleiche ist wie der der Unterlegscheiben!)Auch in diesem Fall ist das zu wählende Material rostfreier Stahl.VorschlaghammerSie brauchen einen Vorschlaghammer. Ein Hammer reicht nicht aus, da das Gewicht genug Kraft aufbringen muss, um die Unterlegscheibe richtig zu prägen. Auch hier gilt: nicht zu kompliziert.AmbossWer hätte gedacht, dass Ihre Leidenschaft für Bitcoin Sie dazu bringen würde, einen Amboss zu kaufen!Angesichts der Stärke, die für den korrekten Stanz der Unterlegscheiben erforderlich ist, brauchen Sie eine stabile Unterlage, die durch die vielen Schläge nicht beschädigt wird. Dieser kleine Amboss von 1 kg, der kleinste, den ich gefunden habe, ist die perfekte Lösung für Sie.Natürlich ist größer besser, aber wenn Sie die Euros sparen wollen, können Sie die glatte Seite eines anderen Schlägers oder eine Metallunterlage verwenden. Wichtig ist, dass die Fläche groß genug ist, um eine gute Stabilität der Vorrichtung und die vom Schläger ausgeübte Kraft zu gewährleisten - eine Frage der Vorliebe. Ich muss jedoch sagen, dass ich diesen Mini-Amboss sehr bequem und für die Arbeit geeignet fand.StanzenBei den Stanzen habe ich mich für den folgenden 6-mm-Stanzsatz entschieden: Es handelt sich um einen Satz mit 36 Zeichen, allen Buchstaben, Ziffern und dem Zeichen \"&\". Die Qualität ist gut, und die Dimensionierung der Stanzen ist angemessen. Ich habe bei der Verwendung keine Mängel festgestellt, und die Stanzqualität hat sich während des gesamten Prozesses nicht verschlechtert.SicherheitsetikettenEs handelt sich dabei um Klebeetiketten, die nach dem Anbringen brechen und einen Abdruck auf der Oberfläche hinterlassen.Zum Verschließen des Behälters benötigen Sie Sicherheitsetiketten, die beim Öffnen eine Spur hinterlassen. Sie müssen einzeln nummeriert werden, um die Seriennummer in die Unterlegscheiben zu drucken.Hermetischer BehälterWir wollen die Seed aus ästhetischen Gründen in einen luftdichten Behälter legen und seine Unversehrtheit sicherstellen. Ich habe diesen in einem schönen Bitcoin Orange gefunden. Der Innendurchmesser beträgt unter anderem 25 mm und ist somit ideal für die Aufnahme unserer Unterlegscheiben geeignet. Wenn Sie sich für einen anderen Behälter entscheiden, vergewissern Sie sich, dass der Durchmesser und die Länge des Innenraums ausreichen, um Ihren Seed unterzubringen.An diesem Punkt ist die Vorbereitung fast abgeschlossen.Nachstehend finden Sie eine Übersicht über alle erforderlichen Materialien.Sonstiges diverses MaterialEin Paar Handschuhe.Heißklebepistole und Klebestift. Zum Versiegeln der Unterlegscheiben.Runde Etiketten für Sicherheitssiegel.Der private Schlüssel im BIP39-Format.Unauslöschlicher Marker.Im Folgenden finden Sie eine vorläufige Zusammenfassung aller möglichen Kosten (ohne Zeitaufwand):Unterlegscheiben+Schraube+MutterEUR 3,00 (Verkauft nach Gewicht)Blockmontagevorrichtungkostenlosn0nce VorrichtungEUR 30,00VorschlaghammerEUR 12,99AmbossEUR  9,90StanzenEUR 28,79Sicherheitsetiketten 100xEUR 12,99BehälterEUR 15,27HandschuheEUR  2,50KlebebandEUR  3,99MikrofasertuchEUR  1,00HeißklebepistoleEUR  9,50Runde AufkleberEUR  0,90Unauslöschlicher MarkerEUR  8,13GESAMTBETRAGEUR 138,96[OBEN]Stanzen, Prüfen und Versiegeln des SeedsDas Verfahren ist ganz einfach. Legen Sie die Unterlegscheibe in die Halterung ein und kleben Sie den Boden der Halterung mit Klebeband ab. Mit diesem Klebeband wird die Unterlegscheibe in der Halterung fixiert, damit sie nicht nach jedem Schlag stehen bleibt.Auf diese Weise vermeiden Sie, dass die Buchstaben in unterschiedlichen Abständen gestanzt werden, aber wenn Sie mit dem Stanz des Buchstabens nicht zufrieden sind, können Sie versuchen, ihn erneut zu stanzen, wobei sich die Zeichen vollständig überlappen. Das ist der Hauptvorteil einer Schablone: Wenn man alles freihändig macht, kann es leicht passieren, dass ein Buchstabe schlecht gestanzt wird, wenn der Stanz nicht optimal getroffen wird; mit einer Schablone hingegen ist der Stanzvorgang felsenfest, und wenn alles richtig gemacht wird, wird jeder Buchstabe gleichmäßig und fest in Metall gestanzt. Dennoch ist der Vorgang mit einer Schablone sehr einfach und wird durch das folgende Gif gut veranschaulicht:Die beiden oberen Kerben dienen zur Kennzeichnung der richtigen Reihenfolge der Wörter, während die acht unteren Kerben zum Stanzen der Begriffe verwendet werden. In der BIP39-Norm haben Wörter eine maximale Länge von 8 Buchstaben, und die ersten vier Buchstaben sind ausreichend, um sie eindeutig zu identifizieren. Sie müssen sich keine Sorgen über Datenverluste machen, wenn ein oder zwei Buchstaben nicht perfekt lesbar sind.Legen Sie die Vorrichtung auf den Amboss und führen Sie einen Schlag aus.So verfahren Sie mit allen Buchstaben und allen Wörtern.Ein Video, oder besser zwei Videos, sagen mehr als 100 Worte:Arbeitsplatz im Freien. Beachten Sie die weggeworfenen Unterlegscheiben im Vordergrund.Detail des Formprozesses.Ich rate Ihnen persönlich zu einem ruhigen Vorgehen. Ich habe etwa eineinhalb Stunden gebraucht, um alles zu stanzen. Ich habe am Anfang viele Fehler gemacht. Wenn ich alles noch einmal machen würde, könnte es weniger als eine Stunde dauern, aber ich sollte mir die nötige Zeit nehmen.Überprüfen Sie immer wieder, ob Sie die Seed richtig geschrieben haben, ob die Wörter richtig geschrieben sind und vor allem, ob die Reihenfolge stimmt.Prüfen Sie zweimal, dann ein drittes Mal. Vergleichen Sie die Daten nicht mit dem Blatt Papier, das Sie zum Drucken verwendet haben. Prüfen Sie stattdessen direkt mit der Software Wallet, um Fehler bei der Transkription des Seeds zu vermeiden. Prüfen Sie Wort für Wort, Buchstabe für Buchstabe.Setzen Sie alle Unterlegscheiben in nummerierter Reihenfolge in den Bolzen ein, und lassen Sie den nicht gravierten Teil auf derselben Seite liegen.Wenn Sie alle Seeds eingraviert haben, empfehle ich Ihnen, einige \"spezielle\" Unterlegscheiben beizulegen.Der erste Vorschlag ist, eine Notrufnummer zu stempeln.Es ist nicht sicher, dass derjenige, der das Seed zurückholen muss, unbedingt ein Bitcoin-Experte sein muss, und es ist nicht sicher, dass Sie ihr helfen, wenn sie es in Besitz nehmen will. Sie können in den Unterlegscheiben die Telefonnummer einer vertrauenswürdigen Person angeben, welche denjenigen, die Gelder wiedererlangen müssen, dabei helfen kann, dies korrekt zu tun.Sie ist nicht nur eine Person, der ich vertraue (\"Stehle nur das Minimum an Geld, das Du brauchst, um ein anständiges Leben zu führen\", habe ich ihm angedroht und ihm gedroht, jede Immobilie zu verfolgen, die er mit meinem Geld kaufen will), sondern auch ein technischer Experte, falls etwas schief geht.Ich habe die Telefonnummer auf die Vorder- und Rückseite einer Unterlegscheibe gestanzt und sie mit den Initialen P1 und P2 gekennzeichnet.Telefonnummer auf beiden Seiten der Scheibe aufgestanzt, vielleicht wäre es besser, die Ortsvorwahl hinzuzufügen!Im Vergleich zu dem, was ich gemacht habe, könnte es sich lohnen, auch die internationale Vorwahl zu gravieren (das \"+\"-Zeichen könnte mit zwei gekreuzten \"I\" gestanzt werden). Dies ist nicht so sehr für die Genauigkeit, sondern um es deutlicher zu machen, dass es eine Telefonnummer ist.Der zweite Vorschlag ist, die Seriennummern der Sicherheitsetiketten, mit denen der Behälter verschlossen wird, in das Saatgut einzufügen. Wenn die Quelle dann geöffnet wird, kann der Empfänger die Übereinstimmung der auf den Unterlegscheiben aufgestanzten Seriennummer mit derjenigen der soeben aufgebrochenen Etiketten überprüfen, um sicher zu sein, dass das Saatgut nicht manipuliert wurde. Ich habe dann zwei weitere Unterlegscheiben mit der Aufschrift XX SECURITY auf der einen Seite und den beiden Seriennummern der entsprechenden Sicherheitsetiketten auf der anderen Seite eingefügt, die ich später zum Verschließen des Behälters verwenden würde.Ungefähr so:Die Unterlegscheiben müssen die Seriennummer des Sicherheitsetiketts aufgestanzt habenRückseiteNachdem alles gestanzt war, hatte ich die folgende Ausstattung:24 Unterlegscheiben mit der Aufschrift des Seeds, eine mit der Telefonnummer für die Rückgewinnung und zwei mit den Kopien der Sicherheitssiegel.An dieser Stelle habe ich zwei weiße Etiketten mit Datum und Unterschrift versehen und auf die äußeren Unterlegscheiben geklebt. Dies ist der erste Teil der Sicherheitsmechanismen.Übersicht der Blöcke, bereit zum Versiegeln.Versiegeltes Metallgehäuse: Es ist in drei Teile geteilt, und der zentrale Körper kann nur ein paar mehr Unterlegscheiben aufnehmen als die, die wir verwendet haben.Der Block ist bereit, mit Heißkleber an beiden Enden versiegelt zu werden, wobei die Daten mit der entsprechenden Unterlegscheibe verschweißt werden. Sobald sie mit Heißkleber bedeckt sind, würden sie die Öffnung des Blocks sichtbar machen.Der Block kann nun in den Behälter eingesetzt werden, das wiederum mit den zuvor isolierten Sicherheitsetiketten versiegelt wird.Der Behälter ist bereit zum Verschließen. Zu sehen ist der Verschluss mit Heißkleber, halbtransparent ist das signierte Etikett darunter.Der verschlossene und beschriftete Behälter.Die Etiketten müssen quer zur Öffnung des Behälters angebracht werden, um beim Öffnen des Behälters wirksam zu sein. Beim Öffnen des Behälters würden die Etiketten zerbrechen, und bei der Positionierung der Etiketten würde die Seriennummer nicht übereinstimmen.Es ist eine Lösung mit Einschränkungen: Wenn ein Dieb entschlossen wäre, könnte er den gesamten Block durch einen ähnlichen ersetzen, mit ähnlichen Sicherheitsmaßnahmen (anderer Satz, andere Etiketten, andere Siegel).Es ist wichtig, dass Sie niemandem zeigen, wie Sie Ihre Seed versiegelt haben oder welche Maßnahmen Sie zum Schutz vor Fälschungen getroffen haben.Einige abschließende Tipps:Üben Sie ein wenig, bevor Sie mit dem Stanzen beginnen, um zu verstehen, wie stark Sie den Schläger beanspruchen müssen, um die Buchstaben richtig zu stanzen.Fehler sind unvermeidlich, aber gewöhnen Sie sich daran, immer zu prüfen, ob Sie es richtig gemacht haben: korrekte Positionierung der Unterlegscheibe in der VorrichtungPositionierung der Vorrichtung in der richtigen Position für die StanzungPrüfung der Stanzorientierungerfolgreiche Gravurprüfung.Die meisten Fehler, die ich gemacht habe, waren auf die falsche Ausrichtung des Stanzers zurückzuführen. Es könnte eine gute Idee sein, eine der Seiten des Zeichens (z. B. die Unterseite) mit einem Permanentmarker zu markieren, um sofort zu verstehen, wie der Stanzer in die Vorrichtung eingesetzt werden muss, um die richtige Ausrichtung des Zeichens zu erhalten. Denken Sie daran, dass das Zeichen, um korrekt gestanzt zu werden, unterschiedlich eingegeben werden muss, je nachdem, ob es für den Stanz der fortlaufenden Nummern am oberen Rand oder für den Stanz des eigentlichen Wortes verwendet wird. Gehen Sie bei der Entsorgung der \"falschen\" Unterlegscheiben mit einem Mindestmaß an Vorsicht vor. Bitte lassen Sie sie nicht offen liegen und werfen Sie sie nicht einfach weg. Wenn Sie die falsche Ausrichtung eines Buchstabens haben, ist das Wort noch lesbar, und wenn Sie viele falsche Unterlegscheiben gestanzt haben, ist der Grad der Entropie, der abgeleitet werden kann, zu hoch, um Ihren Seed sicher zu halten. Bevor Sie die Unterlegscheiben wegwerfen, stanzen Sie mehrere Buchstaben übereinander, um die Wörter unleserlich zu machen, und werfen Sie die Unterlegscheiben einzeln weg, jeweils an verschiedenen Stellen. Besser ist es, wenn du die Unterlegscheiben in etwas Schmutzigem wie Kaffeesatz oder Windeln versteckst (danke @LoyceV). Die gleichen Vorschläge sind zu befolgen, wenn du den ganzen Seed loswerden musst, auch wenn es keine sats mehr hat. Der Verlust der Privatsphäre deines Vermögens könnte auch den Verlust deiner Sicherheit bedeuten.Ich habe kein Klebeband verwendet, um die Vorrichtung am Amboss zu befestigen, wie im Originalartikel vorgeschlagen, da es ausreicht, sie mit der Hand zu halten. Das Klebeband, mit dem die Unterlegscheibe an der Vorrichtung befestigt wird, ist jedoch unerlässlich, um zu verhindern, dass sie sich beim Stanzen bewegt. An dieser Stelle empfehle ich jedoch kein doppelseitiges Klebeband, sondern normales Klebeband, sofern es stabil ist (Klebeband oder \"amerikanisches\").Achten Sie darauf, dass Sie es mit dem Heißkleber nicht übertreiben. Bei mir passen die Unterlegscheiben fast genau in den Zylinder, und wenn du es mit dem Kleber übertreibst, passen sie vielleicht nicht mehr.Es ist möglich, beide Seiten der Unterlegscheiben zu bestanzen. Auf diese Weise würde man effektiv die Hälfte der Unterlegscheiben verwenden. Auf diese Weise könnte man einen kleineren Behälter oder zusätzliche Informationen in den verbleibenden Unterlegscheiben unterbringen.Nachdem ich diese Anleitung geschrieben hatte, bemerkte ich, dass auf der Safu Ninja-Website der folgende Link zu finden war, unter dem man ein Set kaufen kann, das alles kann, was in dieser Anleitung steht.42 HODL KAPSELEs steht Ihnen frei, dies zu tun, aber aus Gründen der \"Sicherheit durch Unklarheit\" halte ich es für besser, einer obskuren Website nicht mitzuteilen, dass Sie ein Set zur Speicherung von Kryptowährungen kaufen möchten.Eine kleine Anmerkung zur Aufteilung der Seedphrase an verschiedenen OrtenDie Idee, das Seed auf verschiedene Standorte aufzuteilen, ist eine umstrittene Praxis. Daher muss jede strategische Entscheidung in dieser Hinsicht unter Berücksichtigung der Risikomerkmale in Bezug auf den Verlust des Seeds, Diebstahl oder Gewalttaten, der technologischen Erfahrung, des Zeithorizonts des Backups und der potenziellen persönlichen Eigenschaften derjenigen, die das Backup möglicherweise wiederherstellen müssen, usw. getroffen werden.Die Aufteilung des Seeds auf mehrere Standorte erhöht die Sicherheit gegen Diebstahl, macht es aber komplexer, was den Verlust der Quelle angeht. Im Falle von Multisig (z. B. 2 von 3) kann das Wissen, dass einer der Seeds kompromittiert ist, dazu beitragen, die Mittel zu sichern, ohne dass es zu spät ist, wie beim einzelnen Seed.Nehmen wir an, dieser Leitfaden konzentriert sich darauf, wie man einen einzigen Seed aufbewahrt, ohne auf die Vorzüge seiner Konfiguration einzugehen (Einzelsignatur/Redundanz/Split/Shamir's Geheimnis/multisig).[TOP]ExtrasEin Vergleich der StützvorrichtungenAls ich anfing, über diese Anleitung nachzudenken, wurde mir klar, dass das Problem darin bestehen würde, die Vorrichtungen zum Stanzen der Unterlegscheiben zu bekommen.Natürlich wäre es auch schön, wenn man dies tun könnte, ohne zu viele Adressen im Internet zu verbreiten, damit die Privatsphäre gewahrt bleibt.Also habe ich versucht, im Internet zu suchen. Ich schickte eine E-Mail über Protonmail an eine Druckerei in meiner Stadt und fügte die Blockmit-Datei als Anhang bei, und die Antwort war die folgende:QuoteHallo,Betrachten Sie die Kosten von € 30 + MwSt. mit Lieferung innerhalb von zwei Werktagen, FDM 3d Druck in ABS.Mit freundlichen Grüßen,Angesichts der Probleme mit der Anonymität und den Kosten beschloss ich, es auf einem Telegram-Kanal zu versuchen, der dem 3D-Druck gewidmet ist, wobei das Objekt persönlich übergeben wird.Glücklicherweise meldeten sich sofort zwei Nutzer.Der erste druckte mir die Blockmit-Datei kostenlos aus, weil er ein netter Kerl war und vor allem, weil er neugierig darauf war, wie ich sie nutzen würde.Der zweite Nutzer (Telegram: @liiuk99) verlangte von mir 30 Euro und begründete dies mit der besseren Druckqualität (er würde einen hochwertigeren Drucker und ein besseres Carbon-Filament verwenden).Ich beschloss, den \"professionellen\" Drucker die n0nce-Datei drucken zu lassen, um sie mit der von Blockmit zu vergleichen.Ich habe keine Erfahrung mit der 3D-Druckerei. Allerdings habe ich im Internet gelesen, und der \"kostenlose\" Drucker bestätigte, dass die Kosten für das Material vernachlässigbar sind. Ich wollte also vergleichen, ob es einen Unterschied zwischen den beiden Objekten gibt, sobald sie gedruckt sind.Leider weigerte sich der \"professionelle\" Drucker, für mich zu drucken, um einen echten Test zu machen, auch die Blockmit-Datei, so dass der Test nicht vollständig ist, aber ich denke, ich habe eine gute Idee.   Die beiden Vorrichtungen im Vergleich: die von n0nce ist sicherlich größer und robuster. Allerdings war ich auch von der Robustheit der Blockmit-Vorrichtung überrascht.Die Rückseite des Mittelteils der beiden Vorrichtungen: Beachten Sie die unterschiedliche Ausführung.Das billige Objekt ist ästhetisch \"hässlich\" und hat ein enormes mechanisches Spiel zwischen den Teilen. Ich weiß nicht, ob es an der Datei oder an der Druckqualität liegt, aber es gibt ein übermäßiges Spiel zwischen den beiden Teilen, das es nicht erlaubt, den Buchstaben genau an der gleichen Stelle zu \"stanzen\". Außerdem sitzt auch der Stanzer nicht perfekt in seiner Halterung, da er leicht schwanken kann. Und schließlich lässt sich ein einmal eingestanzter Buchstabe nicht exakt \"nachstanzen\", wenn er nicht gut geworden ist.Der Stempel, den ich aus der n0nce-Datei gedruckt habe, ist nicht nur größer (was die höheren Druckkosten teilweise rechtfertigt), sondern wirkt auch viel robuster. Es gibt nicht das geringste Spiel zwischen den beiden Komponenten oder zwischen den Komponenten und dem Stanzer.n0nce stellte die Datei mit verschiedenen Größen für die Stanzen zur Verfügung. Leider hatte ich Probleme: Trotz sorgfältiger Messung erwies sich das Loch als zu klein.Ich musste eine Vierkantfeile kaufen und das Loch so weit \"feilen\", dass der Stanzer passte. Abgesehen von der Kostenfrage war der Drucker meines Vertrauens zufällig in meiner Stadt, und der Versand wäre unerschwinglich gewesen, und vor allem hätte ich alle \"Tricks\" anwenden müssen, die ich kenne, um meine Identität nicht preiszugeben.Schließlich ist es vielleicht besser, engere Löcher zu haben und diese nach dem Druck zu feilen, als breitere Löcher zu haben, die eine korrekte und präzise Positionierung der Stanzen verhindern.Zu diesem Zweck kaufte ich eine Vierkantfeile von Leroy Merlin. Es war ein Zubehörteil, von dem ich nicht wusste, dass es existiert, aber es erwies sich als perfekt für den Zweck: Es war breit genug, um es in das Loch einzuführen und das überschüssige Material langsam abzufeilen. Die quadratische Form der Feile war wichtig, um den Spalt gleichmäßig zu erweitern. Nach etwa 30 Minuten Feilen an allen Innenwänden des Lochs hatte ich ein ausreichend großes Loch für den Stanzer.n0nce hat eine neue Datei mit einer vollständig anpassbaren Vorrichtung veröffentlicht: Das Design ist parametrisch und kann an jede Scheibe und jeden Stanzer angepasst werden. Diese individuelle Anpassung begünstigt die Wiederverwendung von Elementen erheblich. Ich denke dabei vor allem an die Spitzen, die bereits vorhanden sein sollten, ohne dass man sie passend zu den Abmessungen der Vorrichtung kaufen muss. Wählen Sie einfach die Größen (Durchmesser und Dicke der Scheiben, Abmessungen des Stanzers), um eine perfekt auf Ihre Bedürfnisse zugeschnittene Datei zu erhalten!Ich habe gut 30 Minuten mit der Feile gebraucht, um das Loch ausreichend zu erweitern. Die Vierkantfeile ist grundlegend. Das Material ist wirklich genial.Ich war überrascht von der \"Widerstandsfähigkeit\" des Materials, das sich während des Feilens nicht verformte, sondern homogen blieb und sich der Behandlung hervorragend widersetzte.Unter anderem wird sich das Loch mit der Zeit unweigerlich vergrößern und die Positionierung des Einstichs wird ungenauer.Bei meinem Test, bei dem die Passgenauigkeit sehr hoch war, hatte die Stanze anfangs sogar \"Mühe\", durch das Loch zu kommen. Aber am Ende war diese sehr locker, und auch der Nachstanz der Buchstaben war nicht mehr genau.Am Ende des Stanzvorgangs habe ich versucht, die beiden Vorrichtungen hinsichtlich der Qualität des Nachstanzs zu vergleichen.Entgegen den Erwartungen schneidet die Vorrichtung von n0nce schlechter ab als die von Blockmit. Dafür gibt es aber einen ganz bestimmten Grund.Wie Sie sehen können, ist der Nachdruck der n0nce-Vorrichtung schlechter - ein überraschendes Ergebnis. Der Vergleich ist unfair, da die n0nce-Vorrichtung während des gesamten Versuchs verwendet wurde, während der Blockmit praktisch neu ist. Das bedeutet, dass sich das Loch in der n0nce-Vorrichtung durch den Gebrauch und die Hammerschläge erheblich vergrößert hat, was ein ungleichmäßiges Einsetzen der Stanzen ermöglicht, was sich im ungenauen Druck der Buchstaben auf der Unterlegscheibe widerspiegelt. Ich habe keinen mathematischen Beweis dafür, aber ich bin mir sicher, wenn ich 24 Wörter mit der Blockmit-Vorrichtung drucken würde, wäre das Ergebnis schlechter.Mehr Ideen zum Schutz vor ManipulationenDie Versiegelung des Seeds ist eine komplizierte Angelegenheit. Mit meiner eher uneinheitlichen und handwerklichen Methode bin ich nicht zufrieden.Eine Idee könnte darin bestehen, den Behälter selbst mit einem Anti-Manipulations-Etikett zu versehen.SeedbehälterQuoteEin Plastikgehäuse zum Schutz des Seeds.So wie Sie es tun, könnte auch ein potenzieller Saboteur seinen Behälter bedrucken. Der Vorschlag ist immer derselbe: Seien Sie kreativ mit Farben, Schriftzügen und Details, die jeder kennen sollte.Eine weitere spannende Methode ist das Entropiesiegel, ein nicht kommerzieller Prototyp eines \"Zufallsentropiesiegels\".Eine ähnliche Implementierung ist die der BitBox TeP.Es gibt auch die handwerkliche Version mit einer Tüte Bohnen, Hülsenfrüchten oder anderem, wie hier von @dkbit und @o_e_l_e_o erklärt:Quote from: o_e_l_e_o on March 08, 2022, 06:40:00 PMQuote from: fillippone on March 08, 2022, 06:32:47 PMSorry, ich bin nicht schlau genug, um zu verstehen, wie das funktionieren soll. Außerdem brauchen Sie sich nicht um einen Seed zu kümmern, aber jetzt müssen Sie sich um ein Bild kümmern?Nehmen Sie einen durchsichtigen Lebensmittelbehälter aus Plastik.Füllen Sie ihn zur Hälfte mit gemischtem Reis, Körnern, Hülsenfrüchten, Samen, Konfetti, bunten Kugellagern usw.Legen Sie Ihre Seedphrase hinein.Füllen Sie den Rest des Behälters mit weiteren der oben genannten Dingen, bis sie überquillt.Drücken Sie den Deckel auf und versiegeln Sie alles fest, damit es sich nicht bewegen kann.Machen Sie Fotos von dem Behälter aus verschiedenen Blickwinkeln.Verstecken Sie den Behälter.Wenn Sie die Schachtel in der Zukunft zurückholen, können Sie die Fotos, die Sie vorher gemacht haben, mit dem jetzigen Aussehen vergleichen. Wenn jemand die Schachtel geöffnet hat, um an Ihre Samenphrase zu gelangen, haben sich alle Körner oder was auch immer Sie verwendet haben, bewegt und sehen anders aus als auf den Fotos.Eine Variation des Themas ist die Verwendung von Glitzernagellack.Sie wollen nicht, dass Ihr Laptop manipuliert wird? Fügen Sie einfach Glitzernagellack hinzuIn beiden Fällen ist das Konzept dasselbe: Man erstellt ein Zufallsmuster, das dann mit dem verglichen wird, was man vorfindet, da dies den Angreifer nicht daran hindert, auf den Seed zuzugreifen, aber zumindest gibt es einen klaren Beweis für den Diebstahl.Der Wert solcher DIY-Lösungen ist unbestreitbar. Der rote Faden dieses Leitfadens ist das Konzept der \"Sicherheit durch Unklarheit\". Beim Kauf eines \"TeP\" oder eines \"Entropiesiegels\" teilen Sie sowohl dem Hersteller als auch dem Kurier mit, dass Sie einen \"Behälter für etwas Wertvolles\" benötigen.  Stattdessen wird niemand beim Kauf von Bohnen oder Glitzer die richtigen Fragen stellen.Das Konzept ist interessant: Die Grenze liegt jedoch darin, dass es unmöglich ist, einen Manipulationssicherungsmechanismus im Objekt selbst unterzubringen, was die Lösung unmöglich macht. Perfekt wäre es, wenn es möglich wäre, im Inneren des \"Entropiesiegels\" ein Foto einzufügen, das zeigt, wie das Muster auf dem Deckel sein sollte. Stattdessen muss derjenige, der die Korrektheit des Siegels überprüfen soll, sowohl den Deckel als auch das Bild haben, um das Muster zu überprüfen, das die korrekte Entropiekorrespondenz \"bezeugt\". Das Problem besteht darin, dass es nicht immer möglich ist, ein Bild zu haben. Außerdem gefällt mir die Notwendigkeit einer App nicht: Was passiert, wenn die App eine gewisse Zeit lang nicht aktualisiert und dann aus den App-Stores gelöscht wird? Geht dann das Recht auf Überprüfung verloren?Die letzte Alternative sind Anti-Manipulations-Taschen, die ebenfalls von Shift Crypto verkauft werden.Manipulationssichere BeutelQuoteUnsere manipulationssicheren Sicherheitstaschen sind robust, aber das entscheidende Element ist das Sicherheitsband, mit dem wir die Verpackung mit ihrem Inhalt sicher verschließen können.Das Sicherheitsband enthält einzigartige Merkmale, so dass Sie jeden Versuch, den manipulationssicheren Beutel zu öffnen, schnell erkennen können.Dabei handelt es sich um Umschläge mit Siegeln, bei denen die Öffnung bzw. die versuchte Öffnung durch verschiedene Kontrollen und Markierungen erkennbar ist.Hier finden Sie eine Reihe von Links, die diese Arbeit inspiriert haben:Meine DIY-KryptostahlkapselEine Anleitung zum Selbstbau eines Behälters für den Seed.Fabrica tu mismo una billetera fría con arandelas [DEU: Bauen Sie sich eine cold wallet mit Unterlegscheiben]Ein gut gemachter Leitfaden, der eine große Inspirationsquelle für die Erstellung dieses Threads war. Er ist zwar auf Spanisch, aber ich glaube nicht, dass es nennenswerte Probleme mit dem Verständnis des Inhalts geben kann.Ich bin wirklich beeindruckt von der Qualität des Drucks in diesem Leitfaden, den ich nicht bekommen konnte - kein Grund zur Sorge, nur ästhetische Überlegungen. Wahrscheinlich muss ich einige der Tricks beim Stanzen üben.n0nce's Stahlunterlegscheibe SicherungsvorrichtungSicherheit durch Unklarheit[OBEN]SchlussfolgerungenEs hat mir großen Spaß gemacht, diesen Leitfaden zu schreiben.Ich muss zugeben, dass mir der Bastelaspekt dieser Art der Sicherung der Seedphrase gefallen hat.Ich denke auch, dass der Akt der Sicherung des Mehrgenerationenvermögens mit einem Vorschlaghammer und einem Amboss urkomisch war.Ich bin mir nicht sicher, ob diese Art der Speicherung der Seedphrase für jeden geeignet ist, denn ich denke, die richtige Kombination von Gefahren ist die folgende:Persönliche Gefahren: sehr gering. Sie müssen sich darauf verlassen, dass jemand anderes Ihr Geld zurückerhält oder der gewünschten Person hilft, das Geld zurückzuerhalten.Technologische Bedrohung: hoch. Wenn Sie sich keine Sorgen um die Technologie, die Gegenwart und die Zukunft machen würden, hätte all dies keinen Sinn.Rechtliche Bedrohung: sehr hoch. Bitcoin ist finanzielle Souveränität: Wenn Sie sich aus dem Finanzsystem ausklinken und in diesen ganzen Prozess verwickelt werden, können Sie niemandem vertrauen, dass er sich um die Verwahrung Ihrer Seedphrase kümmert.Beurteilen Sie also bitte Ihre Situation sorgfältig, bevor Sie Ihre physische Seedphrase, die durch einige Unterlegscheiben gesichert ist, mit sats füttern![OBEN]Übersetzung auf Initiative der AOBT erstellt",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449086",
  "comments": [
    {
      "author": "fillippone",
      "created_time": "April 16, 2023, 09:55:03 PM",
      "body": "Great work @cygan. Tank you for the wonderful translation. Let me know if you have any question about this, or any point I can make it even more clear. Courtesy GT translationTolle Arbeit @cygan. Vielen Dank für die wunderbare Übersetzung.Lassen Sie mich wissen, wenn Sie Fragen dazu haben oder einen Punkt, den ich noch klarer machen kann.EDIT: there are a couple of broken link on your translation, please fix thoseEDIT2: Please link my original posts somewhere as per rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 17, 2023, 08:10:08 AM",
      "body": "Ein sehr interessanter Beitrag @fillippone! Danke für die Übersetzung @cygan!Ich hätte noch eine Frage zu den Unterlegscheiben bzw. den eingestanzten Wörtern.Es ist nicht nötig, mehr als 4 Buchstaben pro Wort einzustanzen oder? Also ich meine mich zu erinnern, dass bereits die ersten Buchstaben für die sichere Identifizierung reichen (wie auch bei anderen Produkten aus dem Bereich). Hat man hier einen Vorteil, wenn man das komplette Wort einstanzt? Falls nicht, könnte man sich doch viel Zeit sparen oder?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 17, 2023, 08:55:16 AM",
      "body": "@sam00eigentlich brauchst du nur die ersten 4 buchstaben des jeweiligen seeds auf die unterlegscheiben stanzen. würde dann zb. zeit und auch die fehlerquote sparen bzw. verringern.auf github gibt es eine liste, auf der man mit hilfe der ersten vier Buchstaben jedes wort eindeutig identifizieren lassen kann:https://github.com/bitcoin/bips/blob/master/bip-0039/english.txt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 17, 2023, 09:26:54 AM",
      "body": "Quote from: cygan on April 17, 2023, 08:55:16 AM@sam00eigentlich brauchst du nur die ersten 4 buchstaben des jeweiligen seeds auf die unterlegscheiben stanzen. würde dann zb. zeit und auch die fehlerquote sparen bzw. verringern.auf github gibt es eine liste, auf der man mit hilfe der ersten vier Buchstaben jedes wort eindeutig identifizieren lassen kann:https://github.com/bitcoin/bips/blob/master/bip-0039/english.txtDann würde ich das tatsächlich auch so machen, dass ich nur die ersten 4 Buchstaben sichern würde.Beim Ledger ist es ja auch so, dass man nach jedem Buchstabe direkt nur noch die Wörter angezeigt bekommt, die in Frage kommen.Oft gibt man hier 2-3 Buchstaben ein und bekommt das richtige Wort schon aus einer kleinen Liste vorgeschlagen, wenn ich mich richtig erinnere (habe bisher erst einmal den Seed neu eingegeben.@cygan hast du dir auch schonmal deinen Seedphrase mit Unterlegscheiben gesichert oder den Beitrag \"nur\" übersetzt?Ein Erfahrungsbericht wäre auch interessant, was Kosten und Zeit angeht",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "April 17, 2023, 10:09:18 AMLast edit: April 17, 2023, 11:43:29 AM by willi9974",
      "body": "Grundsätzlich auch eine schöne Art seinen seed zu sichern, aber viele Teile die man benötigt. Wenn man alles hat was man braucht, sicherlich eine schöne Art. Ich werfe mal eine andere Art mit ins Rennen, das man eine Alternative Art und Weise sieht.Einfach die Anfangsbuchstaben in die Edelstahlplatte mit Hammer und Körner verewigen und diese sicher aufbewahren. Als Blickschutz auch in einem versiegelten Umschlag aufzubewahren, sehr sinnvoll.https://bitcointalk.org/index.php?topic=5319811.0PS: @cygan, wenn mein Beitrag nicht gewünscht ist, einfach melden, dann lösche ich ihn wieder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 17, 2023, 10:52:38 AM",
      "body": "Quote from: sam00 on April 17, 2023, 09:26:54 AM✂@cygan hast du dir auch schonmal deinen Seedphrase mit Unterlegscheiben gesichert oder den Beitrag \"nur\" übersetzt?Ein Erfahrungsbericht wäre auch interessant, was Kosten und Zeit angeht ich habe den beitrag erstmal nur übersetzt. aber vielleicht komme ich noch zu dem genuss irgendwann einen amboss zu haben damals habe ich meine ledger-seed auf der von willi9974 geposteten und auch hergestellten edelstahlplatte hinterlegtbeide optionen sehen sehr schick aus @willi9974 kannst gerne deinen beitrag hier stehen lassen - mach bitte aber das bild etwas kleiner Code:[img height=350]...[/img]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 17, 2023, 10:59:44 AM",
      "body": "Quote from: cygan on April 17, 2023, 10:52:38 AMIch habe den beitrag erstmal nur übersetzt. aber vielleicht komme ich noch zu dem genuss irgendwann einen amboss zu haben damals habe ich meine ledger-seed auf der von willi9974 geposteten und auch hergestellten edelstahlplatte hinterlegtVielleicht kann ja irgendwann hier jemand einen Erfahrungbericht posten. Eventuell kann ich das sogar übernehmen.Die zwingend notwendigen Materialen (Hammer, Amboss etc.) hätte ich. Lediglich die Stanzplatten/Stanzer fehlen mir und eine Vorrichtung zum Einklemmen der Scheiben wären praktisch.Ich hab mich gefragt, ob solche Unterlagscheiben aber auch genauso standhaft gegenüber z.B einem Hausbrand sind, wie die Edelstahlplatte von @willi9974.Bei so kleineren Scheiben hätte ich da eher die Befürchtung, dass unter viel Hitze etwas verschmilzt oder so",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 17, 2023, 11:09:56 AM",
      "body": "Quote from: fillippone on April 16, 2023, 09:55:03 PM✂Tolle Arbeit @cygan. Vielen Dank für die wunderbare Übersetzung.Lassen Sie mich wissen, wenn Sie Fragen dazu haben oder einen Punkt, den ich noch klarer machen kann.danke dir. hat etwas zeit in anspruch genommen, bis der ganze faden dann komplett übersetzt war, aber ich finde dieses thema sehr wichtig und wollte das unserer d-a-ch community nicht vorenthalten. es gibt bestimmt hier auch user, die nicht das komplette forum durchstöbern - diese sollten diesen faden dann auch nicht 'verpassen'Quote from: fillippone on April 16, 2023, 09:55:03 PMEDIT: there are a couple of broken link on your translation, please fix thoseEDIT2: Please link my original posts somewhere as per rules. both fixed!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "April 18, 2023, 01:35:55 PM",
      "body": "Wirklich eine toller Arbeit von dir, cygan. Das war bestimmt viel Arbeit. Sehr viel Text und auch viele Bilder. Ich glaube, dass ist die längste Übersetzung, die ich hier im deutschsprachigen Bereich gelesen habe.Das ist auf jeden Fall eine Alternative, um seinen Seed zu sichern. Wobei man aber wirklich darauf achten sollte, die Unterlegscheiben nicht durcheinander zu wirbeln. Ich hatte mal irgendwo dieses Link gesehen: https://robotechy.com/. Damals war der Junge 13 Jahre als und hatte damals schon den Blockmit als 3D-Druck angeboten. Schlaues Kerlchen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "April 18, 2023, 01:51:44 PM",
      "body": "Die Beilagscheiben dürfen ruhig durcheinander gewirbelt werden, denn sie sind ja mit der Nummer versehen. Jede Scheibe hat die Reihenfolge des Wortes auf der Scheibe drauf, wenn ich das richtig gesehen habe. Viele GrüßeWilli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blu3baer",
      "created_time": "April 18, 2023, 02:31:33 PM",
      "body": "super Post, das Thema interessiert mich auch schon länger.Kleiner Punkt zur Vorrichtung (3D Druck) zum Stanzen:mit 30€ bist du weit über dem was ich dafür ansetzen würde. Materialkosten und Strom bewegen sich geschätzt unter 5€. Die meisten Leute kennen bestimmt jemanden der einen 3D Drucker besitzt und das fix druckt. Wer sich nicht so glücklich schätzen kann, der kann auf so Seiten wie z.B. https://world.prusa3d.com/de nach jemanden in der Nähe suchen, der das druckt. Oder eben auf dem nächsten Bitcoin Meeting oder in einer Telegram gruppe fragen. Mehr als 10€ ist in meinen Augen aber zu viel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 18, 2023, 06:21:05 PMLast edit: May 14, 2023, 04:37:12 PM by cygan",
      "body": "es gibt auch ein deutsches crypto startup, welches diese ganze vorgehensweise mit den unterlegscheiben als gesamtpaket verkauft.dabei handelt es sich um SEEDOR welches zb. das starter set, bestehend aus: 28 unterlegscheiben, stanzset, stanzvorrichtung inkl. bodenplatte aus edelstahl, usw., für €149 anbietetbei der letzten btc22 konferenz in innsbruck hatten die jungs von SEEDOR dort auch einen stand, wo man sich selber beim stanzen üben bzw. weitere infos über die ganze materie sammeln konntehttps://www.seedor.io/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "April 18, 2023, 07:06:59 PM",
      "body": "Sieht auch interessant und professionell aus, aber dennoch für 150 Euro schon auch nicht günstig.Gibt bestimmt viele die das meiste Zubehör selbst Zuhause haben und es dann auf dem DIY Weg machen.Sieht dann nicht so toll aus, aber erfüllt auch seinen Zweck. Tolle Anregung.Viele GrüßeWilli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 25, 2023, 07:15:33 PM",
      "body": "auch wenn es hübsch aussieht und durch die bestellung, ich alles auf einmal geliefert bekommen würde, würde ich persönlich von einer bestellung absehendenn wenn ich diese bestellung absetzte, weiß zb. SEEDOR dass ich persönlich oder zumindestens jemanden kenne, der eine Bitcoin wallet hat und diese dann auf diese art und weise zusätzlich sichern möchtekauft man das ganze zubehör im baumarkt, dann bin ich mir 100%-ig sicher, dass die kassiererin keine ahnung davon haben würde, was ich damit anstelle. und wenn ich die ganzen sachen aufgeteilt auf verschiedene tage bzw. verschiedene baumärkte verteile, dann sowieso nichtaber wo ich das ganze jetzt so geschrieben habe, ist mir ein anderer gedanke durch den kopf gegangen...bei Ledger ist das doch das gleiche, wenn ich es dort bestelle, wissen sie dass ich mit cryptos direkt/indirekt was zu tun habe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 26, 2023, 06:36:42 AM",
      "body": "Quote from: cygan on April 25, 2023, 07:15:33 PMbei Ledger ist das doch das gleiche, wenn ich es dort bestelle, wissen sie dass ich mit cryptos direkt/indirekt was zu tun habeGenau so ist es aber irgendjemand weiß doch sowieso, dass du/ihr mit Bitcoin zu tun habt.Auf wie vielen Seiten habt ihr bereits KYC gemacht?Euer Internetprovider weiß genauso auf welchen Seiten ihr euch rumtreibt und sobald man irgendwie Interesse an euch findet, lässt sich das auch nicht mehr wirklich verheimlichen.Da hätte man schon von Tag 1 im Online/Crypto Bereich auf absolute Anonymität achten müssen.Die Betroffenen vom Ledger Hack wissen vielleicht zu schätzen, dass dann nicht noch eine Partei ihre personenbezogenen Daten gespeichert hat aber im Endeffekt würde man diese Unterlegscheiben ja anfertigen um ein Wallet wie den Ledger zu \"sichern\" oder nicht? Dann hat man ja sowieso schon irgendwo die eigene Adresse angegeben.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "April 26, 2023, 10:57:01 AM",
      "body": "Quote from: sam00 on April 26, 2023, 06:36:42 AMEuer Internetprovider weiß genauso auf welchen Seiten ihr euch rumtreibt und sobald man irgendwie Interesse an euch findet, lässt sich das auch nicht mehr wirklich verheimlichen.Weshalb sollte denn der Internetprovider Interesse daran haben, auf welchen Seiten ich mich rumtreibe? Oder meinst du jemand anderen mit Interesse? Quote from: sam00 on April 26, 2023, 06:36:42 AMDa hätte man schon von Tag 1 im Online/Crypto Bereich auf absolute Anonymität achten müssen.Mit Tor oder VPN möglich. Aber wer hat damals schon darauf geachtet?Generell sollte man natürlich so wenig wie möglich von sich preisgeben. Ganz ohne Daten geht es leider nicht. Und wenn, dann nur mit enormen Aufwand. Aber wer 100%-ig anonym unterwegs ist, der hat wahrscheinlich gar kein Vertrauen in den Staat mehr. Oder ist Staatsfeind Nr.1. Quote from: sam00 on April 26, 2023, 06:36:42 AMDie Betroffenen vom Ledger Hack wissen vielleicht zu schätzen, dass dann nicht noch eine Partei ihre personenbezogenen Daten gespeichert hat aber im Endeffekt würde man diese Unterlegscheiben ja anfertigen um ein Wallet wie den Ledger zu \"sichern\" oder nicht? Ich kann die Unterlegscheiben doch auch für einen Seed für ein (Offline) Software Wallet nutzen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "April 26, 2023, 11:01:39 AM",
      "body": "Quote from: bct_ail on April 26, 2023, 10:57:01 AMWeshalb sollte denn der Internetprovider Interesse daran haben, auf welchen Seiten ich mich rumtreibe? Oder meinst du jemand anderen mit Interesse?Mit Tor oder VPN möglich. Aber wer hat damals schon darauf geachtet?Generell sollte man natürlich so wenig wie möglich von sich preisgeben. Ganz ohne Daten geht es leider nicht. Und wenn, dann nur mit enormen Aufwand. Aber wer 100%-ig anonym unterwegs ist, der hat wahrscheinlich gar kein Vertrauen in den Staat mehr. Oder ist Staatsfeind Nr.1. Ich kann die Unterlegscheiben doch auch für einen Seed für ein (Offline) Software Wallet nutzen.Ich möchte einfach mal behaupten, dass jemand mit Interesse sicherlich über den Internetprovider an die Daten gelangt (besuchte Websites, IPs usw.).Genau, man hätte eben von Anfang an enorm vorsichtig sein müssen und selbst dann ist es natürlich schwierig oder mit größeren Umständen verbunden, so richtig teilzuhaben.Guter Punkt mit den anderen Wallets. Ich bin davon ausgeangen, dass so ein Offline-Wallet eher in Form eines normalen Bitcoin Wallets mit Private-Key gesichert wird und nicht mit 12-24 Wörter Seed. Aber da gibt es sicher auch unterschiedliche Produkte, bei denen die Unterlegscheiben Anwendung finden könnten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "April 26, 2023, 12:58:17 PM",
      "body": "Quote from: sam00 on April 26, 2023, 11:01:39 AMIch möchte einfach mal behaupten, dass jemand mit Interesse sicherlich über den Internetprovider an die Daten gelangt (besuchte Websites, IPs usw.).Klar. Sicherheitsorgane zum Beispiel. Stuchwort Vorratsdatenspeicherung.Ich hoffe aber, dass die dort gespeicherten Daten mehr als sicher sind. Sind bestimmt ein begehrtes Ziel. Von einem Datenschutzvorfall habe ich jedenfalls noch nichts gehört. Oder sind diese Anbieter von der Meldung ausgeschlossen?Quote from: sam00 on April 26, 2023, 11:01:39 AMGuter Punkt mit den anderen Wallets. Ich bin davon ausgeangen, dass so ein Offline-Wallet eher in Form eines normalen Bitcoin Wallets mit Private-Key gesichert wird und nicht mit 12-24 Wörter Seed. Haha. Und ich bin davon ausgegangen, dass man sein Wallet immer mit einem Seed erstellt, um mehrere Adressen zu haben. Wie in electrum zum Beispiel.Quote from: sam00 on April 26, 2023, 11:01:39 AMAber da gibt es sicher auch unterschiedliche Produkte, bei denen die Unterlegscheiben Anwendung finden könnten.Zum Beispiel als geheimen Schatz für den/die liebsten/liebste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "April 28, 2023, 12:00:18 PM",
      "body": "wie wichtig es ist, seine 12/24 seed wörter sicher aufzubewahren und für niemanden (auch in einer durchgewürfelten reihenfolge) sichtbar zu machen, hat nun der Bitcoiner Andrew Fraser bewiesen und btc-echo diesen 'vorfall' online gestellt.er hat mithilfe seiner software BTCRecover und seiner gaming-gpu innerhalb von 25 minuten eine seedphrase bestehend aus 12 wörtern hacken können und als belohnung 0.001BTC einkassiert.das ganze hatte aber einen cryptobildung charakter, denn auf twitter postete der user Wicked (@w_s_bitcoin) seine, in durchgewürfelter form, 12 seed wörter und war gespannt, wann die dazugehörige wallet 'leergeräumt' sein würde - damit sollte die aufmerksamkeit der seedaufbewahrung nochmal gesteigert werdenhttps://www.btc-echo.de/news/wallets-noch-sicher-bitcoiner-knackt-seed-phrase-in-25-minuten-163480/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}