{
  "id": "topic_5470113",
  "title": "Midas Well",
  "author": "Midas Well",
  "created_time": "October 12, 2023, 06:42:35 PM",
  "content": "Website: https://0x0.ai/Hey all, I really just wanted to get some feed back about this project and your opinions. Would you stay away or could this be worth looking into? I would like to know your opinions. I understand and will take none of this as financial advice , of course. I am just really looking for non biased opinions. Holders supposedly Earn 100% of FEES from transaction on platforms just by holding the 0x0 token. 1. AI Smart Contract Auditor 2. Coin Mixer  3. Privacy DEX Upcoming Products4. Arcane - Privacy Wallet  5. Spectre - Private spot  & private perpetual , derivatives trading 6. Decentralized Relayer System -  100k 0x0 req. to run relayer. ( Earn percentage of Transaction fees.) 7. Mosaic - Private NFT Marketplace 8. 0NS - 0x0 Name Service .... & More to comeI feel like a lot of promises are being made but interesting none the less.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470113",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 31, 2023, 11:17:32 PM",
      "body": "Quote from: Midas Well on October 12, 2023, 06:42:35 PMI really just wanted to get some feed back about this project and your opinions. Would you stay away or could this be worth looking into? I would stay awayQuoteI would like to know your opinions. I understand and will take none of this as financial advice , of course. I am just really looking for non biased opinions. No working product. You can even access the so-called DEX or Mixer.But Miraculously, the button to buy the token works. For such “a massive project” the GitHub has only 11 contributions and that was in July... LolAll they want is your ETH.QuoteHolders supposedly Earn 100% of FEES from transaction on platforms just by holding the 0x0 token.How many projects have worked this way?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "November 04, 2023, 06:55:45 PM",
      "body": "I have seen loads of people taking about this 0x0.ai project and even advices going in for people to buy and hold it, even from influential people that gives genuine calls on projects. I just got to find out that it has fees sharing policy but the challenge is that loads of other projects also share the same name as its now a thing with scammers in the space.If you want to buy it, ensure you have the direct project rather than a clone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}