{
  "id": "topic_5469606",
  "title": "nutildah",
  "author": "nutildah",
  "created_time": "October 08, 2023, 05:32:35 AM",
  "content": "There are certain physical characteristics that are common in good quarterbacks but don't necessarily have anything to do with their ability to play good football:- above 6 feet tall- strong chin / pronounced jaw- high forehead- deep voiceFor evidence, I present to you Peyton Manning, who was inducted into the Pro Football Hall of Fame in 2021, and excels in all of these areas.Height: A+ (6'5\")Chin: AForehead: A+Voice: A+Another strong contender, and quite possibly the best to ever play QB, is Tom Brady:Height: A+ (6'4\")Chin: A+Forehead: AVoice: B+In contrast, one of the worst to play the position professionally in modern times is Johnny Manziel, who ended his career with a record of just 2 wins and 6 losses:Height: B (6')Chin: DForehead: CVoice: B+Then moving on to this season, I present to you my favorite contender for an up-and-coming great career, Trevor Lawrence, of the Jacksonville Jaguars. He's only been playing for 3 seasons but I have high hopes for him based on his height & chin:Height: A+ (6'6\")Chin: A+Forehead: AVoice: AStay tuned for the next NFL QB manliness breakdown. Feel free to leave requests of QBs you want ranked.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469606",
  "comments": [
    {
      "author": "famososMuertos",
      "created_time": "October 08, 2023, 06:30:35 PM",
      "body": "Well, Ranking NFL Quarterbacks by Manliness...  Virility!... I think it's a question of cultural jargon, but I understand where your ideas are going, in any case I will give some ideas of what I think in reference to that idea...Perhaps, you are referring to those physical qualities that certain athletes must have for the expected performance in certain positions, it is like having a center of less than 2 meters in basketball, it is impossible, it would be unmanly... A notable case is perhaps the Astros player José Altuve, he is perhaps the best representation of the idea of what a major league player should not look like, seriously, this guy is one of the best players of recent times, but he does not have the \"look\" of being a big leaguer, and even less so that with his physical attitudes or his mascunality, he could achieve the hitting achievements that he has achieved.So, based on that, it is perhaps a bit strange to make a classification by Manliness for any sport, unless the idea is to demonstrate that despite enjoying that attitude, they achieve your goals, and/or otherwise, those who enjoy physical such advantages; so-called prospects, they don't make it.Having said the above:Well, there is nothing more to say about the first two, they are more than recognized for their quantitative and qualifying achievements.In fact, they have transcended so much that you may not even follow the NFL, but you recognize them, and that in some ways is a very staunch quality of the idea of your post. (right?)In my case, for some reason I don't know, of those things that are impregnated with childhood I always remember Dan Marino and Joe Montana, they are my selection. |Quarterback|Height:|Weight:|Hall of Fame (PRO)|Dan Marino  6'4\" 224 lbYesJoe Montana  6'2\" 205 lbYesNow, although we may be evaluating an aspect related to how an athlete should look according to the sport he practices, it is also true that his behavior and results can add that extra something that is not reflected in his manhood (or manliness).Then, it's the case with Johnny Manziel, seriously, how you can waste the opportunity to do something great for yourself, your family and the sport itself, and actually go against the stereotypes of the NFL sport.Because it is worth clarifying in your comment for Maziel, his performance was so bad that it was not due to his non-traditional physical aptitudes for the position, but rather mental, mediocre attitude, which plunged him into a debacle.In any case, my selection is made, but, it is not clear if it is necessary to mention the best of the past, present or future, and/or those who did not have those physical qualities and reached that status by Manliness.Anyway,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 17, 2023, 05:22:26 AM",
      "body": "Quote from: famososMuertos on October 08, 2023, 06:30:35 PMVirility!... This is interesting... I like it. I could come up with an expanded rating system that takes into account how many children a QB has sired... bonus points for having boys. However, this should probably be reserved for QBs who are already retired, as some of the young whipersnappers probably just haven't had time to get around to it yet.Quote from: famososMuertos on October 08, 2023, 06:30:35 PMIn my case, for some reason I don't know, of those things that are impregnated with childhood I always remember Dan Marino and Joe Montana, they are my selection. |Quarterback|Height:|Weight:|Hall of Fame (PRO)|Dan Marino  6'4\" 224 lbYesJoe Montana  6'2\" 205 lbYesYes, two of the greatest greats indeed. Let's rate 'em.Joe MontanaHeight: A (6'2\")Chin: A+ (just look at the depth of that cleft.. he was destined for greatness in any manly profession)Forehead: AVoice: ADan MarinoHeight: A+ (6'4\")Chin: B- (probably why he never won a Super Bowl)Forehead: B+Voice: A",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 18, 2023, 08:28:09 AM",
      "body": "OK today let's take a look at another contemporary QB... is he destined for greatness?Patrick MahomesHeight: A (6'2\")Chin: B- (goatee is a giveaway sign that a less-than-stellar-QB-chin may be hiding)Forehead: B-Voice: C (sounds a bit like Kermit the Frog)Interestingly, Mahomes is highly regarded as one of the league's premier quarterbacks. He's got moves inside and out of the pocket, precision aim, and a keen running game as well. However, our analysis suggests his career may not be long-lived. To his credit, he already has 2 Super Bowls under his belt, and 2 children as well.    Will he hold up for a decades-long career? We'll see...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 21, 2023, 08:37:15 AM",
      "body": "Let's continue our analysis of contemporary quarterbacks. Up for today we have Jimmy Garoppolo, currently of the Las Vegas Raiders. Unfortunately Jimmy has been ruled out for his next game, but I daresay the Raiders are decently happy to get him from the 49ers.Jimmy GaroppoloHeight: A (6'2\")Chin: B+Forehead: BVoice: AHe's 3-2 so far this year, and given what he has to work with, that's not bad at all.Fun Jimmy G fact: upon signing with the Raiders, he was offered free sex for life from a Las Vegas brothel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 25, 2023, 06:18:19 AM",
      "body": "Today let's take a look at a QB who helmed his team to a victory \"against all odds\" against the San Francisco 49ers... He was one of the 3 QBs who appeared in the Netflix docuseries, \"Quarterback,\" alongside Patrick Mahomes and Marcus Mariota.Kirk CousinsHeight: A (6'3\")Chin: A-Forehead: AVoice: A-Despite being an \"on-again, off-again\" quarterback, Cousins certainly has all the trappings of greatness for a star player. Of sizeable height in both stature and forehead, he looks like a man who carries around a 100+ play playbook in his cranium. Despite putting up solid number through much of career, he has yet to come close to a Super Bowl victory. We can't blame his physical characteristics for this, however; perhaps he just hasn't been given the proper arsenal of players he needs to let his true talent shine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}