{
  "id": "topic_5465010",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "August 29, 2023, 09:06:29 PM",
  "content": "We have relentlessly been discussing about bitcoin security of our wallet. Tightening the security of our data files against the backdrops of losing our bitcoin to hackers. And that awareness is something very important to every bitcoiner.Although today I want us to take a glimpse into being very cautious in balancing our risk to avoid going too extreme in the efforts to securie our bitcoin wallet so we don't end up losing the coins in the bid to tighten security, which is another form of higher risk altogether.QuoteIn July 2011, a well-known bitcoin awareness and education project lost almost 7,000 bitcoin. In their effort to prevent theft, the owners had implemented a complex series of encrypted backups. In the end they accidentally lost the encryption keys, making the backups worthless and losing a fortune.If you ask people that lost their bitcoin out of their excessive security to prevent theft of their coins you hear most of them say it's more painful to them losing their coins in that manner compared to a loss due to malware or hack. Therefore, while taking necessary range in protecting your coins in your wallet don't forget to balance the risk.Source:  Mastering Bitcoin",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465010",
  "comments": [
    {
      "author": "Adams0001",
      "created_time": "August 29, 2023, 09:18:58 PM",
      "body": "Losing such a large sum of money is bad for the company.  However, this still does not invalidate the need for using complex key passwords to protect your bitcoins from theft or hacking. You can always keep your cash safe and easily accessible to you, even if you've created a complex password key to be used to access them. This company, in this scenario, was simply unlucky and a victim of circumstance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 29, 2023, 09:25:33 PM",
      "body": "Balancing the risk is essential, and before one should consider any form of wallet security, they should first of all think of how and if they can handle the security protection measures or not.Quote from: letteredhub on August 29, 2023, 09:06:29 PMIf you ask people that lost their bitcoin out of their excessive security to prevent theft of their coins you hear most of them say it's more painful to them losing their coins in that manner compared to a loss due to malware or hack.And NO me I disagree with this one, as I can't feel more relief knowing that hackers get access to my funds and make away with them. And feel very bad that I lost access to them in the process of trying to protect them from hackers access.Knowing this, I think losing access to the encryption is better than allowing hackers to make away with the bitcoin holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "August 29, 2023, 09:25:57 PM",
      "body": "Quote from: letteredhub on August 29, 2023, 09:06:29 PMQuoteIn July 2011, a well-known bitcoin awareness and education project lost almost 7,000 bitcoin. In their effort to prevent theft, the owners had implemented a complex series of encrypted backups. In the end they accidentally lost the encryption keys, making the backups worthless and losing a fortune.Source:  Mastering Bitcoin Mastering bitcoin is more just than wallet security. To be specific: Wallet security",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "August 29, 2023, 09:33:47 PM",
      "body": "Quote from: Adams0001 on August 29, 2023, 09:18:58 PMLosing such a large sum of money is bad for the company.  However, this still does not invalidate the need for using complex key passwords to protect your bitcoins from theft or hacking. You can always keep your cash safe and easily accessible to you, even if you've created a complex password key to be used to access them. This company, in this scenario, was simply unlucky and a victim of circumstance.There is no harm in trying to be unpredictable or somewhat been tighten in your security but there are many people that have actually taken this beyond ordinary. Example is someone trying to be unique by having there own seed phrases created from words they pick out and not necessarily the wallet picking randomly from the 2048 total words, this has resulted in either easier guess of word or not been able to generate a valid phrase because of checksum errors. Another is the storage of these phrases where people have even advice of using colors for even identification by the owner, in as much as it is easy for the owner the side effect is contradicting this colors in future. So just do stuffs the easier way it is design and concentrate on storing the key in a safe place or locations",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "August 29, 2023, 09:47:16 PM",
      "body": "It is the fault on the side of the owner losing their access to the encryption key of the wallet backups.  I do not think that there is any better situation between the two incidents, losing due to hacking and losing Bitcoin due to carelessness in taking care of the backup and original encryption key of the set of wallet backups.  These two things should be taken care of with utmost care.I think there is no such thing as a balance between these two because they are different incidents although connected to each other. Each incident must be taken care of with utmost care the security should be set to a maximum preventing hackers and other attacks from happening and at the same time making sure of securing the encryption key of the wallet backups is safely secured and stashed away on a place where only the owner has access.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "August 29, 2023, 09:51:00 PM",
      "body": "Quote from: Nwada001 on August 29, 2023, 09:25:33 PMAnd NO me I disagree with this one, as I can't feel more relief knowing that hackers get access to my funds and make away with them. And feel very bad that I lost access to them in the process of trying to protect them from hackers access.Knowing this, I think losing access to the encryption is better than allowing hackers to make away with the bitcoin holdings.In both ways a loss is a loss be it to hackers or to loss of access to the encryption due to excessive tightening of security and, there's nothing relieving about the two sides wether you agree or not. All that matters is the safety of our coins, that the loss of it shouldn't occur  be it  in the process of building security for it or by hacker having access to it..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "August 29, 2023, 10:09:45 PM",
      "body": "Quote from: letteredhub on August 29, 2023, 09:06:29 PM~Snipped. If you ask people that lost their bitcoin out of their excessive security to prevent theft of their coins you hear most of them say it's more painful to them losing their coins in that manner compared to a loss due to malware or hack. Therefore, while taking necessary range in protecting your coins in your wallet don't forget to balance the risk.Source:  Mastering Bitcoin This is true. More often than not, people lose access to their wallets because they tried to be too smart about storing their recovery phrase. I personally don't think one needs an overly complex storage patterns powered by insane encryptions when you can just store it offline. Offline storage is best but like other storage methods for recovery seeds, it has its own downsides but if done correctly, it's the best approach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "August 29, 2023, 10:28:34 PM",
      "body": "Quote from: letteredhub on August 29, 2023, 09:06:29 PMIf you ask people that lost their bitcoin out of their excessive security to prevent theft of their coins you hear most of them say it's more painful to them losing their coins in that manner compared to a loss due to malware or hack. Therefore, while taking necessary range in protecting your coins in your wallet don't forget to balance the risk.Source:  Mastering Bitcoin There's no such thing as excessive security, there's only bad security setups. Encrypting something many times won't multiply your total security, but it will multiply your chance of loss, so it's a net negative for security. A good security setup must have redundancy, so if one of the elements fails, it should still be possible to access funds. Storing seed on just one piece of paper in one place is bad, because if something happens to that paper, the coins might be gone. But storing 3 copies in 3 different places is better, because it's unlikely that all will fail in short time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 29, 2023, 10:56:56 PM",
      "body": "Quote from: letteredhub on August 29, 2023, 09:51:00 PMQuote from: Nwada001 on August 29, 2023, 09:25:33 PMAnd NO me I disagree with this one, as I can't feel more relief knowing that hackers get access to my funds and make away with them. And feel very bad that I lost access to them in the process of trying to protect them from hackers access.Knowing this, I think losing access to the encryption is better than allowing hackers to make away with the bitcoin holdings.In both ways a loss is a loss be it to hackers or to loss of access to the encryption due to excessive tightening of security and, there's nothing relieving about the two sides wether you agree or not. All that matters is the safety of our coins, that the loss of it shouldn't occur  be it  in the process of building security for it or by hacker having access to it..  I think we are almost on the same page now as to what provokes my curiosity, as it was certainly not clear why someone would feel more pain losing something in a particular way over another or why the sole purpose in the first place was to protect. Whatever leads to losing access to the funds in question hits with a different kind of pain, and one should not consider one greater than the other due to the means used in losing them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "August 29, 2023, 11:29:12 PM",
      "body": "We shouldn't stay at our personal comfort level with security practices playing a role in finding the right balance.People will choose centralized exchange over having a hardware wallet to store and protect their coins.  Because for them it's easy to access while using these centralized platforms.Being paranoid about your funds can also lead to losing them, adding excessive layers of encryption without a clear purpose can indeed increase the risk of losing access to your funds.  Each layer introduces a potential point of failure or a hurdle to accessing your funds. Therefore, it's important to keep your security measures streamlined and well thought out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "August 30, 2023, 12:51:46 AM",
      "body": "Dos and Don'ts withSecurity ChecklistSecuring your wallet (tips)Bitcoin security and resources[GUIDE] How to Create a Strong/Secure PasswordAre your passwords in the green?Have a clean computer, best if it is airgap, and have healthy using with Internet. Avoid to use cracked, free download softwares on Internet that can has malwares. Backup your wallet private key or mnemonic seed and use a strong password to encrypt and protect your wallet file and access.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 30, 2023, 02:36:06 AM",
      "body": "Quote from: letteredhub on August 29, 2023, 09:06:29 PMIf you ask people that lost their bitcoin out of their excessive security to prevent theft of their coins you hear most of them say it's more painful to them losing their coins in that manner compared to a loss due to malware or hack. Therefore, while taking necessary range in protecting your coins in your wallet don't forget to balance the risk.In learning and application of knowledge, it is good to move from the known to the known. I have read about many security measures to protect wallets from hacks. Some of them are very complicated and others are easy to apply. It would be wrong for me to apply the security process that I don't understand without further studies to master the operation. I would rather use the one I can understand until I have gained a full understanding of the complicated one. A simple mistake can make you lose money in this sector so it is important to gain a full understanding of a process before engaging in it. If possible you can experiment with a little fund to ascertain the outcome of the process because a slight mistake can be costly. Nevertheless, there is also a need to always upgrade your security practice because hackers are also improving their techniques.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 30, 2023, 09:02:02 AM",
      "body": "The bicycle has been around for a long time—no need to go to extremes. Basic security is sufficient, including the correct storage of the seed phrase and competent and careful handling during transactions with your device. If you don't want to be very boastful, tempting people to commit a crime, keep your mouth shut, a few rules are enough.Inventing, repeatedly saving, and encrypting your files will lead to even more fuss, which can confuse the owner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 30, 2023, 10:03:05 AM",
      "body": "Sad story, but in 2011, the awareness and ease of creating wallets was not as what happen now. old wallets required the user to manually save each private key for each address individually, and there was no encryption, ease, and beautiful interfaces as it is now, the price of 7000 bitcoins may be less than 7000 dollars. Balancing risk has become easier and more options are available. You must read, have basic knowledge, and then store several copies (as many as you can keep safely), whether on paper or metal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "August 30, 2023, 02:54:48 PM",
      "body": "Quote from: letteredhub on August 29, 2023, 09:06:29 PMWe have relentlessly been discussing about bitcoin security of our wallet. Tightening the security of our data files against the backdrops of losing our bitcoin to hackers. And that awareness is something very important to every bitcoiner.It's very simple to achieve, if you're choosing a wallet for your security use that will not allow any vulnerability or risk on your bitcoin, rhen make use of these.wallets for security and privacy at the highest orderBitcoin CorePassport ElectrumSparrow BluewalletOpen Source Hardware Walletshttps://bitcointalk.org/index.php?topic=5288971.0decentralized exchangehttps://bisq.network/https://localcryptos.com/https://hodlhodl.com/If every newbies can have the idea of knowing about these, maybe the rate at which they lost their crypto assets could be minimized because they have the right to choose from which means they want to store their bitcoin by deciding on the right wallet types.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "August 31, 2023, 09:03:59 AM",
      "body": "Quote from: Doan9269 on August 30, 2023, 02:54:48 PMIt's very simple to achieve, if you're choosing a wallet for your security use that will not allow any vulnerability or risk on your bitcoin, rhen make use of these.I think you didn't understand what the op is trying to say, he wants to say that the complexity of storing seeds like creating a multi-signature wallet, saving many copies of it may lead to your money loss, for example losing one of the copies, or it falling into the hands of a third party, or not being able to get all the keys if you Create a multi-signature 8-of-8 wallet.The example he mentioned dates back to 2011, wallet seed was encrypted separately and the private key with which it was encrypted was forgotten.You will not get a perfect answer and it may differ from one person to another, but I believe that keeping 3 copies of a multi-signature wallet 2 of 3 in metal form in places you trust and not connected to each other is enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "August 31, 2023, 09:36:36 AM",
      "body": "IMHO, you don't have to do complex things just to protect yourself, your coins and seeds. What you need to focus with is the way you monitor your daily browsing and activities using your devices.Being aware of the risk and having a basic knowledge on how to protect yourself from the attacks and how you can potentially be hacked would be a good start.I do understand why many does complex things because of the history that they've been. But yeah, simplicity is beauty as they say and if it's related to security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 31, 2023, 12:53:24 PM",
      "body": "Your wallet can be compromise if you store your information online,for example your password and and seedphrase online,or you are sent a link containing malware.Since you are talking about an investor taking too much caution on securing their bitcoin forget and password or seedphrase. it is better that the seedphrase should be written and backed up offline in three different places. instead of paper,you can write it on a steel plate, which fire and water can't destroy it. if it is your password,it is better that you use uppercase letters and a long character that you wouldn't forget. For example the name of your best friend,name of your child,name of your church or something that you wouldnt forget easy that is always part of you.you can see this topic for yourself by Ratimov  Complex password is the key to security",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "August 31, 2023, 01:14:57 PM",
      "body": "Quote from: letteredhub on August 29, 2023, 09:06:29 PMIf you ask people that lost their bitcoin out of their excessive security to prevent theft of their coins you hear most of them say it's more painful to them losing their coins in that manner compared to a loss due to malware or hack. Therefore, while taking necessary range in protecting your coins in your wallet don't forget to balance the risk.People who lose their coins while trying to keep it safe through security measures lose their coins because they do too much and often time do not have a good understanding of what they are doing. It is not advisable or in your best interest to try security measures for your coins that you do not understand, or steps that are too complex for you. You can lose everything. Simple security steps and measures cab be what you need sometimes to secure your coins and they would work efficiently for as long as you want, so far it is done correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}