{
  "id": "topic_5477348",
  "title": "Markiehillz",
  "author": "Markiehillz",
  "created_time": "December 10, 2023, 07:38:01 PM",
  "content": "Trading is:80% Psychology10% Risk Control10% ExecutionYour might have a good trading system,yet not be a profitable trader,to be a successful trader goes beyond drawing lines on your screen or a few indicators.Work on yourself consistently and intentionally first and the rest comes easy!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477348",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "December 10, 2023, 10:10:04 PM",
      "body": "Who came up with these figures or percentages?I believe the biggest percentage should be risk management. Without proper risk management, your account will blow up in no time, and you won't be able to trade anymore.If someone automated their good working strategy, what would the 80% Psychology be for?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "December 11, 2023, 05:36:56 PM",
      "body": "Quote from: Markiehillz on December 10, 2023, 07:38:01 PMTrading is:80% Psychology10% Risk Control10% ExecutionYour might have a good trading system,yet not be a profitable trader,to be a successful trader goes beyond drawing lines on your screen or a few indicators.Work on yourself consistently and intentionally first and the rest comes easy!It might seem a bit off-topic or undigestible but it is true and 100% true, trading is the game of psychology, when we begin to think that the market is going up or will go up and we should buy now and then the market falls and when we think its time to book some profit as the market will come down and when we did it, markets start to go up. Is not it a coincidence?So can we not use this as an indicator but in reverse mode, like when we get to have the feeling of buying some token but what we did is sell it instead, and same goes if we get the feeling of selling but we do buy instead. This whole thing looks fun and sarcastic. Many might be thinking if this reverse emotion strategy would work why isn't every person rich now because that's not how things work.The price of a token depends on many things but first, we have to see what coin we are talking about, if its BTC then its price depends on demand and supply but if it is ETH its price depends on the network's usage and new features, or if we are talking about Solana or Link, etc., we look for the use cases they have.The thing is, we don't know what to look for before making a trade and where to look, and which thing to trust and which news to not. All these things are not easy to learn but it really takes time and we have to work on ourselves in making our mindset to remain calm in every situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "December 11, 2023, 06:31:18 PM",
      "body": "Quote from: Markiehillz on December 10, 2023, 07:38:01 PMTrading is:80% Psychology10% Risk Control10% ExecutionIt can be rumble percentages from different factors and it varies from each trader. Quote from: Markiehillz on December 10, 2023, 07:38:01 PMYour might have a good trading system,yet not be a profitable trader,to be a successful trader goes beyond drawing lines on your screen or a few indicators.I agree, it has to appear with your results that you actually have a good strategy. Because if it doesn't manifest as good results into profits then those are just strategies that need to talk about but if the results are visible and you're a profitable trader, that is the actual goal of most traders.Quote from: Markiehillz on December 10, 2023, 07:38:01 PMWork on yourself consistently and intentionally first and the rest comes easy!Everyone is trading for one intention and that's to make profit, that's all. No one gets into trading just because he likes it but that's the sole purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "December 12, 2023, 02:12:16 AM",
      "body": "Quote from: Markiehillz on December 10, 2023, 07:38:01 PMTrading is:80% Psychology10% Risk Control10% ExecutionYour might have a good trading system,yet not be a profitable trader,to be a successful trader goes beyond drawing lines on your screen or a few indicators.Work on yourself consistently and intentionally first and the rest comes easy!What did you base on the percentage figures you gave that OP? There has been a lot of discussion here about trading in the crypto field, and most of those who have made topics about trading have source links to show.So you should do the same on this topic. It seems that what you did is so general that even newbies on this forum platform will not immediately understand that. You should start with the basics; you know what it means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "December 12, 2023, 06:57:31 AM",
      "body": "Trading is based on psychological factors because everyone works according to their abilities of realizing market condition and then decide according to ups and downs of market. Taking risk is good but I think if we are selecting useless coin by saying that if we are not taking risk we can not be a successful trader then it means that we are playing with our money.Knowledge and experience are also very important and if someone is expert in trading then there is a possibility the in 10 traders he will loss just 1 but unexperienced trader will continuously face hurdles. To reduce risk one have to select coins according to market cap, past results of desired coin and also current trend therefore you will be able to get profit after managing risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "December 12, 2023, 10:11:06 AM",
      "body": "Different people will have different views on this. Maybe you say that in trading 80% is psychology, but some say 60 or 50%, it is difficult to determine an exact number, because even though psychological factors play an important role, we cannot rule out other factors which make trading successful. And it is difficult to put these factors into a percentage number, because different people have different strategies in trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "December 12, 2023, 01:48:00 PM",
      "body": "It turns out that OP was just plagiarizing about any text he would come across on Twitter to make him look like someone knowledgeable about trading, and yet he was not. We wasted our time here bringing up our arguments to someone who had no idea about what he was even posting. I am very disappointed that I did see this coming. The OP has been banned, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "December 12, 2023, 08:15:23 PM",
      "body": "Quote from: Bitcoin_Arena on December 10, 2023, 10:10:04 PMWho came up with these figures or percentages?I believe the biggest percentage should be risk management. Without proper risk management, your account will blow up in no time, and you won't be able to trade anymore.If someone automated their good working strategy, what would the 80% Psychology be for?We're up to speed on the present scenario of our world; we don't know what the subsequent stage of these initiatives will entail, but we're doing everything we can to ensure we're on the winning team; that alone will put a smile on our faces. Trading is not for everyone; I keep repeating this since I've seen people liquidate their accounts simply because they lack the traits required to divert to milking the system. When we think of trading, the first thing that comes to mind is risk management. Following a legitimate trader that have gain experience or better apply for a class from a pro mentor in the space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "December 13, 2023, 08:39:33 AM",
      "body": "Quote from: Markiehillz on December 10, 2023, 07:38:01 PMTrading is:80% Psychology10% Risk Control10% ExecutionYour might have a good trading system,yet not be a profitable trader,to be a successful trader goes beyond drawing lines on your screen or a few indicators.Work on yourself consistently and intentionally first and the rest comes easy!Even if we have this guide or percentage in trading, there is no certainty. I mean, the percentage you have given can be helpful, yes, but the thing is, the human mind has a different state. Even if they have this guide with trading, the human mind and decision can be affected. And in addition, you should also include management and patience in your list. Why? Because without proper money management, you will not know what will happen to your money, whether you risk it or not. You have to manage the money and capital you have to ensure profit or reduce losses. A trader without patience will be a disaster, as it will tend to affect every of his decisions with a slight means. That's why if a trader is involved in a trade, he or she should patiently wait for the result and don't be inpatient to exit the trade just because he or she sees that it's earning or losing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "benalexis12",
      "created_time": "December 13, 2023, 10:19:35 AM",
      "body": "What you said is correct; I have nothing against what you mentioned here as a reminder. The only problem for those who read what you did is that not everyone knows if that psychology has an application for them as traders here in the crypto space.In addition to this, risk control is also unknown to most people in the crypto community of crypto trading. How aware are they of risk and execution? We know that they need to learn the world of crypto trading first before they understand what you said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richkiedx",
      "created_time": "December 13, 2023, 10:56:37 AM",
      "body": "Quote from: bhadz on December 11, 2023, 06:31:18 PMQuote from: Markiehillz on December 10, 2023, 07:38:01 PMTrading is:80% Psychology10% Risk Control10% ExecutionIt can be rumble percentages from different factors and it varies from each trader. Quote from: Markiehillz on December 10, 2023, 07:38:01 PMYour might have a good trading system,yet not be a profitable trader,to be a successful trader goes beyond drawing lines on your screen or a few indicators.I agree, it has to appear with your results that you actually have a good strategy. Because if it doesn't manifest as good results into profits then those are just strategies that need to talk about but if the results are visible and you're a profitable trader, that is the actual goal of most traders.Quote from: Markiehillz on December 10, 2023, 07:38:01 PMWork on yourself consistently and intentionally first and the rest comes easy!Everyone is trading for one intention and that's to make profit, that's all. No one gets into trading just because he likes it but that's the sole purpose.in the beginning it's hard, it makes you cry when you lose, you almost give up when you lose every day but all that is just at the beginning because once you get the right strategy, it's addictive to trade that's how in trading you need to go through all that first in order to achieve the success you hope for you have a lot of time to spend and time to thoroughly study the crypto patient is all that is needed here in the end you are also the one who will benefit from the hardships suffered you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "December 13, 2023, 04:21:31 PM",
      "body": "Quote from: Markiehillz on December 10, 2023, 07:38:01 PMTrading is:80% Psychology10% Risk Control10% ExecutionYour might have a good trading system,yet not be a profitable trader,to be a successful trader goes beyond drawing lines on your screen or a few indicators.Work on yourself consistently and intentionally first and the rest comes easy!I think risk taking is the most important thing in cryptocurrency. How dare you trade if you don't take money risk. We usually have accounts on websites, how do you work if this website is closed. Psychology can never be fully relied upon, risk taking will come if you take risks then you can participate in all activities. And you will find success in hard work by taking risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MFahad",
      "created_time": "December 13, 2023, 06:22:50 PM",
      "body": "Quote from: Markiehillz on December 10, 2023, 07:38:01 PMTrading is:80% Psychology10% Risk Control10% ExecutionYour might have a good trading system,yet not be a profitable trader,to be a successful trader goes beyond drawing lines on your screen or a few indicators.Work on yourself consistently and intentionally first and the rest comes easy!An experience trader always knows where and how much he has taken. It does not need to overcome the risk of psychology and other things. For new people, all these things can be good and good to learn, but experienced traders always see how the market can go. What you call lines or some indicators, often traders with these lines and indicators, and make good profit daily.Every work has to face difficulties in the beginning, after which, as it experiences, things seem to be easy. What I think is the most important is a trend. If you understand this trend, you will always face good profit and less loss in trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "December 14, 2023, 08:58:07 AM",
      "body": "Those who are successful in trading know how to control their emotions know how to control their greed they are strong enough mentally and they never make decisions on emotions. Trading is not that easy, to profit from trading you need to be patient, trust the market and take risk, the most important thing is to understand the market. If we understand the candles correctly then trading will become easier for us. We need to have a clear idea from which position of the candle the market can go down or from which position of the candle the market can go up again. The more we understand about trading charts the easier trading will be for us. Along with mental toughness, patience, a trader must have a good understanding of trading charts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 14, 2023, 12:01:59 PM",
      "body": "Quote from: Markiehillz on December 10, 2023, 07:38:01 PMTrading is:80% Psychology10% Risk Control10% ExecutionYour might have a good trading system,yet not be a profitable trader,to be a successful trader goes beyond drawing lines on your screen or a few indicators.Work on yourself consistently and intentionally first and the rest comes easy!Using drawings on a xhari and indicators is just part of what to know about trading, it can not help you to make profit all the time. Sometimes, your indicators will tell you where the market is going, but the market will go the opposite direction. You are correct about this. But trading is more about strategies and risk management which will take up 60 to 70% of it. Mathematics is also part of it. Although viewing the chart using TP and SL on the exchange that you are using can be enough. But there are some calculations you will want to make before trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}