{
  "id": "topic_5418553",
  "title": "NYMIE",
  "author": "NYMIE",
  "created_time": "October 27, 2022, 08:05:31 PM",
  "content": "What can I do to be able to contribute to the forum?Is it by reporting fraud, cheating, plagiarism or do I have to make a good post so I can be called \"your contribution is great on the forum\". I read a lot of posts suggesting contributing to the forum and making good posts.I've been frequenting every available board on this bitcoin forum in the past few days and I came across a post about the types of bitcoin account ratings. Turns out I was very low-ranked.It occurred to me that I would challenge myself to be in the highest rank someday in a good and right way even though I only worked as a housemaid.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418553",
  "comments": [
    {
      "author": "_BlackStar",
      "created_time": "October 27, 2022, 08:19:54 PM",
      "body": "Learn about bitcoin and have a great knowledge about it and you can share it with users in forum. You don't have to be a cheater hunter, spam buster or plagiarist to get merit and rank up, it's something you can probably do while focusing on your bitcoin learning.I'm not against your interest, but when you really learn about bitcoin and understand a lot about it then rest assured that people will see you as a different and interesting person. Merit and rank will be guaranteed not because you can caught most cheater or plagiarist, it's because you have something worthy of the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "October 27, 2022, 09:14:05 PM",
      "body": "Quote from: NYMIE on October 27, 2022, 08:05:31 PMWhat can I do to be able to contribute to the forum?What are you looking for from bitcointalk?  You're asking about all the ways you've read about and yet somehow you're still uncertain.  That tells me that you weren't driven here out of curiosity or a passion for bitcoin, especially since it's just a bizarre question in general to be asking the community of a discussion forum when they're new.You either come here and know what to post or else you end up like so many below-average members that you can tell by the way they write and the contents of their posts they're only here to earn some money.  That describes you to a T, right?Quote from: NYMIE on October 27, 2022, 08:05:31 PMIt occurred to me that I would challenge myself to be in the highest rank someday in a good and right way even though I only worked as a housemaid.I swear I've read someone post something extremely similar to that before.  If anyone else is getting that feeling and can do a magical search, I'd be much obliged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 27, 2022, 09:30:21 PM",
      "body": "You do not need to report fraud, cheating or plagiarism, but if you suspect that someone has committed any of these, please report it, because in that way you will help to keep this site a safe place for everyone. However, there are many other ways to contribute positively to the forum besides reporting violations. The most effective way is through creating good posts in response to others' questions and statements .This is how I think it works. All you do is be an active member of the forum and \"contribute to the forum\" as you call it. As for a good post, treat this place like your own community. So make posts that you think benefit others here in the community. It does not have to be something it really benefits us as long as people can learn from it or you are also learning from it at the same time or vice versa. After all, it is not helpful if your post doesn't add anything new to the discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "October 27, 2022, 11:17:35 PM",
      "body": "Quote from: NYMIE on October 27, 2022, 08:05:31 PMWhat can I do to be able to contribute to the forum?Nymie, it'll be better if you follow your self-driven passion, especially when it's cured by endless curiosities, all day long. What are we doing here? Isn't it something yunno? Then go ahead and do the same thing. I understand that you dunno where to start; it happens almost everytime, to rookies like ya, -- I'm not gonna say that's a sign of incompetency, No! ....only that, anything that's learnt in due process, in some pace of time,under a well-nutured avidity, is worth learning. You ain't expecting to get it that easily; it ain't some freeborn pizza & frozen yogurt giveaways, yunno . Sometimes, you'll tend to get pre-occupied with your normal day activities in real life but, just remember this day, that I, Sandra said this to you ; if you leave a piece of heavy stone on a deserted environment, and fail to move it to a site with which it'll be used for construction, will it move itself??There's a post of yours I read -- 'bout a week ago and you were strongly against a SCAM,...I saw some deep infurations in your words(though, I can't tell who you're , trust-Wise), if you'd follow the already-trailed paragon of yours, then that'll mean bursting out scams....it's still something that could earn you a good reputation. If your motives are clear, you wouldn't find anything else too difficult; everyone started like you.I won't say more NYMIE....... AND STOP SAYING THAT' YOU'RE A MAIDEN(nobody gets entertained with that). Quote from: NYMIE on October 27, 2022, 08:05:31 PMIt occurred to me that I would challenge myself to be in the highest rank someday in a good and right way even though I only worked as a housemaid.Quote from: The Pharmacist on October 27, 2022, 09:14:05 PMI swear I've read someone post something extremely similar to that before.  If anyone else is getting that feeling and can do a magical search, I'd be much obliged.Chymist, it was on my congratulatory post that she said something similar to that though; it'll make OP let-out an esoteric information of her WHOLE callowness to everyone; even the poorest pessimists would have a sit, just to criticize.....that's why I warned her 'bout saying everytime, that she's a maid .Edit: you've got only one merit and that, I gave out to you...better grind your ass up ...... You still got time -- TIME to THINK not just posting ..Sandra 💇",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 28, 2022, 05:29:47 AM",
      "body": "The first question is why you're want to contribute in this forum and achieve the highest rank? if your reason is to learn in this forum, you're actually don't need to make post since you're only need to read the whole people opinion on a particular discussion you're interested. I don't understand why you're creating this thread, it's your choice to contribute or not, also the definition of contribution may vary to each other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 28, 2022, 05:53:29 AM",
      "body": "Quote from: Plaguedeath on October 28, 2022, 05:29:47 AMThe first question is why you're want to contribute in this forum and achieve the highest rank? if your reason is to learn in this forum, you're actually don't need to make post since you're only need to read the whole people opinion on a particular discussion you're interested. I don't understand why you're creating this thread, it's your choice to contribute or not, also the definition of contribution may vary to each other.Who knows probably OP genuinely wants to contribute to this forum but don't know what is the definition of contribution here ( most probably to fish some merits but just take it for the sake of argument ). We can keep learning by reading but this is ain't a perfect book this is just a discussion forum so different people comes up with different solutions and opinions so without rising question when its needed the real solution can't be obtained.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 28, 2022, 06:27:32 AM",
      "body": "You just have to be smart, learn more about quality posts and know more about quality posters on this forum. You can see quality posts on bitcoin boards, economy, trading, scam accusations, reputation and some other boards. You just have to learn, read more of what quality posters are posting on the boards you have interest in.This is just a community to learn and contribute, you have to do the two (learning and contributing) to be able to rank up. It might seem hard, but just for beginners, old members do not see it hard anymore. Once you start to get acquainted with this forum, you will see yourself having merits and ranking up. But you have to look properly into what others are posting, trying to be like them, and even looking for ways to be better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "October 28, 2022, 06:47:25 AM",
      "body": "Those that get recognized the most are those that weren't really looking for any sort of recognition in the 1st place. Everyone is always in a hurry to make a name for themselves on here, why? You start out as a newbie for a reason. You need to take the time to read all the sticky threads and learn the rules. Once you're familiar, then you'll know what is and is not acceptable around here. The whole time you are familiarizing yourself with the forum and its rules you can also be contributing by sharing your knowledge about certain subjects on the forum. Maybe you are a coder or a miner or some other technical guy who can help users out that may have questions. Maybe you are a marketing whiz or a site owner (casino or something) and want to get knowledge from the community to better your project. Maybe alot of things. Just hang out and help out where you can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 28, 2022, 08:43:44 AM",
      "body": "Do you work as a maid? So you're supposed to be clean, aren't you? Follow this rule here on the forum. Do not litter the forum with unnecessary posts. Start first with yourself. No one needs your promises. No one will take anything from you for not fulfilling your oath. Foremost, being here on the forum should be necessary for you yourself. The forum has lived without you for a very long time. Therefore, study the topics of the forum and this should be your primary task.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 28, 2022, 08:52:55 AM",
      "body": "Quote from: NYMIE on October 27, 2022, 08:05:31 PMIt occurred to me that I would challenge myself to be in the highest rank someday in a good and right way even though I only worked as a housemaid.Change doesn't happen in a day. It happens incrementally, or in this case, every two weeks - even if you get hundreds of merit today, you still need to wait 1 year to get enough activity to become a Hero Member, and for Legendary it's anywhere from 2-3 years (the exact amount is random for each user).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "October 28, 2022, 10:12:16 AM",
      "body": "Stop it. The merit fishing is not going to work anymore LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 28, 2022, 12:14:28 PM",
      "body": "You do not need to contribute to the forum. You just need to read, search and share information, that's how the forum looked and evolved.Read the forum rules, report the spam, so you will have provided a good service to the forum.As for doing some tasks, they are things that some people like to do, but if you have no experience, there is no need to try to learn them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "October 28, 2022, 12:27:35 PM",
      "body": "OP, if you've read every topic on the forum, then did you find any interest in that particular topic?If nothing interests you, you may have misunderstood your purpose in the forum.if you want to spend more time on the forum, study the forum rules first. don't just read, maybe if you don't know you can ask in your local thread to get a more understandable answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "October 28, 2022, 04:15:21 PM",
      "body": "Quote from: NYMIE on October 27, 2022, 08:05:31 PMWhat can I do to be able to contribute to the forum?Hello @NYMIE, Bitcointalk Forum has many types of discussion boards that can be discussed, contributions, insights, actions, knowledge skills are the main capital of every human / individual that needs to be developed, question.....! What field of science do you know, that's what will determine your success in your futureThis question does not guarantee you can increase your rank here.Quote from: NYMIE on October 27, 2022, 08:05:31 PMIs it by reporting fraud, cheating, plagiarism or do I have to make a good post so I can be called \"your contribution is great on the forum\". I read a lot of posts suggesting contributing to the forum and making good posts.Members in this forum appreciate the knowledge you have, if you have it applied here, it's better than what you asked above, you are familiar with law, Bitcoin, gambling, crypto trading, services, exchange, mining and so on, everyone here will appreciate all of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 28, 2022, 05:38:49 PM",
      "body": "Quote from: NYMIE on October 27, 2022, 08:05:31 PMWhat can I do to be able to contribute to the forum?There are no rules about contribution, just do what you do best and try to provide some value in forum.Easiest way is by reporting spam post, plagiarism, but some people are good artists or designers, others are good in managing things, etc.If you are more technical oriented you can contribute there, or you can just help other people when they ask some information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "October 28, 2022, 07:48:44 PM",
      "body": "Quote from: NYMIE on October 27, 2022, 08:05:31 PMWhat can I do to be able to contribute to the forum?Is it by reporting fraud, cheating, plagiarism or do I have to make a good post so I can be called \"your contribution is great on the forum\". I read a lot of posts suggesting contributing to the forum and making good posts.In the donation section, there are good points to be made that might be worth your consideration. It might be worth for the time you invest in this forum, and I think this is what you need to take a look at.QuoteIf you want to help the forum, please make good posts, report rule-breaking posts, and invite friends.There are many ways you can do if you want to contribute to the forum. Not only can you be a helper with various reporting efforts, but with your good posting the forum will also help itself. Merit system is considered successful in preventing thousands of spammers from rank up, so pay attention to the quality of your posts and you may be noticed by other members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 29, 2022, 12:53:18 AM",
      "body": "First you have to learn how to deal away with desperacy from this otherwise it would hinders you the most since you want to get to a higher rank which might likely makes you not to concentrate at all, so bring yourself down forget about ranking up and focus on knowledge to acquire from the forum or deep down to know about information pertaining bitcoin and many more then you could know what to say and where to post, how it works than being working for an eyes service. In the forum there are many sections choose where you are best suited for and focus there to know things about the section so you could post very well. Most at times i spent days reading only, not because i don't know where to post but i am trying to understand things that i m reading, i might not necessarily post but to acquire the knowledge is my number one key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 29, 2022, 02:25:39 AM",
      "body": "Quote from: NYMIE on October 27, 2022, 08:05:31 PMWhat can I do to be able to contribute to the forum?Knowledge and expertise can be a form of contribution. If neither of these are with you, then more silence and more reading is a great initial contribution step.Quote from: NYMIE on October 27, 2022, 08:05:31 PMIs it by reporting fraud, cheating, plagiarism or do I have to make a good post so I can be called \"your contribution is great on the forum\". I read a lot of posts suggesting contributing to the forum and making good posts.That's fine as long as you can make sure you're up to the community's standards. However, basically forums need contributors to carry useful information",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "October 29, 2022, 10:48:58 PM",
      "body": "Quote from: NYMIE on October 27, 2022, 08:05:31 PMIs it by reporting fraud, cheating, plagiarism or do I have to make a good post so I can be called \"your contribution is great on the forum\". I read a lot of posts suggesting contributing to the forum and making good posts.I suppose all that counts to what makes you recognised on the forum. It doesn't mean doing it once and your off but, you've got to be active and consistent with your forum activities. There are so many users on the forum and one way to stay ahead is by ensuring your being active in most of the boards.Of course the forum is wholesome but, not as wholesome as you see it. Given that sme boards are looked at with much neglect by the elites of the forum and puts such boards on ignore. You frequent there, your likely not going to get noticed.But, getting noticed shouldn't be much of an issue. It's better you just keep trying to improve you and in your doing so, you contribute to the discussions going on across boards. That way, you gain and as well sell your name by the Knowledge you put across. Trying to force yourself to do things just to get noticed is one way to ask for trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}