{
  "id": "topic_5433021",
  "title": "DaNNy001",
  "author": "DaNNy001",
  "created_time": "January 04, 2023, 04:59:43 PMLast edit: January 04, 2023, 05:10:58 PM by DaNNy001",
  "content": "DEFEATDefeat, a feeling that is very awful that is felted when someone intends in doing something and getting a desire results but ends up with a totally different outcome.    There are so many ways in which one can be a victim of such feeling. This dreadful feeling of defeat has trapped most industrious mind trying to come out to be recognized and has affected many people emotionally and psychologically.Even in the forum here most people trying to build a reputation and newbies always feel this way as the forum is filled with good critics that's are always active and ready to correct and put so many people in the right track but this act is seen in the forum by some members as a sign of defeat and this sometimes crumbles their will power to keep on striving and trying their hardest to learn and be successful in world of crypto.But defeat is not supposed to be handled like this with a negative energy and infact defeat is very beneficial  to all humans who are trying to excel because its teaches us some many lessons on the way to go about the situation in ground next time. So i just want to hear from the forum members on the times in which we have encountered or felt such feeling but didn't stop but instead use it a benefit and a positive energy to improve ourselves.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433021",
  "comments": [
    {
      "author": "Majestic-milf",
      "created_time": "January 04, 2023, 05:52:05 PM",
      "body": "Well, it only takes those who are determined to pick themselves up after experiencing a form of defeat. More esp, after you must have visualized a positive outcome. While you mentioned that some newbies who have tried to build a reputation here don't get what they are looking for instead are faced with criticisms(both negative and positive) leave the forum afterwards, I think I should say probably they leave because they didn't plan on staying long in the first place-because in life, nothing good comes easy- or the euphoria of joining has washed off, either way I dunno.  Bottom line is, in every sphere of life, we face one hurdle or the other but what actually matters is how we handle them; either we succumb to defeat or pick ourselves and learn from our mistakes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phu Juck",
      "created_time": "January 06, 2023, 03:07:55 AM",
      "body": "Defeat has no benefits, it's always a loss for us. You can invest in a coin, lose money or you can miss a good opportunity to buy a new, promising coin (it is less bad) but after all, you'll feel bad and it is understandable for why you feel bad. Crypto is a hard place to speculate and we should be aware of it. We have a chance of huge profits but also huge loss. Still, crypto is only virtual money, it's only exising in digital space. Losses can occour quickly, same goes for profits as well. We should be a) carefulb) positiveas it will help us to get better and more educated results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sakanwa",
      "created_time": "January 06, 2023, 03:38:00 AMLast edit: January 06, 2023, 04:58:30 AM by mprep",
      "body": "Well, my own personal opinion I will say defeat is a disaster that has no benefits, I remembered when I run into a bad business, that will lost 1.8m this taught me a lesson that I will never forget in my entire life, because I was asked to pay back the money that was lost, actually I didn't game any benefits from this business instead I loss, in our generation today, so many people are facing one challenge of the other, that is really making them facing alot of terribles challenge in the world, when I was still in my first year in the higher institution, I invested in two investment platform that later got hack and everyone was in a big lost because there was no benefits, and all we have was defending the lost account till date.Thank you so much for this wonderful opportunity to speak on this topic, well, I will say that in our generation today, there's no beneficial coin now, that has no defeat at end, so we have to be extra carefully in all we do, not rushing to invest in every investment platform or forum that you come across, I remembered my first time on bitcointalk, I was having a discouragement from myself, because of my pass experience, but i later find out that bitcointalk is the best and beneficial forum I have ever seen or meet in my entire life, because ever since I have been making a lot of money on here, I have never come across any situation of defeating any lost coin but more over I have gotten a key to success.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "January 06, 2023, 03:52:30 AM",
      "body": "This is my story being defeated in life it started in 2020 where that pandemic destroys everyone hope , people getting covid-19 losing job, and layoff, though i did not lose my job, but the pressure to work, and earn bigger money since its pandemic, and a relationship failure, hits me rock bottom , I can't can't work properly, and have issues with colleagues, all those gives me stress, i have to sell some assets in crypto just to barely pay, some of bills, but then i realize that if I stop it will be worse, so i gather myself together ignore negative in my environment, invest some unknown coins, of course I did research about it, and make some good money, then i invest again, before 2021 ends I'm in the better position in life, I'm glad i never gave up, just because of some miss opportunities, instead push myself to be better.Note: We will have lows in life but how we face them will conclude the result, giving up is not an option, fight and pushing yourself every morning to get up and start the day, even its hard will gave way to better result, I'm sure about that, because I face that same situation for years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sakanwa",
      "created_time": "January 06, 2023, 04:06:44 AM",
      "body": "Defeat is the greatest awful news or results that anyone can game or achieve from any crypto that was hopeful to get a better and meaningful results from, in 2021 i know of what happened in our society, there was a unpleasing news to everyone who was involved in satoshi mining program, because it end up being lock from the hackers and everyone was in a big lost, so people were in a defeating of there money, cause some people borrowed money to start up the investment and later ending they lost everything without no benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "January 06, 2023, 05:03:28 AM",
      "body": "I have never heard or read that through defeat you could benefit. I have always read and heard that failure has tons of benefits. The most common of them is that it helps you in improving yourself and achieving success. Defeat is like accepting that you cannot overcome the hurdles and realizing that you should try something else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "January 06, 2023, 06:32:41 AM",
      "body": "Quote from: Sakanwa on January 06, 2023, 03:38:00 AMWell, my own personal opinion I will say defeat is a disaster that has no benefits, I remembered when I run into a bad business, that will lost 1.8m this taught me a lesson that I will never forget in my entire life, because I was asked to pay back the money that was lostI think you have benefited in that defeat experienced but don't just recognized it,  because a lesson learnt by failure is best type of lesson so far and you said in reply and i quote \"this taught me a lesson\". You were ask to pay back the money with was something that's very bitter to you so i think the benefits of this defeat is know how to go about it next time so that wont fall into such disaster anytime in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Feccvuj",
      "created_time": "January 06, 2023, 03:11:33 PM",
      "body": "Defeat allows you to become a better person, you should always learn a lesson from it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "January 11, 2023, 08:11:32 AM",
      "body": "I think there is benefits of defeat. If there is something I am defeated in, it gives me the opportunity to get back up even stronger. Learning from mistakes and understanding what the mistakes show growth. It is a fact of life to those that can grasp it, only if they want to try. If you don’t you will stay fallen and never achieve goals or have any ambition in life. We have all learned it as a toddler learning how to walk, we just stay down when we fall, we must get up. At that very young age, we understand that just we get up choosing to stay up to keep on going regardless of any setback.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "January 11, 2023, 08:09:15 PM",
      "body": "Most successful people in life suffer many setbacks, denials, defeats, losses before they succeed. I guess nothing really good ever comes easily. Success usually always comes after gruelling hard work & many set backs.You might fall down in life but you have to keep getting back up to fight again & again & again.Human beings are tougher & more resilient than you think. We can achieve anything if we are dedicated & push ourselves to the limit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "January 12, 2023, 09:34:08 AM",
      "body": "Defeat: An opponent having a victory over you in a challenge, competition or a fight.Well, don't fight a battle you can't win. Better to be prepared to avoid defeat. And make sure your opponent is not wiser than you. The wise ones can easily defeat those who are bigger or more muscular than they are. And this also applies to any challenges you come across.In regards to \"good critics\", I hope people don't see them as opponents or competitors so they don't feel defeated when no one is fighting or trying to defeat them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worldofcoins",
      "created_time": "January 14, 2023, 01:35:37 PM",
      "body": "Quote from: DaNNy001 on January 04, 2023, 04:59:43 PMDEFEATDefeat, a feeling that is very awful that is felted when someone intends in doing something and getting a desire results but ends up with a totally different outcome.    There are so many ways in which one can be a victim of such feeling. This dreadful feeling of defeat has trapped most industrious mind trying to come out to be recognized and has affected many people emotionally and psychologically.Even in the forum here most people trying to build a reputation and newbies always feel this way as the forum is filled with good critics that's are always active and ready to correct and put so many people in the right track but this act is seen in the forum by some members as a sign of defeat and this sometimes crumbles their will power to keep on striving and trying their hardest to learn and be successful in world of crypto.But defeat is not supposed to be handled like this with a negative energy and infact defeat is very beneficial  to all humans who are trying to excel because its teaches us some many lessons on the way to go about the situation in ground next time. So i just want to hear from the forum members on the times in which we have encountered or felt such feeling but didn't stop but instead use it a benefit and a positive energy to improve ourselves. In my opinion, getting defeated in the first instance is necessary as it makes you stronger and shows your weakness, leading you to conquer. We should not become a pessimist and must learn from our mistakes. Remember, To Err Is Human means it is normal for people to make mistakes. These mistakes which have led you toward defeat can teach you more than your winning experiences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tallupooh",
      "created_time": "January 14, 2023, 02:44:33 PM",
      "body": "everyone must have experienced something like this. feeling defeated, wanting to give up, and thinking negatively that the rights that have been exercised are in vain.but from all those feelings, we can all learn the meaning of a life that is indeed full of challenges and bitterness. without all of that, how could we stand tall and move on.no effort is wasted. because it is a form of a person's struggle to rise from a low point to the best point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}