{
  "id": "topic_5399726",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "May 22, 2022, 01:43:19 PM",
  "content": "Nas explorações de projetos cripto com algum impacto positivo sobre as nossas vidas - de tokens de carbono ao move to earn- eu descobri o ReFi ( Regenerative Finance).E Portugal tem sido um super hub de encontro dos players ReFi. Não sei se na nossa aba temos só o Joker em Portugal, mas entre o dia 26 e 29 de maio vai ter um evento ReFi interessante: Unindo as finanças regenerativas e a gestão fundiária 🌈 De 26 a 29 de Maio vamos visitar a Tradicional Fábrica de Sonhos em Abela e alicerçar-nos na verdadeira RegeneraçãoA Tradicional Dream Factory é o espaço ideal onde podemos construir as pontes entre a cena ReFi e a regeneração do solo. Ao lado das palestras de tecnologia da Web3 para aprender o que é ReFi para os noobs e como podemos mergulhar mais fundo para os OGs, aplicaremos protocolos a projetos do mundo real e aprenderemos como cada um de nós pode ajudar a desenvolver um movimento 🌱Os alimentos serão fornecidos por um sistema regenerativo. Espere sujar suas mãos, seus corações cheios e suas mentes explodidas. .. vai ter sauna, yoga e várias outras coisas.https://spring.refidao.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399726",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "May 23, 2022, 10:58:04 PM",
      "body": "Obrigado pela partilha.Desconhecia por completo esse ReFi, e até esse evento.Realmente, apos uma pequena pesquisa, vi que é uma comunidade dedicada a natureza, que se instalou numa região de Portugal, bem remota e isolada (apesar de estar junto a uma aldeia).Só não percebi onde é que o blockchain encaixa nesse ecossistema, de liberdade com a natureza e tudo autossustentável.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "May 27, 2022, 03:27:58 PM",
      "body": "tava vendo essas novas siglas no gitcoin essa semana e achei curiosoprimeiro passo em direção à um futuro solarpunk? o que acham?já tem uns ReFis Brasileiros também?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 27, 2022, 03:59:08 PM",
      "body": "Quote from: Lucasgabd on May 27, 2022, 03:27:58 PMprimeiro passo em direção à um futuro solarpunk? o que acham?Dificil. Até porque a filosofia defendida por muitos nesses grupos, vai contra os sistemas que permitam todo o mundo estar ligado via Internet.Era preciso toda uma linha de produção e infra estruturas, que seguissem a mesma filosofia para se conseguir algo do género.Agora, haverá grupos que poderão fazer algumas coisas interessantes a respeito, mas sempre em pequena escala.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "May 28, 2022, 01:51:01 AM",
      "body": "Quote from: joker_josue on May 23, 2022, 10:58:04 PMSó não percebi onde é que o blockchain encaixa nesse ecossistema, de liberdade com a natureza e tudo autossustentável.O ReFi é completamente focado em blockchain, como tokenização de ativos naturais, pra permitir a conservação das areas, uso de florestas gameficadas, renda basica universal, tem várias aplicações. Só pra vocês terem ideia, há algumas semanas atrás, a Untamed levantou $24 M na rodada A liderada pela Animoda pra criar um jogo e metaverso focado em criar uma imersiva de 3D e NFTs para proteger habitats reais.LucasgabdSim, tem inclusive alguns membros brasileiros dentro do ReFiDAO, tem até uma comunidade curiosa no telegram chamada Crypto ReFi Piracanga rs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 28, 2022, 07:22:46 AM",
      "body": "Quote from: Disruptivas on May 28, 2022, 01:51:01 AMO ReFi é completamente focado em blockchain, como tokenização de ativos naturais, pra permitir a conservação das areas, uso de florestas gameficadas, renda basica universal, tem várias aplicações. Só pra vocês terem ideia, há algumas semanas atrás, a Untamed levantou $24 M na rodada A liderada pela Animoda pra criar um jogo e metaverso focado em criar uma imersiva de 3D e NFTs para proteger habitats reais.OK. Isso é bom e interessante.A questão é que eu vejo muito esses projetos, como projetos que não saem do papel ou se saem tem um impacto muito residual.São projetos, que permite os envolvidos estarem ocupados e terem o seu rendimento, mas depois pouco se vê na pratica.Mas talvez isto seja o meu ceticismo a falar, por já ter visto muitas coisas semelhantes que simplesmente não deram em nada em concreto.Pode ser que esteja enganado.Vai dando um feedback, conforme esses projetos se forem desenvolvendo em coisas mais concretas. Pode ser que um dia, compre uma arvore no Brasil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "May 28, 2022, 09:11:51 PM",
      "body": "Quote from: joker_josue on May 28, 2022, 07:22:46 AMA questão é que eu vejo muito esses projetos, como projetos que não saem do papel ou se saem tem um impacto muito residual.São projetos, que permite os envolvidos estarem ocupados e terem o seu rendimento, mas depois pouco se vê na pratica.Concordo 100% pelo se ceticismo, é uma questão extremamente válida pra mim. Mas eu ando pensando e se invertermos essa lógica?  E se ao invés de cripto ser o fim, como é no caso desses projetos, ela puder ser o meio? Talvez os cases mais interessantes sejam aqueles que já são operacionais, já estão resolvendo casos// problemas reais no mundo, mas que ainda não usam cripto. E nesse sentido, cripto seria uma tool para potencializar casos que já estão operacionais, já tem mercados e impacto positivo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 29, 2022, 07:17:11 AM",
      "body": "Quote from: Disruptivas on May 28, 2022, 09:11:51 PMConcordo 100% pelo se ceticismo, é uma questão extremamente válida pra mim. Mas eu ando pensando e se invertermos essa lógica?  E se ao invés de cripto ser o fim, como é no caso desses projetos, ela puder ser o meio? Talvez os cases mais interessantes sejam aqueles que já são operacionais, já estão resolvendo casos// problemas reais no mundo, mas que ainda não usam cripto. E nesse sentido, cripto seria uma tool para potencializar casos que já estão operacionais, já tem mercados e impacto positivo. Nisso concordo. Mas sabes qual é o problema?É que nesses casos, raramente há muito dinheiro a circular, e muitos dos que estão envolvidos não tem conhecimentos técnicos para esse tipo de implementação. Isso leva a que seja necessário recorrer a terceiros, o que em si não é um problema. O problema é que muitos desses terceiros, tem é interesse em haver \"muito dinheiro\", se o projeto não apelativo nesse sentido, menos propensos estão a se envolverem nele.Podes dizer: \"a madeira dá milhões, porque não se envolverem em projetos relacionados com a floresta?\"Porque dá milhões ao cartel da madeira. Na realidade, a floresta é pouco lucrativa, para quem esta fora desse cartel. Uma pessoa - e sei o que falo - que tenha apenas uma meia dúzia de hectares de arvore, é capaz de gastar uns $3~4k de manutenção, para obter passados uns 7~10 anos, apenas uns $7~8k. Parece que é o dobro!? Sim, é. Mas também é preciso que as arvores não ardem, que não apanhem nenhum tipo de doença. E é esperar que no ano da venda o mercado não esteja saturado, para que o valor não baixe para metade.Esses \"terceiros\", não tem interesse em esperar 10 anos, para ver \"se ganham\" alguma coisa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "May 29, 2022, 01:03:19 PM",
      "body": "Quote from: joker_josue on May 29, 2022, 07:17:11 AMNisso concordo. Mas sabes qual é o problema?É que nesses casos, raramente há muito dinheiro a circular, e muitos dos que estão envolvidos não tem conhecimentos técnicos para esse tipo de implementação. Isso leva a que seja necessário recorrer a terceiros, o que em si não é um problema. O problema é que muitos desses terceiros, tem é interesse em haver \"muito dinheiro\", se o projeto não apelativo nesse sentido, menos propensos estão a se envolverem nele.Esses \"terceiros\", não tem interesse em esperar 10 anos, para ver \"se ganham\" alguma coisa.Novamente eu concordo, mas acho que talvez seja mais positiva. Em todos os setores em que identificamos um problema geral, identificamos uma nova forma através da qual os setores podem ser re-organizar e otimizar suas operações. No caso da transição e da falta de conhecimento técnico, há várias soluções de frameworks low-code que estão sendo desenvolvidas e que talvez venha a substituir esses intermediários a medida que o setor vai se desenvolvendo.No caso das florestas, eu tenho uma tese de que as florestas tem caracteristicas muito proximas ao do bitcoin e de ativos que funcionam como reserva de valor e que apesar de ter um valor reconhecido por todos, é um ativo ainda não precificado, devido a falta de liquidez pela forma como a negociação de propriedades é feita. Acho que vai evoluir e consigo ver compradores que precisam pagar pela floresta em pé por suas operações comerciais - ex: coca-cola e cervejarias pela manutenção das bacias hidricas etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 30, 2022, 06:35:20 AM",
      "body": "Quote from: Disruptivas on May 29, 2022, 01:03:19 PMNovamente eu concordo, mas acho que talvez seja mais positiva. Em todos os setores em que identificamos um problema geral, identificamos uma nova forma através da qual os setores podem ser re-organizar e otimizar suas operações. No caso da transição e da falta de conhecimento técnico, há várias soluções de frameworks low-code que estão sendo desenvolvidas e que talvez venha a substituir esses intermediários a medida que o setor vai se desenvolvendo.Felizmente que isso é assim. Apenas é um processo mais lento, e poderá em alguns caso não chegar a tempo.Quote from: Disruptivas on May 29, 2022, 01:03:19 PMNo caso das florestas, eu tenho uma tese de que as florestas tem caracteristicas muito proximas ao do bitcoin e de ativos que funcionam como reserva de valor e que apesar de ter um valor reconhecido por todos, é um ativo ainda não precificado, devido a falta de liquidez pela forma como a negociação de propriedades é feita. Acho que vai evoluir e consigo ver compradores que precisam pagar pela floresta em pé por suas operações comerciais - ex: coca-cola e cervejarias pela manutenção das bacias hidricas etcSim, também acho que mais cedo ou mais tarde, grandes empresas começaram a ser mais ativas nesses setores ecológicos, por uma questão de necessidade, de modo a não perder a sua capacidade de produção. Não irão fazer isso por causa do motivo certo, mas vai acabar por ser útil para todos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 08, 2022, 12:36:40 AM",
      "body": "Hoje o Coinmarketcap adicionou o termo Regenerative Finance em seu glossário: https://coinmarketcap.com/alexandria/glossary/regenerative-finance-refiApesar de ser algo relativamente ´´bobo´´, fiquei bem feliz por isso, tanto por ter estudado um conceito cripto muito antes de entrar pro coinmarketcap, como pelo termo ser considerado ´´importante o suficiente´ pra entrar no glossário deles. Agora acho que vai gente talvez vai começar a conhecer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}