{
  "id": "topic_5438768",
  "title": "hacikahraman",
  "author": "hacikahraman",
  "created_time": "February 08, 2023, 12:08:39 PM",
  "content": "AYOS - Afet Yönetim ve Organizasyon Sistemi (WEB VE MOBİL UYGULAMASI PROJESİ)Herkese merhaba, 06.02.2023 tarihi, saat 04:17 de başlayan Kahramanmaraş merkezli 7.7 şiddetli depremlerin tüm Dünya’da yankı bulması ve sonrasında hem maddi hem de manevi olarak birçok ülkenin Türkiye Cumhuriyeti’ne destek vermesi sonrasında ve kişisel olarak haberleri takip etmem ve bir Şehir ve Bölge Plancısı olarak ülkeme ve dünya’ya gerçekten faydalı olabilecek bir Afet Yönetim ve Organizasyon Sistemi adlı bir proje geliştirmeyi düşündüm. Benim ismim Hacı KAHRAMAN ve İstanbul Teknik Üniversitesi Şehir ve Bölge Planlama Bölümü 2007 yılı mezunuyum. 14 yıldır Gayrimenkul Değerleme sektöründe çeşitli görevlerde bulundum. Halen bu sektörde Kontrolör olarak çalışmaktayım. Projemin ana başlıklarını burada belirtiyorum. Kişisel olarak hiçbir kaynağa sahip değilim ve bu projem eğer fonlanırsa sadece ülkeme  ve dünya millletlerine hizmet etsin diye bir açık fikir/fon/geliştirme temelli bir uygulama düşündüm. Lütfen herkes katkı sağlasın her anlamda (Fon, Fikir, Yazılım olarak geliştirelim.) Bildiğimiz gibi ülkemiz ne yazık ki deprem gibi çok ciddi deprem kuşağında olmasına rağmen hiçbir önem alınmamakta ve binlerce insan doğal afetlerde yaşamını yitirmekte, evsiz ocaksız kalmakta ve hayatları sönmektedir. Bu nedenle bu ve bunun gibi uygulamalarla insanların hayatlarındaki deprem gibi her türlü doğal afetin yaşamsal risklerini minimuma indirici bir projeye katkı sağlamak istemekteyim. Dediğim gibi proje tamamen açık bir kaynak kodlaması ve sistemi içinde olmalı. Benim kriptoparalar ile ilgili yeterli bir bilgim yok. İCO projelerinin kapsamlarının sınırlarını da tam bilmiyorum. Eğer bu tarz bir proje buraya uygunsa her türlü yardımlarınızı rica ederim. Eğer uygun değilse çok özür dilerim. Bunun yanında bu proje fikrini desteklemek ya da herhangi bir şekilde fikirsel/fonlama/yazılımsal olarak katkı sağlamak isteyen olursa çok sevinirim. Projenin tüm haklarını da açık tutuyorum ki herkes projeyi geliştirebilsin öncüsü ve katkı sağlayanı olsun. Benimle iletişime geçmek isteyen olursa mail adresim hacikahraman@gmail.com dur. Herkese teşekkür eder. Çok güzel günlerimizin olmasını dilerim. Sağlıcakla. İnşallah ülkemizin yaraları çok hızlıca sarılır ve böyle afetler zorunlu olarak yaşanacak olsa da biz önmemizi çoktan almış ve keyifle hayatımıza bakar halde yaşamımıza devam ederiz. İyi günler dilerim. ***. Afet Etkin Yönetim ve Sürekli Bilgilendirme Platformunun Kurulması ve Fonksiyonlarının İçeriği Hakkında Bilgilendirme 1. Afet Yakınlık Bildirimleri Sisteminin Sunulması 2. Afet Organizasyon ve Yardımlaşma Sisteminin Sunulması3. Afet İntikal ve Organizasyon Sisteminin Sunulması4. Vatandaştan acil durum bildirimi almak için acil afet konum ve iletişim bilgileri gönderim tuşunun sunulması5. Afet bölgesi insanlarına yardım sevkiyat haberdar etme bilgilendirme mesaj servisinin sunulması6. Yardım etmek isteyenlerin organizasyonu ve ulaşım sevkiyat lojistik sistematiğinin sunulması7. Afet öncesi, deprem anı ve sonrası bilgilendirme yayınlarının sunulması8. Afet Sürekli Fonlaması ve Organizasyonun sunulması9. Acil Durum İş Makinesi Organizasyonu ve Sevkiyat Yönetim Sisteminin sunulması10. Devlet, Asker, Hastane, STK anlık bilgilendirme ve organizasyonun sunulması11. Yapı Stoğu Analiz, Sentez ve Senaryo Dönüşüm Organizasyonun yapılması ve sunulması12. Teknik Personel Sürekli Yayını ve Örgütlenme Sisteminin sunulması",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438768",
  "comments": [
    {
      "author": "hacikahraman",
      "created_time": "February 08, 2023, 02:26:03 PM",
      "body": "AYOS - Afet Yönetim ve Organizasyon SistemiWEB VE MOBİL UYGULAMASI PROJESİHerkese merhaba, 06.02.2023 tarihi, saat 04:17 de başlayan Kahramanmaraş merkezli 7.7 şiddetli depremlerin tüm Dünya’da yankı bulması ve sonrasında hem maddi hem de manevi olarak birçok ülkenin Türkiye Cumhuriyeti’ne destek vermesi sonrasında ve kişisel olarak haberleri takip etmem ve bir Şehir ve Bölge Plancısı olarak ülkeme ve dünya’ya gerçekten faydalı olabilecek bir Afet Yönetimi, Organizasyon ve Acil Müdahale Sistemi adlı bir proje geliştirmeyi düşündüm. Benim ismim Hacı KAHRAMAN ve İstanbul Teknik Üniversitesi Şehir ve Bölge Planlama Bölümü 2007 yılı mezunuyum. 14 yıldır Gayrimenkul Değerleme sektöründe çeşitli görevlerde bulundum. Halen bu sektörde Kontrolör olarak çalışmaktayım. Projemin ana başlıklarını burada belirtiyorum. Kişisel olarak hiçbir kaynağa sahip değilim ve bu projem eğer fonlanırsa sadece ülkeme  ve dünya milletlerine hizmet etsin diye bir açık fikir/fon/geliştirme temelli bir uygulama düşündüm. Lütfen herkes katkı sağlasın her anlamda (Fon, Fikir, Yazılım olarak geliştirelim.) Bildiğimiz gibi ülkemiz ne yazık ki deprem gibi çok ciddi deprem kuşağında olmasına rağmen hiçbir önem alınmamakta ve binlerce insan doğal afetlerde yaşamını yitirmekte, evsiz ocaksız kalmakta ve hayatları sönmektedir. Bu nedenle bu ve bunun gibi uygulamalarla insanların hayatlarındaki deprem gibi her türlü doğal afetin yaşamsal risklerini minimuma indirici bir projeye katkı sağlamak istemekteyim. Dediğim gibi proje tamamen açık bir kaynak kodlaması ve sistemi içinde olmalı. Benim kriptoparalar ile ilgili yeterli bir bilgim yok. İCO projelerinin kapsamlarının sınırlarını da tam bilmiyorum. Eğer bu tarz bir proje buraya uygunsa her türlü yardımlarınızı rica ederim. Eğer uygun değilse çok özür dilerim. Bunun yanında bu proje fikrini desteklemek ya da herhangi bir şekilde fikirsel/fonlama/yazılımsal olarak katkı sağlamak isteyen olursa çok sevinirim. Projenin tüm haklarını da açık tutuyorum ki herkes projeyi geliştirebilsin öncüsü ve katkı sağlayanı olsun. Benimle iletişime geçmek isteyen olursa mail adresim hacikahraman@gmail.com dur. Herkese teşekkür eder. Çok güzel günlerimizin olmasını dilerim. Sağlıcakla. İnşallah ülkemizin yaraları çok hızlıca sarılır ve böyle afetler zorunlu olarak yaşanacak olsa da biz önlememizi çoktan almış ve keyifle hayatımıza bakar halde yaşamımıza devam ederiz. İyi günler dilerim. ***. Afet Etkin Yönetim ve Sürekli Bilgilendirme Platformunun Kurulması ve Fonksiyonlarının İçeriği Hakkında Bilgilendirme 1. Afet Yakınlık Bildirimleri Sisteminin Sunulması; Afet Öncesindeki uzman görüşleri ve afet öncesi anlık bildirimlerin direkt afet bölgesini etkileyen kişilerin telefon operatörlerine gönderimi ve geri bildirim istenmesi2. Afet Organizasyon ve Yardımlaşma Sisteminin Sunulması; Afetlerde yaşadığımız organizasyon yetersizliği nedeniyle can ve mal kaybı çok büyük olmaktadır. Bu nedenle kategorisel olarak afet organizasyonunun yapılması ve Devlet, STK, Acil Kurtarma Birimleri, Vatandaşlar, Kuruluşlar arasında etkin rol oynayabilecek bir düzenli chat, dosya, veri alışverişi sisteminin geliştirilmesi ve afetten etkilenme potansiyeli olan ya da afete mazur kalmış kişilerin anlık olarak iletişimlerinin bu servis sayesinde sağlanması3. Afet İntikal ve Organizasyon Sisteminin Sunulması; Afete intikal edecek yapıların tam bir organizasyon halinde olması gerekmektedir. Bunun nedeni ulaşımda ve müdahalede çok büyük karmaşa yaşanması ve çok büyük aksaklıklar yaşanması. Bu araç sayesinde afet bölgesine intikal edecek yapıların organizasyonunun sağlanması amaçlanmaktadır. Bu da telefon operatatörleri, mesajlaşma uygulamaları ve AYOS arayüzü sayesinde kolaylaştırabilir. En büyük eksiğimiz organizasyon planı yapamamak ve koordine olamamak. Bu sistemle bunun önüne geçeceğiz. 4. Vatandaştan acil durum bildirimi almak için acil afet konum ve iletişim bilgileri gönderim tuşunun sunulması; Tek tuşla acil durum bildirimi, konum verme ve alma, iletişim bilgilerini sistemimizde vatandaşların ve gerekli yapıların kullanımına sunacağız böylece afet durumunda sürekli bir koordinasyon olacak ve kurtarılması gereken kişilerin konumları sayesinde direkt müdahele edilebilecektir. Bu buton hayati önem taşımaktadır. İletişim bilgileri alınan afetzedelere psikolojik ve diğer acil müdahaleler sağlanacaktır bu sayede.5. Afet bölgesi insanlarına yardım sevkiyat haberdar etme bilgilendirme mesaj servisinin sunulması; Afet bölgesi insanlarının psikolojilerini ve organizasyonunu kuvvetlendirmek adına yardım haberleri anlık olarak taraflarına iletilecek ve afetzedeler daha tutarlı ve motivasyonlu ve disiplinli hareket edecektir.6. Yardım etmek isteyenlerin organizasyonu ve ulaşım sevkiyat lojistik sistematiğinin sunulması; Yardım etmek isteyen yapıların organizasyonu ve ulaşımı ile ilgili aktif harita ve ulaşım koordinasyonu sistemi kurulacaktır ve organize edilecektir.7. Afet öncesi, deprem anı ve sonrası bilgilendirme yayınlarının sunulması; Afet öncesi, sonrası ve anında vatandaşlarımıza her türlü profesyonel uzmanın görüşleri, makaleleri ve video yayınları ücretsiz sunulacaktır.8. Afet Sürekli Fonlaması ve Organizasyonun sunulması; Afet anında yapılan fonlamalar ülkemizin deprem güvenliğini pek arttırıcı çözümler getirmemektedir. Bu nedenle yapılması gereken fonlama dönüşüm temelli olmalıdır. Bu sürekli fonlama sistemi sayesinde sürekli bağış ve kentsel dönüşümün tutarlı bir sistematikte yapılması mümkünse yeni ve her türlü doğal afet riskine karşı yeni kentlerin kurulması sağlanmalıdır. Bunun için ulusal ve uluslar arası fonlama gerekmektedir. Mesela Çin, Amerika, Japonya gibi çok gelişmiş medeniyetler bizlere çok ciddi yardımlar sunabilir ve uygulamamızı kullanabilirler.9. Acil Durum İş Makinesi Organizasyonu ve Sevkiyat Yönetim Sisteminin sunulması; Afet durumunda ve öncesinde bölgesel olarak iş makinelerinin organizasyonu yapılması ve hazırda bekletilmelidir. İş makinelerinin aktif konum, iletişim ve yönlendirme envanteri aktif olarak sistemimizde sunulmalıdır.10. Devlet, Asker, Hastane, STK anlık bilgilendirme ve organizasyonun sunulması; Tüm ülkemiz afet anında teyakkuza geçmekte ancak organize olmada ve sistematik çalışmada çok sorun yaşanmaktadır. Bu sistem sayesinde tüm yapılar organize olabilecektir.11. Yapı Stoğu Analiz, Sentez ve Senaryo Dönüşüm Organizasyonun yapılması ve sunulması; Kentlerimizin en büyük sorunu yapı stoklarının dönüştürülememesi ve yeni kentleşmenin deprem sorununa ve afetlere cevap verememesidir. Yukarda belirttiğim gibi gerekli fonlama tüm vatandaşlarımızın ve kurum binalarının çağdaş deprem sistemine uygun dönüşümünü hedeflemektedir.12. Uydu Sistemlerinin, Haritaların, Uçak, Helikopter gibi hava, kara ve deniz ulaşım araçlarının organizasyonunun sunulması; Güncel uydu harita servislerinin aktif olarak kullanıcıların erişimine açılması ve diğer yapıların bu sistemlere tam organizasyonlarının sağlanması amaçlanmaktadır.13. Teknik Personel Sürekli Yayını ve Örgütlenme Sisteminin sunulması; Afet bölgelerindeki güncel afet riskleri hakkında sürekli bilgilendirme ve yayın kültürü geliştirmeyi hedeflemektedir.Çok teşekkür ederim ve umarım böyle bir projemiz olur da Tüm Dünya halkları faydalanır. Teşekkürler Levent Bey cevap verdiğiniz için hemen. Selamlar sevgiler.Hacı KAHRAMANhacikahraman@gmail.comŞehir ve Bölge PlancısıSPK Lisanslı Gayrimenkul Değerleme Uzmanı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mhanbostanci",
      "created_time": "February 09, 2023, 07:15:17 PM",
      "body": "Sayın Kahraman,Bu ana başlıklarla bir web sitesi ve mobil uygulama geliştirilebilir.Üstelik böyle bir projeyi yazılım otomasyon olarak ortaya koymak için milyonlar gerekmiyor.Bu tür projelerin 4 temel sıkıntısı vardır:1. Veritabanının oluşması yani içinin doldurulması. (bu en büyük sıkıntı, envanter çalışması çok büyük sıkıntı. kimde kaç tane iş makinası var nasıl çıkarılacak çok zor iş.)2. Platformun daha önceden yapılmış uygulamalar ve diğer çevre unsurlar (gsm operatörleri mesela)  ile entegrasyonu3. Uygulamanın geniş kitlelerce kullanımı için gerekli PR çalışması4. Platformun akreditasyonu ( Bu platform ilgili kurumlar tarafından tanınmalı.)projenin bence uçuk olan kısmı ise uluslar arası fon oluşturulması, dünya vatandaşları olarak daha imf yi doğru yapılandıramadık. bunu mu yapılandıracağız.Buna rağmen iyi niyetli çabanızı takdir etmemek olmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hacikahraman",
      "created_time": "February 09, 2023, 08:06:28 PM",
      "body": "Quote from: mhanbostanci on February 09, 2023, 07:15:17 PMSayın Kahraman,Bu ana başlıklarla bir web sitesi ve mobil uygulama geliştirilebilir.Üstelik böyle bir projeyi yazılım otomasyon olarak ortaya koymak için milyonlar gerekmiyor.Bu tür projelerin 4 temel sıkıntısı vardır:1. Veritabanının oluşması yani içinin doldurulması. (bu en büyük sıkıntı, envanter çalışması çok büyük sıkıntı. kimde kaç tane iş makinası var nasıl çıkarılacak çok zor iş.)2. Platformun daha önceden yapılmış uygulamalar ve diğer çevre unsurlar (gsm operatörleri mesela)  ile entegrasyonu3. Uygulamanın geniş kitlelerce kullanımı için gerekli PR çalışması4. Platformun akreditasyonu ( Bu platform ilgili kurumlar tarafından tanınmalı.)projenin bence uçuk olan kısmı ise uluslar arası fon oluşturulması, dünya vatandaşları olarak daha imf yi doğru yapılandıramadık. bunu mu yapılandıracağız.Buna rağmen iyi niyetli çabanızı takdir etmemek olmaz.Merhaba teşekkürler düşünceleriniz. Microsoft ile görüştüm projeyi optimize ettim. Uygulanabilir 5 maddeye düşürdüm. Başka bir 12.000 kişilik yazılım ordusu mevcut deprem için uygulamalar geliştiriyor şuan. O nedenle projemi askıya aldım benzer şeyler çıkar diye. Çok haklısınız dediklerinizde. Ancak fonlar istediğimiz düzeyde olabilir. Çünkü uluslararası yapılar gerçekten ciddi adımlar atıyorlar destek için. Olması gereken ile olması mümkün olan arasındaki ayrımı fark etmiş oldum ben de. Projemin 5 maddesi şöyle:1. Acil Yardım İsteği Servisi (İletişim, konum, ihtiyaç listesi bilgileri paylaşımı)2. Acil Yardım Bilgilendirme Servisi (Yardım ekiplerinin afetzede bilgilendirmesi)3. Fon Hesapları Paylaşımı Resmi Hesapların (Bağış hesapları paylaşımı4. Hasarlı bina formu5. Afet haber, blog, video bilgilendirmesiBu şekilde yapılabilir uygulama.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hacikahraman",
      "created_time": "February 10, 2023, 12:47:04 PM",
      "body": "Merhaba Han Bostancı, bu projeyi İCO coin projesi olarak yayımlayabilir miyiz? Çok iyi olurdu fon açısından ve bağlantı geliştirme açısından.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "February 10, 2023, 07:13:13 PM",
      "body": "Hacı Bey, Telefondaki bir uygulamayla kişinin koordinatlarını (ve tercih ettiği temel bilgilerini) düzenli olarak güncelleyip afet veri bankasına gönderen bir Dapp olabilir. Kapsama bölgesindeki bütün binaların envanteri çıkarılabilirse burada deprem, sel, yangın vb felaketlerden zarar görmüş binalarla kişilerin koordinatları anında eşleştirilerek belki bir acil cevap uygulaması geliştirilebilir.Bununla ilgili kripto token çıkarma ve tanıtım gibi bütün işlerde Bounty Detective ekibiyle birlikte size destek olabiliriz, özelden veya telegramdan bana yazabilirsiniz, iyi çalışmalar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}