{
  "id": "topic_5403816",
  "title": "VKcams.com",
  "author": "VKcams.com",
  "created_time": "June 23, 2022, 09:07:04 PM",
  "content": "What temperature does the EU recommend so I don't die of heat?It's nighttime and I have +29 Celsius.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403816",
  "comments": [
    {
      "author": "alterra57",
      "created_time": "June 23, 2022, 09:12:35 PM",
      "body": "Check what the temperature outside is and lower it at least 6 degrees under that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "June 23, 2022, 09:16:17 PM",
      "body": "Quote from: alterra57 on June 23, 2022, 09:12:35 PMCheck what the temperature outside Just +29I'm worried about official recommendations.They only talked about heating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alterra57",
      "created_time": "June 24, 2022, 09:58:14 AM",
      "body": "Quote from: VKcams.com on June 23, 2022, 09:16:17 PMQuote from: alterra57 on June 23, 2022, 09:12:35 PMCheck what the temperature outside Just +29I'm worried about official recommendations.They only talked about heating.Why would you be worried about official recommendations? Just lower it to where it's comfortable for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "June 24, 2022, 10:04:34 AM",
      "body": "Quote from: alterra57 on June 24, 2022, 09:58:14 AMWhy would you be worried about official recommendations? Just lower it to where it's comfortable for you.Now is +34.To pay my respects to Ursula von der Leyen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AndreiGeep",
      "created_time": "June 26, 2022, 01:51:37 AM",
      "body": "Maybe between 21 and 27 Celsius. Probably somewhere in between around 24. Try in between and maybe move up or down the temperature untill comfortable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Emil364",
      "created_time": "August 22, 2022, 09:44:11 PMLast edit: August 31, 2022, 12:07:45 PM by Emil364",
      "body": "I was dying of heat the other day, too, and then it turned out that my heating was working. Why I needed it in the summer, I did not understand. It turned out that the problem was with the radiators. It was worth replacing them. I finally got some fancy batteries installed. Because the plain white ones were boring me. And these look classy. Love these funky radiators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 23, 2022, 08:12:39 PM",
      "body": "Something like 17C is comfortable temperature to have inside the home. You will be able to get a nice sleep at that temperature. I am in the UK at the moment & very few people have air con in their private homes, most businesses & hotels do though. I appreciate mainland Europe has hot summers though & no air con would be very uncomfortable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "August 24, 2022, 08:06:35 AM",
      "body": "Quote from: DeathAngel on August 23, 2022, 08:12:39 PMSomething like 17C ...In Milan, Mayor Sala did not issue any ordinance, but limited himself to some recommendations: set the air conditioner not below 26 degrees in offices, homes and commercialI activities, close the door in stores (even if equipped with \"air blades\"), pay attention to switches and turn off the light at the end of the shift (for public employees)....https://www.ilmattino.it/economia/news/gas_austerity_risparmio_energetico_italia_lampioni_spenti_condizionatori_cosa_succede_news-6864376.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "August 24, 2022, 08:24:39 AM",
      "body": "Good topic to bump: several European countries now don't allow public places to set the air conditioning under 27 oC. The last German shop I went to was uncomfortably warm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 28, 2022, 02:24:31 PM",
      "body": "Quote from: LoyceMobile on August 24, 2022, 08:24:39 AMGood topic to bump: several European countries now don't allow public places to set the air conditioning under 27 oC. The last German shop I went to was uncomfortably warm.That’s crazy, must be because of their cuckold kind of attitude towards pleasing climate change lunatic groups. 27C indoors is uncomfortable as you said.Anything higher than early 20 degrees C is top warm inside.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 29, 2022, 07:48:44 AM",
      "body": "Quote from: DeathAngel on August 28, 2022, 02:24:31 PMThat’s crazy, must be because of their cuckold kind of attitude towards pleasing climate change lunatic groups.Actually, it's because of the current natural gas shortage, caused by dependence on a certain country in combination with economic sanctions against that country.QuoteAnything higher than early 20 degrees C is top warm inside.Coming winter it won't be allowed above 19. I'm looking forward to that, shops are usually too warm when wearing a winter jacket.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}