{
  "id": "topic_5521879",
  "title": "bigmanik",
  "author": "bigmanik",
  "created_time": "December 06, 2024, 07:04:16 PMLast edit: December 06, 2024, 07:30:34 PM by bigmanik",
  "content": "Well, few hours ago, I came across a post online Apparently, US Bitcoin ETFs now own more Bitcoin than Satoshi Nakamoto This firm was actually recently launched, I think, in January They are not even a year old And although the amount of coin they have more than Satoshi is actually much, it is still very surprising I actually do commend them for this Now, this brings me to a very important question Do you think Satoshi is still alive?And if he is, do you think he will be happy about this ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5521879",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 06, 2024, 07:18:28 PM",
      "body": "Quote from: bigmanik on December 06, 2024, 07:04:16 PMApparently, US Bitcoin ETFs now own more Bitcoin than Satoshi NakamotoThis firm was actually recently launched, I think, in JanuaryDo not get it wrong. Satoshi did not mine the coins for many years. Also January of this year is a long period of time and not recently. This is also not worth comparing. It is like comparing the coins that some people are having to the coins that Satoshi mined. Also know that this was just an estimate because nobody knows the exact amount of coins mined by Satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "December 06, 2024, 07:24:43 PMLast edit: December 06, 2024, 07:37:18 PM by d5000",
      "body": "\"The US ETFs\" are several entities. On the other hand, it's not sure if Satoshi really owns >1 million coins, although Sergio Demian Lerner has found a lot of evidence it's not completely clear.The biggest single owner is iShares (BlackRock) with 500.000 BTC, which is a lot but far away from Satoshi's alleged fortune. But there are two catches:1) the ETFs do not \"own\" the Bitcoins legally, it's their customers,2) the ETFs are not even custodians, that's Coinbase in most of the cases.How much Bitcoins has Coinbase under its custody? I've found a figure from September and it's actually 2,7 million Bitcoins it seems!Yes, I don't think Satoshi would be happy about this, if he's the idealistic guy many think he is. But one never knows. Some think he's a state-sponsored actor. He could however also be some of the guys who founded one of the big Bitcoin service providers ...PS: The largest single owner (i.e. those who have legal ownership of their coins) is currently MicroStrategy with 400k. However, this is less than Grayscale had at its heyday (600k) and it wasn't a spot ETF at this time so they had still legal ownership.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "December 06, 2024, 07:26:06 PM",
      "body": "Santoshi Bitcoin is privately owned and individual, unlike the Bitcoin ETFs holdings belongs to a group of companies and individuals, so we can't compare the amount of tge Bitcoin holdings innthe ETFs accounts to that if Satoshi to avoid getting ourselves confused, and as a matter of fact, everything that Satoshi anticipated and expected for Bitcoin is right now happening so anyone in his shie will be happy wuth the current happenings.Bitcoin is gaining mainstream attention and adoptions which is what all of us look forward to for a very long time now, let say we all are excited and Bitcoin ETF is one of the reasons for the current wave of the Bitcoin market value seeing Bitcoin above $100k is something that none of us expected at this period in time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "December 06, 2024, 07:47:20 PM",
      "body": "Quote from: Wiwo on December 06, 2024, 07:26:06 PMSantoshi Bitcoin is privately owned and individual, unlike the Bitcoin ETFs holdings belongs to a group of companies and individuals So from what you're saying here Satoshi an individual, I'm not convinced that Satoshi in his/their anonymous state is an individual. OP, of course the said ETFs are not a single entity but several entities and holdings of individuals including and it has been long awaited for some people to take part in this investment hence the quantity of bitcoin they hold is not a surprise to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "December 06, 2024, 07:54:20 PM",
      "body": "Quote from: bigmanik on December 06, 2024, 07:04:16 PMWell, few hours ago, I came across a post online Apparently, US Bitcoin ETFs now own more Bitcoin than Satoshi Nakamoto This firm was actually recently launched, I think, in January They are not even a year old And although the amount of coin they have more than Satoshi is actually much, it is still very surprising I actually do commend them for this Now, this brings me to a very important question Do you think Satoshi is still alive?And if he is, do you think he will be happy about this ?To start with, bitcoin spot ETFs is not a single holder and are not directly bitcoin investors, some of them that constitute the said name are investors of bitcoin and other shares and centralized bonds.While on the other side, from the image post, there is need for more clarifications here, US government is not a holder likewise i don't see Chinese government as one, Binance is an exchange and we could see how the investors in their large numbers secures their assets with them and these funds are not directly theirs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "December 06, 2024, 07:54:39 PM",
      "body": "Firstly no one actually knows the exact amount of bitcoins Satoshi mined before he disappeared. What you see on the internet is basically an estimate of what he probably mined before he vanished. Satoshi didn't mine for years he as well as several old miners back then had the advantage of very low difficulty compared to now and huge block reward of 50BTC per block. Back then when Satoshi mined it was possible to pack a ton of block rewards by mining with just a GPU that measures up to a good gaming pc.In addition to all these, when Satoshi mined back then he scattered the mining rewards across different addresses which is partly also why you can't track the exact amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hazink",
      "created_time": "December 06, 2024, 09:56:07 PM",
      "body": "Quote from: Churchillvv on December 06, 2024, 07:47:20 PMQuote from: Wiwo on December 06, 2024, 07:26:06 PMSantoshi Bitcoin is privately owned and individual, unlike the Bitcoin ETFs holdings belongs to a group of companies and individuals So from what you're saying here Satoshi an individual, I'm not convinced that Satoshi in his/their anonymous state is an individual. Some said they are a group of people; others said it's just an individual, but whichever one it is, the overused phrase is to refer to it as a single person, even if it's for a group of people. As far as SATOSHI is concerned, I believe it to be one person, so Wiwo is not wrong for referring to him as an individual. You are also not wrong; all we know is \"SATOSHI owns a high volume of bitcoin, which the number is not really that certain and accurate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "December 06, 2024, 10:19:06 PM",
      "body": "Quote from: Doan9269 on December 06, 2024, 07:54:20 PMTo start with, bitcoin spot ETFs is not a single holder and are not directly bitcoin investors, some of them that constitute the said name are investors of bitcoin and other shares and centralized bonds.While on the other side, from the image post, there is need for more clarifications here, US government is not a holder likewise i don't see Chinese government as one, Binance is an exchange and we could see how the investors in their large numbers secures their assets with them and these funds are not directly theirs.In addition Satoshi is claimed to be an Individual and the US spot ETF consists of investors. It's nothing for Satoshi to be worried about, who bypasses him or not. He is happy for the success of his investment. However, the only image this table paints is that with enough money, brands, companies, or individuals can stack up BTC more than most decades ago holders did, during their mining days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "December 06, 2024, 10:49:46 PM",
      "body": "Quote from: bigmanik on December 06, 2024, 07:04:16 PMWell, few hours ago, I came across a post online Apparently, US Bitcoin ETFs now own more Bitcoin than Satoshi Nakamoto This firm was actually recently launched, I think, in January They are not even a year old And although the amount of coin they have more than Satoshi is actually much, it is still very surprising I actually do commend them for this It's actually a merged quantity owned by many companies that do trade or involved with Bitcoin ETFs.Quote from: bigmanik on December 06, 2024, 07:04:16 PMNow, this brings me to a very important question Do you think Satoshi is still alive?Let's leave him at peace I guess if he chose to go away and leave mysteriously, he'd won and we have to settle with that.Quote from: bigmanik on December 06, 2024, 07:04:16 PMAnd if he is, do you think he will be happy about this ?100%. He's made a great creation and that's why he surely is happy about it and knowing that he's got some BTC's left, he's one of the richest already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 06, 2024, 11:03:11 PM",
      "body": "That's how ETFs companies/exchanges gain more profit, them dumping those coins is our less of concern since i don't think they will do it as they continue to gain profits from it even just holding it while their users try to trade of these exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "December 06, 2024, 11:17:38 PM",
      "body": "Quote from: bigmanik on December 06, 2024, 07:04:16 PMNow, this brings me to a very important question Do you think Satoshi is still alive?And if he is, do you think he will be happy about this ?At this point in the life of Bitcoin, I'm not sure the community would still be bothered whether Satoshi is alive or not. I mean, Bitcoin has been doing well without his presence after its creation and his absence seems to have been fuelling that. So, we rest that case.About Satoshi being happy or not the way things have turned? I'm not sure he would be happy. He wanted it to be a means of payment but sadly (good thing though) Bitcoin has transcended that into a speculative asset.I hate to see the Chinese government as a top hodler of Bitcoin, knowing how it tried on several occasions to strangulate Bitcoin's growth and adoption through its bans. Gosh!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "December 06, 2024, 11:38:36 PM",
      "body": "Quote from: bigmanik on December 06, 2024, 07:04:16 PMApparently, US Bitcoin ETFs now own more Bitcoin than Satoshi Nakamoto This firm was actually recently launched, I think, in January They are not even a year old And although the amount of coin they have more than Satoshi is actually much, it is still very surprising I actually do commend them for this Now, this brings me to a very important question Do you think Satoshi is still alive?And if he is, do you think he will be happy about this ?Whether Satoshi Nakamoto is actually alive or dead no one knows and can't guess. Likewise, no one knows the exact number of bitcoins he holds, and that number (1.1 million) is also a guess. If Satoshi is alive and if he continues to hold bitcoins, no one should have more bitcoin holdings than Satoshi. But if he were to die, the number of bitcoins held by various large holdings in the future would surely be greater than Satoshi's predictable number.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "December 07, 2024, 02:06:45 AM",
      "body": "Quote from: bigmanik on December 06, 2024, 07:04:16 PMWell, few hours ago, I came across a post online Apparently, US Bitcoin ETFs now own more Bitcoin than Satoshi NakamotoCompare Satoshi Nakamoto, a single entity with Bitcoin Spot ETFs that are many different entities is not a good comparison. A note about Satoshi Nakamoto identity, we don't know true identity of Satoshi Nakamoto, that entity can be a person, group of people, an organization.QuoteThis firm was actually recently launched, I think, in January They are not even a year old They are not a firm, and Bitcoin Spot ETFs in the USA are products of different firms, a dozen of companies in the USA.Some Bitcoin Spot ETF trackers.https://etfdb.com/themes/bitcoin-etfs/https://www.coinglass.com/bitcoin-etfhttps://farside.co.uk/?p=997",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "December 07, 2024, 03:41:29 AM",
      "body": "Your data might not be true. This is because there is no public data on How much does Satoshi actually own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 07, 2024, 03:56:29 AM",
      "body": "Quote from: bigmanik on December 06, 2024, 07:04:16 PMApparently, US Bitcoin ETFs now own more Bitcoin than Satoshi Nakamoto Wait here. You can't just make an assumption then create a comparison based on that guess as if it it were a fact. Nobody knows how much bitcoin Satoshi owns. So your comparison here makes no sense at all.QuoteDo you think Satoshi is still alive?And if he is, do you think he will be happy about this ?When people don't know his identity, they also don't know of his state and how much bitcoin he owns!And why would he be happy or unhappy about a group of people who made a company owning bitcoin! Bitcoin was created so that anybody, literally anybody, can use it however they like. If some people chose to create a firm and then use other people's money to buy a lot of bitcoin, that is part of being permissionless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "December 07, 2024, 04:14:02 AM",
      "body": "although these BTC in ETF are custodian in nature, i think the owner is still the people who bought it, I don't think it's that much of a problem from my opinion. I mean yes we're at the risk of third party keeping our BTC and maybe some people consider these BTC are actually owned by those institutions because not our key not our bitcoin, but then again it's what it takes for BTC to get legal acknowledgement and be considered legitimate which might opens up for wider adoption.if we look at the recent inflow, ETF has been quite massive so far in attracting capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "December 07, 2024, 04:19:47 AM",
      "body": "Quote from: d5000 on December 06, 2024, 07:24:43 PM1) the ETFs do not \"own\" the Bitcoins legally, it's their customers,2) the ETFs are not even custodians, that's Coinbase in most of the cases.How much Bitcoins has Coinbase under its custody? I've found a figure from September and it's actually 2,7 million Bitcoins it seems!According to arkhamintelligence, Coinbase have 930K Bitcoin which technically they should appear in the list. Yeah ETFs are mostly held by Coinbase, only few companies willing to custody the coins by themselves.If we talking the truth, most companies and government still not trust in Bitcoin, instead they use Bitcoin to make profit. They earn annual fees from ETFs, they earn Bitcoin after seizing from criminals etc, they never bought the coins by themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "December 07, 2024, 04:32:09 AM",
      "body": "ETFs are mostly owned by institutional and retail investors. The bigger ETFs's meant more interest from institutional and retail investors. I believe most of institutional investors are holding BTC for long term. Meanwhile, retail investors used it as their IRA. There's nothing to feel worry about, even if ETFs surpassed 5 millions BTC, and i'm fine. Still waiting for China to compete for the Bitcoin race with US. This is gonna massive.As for Satoishi, i have no comment about him. He and his bitcoin always remain a mystery forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "December 07, 2024, 04:35:01 AM",
      "body": "It’s misleading to think they really own that Bitcoin. It’s a company holding it on behalf of investors, so the true owners are the people who invested betting on the value of bitcoin. Comparing this to Satoshi’s holdings isn’t accurate. Satoshi could be one person or a group who can move their Bitcoin whenever they choose, while ETFs don’t have that freedom, as they are just entrusted to it. An ETF not literally works like a bank, but we could use this simple example like when we deposit money into a bank, it doesn’t mean the bank owns that money. It’s just reflected on their balance sheet as total deposits. Similarly, ETFs hold Bitcoin, but the ownership lies with the investors, not the fund itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}