{
  "id": "topic_5414080",
  "title": "Abbati",
  "author": "Abbati",
  "created_time": "September 19, 2022, 09:18:07 AM",
  "content": "As a newbie and someone who want to be comfortable in this forum, I observed that they're certain things that deserves attention from mods and administrators.This user JollyGood after going through his profile and the trust feedback, I decided to make this post for clarification on what and how high quality posts looks like. Seeing him with high positive feedback and some negative feedback made me to go through his profile.A sets of users were tagged by him as producing a low quality posts which made me to compare some posts and came up with this thread. To make it short, I will post just one post from some of the accounts that were tagged as producing low quality posts. Here we go...Victim 1 postQuote from: Daltonik on September 17, 2022, 10:47:56 AMNow there are 3 tokens in the Aidi Finance ecosystem: Aidi(BSC), Aidi(Matic) and Verse(Matic), and it's hard to say which one is better. If you are going to trade in the short term, then it seems to me that Aidi(BSC) will be better since now the price is quite low ~$0.08204, but in January after the merger with the Aidi(Matic) token, the price will certainly be different, but the number of tokens in circulation will decrease to 48,000,000 (from 48 trillions). And in the long run, maybe Verse, which now costs $0.18, but its ATH reached almost $6 and a total of 5,000,000 tokens, so I think it has potential, provided that the project gets further development, because the team started with 12 developers, of which 5 are left at the moment. And of course, do not forget the basic principle of investing in crypto, spend exactly as much as you can afford to lose.Victim 2 postQuote from: Bhig Daddy on September 16, 2022, 05:00:10 PMWell most of my fellow members in this forum have provided with a lot of link that can help you so I won’t have much to say but to advise you that this forum is one of the most active and beneficial forum about bitcoin you will ever come across. You just have to be punctual and willing to learn by giving this forum total time and devotion. And when also you come across a problem feel free to post about it and rest assure you will be provided with solutions.Victim 3 postQuote from: NdaMk on September 12, 2022, 07:52:35 PMAlthough I know Halland will surely compete for the golden boot but I never thought he could just set the pace like this. Sincerely Halland is having it easy on this, because either the regular frontiers are having issues with there club or they are shadow of them.First is Sallah, two goals in six matches no one saw this coming but his goal drought has been caused by the switch of roles by Klopp. Sallah was the pointed man during his mane-firmino-sallah trident. But right now he does the hard work mane and firmino were doing before and this has also affected the entire Liverpool teamNext is Harry Kane, one thing with him is he is always cold at the start of a season then goes back to normal middle of the season. I was even surprised to see him score in his sacred month (August). But let's wait and seeVictim 4 postQuote from: ololajulo on September 15, 2022, 12:44:17 PMTo add to it, the price of bitcoin cant go parabolic until after the halving. Ethereum is 20% of the marketcap while Bitcoin is about the double of it, it is a very good achievement for ethereum to stay this high at this time in the bear. Now the merge is done, which I think is the great biggest news of development in the space this year, lets see what goes ahead with the price and other altcoins. According to willy woo, the previous features of the market bottom had not reached but we are very close.Victim 5 postQuote from: Yawa2020 on September 18, 2022, 10:07:56 AMBayern needs a midfielder and good striker. Even the Barcelona game, they did not dominate as such. I wonder why they thought they never needed a striker just like Chelsea. I don't see them going far in UEFA champion's league. They might win bundesliga because it is a weak league. Although using the league at this stage to find out the right dynamics is not a bad idea but they need to find an alternative to the football system that was adopted for the past long years and that was based on a #9 striker. To make everything short and precise, I will stop at this 5. Now let see one among the posts of jollygood who accused other users of making low quality posts. Here we go...Quote from: JollyGood on September 18, 2022, 08:20:30 PMArsenal knew they would win because Brentford are not playing well, they will struggle this season. Arteta knew it would be easy 3 points which would take them back to the top of the table. I think Arsenal will behind Manchester City, Tottenham Hotspur and Manchester United and they will be challenging Liverpool for the 4th and final Champions League spot.Let us all be fair and not bias, which among of these quotes Post is low quality for God sake? I don't know for you but I have my answer already which I believe you all know.The victim 1-5 posts are not in anyway a low quality post. For equity to prevail, I am aware that the forum has standard for quality and low quality posts but I want JollyGood to tell the forum the criteria he uses to access posts before giving his verdict and tagged it a low quality posts and, provide the victim's post he deleted as low quality post for others to see as well. How can you delete posts and still put it on the reference section? How do you want others to check your assertion? Where is the justice?In conclusion, JollyGood should review the tags because it is seen as abuse of trust and way to intimidate the upcoming users. However, I can say BitcoinGirl.Club has been vindicated for sayingQuoteThe user used to be a scam buster (past) but now he use his earned reputation to process nonsense against the people he do not like, make others his hostage with the red tag, demands unlawful private information to share and protect his employers to secure his job. Do not take any tag left by him as good reference.In one of the comments on trust feedback of JollyGood.Tagging people's account for low quality post while you're also not perfect is absolutely hypocritical. No shade!This post is not sponsored or not in any way to dent the reputation of anyone but to ensure the forum is serene and, where there's freedom for anyone as it suppose to be and not to be a ground of intimidation where the strong oppress the weak.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414080",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 19, 2022, 09:35:00 AM",
      "body": "Many reputable members on this forum now against how Jollygood is using the trust feedback to the extent I read a post he was referred to as Jollybad. I like the kind of people that would accept others to be right when no one is in his support. I hope Jollygood would change and make use of the trust feedback appropriately. As for moderators and admin, they may do nothing for now as they do not want to interfere with trust system. Trust system is not moderated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 19, 2022, 11:53:05 AM",
      "body": "I thought Jollygood was giving negative tag to those 5 members, but when I checked it turns all of them was got neutral tag, so where's the abuse of trust is? It's completely fine to leave a message with neutral tag, if other users are disagree with Jollygood personal message, they can vouch the user didn't a low quality poster or asking Jollygood to recheck their posts. If it's negative tag I will it's abuse of trust, but the truth isn't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 19, 2022, 12:29:40 PM",
      "body": "The reference link is incorrect. It leads simply to the topic, and no one can verify its authenticity. Perhaps you, Jollygood, need to add a link from the archives if you really want to. OP, the neutral tag doesn't mean anything; actmyname does exactly the same, but it's much clearer and has a blacklist. Maybe you, Jollygood, should do something similar. And people would have fewer questions. Also, just reporting the post to the moderators and letting them judge the correctness of the post could also solve the problems with another impending drama.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abbati",
      "created_time": "September 19, 2022, 12:41:45 PM",
      "body": "Quote from: Solosanz on September 19, 2022, 11:53:05 AMI thought Jollygood was giving negative tag to those 5 members, but when I checked it turns all of them was got neutral tag, so where's the abuse of trust is? It's completely fine to leave a message with neutral tag, if other users are disagree with Jollygood personal message, they can vouch the user didn't a low quality poster or asking Jollygood to recheck their posts. If it's negative tag I will it's abuse of trust, but the truth isn't. So tagging someone's account with neutral seems like a good compliment to you right? It's a defamation of account and that's a bad reputation to the affected users. No one will care if they really produce low quality posts as he claimed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "September 19, 2022, 01:10:43 PM",
      "body": "Quote from: Abbati on September 19, 2022, 12:41:45 PMSo tagging someone's account with neutral seems like a good compliment to you right? It's a defamation of account and that's a bad reputation to the affected users. No one will care if they really produce low quality posts as he claimed.You may be misinterpreting the given neutral tag. neutral tags will not affect the account's reputation. the account will still be able to register for the campaign (as long as it is not blacklisted by the bounty manager).nothing moderates this system running. JollyGood and the other members have their own opinion on what they see.OP, if you are a part of this drama I hope you communicate with the account that tagged it. asking for time to improve post quality and also asking for tag removal.with that, I think all will get satisfaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "September 19, 2022, 02:00:25 PM",
      "body": "Quote from: Abbati on September 19, 2022, 09:18:07 AMAs a newbie and someone who want to be comfortable in this forum, I observed that they're certain things that deserves attention from mods and administrators.Since trust system is not moderated, there is nothing that mods and administrators can do, even if you prove (which you btw didn't do) that Jollygood abused trust system. The only ones that can do something about are DT members, if enough of them exclude him from their trust list. I suggest you to check how trust system actually works before creating similar threads.Quote from: Abbati on September 19, 2022, 09:18:07 AMHow can you delete posts and still put it on the reference section? How do you want others to check your assertion? Where is the justice?You are right here, he should have archived the posts he used as a reference for a feedback.Quote from: Abbati on September 19, 2022, 12:41:45 PMSo tagging someone's account with neutral seems like a good compliment to you right? It's a defamation of account and that's a bad reputation to the affected users. No one will care if they really produce low quality posts as he claimed.Neutrals are used so all sort of things and I don't think that one neutral feedback will prevent someone from joining the campaign if he is a decent poster. On top of that, a lot of members around here know that Jollygood is tends to be easy on negative feedbacks so I don't think that it has as much weight as you might think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "September 19, 2022, 03:06:10 PM",
      "body": "Quote from: Abbati on September 19, 2022, 09:18:07 AMThis post is not sponsored or not in any way to dent the reputation of anyone but to ensure the forum is serene and, where there's freedom for anyone as it suppose to be and not to be a ground of intimidation where the strong oppress the weak.You're displaying an excerpt of that user's post, which has nothing to do with what is marked by: @JollyGood.He doesn't care that your post quote, @JollyGood, is known for his aggressive nature, he tagged the user based on his own results, as below.You must take from the trust neutral the Reference in that user's profile, for your clarification purposes.example:1. Daltonik• https://bitcointalk.org/index.php?topic=5412487.msg60892937#msg608929372. NdaMk• https://bitcointalk.org/index.php?topic=5275303.msg60962392#msg60962392The problem is because @JollyGood, giving neutral is not your quote, but based on the Referece in the user's profile, what you argue has nothing to do with your quote, you have to refer to the Referece.If you don't want to deal with @JollyGood, don't post in his thread, if you don't know about gambling or sports, lest you get labeled a low quality user.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Panglima Perang",
      "created_time": "September 19, 2022, 04:13:07 PM",
      "body": "Quote from: NdaMk on September 12, 2022, 07:52:35 PMAlthough I know Halland will surely compete for the golden boot but I never thought he could just set the pace like this. Sincerely Halland is having it easy on this, because either the regular frontiers are having issues with there club or they are shadow of them.First is Sallah, two goals in six matches no one saw this coming but his goal drought has been caused by the switch of roles by Klopp. Sallah was the pointed man during his mane-firmino-sallah trident. But right now he does the hard work mane and firmino were doing before and this has also affected the entire Liverpool teamNext is Harry Kane, one thing with him is he is always cold at the start of a season then goes back to normal middle of the season. I was even surprised to see him score in his sacred month (August). But let's wait and seeCorrect me if I wrong, I saw post made by @NdaMk can't said as low quality post depending he talk with player statistic on primer league until running several games. He has give fact about how many goals scoring by Haaland, Firmino, Salah and he talk about Liverpool losing Sadio Mane in this time window transfer.I don't know what his reason claimed another post always low quality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "September 19, 2022, 06:10:29 PM",
      "body": "Quote from: Abbati on September 19, 2022, 12:41:45 PMSo tagging someone's account with neutral seems like a good compliment to you right? It's a defamation of account and that's a bad reputation to the affected users. No one will care if they really produce low quality posts as he claimed.It's not seems like good but the thing is that since you have being a negative tag and it confirmed that the negative have to be changed to neutral, he will do so by turning it neutral. Given someone neutral stand as a warning by telling the user that is about to do or what is doing is absolutely wrong, so that's the essence of neutral tags as a reminder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "September 19, 2022, 07:06:04 PM",
      "body": "Quote from: Abbati on September 19, 2022, 12:41:45 PMSo tagging someone's account with neutral seems like a good compliment to you right? It's a defamation of account and that's a bad reputation to the affected users. No one will care if they really produce low quality posts as he claimed.Trust isn't moderated. Jollygood is overzealous in some cases with his tags, but in this particular case neutrals are fine. He isn't red tagging users for what he deems low quality. BTW why do you not consider these posts you mentioned \"low quality\"? Just because there are a bunch of words? So if I post, blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blahblah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blah blah blah blah blah blah bitcointalk blah blah blah blah blahit's ok because I had alot of words and mentioned the forum? Or whatever the subject is that i'm supposed to be talking about? We all have different ideas about what is good or bad quality. Noone is ever gonna think the same way. We might agree from time to time with each other, but we all have different ideas generally about quality. Instead of making a post on someone because they neutral tagged people. Message the user and ask him personally why he considers the posts low quality. He may or may not respond(likely will not(, but at least make an effter before calling someone out on their opinions IMO. If no response, try to appeal to the community. Another question, why do you care? Are you one of these accounts? Are they your friends? Are you just generally interested in Jollygood? Do you have a personal vendetta against Jollygood?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "September 19, 2022, 07:27:21 PM",
      "body": "I believe those who've received tags, whether from Jollygood or any other user, must be feeling downcast especially if the tags were on an accusation of producing low quality posts. That isn't even why the trust system was set up by the forum, I don't think that's an angle to it. Tags are meant to look into scam activities and related matters but I get to find some members misuse its application. Tagging a user because of perceived low quality posts, whether neutral or not, it's not a good way of handling such. We should encourage one another to be better instead of disparaging or putting another down simply because we feel they don't meet our set standard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "September 19, 2022, 07:39:34 PM",
      "body": "Quote from: Abbati on September 19, 2022, 09:18:07 AMThis post is not sponsored or not in any way to dent the reputation of anyone but to ensure the forum is serene and, where there's freedom for anyone as it suppose to be and not to be a ground of intimidation where the strong oppress the weak.I don't know what makes you so motivated to care about neutral tags on that 5 accounts by JollyGood, in fact I didn't even find any of the accounts you mentioned ever complaining on reputation boards because of neutral tags. I wonder why you care about that neutral tag while previously JollyGood also tagged some other accounts [spammers] with red tags? See the references in some of these accounts if abuse of trust systems is an excuse for you.1. https://bitcointalk.org/index.php?action=trust;u=4661162. https://bitcointalk.org/index.php?action=trust;u=9555103. https://bitcointalk.org/index.php?action=trust;u=9444974. https://bitcointalk.org/index.php?action=trust;u=1153164Quote from: yahoo62278 on September 19, 2022, 07:06:04 PMAnother question, why do you care? Are you one of these accounts? Are they your friends? Are you just generally interested in Jollygood? Do you have a personal vendetta against Jollygood?I'm starting to think the OP is the owner of one of the accounts he cited in the thread, that's likely what made him start this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "September 19, 2022, 08:12:50 PM",
      "body": "I HAVE THESE TO SAY:The real problem is not if the users you mentioned above are quality posters or not. The problem lies on whether it is right to leave a tag to anyone whom you feel made one or two low quality posts among 100 good ones he made.Another issue for determination is whether what JollyGood left is actually a tag? Personally, that is not a tag. First the writeup said \"Note for Self\" which  means there is a need for the forum to provide a means for users to take note or a user need to take note with a bookmark. Secondly, it is a natural note(tag).Now, the question is, is it right for a user to take a note on someone's trust feedback?A big contradiction in the side of JollyGood is deleting the evidence of tagging someone and still pointed reference to a deleted evidence without archiving it.I understand that JollyGood is running a self moderated thread in the gambling discussion board. In that board what appears to be a quality post could be totally off point to complete signature quota. Only sports men will understand what I mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abbati",
      "created_time": "September 19, 2022, 08:25:15 PMLast edit: September 19, 2022, 08:46:39 PM by Abbati",
      "body": "Quote from: _BlackStar on September 19, 2022, 07:39:34 PMI don't know what makes you so motivated to care about neutral tags on that 5 accounts by JollyGood, in fact I didn't even find any of the accounts you mentioned ever complaining on reputation boards because of neutral tags. You were eager to respond and you don't read to understand, I don't even know if you really read before making this comment. I will refer you to the post again but read with full concentration this time around and you'll find an answer to what motivated me to care about those 5 accounts.QuoteI wonder why you care about that neutral tag while previously JollyGood also tagged some other accounts [spammers] with red tags? See the references in some of these accounts if abuse of trust systems is an excuse for you.1. https://bitcointalk.org/index.php?action=trust;u=4661162. https://bitcointalk.org/index.php?action=trust;u=9555103. https://bitcointalk.org/index.php?action=trust;u=9444974. https://bitcointalk.org/index.php?action=trust;u=1153164These accounts were tagged earlier than the 5 accounts I used in my post.  Seems you are looking for an opportunity like this for a long time to bring up these   well, you have it now. QuoteI'm starting to think the OP is the owner of one of the accounts he cited in the thread, that's likely what made him start this thread.Thank God you're just starting to think. You can come back to delete this after you are through with your thinking.Quote from: yahoo62278 on September 19, 2022, 07:06:04 PMAnother question, why do you care? Are you one of these accounts? Are they your friends? Are you just generally interested in Jollygood? Do you have a personal vendetta against Jollygood?I actually care because I might be a victim some other day hence I want JollyGood to give examples of how a quality post looks like. If you read my post very well from the beginning to end all these your questions have an answer in the post. I don't know JollyGood or heard anything about him. I also stated clearly in my post what prompted me to check his profile. In fact, I admire JollyGood and even proud of him having such reputation in the forum but this particular attitude of him deserves attention and need for him to change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "September 19, 2022, 08:35:44 PM",
      "body": "Quote from: Abbati on September 19, 2022, 09:18:07 AM~Let us all be fair and not bias, which among of these quotes Post is low quality for God sake? You cherrypicked one post from each member and you expect us to make a conclusion about the quality of their posts? That is not how things work.JollyGood expressed his personal opinion through those neutral tags. That is his right, no matter how you feel about it, and it is not trust abuse in my opinion. If you do not agree with his use of the trust system, you exclude him from your trust list, and that is it. Quote from: KingsDen on September 19, 2022, 08:12:50 PM~A big contradiction in the side of JollyGood is deleting the evidence of tagging someone and still pointed reference to a deleted evidence without archiving it.Why is this a contradiction? Everything is already archived and all posts are readily available in external archives if you know how to use them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abbati",
      "created_time": "September 19, 2022, 08:52:53 PM",
      "body": "Quote from: Stalker22 on September 19, 2022, 08:35:44 PMYou cherrypicked one post from each member and you expect us to make a conclusion about the quality of their posts? That is not how things work.So you're expecting me to use like 3 pages for my post? Like I should present all their posts before you can accessed? This is ridiculous!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "September 19, 2022, 09:27:17 PM",
      "body": "Quote from: Abbati on September 19, 2022, 08:52:53 PMQuote from: Stalker22 on September 19, 2022, 08:35:44 PMYou cherrypicked one post from each member and you expect us to make a conclusion about the quality of their posts? That is not how things work.So you're expecting me to use like 3 pages for my post? Like I should present all their posts before you can accessed? This is ridiculous! No. I expected you to quote the posts that were in Jolly's reference, so we can evaluate his decision. Although, now that I have looked at the deleted posts, I think his assessment was justified and he has every right to delete such posts from his thread.Second, you failed to mention that, for example, Daltonik and ololajulo were already tagged by other DT members as spammers a year ago, or, for example, that ololajulo already has 198 posts deleted by moderators, which definitely puts him in the spam category. If you are going to accuse someone of trust abuse, at least do some proper research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "September 19, 2022, 10:18:10 PM",
      "body": "Quote from: Abbati on September 19, 2022, 08:25:15 PM-snip-When you talk about the possible abuse of the trust system by JollyGood then you have to understand why JollyGood tag them with a neutral tag even though it is possible for him to give all those accounts red tag.But you're not referring to abuse but rather to compare the quality of posts between users who you think don't deserve to be called spammers and are tagged. I've seen actmyname have a lot of neutral tags for the same reason, so why do you just think JollyGood does it and leaves you so paranoid about getting hurt in the future?I know that trust systems are not for dealing with spammers, but neutral tags are great for forcing spammers a bit to change the interest of their posts to higher quality. Every user you mention in the thread has the right to ask JollyGood to remove or consider the tag, so I don't think it will make you feel intimidated to speak up and post anywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "September 19, 2022, 11:49:20 PM",
      "body": "@OPAfter reading your headline, one could have the impression that someone has caught a negative trust but it's just a neutral one.  No need to worry at all. A neutral trust doesn't do any damage to your trust score, only negative trusts will. So, it can't be called abuse. When getting a neutral feedback for spamming Bitcointalk, very often due to paid signature campaigns, it's time for such accounts to stop producing low quality content. If you don't want to get such feedbacks, stop shitposting. A neutral trust should be considered as an heads-up to review the own behaviour / posts and to increase posting quality. Of course, DT needs to provide sufficient insight, why the neutral feedback was given. In case spammers are admitting their mistakes and improve posting quality, there's also a chance to get it removed, depending on the DT member. But complaining and whining about a neutral trust will just get your account into more problems as you are showing no signs of self-reflection. In addition, it's interesting to see a Newbie bringing that up, LOL.  Got your main account tagged? Play stupid games, win stupid prizes...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}