{
  "id": "topic_5482840",
  "title": "Question:",
  "author": "billllib",
  "created_time": "January 24, 2024, 10:02:36 PM",
  "content": "Last night we (five friends) had a lively discussion about reusing receiving addresses. The consensus was: for small amounts, new (never used) addresses are the way to go. Especially to protect privacy. But what if you plan to buy BTC for a lot of money at once? Like 10,000 or 50,000 USD or even more?Would you use an address twice to be 100% sure that the address works as expected and sends the BTC to your wallet? Would you perform a test transaction first and then reuse the address for the main purchase if the test is successful? Or would you trust the wallet's algorithm and use a new address, even if you buy for a lot of money? Fun fact: there were 5 of us and it felt like 8 different points of view! :-)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5482840",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "January 24, 2024, 10:05:46 PM",
      "body": "There is nothing that you are testing. If the seed phrase is correct and it was used to create the address, you can send the coins to the address at ones, or send it to more than one addresses for privacy reason.Even for small amount of bitcoin, you should not use bitcoin address twice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "January 24, 2024, 10:14:33 PM",
      "body": "As long as the wallet is not compromised then it's okay for you to use it again. Well, if you prefer to different wallet or different address then that's also okay as long as it is not compromised. The only concern here is that you didn't send it to other wallet address that isn't yours which is to double or even triple check that it's the right address. It's your choice by the way if you use the address more than once or not but as you can see in the post above, that's what I will advice too for you to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 24, 2024, 10:14:48 PM",
      "body": "I don’t understand what you mean about testing address or wallet. But just as said above when you create a wallet you insert back the seed phrase to confirm the wallet or better still use another wallet that supports the seed phrase format and try to import this same seed there (make sure it’s offline, if the wallet you’re creating is actually a cold wallet) if the seed phrase is correct you can do what so ever you wish to that wallet and it’s corresponding addresses. Just as you have said it’s better not to reuse an address for privacy sake no matter the amount of bitcoin you’re buying there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "January 24, 2024, 10:40:58 PM",
      "body": "Quote from: billllib on January 24, 2024, 10:02:36 PMWould you use an address twice to be 100% sure that the address works as expected and sends the BTC to your wallet? Would you perform a test transaction first and then reuse the address for the main purchase if the test is successful? You do not have to do this, what you must do is to ensure that you have downloaded the wallet from the original website and verified the download. Moving on, you must also make sure that you run the wallet in an airgapped device that is completely disconnected from the internet or in a hardware wallet. If you do all this, you can simply take any of the wallet addresses to receive the funds.Take note that your funds is only as safe as the device you store it in, so you must ensure you use it in a very safe environment and avoid reusing addresses because it is bad for privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "January 24, 2024, 10:46:31 PM",
      "body": "You can test the address by signing a message with it. If the message can be verified, then you own the private key corresponding to that address and have nothing to worry about. When I was a newbie I also worried about the need to test wallets and addresses, but these days I know that if you are using a proven wallet like Core or Electrum, you will never encounter a problem with addresses not working, because it never happened to anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 24, 2024, 11:10:45 PM",
      "body": "This is obviously how plebs would think, probably because they are not yet familiar with the system and because you and your friends are scared that you might lose your coin if you send it to a new address that has not yet been used.Well, just like the first comment said, there is no reason why you are testing. Most trusted Bitcoin wallets are usually designed in such a way that after you have used an address to make a deposit to that wallet, any time you want to deposit to that same wallet, you will be provided with a different address. That's the wallet mechanism of the wallet, which is usually for security sake, so you don't need to be afraid of asset loss.OP, even if you decide to go by your idea by sending just a small amount of Bitcoin to the new unused address, anytime you  try to make another deposit, you will still be provided with a new address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "January 24, 2024, 11:18:57 PM",
      "body": "It doesn't matter, what matters is that you have the private keys secured and it's not compromised. But for the sake of your anonymity then just have to choose another address with that private keys that you own. Whichever works for you the best since it is your own money, do it for you. Just don't use exchanges for keeping with that amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "January 24, 2024, 11:51:59 PM",
      "body": "If I were to purchase a significant amount of Bitcoin, say around 10,000 USD, I probably wouldn't reuse a tested address. I would prefer to use a new address because my top priority is security and privacy. However, whatever choice is made, it's always important to double-check the receiving address before sending any funds. Use a reliable and reputable wallet with a good track record, and consider a hardware wallet for maximum security when dealing with large amounts of BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "January 25, 2024, 12:03:32 AM",
      "body": "If you do this, what stops you from testing everything? You would want to test the address whether it can receive, then you also test the address whether it can send, and then you would also test your private keys or seed phrase whether it can indeed recover your funds, and so on. It might be safer to do this, but I personally never tried doing this even when relatively big amounts are involved. Perhaps because I've never encountered a problem in which an address can neither receive nor send. But it counts that you choose reliable wallets and that you download them from official sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "January 25, 2024, 12:12:50 AM",
      "body": "Quote from: billllib on January 24, 2024, 10:02:36 PMLast night we (five friends) had a lively discussion about reusing receiving addresses. The consensus was: for small amounts, new (never used) addresses are the way to go. Especially to protect privacy. But what if you plan to buy BTC for a lot of money at once? Like 10,000 or 50,000 USD or even more?The larger the amount, the more difficult it is to hide it. It is true that using the same address will reduce your privacy, but you can still use other methods to enhance your privacy, mixers, connecting to the wallet via Tor, and using full node. using a new address for each deposit does not mean that you have enhanced your privacy if you Use SPV wallet (without TOR) or post your MPK publicly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 25, 2024, 12:14:24 AMLast edit: February 02, 2024, 08:38:16 PM by franky1",
      "body": "top 3 rich list        address                                                          total balance       times it reused address1   34xp4vRoCGJym3xR7yCVPFHoCNxv4Twseo       248,597 BTC       451 2   bc1qgdjqv0av3q5...........90ecnvqqjwvw97        204,010 BTC       147   3   bc1ql49ydapnjafl5..........pdgmxy98859v2         127,136 BTC       200",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 25, 2024, 05:25:56 AM",
      "body": "Quote from: billllib on January 24, 2024, 10:02:36 PMOr would you trust the wallet's algorithm and use a new address, even if you buy for a lot of money? Your question answers itself in a way because of the contradiction inside of it.If you are worried about the \"wallet's algorithm\" when generating a new address then you should also be worried about that wallet in general when doing a lot of other things such as signing your transaction, generating the first key in first place (ie. having used a weak RNG) and stuff like that.This means you should not even be using that wallet if you don't trust its security. Testing it once with any amount is not going to be enough to trust it.The solution is first find an old and trusted wallet that has been around for a very long time, is used by a lot of people and also had its code reviewed by enough developers to not have such serious bugs in such basic functionalities like generating keys, addresses and handling transactions. Something like bitcoin core or electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "January 25, 2024, 06:00:34 AM",
      "body": "Quote from: billllib on January 24, 2024, 10:02:36 PMLast night we (five friends) had a lively discussion about reusing receiving addresses. The consensus was: for small amounts, new (never used) addresses are the way to go. Especially to protect privacy. But what if you plan to buy BTC for a lot of money at once? Like 10,000 or 50,000 USD or even more?What is true is true and it is true for both small and big capital.Logically when you have more money, bigger capital, you must take care more about your privacy. It is quite simple to answer you, if you use change address (avoid reuse address) with small capital, you will have to do the same with bigger capital.Privacy is lost when you are careless and it does not care you are poor or rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "January 25, 2024, 06:34:18 AM",
      "body": "Quote from: billllib on January 24, 2024, 10:02:36 PMLast night we (five friends) had a lively discussion about reusing receiving addresses. The consensus was: for small amounts, new (never used) addresses are the way to go. Especially to protect privacy. Everything is just the opposite; for small amounts I allow the reuse of old addresses. Although why do this (as if there is a shortage), if you can generate countless new addresses.Quote from: billllib on January 24, 2024, 10:02:36 PMBut what if you plan to buy BTC for a lot of money at once? Like 10,000 or 50,000 USD or even more?It is safer to distribute a significant amount across different addresses (what is called diversification).Quote from: billllib on January 24, 2024, 10:02:36 PMWould you use an address twice to be 100% sure that the address works as expected and sends the BTC to your wallet? Would you perform a test transaction first and then reuse the address for the main purchase if the test is successful? Why not make a test transaction of, say, $100-200, and then buy for $1000-2000? You don't lose anything, you just spend a little more time, but at the same time make sure that everything works properly.Quote from: billllib on January 24, 2024, 10:02:36 PMOr would you trust the wallet's algorithm and use a new address, even if you buy for a lot of money? There is a saying: trust, but verify. Wallets too.Quote from: billllib on January 24, 2024, 10:02:36 PMFun fact: there were 5 of us and it felt like 8 different points of view! :-)The more different points of view, the more options from which you can choose the right one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "January 25, 2024, 07:34:52 AM",
      "body": "Quote from: boyptc on January 24, 2024, 11:18:57 PMBut for the sake of your anonymity then just have to choose another address with that private keys that you own. Using fresh addresses is good for privacy, but just that alone does not make you anonymous. Even the BTC blockchain is public and transparent and then if you send your funds into centralized exchanges, you obviously no longer have any privacy to protect. If you want anonymity or a much better privacy, you must first be running your own node, once you connect to third party servers, the host already has information about your IP and your BTC address, you must also use p2p exchanges and privacy solutions like CoinJoin implementations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "January 25, 2024, 08:03:09 AM",
      "body": "It’s completely safe to use a newly generated address. Just we need to make sure that while copying and pasting, the address matches with each other. Double check it multiple time and then send the coins. Moreover use offline wallet to store or hold the coins. That’s more safe and no malware can harm the process. Alternatively you can also use old address also. But the privacy here can be hampered if someone is tracking the address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patikno",
      "created_time": "January 25, 2024, 08:54:50 AM",
      "body": "This is an interesting case study to see the different views on how to approach a large impending transaction. For me, nothing is more of a priority than transaction security, that is, I will put aside privacy if it refers to large transactions.Steps I will do:1. Ensure that I can access the address again, by writing down the phrases on offline media (paper or something). Then, re-enter the phrases in the wallet.2. After the wallet & address section is complete, then I will ensure that I will send to the correct address, by doing a test first with a smaller amount.3. If the first & second stages go well, I will then go all-in sending the bitcoins I have to that destination address.No one wants to experience the same thing as a doctor who wants to kill his girlfriend or one of our bitcoin OGs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "January 25, 2024, 08:59:37 AM",
      "body": "Yep, the story \"one person has ten opinions\"  Is it really that complicated? The question you should answer for yourself in that debate. I think you probably received useful answers and opinions from forum members.Personally, I feel like @Z-tight shared, as long as you have ensured the mentioned things, reusing old addresses is no problem. It's similar to wearing shoes you bought years ago if they're still usable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 25, 2024, 09:20:51 AM",
      "body": "If you're that concerned about privacy, start using Monero or GRiN.It is true that reusing the address may show the total Bitcoin you have, but if you do not know how to manage your wallet, it will quickly possible to link all your addresses. Therefore, not reusing the addresses did not enhance your privacy but on the contrary, increased your fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}