{
  "id": "topic_5401816",
  "title": "satoci",
  "author": "satoci",
  "created_time": "June 08, 2022, 02:00:21 PM",
  "content": "Hello all,Can someone explain to me why there are coinbase txs that send rewards to multiple addresses like this one https://bitcoinblockexplorers.com/tx/eb9014398ae470d3e7ab178d6751865b83a12d78dae8ca16fe450ae3d27907c8 ? Thanks in advance",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401816",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "June 08, 2022, 02:09:57 PM",
      "body": "That's normal. A coinbase transaction and just like any other transaction can have multiple outputs. Take a look at this article[1][1] https://academy.bit2me.com/en/que-es-coinbase-transaccion/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "June 08, 2022, 03:00:11 PM",
      "body": "Quote from: satoci on June 08, 2022, 02:00:21 PMHello all,Can someone explain to me why there are coinbase txs that send rewards to multiple addresses like this one https://bitcoinblockexplorers.com/tx/eb9014398ae470d3e7ab178d6751865b83a12d78dae8ca16fe450ae3d27907c8 ? Thanks in advanceOnly the miner (or mining pool) that created that block will know for certain exactly why that was done in that exact transaction, but here are a few common reasons I can think of that miners (or pools) might do it.1. Perhaps it is a pool that immediately awards all pool participants with their earnings in the block as it is mined.  So, if there are 100 people all participating in a pool, the pool might build blocks with the block reward already split up to the participant's addresses.2. Perhaps a solo miner wants to split up their earnings between some hot wallets and some cold wallets. It is safer to send the value directly to the cold wallets as the value is earned, rather than sending it to a hot wallet and then creating a separate transaction to forward that value to a cold wallet later.3. Perhaps a solo miner is attempting to increase their level of privacy by having multiple wallets that are each used for different purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 09, 2022, 11:38:02 AM",
      "body": "It was mined by eligius. When you mined there the pool paid you directly from mined blocks: https://bitcointalk.org/index.php?topic=441465.0You would see similar payouts from a few other pools like p2pool and others that paid you from the generated coins.Not a big deal, was a lot more common 'back in the day' now with most mining it's all ppls / pps and just paid from the pool funds.Here is a p2pool block: https://mempool.space/block/00000000000000000066a8176c5357a552117224a80d9ee1ef1871d7a3f14eba-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 09, 2022, 03:15:33 PM",
      "body": "How exactly the coinbase transaction is constructed is entirely up to the mining pool software (or the solo miner software, if it gets lucky and finds a block).Generally, they will try to spend as little fees as possible - since any fees spent will go to the reward of the next block solver - so that's why they make transactions with so many dozens of outputs, possibly using multiple transactions to distribute the rewards if possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 10, 2022, 03:42:25 AM",
      "body": "Quote from: NotATether on June 09, 2022, 03:15:33 PMGenerally, they will try to spend as little fees as possible - since any fees spent will go to the reward of the next block solver - so that's why they make transactions with so many dozens of outputs, possibly using multiple transactions to distribute the rewards if possible.Are you talking about the transaction where the pool pays the miners later? In that case those transactions are usually sent with 0 fee and is mined by the same pool not by other pools. Like this tx mined by F2Pool spending many coinbase outputs mined by F2Pool:https://blockchair.com/bitcoin/transaction/273061e67153c877d83bd823dc7debe3bee20300cbd4fad089104d217382c6a5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "P2PECS",
      "created_time": "June 10, 2022, 06:39:09 AM",
      "body": "Quote from: pooya87 on June 10, 2022, 03:42:25 AMAre you talking about the transaction where the pool pays the miners later? In that case those transactions are usually sent with 0 fee and is mined by the same pool not by other pools. Like this tx mined by F2Pool spending many coinbase outputs mined by F2Pool:https://blockchair.com/bitcoin/transaction/273061e67153c877d83bd823dc7debe3bee20300cbd4fad089104d217382c6a5Is that 0 fee transaction confirmed by the same miner or pool that sends it? I mean the first confirmation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "June 10, 2022, 07:39:07 AM",
      "body": "Quote from: P2PECS on June 10, 2022, 06:39:09 AMQuote from: pooya87 on June 10, 2022, 03:42:25 AM-snip-Is that 0 fee transaction confirmed by the same miner or pool that sends it? I mean the first confirmation.No one can be so certain.But since most pools do not accept others' 0-fee transactions in their mempool, then you can safely assume that it's the same pool who've included it to their own block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 11, 2022, 03:12:39 AM",
      "body": "Quote from: nc50lc on June 10, 2022, 07:39:07 AMQuote from: P2PECS on June 10, 2022, 06:39:09 AMQuote from: pooya87 on June 10, 2022, 03:42:25 AM-snip-Is that 0 fee transaction confirmed by the same miner or pool that sends it? I mean the first confirmation.No one can be so certain.But since most pools do not accept others' 0-fee transactions in their mempool, then you can safely assume that it's the same pool who've included it to their own block.You can also check the coinbase transaction of the block that contains this transaction and the input transactions and decode its script or look inside their OP_RETURN output if they are found to try and guess the miner. That's what most block explorers do and show a Miner field which in this case says F2Pool",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "June 11, 2022, 03:46:23 AM",
      "body": "Interesting to note that there is a caveat tied to this, when mining pools directly reward the miners using the coinbase transactions. These transactions have a threshold of 100 confirmations, so you can only spend the inputs from these transactions after the 100 confirmation, which is actually fairly long. A more direct method would be to send it to their own address before distributing it afterwards. The good thing is that they can include their own transaction in a subsequent block that they mine.That is also why most exchanges don't recognize these deposits automatically. Most mining pools credits their miners after 6 confirmations and uses the older \"generation transaction\" to payout instead of having their miners wait for additional 100 confirmations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "June 11, 2022, 01:30:22 PM",
      "body": "Quote from: ranochigo on June 11, 2022, 03:46:23 AM. . . you can only spend the inputs from these transactions after the 100 confirmation, which is actually fairly long . . .I guess that depends on what you mean when you say \"fairly long\".  We're not talking about months, or weeks, or even days here.  On average, 100 confirmations takes a bit less than 17 hours.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}