{
  "id": "topic_5455474",
  "title": "Perfectbaby",
  "author": "Perfectbaby",
  "created_time": "June 06, 2023, 07:15:37 PM",
  "content": "We all had heard of the sudden lawsuit against Binance exchange and its CEO Changpeng Zhao which has caused so much threat to the bitcoin and cryptocurrency at large. Do you strongly believe that this is the good time acquire some useful currencies?Like buying Bitcoin, ETH BNB and many more.I am having a plan to buy some valuable asset and store in my wallet since i believe after few week or month we might get back to $27k. Wetin una think so that i no go waste my money at this point go buy bitcoin wey market come dey show me sheggea.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455474",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "June 06, 2023, 08:34:16 PM",
      "body": "Quote from: Perfectbaby on June 06, 2023, 07:15:37 PMI am having a plan to buy some valuable asset and store in my wallet since i believe after few week or month we might get back to $27k. Bitcoin got back to $27000 in less than 30 minutes ago.If you know that you want to hold for long and not selling, you can buy bitcoin. If you think the price may still get lower, you can invest by following NCA (naira cost average) strategy.To know more about NCA: Why you should Naira Cost Average your Investments",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Perfectbaby",
      "created_time": "June 06, 2023, 09:37:09 PM",
      "body": "Quote from: Charles-Tim on June 06, 2023, 08:34:16 PMQuote from: Perfectbaby on June 06, 2023, 07:15:37 PMI am having a plan to buy some valuable asset and store in my wallet since i believe after few week or month we might get back to $27k. Bitcoin got back to $27000 in less than 30 minutes ago.If you know that you want to hold for long and not selling, you can buy bitcoin. If you think the price may still get lower, you can invest by following NCA (naira cost average) strategy.To know more about NCA: Why you should Naira Cost Average your InvestmentsSenior man thank you for the brief edu you give me like this, I believe to make use of the knowledge. Btw I dey love your activeness for this local section, e get how you dey carry know people wey post here?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 06, 2023, 10:05:31 PM",
      "body": "Op bitcoin and Binance are two different things don't carry Binance issue come to bitcoin price. If you want to buy bitcoin buy it now. The suet against  Binance CEO has nothing to do with bitcoin. As Charles-Tim said, bitcoin investment is not for short term investment, but for long term investment. For long term you can buy it and for short term you can't because you don't know when the price will go up. The price right now is $27k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Perfectbaby",
      "created_time": "June 06, 2023, 10:20:48 PM",
      "body": "Quote from: Agbe on June 06, 2023, 10:05:31 PMOp bitcoin and Binance are two different things don't carry Binance issue come to bitcoin price. If you want to buy bitcoin buy it now. The suet against  Binance CEO has nothing to do with bitcoin. As Charles-Tim said, bitcoin investment is not for short term investment, but for long term investment. For long term you can buy it and for short term you can't because you don't know when the price will go up. The price right now is $27kSmiles, have you forgotten that if anything happened to Binance exchange today bitcoin price might crashed to $18k or more? From the news I read across this forum, what happened when Terra crashed and again what happened to bitcoin when FTX had an issues?Anyway nothing to argue much because it seems you don't know the power of Binance exchange and if you do then you would understand that if that exchange is being affected today then there will be problem, although this might only be for a while but the effect will shake the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "June 07, 2023, 02:00:53 AM",
      "body": "Quote from: Perfectbaby on June 06, 2023, 10:20:48 PMQuote from: Agbe on June 06, 2023, 10:05:31 PMOp bitcoin and Binance are two different things don't carry Binance issue come to bitcoin price. If you want to buy bitcoin buy it now. The suet against  Binance CEO has nothing to do with bitcoin. As Charles-Tim said, bitcoin investment is not for short term investment, but for long term investment. For long term you can buy it and for short term you can't because you don't know when the price will go up. The price right now is $27kSmiles, have you forgotten that if anything happened to Binance exchange today bitcoin price might crashed to $18k or more? From the news I read across this forum, what happened when Terra crashed and again what happened to bitcoin when FTX had an issues?Anyway nothing to argue much because it seems you don't know the power of Binance exchange and if you do then you would understand that if that exchange is being affected today then there will be problem, although this might only be for a while but the effect will shake the market. That is why you are advised as above that you should think or have it in mind that you are to invest in a long term,wetin this means say put am for your mind say bitcoin na part of your life no be say u won buy now to sell tomorrow. So that if the price drop as been go 25k,you no go fear because even though bitcoin price go 18k,you go still know say na for that period and after sometimes,the price go increase again. It is normal for exchanges to crash but bitcoin will still have its potential value. FTX crash but bitcoin price reach 30k this year.  Binance issues doesn't have any significant impact on bitcoin price. Oya see the price don go back to 27k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Perfectbaby",
      "created_time": "June 07, 2023, 07:15:40 AM",
      "body": "Quote from: Merit.s on June 07, 2023, 02:00:53 AMThat is why you are advised as above that you should think or have it in mind that you are to invest in a long term,wetin this means say put am for your mind say bitcoin na part of your life no be say u won buy now to sell tomorrow. So that if the price drop as been go 25k,you no go fear because even though bitcoin price go 18k,you go still know say na for that period and after sometimes,the price go increase again. It is normal for exchanges to crash but bitcoin will still have its potential value. FTX crash but bitcoin price reach 30k this year.  Binance issues doesn't have any significant impact on bitcoin price. Oya see the price don go back to 27k.Yes i don already talk am say after sometimes the price go balance again but at the main time e go affect am.But anyhow i thank una for the little feedback una give me.One love!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 16, 2023, 03:14:11 PM",
      "body": "The price is currently far below the initial. If you already bought then I think it would be in your best interest to hold for long so as not to be at loss or if you already sold out, that should not be an issue for you but currently, investors are taking advantage of this opportunity to bag more while the weak hands are on the rage of selling for missing out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 16, 2023, 03:24:15 PM",
      "body": "It's you people that are causing unnecessary fear of missing out everywhere because of the Binance issue, the bitcoi network is no concerned about any exchanges because they are not the same, exchange are just like institutional commercial banks while bitcoin is a digital currency which you can choose where to store your bitcoin in a decentralized way and not with the centralized exchanges, Binance will faces it dealings with the government and only the Binance US could be affected in US at the end and not the Binance global.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "June 16, 2023, 03:26:28 PM",
      "body": "Firstly, no risk no reward. The market speculation shouldn't deter anyone from buying crypto. What matters is the kind of cryptocurrency you buy, if one intends to trade with it, if one intends to commit to a DCA strategy of investment for a duration or overlooking a time as this or when an event like the Halving, which is expected to also happen.The simple fact is, you can't always win. An asset or security like BTC is recognized and accepted as more stable, and as such, it is okay to buy whenever you got the cash. Mostly if you trade with it. Right now it is almost at 27k, people are still buying. It depends on what you want finally.The news on air right now is directed at exchanges not cryptocurrency. One should be wise to know which crypto is worth buying still.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "June 16, 2023, 03:52:44 PM",
      "body": "Op nothing will happen to BTC and binance because, some government are trying to play some politics to get something from binance before they will extend it to other cryptocurrencies which will be difficult for them to succeed in that aspect. Bro this is the time to use huge amount of money to buy BTC, Ethereum, binance and apply long holding so that no matter how long the market price delay, you will not miss the reward attached to it in the future. At today the price of BTC rise from $24k to $25 and the green light is still on which is a sign that bull market is very close to holders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 16, 2023, 06:27:10 PM",
      "body": "Quote from: Charles-Tim on June 06, 2023, 08:34:16 PMQuote from: Perfectbaby on June 06, 2023, 07:15:37 PMI am having a plan to buy some valuable asset and store in my wallet since i believe after few week or month we might get back to $27k. Bitcoin got back to $27000 in less than 30 minutes ago.If you know that you want to hold for long and not sell, you can buy Bitcoin. If you think the price may still get lower, you can invest by following NCA (naira cost average) strategy.To know more about NCA: Why you should Naira Cost Average your InvestmentsNCA may be ok if your investment is in real estate or other assets that have a fixed rate unless changed by the government,  that way your investment can appreciate for the long term and not the short term as you estimated, I guess when it comes to cryptocurrency investment holding some good coins such as bitcoin or Ethereum may seem most appropriate for the long term base and if you want to speculate the market on short term basis DCA will be most appropriate instead of relying on NCA since the value of naira is highly inflated and that could affect the profits taking/merging. Well thank you for sharing the link the article seems cool but without any provable mechanism,  that can prove the formula to be effective since the naira is weak on the exchange market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 16, 2023, 06:52:12 PM",
      "body": "Quote from: Doan9269 on June 16, 2023, 03:24:15 PMSnipOne thing about Bitcoin is that there are always different stories every year that most people find so interesting that they tag them with Bitcoin just to get themselves or other new investors scared for nothing. The only fear I expected people to have is for those altcoin investors, those that have so many altcoins in their portfolio, because during times like these, some altcoins collapse and can't really do well again even after the market has started booming. I just remind people that those old rules of Bitcoin have not changed, just like, \"1Never store your coin on CEX, 2buy the dip, 3If you sell cheap, you won't be rich, and 4If you don't sell cheap, you have not lost anything.\" If people have those tips in their heads, then they will realize that in season when the market is down, it is either for them to use the opportunity to accumulate, or if they don't have the money to accumulate more, then they should hold tight.Cheers 🥂, Dr.Bitcoin_Strange 👺👺",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 16, 2023, 06:59:24 PM",
      "body": "Quote from: Perfectbaby on June 06, 2023, 07:15:37 PMWe all had heard of the sudden lawsuit against Binance exchange and its CEO Changpeng Zhao which has caused so much threat to the bitcoin and cryptocurrency at large. So much threat as how? Op do you really understand what is bitcoin? Ok let me give small break down of bitcoin. Bitcoin an internet currency which can be used to buy and sell things only online not offline. But the goods and services can be physical but the payment is online. Now what is Binance? Binance is an internet commercial Bank where one can store his bitcoin and any other Cryptocurrencies. And they are own by different people. So the downfall of Binance does not affect bitcoin. Quote from: Perfectbaby on June 06, 2023, 07:15:37 PM Do you strongly believe that this is the good time acquire some useful currencies?Like buying Bitcoin, ETH BNB and many more.I am having a plan to buy some valuable asset and store in my wallet since i believe after few week or month we might get back to $27k. Wetin una think so that i no go waste my money at this point go buy bitcoin wey market come dey show me sheggea.Yes it is also a good time to buy, if the price is okay for the buyer then there is no alarm. And also binance has nothing to do with bitcoin. The only effect that bitcoin might encountered with the issue of Binance is that, the whales will pull out from the exchange and it might affect the price of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}