{
  "id": "topic_5463886",
  "title": "Comicking",
  "author": "Comicking",
  "created_time": "August 20, 2023, 06:10:10 AM",
  "content": "Anybody know of any crypto casinos that offer cockfighting? preferably vietnamese thai cambodian or filipino",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463886",
  "comments": [
    {
      "author": "btc_angela",
      "created_time": "August 20, 2023, 07:18:02 AM",
      "body": "Quote from: Comicking on August 20, 2023, 06:10:10 AMAnybody know of any crypto casinos that offer cockfighting? preferably vietnamese thai cambodian or filipinoAs far as I know there is none that supports cockfighting on crypto based casinos, sorry to burst the bubble for you.But if you are looking for none crypto casinos, there are a lot, but it is supposedly local though. So if you are outside of the country then I don't think you can bet or even access the online cockfighting site as it might detect your IP although you can get away with it by using VPN, but I don't recommend it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 20, 2023, 07:48:06 AM",
      "body": "Quote from: Comicking on August 20, 2023, 06:10:10 AMAnybody know of any crypto casinos that offer cockfighting? preferably vietnamese thai cambodian or filipinoDo you have an account on stand-alone cockfighting sites that used to be so popular in the Philippines and other Asian countries unfortunately here in our country all licensed cockfighting sites are closed down because of game fixing, and I don't think casinos here will offer cock fighting because it is held and broadcasted live it used to be stand-alone which means only cockfighting is being played by bettors.There are some casino groups on Facebook that posted cockfighting sites it's illegal and done underground so check them out you could find some cockfighting sites, but I would like to remind you cockfighting can be manipulated and fixed this is the reason why there are cases of illegal adoptions of people who allegedly fix the games in our country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "August 20, 2023, 08:05:43 AM",
      "body": "Quote from: Comicking on August 20, 2023, 06:10:10 AMpreferably vietnamese thai cambodian or filipinoCockfighting is either illegal or highly regulated in these countries you listed.The most promising is Thailand where it was recently resumed and plans are made to market it like a tourist attraction[1], since it it is banned in many placed around the world.[1] https://thethaiger.com/news/national/animal-fights-along-with-betting-legalised-promoted-as-soft-power- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "August 20, 2023, 08:34:50 AM",
      "body": "Quote from: Comicking on August 20, 2023, 06:10:10 AMAnybody know of any crypto casinos that offer cockfighting? preferably vietnamese thai cambodian or filipinoMy mind is messed up for laughing when I first saw the title of the thread and then I realized it’s a rooster fight or sabong on our local language. In our country, The license for this kind is not given for those online operators. Casino that offering this game is illegal so your only chance to find a casino with this game are those illegal oand most of them requires an admin to create an account for you. You can deposit and withdraw through the admin also. This is how they control who can play to avoid being caught.So far, There’s no online casino that I knew offer this game since e-sabong operation is temporarily cancelled due to many incidents here. I'm not sure now on the status of license suspension. Btw my country is Philippines. Cockfighting is legal but operating online is the one illegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "August 20, 2023, 08:47:45 AM",
      "body": "Online cockfighting was exposed because it can easily be manipulated, and of all the games it is the most addictive because you only have two cocks fighting and your chance is good that is so many of my countrymen have uncontrolled debts, there was even news that bettors resort to robbing just to play on cockfighting.OP did not mention where he is located but if he is around Asia he will find local cockpits, especially in the Philippines where it is legal, but our government does not want to make it legal anymore because of corruption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 20, 2023, 09:02:44 AM",
      "body": "I'm just thinking how it's possible?It's possible if it's a traditional gambling, but there's no such cockfighting league when I search it in google, how can a crypto casino listed this kind game? or you're expecting a multi player game that we as a player to control the cock to fight?Regardless it's legal or not, you will not find it in crypto casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "August 20, 2023, 09:04:04 AM",
      "body": "Quote from: aioc on August 20, 2023, 08:47:45 AMOnline cockfighting was exposed because it can easily be manipulated, and of all the games it is the most addictive because you only have two cocks fighting and your chance is good that is so many of my countrymen have uncontrolled debts, there was even news that bettors resort to robbing just to play on cockfighting.OP did not mention where he is located but if he is around Asia he will find local cockpits, especially in the Philippines where it is legal, but our government does not want to make it legal anymore because of corruption. Bettors resulting in robbing happens in every type of gambling, not just cock fights, There is no cock fight gambling in my own country, yet some gamblers were apprehended by the police forces for robbing a small community in the state, The Robbers claimed they owed a lot of debt because of gambling, basically sports Betting, and the only way to solve this was robbing people. Any gambling games that have something to do with animals can all be manipulated, horse races, Buffalo games, and other animal fights have been exposed a few times before, drugs have been given to the animals to increase their energy, and so on. Cock fights are illegal in some countries and I believe OP is from such a country, if not, why would he ask where he can place a bet for such a game when it's a game that's been carried out mostly by locals, I believe Vietnam is on the top list of countries that are so into this type of games, Philippines was once a big fan too, until someone came into power and put a ban on this game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "August 20, 2023, 09:13:39 AM",
      "body": "Quote from: Comicking on August 20, 2023, 06:10:10 AMAnybody know of any crypto casinos that offer cockfighting? preferably vietnamese thai cambodian or filipinoIn terms of cryptocurrency related to cockfighting never seen yet supporting this kind of platform, and another thing is that cockfighting is now prohibited by the law of the Philippines so if there's any detected operating right now the providers will immediately terminate those platforms. This happen because of the case of there's tons of cockfighter and breeder lose unexpectedly in an arena.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "August 20, 2023, 09:15:05 AM",
      "body": "Quote from: aioc on August 20, 2023, 08:47:45 AMOnline cockfighting was exposed because it can easily be manipulated, and of all the games it is the most addictive because you only have two cocks fighting and your chance is good that is so many of my countrymen have uncontrolled debts, there was even news that bettors resort to robbing just to play on cockfighting.OP did not mention where he is located but if he is around Asia he will find local cockpits, especially in the Philippines where it is legal, but our government does not want to make it legal anymore because of corruption. Apart from rigged games, which as you said are very easy to orchestrate in online cockfighting, it is true that cockfighting is forbidden in most jurisdictions in the world including the whole Europe and USA, although it seems that there is no reliable data on the status of cockfighting in the third world so we can't say for sure that this sport is for minorities. Anyway, why should any crypto casino take risks when other games are more popular and don't pose any legal threat for them?Who knows, maybe you find one, but I've never seen anything like that in any of the most popular crypto sportsbooks we know here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "August 20, 2023, 09:59:21 AM",
      "body": "Quote from: Comicking on August 20, 2023, 06:10:10 AMAnybody know of any crypto casinos that offer cockfighting? preferably vietnamese thai cambodian or filipinoIf you ever come across an illegal site that offers this kind of game you should be aware that they’ll less fairness in their games.If you so much want to bet on cocks fight why don’t you just try to locate a physical one in your locality that way they’ll be less cheating or if you can’t find any you should look for another game to bet on, I have seen it happened in my locality but it just happened naturally and everyone gathered round to watch which of them was going to win, no money was bet so in a sense it was gambling. Btw, don’t you think placing two cocks in a pit and then forcing them to fight is unethical? I can’t imagine that kind of thing happening to humans like placing two men in a cage and then forcing either by threatening or physically hurting them to go into a fight with each other, it sounds like torment to me tho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "August 20, 2023, 10:05:42 AM",
      "body": "People keep looking for the impossible this days, im a sorry OP what you are looking for doesn't exists yet, cockfighting is preferred a local betting game, not online, I've never seen any online casino offering such game. If you really want such game, ask from those around you, there must be a gambling den in a city or state near you unless you are from country where this game is illegal by the rulers of your country. Btc_angela said this game is available on noncrypto casinos, maybe that's true, do your own research and make sure they support your location.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "August 20, 2023, 10:37:58 AM",
      "body": "It can be done actually by crypto related casinos, but the question is, if this cockfighting is profitable as only few Asian countries love this sports and maybe some in Latin America. Plus maybe there could be some animals rights going to make some noises if ever some high and reputable casino started to show live feed of two cock trying to kill each other for the sake of betting or making money.And with that, It's possible, but I highly doubt that crypto casinos are more willing to take that risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "August 20, 2023, 10:41:07 AM",
      "body": "Quote from: Comicking on August 20, 2023, 06:10:10 AMAnybody know of any crypto casinos that offer cockfighting? preferably vietnamese thai cambodian or filipino       -    If what you are looking for is cockfighting crypto casino, I don't know of any that exist these days. But if you play to earn cockfighting, you will find a lot on the play store that has nothing to do with cryptocurrency.I've thought about that before and searched on google search but nothing like that comes up, instead I see other fights that are usually fights from the ufc and others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "August 20, 2023, 11:23:32 AM",
      "body": "Quote from: Comicking on August 20, 2023, 06:10:10 AMAnybody know of any crypto casinos that offer cockfighting? preferably vietnamese thai cambodian or filipinoAfter the scandal that rocks the online cockfighting industry in the Philippines where all the platforms that host cockfighting I don't think we will see more online cockfighting they are mainly based in the Philippines, and all were taken down because its easy to manipulate where the developers earn billions of pesos and addiction is growing because itis very addictive more addictive than dice games or slots.Games are held live and sometimes for long hours or even 24 hours because of their popularity I don't know if the government will allow online cockfighting again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "August 20, 2023, 11:55:23 AM",
      "body": "You will not find online betting platforms that openly offer bets on Cockfighting, because it will then get global attention from anti-animal cruelty supporters. In most of the countries where they do it, they do not even allow people to record it, because of the negative attention that fights like this will attract. The casinos will also not offer it, because they will risk losing gamblers that gamble on other Sports .... and they might be against animal cruelty, so it is a very controversial subject.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 20, 2023, 12:44:10 PM",
      "body": "Quote from: Kakmakr on August 20, 2023, 11:55:23 AMYou will not find online betting platforms that openly offer bets on Cockfighting, because it will then get global attention from anti-animal cruelty supporters. In most of the countries where they do it, they do not even allow people to record it, because of the negative attention that fights like this will attract. The casinos will also not offer it, because they will risk losing gamblers that gamble on other Sports .... and they might be against animal cruelty, so it is a very controversial subject.   I completely agree with your input, casinos can never offer such games, and not even for the fact that they could face backlash from those against animal cruelty, but more of the fact that they could face a total ban from operations due to outrage from the general public.Cockfighting should never be a game or be seen or taken as a means of gaining excitement in the first place, but then, human being are never just satisfied, we have a lot of games already, we have different types of sports, from football to handball, to baseball, to hockey, to volleyball, to table tennis, etc. , and fighting games like wresting, UFC and so on, and coming down to race, we have the car race, bike race, bicycle race, normal human race, horse race, dog race and so on, a lot of sporting activities to chose from, bet on and find excitement in, but then, like I said before, human being are never satisfied , what is there in cockfight that it even interest anyone?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "August 20, 2023, 12:49:55 PM",
      "body": "Cock fighting is a local betting animal sports most played in South Asia and South East Asia. I don't think you will find it on international casino even on crypto casino. You can check your local casino whether they have it or not. Since it comes under cruelty to birds generally casino avoid it due to fear of animal NGO backlash. I think it is better to visit your local area where such events are organised. I won't be surprised if you don't find it on any online casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "August 20, 2023, 01:04:59 PM",
      "body": "It looks like a bizarre sports adventure against the animals. Animals are meant to be protected and to have them go against each other is not what the international community would like to do or be seeing, I racing is better than fighting and this is why you may not find a casino easily on that. However, on the local stage, people use to have such games where they set up two hen to fight each other and they will be by the side watching and betting. It is an old local gambling though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "August 20, 2023, 01:14:44 PM",
      "body": "Quote from: Comicking on August 20, 2023, 06:10:10 AMAnybody know of any crypto casinos that offer cockfighting? preferably vietnamese thai cambodian or filipinoAs far as I am aware, cock fighting is outlawed in basically every country and I have no idea where you could find an illegal game provider. I would advise against it, either way. It is both cruel and sketchy.Now as far as online digital cockfighting goes, I heard that it is difficult to find a fair game, as gambling games that are not 100% probability based can be manipulated. So nobody is willing to provide something like that, as the casino is legally liable in such cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}