{
  "id": "topic_5515742",
  "title": "Stepstowealth",
  "author": "Stepstowealth",
  "created_time": "October 26, 2024, 01:32:56 PM",
  "content": "Can self-custody be too difficult to practice by a crypto investor? Because I spoke to somebody about bitcoin and the person responded by saying that they are not too sure that they can trust their self to keep their investment safe because of their careless nature, and this got me thinking because can I call this person being very sincere or the person is just afraid to try. Everyone should be in-charge and control of their bitcoin investment, and if somebody knows that they cannot practice self custody then I don't believe that bitcoin should be what they are investing in because it is simply not safe for someone else to be helping you manage your investments in bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5515742",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "October 26, 2024, 01:42:25 PM",
      "body": "This is not something I would recommend doing but wallets are just getting easier to use. Even for self custody, you've got wallets allowing you to backup your wallet to the cloud (Google drive or iCloud) or I believe some wallets like Exodus, allow you to do the same process through email. Again, not something I would recommend but it really doesn't get easier than that.I'm saying the above assuming that the \"concern\" here is not the security of the assets from hackers but rather losing access to your own wallet of course.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryss191",
      "created_time": "October 26, 2024, 01:42:46 PM",
      "body": "Quote from: Stepstowealth on October 26, 2024, 01:32:56 PMCan self-custody be too difficult to practice by a crypto investor? Because I spoke to somebody about bitcoin and the person responded by saying that they are not too sure that they can trust their self to keep their investment safe because of their careless nature, and this got me thinking because can I call this person being very sincere or the person is just afraid to try. Everyone should be in-charge and control of their bitcoin investment, and if somebody knows that they cannot practice self custody then I don't believe that bitcoin should be what they are investing in because it is simply not safe for someone else to be helping you manage your investments in bitcoin.Not everyone feels comfortable managing their own security, and that’s okay. But maybe they could start small or look into tools that make self-custody easier, like wallets with backup features.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 26, 2024, 01:44:15 PM",
      "body": "Most of the time, people will learn after getting bitter lesson, if the biggest centralized exchange bankrupt and can't refund their customers, they will try to learn how to self custody their coins.Quote from: Stepstowealth on October 26, 2024, 01:32:56 PMI don't believe that bitcoin should be what they are investing in because it is simply not safe for someone else to be helping you manage your investments in bitcoin.That's why we have Bitcoin ETFs, it's for people who don't or can't self custody their own coins.Stock and ETFs can only be purchased via digital and we don't have other option to hold our own stock or ETFs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "October 26, 2024, 01:46:23 PM",
      "body": "Quote from: Stepstowealth on October 26, 2024, 01:32:56 PMCan self-custody be too difficult to practice by a crypto investor? Because I spoke to somebody about bitcoin and the person responded by saying that they are not too sure that they can trust their self to keep their investment safe because of their careless nature, and this got me thinking because can I call this person being very sincere or the person is just afraid to try. Everyone should be in-charge and control of their bitcoin investment, and if somebody knows that they cannot practice self custody then I don't believe that bitcoin should be what they are investing in because it is simply not safe for someone else to be helping you manage your investments in bitcoin.In any case, every investor should take care of the security of their investments. For example, the owner of a deposit in a commercial bank should also take care that an intruder does not gain access to his banking application. The owner of real estate should also take care that fraudsters do not forge a general power of attorney and re-register the property rights. Owning any property requires responsibility. In the situation with storing Bitcoin, everything is more complicated, since when storing Bitcoin on your own, there is no intermediary (third party) at all to whom claims can later be made. Therefore, Bitcoin owners need additional training. They will need information about hardware wallets, cold wallets, the structure of the blockchain, private and public addresses, miner fees, and other information. Much of this information can be found on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ronsbit",
      "created_time": "October 26, 2024, 02:03:41 PM",
      "body": "It should be a priority for investors to take their security very important since they have their assets under their own custody. It would be nice investors knows this that nobody can fully protect their assets than they do because it is their personal property and investment which they have put in funds to do. So it would be good they take their asset safety very serious so that they do not loose it to scammers or hackers.The earlier you as an investor learn to protect your asset the batter for you. Remember any asset you do not have the keys to does not belong to you even if you are the sole owner but it is not under your custody so you can not decide how it goes or claim ownership of it until it is in your personal private wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "October 26, 2024, 02:13:20 PM",
      "body": "I don't think it discourage people on having bitcoin self-custody. For me, I don't trust anyone even trusted exchange or any centralized exchange to hold my assets.Like other said, most exchanges do not have plans to return their customers' money once they have been hacked or anytime they can freeze your account without ways to unfreeze them.So I recommend people to don't trust anyone and always make sure to use self-custody wallets to avoid those things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 26, 2024, 02:22:48 PM",
      "body": "Quote from: Stepstowealth on October 26, 2024, 01:32:56 PMCan self-custody be too difficult to practice by a crypto investor? Only if they are illiterate, in which case they shouldn't invest in bitcoin anyway.  Quote from: Stepstowealth on October 26, 2024, 01:32:56 PMBecause I spoke to somebody about bitcoin and the person responded by saying that they are not too sure that they can trust their self to keep their investment safe because of their careless nature, and this got me thinking because can I call this person being very sincere or the person is just afraid to try. I know a guy who is a veteran stock trader, and when he invested in bitcoin some years ago, he decided to do it via Grayscale as he simply didn't want that responsibility of storing his own bitcoin. Weird thing is that guy in question is is a very tech savvy (ex developer) and wouldn't have any issues with storing his bitcoin properly but he simply didn't want to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "October 26, 2024, 02:25:23 PM",
      "body": "It doesn't, because they have options.Based on what we know about the proliferation of broker accounts and apps at places like Coinbase, Binance, PayPal, etc., not to mention the ETFs, it would appear that most consumers don't want self-custody and would instead prefer to keep an account secured by their own identity at a firm they trust.It's important to understand the phenomenon of the Anon Paradox, which states that consumers like anonymity for \"small\" money, and their personal identity connected to \"big\" money. In other words, if somebody wants to play around with say $50 in Bitcoin or some other digital currency, then they want this to be anonymous like the physical cash in their physical wallet. The reason is that they like the anonymity for spending it--that way they don't impart personal data when they buy something.But if somebody is keeping a large part of their life savings digital currency investments, they want this to be safe and they tend to want to enlist the services of a firm like Coinbase to guard their money for them because they would otherwise be afraid of losing the keys, or them being stolen, or them being beaten or murdered because of their physical possession of their keys (it's the same reason people don't hold their savings in piles of physical cash in their own home and instead use a bank).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Felicity_Tide",
      "created_time": "October 26, 2024, 02:28:21 PM",
      "body": "Quote from: Stepstowealth on October 26, 2024, 01:32:56 PMCan self-custody be too difficult to practice by a crypto investor?I think In my last reply, I addressed something relating to this, and I will also share the same thing here. The Truth is, not everyone wants to be accountable,i.e everyone can not give account for things under their care. There are so used to the bank system where third party have to help them manage/hold their funds.To this question above, I think self custody is a very big deal to some people. These are people who don't even see the vision or need for personal banking or whatsoever. I can't really find a perfect word to describe them, but I think they are scared of accountability.And as for the main question of the thread, I don't think self custody can be difficult for a newbie especially when he/she has learnt the benefit of it. But if he/she happens to be one of those that is scared of accountability, then they might want to stick to whatever they are doing. Ideally, most newbies starts their Bitcoin journey using a cex, until they've finally realized its disadvantage, before transiting to self custody. While others might be too scared to transit. I think the world is just filled with different people with their own taste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "October 26, 2024, 02:33:37 PM",
      "body": "Quote from: Stepstowealth on October 26, 2024, 01:32:56 PMCan self-custody be too difficult to practice by a crypto investor?It's easy, and not too hard to start for any newbie. Exceptions are the elderly who have more difficulty in learning new things but if they really want, they can do it.QuoteBecause I spoke to somebody about bitcoin and the person responded by saying that they are not too sure that they can trust their self to keep their investment safe because of their careless natureIf they are careless enough to lose money by themselves, they can store bitcoin on centralized exchanges and pray that centralized exchanges will secure bitcoin for them. This practice is another careless one and rather than giving them an advice to continue to be careless, and take with centralized exchanges, I will recommend them to become more careful, and go self custodial.Reminder: do not keep your money in online accountsBitcoin security and resources.Cryptocurrency security checklist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "October 26, 2024, 02:46:40 PM",
      "body": "Wallets aren't that hard to use anymore, their setup is pretty straightforward, but this isn't the issue as some users already mentioned. I'm one of those people who have been careless in the past, losing an unknown number of wallets from 2013 to 2017, it's certainly more than five private keys/wallets, some of them were recovered, but others were lost. The issue with online wallets, exchanges or any kind of service is that you never know when they'll shut down or start requesting more documentation, refusing access to your funds with no valid reason.I personally didn't lose any money when I stored my Bitcoin on BitGo, which does provide you with the private keys, and on Bitstamp, both of which are reputed services, but did lose a reasonable amount of Bitcoin on the Xapo wallet, which refused access to my account even though I provided with everything they requested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Larreate.x",
      "created_time": "October 26, 2024, 02:57:49 PM",
      "body": "Quote from: Stepstowealth on October 26, 2024, 01:32:56 PMCan self-custody be too difficult to practice by a crypto investor? Because I spoke to somebody about bitcoin and the person responded by saying that they are not too sure that they can trust their self to keep their investment safe because of their careless nature, and this got me thinking because can I call this person being very sincere or the person is just afraid to try. Everyone should be in-charge and control of their bitcoin investment, and if somebody knows that they cannot practice self custody then I don't believe that bitcoin should be what they are investing in because it is simply not safe for someone else to be helping you manage your investments in bitcoin. Honestly, why jump straight into total self-custody? It’s way better to take it easy and go step by step. Start with the basics, get a solid grip on security, and have some support at the beginning. This way, you can ease into it, build your confidence, and avoid risking everything all at once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 26, 2024, 06:18:08 PM",
      "body": "Self-custodying your crypto coins is a big responsibility, no doubt.  You gotta be the bank, the vault, and the security guard all in one.  But I think anyone can get the hang of it if they try.  Theres lots of stuff out there - videos, tutorials, forums - to help you get started. You can use hardware wallets for extra security. Or if you know your way around tech, you can make your own wallet on an air-gapped device. Either way, self-custody is the most secure way to hold your crypto, imho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "October 26, 2024, 06:26:56 PM",
      "body": "Quote from: Stalker22 on October 26, 2024, 06:18:08 PMSelf-custodying your crypto coins is a big responsibility, no doubt.  You gotta be the bank, the vault, and the security guard all in one.  But I think anyone can get the hang of it if they try.  Theres lots of stuff out there - videos, tutorials, forums - to help you get started. You can use hardware wallets for extra security. Or if you know your way around tech, you can make your own wallet on an air-gapped device. Either way, self-custody is the most secure way to hold your crypto, imho.But again, as others here seem to be saying, why not just use a broker or app? That's actually what most holders of Bitcoin do these days.Self-custody is a niche product in the same way that people using a personal home safe is to hold large amounts of physical cash. Sure, some people like to keep their life savings physically within a few feet of them, but 99% of people just use a bank etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "October 26, 2024, 06:32:13 PM",
      "body": "For are newbie what we encourage most of them to do is to practice self custody and not to over depend on non custodial wallets this is because most of the third parties wallets have control over the wallet and what extent of transactions and activities that goes on in the account, that is the reason we have to master the art of self holdings, regardless of what the hustle and difficulty that comes with self custody such as paying high fees to transfer the asset to exchange and the rest of the other difficulties theat we face with our personal wallet.Unlike what we have with exchange wallets that give us access to excahging our coins and transferring them with ease but in there we have lost our control over the funds that are held in there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 26, 2024, 06:34:03 PM",
      "body": "Self custody should not be something that can discourage a Bitcoin beginner because the asset is theirs and it's security should be their top priority without being lazy about it. They should know that they can lose their money if they are careless about their security. Anyone that can not handle and protect their own asset by themselves should rather not invest because I can not advice anyone to put their asset under the care of another person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "October 26, 2024, 06:38:52 PM",
      "body": "Quote from: Stepstowealth on October 26, 2024, 01:32:56 PMCan self-custody be too difficult to practice by a crypto investor? Because I spoke to somebody about bitcoin and the person responded by saying that they are not too sure that they can trust their self to keep their investment safe because of their careless nature, and this got me thinking because can I call this person being very sincere or the person is just afraid to try. Everyone should be in-charge and control of their bitcoin investment, and if somebody knows that they cannot practice self custody then I don't believe that bitcoin should be what they are investing in because it is simply not safe for someone else to be helping you manage your investments in bitcoin.Self-custody is the best approach for anyone who wants to invest in Bitcoin. I don't see anything complicated in wallet use, it's just that some people don't want to take responsibility. They still have the choice of investing through third parties. But they should be willing to endure the consequences of their choices. Investors who lost their investment in Mt. Gox in 2014 started receiving repayment this year, while FTX customers were more fortunate after a court gave judgment for repayments after two years. Many others who put their money in centralised platforms were not lucky enough to get their money back after the firm went down. It is better to be your bank than to put your money in investors you know nothing about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 26, 2024, 06:45:20 PM",
      "body": "Quote from: Stepstowealth on October 26, 2024, 01:32:56 PM.... I spoke to somebody about bitcoin and the person responded by saying that they are not too sure that they can trust their self to keep their investment safe because of their careless nature, and this got me thinking because can I call this person being very sincere or the person is just afraid to try. That's a valid point, that's why there are million of users who have bank accounts for them to let the banks take care of their financial savings while having some perks of having it and some promises of assurance, instead of having their own vault at home and be responsible of making it safe. This is the very reason why bitcoin was created for this main purpose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 26, 2024, 06:45:38 PM",
      "body": "Self custody is very easy in my honest opinion, however, if anyone feels that they cannot be their own bank, then they shouldn't use BTC, because it will be crazy for them to use BTC and then store their funds in a centralized exchange or custodial services. I hope this person you are talking about didn't see what CZ said sometime ago, that 99% of people would likely lose their BTC stored in their self custodial wallet, lol, because that statement is false.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}