{
  "id": "topic_5425130",
  "title": "WeThePe0ple",
  "author": "WeThePe0ple",
  "created_time": "December 02, 2022, 10:35:18 AM",
  "content": "I work in healthcare and one of my patients offered an investment opportunity to me.Leaving any amount of money higher than 100 bucks untouched for 9 months, would result in a 600% return on investment.Of course this is fraud, but I had to figure it out. It is a pyramid system in which withdrawals of people at the top, are funded by money from new \"investors\" at the bottom of the pyramid. My patient had made 2 previous withdrawals with success ($2500 profit and $9000 profit), and has now invested $10 000 expecting 60 000 in a few months.When no new money enters the system, the bottom line of the pyramid loses their money and the creator of the scam takes it all.The scammer asks to get paid in BTC, not in fiat currency. Can his BTC address somehow lead to an arrest? Ponzi schemes don't last long. And historically these people are arrested because the source of the money is easily identified.Now with BTC I think it is much harder to identify the scammer and to stop the scheme. I think it's harder for any government to prove that there is a Ponzi scheme in the first place",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425130",
  "comments": [
    {
      "author": "Lucius",
      "created_time": "December 02, 2022, 10:48:28 AM",
      "body": "They can cover their tracks as much as they want, but they can't hide if one of those powerful agencies wants to find them - or in other words, if the scam turns into a multimillion-dollar fraud. There are numerous stories that speak in favor of this, although there are certainly those scammers who manage to stay under the radar.That patient of yours took the bait very well, because he reinvests almost everything he allegedly earned, and at some point everything will collapse and he will be left with nothing. Even what he is telling you may not even be true, maybe he is just one of those who throw the bait and wait for someone like you to be caught on the hook. 600% investment return in just a few months is certainly nothing legal, you shouldn't have any doubts about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "December 02, 2022, 10:48:48 AM",
      "body": "Ponzi scheme is similar to fishing, you use a bait to catch a fish that's why nobody is to be blamed. Most often, why these Ponzi admins go Scott free is because some people profited on the initial stage. Like your patient whose profits is around $9000 she won't have the guts to chase after the admins when they're gone, same with other victims. Apparently, only a few that didn't make a dime; those that their funds were used to close the scheme would blow the whistle and it may not sound too loud for the Government to hear them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "December 02, 2022, 10:52:28 AM",
      "body": "Quote from: WeThePe0ple on December 02, 2022, 10:35:18 AMCan his BTC address somehow lead to an arrest? Ponzi schemes don't last long. And historically these people are arrested because the source of the money is easily identified.Now with BTC I think it is much harder to identify the scammer and to stop the scheme. I think it's harder for any government to prove that there is a Ponzi scheme in the first placeIf the scammer is dumb enough to not use mixing or similar tools, and then send the coins to a centralized exchange that does KYC, and this exchange would cooperate with police, the scammer could get caught. Otherwise there's very low chance of this happening. Though you should still remember that Bitcoin transaction is not the only activity - a scammer could use their name, adddress, their photo to establish trust, and this could help police catch them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "December 02, 2022, 10:55:16 AM",
      "body": "YES. There’s a news about this last October that a ponzi operator during 2012 just got arrested this October for committing such criminal offense even a long time ago. You read the news on this Bitcoin Ponzi Operator Ordered Imprisoned for Civil Contempt although his case is already in court many years ago. The ruling still a guilty against him because all the illegal transactions that proof on the offense is recorded in the blockchain.There’s also chain analysis services nowadays that can track all the transactions even with a mixer. This criminals ponzi operator might not be caught today but they will soon once victims file a case against them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 02, 2022, 10:58:38 AM",
      "body": "Excuse me, but will you give your money to someone who will invest it without knowing this person?When a person invests your money and gives you a return, there must be a commercial, investment, lending or any income-generating activity. Ask that person about this data and if it is practically impossible to achieve that profit, why you invest in the first place?Ponzi schemes are investments that appear to be profitable, and the average person cannot verify that it is a scam except after it has occurred, but after scrutiny from investment institutions and companies, and after careful examination, it can be revealed.Therefore, the model that offers 600% profits without mentioning a logical mechanism for generating those profits is a scam and you would be stupid if you gave them your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WeThePe0ple",
      "created_time": "December 02, 2022, 10:59:22 AM",
      "body": "Quote from: Lucius on December 02, 2022, 10:48:28 AMThey can cover their tracks as much as they want, but they can't hide if one of those powerful agencies wants to find them - or in other words, if the scam turns into a multimillion-dollar fraud. There are numerous stories that speak in favor of this, although there are certainly those scammers who manage to stay under the radar.That patient of yours took the bait very well, because he reinvests almost everything he allegedly earned, and at some point everything will collapse and he will be left with nothing. Even what he is telling you may not even be true, maybe he is just one of those who throw the bait and wait for someone like you to be caught on the hook. 600% investment return in just a few months is certainly nothing legal, you shouldn't have any doubts about that.I've known the patient for 4 years now. We are friends. She logged into her account and showed me the transaction history.She started with a hundred bucks, to test the waters. Then she 10x'ed because the withdrawal worked, and now she has done it again.She and her husband are both in it for 10k at this point. They are even making accounts for their children.They realize it may be a scam, but they only invest previous profits so they can't lose their own money.If people succeed in taking out $10k or $50k to test the waters, and the scammer allows this because he expects them to re invest, they have scammed the scammer.Although I do not believe the scammer will let them take out this kind of money. I considered entering the scheme because the scammer is likely to let people take out profits under 10k.But I do have to register with my passport, and I don't feel comfortable uploading this to a scammer's website",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 02, 2022, 11:08:40 AM",
      "body": "Quote from: WeThePe0ple on December 02, 2022, 10:35:18 AMwould result in a 600% return on investment.This type of scam is too obvious because it is pretty simple to debunk them. If there existed a method of investment that could give such a massive return they would never accept YOU as an investor! They would simply invest their own money and become billionaires in a short time...QuoteCan his BTC address somehow lead to an arrest? Now with BTC I think it is much harder to identify the scammer and to stop the scheme. I think it's harder for any government to prove that there is a Ponzi scheme in the first placeIt is both easy to find the scammer and arrest them and to prove this whole operation is a scam.The real problem is whether the law enforcement going to do anything about it. Someone has to file a complaint and go through all the legal work to bring them down. In Ponzi schemes people don't do that until it is too late and the scammer has already ran away with their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "December 02, 2022, 11:24:37 AM",
      "body": "You should search for this term on the Google “QNET”. You will see stories of peeps around the globe who got scammed in millions of dollars and nobody knew how to recover the same. Though there is proper channel, valid registration of companies and if you go and complain about it to the authorities they will have answers to every steps that you took at the time of investing money and why you lost it. When you register for the schemes they will add you to the down line and they will gift you holiday packages and take you to big 7 star hotels overseas and have meet ups. They will literally brain wash you with all those pleasures and leisure trips and you will find yourself at a spot where it feels like dreamy and you can’t get out of it. If you lodge complain about their fraud then they will simply tell court that they spent money on your trips, present all your photos and videos and airplane tickets and stuff. They will cover A to Z trails and that’s why they are running smoothly till date. The only difference is, it was used to be in fiat currency and now BITCOIN is way to make it more private and easy to convince.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "December 02, 2022, 11:44:40 AMLast edit: December 02, 2022, 12:44:59 PM by Zlantann",
      "body": "Immediately anyone introduces a business or an investment scheme to me, the first question I asked is: How would the company make a profit after giving me all these large profits? Anyone can easily identify them with their enticing profits and benefits but greed and lack of contentment will always make people fall victim.I hate when Bitcoin is associated with crime because it gives some anti-Bitcoin forces the privilege to make such news a newspaper headline. I have never invested in any Ponzi scheme and I would never do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "December 02, 2022, 12:07:09 PM",
      "body": "Quote from: WeThePe0ple on December 02, 2022, 10:59:22 AMI considered entering the scheme because the scammer is likely to let people take out profits under 10k.What if they later change it to just under $100?QuoteBut I do have to register with my passport, and I don't feel comfortable uploading this to a scammer's websiteAt this point, you've lost.It seems that you're really ambitious with that profit even though there is no guarantee at all that the next 9 months the capital you put in can even be returned intact. I think you better go to the casino site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "December 02, 2022, 12:07:25 PM",
      "body": "I don't think the ponzi owner is smart enough to cover his track, in some point he will need to use an exchange to conver the coins into real money, and there is where he can get tracked.The best option is to report the address to the police and give all information you have to them, like the Ponzi website, phone number, or even some names. That would help the police to find who is behind that scam.BTC can't be used to cover tracks, for that we have Monero",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 02, 2022, 12:17:16 PM",
      "body": "Quote from: WeThePe0ple on December 02, 2022, 10:59:22 AM<…>Although it is certainly going to turn out to be a scam, you could state what the website url so people can look into it further (i.e. place the url in a code structure so nobody clicks is inadvertently, or something like this: www[dot]domain[dot]extension).Using as bait a x6 for locking bitcoin during 9 months is bound to get some people to fall for it, and a few may actually see some returns in order to get people to invest more, or to get some positive word-of-mouth spreading around. What surprises me though is that, if your patient has already been able to make a withdrawal, then the scheme has been running at least for 9 months as per de conditions stated in the OP. That’s a pretty long time for a scheme of the sort, and perhaps the scammer’s strategy is based on a cultivated word-of-mouth promotion, rather that the classical quick email/social network procedure plus a pop-up site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "December 02, 2022, 12:32:35 PM",
      "body": "You're right with the description of these pyramiding scams and ponzi's. They're just getting the profit of the existing members from the new members and there goes the cycle. As for tracking the btc address, it's very possible but it's harder than to be expected because it can sent through a mixer and switched or converted to privacy coins and other coins for them to be more harder to be tracked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 02, 2022, 01:41:53 PM",
      "body": "Quote from: WeThePe0ple on December 02, 2022, 10:35:18 AMI work in healthcare and one of my patients offered an investment opportunity to me.Leaving any amount of money higher than 100 bucks untouched for 9 months, would result in a 600% return on investment.Of course this is fraud, but I had to figure it out. It is a pyramid system in which withdrawals of people at the top, are funded by money from new \"investors\" at the bottom of the pyramid. My patient had made 2 previous withdrawals with success ($2500 profit and $9000 profit), and has now invested $10 000 expecting 60 000 in a few months.When no new money enters the system, the bottom line of the pyramid loses their money and the creator of the scam takes it all.The scammer asks to get paid in BTC, not in fiat currency. Can his BTC address somehow lead to an arrest? Ponzi schemes don't last long. And historically these people are arrested because the source of the money is easily identified.Now with BTC I think it is much harder to identify the scammer and to stop the scheme. I think it's harder for any government to prove that there is a Ponzi scheme in the first placeThere is a lot of such fraud in my country, but a very important point for a new participant to receive money is to attract new investors to this financial pyramid. If you do not bring new participants, then the organizers of the financial pyramid will not allow you to withdraw a lot of money. Therefore, the participants of the financial paramid are actively engaged in attracting new participants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "December 02, 2022, 01:53:21 PM",
      "body": "Bitcoin is pseudonymous which basically means it is no completely anonymous as it seems. If the powerful agencies want to track the user they can still do it but that's not possible if a common man like us wants to track the user down.At some point the scammer will use the money for something or will try to withdraw the money which is when the scammer is tracked down.Although its not easy it is not impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 02, 2022, 01:57:56 PM",
      "body": "Quote from: WeThePe0ple on December 02, 2022, 10:35:18 AMLeaving any amount of money higher than 100 bucks untouched for 9 months, would result in a 600% return on investment.We had a similar scheme in our country too. It only accepted cryptocurrencies and gave about that kind of percentages (I presume mostly to those on top). It burst after about a month. If it hasn't happened yet, be sure that it will.Quote from: WeThePe0ple on December 02, 2022, 10:35:18 AMCan his BTC address somehow lead to an arrest? Yes, but bitcoin is cash and that's how you should treat it. The scammer shouldn't be considered dumb. He's likely going to use mixing and, just as cash, become untraceable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WeThePe0ple",
      "created_time": "December 02, 2022, 02:05:46 PMLast edit: December 02, 2022, 04:13:29 PM by mprep",
      "body": "Quote from: Zlantann on December 02, 2022, 11:44:40 AMI hate when Bitcoin is associated with crime because it gives some anti-Bitcoin forces the privilege to make such news a newspaper headline. I have never invested in any Ponzi scheme and I would never do that.I agree. And I have not invested in BTC (yet?) for various reasons. The main one being that governments will find a way to fight against it. And the excuse will be to associate it with crime. Although BTC is legitimate, its privacy allows for scammers to stay under the radar. And that is a pretty valid argument for governments and banks to go after BTC. Quote from: BlackHatCoiner on December 02, 2022, 01:57:56 PMWe had a similar scheme in our country too. It only accepted cryptocurrencies and gave about that kind of percentages (I presume mostly to those on top). It burst after about a month. If it hasn't happened yet, be sure that it will. But the scammer knows that nobody will invest large amounts of money if he does not allow them to withdraw substantial amounts of money (under 10k) at least once. And if you are high up in the pyramid, you might be able to have 2 successful withdrawals near the 10k range before the whole pyramid collapses from below.The thing is that nobody knows where in the pyramid they are.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "December 02, 2022, 02:19:22 PM",
      "body": "Quote from: WeThePe0ple on December 02, 2022, 02:05:46 PMThe main one being that governments will find a way to fight against it.Every single entity that is threatened by it is attacking it years now. Yet, against all odds, bitcoin somehow continues operating in a transparent, censorship-resistant manner, serving individuals with peer-to-peer transactions every 10 minutes. Apparently, humans always find a way to step closer to freedom. Quote from: WeThePe0ple on December 02, 2022, 02:09:46 PMAnd if you are high up in the pyramid, you might be able to have 2 successful withdrawals near the 10k range before the whole pyramid collapses from below.The bet is greed. Very few are going to stop at 2 withdrawals if they see their balance going upwards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "December 02, 2022, 02:35:02 PM",
      "body": "Quote from: WeThePe0ple on December 02, 2022, 10:59:22 AM~snip~There is no justification for Ponzi schemes, regardless of who such information comes from, good friends or just acquaintances - the fact is that a lot of people will lose a lot of money in that story, and anyone who promotes it in any way is complicit in the final outcome. Not only will people lose money, but they can become victims of identity theft - and that's a much bigger problem than losing a few hundred or thousands of dollars.@WeThePe0ple Quote from: mprep on July 21, 2014, 05:27:51 PM32. Posting multiple posts in a row (excluding bumps and reserved posts by the thread starter) is not allowed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}