{
  "id": "topic_5445174",
  "title": "hugeblack",
  "author": "hugeblack",
  "created_time": "March 16, 2023, 03:02:43 PM",
  "content": "QuoteShares of First Republic and several other regional banks were under pressure again Thursday, as the Swiss National Bank’s move to shore up Credit Suisse did little to calm fears about more midsized bank failures in the U.S.First Republic fell more than 30% in morning trading. PacWest dropped 14%, and Western Alliance shed about 12%.The collapse of Silicon Valley Bank last Friday has left investors scrambling to identify other regional banks that have similar balance sheet issues, namely a high rate of uninsured deposits and bonds or loans with a long time to maturity.First Republic had the third-highest rate of uninsured deposits among U.S. banks, behind SVB and Signature Bank, which was closed by regulators over the weekend, according to a note from Raymond James. First Republic’s stock was down nearly 75% in March as of Wednesday’s close, and the bank’s debt has been downgraded by S&P Global Ratings and Fitch Ratings.Source ---> https://www.cnbc.com/2023/03/16/first-republic-falls-25percent-as-regional-bank-stocks-continue-to-sink.htmlIt seems that all banks with a high rate of uninsured deposits will be at risk and perhaps next on the list, as after SVB and Signature Bank lies First Republic, which lost 30% of its name value during the day and the bank's debt ratings were lowered by S&P Global Ratings and Fitch Ratings.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445174",
  "comments": [
    {
      "author": "Zlantann",
      "created_time": "March 16, 2023, 07:12:12 PM",
      "body": "Quote from: hugeblack on March 16, 2023, 03:02:43 PMIt seems that all banks with a high rate of uninsured deposits will be at risk and perhaps next on the list, as after SVB and Signature Bank lies First Republic, which lost 30% of its name value during the day and the bank's debt ratings were lowered by S&P Global Ratings and Fitch Ratings.Too bad!!! These banks were managed by careless bankers that are not different from Sam Bankman-Fried and company. If the bank reveal it's customers that has bad debt I guess the bank's debtors will be politicians and global company CEOs. It is possible that they gave loans to their friend and cronies without considering the implications on the bank. I thought loans and credits are not given without collateral or security? What happened to customer's funds? This is a glaring case of corruption and mismanagement.But it's good to read that the Federal Reserve is willing to go above the FDIC insured limit of $250,000. This means that government is willing to bail these struggling banks. It is also possible that the US government will also not let First Republic and other regional banks fail because it will have negative consequences on the economy of the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "March 16, 2023, 08:43:05 PM",
      "body": "The current banking failures remind me of my Banking 101 classes from my MBA days. The reasons are so simple yet so critical that these banks have no other choice but to move out of business. The only silver lining here is that now the regulators are under tremendous pressure to identify sick banks and take steps to boost them so that the consumers' deposits are safe. The list is not going to end here! We will hear more such news in the coming weeks where more sick banks will either collapse or will be temporarily taken over by the banking regulators to audit and provide help to sustain their businesses. It's too bad because the money will be used to revive these banks, essentially belonging to the taxpayers. Time for crypto?? probably yes!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 17, 2023, 05:14:03 AM",
      "body": "It seems that the rescue is on the way and the Federal Reserve will not disappoint the banks, as today's weekly H.4.1 update from the Federal Reserve showedQuoteIn the week ended March 15, borrowings under the Fed's deeply stigmatizing last-ditch liquidity facility, the Discount Window, exploded to $152.85BN, a record $148BN weekly jump to an all-time high which surpassed even the borrowings during the financial crisis!At the consolidated level, the surge in new liquidity created by the Fed meant that the Fed's balance sheet rise by $297bn - its biggest jump since April 2020 and erasing 4 months of QT, or half of the entire program!Source ---> https://www.zerohedge.com/markets/fed-balance-sheet-explodes-300bn-bank-bailouts-lead-record-discount-window-surge",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "March 17, 2023, 09:56:39 AM",
      "body": "This gets me thinking that centralisation is truly corrupted and everyone at some point thinking about themselves no matter what. It’s simple, when these bankers are working there is high chance of manipulating the system in terms of different schemes. For example, someone might just bribe them to show higher income and lend money accordingly. Anything from paper to pen can be managed in the centralised world and that’s what happening with the banks. It is clear that if they have balance sheet issues then something must be cooking to benefit on individual to team level. Overburdening the system with high outflow of cash and then big loans getting settled with other schemes can cause banks to go towards bankruptcy. The shits repeating again and again all the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "March 17, 2023, 02:37:50 PM",
      "body": "Quote from: hugeblack on March 16, 2023, 03:02:43 PM~snipThis is not a healthy and dangerous trend. If the banks start to collapse one by one, then nothing good will come for the crypto industry either. The domino effect and general panic are unlikely to encourage former bank savers to invest in cryptocurrencies.In general, this is by no means the first case when banks cease to exist, but people and companies still continue to keep money in them. Each time there are different names, but the principle of functioning and collapse is the same for them, which at such moments begins to work unstably: panic -> investors withdraw their assets -> those who didn't have time, they lost ->bankruptcy.I wonder if companies will now think that it is time for them to change something? Can they use other ways to store their assets, or will each of them assume that these problems don't affect them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "March 17, 2023, 02:37:54 PM",
      "body": "Quote from: Zlantann on March 16, 2023, 07:12:12 PMToo bad!!! These banks were managed by careless bankers that are not different from Sam Bankman-Fried and company. If the bank reveal it's customers that has bad debt I guess the bank's debtors will be politicians and global company CEOs. It is possible that they gave loans to their friend and cronies without considering the implications on the bank. I thought loans and credits are not given without collateral or security? What happened to customer's funds? This is a glaring case of corruption and mismanagement.I wouldn't say SVB carelessly managed funds at all. U.S. treasury bonds are not traditionally high risk. I'm aware the argument could be made that investing in U.S. treasury bonds in an inflationary economy is risky -- SVB should have been aware that their treasury bonds were not going to be as valuable as they once were. That's far from reckless behavior. Bankman-Fried knowingly mismanaged funds which caused liquidity issues. SVB tried to raise funds and there was an uncontrollable run on the banks.Quote from: Zlantann on March 16, 2023, 07:12:12 PMBut it's good to read that the Federal Reserve is willing to go above the FDIC insured limit of $250,000. This means that government is willing to bail these struggling banks. It is also possible that the US government will also not let First Republic and other regional banks fail because it will have negative consequences on the economy of the country.There should not be an incentive for banks to risk client funds and be bailed out by the government in case their bets don't work out.Do you, say as an individual investor, have such safety measures in place? The government would not help you in such an event, why should they help the banks?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "March 17, 2023, 10:12:30 PM",
      "body": "Quote from: Gyfts on March 17, 2023, 02:37:54 PMI wouldn't say SVB carelessly managed funds at all. U.S. treasury bonds are not traditionally high risk. I'm aware the argument could be made that investing in U.S. treasury bonds in an inflationary economy is risky -- SVB should have been aware that their treasury bonds were not going to be as valuable as they once were. That's far from reckless behavior. Bankman-Fried knowingly mismanaged funds which caused liquidity issues. SVB tried to raise funds and there was an uncontrollable run on the banks.Yea I wouldn't say they mismanaged funds but they got greedy and reckless. I guess they felt they were too big to fail or maybe they didn't think it through. Treasury bonds are not high risk but they're long-term investments so they could have thought of all the possible scenarios of how things can go south. Quote from: Gyfts on March 17, 2023, 02:37:54 PMDo you, say as an individual investor, have such safety measures in place? The government would not help you in such an event, why should they help the banks?The government is not doing it for the sake of the company per se. Allowing the companies to fail would lead to further systemic failure or risk of failure at the very least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "March 17, 2023, 10:51:30 PM",
      "body": "Bankers Bingo anyone?I'm seeing some circulating rumours that Credit Suisse is also to go down soon but haven't yet seen any concrete analysis on how would that happen. I'm yet to do my homework.More collapses seem inevitable, they haven't learned anything from 2008.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "March 18, 2023, 11:22:28 AM",
      "body": "Quote from: avikz on March 16, 2023, 08:43:05 PMTime for crypto?? probably yes!  I think it's high time these guys give up their quest of trying to revive these sectors as the more they try, the more there are loopholes. Collapse of banks like SVB, Silvergate Banks all point to the fragility of the financial system and I doubt just like you stated that it would be the end as we are still going to experience a destruction of wealth and some poor policy making causedby by bad actors in the financial institutions. It would indeed be a wise decision to move to Bitcoin as it's power is not only in it's price alone, but it's ability to grant one the freedom to transact freely in this extremely difficult world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "siniminomorocomunisakito",
      "created_time": "March 18, 2023, 11:51:32 AM",
      "body": "That may indicate potential risks in the banking sector and there may also be underlying problems with the bank's financial stability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "March 18, 2023, 12:35:46 PM",
      "body": "Quote from: m2017 on March 17, 2023, 02:37:50 PMQuote from: hugeblack on March 16, 2023, 03:02:43 PM~snipThis is not a healthy and dangerous trend. If the banks start to collapse one by one, then nothing good will come for the crypto industry either. The domino effect and general panic are unlikely to encourage former bank savers to invest in cryptocurrencies.In general, this is by no means the first case when banks cease to exist, but people and companies still continue to keep money in them. Each time there are different names, but the principle of functioning and collapse is the same for them, which at such moments begins to work unstably: panic -> investors withdraw their assets -> those who didn't have time, they lost ->bankruptcy.I wonder if companies will now think that it is time for them to change something? Can they use other ways to store their assets, or will each of them assume that these problems don't affect them?I fundamentally disagree with you on this issue. Bitcoin was created amid the 2008 crisis as an alternative to the existing financial system, and there is nothing better for Bitcoin to flourish than another banking crisis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raidarksword",
      "created_time": "March 18, 2023, 12:50:56 PM",
      "body": "This is why we should never trust our money on banks because this surely happen and this is the reality. Of course it is a statement that bitcoin is better than these banks and bank runs are really inevitable. These bank runs makes the market green again and people putting their money now on crypto and trusting bitcoin once in for all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "March 18, 2023, 02:45:54 PM",
      "body": "Silvergate, Silicon Valley Bank, Signature Bank, First Republic Bank, and even Credit Suisse are having a hard time right now for different reasons.What's happening with these banks affects the trust of the people towards the whole banking industry. The more banks to fall, the less deposits the people do and they might find an alternative way to store their money. Will these different banks falling down might be a cause for another \"2008 Global Financial Crisis\" again? As for the crypto, it looks like what's happening to the banks right now is a positive for the crypto investors thus, they are inserting more money and buying Bitcoin and other altcoins. We know that the sentiments of the people are a huge factor towards the price of a particular coin. Anyway, I don't know, but this might create domino effect towards other bank as well, and we might see more banks falling on the succeeding weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "March 18, 2023, 03:14:29 PM",
      "body": "The collapse of these banks will not stop yet because there are still some banks who is having the same problem but hasn't be figured out yet. This has brought panic to investors which has made them start thinking of an alternative method to save their funds and has led to low deposit in banks. Yes crypto will be the only alternative way for these customers who have been disappointed by their banks. It is time for bitcoin to gain more recognition, because this was the same reason that made Satoshi to come up with bitcoin technology in 2008. Bitcoin is the only option presently to keep your funds safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}