{
  "id": "topic_5478233",
  "title": "Bonkume",
  "author": "Bonkume",
  "created_time": "December 17, 2023, 07:37:43 AM",
  "content": "No government should prohibit the ownership of this technology. I mean this is freedom money just like national value is freedom and bitcoinIs the word dream money.Someone very wise say if you're born poor you die poor and I quoteBut with bitcoin if you're born poor and get education and you work hard youCan be any thing you want. But the way we can achieve more of the dream is  when bitcoin freedom is Intact and when are able to save bitcoin for our future and our family.thats what bitcoin is all about.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5478233",
  "comments": [
    {
      "author": "Apocollapse",
      "created_time": "December 17, 2023, 07:55:38 AM",
      "body": "Bitcoin itself is already a freedom, even you live in a country where Bitcoin isn't allowed, you're have a choice to own it through DEX or no KYC P2P e.g. Bisq, Robosats.Quote from: Bonkume on December 17, 2023, 07:37:43 AMBut with bitcoin if you're born poor and get education and you work hard youCan be any thing you want.What does Bitcoin has to do with work hard? you can become whatever you want with work hard and it's not always related to Bitcoin if you want to change your life. Bitcoin is just a currency, similar to fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "December 17, 2023, 08:15:11 AM",
      "body": "Bitcoin represents true freedom. What is life without the freedom to do what you want, when you want it, which will help you achieve a lot in life? The government never wants ultimate freedom for its own people; they always want everything to be under their control so that they may direct and give laws that we have no choice but to follow in order to realise our desires. Many countries claim to practise democracy, but many still operate under dictatorships.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 17, 2023, 08:16:24 AM",
      "body": "Quote from: Bonkume on December 17, 2023, 07:37:43 AMNo government should prohibit the ownership of this technologyGovernments do whatever they want, the only thing that matters to us regarding Bitcoin is to make it so that their actions don't affect Bitcoin. That is why Bitcoin was designed to be decentralized and it has achieved that successfully giving it other aspects such as also being censorship resistant.QuoteSomeone very wise say if you're born poor you die poor and I quoteThey don't sound very wise to me. There are countless examples that prove this wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "December 17, 2023, 08:36:41 AM",
      "body": "Bitcoin is meant for everybody no matter the country, race or religion. It is one thing that drives everyone together without giving a separate view. Bitcoin has a great monetary value in this our generation and more as we exploit the future.We can see one good country has already accepted the use of Bitcoin as a legal tender (El Salvador) this is a great insight of what will become of Bitcoin in the future. Many countries will then follow this steps in the future, as currently more e-commerce platforms are already working towards accepting Bitcoin payment as an option. This shows how far Bitcoin will grow in the future",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "December 17, 2023, 08:44:37 AM",
      "body": "Quote from: Bonkume on December 17, 2023, 07:37:43 AMNo government should prohibit the ownership of this technologyIf the technology is open source, it is free and open-access for everyone. Governments can not prohibit it and can not block access to the technology.Open source is important because it means verifiable, reproducible by everyone.QuoteIntact and when are able to save bitcoin for our future and our familyYou can join the party by buying bitcoin, hold it in your non custodial wallets that should be open source too.If you hold your bitcoin on centralized exchanges, you can lose it when the exchanges refuse to approve your withdrawal requests. Exchanges can scam you anytime and if you want your bitcoin safe, store it in your open source and non custodial wallet.You must back up your wallets to be able to recovery it later.How to to back up a seed phrase?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "December 17, 2023, 09:26:07 AM",
      "body": "Bitcoins cannot be considered as a digital currency. The reason is pretty simple. Bitcoins are limited or fixed in numbers, that is no more Bitcoins can be created or made. So instead of using as a mode of payment, people will use it as an asset which is very valuable due to fixed in numbers. No matter what’s the government’s take will be on the coins, people won’t use it to buy normal stuffs. They will sell Bitcoins to make maximum profits only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "December 17, 2023, 09:45:05 AM",
      "body": "Quote from: Jegileman on December 17, 2023, 08:15:11 AMBitcoin represents true freedom. What is life without the freedom to do what you want, when you want it, which will help you achieve a lot in life? The government never wants ultimate freedom for its own people; they always want everything to be under their control so that they may direct and give laws that we have no choice but to follow in order to realise our desires. Many countries claim to practise democracy, but many still operate under dictatorships.The good and unique thing about Bitcoin is basically as a result of its open-source technology which has also made it a decentralized digital currency. For the sake of emphasis, I am of the opinion that bitcoin is a digital currency because you can use it to transact products and services even though that has not been widely accepted across the globe. We need more involvement of marketers and those doing the everyday business, unlike the investors we have already heavily patronizing the currency.One thing I am sure of is the popularity of the Bitcoin as a digital currency as the time progresses. This is how it has been looking back to the history of currencies and the evolution of the paper currency currently in circulation. Before the paper currency, was the coins, the gold currency amongst other past currencies. You have the initial period where people adopt gradually through B2B business transactions and in stocks. Then you get to the level where it is widely accepted.Since Bitcoin is still barely over a decade, I expect more involvements and adoption from the people and we can also be very involved in the promotion of the currency to more business arena while we find the easiest way people can use it to transact into denominations and more easy-to-use digital currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 17, 2023, 10:05:20 AM",
      "body": "Quote from: Bonkume on December 17, 2023, 07:37:43 AMNo government should prohibit the ownership of this technology. I mean this is freedom money just like national value is freedom and bitcoinIs the word dream money.that’s exactly why the government would want to prohibit bitcoin it promotes anonymity and gives ‘too much freedom’ that it could invite illegal activities QuoteBut with bitcoin if you're born poor and get education and you work hard youCan be any thing you want. i’m confused do you mean education as in learn about bitcoin and work hard to trade or invest? or do you mean to replace fiat money with bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "December 17, 2023, 10:07:26 AM",
      "body": "Quote from: Nrcewker on December 17, 2023, 09:26:07 AMBitcoins cannot be considered as a digital currency. The reason is pretty simple. Bitcoins are limited or fixed in numbers, that is no more Bitcoins can be created or made. So instead of using as a mode of payment, people will use it as an asset which is very valuable due to fixed in numbers. No matter what’s the government’s take will be on the coins, people won’t use it to buy normal stuffs. They will sell Bitcoins to make maximum profits only.You need to read the definition from the whitepaper.Quote from: https://bitcoin.org/bitcoin.pdfA purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution. If you pay something using Bitcoin directly for a product or service, you're use Bitcoin as a currency. If you never do that, that's fine, but there's someone did bought 2 pizzas using Bitcoin. Bitcoin can only be used through internet connection, how can someone broadcast Bitcoin transaction through offline?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "December 17, 2023, 10:09:51 AM",
      "body": "Quote from: Bonkume on December 17, 2023, 07:37:43 AMNo government should prohibit the ownership of this technologyThe government will make policies they feel are appropriate for the people of the country. Such policies might be wrong or right but they will always claim that it is for the good of the people.Quote. I mean this is freedom money just like national value is freedom and bitcoinIs the word dream money.Bitcoin is decentralized which gives everyone who uses it the freedom to carry out financial transactions without restrictions.  It is indeed a currency that has revolutionized the financial system of the world.QuoteSomeone very wise say if you're born poor you die poor and I quoteThat's not true because you can work hard and get out of poverty. Many people who were born poor became rich by applying diligence and hard work.QuoteBut with bitcoin if you're born poor and get education and you work hard youCan be any thing you want. Bitcoin has made many people make good profits that have made them comfortable. But you need to buy Bitcoin which means you have to earn money to invest in it. You can also earn Bitcoin when you acquire the right skills.QuoteBut the way we can achieve more of the dream is  when bitcoin freedom is Intact and when are able to save bitcoin for our future and our family.thats what bitcoin is all about. You are right that the if government lifts restrictions on Bitcoin more people will Invest in the sector which will help them in achieving their dreams. And you are also right that long-term investment in Bitcoin is the best option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "December 17, 2023, 10:40:01 AM",
      "body": "Some government do because they are corrupt and they don't want to take chances wherein they may lose financial control as Bitcoin is all about financial freedom and no involvement from third parties. But I didn't quite understand what are you trying to say in second half of your quote and how is it even have to do anything with Bitcoin, why are you relating working hard with Bitcoin? I understand we need money to invest or buy Bitcoin but there are people who work even harder but don't bother investing into Bitcoin, so I would say it's more of knowledge and smart move that plays a role here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "oktana",
      "created_time": "December 17, 2023, 11:38:34 AM",
      "body": "Bitcoin brings freedom, but what freedom? People misunderstand the freedom and assume it means freedom from everything, but that’s not true. Bitcoin brings freedom in the sense that you have total control over your money. Bitcoin doesn’t give you freedom by changing the lives of poor people. That can happen if you invest and volatility favors you in your planned timeframe. But if not, the core of this is so you are the owner of your keys and your funds, not a centralized or middle man somewhere else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MFahad",
      "created_time": "December 17, 2023, 11:46:56 AM",
      "body": "Quote from: Bonkume on December 17, 2023, 07:37:43 AMNo government should prohibit the ownership of this technology. I mean this is freedom money just like national value is freedom and bitcoinIs the word dream money.Someone very wise say if you're born poor you die poor and I quoteBut with bitcoin if you're born poor and get education and you work hard youCan be any thing you want. You are right that governments should not ban technology, but in some cases governments face problems that force them to take such measures. It is also often heard that people in many countries use digital currency through digital technology for money laundering. Obviously, in such cases, the governments do not get any record because there is no legal record of these transactions.There are many people who were born poor but have come out of the quagmire of poverty through their hard work and effort. So it would be wrong to say that those who are born poor die poor. Of course, if one has good knowledge and interest about Bitcoin, he can gain a lot by investing in it. If you study and work hard, you can achieve a lot. Your education and hard work can end poverty, so you don't have to rely on Bitcoin alone. Success can be achieved everywhere with hard work.​",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "December 17, 2023, 11:54:46 AM",
      "body": "Quote from: Bonkume on December 17, 2023, 07:37:43 AMSomeone very wise say if you're born poor you die poor and I quoteBut with bitcoin if you're born poor and get education and you work hard youCan be any thing you want. Anyone that told you that lack sense or probably you have misquoted the person because what you said didn't make any sense. We have those that were born poor but they made it out of the poverty to the top of the food chain and today they're millionaires. Getting born poor doesn't seal your fate in life, it's left for you to be determine to make it out of poverty and be rich. Rich people who were born rich also die poor too so nobody is destined to die the way they were born. With or without Bitcoin you can achieve financial freedom, Bitcoin only makes it more doable since you don't get the restriction that some of the other means of getting financial freedom has. Bitcoin has made the playing field even but still having less resources puts you at an disadvantage because if Mr A and B both have patience's to hodl, who has more resources will get the best results from investing in Bitcoin. Your thread has no relationship with the title, I was expecting to read about the concerns of Bitcoin future of its feature of been a digital currency but the body of your topic has nothing to do with that, try changing the title to something that relate more with the body of your post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "December 17, 2023, 12:00:18 PM",
      "body": "Bitcoin definitely promotes financial independence and empowerment. Ideally, it helps people overcome socioeconomic hurdles. Purely, this technology democratizes the economy. Virtual assets like Bitcoin could change wealth distribution in our society. We must recognize the intricacies. Ownership should be allowed, but governments must provide stability and discourage misbehavior. Instead of restricting freedom, their involvement can make Bitcoin's growth and adoption safer. Integrating innovation with responsible monitoring is our goal.Bitcoin may help break the poverty cycle in this future. Learning and working with this technology could lead to extraordinary success. This is about establishing a more equal financial landscape where everyone can prosper, not just accumulating riches.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 17, 2023, 12:11:18 PM",
      "body": "Op i am having a hard time understanding what it is you want to say. Most of us already know what BTC is, but sadly the government doesn't see it that way, they label it a tool for money laundering and other kinds of illicit activities, and that is why they continue to attack BTC. However we cannot change what they think, but we can work together to stop the government from gaining 'control' over the BTC network, which is something they want to do by introducing censorship in BTC mining and attacking privacy solutions as well.Quote from: Bonkume on December 17, 2023, 07:37:43 AMBut with bitcoin if you're born poor and get education and you work hard youCan be any thing you want. You do not need BTC to be whatever you want to be, BTC is just a p2p electronic cash that is to be used for payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "December 17, 2023, 01:53:18 PM",
      "body": "Freedom can allow you to be creative more freely than being bound by a work contract that limits your space to do things that can bring in more money than you get at work. Bitcoin is freedom, while fiat money always guides you to follow all the rules implemented by the government. People who do not want their lives to be controlled by government regulations on the use of fiat money prefer the freedom of using Bitcoin.You are free to make transactions to buy goods and services with Bitcoin anywhere and at any time, the convenience offered by Bitcoin is not available with fiat money. You can easily send Bitcoins across countries however much and whenever you want, this convenience you never get with fiat money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "December 17, 2023, 02:49:53 PM",
      "body": "The truth is that no government can reach success in completely blocking the use of Bitcoin in their country.Is not possible for them to do that, Bitcoin decentralised nature already offer Bitcoin enthusiast that protection and safety they need, the issue that may arise for Bitcoin enthusiast and the government that are against Bitcoin is centralisation, for example making using of centralised exchanges like binance can give your personal identity out and some exchanges are channeled towards the requirements of the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 17, 2023, 02:55:00 PM",
      "body": "Yeah, just like the other members have already said,the government can do whatever they please, and no one tells them what to do and what not to do, especially if it's coming from the common man. The government likes to be in control of everything, and as long as Bitcoin is not under their full control, they will not allow citizens to freely engage with it, although Bitcoin is not banned in all countries around the world.Bitcoin has made some of the old investors millionaires, and for someone to be in such a favor of earning a fortune from Bitcoin, there are different strategies to be taken. First, someone cannot hold Bitcoin for a long time if they are only dependent on their Bitcoin investment. Some people are still holding the bitcoin they bought around 2011, and it's possible for them to do that because they still have other investments and sources of income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}