{
  "id": "topic_5459049",
  "title": "Riginac111",
  "author": "Riginac111",
  "created_time": "July 08, 2023, 09:18:03 AM",
  "content": "I have seen the risk in trading and its noticeable that trading needs more concentration than any other thing in the cryptocurrency investment,  I know I'm knew here but after reading what investors pass through for the loss they experience in trading, I have to share this with us. I know that trading need more seriousness and concentration because its a risk job and risk investment, I outline four things that make investors to lose during trading investment.1st, I will say it's as result of inappropriate of knowing the secret behind trading before joining trading 2rd, inability to know price of bitcoin ratio and stage before investing 3rd, Being careless to know when due to withdraw without being greed 4rd, ability to notice that greediness can be a barrier of losing the profit you made.As newbie I'm of a suggestion that it's good to advocate time to learn bitcoin and its chart of market before investing in any part of cryptocurrency investment and bitcoin, as a new investors that want to make profit and don't want to experience losses in investment, we should know the values of coins either altcoins and otherwise before investing Learning is a continuous process",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459049",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "July 08, 2023, 09:53:30 AM",
      "body": "Quote from: Riginac111 on July 08, 2023, 09:18:03 AMInsert QuoteI have seen the risk in trading and its noticeable that trading needs more concentration than any other thing in the cryptocurrency investmentTrading and investment are not the same but different. Trading does not go beyond swing trading and it can be day trading or scalping which are riskier. Investment which can be short or long term. Short tern investment would be at least 6 months. Quote from: Riginac111 on July 08, 2023, 09:18:03 AMI know that trading need more seriousness and concentration because its a risk job and risk investmentI will advice you not to see trading as a job. If eventually you are good and make money from trading, do not forget how risky it is for not to tell people that it is a job. Going for trading is a loss for more traders. Quote from: Riginac111 on July 08, 2023, 09:18:03 AM4rd, ability to notice that greediness can be a barrier of losing the profit you made.There are many times that I have opened position before and I gained enough already, but thinking I will gain more but the market reversed and I later lost. It is good to overcome greediness while trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 08, 2023, 10:37:41 AM",
      "body": "Greed makes you try to invest more, we love money and we want to collect more of it without getting tired, it is true that we are afraid of losing it, but the passion of collecting money remains greater than the passion of losing it, so saying that the investment should not be from the money you need during the next five years is the best or that No more than a total of 10% of your net investment.Then setting the target, I find many of my friends do not know when to sell. He says that I will sell when the bitcoin rises, but when it rises, you find him saying, Oh, I will wait a little while, perhaps the price will rise more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "July 08, 2023, 11:58:39 AM",
      "body": "Trading is very risky and I wouldn't advice a greedy man to go into trading. Investment is easy to noture,you just have to buy your bitcoin and hodli for long without you getting worried of the price of Bitcoin pumping or dumping as long as you have plans to sell at the bull run. Trading is not the same,you have to understand the market and the strategy that will work for you to enable you make profit. If you are trading and you have a little profit of $20,this is enough don't be greedy and think that because you made $20 easily,it will be possible for you to make $150,instead you will lose $150. What I mean is that be satisfied with the little profit that you get from trading and stop trading for that day. In trading,it is either you make profit or loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 08, 2023, 12:16:17 PM",
      "body": "That 3rd statement is true and has always been the case for the majority. Just as everyone is aware that they're on the profit, they're passing it on. It's because that they're thinking that the profit might be higher than what's being seen at the moment. Thus, greed is being detected on the majority while it's possible to sell at just keep the profit and win by that time, they're letting it pass because of the thought that the profit might be higher if they wait a little bit longer. Yes, that's possible but for how long? Years? or just a few days or just a few hours? Do not forget to satisfy yourself and take that profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "July 08, 2023, 12:24:33 PM",
      "body": "Hmm, Trading is suitable but trading addiction is something you should try to overcome what I actually meant by trade addiction is that when someone starts making the Future trade from the fast profits he tries to multiply his / her gains he starts doing it again and again in this simulation he only destroyed his mentality and portfolio. So trading addiction is not good even if it can cause severe damage to you financially and economically.Trading should always be considered part-time, if you are a student after a particular time span you can say you can be now a full-time trader. If you are really trading adduct than you are not on the level of a gambler and what gamblers does when they lose a lot you should know You can read relevant content here;Is Pathological Trading an Overlooked Form of Addiction?Gambling addict's suicide a 'wake-up call'",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptodude",
      "created_time": "July 08, 2023, 12:41:20 PM",
      "body": "Since learning is a continuous process, acquiring knowledge about our trade is very necessary in order to trade. Many of us invest directly in any token without acquiring any knowledge about the trade. We should review the market and know well about the status of bitcoin and the current world economic situation before investing. Keeping in mind that little knowledge is dangerous, one must acquire knowledge about the trade and then invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "July 08, 2023, 12:49:38 PM",
      "body": "Investing and trading are two different things. Investment is that you buy Bitcoin and keep it until the time comes to sell it. While trading is that you buy at low prices and sell at high prices and you do it continuously.So here you can see the difference so that if someone prefers to invest, he doesn't need to sell it for the short term especially if the price hasn't been able to reach the price he wants. It will be much safer to do investment than trading especially if someone does not have sufficient ability to analyze market movements.You better decide you want to become an investor or trader and start exploring and finding sources of learning so you can understand it better. I prefer to invest in Bitcoin instead of trading it because nowadays, it is not easy to profit from it. So you can keep hold of the Bitcoins and accumulate more Bitcoins so you can sell them in the next bull run and make a big profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "July 08, 2023, 02:22:52 PM",
      "body": "Well, over time if you keep the pace you'll surely learn the best way to minimize your losses. You'll have portfolio management, stop-loss feature is always there, plans and analysis are carefully reviewed, and lot of other things that will make you be good at trading. Trading will consume your peace when starting but fruitful when you know how to play the game in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "July 08, 2023, 02:42:17 PM",
      "body": "Quote from: Riginac111 on July 08, 2023, 09:18:03 AMI have seen the risk in trading and its noticeable that trading needs more concentration than any other thing in the cryptocurrency investment,  I know I'm knew here but after reading what investors pass through for the loss they experience in trading, I have to share this with us. I know that trading need more seriousness and concentration because its a risk job and risk investment, I outline four things that make investors to lose during trading investment.If you aware that you are newbie in Bitcointalk and also new in cryptocurrency market, don't try to write guide and teach.In your quotes part, you changed from investment to trading. Please don't mix them together because they are different. When you have a capital and you want to use it for both trading and investment, you have to separate your capital, on for investment and one for trading. Don't mix them and don't do both trading and investment if you don't split your capital.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fuso.hp",
      "created_time": "July 08, 2023, 02:54:47 PM",
      "body": "Quote from: Riginac111 on July 08, 2023, 09:18:03 AM2rd, inability to know price of bitcoin ratio and stage before investing 3rd, Being careless to know when due to withdraw without being greed 4rd, ability to notice that greediness can be a barrier of losing the profit you made.Learning is a continuous processThese points you mentioned are considered the initial steps of trading. That is, we must know about these to do trading. If we go to work without knowing any relationship, then the probability of making a mistake in that work is more than 90%. If we come to trading without any idea about trading, our risk of losing money increases by 90%. Taking risk and not being overly greedy means that we always have a target at which we will sell our coins. One should never sit back and not sell coins at a good time hoping for extra profit. Before joining trading as a newbie you must accept that trading will never make you very rich. According to your skill and trading strategy you can expect money income from here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "July 08, 2023, 02:55:00 PM",
      "body": "Quote from: Riginac111 on July 08, 2023, 09:18:03 AMAs newbie I'm of a suggestion that it's good to advocate time to learn bitcoin and its chart of market before investing in any part of cryptocurrency investment and bitcoin, as a new investors that want to make profit and don't want to experience losses in investment, we should know the values of coins either altcoins and otherwise before investing every trader and Investor will always be careful when they want to start trading or buying assets for the long term. everything has to do with capital and money, so no one will play around without knowing how to trade or how to see the potential of an asset.no beginner starts their trading or investing without a loss. it naturally happens, you have to make it an experience and also learning for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fesatmas",
      "created_time": "July 08, 2023, 03:19:13 PM",
      "body": "Quote from: rhomelmabini on July 08, 2023, 02:22:52 PMWell, over time if you keep the pace you'll surely learn the best way to minimize your losses. You'll have portfolio management, stop-loss feature is always there, plans and analysis are carefully reviewed, and lot of other things that will make you be good at trading. Trading will consume your peace when starting but fruitful when you know how to play the game in the long run.Experience is a source of knowledge and they will use this as reference material to avoid unwanted contingencies and take something positive to duplicate. Reflecting on an experience, we will definitely know what steps we should take in the future. Factors of self-control and various risk management will come by itself when someone has passed the beginner stage. Risk management such as stop loss, take profit and psychological health will have an important role in every trade so that someone avoids being called MC. On the other hand, I've noticed that most people find it difficult to reconcile with themselves when facing losses, so they break away from some of the rules they've set.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "July 08, 2023, 03:28:01 PM",
      "body": "Quote from: Awaklara on July 08, 2023, 02:55:00 PMQuote from: Riginac111 on July 08, 2023, 09:18:03 AMAs newbie I'm of a suggestion that it's good to advocate time to learn bitcoin and its chart of market before investing in any part of cryptocurrency investment and bitcoin, as a new investors that want to make profit and don't want to experience losses in investment, we should know the values of coins either altcoins and otherwise before investing every trader and Investor will always be careful when they want to start trading or buying assets for the long term. everything has to do with capital and money, so no one will play around without knowing how to trade or how to see the potential of an asset.no beginner starts their trading or investing without a loss. it naturally happens, you have to make it an experience and also learning for you.every trader has lost an amount before they really learn. the bigger the amount you lost the more you also want to learn to avoid the loss in that same situation. it motivates the traders who lost big time and they always want to get even by winning and making more money.among the lesson to learn is to sell before the bear market start. learning when it will start is your assignment to do because sometimes, it can fake a bear yet it's a trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "July 08, 2023, 03:34:05 PM",
      "body": "Quote from: Riginac111 on July 08, 2023, 09:18:03 AMAs newbie I'm of a suggestion that it's good to advocate time to learn bitcoin and its chart of market before investing in any part of cryptocurrency investment and bitcoin, as a new investors that want to make profit and don't want to experience losses in investment, we should know the values of coins either altcoins and otherwise before investing The word “newbie” is clearly doesn’t give you an edge to have suggestion that will be view seriously by other members here especially if you suggestion is more on your experience since you are just new. Most of us here knew the very basic of investing which is the point that you mention. A newbie giving an advice is always a stepping stone here to get merit which usually being ignored.One thing I like on your post is the part which learning is a continuos process. You should keep doing that until you have enough experience to share an advice to user that is much longer in crypto investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "July 08, 2023, 04:26:36 PM",
      "body": "In my opinion, investment and trading have their own risks. However, what makes trading more risky is analysis, strategy and the accuracy of entry is the main thing. If someone does the wrong analysis using the strategy they have, of course it will be fatal to their trading. Especially if it is margin trading, the money might disappear in a few seconds. So to avoid this, it's best for beginners to start from spot trading only, there's no need to rush into margin trading, because if traders are patient, they will be able to get a profit from their trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irhact",
      "created_time": "July 08, 2023, 07:17:31 PM",
      "body": "Quote from: Riginac111 on July 08, 2023, 09:18:03 AM3rd, Being careless to know when due to withdraw without being greed 4rd, ability to notice that greediness can be a barrier of losing the profit you made.As newbie I'm of a suggestion that it's good to advocate time to learn bitcoin and its chart of market before investing in any part of cryptocurrency investment and bitcoin, as a new investors that want to make profit and don't want to experience losses in investment, we should know the values of coins either altcoins and otherwise before investing As a trader you should be able to know when to be greedy and when to quit trading, the charts holds all this information as when you're good with reading charts you can predict when there will be a rise in the market, if it is just a pump that'll dump later or it's the market recovering from its down times and would continue increasing until a new resistance is reached. Any trader that isn't trading using the charts is not trading but doing some guessing.Reading and been able to understand and interpret charts are needed when trading as it ensure you're trading with caution if you follow the charts correctly. Another way to ensure you're trading with cautious is by using stop loss because this will help prevent you from lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 08, 2023, 08:39:05 PM",
      "body": "Quote from: Riginac111 on July 08, 2023, 09:18:03 AMI have seen the risk in trading and its noticeable that trading needs more concentration than any other thing in the cryptocurrency investment,  I know I'm knew here but after reading what investors pass through for the loss they experience in trading, I have to share this with us. I know that trading need more seriousness and concentration because its a risk job and risk investment, I outline four things that make investors to lose during trading investment.1st, I will say it's as result of inappropriate of knowing the secret behind trading before joining trading 2rd, inability to know price of bitcoin ratio and stage before investing 3rd, Being careless to know when due to withdraw without being greed 4rd, ability to notice that greediness can be a barrier of losing the profit you made.As newbie I'm of a suggestion that it's good to advocate time to learn bitcoin and its chart of market before investing in any part of cryptocurrency investment and bitcoin, as a new investors that want to make profit and don't want to experience losses in investment, we should know the values of coins either altcoins and otherwise before investing Learning is a continuous processTrading is probably one of the most difficult jobs that exist, and that is because even if your performance drops a little bit that can be more than enough to go from a profitable trader to a losing one, and what is worse is that as time goes by the average level of traders goes up, so what worked on the past will not work on the future, and as such you need to keep studying the markets and create new profitable strategies, which explains why the failure rate is so high and why even successful people eventually get tired of trading as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "July 08, 2023, 09:02:33 PM",
      "body": "Quote from: Riginac111 on July 08, 2023, 09:18:03 AMAs newbie I'm of a suggestion that it's good to advocate time to learn bitcoin and its chart of market before investing in any part of cryptocurrency investment and bitcoin, as a new investors that want to make profit and don't want to experience losses in investment, we should know the values of coins either altcoins and otherwise before investing There is a good time to invest in bitcoins, and while you decide to wait until you know enough to invest in bitcoins, the price will be changing and it can quickly move from a favorable price to a price that is not too good for you to enter into investment with when you finally decide to invest. It is possible to buy some bitcoins for keeps and then wait for learn about how to keep them well since learning is a continuous process, waiting may not go as well as you wish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 08, 2023, 09:06:53 PM",
      "body": "This has been discussed many times and yes we should not trade too much especially if you are still now capable to do so. Trading will always require and accurate analysis and you should have this first before you execute your trade, it you are not that confident better no to trade big yet. Learn everything, exert more effort and be more patient, trading also deals with your emotion so make sure to know how to control it as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}