{
  "id": "topic_5478171",
  "title": "Geremia",
  "author": "Geremia",
  "created_time": "December 16, 2023, 06:35:20 PM",
  "content": "Why can't I import a Bitcoin Core private key into an Electrum wallet that supports Lightning?Running importprivkey in the Electrum console, I get:QuoteError: This type of wallet cannot import private keys. Try to create a new wallet with that key.When I create a new Electrum wallet with the private keys, why is Lightning disabled for that wallet?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5478171",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 16, 2023, 06:49:22 PM",
      "body": "You can generate a seed phrase, keys and addresses on Electrum and send your coins that you want to use to open a channel there. If you think the fee is too expensive, use ViaBTC free accelerator. If you can not use ViaBTC accelerator, you can let us know your txid. Make sure the transaction size is not more than 500 byte (not 500 vbytes).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 17, 2023, 07:21:15 AM",
      "body": "Quote from: Geremia on December 16, 2023, 06:35:20 PMWhy can't I import a Bitcoin Core private key into an Electrum wallet that supports Lightning?Running importprivkey in the Electrum console, I get:QuoteError: This type of wallet cannot import private keys. Try to create a new wallet with that key.It used to be possible in the older version but the devs decided to disallow it in v2.0.Refer to this commit: https://github.com/spesmilo/electrum/commit/4ce699bf2570a4478c1f467f676c46e42f63f2b4That's probably because it breaks the purpose of the seed phrase backup since the imported keys wont be recoverable from it.And managing the HD derived keys and the imported keys was a mess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "December 20, 2023, 11:12:33 AM",
      "body": "Did you try to sweep your Bitcoin Core private key to Electrum wallet?Sweeping your private keys into ElectrumTransferring coins from Bitcoin-Qt to ElectrumWhen you have your coins in Electrum, you will have to open your Lightning Network channel.Electrum Lightning Network walkthroughMore topics on Lightning Network[Table] All Lightning Network Threads In One Place",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 20, 2023, 11:40:41 AM",
      "body": "I just found out that OP also posted this in Electrum's GitHub repo as a new issue which is closed without getting any sufficient answer.Link: https://github.com/spesmilo/electrum/issues/8751Quote from: Geremia on December 16, 2023, 06:35:20 PMWhen I create a new Electrum wallet with the private keys, why is Lightning disabled for that wallet?I'm uncertain on this answer so I only answered one question in my previous reply (CMIIAW):Electrum's lightning wallet requires a master private key where the private keys to be used in your lightning transactions' HTLC (Hashed Timelock Contract).It can't rely on imported keys since it'll eventually run out of available unused keys after few transactions and reusing those isn't an option because it's unsafe to reuse used keys in old HTLC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}