{
  "id": "topic_5454294",
  "title": "mindrust",
  "author": "mindrust",
  "created_time": "May 28, 2023, 02:16:10 PM",
  "content": "Yazar: CyrusOrjinal konu: [Bitcointalk Party - Discord sv] Bitcoin Pizza bake-off contest! Enter by June 1Yılın o vakti yine geldi! Sizlere bu yılın Bitcoin Pizza yarışmasını takdim ediyorum! Yarışma şimdi başladı ve 1 Haziran'da oylama başladığında sona erecek. Oylama için son gün ise 10 Haziran. 11:59GMT tüm tarihlerdeKuralları görebilmek ve yarışmaya katılabilmek için lütfen #pizza-day-event-2023 kanalına katılın. ( kanala davet linkini orjinal konuda bulabilirsiniz)Yarışmanın yapısı önceki yarışmalarla aynı olup, ilgili bilgileri #pizza-day-event-2022, #pizza-day-event-2021 and #pizza-day-event-2020  kanallarında ayrı ayrı görebilirsiniz.Bu senenin ödülleri içinde:Bitcoin Pizza Bitcointalk 1yr rozeti (kısa süreliğine birkaç rozet fazladan gönderebiliriz)Betnomi Custom Ledger Nano X7 12mBTCBTC ödül havuzu büyüdüğü için; birincilik, ikincilik ve yarışmanın gidişatına göre belki de bazı ekstra ödüller olacak. Ödül havuzuna ekleme yapmak istiyorsanız benimle irtibata geçin.Kim @fillippone'nun pizza rozetini çalmaya cüret edecek? Acaba @fillippone ünvanını koruyabilecek mi? Buna karar verecek olan sizlersiniz!Bu etkinliği 5mBTC ile destekleyen theymos'a, yarışmaya fiziksel ödül sağlayan Betnomi'ye ve herşeyden önce pizza iştahımızı tatmin ettiği için Laszlo 'ya teşekkürler!Sizi bilmiyorum ama benim canım birden pizza çekti.Bu çeviri AOBT'nin çabaları sayesinde hayata geçirilmiştir.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454294",
  "comments": [
    {
      "author": "flyingcarpet",
      "created_time": "May 29, 2023, 09:10:38 AM",
      "body": "Katılmayı isterdim ama hiç anlamıyorum mutfak işlerinden. Bitcoin’in meşhur pizza olayını daha bitcoin’le ilgili hiç işlem yapmamışken bile biliyordum. Burada böyle bir etkinliğin olması ve sürdürülmesi güzel bir olaymış. Bu sene takip edicem etkinliği, böyle bir etkinliğin gerçekleştiği yerde olmak ve izlemek eğlenceli olabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "May 29, 2023, 09:13:22 PM",
      "body": "Seçimden 1 gün önce açıklasalar ve görsem kesin katılırdım ama alet edevatımın olmadığı bir durumda sadece uzaktan uzaktan izlicem anlaşılan   Önceki yarışmalarda da hep böyle oldu bir türlü şeytanın bacağını kıramadım değilse aklımda efsane fikirler var",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}