{
  "id": "topic_5407382",
  "title": "execijutiere",
  "author": "execijutiere",
  "created_time": "July 23, 2022, 05:26:12 PM",
  "content": "Hayrettin, bence youtube aleminin en iyi komedi/troll videolarını yayınlayan kişidir.Kendisini önceden de izler severim. Bu aralar benekli ayhan ve zabaa kadar ahmet ile tayland da maceralara atıldı. Biraz trollük de olsa bence efsane bir seri olma yolunda ilerliyor.İzleyecek bir şey bulamayanlara vakit geçirmek adına önerebilirim https://youtube.com/playlist?list=PLxRJHNASUK2YO7H85KEFwxwkjNh9Qq8YF",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407382",
  "comments": [
    {
      "author": "Red Pie",
      "created_time": "July 23, 2022, 08:04:40 PM",
      "body": "Bir ara survivora da katılmıştı benim favorim oydu onun kazanmasını isterdim. bana da komik gelen hareketleri var en azından beni güldürmeyi başarıyor. survivor hayatı o kadar başarılı olamadı yine de youtube üzerinden yeni ve kaliteli içerikleri sunmayı başarıyor. kendine göre komik videoları var hala ve ara sıra bende açar izlerim. bir ara kurgu bir video vardı ama o unutulabilir",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "July 23, 2022, 08:20:35 PM",
      "body": "Videolarının yarısı kurgu, diğer yarısı da boş muhabbet. Denk geldiğinde eskiden izlerdim ama şu an çok komik gelmiyor. Bir ara çok popülerdi ama yavaş yavaş söndü, yaşının ilerlemesi ile birlikte yeni nesli yakalamak için fazla çabalamaya başladığını düşünüyorum.Trolllük konusunda gerçekten iyi ve yüz güldürebiliyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pulsar77",
      "created_time": "July 23, 2022, 09:10:25 PM",
      "body": "Hayrettin'i baya eski yıllardan beri iyi bilirim. Bazı içerikleri bana itici gelse de çok komik içeriklerine de fazlasıyla rastladım. Survivor'a katılması da şaşırtmadı çünkü bence gidebilme ihtimali olan kişilerden birisiydi bence. Metrobüs videosu vardı o hala aklımda çok iyiydi.    Rahmetli Vatan Şaşmaz'ın metrobüs reklamına parodi olarak çekmişti baya sevilmişti. Şu anki videolarını pek takip edemiyorum. Çizgisini kaybetmeye başladıysa zaten daha da etmem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "July 24, 2022, 04:31:25 AM",
      "body": "Kurgularda başrol kendinin olan elemandır hayrettin. Fazla izlemedim bana hitap etmiyor. Bir keresinde gelecekten bir gün diye bir filmine bakmıştım fena değildi. Yine de bu kadar popüler olmasını sadece trollüklerinin insanlarda uyandırdığı merak sonucunda ulaştığı başarı olarak gözüme çarpıyor diyebilirim. Hayrettin sen nasıl trollükler ettin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "July 24, 2022, 01:22:39 PM",
      "body": "Şimdi bu son içeriklerini izlemedim desem yalan olur, bir iki videosunu seyrettim denk geldi diye kurgu vs ama adam bir şekilde izlettiriyor ürettiği videoları üzerine de çok uğraştığını düşünmüyorum. Bulmuş iki tane dallamayı onlarında belli bir kitlesi var sürekli trollüyorlar onları ve eğleniyorlar öyle arada sırada güldürüyorlar. Tayland maceralarından sonraki maceraları ne olacak, Hayrettin bu ikiliden kopacak gibi durmuyor şimdilik",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "July 27, 2022, 07:28:19 AM",
      "body": "Benekli Ayhan net şekilde her ortamda mutlaka bulunması gereken tıp, bakmayın agzi bozuk olduğu için disaridan çok yadirgayan olduğuna, zabaaaaaa kadar burdayik abi de ayrı bir renk ve Hayrettin bu mozaiği güzel akıl etmis",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "July 27, 2022, 04:07:02 PM",
      "body": "Quote from: totti67 on July 27, 2022, 07:28:19 AMBenekli Ayhan net şekilde her ortamda mutlaka bulunması gereken tıp, bakmayın agzi bozuk olduğu için disaridan çok yadirgayan olduğuna, zabaaaaaa kadar burdayik abi de ayrı bir renk ve Hayrettin bu mozaiği güzel akıl etmisHayrettin akıllı adam YouTuber için en büyük sorun içerik üretmek bu üçlü her türlü içeriği izletecek adamlar o yüzden hayrettinin zeki olduğunu biliyordum kendini bu açıdan da ispatlamış oldu kendi ekmeğini de izlenme oranları ile fazlasıyla almıştır",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "July 30, 2022, 06:34:50 PM",
      "body": "Quote from: Pulsar77 on July 23, 2022, 09:10:25 PMHayrettin'i baya eski yıllardan beri iyi bilirim. Bazı içerikleri bana itici gelse de çok komik içeriklerine de fazlasıyla rastladım. Survivor'a katılması da şaşırtmadı çünkü bence gidebilme ihtimali olan kişilerden birisiydi bence. Metrobüs videosu vardı o hala aklımda çok iyiydi.    Rahmetli Vatan Şaşmaz'ın metrobüs reklamına parodi olarak çekmişti baya sevilmişti. Şu anki videolarını pek takip edemiyorum. Çizgisini kaybetmeye başladıysa zaten daha da etmem.Vay be metrobüs videosu 10 sene önceymiş 2012'de. Zaman su gibi akıp gidiyor. O sene tam Beylikdüzü'ne taşınmıştım. Çok sık Zincirlikuyu - Beylikdüzü arasında metrobüse biniyordum. Vatan Şaşmaz'ın oynadığı saçma reklamı görünce aklım çıkmıştı. Hayrettin'in cevabı ise onun en iyi işi olabilir. Şimdi tekrar izledim ve güldüm. Ama bu işinden sonra Hayrettin'in hiçbir şeyini görmemiştim, Survivor'a bile katılmış. Bi de merak ettim Hayrettin nası ünlü olmuştu diye, googleladım. Issız Adam filminin parodisi Kıssız Adam diye bir olayı vardı. Hayal meyal hatırlıyorum. Ama o zamanlar arkadaşlarla bile muhabbetini yaptığımızı hatırlar gibiyim. Ta 2009'dan beri hayatını böyle sürdürebiliyorsa, geçinebiliyorsa çok iyi. 84 doğumluymuş, baya genç hala.Metrobüs reklamını merak eden olursa iki versiyonu da burada var: https://www.youtube.com/watch?v=nqYQ1eW7XPw",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "August 01, 2022, 07:57:39 AM",
      "body": "Açıkcası beni eğlendiren bir seri oldu. Üç ayrı kafanın birleşimi sonucu böyle saçma ama güzel video serisi çıkmayalı uzun zaman olmuştu. Tayland gibi bir yerde bu serinin çekilmesi de ayrı bir olay ya",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "August 01, 2022, 03:10:05 PM",
      "body": "Güzel bir seri yapmış Hayrettin her zamanki gibi. İki tane popüler isimi yanına alarak Tayland'ı fet etmeye çıkmışlar ama yanındaki ikili gerçekten yorucu tipler Hayrettin iyi sabır ediyordur. Serinin 10. bölümüde yayınlanmış bugün herhalde baya uzun bir seri çekmeyi planlıyorlar belki de daha sonra farklı ülkelerde farklı isimlerle bu tarz seri çekebilir diye bekliyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "August 03, 2022, 10:51:39 AM",
      "body": "Bu dünyayı yaşıyor Hayrettin. Kafa dağıtmalık izliyordum bazen yayınlarını. Kaliteli içerik üreten yayıncı kalmadı pek Youtube'da. Prodüksiyonları zayıf genelinin. Prodüksiyon, kurgu zayıf olunca izlemelik işler çıkmıyor ortaya. Hayrettin oyunculuk geçmişine sahip olduğundan kaliteli oluyor yayınları. İzlettiriyor kendini kurgusu zayıf olsa da. Prodüksiyon zaten Hayrettin'in kanalında birinci sınıf. Profesyonel ekiple çalışıyor sanırım bu konuda. Ben seviyorum Hayrettin'i. Hatırlattığın iyi oldu execijutiere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}