{
  "id": "topic_5467201",
  "title": "Odohu",
  "author": "Odohu",
  "created_time": "September 18, 2023, 12:11:08 PM",
  "content": "I was going through coinmarketcap today to see some of the cryptocurrencies I was involved in when I started, I was so surprised to see that a lot of them have even been delisted. I was heartbroken seeing that some tokens who raised millions of dollars, had huge community and were trending even in various platforms just died. I wanted to not mention any particular token but I have to mention PumaPay that raised about $8 million yet could not deliver anything and got investors holding a bag of shit. If one can turn back the hand of time, and assuming I joined this forum early when I started my crypto journey, maybe the concept of shitcoins would have dawn on me and that would have made me convert those worthless bags to Bitcoin when I could. I know there are other who would have similar experience too and there are still others caught up in the euphoria of getting rich through one token or the other. Well, if it is not Bitcoin, it is not worth holding.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467201",
  "comments": [
    {
      "author": "Marvelman",
      "created_time": "September 18, 2023, 12:24:26 PM",
      "body": "Quote from: Odohu on September 18, 2023, 12:11:08 PMIf one can turn back the hand of time, and assuming I joined this forum early when I started my crypto journey, maybe the concept of shitcoins would have dawn on me and that would have made me convert those worthless bags to Bitcoin when I could. No, you cannot turn back time, but you can learn from your past mistakes and not repeat the same mistakes today or in the future. Bitcoin is the king for a reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "September 18, 2023, 12:26:10 PM",
      "body": "Since you brought this up, I could name multiple tokens, but allow me to share my personal experience.I bought ETH in 2018 and kept it until 2020 when I switched to Bitcoin ONLY.I made some money with ETH (not a lot). But thinking about it now, I would never do this again. With Bitcoin I have learnt to appreciate valuable assets in life. All those trendy, heavily marketed scams must be avoided.It is pathetic and devastating how many people lost fortunes riding on basically air-money.Remember LUNA? I 've seen people claiming they lost their entire savings... It's so sad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 18, 2023, 12:29:09 PM",
      "body": "Quote from: Odohu on September 18, 2023, 12:11:08 PMI know there are other who would have similar experience too and there are still others caught up in the euphoria of getting rich through one token or the other. Well, if it is not Bitcoin, it is not worth holding. If you buy altcoins and there is bear market, you will see your money dropping in price far more and it might be painful. If you see some altcoins all-time-high and there price now, they have dropped more than 15 times or more. That is altcons. Know that altcons are gambling because they may remain to be shit coins, they can become a dead coin, they may remain a failed project and they may likely  disappoint someone. I invested over $1000 on an altcoins when bitcoin was at $23000 this year before it increased to $30000, the coin dropped and my money was $500 when I sold the coin. I recently look at the coin on Coingecko recently, it has droped 1.3x more again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "September 18, 2023, 12:44:00 PM",
      "body": "The problem is you must not hold your shitcoins because it's only good if you're want to gamble by sell your shitcoins after few minutes or day(s).Even the shitcoin was raised to $8 Millions, there's a chance if the creator was spend most of his money in order to convince people to invest.Wealth is created by hard work and consistency, not lottery or gambling. I think even someone ever win huge amount of money through lottery or gambling, they will not able to manage the money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "September 18, 2023, 12:46:40 PM",
      "body": "Ah I have been there too, got involved with them thinking they were going to become big,I checked them a few months ago and they are gone outside the top 100 on coinmarketcap.I count myself fortunate to have been able to get some of my Bitcoin back by trading thembefore they went to absolute zero.It amazes me that so many people still think $hitcoins are an actual viable option.I am 100% Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 18, 2023, 01:41:02 PM",
      "body": "Quote from: aoluain on September 18, 2023, 12:46:40 PM~snip~It amazes me that so many people still think $hitcoins are an actual viable option.I'm not surprised at all, people are greedy or desperate and you can sell them whatever you want, and what's even better for all those scammers is that people are not only naive, but you can take advantage of them several times until they finally realize that they've been scammed. Bitcoin is of course something much different, but I still cannot be indifferent when I see that people are absolutely convinced that only by investing in Bitcoin they can count on a better future. I already recently wrote in another topic that there are various risks that should be taken into account. Here we can always refer to the old advice that says \"don't invest more than you are prepared to lose\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "September 18, 2023, 01:56:17 PM",
      "body": "It is very important to know the difference between Bitcoin and ALL other \"cryptos\".When you say \"crypto\", it means shit, shitcoin, lies, deception, fraud.When you say Bitcoin, it means FREEDOM, the ultimate financial power for the sovereign individual.What is shitcoin?Some definitions I found online:A currency that has a small group of people in charge of consensus and can change it at will like a board of directors of a central bank.A few more resources to read and learn why ONLY Bitcoin:Don't Play Shitcoin Gambling Gameshttps://www.citadel21.com/dont-play-...gambling-gamesMastering Shitcoins: The Poor Man's Guide to Getting Crypto Richhttps://www.citadel21.com/dont-play-...gambling-games ://hackernoon.com/mastering-shi...h-2e469b762ba9And watch this very good animated video: “Why Everything Not Bitcoin Will Fail”.https://www.youtube.com/watch?v=TIkqBZnrKJM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "September 18, 2023, 01:58:54 PM",
      "body": "It seems like what the OP feels, maybe there are many here who feel the same way. However, this is an old story or a story that will not be repeated and will be a very valuable experience that will be felt after the story happens and you will not repeat it again.Bitcoin is indeed the best choice among other coins or all Altcoins and not for shitcoins, so doing very detailed research is a must to investigate any new coin or token. And I personally am not at all interested in new coins or tokens, and I am only interested in Bitcoin and some of the top and oldest Altcoins, and Bitcoin remains the priority.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 18, 2023, 02:09:28 PM",
      "body": "The problem with that is that there are so many shitcoins and more are coming out all the time. The last time I looked at CMC I think there were 28K, but now they have changed the way they indicate it and I see that it says QuoteCryptos: 1.8M+, me not really knowing what this refers to. It seems clear to me that pump and dump shitcoins are still in the growth phase, and we are not even in the bull market. During the next one it seems to me that the shitcoins market explosion will be brutal and will evaporate the money of the unwary who invest in them. Some retail investors will make money with them, of course, but like a lottery winner, although those who will make money for sure will be the ones behind the projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BALIK",
      "created_time": "September 18, 2023, 02:12:09 PM",
      "body": "The cryptocurrency market has been around for over 14 years and shitcoins dying or being replaced is nothing new, why are you so surprised? Even a project like Luna with a capitalization of hundreds of billions of dollars can collapse and disappear in just a few days, so you shouldn't be surprised by projects that only mobilize a few tens of millions of dollars. Bitcoin is unique, simply because it was created as a currency and not as an investment. But we have turned it into an investment, but even if it is no longer used as an investment, it will still be a currency, a means of payment. So it's completely different from the projects out there that are created to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "September 18, 2023, 02:19:09 PM",
      "body": "Not all Altcoins are automatically shitcoins. Shitcoins are the ones created for the single purpose like \"getting rich quick\". Some alts have better properties than Bitcoin, they lack value though. What becomes christal clear is that most crypto enthusiasts are in for FIAT, and not for crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "September 18, 2023, 02:35:51 PM",
      "body": "Quote from: Odohu on September 18, 2023, 12:11:08 PMI was going through coinmarketcap today to see some of the cryptocurrencies I was involved in when I started, I was so surprised to see that a lot of them have even been delisted. I was heartbroken seeing that some tokens who raised millions of dollars, had huge community and were trending even in various platforms just died. I wanted to not mention any particular token but I have to mention PumaPay that raised about $8 million yet could not deliver anything and got investors holding a bag of shit. If one can turn back the hand of time, and assuming I joined this forum early when I started my crypto journey, maybe the concept of shitcoins would have dawn on me and that would have made me convert those worthless bags to Bitcoin when I could. I know there are other who would have similar experience too and there are still others caught up in the euphoria of getting rich through one token or the other. Well, if it is not Bitcoin, it is not worth holding. Bravo, you have finally had an insight!It is impossible to turn back time, but now you have invaluable experience and now you have realized the true value of bitcoin and how unique it is. Don't waste your chance again.Is it really true that in order to come to the realization of this, it is necessary to personally go through a useless investment in shitcoins, losing your money, and only then make sure that you should not play for a long time with shitcoins, because this is fraught with losses.Do you, reading this post, want to get rich with shitcoins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "September 18, 2023, 02:38:03 PM",
      "body": "Quote from: WillyAp on September 18, 2023, 02:19:09 PMNot all Altcoins are automatically shitcoins. Shitcoins are the ones created for the single purpose like \"getting rich quick\". Some alts have better properties than Bitcoin, they lack value though. What becomes christal clear is that most crypto enthusiasts are in for FIAT, and not for crypto. Maybe you should have at least given us an example of one altcoin that is better than Bitcoin. As far as I'm concerned, there are lots of altcoins or rather shitcoins out there that claims to provide same features with Bitcoin but they can never be Bitcoin. Altcoins, creators uses this pump and dump schemes solely to attract investors and make quick profits for them selfs. Bitcoin, being the best and most established cryptocurrency, is in a league of its own with a solid track record and a unique value proposition as digital gold.there's no coin like Bitcoin mate, you should have that in your mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "September 18, 2023, 03:00:28 PM",
      "body": "Quote from: Odohu on September 18, 2023, 12:11:08 PMIf one can turn back the hand of time, and assuming I joined this forum early when I started my crypto journey, maybe the concept of shitcoins would have dawn on me and that would have made me convert those worthless bags to Bitcoin when I could. Altcoins are shitcoins and they are very risky for investors. Buying top altcoins does not help to reduce risk too much if altcoin investors want to hold those shitcoins for long time like Bitcoin. If they believe those top altcoins can help them rich, they are wrong and are going to make a terrible investment mistake.Don't buy altcoins because they are top altcoins is my topic to warn cryptocurrency newbie investors about it.Visit Coinmarketcap and check its Cryptocurrency Historical Data Snapshot to see how top altcoins can die with time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 18, 2023, 03:29:22 PM",
      "body": "Quote from: WillyAp on September 18, 2023, 02:19:09 PMSome alts have better properties than Bitcoin, they lack value though. Demand follows value and that reflects on the price. Any coin with value will be noticed, if it last for several years the demand for it will rise and so will the market price.There is currently no altcoin which had the properties of decentralization and security like Bitcoin, and these are the key properties that investors are looking for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "September 18, 2023, 03:31:43 PM",
      "body": "Quote from: Odohu on September 18, 2023, 12:11:08 PMI was going through coinmarketcap today to see some of the cryptocurrencies I was involved in when I started, I was so surprised to see that a lot of them have even been delisted. I was heartbroken seeing that some tokens who raised millions of dollars, had huge community and were trending even in various platforms just died. I wanted to not mention any particular token but I have to mention PumaPay that raised about $8 million yet could not deliver anything and got investors holding a bag of shit. If one can turn back the hand of time, and assuming I joined this forum early when I started my crypto journey, maybe the concept of shitcoins would have dawn on me and that would have made me convert those worthless bags to Bitcoin when I could. I know there are other who would have similar experience too and there are still others caught up in the euphoria of getting rich through one token or the other. Well, if it is not Bitcoin, it is not worth holding. For sure this kind of shitcoins or alternative token wasn't really worth it as an investment, especially for long-term investment people this token doesnt really have use, or the project is probably just made to fail so that the developers are just gonna end up scamming the investor's money, it was really a pretty common thing in altcoins back in the day since there was a lot of ICO project back in the day and most of them are also scams, early investors might get lucky if the token will get listed at some point on exchanges.I mean when it comes to profit you could also rely on some blue chip tokens in the market since they will probably skyrocket as well when Bitcoin starts to gain momentum and increase its market price to the moon. But there is no doubt that Bitcoin is the king when it comes to investment because it is just the nature of Bitcoin will only a 21 million supply we surely it is going to increase its market price in the future if Bitcoin still exists in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "September 18, 2023, 04:06:10 PM",
      "body": "Quote from: Odohu on September 18, 2023, 12:11:08 PMI was going through coinmarketcap today to see some of the cryptocurrencies I was involved in when I started, I was so surprised to see that a lot of them have even been delisted. I was heartbroken seeing that some tokens who raised millions of dollars, had huge community and were trending even in various platforms just died. I wanted to not mention any particular token but I have to mention PumaPay that raised about $8 million yet could not deliver anything and got investors holding a bag of shit. If one can turn back the hand of time, and assuming I joined this forum early when I started my crypto journey, maybe the concept of shitcoins would have dawn on me and that would have made me convert those worthless bags to Bitcoin when I could. I know there are other who would have similar experience too and there are still others caught up in the euphoria of getting rich through one token or the other. Well, if it is not Bitcoin, it is not worth holding.  I can imagine how you are feeling especially as you must have done the math on how much Bitcoin you would have held had you invested and even if you had decided to DCA, you would have made much gain but the thing's that there's no need crying over spilled milk. Yeah, you made a mistake and let your emotions and your desire to get rich quick lead you to make unwise investment, but it's not too late to join the Bitcoin train. So far, Bitcoin has survived a lot of backlash and false predictions on when it will crash since it's inception in 2008 so that alone should give one enough confidence to invest in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "September 18, 2023, 04:11:57 PM",
      "body": "Quote from: Odohu on September 18, 2023, 12:11:08 PMIf one can turn back the hand of time, and assuming I joined this forum early when I started my crypto journey, maybe the concept of shitcoins would have dawn on me and that would have made me convert those worthless bags to Bitcoin when I could. I know there are other who would have similar experience too and there are still others caught up in the euphoria of getting rich through one token or the other. Well, if it is not Bitcoin, it is not worth holding. They say, not only can holding bitcoin get big profits, holding altcoins can also give big returns when a bull market occurs.I explored this world in 2021, unfortunately I couldn't turn back to 2018 where in 2018 I had started hearing about bitcoin from one of the people who was part of the crypto community. I don't want to and don't like to speculate. I don't regret the time that has passed because what I think about is the time in the future by preparing everything carefully. I don't have any assets in my wallet at the moment, I consider that to be the past and now I am saving for the future by choosing coins that are long lasting in terms of value.From the history and experience of the people I have met, there is no reason why people should not be interested in owning bitcoin and holding it for a certain period of time. I found various incidents where very popular coins and tokens suddenly fell and could not rise again. I don't want to mention the names of these coins and tokens. The future I am preparing for does not want to experience the choices I choose. That's what I mean that I'm preparing it together with bitcoin.People say there are many ways to get it. I believe what they say.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "September 18, 2023, 04:38:22 PM",
      "body": "Quote from: Hatchy on September 18, 2023, 02:38:03 PMMaybe you should have at least given us an example of one altcoin that is better than Bitcoin. As far as I'm concerned, there are lots of altcoins or rather shitcoins out there that claims to provide same features with Bitcoin but they can never be Bitcoin.For me its Litecoin. Only thing missing is the value storage. Higher transfer speed, lower fees. Optional security. There are other decentralized coins most have a CEO. which does not go well (with me)  I take LTC as Payment, I can pay with LTC, not too many business though know it. We shouldn't generalize and throw alle Altcoins in one bucket. Quote from: Hatchy on September 18, 2023, 02:38:03 PM Altcoins, creators uses this pump and dump schemes solely to attract investors and make quick profits for them selfs. Bitcoin, being the best and most established cryptocurrency, is in a league of its own with a solid track record and a unique value proposition as digital gold.there's no coin like Bitcoin mate, you should have that in your mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}