{
  "id": "topic_5458392",
  "title": "satscraper",
  "author": "satscraper",
  "created_time": "July 03, 2023, 05:33:54 AMLast edit: December 02, 2023, 04:07:05 AM by satscraper",
  "content": "::::::::::::::::::::::: ::::::::::::::::::::::: ::::::::::::::::::::::: :::::::::::::::::::::::[1]. Understanding Bitcoin Privacy with OXT — Part 1/4 [2].  Understanding Bitcoin Privacy with OXT — Part 2/4 [3].  Understanding Bitcoin Privacy with OXT — Part 3/4 [4].  Understanding Bitcoin Privacy with OXT — Part 4/4",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458392",
  "comments": [
    {
      "author": "bakasabo",
      "created_time": "July 03, 2023, 07:45:23 AM",
      "body": "Не имею опыта пользования миксерами, поэтому раз появлению данного топика. У меня возник вопрос - сервис обещает \"3-6 часов время отчистки\", Вам суммы вернулись в течении \"25мин-2часов\", а есть ли какой-то стандарт или какой-то минимальное время для возврата чистой криптовалюты? Где этот момент Х, когда приходит понимание что что-то идет не так с миксером или отправкой и условное \"еще надо подождать\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "July 03, 2023, 07:56:03 AM",
      "body": "Quote from: bakasabo on July 03, 2023, 07:45:23 AMНе имею опыта пользования миксерами, поэтому раз появлению данного топика. У меня возник вопрос - сервис обещает \"3-6 часов время отчистки\", Вам суммы вернулись в течении \"25мин-2часов\", а есть ли какой-то стандарт или какой-то минимальное время для возврата чистой криптовалюты? Где этот момент Х, когда приходит понимание что что-то идет не так с миксером или отправкой и условное \"еще надо подождать\"? Думаю тут всё зависит от толщины нервов пользователя сервисом.Раз они говорят о 6 часах выдержки, то несомненно в течении этого времени можно оставаться спокойным. Я бы не трепал себе нервы и до 24 часов, так как с техникой всё может быть и, кроме того, транзакция, которой возвращаются средства, мультиподписная,  что может внести дополнительные задержки с появлением проблем хотя бы с одной подписью.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "July 04, 2023, 09:01:28 AM",
      "body": "Честно говоря, не понимаю как именно работает процесс смешивания, потому что простая отправка на разные адреса и увеличение количества хопов спасают только от блокировки на бирже, но не спасают от спонсированного анализа блокчейна, когда цель стоит выяснить источник средств и поймать преступника. Во всяком случае, они не должны пересылать средства, хоть как-то связанные с адресами депозита, потому что это довольно просто отследить. Вопрос логирования тоже очень сложный, потому что это можно проверить только пост-фактум, когда уже поздно что-то микшировать. Даже саиые известные и крупные сервисы типа Chipmixer погорели на этом, хотя они существовали долго и имели хорошую репутацию среди комьюнити. Я сам по себе знаю, что запустить и держать сервис совершенно прозрачно невозможно, всегда есть место для сомнения. Будем наблюдать, рост числа сервисов показывает заинтересованность пользователей в обеспечении приватности, так что любой подобный бизнес нужно приветствовать.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "July 04, 2023, 11:46:31 AMLast edit: December 02, 2023, 04:37:50 AM by satscraper",
      "body": "Quote from: witcher_sense on July 04, 2023, 09:01:28 AMЧестно говоря, не понимаю как именно работает процесс смешивания, потому что простая отправка на разные адреса и увеличение количества хопов спасают только от блокировки на бирже, но не спасают от спонсированного анализа блокчейна, когда цель стоит выяснить источник средств и поймать преступника. Во всяком случае, они не должны пересылать средства, хоть как-то связанные с адресами депозита, потому что это довольно просто отследить. Вопрос логирования тоже очень сложный, потому что это можно проверить только пост-фактум, когда уже поздно что-то микшировать. Даже саиые известные и крупные сервисы типа Chipmixer погорели на этом, хотя они существовали долго и имели хорошую репутацию среди комьюнити. Я сам по себе знаю, что запустить и держать сервис совершенно прозрачно невозможно, всегда есть место для сомнения. Будем наблюдать, рост числа сервисов показывает заинтересованность пользователей в обеспечении приватности, так что любой подобный бизнес нужно приветствовать.Как бы это вам объяснить попроще.Представьте что у Васи есть сто рублёвая бумажка, на которой он по неопытности крупными буквами написал  слово ВАСЯ и свой адрес . Если эта бумажка попадёт в оборот, то тот, кто будет держать её в руках узнает, что она принадлежала Васе, проживающему по такому-то адресу.Теперь представьте, что вместо того, чтобы расплатиться этой бумажкой на базаре, Вася положил свою бумажку в банк на депозит и после истечения срока депозита получил обратно бумажку в 100 рублей но уже без всяких надписей.   Если эта его новая бумажка попадёт в оборот, то тот, кто будет держать её в руках уже не узнает, что она принадлежала Васе. Связь между его старой и новой бумажкой полностью разорвана.Так и в случае монет, поступающих с бирж, ну почти так.  А вообще, советую ознакомиться с  эвристикой[1], [2], [3] и [4], которая используется для отслеживания транзакций. [1]. Understanding Bitcoin Privacy with OXT — Part 1/4 [2].  Understanding Bitcoin Privacy with OXT — Part 2/4 [3].  Understanding Bitcoin Privacy with OXT — Part 3/4 [4].  Understanding Bitcoin Privacy with OXT — Part 4/4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "July 04, 2023, 05:53:07 PMLast edit: December 02, 2023, 04:24:48 AM by satscraper",
      "body": "Quote from: safar1980 on July 04, 2023, 05:04:01 PMМожно ли отследить алгоритм миксера если сделать допустим 10-20 операций для того чтобы проследить путь монет после?Я не думаю, что у них такой упрощенный алгоритм, чтобы его раскрыть то, что вы предлагаете после 10 20 и даже сотни операцийQuote from: safar1980 on July 04, 2023, 05:04:01 PMЕсли использовать ваш пример, то возможно новые 100 рублей Васи не найти, но можно узнать что Вася пользуется миксером. Если Вася воспользуется старым адресом позже, то за ним будут наблюдать.Если монеты миксированы по технологии coinjoin, то \"узнать что Вася пользуется миксером\" не состаляет никакого труда, Quote from: safar1980 on July 04, 2023, 05:04:01 PMЕсли Вася воспользуется старым адресом позже, то за ним будут наблюдать.Ну тогда он настоящий \"Вася\", который не знает, что использование  старых адресов чревато  плохими последствиями для его конфиденциальности.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "July 05, 2023, 09:03:39 AM",
      "body": "Quote from: witcher_sense on July 05, 2023, 05:52:51 AMНо мне все-таки непонятен один момент: для чего здесь нужно ожидание? У миксера есть пул с анонимными монетами и они сразу готовы быть отправлены обратно к пользователю, по сути обмен может быть мгновенным в теории. Единственное объяснение которое приходит в голову: при огромном спросе такой пул быстро опустеет, точнее превратится в неанонимный. Каждый пользователь немного \"портит\" пул своей KYC-транзакцией и вынужден ждать пока его транзакция замикшируется и пул не очистится от грязи. Нет,  объяснение которое приходит в вашу голову неверное. Анализаторы настроены на поиск (и последующую группировку) транзакций, кореллирующих по многим параметрам, в том чмсле и времени отправки. Этих параметров действительно много: преимущественный день недели, преимущественная комиссия, порядок следования адреса сдачи, размер транзакции и так далее. Поэтому хорошие миксеры отправляют не одну , а несколько обратных транзакций  и обязательно с  разрывом их по времени. Одну приходящую пользователю  транзакцию легче проанализировать, чем две, три. четыре и т.д  поступающих ему некореллирующих  транзакций.  Если хорошо владеть эвристикой анализаторов, то в принципе можно самому настраивать  свои транзакции таким образом, чтобы затруднить их последущий анализ на предмет корреляции.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "July 06, 2023, 03:48:13 AM",
      "body": "Quote from: satscraper on July 05, 2023, 09:03:39 AMНет,  объяснение которое приходит в вашу голову неверное. Анализаторы настроены на поиск (и последующую группировку) транзакций, кореллирующих по многим параметрам, в том чмсле и времени отправки. Этих параметров действительно много: преимущественный день недели, преимущественная комиссия, порядок следования адреса сдачи, размер транзакции и так далее. Поэтому хорошие миксеры отправляют не одну , а несколько обратных транзакций  и обязательно с  разрывом их по времени. Одну приходящую пользователю  транзакцию легче проанализировать, чем две, три. четыре и т.д  поступающих ему некореллирующих  транзакций.  Если хорошо владеть эвристикой анализаторов, то в принципе можно самому настраивать  свои транзакции таким образом, чтобы затруднить их последущий анализ на предмет корреляции.Так почему в пуле не может быть нескольких некореллирующих транзакций, готовых для моментальной отправки обратно пользователю? Это может объяснить зачем сам миксер тратит время на запутывание истории транзакций и ломание распространенных эвристик, но не объясняет зачем это делать клиентам миксера. Вообще тут ситуация интересная: миксеру нужно иметь хорошую стратегию для эффективного микширования, но раскрывать подробности этой стратегии он не может из-за того, что это может помочь анализаторам отследить отжельные транзакции. Но как тогда убедить пользователей, что миксер действительно работает эффективно и вообще заслуживает получение комиссий? Вот взять например эту тему: Breaking Mixing Services, пользователь провел исследование и пришел к выводу, что почти все миксеры не настолько хорошо обеспечивают анонимность как хотелось бы. Это не просто голословные заявления, потому что приложена настоящая исследовательская работа и тема получила много меритов. Как же убедить пользователя, что именно твой миксер самый лучший на рынке?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "July 06, 2023, 07:38:17 AMLast edit: December 02, 2023, 04:26:19 AM by satscraper",
      "body": "Quote from: witcher_sense on July 06, 2023, 03:48:13 AMТак почему в пуле не может быть нескольких некореллирующих транзакций, готовых для моментальной отправки обратно пользователю? Это может объяснить зачем сам миксер тратит время на запутывание истории транзакций и ломание распространенных эвристик, но не объясняет зачем это делать клиентам миксера. Транзакции отправляются с разных адресов. заинтересован в том, чтобы нарушить их корреляцию и не быть связанным с этими транзакциями, я понимаю это так.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "July 12, 2023, 11:30:05 AMLast edit: July 12, 2023, 11:49:10 AM by satscraper",
      "body": "Quote from: Ratimov on July 12, 2023, 10:01:02 AMДля любителей использовать обменники, исходя из своего опыта, скажу, что после того, как  ваш адрес по взаимодействует с этим миксером, в половине обменников (с хорошими курсами) из бестченджа  этот адрес не пройдет AML-проверку, так что будьте осторожны, некоторые обменники оповещают об этом сразу, а некоторые скажут вам об этом после того, как вы им пришлёте свои битки, и заставят проходить KYC. Я воевал с одним обменником за 0.05 BTC целых 3 дня, он меня заставлял проходить полный KYC, но потом пошел на уступки и просто вернул мне мои битки обратно, за вычетом 3%.А если сделать с этого адреса предварительно пару  промежуточных транзакций на новые адреса  и отправлять уже с нового адреса, или включить в транзакцию вместе с полученным от миксера UTXO и другое UTXO c нецелым числом сатошей, так не пробовали? Вообще этот момент для меня несколько странный. У меня создалось впечатление,  что этот миксер не использует технологию  coinjoin , обычно легко идентифицируемую и служащую маркером смешивания.Возможно те обменки используют эвристику целочисленного значения и перестраховываются.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "July 12, 2023, 11:48:47 AMLast edit: December 02, 2023, 04:39:57 AM by satscraper",
      "body": "Quote from: Ratimov on July 12, 2023, 11:35:23 AMQuote from: satscraper on July 12, 2023, 11:30:05 AMА если сделать с этого адреса предварительно пару  промежуточных транзакций на новые адреса  и отправлять уже с нового адреса, или включить в транзакцию вместе с полученным от миксера UTXO и другое UTXO c нецелым числом сатошей, так не пробовали?Я почистил эти битки с помощью биржи, это стоило мне 0.0002 BTC, отправил битки на биржу с адреса на которой мне миксер прислал битки. После этого  уже никаких проблем не было, биржа мне отправила битки обратно со своего горячего кошелька на мой новый биткоин адрес, то есть связь между моими адресами уже обрывается. Такой вот примитивный способ миксинга с помощью бирж.Способ очистки с помощью бирж хоть и примитивный, но, на мой взгляд, самый эффективный.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "July 14, 2023, 04:04:58 PMLast edit: December 02, 2023, 04:27:33 AM by satscraper",
      "body": "Появилась свободная минутка",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "July 31, 2023, 03:32:52 PMLast edit: December 02, 2023, 04:28:51 AM by satscraper",
      "body": "Сегодня решил проверить на \"запятнаность\" те сатоши, которые были получены  и оплатил ими годовую подписку VPN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "September 14, 2023, 03:50:40 PMLast edit: December 02, 2023, 04:30:04 AM by satscraper",
      "body": "Quote from: Ratimov on September 08, 2023, 08:19:23 AMИтак, подведем итог нашего большого пользовательского обзора этого миксера:Достоинства- Отсутствие проблем при AML проверке биткоинов после Отсутствие дальнейших проблем с AML для тех монет, которые пришли  вполне закономерно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "September 14, 2023, 04:10:12 PMLast edit: December 02, 2023, 04:31:01 AM by satscraper",
      "body": "Quote from: Ratimov on September 14, 2023, 03:58:16 PM~Да, скорее всего устанавливает при регистрации свои правила в том числе и по поводу комиссий.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "izibbc",
      "created_time": "September 15, 2023, 07:16:33 PM",
      "body": "Всем привет. Миксеры ведь уже в прошлом. Сейчас есть сервисы, которые берут грязный биток или другую крипту, а отдают пользователю крипту с биржи. В итоге принимают условно на электрум, а отдают чистую с любой биржи:бинанс, байбит и тд.Я этим занимаюсь уже 4 года. Сейчас миксеры не нужны, они потеряли свою актуальность",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "September 16, 2023, 07:28:38 AMLast edit: December 02, 2023, 04:31:49 AM by satscraper",
      "body": "Quote from: izibbc on September 15, 2023, 07:16:33 PM~Если биржа с KYC и AML, то скорее всего получишь обратно  условно чистые битки, при условии, что зачислят твои условно грязные монеты. Последнее может оказаться под большим вопросом.Если биржа без  KYC и AML то скорее всего  будет баш на баш. Вместо своихусловно грязных монет получишь другие условно грязные битки.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fadarenid",
      "created_time": "September 16, 2023, 10:47:11 AM",
      "body": "Quote from: izibbc on September 15, 2023, 07:16:33 PMВсем привет. Миксеры ведь уже в прошлом. Сейчас есть сервисы, которые берут грязный биток или другую крипту, а отдают пользователю крипту с биржи. В итоге принимают условно на электрум, а отдают чистую с любой биржи:бинанс, байбит и тд.Я этим занимаюсь уже 4 года. Сейчас миксеры не нужны, они потеряли свою актуальностьМиксеры на самом деле всегда были и будут актуальны. Другой вопрос в том, что в настоящее время качественных миксеров не так уж и много.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "September 16, 2023, 12:50:24 PM",
      "body": "Quote from: Fadarenid on September 16, 2023, 10:47:11 AMМиксеры на самом деле всегда были и будут актуальны. Не всегда они были актуальны) Мало сервисов? Ознакомьтесь с  [2023] Список Bitcoin миксеров.Сейчас намного проще выбрать сервис под себя, только платите комиссию. Quote from: Fadarenid on September 16, 2023, 10:47:11 AM настоящее время качественных миксеров не так уж и много.Что конкретно Вы подразумеваете под этим? + было бы любопытно увидеть Ваш отзыв/обзор в этой теме.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "December 02, 2023, 04:22:37 AMLast edit: December 02, 2023, 04:41:50 AM by satscraper",
      "body": "В связи с вступлением с 1 января 2024 года  новых правил , запрещающих рекламу на форуме миксеров и любое о них упоминание, тему закрываю дабы не подвергать опасности бана неофитов да и остальных участников форума.Администратор говорит, что связанные с миксерами старые посты не приведут к бану, но все мы под колпаком и всё может измениться в один \"прекрасный\" момент, которым навернка воспользуются здешние любители \"охоты на ведьм\".Поэтому все посты, связанные с конкретными миксерами, будут уничтожены до 1 января.Если автор поста не согласен с удалением, он может  обратиться ко мне в личку до 15 декабря 2023 (часть постов, связанных с моими уже удалена, притензии в личку). Содержание поста останется таким как есть или автор может отредактировать содержание и я для этого открою тему.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}