{
  "id": "topic_5403007",
  "title": "franch",
  "author": "franch",
  "created_time": "June 17, 2022, 06:23:29 PM",
  "content": "A year ago as a result of China’s crackdown on cryptocurrency mining facilities, Bitcoin (BTC) mining became easier and more profitable. More than half of the hashrate, or the processing power of the Bitcoin network, dropped since the market peak in May 2021 as a result of the Chinese government’s mining restriction. In spite of this, mining Bitcoin is no longer profitable for miners, according to data from the cryptocurrency analytics platform CryptoRank that was published on June 17. This is because of the meltdown that has occurred in the cryptocurrency market, which has caused Bitcoin’s price to drop to a level that has not been seen in the past 18 months and has led the flagship digital asset to struggle to maintain support above the critical $20,000 level. Source: https://finbold.com/bitcoin-mining-becomes-unprofitable-as-btc-price-falls-to-the-average-cost-of-mining/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403007",
  "comments": [
    {
      "author": "mindrust",
      "created_time": "June 17, 2022, 06:30:59 PM",
      "body": "Quote from: franch on June 17, 2022, 06:23:29 PMA year ago as a result of China’s crackdown on cryptocurrency mining facilities, Bitcoin (BTC) mining became easier and more profitable. More than half of the hashrate, or the processing power of the Bitcoin network, dropped since the market peak in May 2021 as a result of the Chinese government’s mining restriction. In spite of this, mining Bitcoin is no longer profitable for miners, according to data from the cryptocurrency analytics platform CryptoRank that was published on June 17. This is because of the meltdown that has occurred in the cryptocurrency market, which has caused Bitcoin’s price to drop to a level that has not been seen in the past 18 months and has led the flagship digital asset to struggle to maintain support above the critical $20,000 level. Source: https://finbold.com/bitcoin-mining-becomes-unprofitable-as-btc-price-falls-to-the-average-cost-of-mining/Unprofitable for who? For people who pay for their electricity? Might be true. However there are many people who get their electricity for free somehow. (thieves? solar energy?) In the end some miners may shut down them rigs but the network will never go off. There will always be somebody somewhere mining bitcoin. Heck, some people will probably mine it whether it is profitable or not just because they can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "June 18, 2022, 07:04:41 AM",
      "body": "You know.... Satoshi has built in mechanisms into the Bitcoin protocol to combat situations like this. It just happens that when the hashrate drop, the Bitcoin protocol will adjust the difficulty so that it will become easier to mine bitcoins. In affect, miners will then use less electricity to mine coins and it will stay profitable under conditions when there are lower prices. https://stats.buybitcoinworldwide.com/hashrate-vs-price/  <=== I do not see a dramatic drop in the hashrate at the moment, so I guess a lot of miners are still mining with enough profit. Study the graph and you will see that the hashrate has climbed ..even when there was a big drop in the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "June 18, 2022, 12:46:12 PM",
      "body": "As of now the next difficulty adjustment in about 5 days puts it at flat. So it does not look like any miners are shutting down. Or if some are shutting down as fast as they do others come online. If BTC stays at it's current price point or drops then we will have to see what happens in 20 days or so from now to the difficulty. At a guess a few of the edge cases might shut down smaller farms but for the most part since you have to buy & pay for the gear before you get it, it's better to mine at a loss and accumulate coins hoping for an increase in price then shutting it down and selling off the miners.Just my view.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "June 18, 2022, 12:47:50 PM",
      "body": "Quote from: mindrust on June 17, 2022, 06:30:59 PMHowever there are many people who get their electricity for free somehow. (thieves? solar energy?)You're unfortunately correct when it comes to thieves, but the same can't be said for the latter... To harness such energy, miners need to acquire certain pieces of equipment for their setup and they tend to cost a lot [at first].Quote from: Kakmakr on June 18, 2022, 07:04:41 AMYou know.... Satoshi has built in mechanisms into the Bitcoin protocol to combat situations like this. It just happens that when the hashrate drop, the Bitcoin protocol will adjust the difficulty so that it will become easier to mine bitcoins.~Snipped~I do not see a dramatic drop in the hashrate at the moment,Regarding the difficulty adjustments that it happens roughly every two weeks, you have a point but that doesn't change the fact that miners are currently earning less when they try to convert their BTCitcoins into dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 19, 2022, 03:42:12 AM",
      "body": "Quote from: Kakmakr on June 18, 2022, 07:04:41 AMYou know.... Satoshi has built in mechanisms into the Bitcoin protocol to combat situations like this. It just happens that when the hashrate drop, the Bitcoin protocol will adjust the difficulty so that it will become easier to mine bitcoins.Yeah but remember that the hashrate only actually drops if miners completely stop mining in the first place, but that would be catastrophic to their own profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 20, 2022, 03:13:48 PM",
      "body": "Quote from: franch on June 17, 2022, 06:23:29 PMIn spite of this, mining Bitcoin is no longer profitable for miners, according to data from the cryptocurrency analytics platform CryptoRank that was published on June 17. Nice, article, very informative.Now I know another analytics platform I can safely ignore for their research!So their data is a graph of bitcoin price and some... made-up stuff.Everyone was shooting that the average for keeping mining profitable is 30k, we're down one thrid and look t the difficulty, a -1.5% budge down. Every single of those idiots goes to google, grabs the average kwh price per country, grabs the hashing rate distribution from digiconomsit and they have a graph.My average electricity cost for residential is 30 cents, I mine for 5 cents, and my gear has been paid off, so what's my actual cost of mining?There are tons of miners mining at 2cents, tons who have already made ROI so for them is electricity vs income, nobody even bothers to listen to those, not even talking about going deeper, guys that can claim write-offs on taxes based on depreciation on their miners.Quote from: Kakmakr on June 18, 2022, 07:04:41 AMhttps://stats.buybitcoinworldwide.com/hashrate-vs-price/  <=== I do not see a dramatic drop in the hashrate at the moment, so I guess a lot of miners are still mining with enough profit. Study the graph and you will see that the hashrate has climbed ..even when there was a big drop in the price.  That could have been a nice graph but they had to go log, which when it comes to hashrate is just stupid, it makes the hashrate look almost flat when there are billion in equipment added in a year, worth more than everything that was previously mining in 10 times.Anyhow, this is what matters:https://bitinfocharts.com/comparison/bitcoin-mining_profitability.html#3mWe're not yet to the lowest in the last 3 years so probably there won't be any major drop unless we go again below 18k, which I doubt for at least some time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "June 22, 2022, 05:24:00 AM",
      "body": "@stompix. Also, if mining is really unprofitable for the biggest miners, they can get a loan in fiat against their bitcoins, mining hardware and other assets to use for their cashflow and business expenses while waiting for the market to improve again. This bear market might be overestimated and in reality it might end sooner than speculated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "June 22, 2022, 10:54:04 PMLast edit: June 22, 2022, 11:09:06 PM by LeGaulois",
      "body": "Quote from: bbc.reporter on June 22, 2022, 05:24:00 AM@stompix. Also, if mining is really unprofitable for the biggest miners, they can get a loan in fiat against their bitcoins, mining hardware and other assets to use for their cashflow and business expenses while waiting for the market to improve again. This bear market might be overestimated and in reality it might end sooner than speculated.It might...That's the problem. You can't run a business based on speculation. IRL, you can't go to the bank to borrow money while saying to the banker \"my business idea will maybe work\" They want something sure and are well trained to evaluate the risks.Even if the client has collateral, they consider it as a +1 point, but that doesn't make it bulletproofNow considering the mining industry, things aren't smelling the sun currently. Most are pessimists about the market (including me). I don't want to say it will never come back on track, but it's not coming anytime time soon. Surely not during 2022, hence hesitations.The good news is the crypto market isn't the only one to go down. Apple, Facebook, and Gold etc are in the same shoeswhile whales are still here...sent more than 50,000 BTC to crypto exchanges on 20 and 21 June 2022exodus!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 23, 2022, 05:11:53 AM",
      "body": "Quote from: LeGaulois on June 22, 2022, 10:54:04 PMIt might...That's the problem. You can't run a business based on speculation. IRL, you can't go to the bank to borrow money while saying to the banker \"my business idea will maybe work\" They want something sure and are well trained to evaluate the risks.Even if the client has collateral, they consider it as a +1 point, but that doesn't make it bulletproofWhen it comes to traditional business and banks, yeah, that's the rule.Unfortunately for me as I don't have those advantages, and fortunately for bitcoin's security when it comes to this business you can get a lot of investors that would throw money at you without a real plan on the paper, not even mentioning a fully running business with yearly contracts with a stash of coins set aside, they will get the money, and once you secured a bit, taking into account that the gear is already paid, the only expenses are electricity and rent you can keep it one for a while mining at a tiny loss. Not even mentioning the outrageous cheap rates some of these big guys have for power.Quote from: bbc.reporter on June 22, 2022, 05:24:00 AM@stompix. Also, if mining is really unprofitable for the biggest miners, they can get a loan in fiat against their bitcoins, mining hardware and other assets to use for their cashflow and business expenses while waiting for the market to improve again.This bear market might be overestimated and in reality it might end sooner than speculated.As I said above, from banks they will get the same answer as shale oil a few years ago, no cash for you!For the bear market thing, well, bitcoin going back to 30k and even 40k won't be that much of a relief for miners, a lot of hashrate is already ordered so if the price goes up it will get plugged in rising difficulty diminishing revenue, for let's say good times, not extraordinary good like back last year in April, we would need around 60k at same difficulty.24 cents instead of 8 per TH/s, an s19 making 24$ a day, burning 8$ at 10cents/kwh, ROI in a year and something, all numbers rounded up to make it easier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "June 24, 2022, 03:22:54 AM",
      "body": "Quote from: stompix on June 23, 2022, 05:11:53 AMQuote from: bbc.reporter on June 22, 2022, 05:24:00 AM@stompix. Also, if mining is really unprofitable for the biggest miners, they can get a loan in fiat against their bitcoins, mining hardware and other assets to use for their cashflow and business expenses while waiting for the market to improve again.This bear market might be overestimated and in reality it might end sooner than speculated.As I said above, from banks they will get the same answer as shale oil a few years ago, no cash for you!For the bear market thing, well, bitcoin going back to 30k and even 40k won't be that much of a relief for miners, a lot of hashrate is already ordered so if the price goes up it will get plugged in rising difficulty diminishing revenue, for let's say good times, not extraordinary good like back last year in April, we would need around 60k at same difficulty.24 cents instead of 8 per TH/s, an s19 making 24$ a day, burning 8$ at 10cents/kwh, ROI in a year and something, all numbers rounded up to make it easier.I reckon that miners should find a new type of lender. Tether, iFinex, Tether should be very perfect for this kind of situation hehe. I am not sure what would be the business arrangement, however, everyone knows Tether accepts commercial papers for short term loans. This would be very useful for miners if their problem is monthly cashflow. They can leverage 1 month of expenses and repay this then reborrow repeatedly until the market and difficulty are stable.@ETFbitcoin. It would kill their business. How will the miners repay the loan?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "June 25, 2022, 04:11:15 AM",
      "body": "@ETFbitcoin. It is very different hehe. A loan to pay for costs of operation for bitcoin mining, where there's an assurance of monthly mining revenue is different from taking a loan only to speculate on bitcoin's price and hope it will pump. The miner has a real business, the speculator has nothing but expectations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "June 25, 2022, 09:53:16 AM",
      "body": "Quote from: bbc.reporter on June 25, 2022, 04:11:15 AM@ETFbitcoin. It is very different hehe. A loan to pay for costs of operation for bitcoin mining, where there's an assurance of monthly mining revenue is different from taking a loan only to speculate on bitcoin's price and hope it will pump. The miner has a real business, the speculator has nothing but expectations.I still find it's not that different. After all, the mining revenue heavily depends on Bitcoin price. I fail to see there's assurance mining always profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "temple",
      "created_time": "June 26, 2022, 12:23:48 AM",
      "body": "Quote from: ETFbitcoin on June 25, 2022, 09:53:16 AMQuote from: bbc.reporter on June 25, 2022, 04:11:15 AM@ETFbitcoin. It is very different hehe. A loan to pay for costs of operation for bitcoin mining, where there's an assurance of monthly mining revenue is different from taking a loan only to speculate on bitcoin's price and hope it will pump. The miner has a real business, the speculator has nothing but expectations.I still find it's not that different. After all, the mining revenue heavily depends on Bitcoin price. I fail to see there's assurance mining always profitable.That is of course correct that mining profitability depends on Bitcoin's price, but what is even more interesting right now are the rising energy prices all around the world due to issues from the war. Who knows, maybe we will see another major shift in geolocations for mining operations but this time not because of national bans, but because of countries who have the resources to provide cheap energy while at the same time having a need to circumvent sanctions. Russia wasn't the Bitcoin friendliest country in the past, but could that change? Ideas? On another note Bitcoin's volatility is the reason why we have seen further and further consolidation in the mining industry from many participants to a few major players. They have set up the whole business with the volatility in mind. They had the cash to survive price swings while others had not. But still I think that the biggest advantage usually are the energy price and stability in the respective geolocation of mining businesses. Now that electricity costs are going through the roof in some places, I wonder whether some mining businesses must go out of businesses because they are confronted with problems from two sides: dropping Bitcoin price and rising energy costs. Any business who is in a place where there is just one of those problems to be dealt with automatically has an advantage. We will see in the coming autumn/winter I think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "June 26, 2022, 01:15:21 AM",
      "body": "Quote from: ETFbitcoin on June 25, 2022, 09:53:16 AMQuote from: bbc.reporter on June 25, 2022, 04:11:15 AM@ETFbitcoin. It is very different hehe. A loan to pay for costs of operation for bitcoin mining, where there's an assurance of monthly mining revenue is different from taking a loan only to speculate on bitcoin's price and hope it will pump. The miner has a real business, the speculator has nothing but expectations.I still find it's not that different. After all, the mining revenue heavily depends on Bitcoin price. I fail to see there's assurance mining always profitable.I understand your argument. A falling price and a high hashrate would certainly make it cheaper to buy bitcoin than start mining them if you are not a miner. However, my argument is for those miners that already have their farms and their problem on their monthly cashflow to maintain the business operation. It would be head shaking if mining farm owners get a loan to buy bitcoin then leave the business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "August 19, 2022, 02:55:51 AM",
      "body": "News update.This bitcoin mining company made a decision to return mining equipment to settle a debt. It appears that there will either be bitcoin miners that does not want to get a loan to maintain their monthly cashflow or no lender is willing to provide loans for bitcoin miners because they are at higher risk of being unprofitable during a bear market.Bitcoin mining can bring some promises of good fortune, but given the unpredictable nature of bitcoin and other cryptocurrencies, the activity can go sideways and force even the most well-funded company to resort to desperate measures – like selling equipment to stay afloat.Stronghold Digital Mining announced on Wednesday that it will return over 26,000 bitcoin mining machines to New York Digital Investment Group in exchange for the cancellation of $67.4 million in debt.Source https://bitcoinist.com/bitcoin-mining-firm-returns-26000-rigs-to-survive/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "August 19, 2022, 09:31:10 AM",
      "body": "Quote from: bbc.reporter on August 19, 2022, 02:55:51 AMThis bitcoin mining company made a decision to return mining equipment to settle a debt.This perfectly shows how mismanagement of funds could have a negative impact on a certain company! CMIIW, but from what I understood, they were already in debt at the time they requested more mining rigs and that's a huge gamble on something that doesn't even have a static outcome [SMH]!- FWIW, I equally blame the lender as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 19, 2022, 11:34:11 AM",
      "body": "Quote from: bbc.reporter on August 19, 2022, 02:55:51 AMBitcoin mining can bring some promises of good fortune, but given the unpredictable nature of bitcoin and other cryptocurrencies, the activity can go sideways and force even the most well-funded company to resort to desperate measures – like selling equipment to stay afloat.It's not that desperatehttps://fortune.com/2022/08/16/bitcoin-mining-crypto-winter-stronghold-digital-selling-electricity/Since it's paywalled:QuoteIn its earnings release on Aug. 16, Stronghold Digital Mining announced two major strategic shifts designed to blunt the steep fall in Bitcoin prices. First, Stronghold is returning no fewer than two-thirds of its mining machines to the lender that financed them—not unlike the way homeowners in some states can give their house back to the bank in a foreclosure, erasing their mortgage debt in the process. Second, the Pennsylvania outfit now plans to generate the bulk of its revenue not by pursuing its original mission of producing the flagship cryptocurrency, but by selling power—at far fatter margins—to the electrical grid that serves the region’s homes and businesses.https://pastebin.pl/view/6c8f8162They are making more profits by selling the power than by mining with it, which makes perfect sense.Just like an aluminum plant that did the same a month ago, if you burn $100 of gas and oil to make $120 of aluminum but you could sell that electricity for $200, what would you do? Of course, numbers are for illustration purposes.Quote from: ETFbitcoin on June 25, 2022, 09:53:16 AMI still find it's not that different. After all, the mining revenue heavily depends on Bitcoin price. I fail to see there's assurance mining always profitable.There is one difference, you can earn money with the price being stable or even while it's going down with mining while holding coins, of course, you don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "August 20, 2022, 03:28:04 AM",
      "body": "Quote from: SFR10 on August 19, 2022, 09:31:10 AMQuote from: bbc.reporter on August 19, 2022, 02:55:51 AMThis bitcoin mining company made a decision to return mining equipment to settle a debt.This perfectly shows how mismanagement of funds could have a negative impact on a certain company! CMIIW, but from what I understood, they were already in debt at the time they requested more mining rigs and that's a huge gamble on something that doesn't even have a static outcome [SMH]!- FWIW, I equally blame the lender as well.It might not only because of mismanagement if it has occured. It is really showing that the cryptospace economy is also going through a recession. Much of the miners' earnings also depend on the speculation that the prices of proof of work coins in the market are going up.In any case, if they were already in debt when they requested more mining equipment, I reckon this is not only mismanagement, this might also be their way of speculating that the bull market will return and bitcoin would begin pumping. It was a risky business decision that did not go according to what they might have predicted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "October 11, 2022, 01:23:15 AM",
      "body": "but i hear the news that bitcoin hash rate keep to touching new ATH day by day you can see the news here https://cointelegraph.com/news/not-a-minor-adjustment-bitcoin-mining-difficulty-soars-13-5-to-new-athit seems the miner from eth move to bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}