{
  "id": "topic_5412026",
  "title": "Mr. Magkaisa",
  "author": "Mr. Magkaisa",
  "created_time": "September 01, 2022, 04:25:02 PM",
  "content": "Good day to all the members here in this forum, if you remember I made a topic here where I taught my neighbor's basic features about Bitcoin to young adults who came to my humble home and this is the link https://bitcointalk.org/index.php?topic=5408842.0 Now after these first session these young in mind told me that they will find a way to follow my teaching again, almost 1 month has passed because the rest of them have a hectic schedule in school and others are at work.And here it is, one day these young people came to my home before dinner and I didn't expect them to ask me if I could continue with the second session and of course I said, yes why not... So I was teaching them about bitcoin. And on this occasion, I started familiarizing them with the introduction of bitcoin trading with a simple explanation in our language of course.And this is where I watched a video tutorial with them that teaches what the first step they should do in entering trading,  where they must first know how to create an account on a crypto exchange and Binance tutorial was the best for this,  I watched on them and how to deposit and withdraw from the exchange to our local currency to one of the wallet apps that we have here via p2p. As you can see in the pictures of this topic.rainy weather dpAfter they watched the video I showed them, I told them to create an account on the Binance exchange so that they would know how to make a way to have Bitcoin. And I also taught them one by one how to grow bitcoin little by little using binance, and how to transfer it to one of our wallet apps here called coinsph that uses cryptocurrencies that they can turn into a business apart from bitcoin trading even in the traditional business method that exists in coinsph's wallet apps, and they had a little more interest in knowing this, which I honestly said to myself that it might be difficult for them to immediately understand this even if I explain it in a simple way, but These young adults really impressed me with the strange eagerness they showed to use and learn about the basic trading they will do using our local wallet apps here.So I taught them about this matter for about 2 hours and they told me that they will contact me via messenger or chat when they will come to my house again because they know that my home is always open to those who are dedicated and determined to learn to know what bitcoin is and how to use it in our lives.I hope it will still help me to support my colleagues here in the cryptocurrency industry so that we can guide these young adults like them in their proper growth here. Thank you again for taking the time to read my crypto teaching series for the young in mind.Good day and bless us all here",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412026",
  "comments": [
    {
      "author": "BitDane",
      "created_time": "September 01, 2022, 08:06:51 PM",
      "body": "Nice follow up teaching, but do you think it not that too early to tackle trading Bitcoin when they had a little grasp of what really Bitcoin is?  They might end up blaming you if ever they failed on their trading venture since they haven't got any fundamental learning of Bitcoin and its market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 01, 2022, 11:41:00 PM",
      "body": "I don't exactly know how old your students are but some of them surely look to be below 18. How do you go about this when setting up and accounts for them on binance. Remember Binance requires verification before using their service. If I am not mistaken, those below 18 are not allowed to trade. How did you manage to bypass that restriction when they were verifying?Quote from: BitDane on September 01, 2022, 08:06:51 PMNice follow up teaching, but do you think it not that too early to tackle trading Bitcoin when they had a little grasp of what really Bitcoin is?  They might end up blaming you if ever they failed on their trading venture since they haven't got any fundamental learning of Bitcoin and its market.Not if he clearly warns them of the risks involved with trading.Trading fucks up everyone, no one comes out a virgin  The only way of learning how to trade is by practicing, getting fucked and then trying to avoid the same mistakes in future. one can't learn only through theory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 02, 2022, 06:22:12 AM",
      "body": "Quote from: Mr. Magkaisa on September 01, 2022, 04:25:02 PMSo I was teaching them about bitcoin. And on this occasion, I started familiarizing them with the introduction of bitcoin trading with a simple explanation in our language of course.Trading can be good and profitable, but newbies to trading are at high risk of losing what they have, just like gambling, only the people that have been trading for a long time have the knowledge and experience to make profit than loss. Hope you let them know about the risk involved in trading?Hope you let them know that trading is entirely different from trading?It would be good to let them know that bitcoin holding is different and better for newbies, especially in this period of bear market that people are expecting bull run already.Quote from: Mr. Magkaisa on September 01, 2022, 04:25:02 PMAnd this is where I watched a video tutorial with them that teaches what the first step they should do in entering trading,  where they must first know how to create an account on a crypto exchange and Binance tutorial was the best for this,  I watched on them and how to deposit and withdraw from the exchange to our local currency to one of the wallet apps that we have here via p2p. As you can see in the pictures of this topic.Hole you let them know the risks involved if having coins on an exchange? That the exchange have full control over their own funds, that it is not their kety, which means it is not their coins on blockchain. Also how exchanges can be hacked. All to let them know that they should not use exchanges for holding, but only for trading, that any inactive funds should be moved to a noncustodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "September 02, 2022, 07:18:49 AM",
      "body": "It's good to be able to teach your colleagues about crypto trading but don't forget to also tell them about the risks. Quote from: Mr. Magkaisa on September 01, 2022, 04:25:02 PMAfter they watched the video I showed them, I told them to create an account on the Binance exchange so that they would know how to make a way to have Bitcoin. And I also taught them one by one how to grow bitcoin little by little using binance, But I must say that you gave them a bit of misinformation when you said this. Are you sure that the trades that will be made will be able to make their bitcoins continue to grow little by little?. A lot of people are attracted to trading because they see how people flaunt their profits but I would suggest keeping it long-term rather than trading.You should also tell the risk of hacking in crypto and how to secure the asset, hopefully this will also be in your teaching",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "September 02, 2022, 09:37:25 AM",
      "body": "Quote from: Strongkored on September 02, 2022, 07:18:49 AMIt's good to be able to teach your colleagues about crypto trading but don't forget to also tell them about the risks. Quote from: Mr. Magkaisa on September 01, 2022, 04:25:02 PMAfter they watched the video I showed them, I told them to create an account on the Binance exchange so that they would know how to make a way to have Bitcoin. And I also taught them one by one how to grow bitcoin little by little using binance, But I must say that you gave them a bit of misinformation when you said this. Are you sure that the trades that will be made will be able to make their bitcoins continue to grow little by little?. A lot of people are attracted to trading because they see how people flaunt their profits but I would suggest keeping it long-term rather than trading.You should also tell the risk of hacking in crypto and how to secure the asset, hopefully this will also be in your teachingNope, I'm not giving them a misinformation, you might said because of the binance platform you saw it in the image Sir, actually, I brief them why they need to create an account on binance and I also told them why they need to create an account on coinsph though both platform need to be verify since one of these young adult was a teenager only or below 18. And the reason for all of these was already explained well Sir. And each of the parents of these young in mind are all my friends aside from they are all my neighbors.In fact, from the Episode1, I told them a little about the risk of bitcoin and they somehow understood it and I repeated it here in episode 2, now about the below 18 years who is a young person who attended my home, just before I told him his parent's name is what he can use to verify the account to be made in Binance and coinsph.Then in this session, I only said that the binance platform is a good place to do the activity if the time right times come that each of them have a capability to do trade in Bitcoin, but as a beginner like them, they don't need to focus their minds on doing the trading for now, I just gave them a view of what actual trading looks like when they have bitcoin.It seems that the focus of our conversation in this episode focused on the local app wallet of coinsph, where they can also conduct trading without visible charts or graphs so that they are not confused as a newbie in the crypto industry Sir.Quote from: Bitcoin_Arena on September 01, 2022, 11:41:00 PMI don't exactly know how old your students are but some of them surely look to be below 18. How do you go about this when setting up and accounts for them on binance. Remember Binance requires verification before using their service. If I am not mistaken, those below 18 are not allowed to trade. How did you manage to bypass that restriction when they were verifying?Quote from: BitDane on September 01, 2022, 08:06:51 PMNice follow up teaching, but do you think it not that too early to tackle trading Bitcoin when they had a little grasp of what really Bitcoin is?  They might end up blaming you if ever they failed on their trading venture since they haven't got any fundamental learning of Bitcoin and its market.Not if he clearly warns them of the risks involved with trading.Trading fucks up everyone, no one comes out a virgin  The only way of learning how to trade is by practicing, getting fucked and then trying to avoid the same mistakes in future. one can't learn only through theory.I did not fail to remind them about the risk that Bitcoin has and I told them several times, but I still told them that this should not be a reason for their fear to discourage them. while they know the study of bitcoin because this risk that bitcoin has will also be the way for them to have a good profit in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee72",
      "created_time": "September 02, 2022, 11:43:51 AM",
      "body": "It's a very good thing to teach interested people about cryptos. For me it seems like giving them a first glance to this subject. So go for it.Nevertheless, in my opinion trading cryptos seems not to be the best subject for newbies. There are too many risks to consider. Every risk needs knowhow in order to deal with it. As I see on your pictures, I guess your friends are still young. So no hurry at all.If they really like to get some profits, I would let them learn to do some stock investment (not trading) first. There are some shares (EFT's) which can be called as a blue chip (of course there is never a 100%). Teach about graphs, about losing, time of bying, time of selling, fees, about dca - all that is useful for cryptos too. Most stocks are quite expensive, so holding is anyway better than trading. Trading may begin when knowhow gives a chance to have earnings in trades. Let them use earnings from stocks to buy cryptos later on. No hurry for them. Anyway it's a good idea to diversify things. Not only one crypto, not only one market, not only one technology, etc. I dont' know your friends, so I can't say if you are doing the right way or not, but that's the way I would prefer I would teach my son one day. And the first thing I would teach him: you will lose. Right from the beginning. You really like to do that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "September 02, 2022, 12:29:03 PM",
      "body": "You could also introduce them to no-kyc/no mandatory kyc exchanges, look into https://www.kycnot.me/But before anything else, best to teach them good security habits on how to safekeep their crypto e.g.  how to backup, what wallet to choose, what not to click, etc...Lastly, I'm sure you have a life outside crypto space so one way to ease your workload is to introduce them to bitcointalk to read and/or ask further questions-- they could do this in their local board as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "September 02, 2022, 01:27:04 PM",
      "body": "Glad to see a fellow kababayan who is teaching these young adults about trading on Bitcoin. Of course I saw your previous posts about teaching your neighbors about the basic information of Bitcoin and that is a good thing. So the setup is like a simple house party where you get to show them the video tutorials about Bitcoin trading. If that is your thing that really works for you, keep doing it. But make sure that you do not disclose to them on how much assets you have or showing them your hardware wallet with the “keys to the kingdom”. This one reminds me back then when I had this free private mini crypto workshops years ago in various cities. Anyways, keep up the good work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "September 02, 2022, 02:07:25 PM",
      "body": "The risk involved in trading bitcoin is what is very important to tell the new people we introduce to it because people outside think of the trading as what is very easy and they come with the mindset to make alot money immediately they start and they take alot of unreasonable risk that they are out of the market faster. Education is good, knowledge dissemination include giving the best money management skills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 02, 2022, 02:30:28 PM",
      "body": "You have a good initiative to teach Bitcoin to your neighbor in your previous thread, but I'm sorry I would disagree with your current initiative to teach Bitcoin trading to young adults. Trading courses doesn't only for Bitcoin, so you're actually teach them about basic trading skills. But not everyone will become successful from trading and we're don't know how good you're in trading. It's high risk and not recommended for newbie.Quote from: Potato Chips on September 02, 2022, 12:29:03 PMYou could also introduce them to no-kyc/no mandatory kyc exchanges, look into https://www.kycnot.me/Though I also have high privacy concern, but I don't think it's good to use No KYC exchanges in trading due to less liquidity, maybe Kucoin is just the only option for him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "September 02, 2022, 03:02:19 PM",
      "body": "Great initiative, it's your responsibility now to guide them on the right path in trading to have a security-first before making money.There are so many things that they need to understand first, first the wallet that you've used was the wallet that I've used too, and keep in mind the huge fee for transferring Bitcoin to Binance.  It should always teach or remind them not to hold Bitcoin on any custodial wallets or exchange. I'm afraid that someday they will blame you once they will encountered failure, the same that happened to me when I teach my sister about trading.Don't forget to tell them the possible negative consequences when they're in that stage (it will help you not to blame yourself when they have failed in trading), not only focus on the profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 02, 2022, 03:08:21 PM",
      "body": "Quote from: Solosanz on September 02, 2022, 02:30:28 PMYou have a good initiative to teach Bitcoin to your neighbor in your previous thread, but I'm sorry I would disagree with your current initiative to teach Bitcoin trading to young adults. Trading courses doesn't only for Bitcoin, so you're actually teach them about basic trading skills. But not everyone will become successful from trading and we're don't know how good you're in trading. It's high risk and not recommended for newbie.I think you didn't read what the @OP said \" QuoteThen in this session, I only said that the binance platform is a good place to do the activity if the right times come that each of them have a capability to do trade in Bitcoin, but as a beginner like them, they don't need to focus their minds on doing the trading for now, I just gave them a view of what actual trading looks like when they have bitcoin.\"In this statement of the OP, He just showed these young adults what crypto or bitcoin trading looks like so that at least they have an idea, but the focus of his explanation is focused on local app wallets that are available in their location. Because he knows that crypto trading is not that easy for young people to understand.So whatever his method is for these young adults to understand bitcoin trading, let's have his approach on the matter. After all, it is the willingness of these young people to teach them, which means they understand what the OP is teaching and explain the things they want to know. Because, if OP's explanation wasn't good do you think these young adults would still be going to OP's house to continue teaching them about bitcoin? I'm just asking you only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smartaction",
      "created_time": "September 02, 2022, 03:23:52 PM",
      "body": "I appreciate it when someone takes such initiative with Bitcoin . But I want to know are you an expert in trading? and how old is your students ? trading is a profitable business and Many traders have chosen trading as their profession . but trading is high risky for newbies . I don't know how much your students can learn from you and how much they can profit from. But hopefully nothing negative will happen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "September 02, 2022, 05:43:01 PM",
      "body": "I commend your effort to teach people around you about cryptocurrency trading, I will like to recommend you a few possible ways to start since from your post those your friends do not know cryptocurrency so at best you should start by teaching them about the wallet and how to choose the best wallet with security.Also instead of using binance which has an age restriction for those under 🔞 because it is an exchange why not choose peer-to-peer as the teaching formula since it also teaches about privacy and security instead of an exchange that does not give you keys to your wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "September 02, 2022, 06:51:35 PM",
      "body": "A good idea, OP. I read your earlier article in earlier about teaching your neighbors about cryptocurrencies, and you have since kept up the teaching. Your zeal in educating this young adults on this has really impressed me. Since they are always open and willing to learn from you, you must be a great teacher. We appreciate you giving them the opportunity to learn from start and guiding them step by step rather than just convincing them of the greater picture (benefits and earnings) of trading bitcoin. Additionally, try to educate them about the risks involved and the best ways to protect their wallets from theft or fraud. I hope they realise the benefits in investing in bitcoin soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "September 04, 2022, 09:52:20 AM",
      "body": "Quote from: Mr. Magkaisa on September 02, 2022, 09:37:25 AMIt seems that the focus of our conversation in this episode focused on the local app wallet of coinsph, where they can also conduct trading without visible charts or graphs so that they are not confused as a newbie in the crypto industry Sir.Have you also discussed that every other financial services that involves bitcoin trading have different buy and sell spreads[1]? I mean if you compare coins.ph, Binance, Abra and bloomx; they all offer different buy and sell rates which if you know, you can compare the prices and probably save you a bit of cash than relying only with one service like coins.ph which kinda sucks..Also, if maybe you'll conduct another seminar, you can mention that learning how to use limit order could save you a lot from fees than using the Market Order in Binance.[1] https://www.investopedia.com/terms/s/spread.asp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "September 05, 2022, 12:46:44 AM",
      "body": "I commend you for doing this initiative in the PH, as this is one of the best country in Asia as far as crypto adoption is concern, just needed some push. Is this in the province though? I'm just curious as this might be big for kids, and it can grow as the news can spread in their that bitcoin will be a big help on how to earn at least good money as passive income when you do trading. So goodluck and hopefully we can hear some updates from your student on how they made it  with regards to bitcoin trading in BInance or even Coins.ph.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "September 05, 2022, 07:12:49 AM",
      "body": "Quote from: cryptomaniac_xxx on September 05, 2022, 12:46:44 AMI commend you for doing this initiative in the PH, as this is one of the best country in Asia as far as crypto adoption is concern, just needed some push. Is this in the province though? I'm just curious as this might be big for kids, and it can grow as the news can spread in their that bitcoin will be a big help on how to earn at least good money as passive income when you do trading. So goodluck and hopefully we can hear some updates from your student on how they made it  with regards to bitcoin trading in BInance or even Coins.ph.Right now, sir, we are in the second session of talking about this matter. Then this is just a short briefing on the Binance exchange so that they can at least see what is the heart of why there are so many people who enjoy Bitcoin in different countries in our time.These young adults still have a long way to go. But I also believe that eventually each of them will have a result as long as they do not change and they stand by what they started here by teaching them, and it is a great honor and joy that I have been part of the instrument to learn they are in the bitcoin industry.But for the meantime, on this episode 2 the main focus was in the coinsph apps wallet, and the risk that they could encounterhere in the cryptocurency or bitcoin. Because this is the main battle here as an individual traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "September 05, 2022, 02:24:45 PM",
      "body": "This is good. Just always be careful about what information you will give to them because sometimes others misinterpret what comes out of our mouths. I have two oldies who are my drinking buddies here in our place and we discussed a lot of things on Sunday nights. There are times I already discussed Bitcoin with them and I am always careful about telling the risk it has either in trading or investing because of the volatility. Now the other one is hooked on the idea and I try to guide him as much as possible if he has questions. Even if sometimes he just repeats himself, I try to be patient to explain it step by step. You will need a lot of that patience. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}