{
  "id": "topic_5505798",
  "title": "Question:",
  "author": "BitcoinBarrel",
  "created_time": "August 11, 2024, 06:28:49 AM",
  "content": "I'm interested in how most forum members receive their Bitcoins. We have got most of ours over the years with faucets, earning sites and also payments for various gigs.What about you?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5505798",
  "comments": [
    {
      "author": "Mia Chloe",
      "created_time": "August 11, 2024, 06:36:00 AM",
      "body": "The two possible ways to likely HODL bitcoin currently, is either you buy it or you earn it. As for the buying, it's quite simple since all you need to do is just swap some fiat for an equivalent amount of bitcoin. On the other hand some people render services like freelancing and other gig like you mentioned and depending on their agreement with the client , some get paid in crypto currency which includes bitcoin.The only one I really don't think it would be easy to HODL is selling goods for bitcoin. This is because the seller is would likely have to restock sooner and that won't be long term holding except the profit of course is nice enough to HODL.Your profile says you recently woke up. Well welcome back to the forum Don't forget to keep your keys safe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "August 11, 2024, 06:47:45 AM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:28:49 AMI'm interested in how most forum members receive their Bitcoins. We have got most of ours over the years with faucets, earning sites and also payments for various gigs.What about you?I think when it comes to this forum, the major way through 70% of people here get there Bitcoin is by earning (i.e through Signature campaign), while 20% people here get there Bitcoin here by gambling and the remaining 10% get there's through Bitcoin Mining. So those are the major ways through which people on this forum get there. However, when it comes to people off this forum, I think majority get there through buying from a p2p marketplace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "August 11, 2024, 06:56:27 AM",
      "body": "Quote from: Mia Chloe on August 11, 2024, 06:36:00 AMThe two possible ways to likely HODL bitcoin currently, is either you buy it or you earn it.This is not quite true. Here we can add another way to get bitcoin - to receive it as an inheritance. Bitcoin has already existed for more than fifteen years and at the time of the emergence of this cryptocurrency, people who were carried away by this technology were quite mature (techies) and by now, many already have quite mature children ready to start getting acquainted with this type of assets.Also, the reason for the emergence of bitcoin inheritances can be illnesses and early death of bitcoiners (many early users left the forum). Remember Hal Finney and o_e_l_e_o.For natural reasons, the number of people who receive bitcoin in this way will increase over time.We can also consider illegal ways of obtaining bitcoin, such as theft, robbery, fraud, etc. So it turns out that there are slightly more than two ways to get bitcoin that you are talking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinBarrel",
      "created_time": "August 11, 2024, 06:57:44 AM",
      "body": "Quote from: CryptoHeadlineNews on August 11, 2024, 06:47:45 AMQuote from: BitcoinBarrel on August 11, 2024, 06:28:49 AMI'm interested in how most forum members receive their Bitcoins. We have got most of ours over the years with faucets, earning sites and also payments for various gigs.What about you?I think when it comes to this forum, the major way through 70% of people here get there Bitcoin is by earning (i.e through Signature campaign), while 20% people here get there Bitcoin here by gambling and the remaining 10% get there's through Bitcoin Mining. So those are the major ways through which people on this forum get there. However, when it comes to people off this forum, I think majority get there through buying from a p2p marketplace. That's a good assessment I think. At least for nowadays. In the beginning it was probably skewed more towards mining.Anyone else have any unique ways they've received Crypto that's not mentioned? A gift perhaps or something else?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "August 11, 2024, 07:01:54 AM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:28:49 AMI'm interested in how most forum members receive their Bitcoins. We have got most of ours over the years with faucets, earning sites and also payments for various gigs.What about you?On the majorly through the campaign signature and gambling. Occasionally I get few gigs where they client is willing to pay in Bitcoin. I never knew the faucet era until I signed up on the forum. I didn't even meet the earning sites era. I don't know how this may sound but I earn Bitcoin from Bitcoin. What I mean is by holding Bitcoin when the price increases I earn Bitcoin from holding Bitcoin as a result of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "August 11, 2024, 08:06:04 AM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:57:44 AMAnyone else have any unique ways they've received Crypto that's not mentioned? A gift perhaps or something else?I first got into Bitcoin through those free faucets and earning sites too.  They let you get your feet wet without having to risk much money.  I made some extra scratch with freelancing and online odd jobs as well.  But if I'm being real, most of my Bitcoin has come from trading and investments.  Yeah it's riskier, but the potential profits make it worthwhile and   there's also people whove gotten lucky and had Bitcoin gifted to them by family or friends.  That's always a nice surprise! I've even given some Bitcoin as gifts myself to buddies who wanted to learn about it.  It's a cool way to get them set up with their first fraction of a coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "August 11, 2024, 08:06:11 AMLast edit: August 11, 2024, 11:39:51 AM by Hatchy",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:28:49 AMI'm interested in how most forum members receive their Bitcoins. We have got most of ours over the years with faucets, earning sites and also payments for various gigs.What about you?When I first learned about Bitcoin, I wasn't aware of this forum. Someone introduced me to it in early 2021, and I bought about $100 worth of BTC. Although it was a small amount, BTC had a significant price drop that year, which almost made me lose hope in investing more on it. However, I trusted what I had read about its past market trends and held on longer. After some research, I discovered this forum on YouTube and was surprised to learn that the real founders of BTC created BitcoinTalk. I decided to register and was even more surprised to find that membership was free. I've been a member for a year now, and BitcoinTalk has become my main source of earning BTC. I hold onto my signature campaign rewards and buy the bears when I have extra cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 11, 2024, 08:31:38 AM",
      "body": "I, myself personally earn most of my Bitcoin from signature campaign and I earn money from real job to buy Bitcoin, that's.Knowing there's a way to earn Bitcoin for free which is signature campaign, is really a blessing for me because it improve my financial and at the same time I learn about Bitcoin. So, I got two things from this forum, while I learn about Bitcoin, I get paid for it, there's no better than that.Quote from: BitcoinBarrel on August 11, 2024, 06:57:44 AMAnyone else have any unique ways they've received Crypto that's not mentioned? A gift perhaps or something else?There are other ways, some people get Bitcoin from scamming, lending and trade P2P with higher rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "August 11, 2024, 08:31:55 AM",
      "body": "Currently with the way Bitcoin is being cherished and increase in price lot of people earn Bitcoin through buying, trading or even involving  themselves in some signature campaigns that happens to pay in BTC so those who wish to hodl would hodl and those who wish to convert to usdt can do that or even sell to their local fiat. Nowadays lot of project I mean campaign or bounty's does not really pay in Bitcoin as it was back then 2016 and 2017 or even 2019, currently apart from signature campaign most of the projects pays in their native tokens and it could be hard to hold or wait till when listed on exchange to sell and hold back bitcoin. So mostly DCA at times when the market seems not too favorable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "August 11, 2024, 08:37:13 AM",
      "body": "Get my Bitcoin from Signature campaign earnings, my business profit converted to Bitcoin via P2P and gambling.But my main source of Bitcoin is from my early investment that I keep holding long term in my hardware wallet. I just occasionally trade it when the price near peak then accumulate slowly through DCA every 10K price dump.So far this makes me profitable in Bitcoin long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 11, 2024, 09:05:59 AM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:28:49 AMWe have got most of ours over the years with faucets,Really? Do they even exist anymore? How much satoshis are we talking about here? I'm curious because from the day I started (back in 2014) and price was like $400, when I tried faucets the only conclusion was that they are a waste of time. All I've made is something like 50k satoshis at best.In any case to answer your question, I earn my bitcoins as I earn any other form of money I earn!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "August 11, 2024, 10:14:29 AM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:28:49 AMI'm interested in how most forum members receive their Bitcoins. We have got most of ours over the years with faucets, earning sites and also payments for various gigs.What about you?Usually I buy them since if we really only on the income we can get from any gigs we do online then I think acquiring lots of volume will became so slow.Those what we gain online is just a bonus and I think I can use for other risky things which can possibly gain more bitcoin. I sometimes trade but didn't get much of this that's why majority of comes from buying then hodl it for long time.Its interesting to read people post regarding on where they get their bitcoins since we can see multiple ways on how to earn it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "August 11, 2024, 10:37:37 AM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:28:49 AMI'm interested in how most forum members receive their Bitcoins. We have got most of ours over the years with faucets, earning sites and also payments for various gigs.What about you?This is a good question because it will further open the consciousness of some people so that they can do more to get more Bitcoin. But I have to fault this poll as well, it should have the opportunity of voting for more than one option. For instance, if I am allowed to vote for more than one option, I will definitely choose at least 3 of those options. But still, the majority of my Bitcoins were bought, that was in 2022, so I am still a baby in Bitcoin investment. But certainly not a baby in its earnings because I've been trading it and using it for sending and receiving money before I decide to invest in 2022.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "August 11, 2024, 10:40:07 AM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:28:49 AMI'm interested in how most forum members receive their Bitcoins. We have got most of ours over the years with faucets, earning sites and also payments for various gigs.What about you?I have been on this forum for many years and have received bitcoin payments from various campaigns on this forum.  And at the same time work with some clients outside the forum who pay me with Bitcoin.  In this way, I get money through Bitcoin in exchange for work from different places.   But I was interested in doing bitcoin mining but I didn't have a powerful computer with which I can mine bitcoins.  And currently I don't mine even though I have a powerful computer because the mining rate is very low now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 11, 2024, 10:54:18 AM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:57:44 AMAnyone else have any unique ways they've received Crypto that's not mentioned? A gift perhaps or something else?Accepting Bitcoin as payment in a business can be another means of earning Bitcoin. People who have the intention to hold will keep payments in Bitcoin while they use fiat to support their business. That is, these businesses have budgeted funds that have been set aside to restock their businesses with sold goods while they hold every payment that comes in the form of Bitcoin. There was a thread by a member where he gave his wife Bitcoin as a gift (Bitcoin gift to wife). So people can own Bitcoin through gifts from family and friends or even as an inheritance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "August 11, 2024, 11:27:01 AM",
      "body": "maybe some of the people here get their bitcoin from signature campaign, or buy it personally and hold it. and for me personally i prefer to buy it myself using the money that i have allocated before. even though some time ago i got paid bitcoin for signature campaign, but i don't really hold it, i use it for some of my needs, and for investment i usually buy it using money from my business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "August 11, 2024, 02:03:32 PM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:57:44 AMAnyone else have any unique ways they've received Crypto that's not mentioned? A gift perhaps or something else?The unique way I have earned Bitcoin in the past was by participating in an online quiz show called Captain Bitcoin. You earned the Captain Bitcoin tokens by watching videos and giving the correct answers to the videos watched. At the end of the week, there are raffle draws for all participants, to be rewarded in Bitcoin. If you are lucky enough you can win for yourself $10 worth of Bitcoin. That was how I first won for myself Bitcoin before the ATH in 2021 when Bitcoin was around $10k. Although I sold my first Bitcoin as of then because it was a free offer given, out of less knowledge of Bitcoin to soar in the future if you can hodl for long, I sold mine for a small money(sobs).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "August 11, 2024, 02:53:29 PM",
      "body": "Buying's a great start, sure, but its just the first step. Trust me; there are a lot of chances right now. The actual power move is earning Bitcoin straight-forwardly. You are building your portfolio while gaining practical knowledge. Its like hitting two birds with one stone, folks. You also belong to the gig economy, the future, the whole dispersed movement. Real development is occurring in that area.Signature campaigns are really interesting. You may interact with the community, pick a lot of knowledge, and get rewarded in Bitcoin. I would term that a win-win-win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelockg",
      "created_time": "August 11, 2024, 03:23:41 PM",
      "body": "Quote from: BitcoinBarrel on August 11, 2024, 06:28:49 AMI'm interested in how most forum members receive their Bitcoins. We have got most of ours over the years with faucets, earning sites and also payments for various gigs.What about you?the first I ever had was certainly doing a gig online and was paid in BTC. After when, it took a long span of time before I eventually bought some fraction that's eve  less than $50. it wasn't even for the sake of HODling it at the time but just needed to send it accross to someone who wasn't near by and had to figure out how to go about it. I guess that's my first time of actually using Bitcoin to solve my needs. With signature campaign as a majir source of getting BTC from my end, I've had to buy only occasionally when the need arise but for the most part of it, my most surest source of BTC stack have been those I got from doing one or two gig.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}