{
  "id": "topic_5466840",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "September 14, 2023, 11:40:43 PM",
  "content": "Hoje encontrei um site bem interessante: End The FUDEste site, tem como objetivo de reunir artigos, para rebater ou contrapor, questões que muitos \"anti-bitcoin\" tem vindo a colocar. Artigos, que apresentam argumentos reais sobre o Bitcoin e todo o ecossistema que está envolvido.Vocês já conheciam este site?Eu ainda, não tive a oportunidade de analisar todos os artigos, ou todos os artigos listados. Mas, certamente será algo interessante de analisar.Vou analisar com mais detalhe, e depois irei trazer atenção os artigos que achar mais interessantes.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466840",
  "comments": [
    {
      "author": "alegotardo",
      "created_time": "September 15, 2023, 02:00:16 AM",
      "body": "Quote from: joker_josue on September 14, 2023, 11:40:43 PMHoje encontrei um site bem interessante: End The FUDEste site, tem como objetivo de reunir artigos, para rebater ou contrapor, questões que muitos \"anti-bitcoin\" tem vindo a colocar. Artigos, que apresentam argumentos reais sobre o Bitcoin e todo o ecossistema que está envolvido.Vocês já conheciam este site?Eu ainda, não tive a oportunidade de analisar todos os artigos, ou todos os artigos listados. Mas, certamente será algo interessante de analisar.Vou analisar com mais detalhe, e depois irei trazer atenção os artigos que achar mais interessantes.Não conhecia, mas achei bastante \"interessante\" que a questão energética é o primeiro assunto que eles abordaram e ao mesmo tempo um dos que possuem a maior quantidade de artigos relacionados. Inegável que essa tem sido a principal alegação dos anti-bitcoiners no momento.A questão da volatilidade ainda é algo que eu não defenderia com unhas e dentes. Certamente vimos nessa última pandemia que existem outras \"moedas\" bem pior que o Bitcoin, mas ele também está longe ainda de ser considerado \"estável\" para se fazer um investimento seguro à curto e médio prazo.Por fim, eu coloqueio um sorizo largo no rosto que até minha esposa pergunto do que eu estava rindo.... quando cheguei no termo \"bolha\".Pôxa.... essa acusação ganhou força a uns 5 anos atrás, eu presenciei e me lembro bem dessa época, mas certamente é algo que ficou para trás. Espero que todos os FUD que ainda existem hoje também caiam por terra da mesma forma.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 16, 2023, 07:16:56 PM",
      "body": "Quote from: joker_josue on September 14, 2023, 11:40:43 PMVocês já conheciam este site?Não conhecia o projeto, mas conheço grande parte dos autores e alguns dos artigos. Gostei bastante da indicação, obrigada por compartilhar. Quote from: alegotardo on September 15, 2023, 02:00:16 AMPor fim, eu coloqueio um sorizo largo no rosto que até minha esposa pergunto do que eu estava rindo.... quando cheguei no termo \"bolha\".Pôxa.... essa acusação ganhou força a uns 5 anos atrás, eu presenciei e me lembro bem dessa época, mas certamente é algo que ficou para trás. Espero que todos os FUD que ainda existem hoje também caiam por terra da mesma forma.Cara, essa semana uma pessoa me chamou pra um debate BTC vs Ouro, a pessoa queria me contar porque achava que o BTC era uma bosta e o ouro era lindo. E a pessoa trouxe esse argumento do ponzi e a linha de raciocinio basicamente era 1. Todo mundo espera valorizar e que no futuro alguém compre por mais caro.2. Se ninguém comprar, o ativo morre. Sempre que ouço esses argumentos, eu na verdade fico mei chocada.Porque qual investimento não querermosa propriedade 1.E qual negocio/mercado/loja sobrevive sem ter alguem que compre?O que eu mais acho estranho não é a galera estranhar BTC, mas o argumento do pessoal, que se voce usar, serve pra tudo no mundo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 16, 2023, 07:32:41 PM",
      "body": "Quote from: Disruptivas on September 16, 2023, 07:16:56 PMSempre que ouço esses argumentos, eu na verdade fico mei chocada.Porque qual investimento não querermosa propriedade 1.E qual negocio/mercado/loja sobrevive sem ter alguem que compre?O que eu mais acho estranho não é a galera estranhar BTC, mas o argumento do pessoal, que se voce usar, serve pra tudo no mundo Lembrei de um documentário que assiste uns dias atrás que falava sobre a morte dos \"deuses\" na mitologia grega. Sabe que existem alguns deuses que morreram na mitologia grega? Sabe por que eles morreram ? Foram esquecidos. Sabe a mítica história da guerra de Tróia? Sabe por qual motivo Aquiles quis lutar na guerra ? Se ele não fosse lutar, seu nome com o passar dos tempos seria esquecido. É assim que a vida funciona. Hoje estou \"mitológico\". Hahahaha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "September 16, 2023, 07:33:23 PM",
      "body": "Bem legal o site e direto ao ponto. É um bom lugar para procurar artigos para rebater temas batidos que já foram discutidos muitas vezes. Quote from: Disruptivas on September 16, 2023, 07:16:56 PMCara, essa semana uma pessoa me chamou pra um debate BTC vs Ouro, a pessoa queria me contar porque achava que o BTC era uma bosta e o ouro era lindo. E a pessoa trouxe esse argumento do ponzi e a linha de raciocinio basicamente era 1. Todo mundo espera valorizar e que no futuro alguém compre por mais caro.2. Se ninguém comprar, o ativo morre. Sempre que ouço esses argumentos, eu na verdade fico mei chocada.Porque qual investimento não querermosa propriedade 1.E qual negocio/mercado/loja sobrevive sem ter alguem que compre?O que eu mais acho estranho não é a galera estranhar BTC, mas o argumento do pessoal, que se voce usar, serve pra tudo no mundo Nesse sentido diamante também é um esquema ponzi... É basicamente carbono, em indústrias eles já usam diamante artificial. Se todo mundo resolver que não vale nada, pronto, não vale nada",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 17, 2023, 04:17:21 AM",
      "body": "Quote from: Disruptivas on September 16, 2023, 07:16:56 PMCara, essa semana uma pessoa me chamou pra um debate BTC vs Ouro, a pessoa queria me contar porque achava que o BTC era uma bosta e o ouro era lindo. E a pessoa trouxe esse argumento do ponzi e a linha de raciocinio basicamente era 1. Todo mundo espera valorizar e que no futuro alguém compre por mais caro.2. Se ninguém comprar, o ativo morre. Sempre que ouço esses argumentos, eu na verdade fico mei chocada.Porque qual investimento não querermosa propriedade 1.E qual negocio/mercado/loja sobrevive sem ter alguem que compre?O que eu mais acho estranho não é a galera estranhar BTC, mas o argumento do pessoal, que se voce usar, serve pra tudo no mundo Eu sinceramente entendo e até respeito quem diz isso.Acho que o argumento é que o Bitcoin seria SÓ ISSO. Se todo mundo só compra pra esperar valorizar, é uma pirâmide. Para esse pessoal o Bitcoin é inútil e não precisamos de uma moeda digital e descentralizada que gasta muita energia.Compramos ações de empresas e ouro também para valorizar e/ou proteger nosso patrimonio, porém uma ação representa o ownership ou dividendos de uma empresa e o ouro tem valor histórico, industrial, etc...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 17, 2023, 07:19:50 AM",
      "body": "Quote from: TryNinja on September 17, 2023, 04:17:21 AMAcho que o argumento é que o Bitcoin seria SÓ ISSO. Se todo mundo só compra pra esperar valorizar, é uma pirâmide. Para esse pessoal o Bitcoin é inútil e não precisamos de uma moeda digital e descentralizada que gasta muita energia.Por isso é que eu digo, que o bitcoin não é só para fazer hold, é para ser usado.Podemos fazer hold, mas tambem devemos gerar oportunidades para que seja usado como moeda de troca. Pois, só assim, é que damos utilidade a moeda para o dia a dia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "September 22, 2023, 10:41:55 AM",
      "body": "Também existe um sub Reddit dedicado tanto a trollar Bitcoin como a dizer mal e a desinformar shitcoiners e boomers e normies e por aí adiante. Eu andei lá alguns meses mas obviamente que acabei expulso a primeira vez que interagi naquele sub. Simplesmente não gostaram de ficar sem argumentos válidos e disseram que eu fui banido por tentar espalhar desinformação quando apenas falei da desvaloraziação de fiat através da impressão descontrolada de mais fiat, e pouco mais disse. Enfim... Os carneiros hão-de marrar um dia e pode ser que se lembrem. lolJá agora o sub Reddit chama-se r/Buttcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thiagothx1370",
      "created_time": "September 22, 2023, 02:58:21 PM",
      "body": "Quote from: alegotardo on September 15, 2023, 02:00:16 AMQuote from: joker_josue on September 14, 2023, 11:40:43 PMHoje encontrei um site bem interessante: End The FUDEste site, tem como objetivo de reunir artigos, para rebater ou contrapor, questões que muitos \"anti-bitcoin\" tem vindo a colocar. Artigos, que apresentam argumentos reais sobre o Bitcoin e todo o ecossistema que está envolvido.Vocês já conheciam este site?Eu ainda, não tive a oportunidade de analisar todos os artigos, ou todos os artigos listados. Mas, certamente será algo interessante de analisar.Vou analisar com mais detalhe, e depois irei trazer atenção os artigos que achar mais interessantes.Não conhecia, mas achei bastante \"interessante\" que a questão energética é o primeiro assunto que eles abordaram e ao mesmo tempo um dos que possuem a maior quantidade de artigos relacionados. Inegável que essa tem sido a principal alegação dos anti-bitcoiners no momento.A questão da volatilidade ainda é algo que eu não defenderia com unhas e dentes. Certamente vimos nessa última pandemia que existem outras \"moedas\" bem pior que o Bitcoin, mas ele também está longe ainda de ser considerado \"estável\" para se fazer um investimento seguro à curto e médio prazo.Por fim, eu coloqueio um sorizo largo no rosto que até minha esposa pergunto do que eu estava rindo.... quando cheguei no termo \"bolha\".Pôxa.... essa acusação ganhou força a uns 5 anos atrás, eu presenciei e me lembro bem dessa época, mas certamente é algo que ficou para trás. Espero que todos os FUD que ainda existem hoje também caiam por terra da mesma forma.Nao consigo entender essa necessidade de moeda ESTAVEL. A vida em si, não é ESTAVEL, nada na natureza é estavel. Mas os bovinos gadosos médios querem o tal do ESTAVEL que NAO EXISTE.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 22, 2023, 04:23:35 PM",
      "body": "Quote from: thiagothx1370 on September 22, 2023, 02:58:21 PMNao consigo entender essa necessidade de moeda ESTAVEL. A vida em si, não é ESTAVEL, nada na natureza é estavel. Mas os bovinos gadosos médios querem o tal do ESTAVEL que NAO EXISTE.Acho que existem conceitos aqui que precisam ser pensados com calma. Quando eu penso em ''moedas estáveis'' ou pelo menos, características de moedas que possam ser boas para uma economia/comunidade, acho que o aspecto não é NÃO TER qualquer volatilidade, acho que isso é impossível no final do dia e realmente não faz sentido pensar em termos de completa estabilidade. Mas toda a discussão que tivemos no tópico das flatcoins vai no sentido de uma moeda que consiga ser mais ou menos estável em relação ao poder de consumo da pessoa frente aos produtos de sua economia. Ou seja, uma moeda que não tenha uma tendencia clara de depreciação de valor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 22, 2023, 11:54:41 PM",
      "body": "Quote from: darkv0rt3x on September 22, 2023, 10:41:55 AMTambém existe um sub Reddit dedicado tanto a trollar Bitcoin como a dizer mal e a desinformar shitcoiners e boomers e normies e por aí adiante. Eu andei lá alguns meses mas obviamente que acabei expulso a primeira vez que interagi naquele sub. Para mim, é evitar essa gente!Costumo dizer:\"Não discutas com um \"burro\". Vais descer ao nível dele, e ele depois ganha-te em experiencia.\"Por isso, evito comentar essa gente ou ler o que eles dizem. Ok, posso ter uma ideia do que dizem, mas sem perder muito tempo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 23, 2023, 02:25:43 AM",
      "body": "Quote from: joker_josue on September 22, 2023, 11:54:41 PMPor isso, evito comentar essa gente ou ler o que eles dizem. Ok, posso ter uma ideia do que dizem, mas sem perder muito tempo.Te falar que eu tinha o passatempo de ler o subreddit do Buttcoin, rsrs... Acho importante saber o que o outro lado está dizendo. A melhor forma de defender a sua posição é entendendo os argumentos do outro lado para conseguir provar que ele está errado (se realmente estiver, claro).Antigamente a qualidade era aceitavel. Você tinha gente que só não concordava que o mundo precisa de uma moeda descentralizada, que o Bitcoin não é a \"escolhida\", que independente de qualquer coisa é uma pirâmide de especulação, etc... O problema é que a qualidade lá caiu de um jeito absurdo graças à popularização do Bitcoin nos últimos anos, tanto que nem acesso mais. Agora são mais jargões sobre como o Bitcoin é ruim por A mais B, só que de um jeito bem low quality.O sentimento também explodiu MUITO com a popularidade crescente dos NFTs. Nada que gere mais raiva para esse povo do que um jpeg que custe $1 milhão.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 23, 2023, 07:57:36 AM",
      "body": "Quote from: TryNinja on September 23, 2023, 02:25:43 AMQuote from: joker_josue on September 22, 2023, 11:54:41 PMPor isso, evito comentar essa gente ou ler o que eles dizem. Ok, posso ter uma ideia do que dizem, mas sem perder muito tempo.Te falar que eu tinha o passatempo de ler o subreddit do Buttcoin, rsrs... Acho importante saber o que o outro lado está dizendo. A melhor forma de defender a sua posição é entendendo os argumentos do outro lado para conseguir provar que ele está errado (se realmente estiver, claro).Sabe porque é que eu digo que não vale a pena perder muito tempo nesse raciocínio?Porque, para se poder argumentar e conseguir provar onde está errado, nas ideias que se tem, a pessoa tem de estar com mente aberta e disponível para ouvir, analisar, e querer entender. Coisas, que normalmente essas pessoas não estão dispostas. Então, para que ter esse esforço?Como nunca vamos querer obrigar ninguém, e cada um tem de fazer as suas escolhas, tentar argumentar com alguém que não quer mudar, não vale a pena.Agora, isso não quer dizer, que não se sabe o que estão dizendo. Mas, 5 minutos é mais do que suficiente (provavelmente nem é preciso tanto tempo) para perceber.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 24, 2023, 12:59:52 AM",
      "body": "Quote from: joker_josue on September 23, 2023, 07:57:36 AMSabe porque é que eu digo que não vale a pena perder muito tempo nesse raciocínio?Porque, para se poder argumentar e conseguir provar onde está errado, nas ideias que se tem, a pessoa tem de estar com mente aberta e disponível para ouvir, analisar, e querer entender. Coisas, que normalmente essas pessoas não estão dispostas. Então, para que ter esse esforço?Como nunca vamos querer obrigar ninguém, e cada um tem de fazer as suas escolhas, tentar argumentar com alguém que não quer mudar, não vale a pena.Agora, isso não quer dizer, que não se sabe o que estão dizendo. Mas, 5 minutos é mais do que suficiente (provavelmente nem é preciso tanto tempo) para perceber.De fato, mas mesmo assim eu gosto de fortalecer a minha enciclopedia mental de pontos a favor e pontos contrarios, até por que eles podem muito bem estar certos em um ponto ou outro, e aí até eu aprendo algo novo e mudo minha opinião. No Buttcoin eu só discuti com eles umas duas vezes, pois era um assunto que eles claramente desconheciam e o post estava 100% errado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "September 24, 2023, 12:05:27 PM",
      "body": "Quote from: joker_josue on September 22, 2023, 11:54:41 PMQuote from: darkv0rt3x on September 22, 2023, 10:41:55 AMTambém existe um sub Reddit dedicado tanto a trollar Bitcoin como a dizer mal e a desinformar shitcoiners e boomers e normies e por aí adiante. Eu andei lá alguns meses mas obviamente que acabei expulso a primeira vez que interagi naquele sub. Para mim, é evitar essa gente!Costumo dizer:\"Não discutas com um \"burro\". Vais descer ao nível dele, e ele depois ganha-te em experiencia.\"Por isso, evito comentar essa gente ou ler o que eles dizem. Ok, posso ter uma ideia do que dizem, mas sem perder muito tempo.Sim, claro. Eles fizeram-me esse favor. lol Quando me baniram, indirectamente evitaram que eu descesse ao nível daquela tralha para depois me \"vencerem\" em experiência.Mas do pouco que vi, os argumentos não passam daquilo mesmo e é sempre a mesma lenga-lenga.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thiagothx1370",
      "created_time": "September 25, 2023, 10:22:41 AM",
      "body": "Quote from: Disruptivas on September 22, 2023, 04:23:35 PMQuote from: thiagothx1370 on September 22, 2023, 02:58:21 PMNao consigo entender essa necessidade de moeda ESTAVEL. A vida em si, não é ESTAVEL, nada na natureza é estavel. Mas os bovinos gadosos médios querem o tal do ESTAVEL que NAO EXISTE.Acho que existem conceitos aqui que precisam ser pensados com calma. Quando eu penso em ''moedas estáveis'' ou pelo menos, características de moedas que possam ser boas para uma economia/comunidade, acho que o aspecto não é NÃO TER qualquer volatilidade, acho que isso é impossível no final do dia e realmente não faz sentido pensar em termos de completa estabilidade. Mas toda a discussão que tivemos no tópico das flatcoins vai no sentido de uma moeda que consiga ser mais ou menos estável em relação ao poder de consumo da pessoa frente aos produtos de sua economia. Ou seja, uma moeda que não tenha uma tendencia clara de depreciação de valor Muito bom. Para isso acontecer é só a moeda não ter um banco central, um fundador, um CEO e etc ... que no longo prazo, a moeda sera amplamente usada e a tal da \"estabilidade\" do poder de compra da moeda se realize. Isso é questão de tempo e conhecimento.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 25, 2023, 12:51:30 PM",
      "body": "Quote from: thiagothx1370 on September 25, 2023, 10:22:41 AMMuito bom. Para isso acontecer é só a moeda não ter um banco central, um fundador, um CEO e etc ... que no longo prazo, a moeda sera amplamente usada e a tal da \"estabilidade\" do poder de compra da moeda se realize. Isso é questão de tempo e conhecimento. Isso já existiu (apesar de ainda existir), mas caiu em desuso.Lembra do Ouro? As petita de ouro não tem fundador/CEO/banco central/etc. Chegaram a ser usadas como moeda de troca... mas com o tempo, deixou-se de usar.Motivo? Era preciso ter moedas cunhados pelo Estado para pagar impostos. E no fundo é isso que dita o valor do fiat, é aceite para pagar impostos. Então todos preferem usar esse tipo de moeda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}