{
  "id": "topic_5440515",
  "title": "mxfwzzwizqbz",
  "author": "mxfwzzwizqbz",
  "created_time": "February 20, 2023, 05:58:25 AM",
  "content": "Who is the owner of this bitcoin forum? Did Satoshi make this forum or was it a follower of his? Is there a reason why the website layout is \"retro\" and has stayed the same since the early 2010s? Not saying the layout is bad or anything I kinda like it ngl, it is a little bright though haha",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440515",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "February 20, 2023, 06:00:37 AM",
      "body": "The forum is created by satoshi and later, handed over to theymos. Now, it's owned by theymos, it's theymos's forum. The new forum software is in development mode for a quite long time and there's no certain time when we will have the new forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "February 20, 2023, 06:21:06 AM",
      "body": "I nearly had a stroke reading the title, such an authoritative tone for a teenager, that's my man, Michael 😉.I wonder what would be the answer if one were to ask who is the owner of America? Would the answer be; the president? Ask that from yourself, answer it to yourself honestly and you shall know.On the looks and layouts, we love it as is, old habits die hard, you know? Of course you shouldn't know you are just a nearly 16 years old boy(man).😀",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "February 20, 2023, 02:25:47 PM",
      "body": "Quote from: mxfwzzwizqbz on February 20, 2023, 05:58:25 AMWho is the owner of this bitcoin forum? Did Satoshi make this forum or was it a follower of his? Is there a reason why the website layout is \"retro\" and has stayed the same since the early 2010s? Not saying the layout is bad or anything I kinda like it ngl, it is a little bright though haha  The design of the forum is the default layout of the Simple Machines forum software, the software which the forum is based on. It has not been changed ever since the forum was established. I don't think it ever will be changed, even when the new forum software is done (I believe from what I have read that the two will run hand in hand/alongside each other, I could be wrong about this though).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "February 20, 2023, 02:50:31 PM",
      "body": "Quote from: mxfwzzwizqbz on February 20, 2023, 05:58:25 AM..it is a little bright though haha  Try different themes if you want there are, Dark Silver, Dark Purple.For dark theme, here are also a guide for that tricks. (GUIDE) How to easy change the appearance of Bitcointalk to dark (Dark Theme)?Dark theme - Simple TrickHow to easily change the bitcointalk.org skin and other SMF sites to dark themeThe forum is fine, just make it simple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "February 20, 2023, 02:53:00 PM",
      "body": "Quote from: mxfwzzwizqbz on February 20, 2023, 05:58:25 AMIs there a reason why the website layout is \"retro\" and has stayed the same since the early 2010s?To maintain the legacy. Just like \"once the version 0.1 of bitcoin was released, the core design was set in stone for the rest of its lifetime\". Quote from: mxfwzzwizqbz on February 20, 2023, 05:58:25 AM Not saying the layout is bad or anything I kinda like it ngl, it is a little bright though haha  There's a thread created about dark mode, you'll have to get some add-on extension in your chrome browser and you may access the site in dark mode as well.Thread link: Dark mode on bitcointalk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "February 20, 2023, 04:06:24 PM",
      "body": "Quote from: Little Mouse on February 20, 2023, 06:00:37 AMThe forum is created by satoshi and later, handed over to theymos. Now, it's owned by theymos, it's theymos's forum. The new forum software is in development mode for a quite long time and there's no certain time when we will have the new forum.Seems I won't be needing the new forum software anymore. There was when I was eager for it but it seems to me that this present interface we are using is the very best. I am used to it that the only thing I desire to get out of it is the dark mode. If the dark version can be launched I would be much ok with this forum appearance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}