{
  "id": "topic_5447088",
  "title": "fjl99",
  "author": "fjl99",
  "created_time": "April 01, 2023, 02:29:31 AM",
  "content": "​​关于2017年和2021年比特币牛市顶部形态和涨幅倍数的探讨       近两次比特币大牛市的顶点分别出现在2017年12月和2021年11月，时间上相差4年整，符合比特币每4年产出减半炒作的历史规律；      顶点价格分别为1.99万美元和6.9万美元，顶点价格相差倍数约3.5倍，较之前两个牛市顶点的价格倍数17倍大幅减小；      从k线形态看，2021年牛市明显呈现双头形态，比2017年牛市的单头形态更为复杂。      每4年产出减半的炒作规律本文不做探讨，仅作为一个设定，在此我们只探讨顶部k线形态，以及顶点价格倍数差形成的原因和逻辑，以便为我们在可能出现的2025年牛市顶部提供更多操作可能性。      我们都知道，越来越多的普通民众和投资机构在熟悉比特币，认可比特币，进而炒作比特币，但入场资金没法量化只能估算，每四年入场操盘资金呈几何级数增长应该是不争的事实。根据CMC的数据：比特币在2013年11月峰值市值是136亿美元，2017年4月峰值市值是3200亿美元，2021年11月峰值市值是1.24万亿美元，在资本市场，当炒作标的市值不大的时候，其炒作手法一般出现一波流的现象，当炒作标的市值增长一个或数个数量级时，炒作所需资金量就会相应增长一个或数个数量级，特别之处在于，随着介入人数和资金量的大增，市场中各方力量对市场的看法和分歧会远远大于之前。按照这个逻辑，我们可以推断：2021年牛市顶部的双头形态就是在上述情形下形成的。      2021年4月14日，经过连续6个多月的拉升，比特币价格形成第一个头部（左峰）65000美元，拉升幅度6倍左右，如果从312疫情大跌的底部算起，绝对涨幅接近17倍（65000/3900）；此时市场各方力量对后期走势出现严重分歧，市值排名前30的币种中BNB/XRP/DOGE/LTC/TRX/UNI/LINK等币种主力退出战场，使得这些币种的牛市价格顶点定格在4月中旬；而以比特币以太坊为代表的币种主力勇当大任，经过近7个月的洗盘和拉升，于11月9日创出第二个头部（右峰）69000美元。在这期间跟随BTC/ETH再创新高的大市值币种有ADA/MATIC/SOL/DOT/SHIB/AVAX/ATOM/FTM，而这些强势品种所占市场份额远小于4月份见顶的那批，说明在2021年下半年里市场资金相对于2017年匮乏，11月份的这波见顶走势是强弩之末，包括比特币和以太坊。      形态上看2021年牛市头部形态复杂程度超过2017年的单顶模式，这就导致大批市场老手判断失误，包括江x儿等人。根据两次牛市头部形态形成的逻辑推理，2025年牛市顶部形态将更加复杂，大家在资本市场掘金真不是一件容易的事情。      随着炒作标的体量的大增，其价格弹性将大大减弱，也就是价格的涨跌幅度将大大减弱。因为体量即市值增加后，之前推动价格上涨的资金量不足以推动价格再次上涨相同的幅度，要想有相同的涨幅，就必须保证推动资金及时且足额的入场，不能足额或不能及时都不能达到目标，而在一定时间内，这两个条件同时满足的可能性不一定是100%，这就是导致行情走势呈现涨涨跌跌起起伏伏的原因，同时导致价格弹性减弱。      从历史数据看，比特币价格2013年与之前牛市顶点价格相差倍数是36倍（1163/32）；2013年与2017年相差倍数是17倍（19900/1163）；2021年与2017年相差倍数是3.5倍（69000/19900），随着比特币每次大牛市体量呈几何级数增长，入场资金未见得同步及时增长，或者增长了但介于单个比特币价格的“高昂”，迫使部分资金介入其他币种，比特币的价格弹性在逐渐减弱，根据上述逻辑，2025年与2021年的比特币牛市顶点价格相差倍数不会高于3.5倍，简单取中值的话是1.75倍，也就是12万美元，取2倍整数的话是13.8万美元，取3倍整数的话是20.7万美元。      以上均为事后分析，纯属一个区块链拥趸的个人观察，难免有主观臆断，望指正探讨。下篇我将略过2018年和2022年比特币价格下跌形态，探讨2019年和2023年比特币底部价格形态。谢谢大家。敬请关注推特 @863961613 2023.2.17风季灵​​​​发布于 四川",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447088",
  "comments": [
    {
      "author": "wuqing78",
      "created_time": "April 19, 2023, 06:26:55 AM",
      "body": "我猜也差不多吧，感觉2025年破个10万刀可能就差不多到顶了。",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}