{
  "id": "topic_5411940",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "August 31, 2022, 11:18:49 PM",
  "content": "QuoteThe U.S. Supreme Court has lately polarized Americans with controversial verdicts on abortion, guns, climate change and more. Another case on its docket, by contrast, will get intense scrutiny mainly from millions of Americans living abroad. Alexandru Bittner v. United States is about some of the tax and compliance rules the U.S. slaps on its own expats. These can be so draconian as to amount to criminalizing the sheer act of living outside the U.S. Bittner is a businessman and a dual citizen of the U.S. and Romania. He used to live and work in Romania and, naturally, had to open financial accounts there. What he apparently didn’t know—many expats don’t—is that he had to declare all these accounts every year to the U.S. Treasury’s Financial Crimes Enforcement Network, on a form colloquially known as the FBAR.All parties in the case agree that Bittner’s failure to make timely and proper disclosures was “non-willful,” meaning unintentional. Even so, the penalties are stiff. One appeals court assessed his fine at $50,000, or $10,000 for each of the five years in which the FBAR was omitted. Another court put the punishment at $2.72 million, or $10,000 for each account that should have been on each FBAR, each year.The first amount is painful, the second ruinous—and, frankly, insane. The Supreme Court now has to decide which is lawful.This question mark about penalties is one of many ambiguities about FBARs. But even FBARs are just the tip of the iceberg.Americans abroad suffer a long list of indignities in trying to comply with U.S. laws. Most of them don’t owe the IRS any actual tax (because they usually pay at higher rates to their host countries, and subtract those amounts from their American liabilities). But they must still fill out incomprehensible forms demanding information that’s often unavailable or ambiguous—at great cost of time, worry and money. Some expats, for example, find themselves owning plain-vanilla mutual funds registered in their host country—employers sometimes put such investments into occupational retirement schemes by default. To the IRS, these are PFICs, or “passive foreign investment companies”—a synonym for toxic. The resulting paperwork is considered the most complex in the entire American tax code, and the taxation tantamount to confiscation. Depending on what an American expat does next, there’s more misery to come. If she marries a “foreigner” (the reason why many Americans move overseas in the first place), she may face nightmares about joint accounts, inheritance and more, even before considering any children. More punishment awaits those who own a foreign business or do pretty much anything interesting.U.S. expats may also struggle to open—or keep open—financial accounts abroad. Foreign banks and brokers must report on “U.S. persons” (citizens or Green Card holders) to the U.S. Rather than run the risk of American retaliation for errors and omissions, many financial institutions prefer to have no American customers at all. This particular problem is a consequence of the Foreign Account Tax Compliance Act (FATCA), notorious Obama-era legislation that has upended the lives of many U.S. expats.But the original reason for the entire hairball of complexity is the peculiar American way of taxation, which is in effect unique in the world (only Eritrea has something vaguely similar). That approach is called citizenship-based taxation (CBT). It means that a person’s passport or Green Card, not the place of residence, determines tax status and liability. The unintended consequences are legion. One is to snare “accidental Americans” in the nets of the IRS and FinCEN. These are people who—usually because their parents happened to be in the U.S. when they were born—have U.S. citizenship but otherwise no connection to America. One day, they may receive a letter informing them of bureaucratic torment on a scale that would impress Franz Kafka. This (largely coincidental) intertwining of citizenship law and tax law over the decades has made the U.S. unique. All countries want to crack down on tax cheats who hide money in offshore accounts—that’s why ever more governments are agreeing to share financial information with one another. But only the U.S. hits millions of expats who have modest assets and little clue every time it targets rich and sophisticated tax dodgers living stateside. In a sign of growing desperation, a guerrilla insurgency of litigation is now forming from Canada to Israel to Europe. In the U.K., a woman named Jenny Webster, American-born but British, has been taking the British authorities to court for sharing her financial information with the U.S., arguing that this amounts to violations of her data privacy. In France, Fabien Lehagre, born in the U.S. but French by upbringing, founded the Association of Accidental Americans. He’s got legal cases under way in several countries. With his input, France’s National Assembly recently passed a measure that would make its government stop sending people’s financial data to the U.S. in accord with FATCA, unless the U.S. reciprocates by sending information about French taxpayers in return. But the bill was nixed in the French Senate.In the Netherlands, a court recently prohibited a local bank from closing the accounts of Accidental Americans in the country. And the European Parliament sent a delegation to Washington, DC, to discuss the problems caused by FATCA.But all these efforts only treat the symptoms of the underlying aberration, which is citizenship-based taxation. So another group of lawyers—including Marc Zell, an Israeli-American, and John Richardson, a Canadian-American—wants to challenge the constitutionality of CBT as such, at least in its current form. They’re now building their case.There are lots of reasons why people born in the U.S. at some point find themselves living abroad. It shouldn’t be U.S. government policy, even implicitly, to make such lives unnecessarily difficult. America must treat all its citizens equally, whether they live at home or overseas.The nine robed justices now have an opportunity to send the first small sign that they got that message. Alexandru Bittner shouldn’t be financially ruined just because he made unintentional errors while he lived abroad. Nor should any other American—or indeed anybody at all.https://www.bloomberg.com/opinion/articles/2022-08-26/supreme-court-decides-how-to-punish-us-expats-with-overseas-taxes....Here we have interesting commentary on the trend of americans living abroad in foreign countries, in an effort to reduce living costs. Americans have been flocking to places like puerto rico to enjoy the benefits of paying 4% income taxes. Some americans renounced US citizenship. While others retain citizenship in the USA. I have heard it costs around $1,000 to renounce US citizenship. While purchasing citizenship in places like vanuatu can cost more than $100,000. A price which many would happily pay as it comes with no taxation or financial reporting.Apparently there are also some who were born in the united states, who did not remain in the country for very long. Who now live in foreign countries. They call themselves \"accidental americans\" and can be prone to high taxes, fees and financial reporting standards even though they have never spent much time in the country. It seems as if the world is becoming crazier everyday. We are only witnessing the initial stages of it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411940",
  "comments": [
    {
      "author": "odolvlobo",
      "created_time": "September 01, 2022, 05:12:27 AM",
      "body": "Quote from: Hydrogen on August 31, 2022, 11:18:49 PMHere we have interesting commentary on the trend of americans living abroad in foreign countries, in an effort to reduce living costs. Americans have been flocking to places like puerto rico to enjoy the benefits of paying 4% income taxes.It's not clear, but it appears that you have a misconception shared by many Americans. Puerto Rico is not a \"foreign country\". Puerto Rico is part of the United States.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 01, 2022, 11:19:32 AM",
      "body": "Tax control is being strengthened in all countries of the world. The introduction of CBDC will make it even easier to control the accounts of citizens and organizations. In 5 years tax control will be even tougher.Fed Plans 2023 Launch of Long-Anticipated Faster Payments Systemhttps://www.wsj.com/articles/fed-plans-2023-launch-of-long-anticipated-faster-payments-system-11661778001",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "September 01, 2022, 12:34:34 PM",
      "body": "Interesting, I think one of the best ways to solve the citizenship-based taxation problem is to understand why it was created in the first place... were the creators trying to treat Americans as properties/slaves who are obligated to be taxed for the benefit of their slave owners, or is this due to the need to have Americans taxed in order to fund the rights the citizens are entitled to? If the latter is the case, there could be laws created to exclude those I call Independent Citizens... they are people who are completely independent of any of such entitlement without losing their citizenship... meaning they would be responsible for themselves 100%, so that it won't be necessary for America to support them in times of need.In regards to citizens being considered properties that should be taxed, I think true freedom from such via renunciation of citizenship may help but who do you run to when American still controls other nations and could influence their tax laws to get back at you. Only guarantee way to be free is to renounce and become a child of the LANDLORD of this World in order to own the World with HIM and never be deprived of the right of moving into any of the LANDLORD's property",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 01, 2022, 02:32:29 PM",
      "body": "Quote from: Hydrogen on August 31, 2022, 11:18:49 PMBittner is a businessman and a dual citizen of the U.S. and Romania. He used to live and work in Romania and, naturally, had to open financial accounts there. What he apparently didn’t know—many expats don’t—is that he had to declare all these accounts every year to the U.S. Treasury’s Financial Crimes Enforcement Network, on a form colloquially known as the FBAR.How the hell Bitnner was an American expat living in Romania when he was born there?He is a Romanian citizen with dual citizenship residing in the country where he was born, where he lived most of his life and he got the US citizenship just to help him with his business which by Romanian news was beyond shady, he was accused of quite the fraud.https://www.romania-insider.com/former-minister-local-businessmen-plead-guilty-in-microsoft-licenses-case-describe-corruption-ringQuoteLocal businessman Nicolae Dumitru, who is best known as the owner of the Niro group, also admitted his guilt in court. He was involved in a previous deal or IT licenses, which had been signed by the Adrian Nastase Government. Dumitru said he paid Serban Mihailescu, the Secretary General in Nastase’s cabinet, USD 800,000 to push the deal. He also said he paid Alexandru Bittner, a well-known fixer, who was well connected to the Government, USD 3.8 million to exert his influence upon the Government and help close the contract.Second, let's look a bit at the details:QuoteThe Internal Revenue Service concluded that Bittner violated the law 272 times, once for each account that was not reported in each of those five years. Bittner says he violated the law at most five times, once for each annual report he failed to file.So the \"poor\" expat had how many account accounts? Summoning NeuroticFish on this one   and I'm pretty sure he will have to say few nice words about this shady \"businessman\".But again, this is not about expats, this guy is not an expat so the whole thing is just wrong from the start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 01, 2022, 03:20:32 PM",
      "body": "Quote from: stompix on September 01, 2022, 02:32:29 PMSummoning NeuroticFish on this one   and I'm pretty sure he will have to say few nice words about this shady \"businessman\".It's just yet another typical Romanian \"wild west\" so-called businessman. He has paid politicians, made contacts, made a fortune leeching taxpayers' money (and giving parts of that back to the politicians) without doing much. I'm so sick and tired of the them (and the huge number of them too) I no longer keep track of them.So I had to look up who this guy is. It's one of the \"close relatives\" of an ex-prime minister that was so \"nice and clean\" he has already done prison time too. There are stories that this prime minister has ruined the industry of the town I was born simply because he didn't get the bribe he was expecting. Well, I guess this \"businessman\" has remained close friend because he was able to deliver.If you read the end of this newspaper translated with Google, he is still receiving money from the government, most probably for contracts poorly made long ago, to favor him.I will add that afaik everybody who has US citizenship is liable for taxes or at least the difference if he has paid lower taxes in another country. Maybe this is the case?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}