{
  "id": "topic_5462584",
  "title": "sagar11003",
  "author": "sagar11003",
  "created_time": "August 08, 2023, 11:24:30 PM",
  "content": "Astropay is giving withdrawals from BET365, Soon they will be as popular as Skrill,Neteller.Because BET365 is the most popular gaming site in the world. You can withdraw Astropay to USDT, BTC, Ethereum from their site. And I have enough Astropay, So if your country just supports Astropay withdrawals from their own site please knock me back. Unfortunately for my country's restrictions I can not withdraw from Astropay apps. Therefore, If anyone need Astropay i can Exchange it USDT. And you will get 5% extra for that.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462584",
  "comments": [
    {
      "author": "shasan",
      "created_time": "August 09, 2023, 01:21:14 AM",
      "body": "From the title, I thought it will be an announcement thread by the company but once I open the link I came to know the name is not matched and while I tried to read the post then it make me clear that it is nothing but a currency exchange post. You could give the title as \"WTS Astory and WTB USDT/BTC etc\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "August 09, 2023, 07:09:28 AM",
      "body": "I don't understand what you are trying to achieve. You don't look like someone from Astropay. I have heard about this payment method long ago. They are not going to hire someone who does not have any experience with a platform. @sagar11003, Can you confirm you connection with Astropay?Quote from: shasan on August 09, 2023, 01:21:14 AMFrom the title, I thought it will be an announcement thread by the company but once I open the link I came to know the name is not matched and while I tried to read the post then it make me clear that it is nothing but a currency exchange post. You could give the title as \"WTS Astory and WTB USDT/BTC etc\".I got the entire thing wrong LOL.The way OP started, it looked like he was advertising Astropay. On these last two lines at the last paragraph make sense. I have to say first time I saw an exchange advertising with a good introduction about the company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "August 09, 2023, 06:58:44 PM",
      "body": "Quote from: BitcoinGirl.Club on August 09, 2023, 07:09:28 AMI don't understand what you are trying to achieve. You don't look like someone from Astropay. I have heard about this payment method long ago. They are not going to hire someone who does not have any experience with a platform. @sagar11003, Can you confirm you connection with Astropay?Quote from: shasan on August 09, 2023, 01:21:14 AMFrom the title, I thought it will be an announcement thread by the company but once I open the link I came to know the name is not matched and while I tried to read the post then it make me clear that it is nothing but a currency exchange post. You could give the title as \"WTS Astory and WTB USDT/BTC etc\".I got the entire thing wrong LOL.The way OP started, it looked like he was advertising Astropay. On these last two lines at the last paragraph make sense. I have to say first time I saw an exchange advertising with a good introduction about the company.Based on the first para you (the first time) were at the same point as me as I was at the beginning but at the later point you have understand the fact as I have understood. We both are on the same point of view regarding the op.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "August 10, 2023, 06:10:42 AM",
      "body": "Astropay exists for years and they haven't gained popularity.As from my own experience, I wouldn't suggest using at all. They are used by scammers to make stolen funds disappear. Their security department is an utter joke as well.Short story, 3 years ago my Neteller account was hacked and funds were sent to Astropay. I contacted both via phone minutes after this happened and both sites didn't bother to help in any way. Neteller even closed my account after 4 weeks because they didn't care to handle the situation, so ridiculous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whitegold22",
      "created_time": "August 10, 2023, 11:12:53 AM",
      "body": "Oo drop your telegram",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "August 10, 2023, 01:04:27 PM",
      "body": "Quote from: AHOYBRAUSE on August 10, 2023, 06:10:42 AMShort story, 3 years ago my Neteller account was hacked and funds were sent to Astropay. I contacted both via phone minutes after this happened and both sites didn't bother to help in any way. Neteller even closed my account after 4 weeks because they didn't care to handle the situation, so ridiculous.Isn't it true for most of the online wallet companies including Paypal and few other very popular ones? I used to use Paypal including some of those other wallets like SolidTrustPay, and few more I can not remember the names. These companies do not care about the hardship of their clients when the clients need them for resolving any issue.Thank God Bitcoin is here now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "August 10, 2023, 02:03:35 PM",
      "body": "There might be a huge problem with withdrawing money from Astropay. For example, I just checked BestChange to see if there is any exchanger offering USDT in exchange for Astropay USD and there isn't any at all!I also tried to check from Astropay USD to a random number of cryptocurrencies and digital currencies and still nothing. So I think it's best to avoid Astropay unless one has no choice at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sagar11003",
      "created_time": "August 12, 2023, 04:52:31 PM",
      "body": "Quote from: BitcoinGirl.Club on August 09, 2023, 07:09:28 AMI don't understand what you are trying to achieve. You don't look like someone from Astropay. I have heard about this payment method long ago. They are not going to hire someone who does not have any experience with a platform. @sagar11003, Can you confirm you connection with Astropay?Quote from: shasan on August 09, 2023, 01:21:14 AMFrom the title, I thought it will be an announcement thread by the company but once I open the link I came to know the name is not matched and while I tried to read the post then it make me clear that it is nothing but a currency exchange post. You could give the title as \"WTS Astory and WTB USDT/BTC etc\".I got the entire thing wrong LOL.The way OP started, it looked like he was advertising Astropay. On these last two lines at the last paragraph make sense. I have to say first time I saw an exchange advertising with a good introduction about the company. Most of us do not know what is Astropay so i had to make such kind of introduction. Beside that i have some influence on Astropay because of my reseller service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}