{
  "id": "topic_5503729",
  "title": "ContentWriter",
  "author": "ContentWriter",
  "created_time": "July 22, 2024, 04:54:03 AM",
  "content": "That's 4.3% if Bitcoin total supply...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5503729",
  "comments": [
    {
      "author": "_act_",
      "created_time": "July 22, 2024, 02:02:01 PM",
      "body": "Bitcoin ETF are not bitcoin but a token backed by bitcoin price in the spot market. That is why some people are going for it. But I can not go for something like that. I prefer to have bitcoin instead. Bitcoin ETF was approved in United States early this year and it is having a marketcap of almost $1 billion. Although that is a good news but I can not go for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 23, 2024, 01:45:38 AM",
      "body": "Quote from: _act_ on July 22, 2024, 02:02:01 PMBitcoin ETF are not bitcoin but a token backed by bitcoin price in the spot market. That is why some people are going for it. I wouldn't buy anything other than Bitcoin, spot ETF or otherwise. And those who went for ETFs went even before spots were launched.However, I believe the reason they're going for it is mostly tax-related. e.g., and I could be wrong, in the US, anyway, these are easily bought with IRA funds and therefore tax-advantaged. In other countries, depending on how they classify Bitcoin, an ETF could be a way to only pay straightforward and simple capital gains on ETF profits as opposed to potentially higher taxation on Bitcoin itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Not your key not your BTC",
      "created_time": "July 23, 2024, 01:52:43 AM",
      "body": "this may create the hype but not very when compare it with real bitcoin as elsavador have",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "July 23, 2024, 02:34:03 AM",
      "body": "Quote from: _act_ on July 22, 2024, 02:02:01 PMBitcoin ETF are not bitcoin but a token backed by bitcoin price in the spot market. That is why some people are going for it. But I can not go for something like that. I prefer to have bitcoin instead. Bitcoin ETF was approved in United States early this year and it is having a marketcap of almost $1 billion. Although that is a good news but I can not go for it.You are smart my friend and this is more reason why those who are fully informed about Bitcoin are better. Bitcoin is a system of its own that is accessible and manageable to anyone, and it can even protect the interest of the HODLer than the ETF package itself which is just an \"I Owe You\" arrangement. This is a way to further decentralise Bitcoin under a guise, and imagine, if any of the ETF companies go bankrupt today, you will always have access to your Bitcoin since you never relied on them. But that can't be said of those who relied on them, they may wait for years before they have access to their funds (that's if they will ever recover it).Some people would have even died waiting, which makes it so discouraging to me. It is not entirely bad though as it will increase BTC investment, but the ETF was meant to make accessible assets that were not accessible to ordinary people. Just like Crude oil and digital Gold, you can't just wake up in the morning and have access to them as we do with our various Bitcoin wallets. If we have that asset already, what do we need ETF for? It's just like having access to operate your Bitcoin bank yourself but preferring others to do that for you, not even minding the extra charges the ETF will attract.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "July 23, 2024, 03:01:59 AM",
      "body": "Quote from: _act_ on July 22, 2024, 02:02:01 PMBitcoin ETF are not bitcoin but a token backed by bitcoin price in the spot market. That is why some people are going for it. But I can not go for something like that. I prefer to have bitcoin instead.The companies have to raise money from investors and use it to buy bitcoin, real bitcoin as you wrote. Investors don't actually own bitcoin is another different story when they don't want to be their own custodians and own private keys.The point for discussion is Bitcoin Spot ETFs have brought massive money to Bitcoin market and they actually have been buying bitcoin from OTC to Spot markets.QuoteBitcoin ETF was approved in United States early this year and it is having a marketcap of almost $1 billion. Although that is a good news but I can not go for it.When Bitcoin Spot ETFs have to buy mostly on Spot market, price impact will be bigger than what they have done so far mainly through OTC market.Its market cap is 1.333T now, bigger than Meta and only a little bit lower than Silver.https://companiesmarketcap.com/assets-by-market-cap/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}