{
  "id": "topic_5503517",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "July 19, 2024, 05:09:37 PM",
  "content": "...but not Bitcoin!https://techcrunch.com/2024/07/19/what-we-know-about-crowdstrikes-update-fail-thats-causing-global-outages-and-travel-chaos/QuoteA faulty software update issued by security giant CrowdStrike has resulted in a massive overnight outage that’s affected Windows computers around the world, disrupting businesses, airports, train stations, banks, broadcasters and the healthcare sector.CrowdStrike said the outage was not caused by a cyberattack, but was the result of a “defect” in a software update for its flagship security product, Falcon Sensor. The defect caused any Windows computers that Falcon is installed on to crash without fully loading.“The issue has been identified, isolated and a fix has been deployed,” said CrowdStrike in a statement on Friday. Some businesses and organizations are beginning to recover, but many expect the outages to drag on into the weekend or next week given the complexity of the fix. CrowdStrike CEO George Kurtz told NBC News that it may take “some time for some systems that just automatically won’t recover.” In a later tweet, Kurtz apologized for the disruption.Bitcoin never takes a break. Its architecture prevents someone from faulting millions of nodes worldwide. It also resists bugs like the one CrowdStrike just made on Windows. And even if some Bitcoin developer were to accidentally introduce a bug into Core, nobody is obligated to run the latest version of it so it will not even bring down their node.Free PR for crypto!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5503517",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "July 19, 2024, 05:15:31 PM",
      "body": "Quote from: NotATether on July 19, 2024, 05:09:37 PM...but not Bitcoin!Bitcoin network is far advanced and different from the other centralized services which are being regulated  by government, this is not their first time of failure in network, one thing that we have all been benefiting from bitcoin is a steady consistency, which we cannot have the assurance of both all the listed institutions listed from above, this is why we need to identify the importance of what bitcoin has come to serve us with in or a decentralized network, because if never for once had a network failure as with other systems and networks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 19, 2024, 11:58:46 PM",
      "body": "And not just the CrowdStrike incident.I always happen to see people suffer due to outages in their banking systems where they are not able to transfer funds, pay bills or withdraw while the technical team is \"working around the clock\" to restore the system back to normal  Sometimes I feel pity for them, other times I don't because they just choose to be ignorant and stubborn towards adopting far much better options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "July 20, 2024, 03:11:49 AM",
      "body": "This is exactly the reason that centralization and consolidation of our network infrastructure is not a good idea in the long run.In my estimation, it only makes sense if all you care about is to save cost and make money, it's very bad for world wide computer systems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverCryptoBullet",
      "created_time": "July 20, 2024, 04:04:11 AM",
      "body": "Quote from: NotATether on July 19, 2024, 05:09:37 PMBitcoin never takes a break. Its architecture prevents someone from faulting millions of nodes worldwide. It also resists bugs like the one CrowdStrike just made on Windows. And even if some Bitcoin developer were to accidentally introduce a bug into Core, nobody is obligated to run the latest version of it so it will not even bring down their node.Bitcoin only takes a break if all Internet supplies and connections are down.The bottom line is not only a temporary break that is nearly impossible with decentralized Bitcoin network, but it's more important and worth to note that Bitcoin blockchain is stored in many Bitcoin nodes, especially full nodes, then prune nodes. It has a decentralized and more secure database storage rather than other things like the example, database can be lost if the data hosting service has problems.With Bitcoin, nearly no temporary break except if there is global issue for electricity supply and Internet connection supply. Blockchain data is a most secure one on Earth.QuoteFree PR for crypto!It's free PR for Bitcoin!Altcoins can stop by the founder, core developer or government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "July 20, 2024, 04:07:51 AM",
      "body": "So bizarre. The outage even affected my ability to transfer funds between e-cash accounts. Was wondering what was going on when I got a message saying my account \"could not be found.\"As was astutely pointed out by OP, decentralization certainly has its benefits; especially when it comes to something as crucial as personal finances. Perhaps we'll see BTC used in more P2P business transactions in light of yesterday's events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "July 20, 2024, 04:08:11 AM",
      "body": "Bitcoin is one example of how a decentralized system is quite good compared to a centralized system. Just look at how when this Crowdsrike case happened, it paralyzed important services all over the world, in my country alone there were lots of flights pending due to errors in their system and this created chaos at the airport. That's just one thing, what if several other important companies experienced similar problems, we can imagine how massive the chaos would be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "July 20, 2024, 04:17:36 AM",
      "body": "I think it is unfair to compare it to Bitcoin, or generally the benefits of decentralization because it would be an apple-to-orange comparison.Firstly, this issue should have never happened, whether it concerns CrowdStrike, Apple or any centralized services. Updates that can obviously crash critical infrastructure should not have made it past QA, let alone been pushed. Likely poor CI/CD practices and this is an internal problem for them to solve. OTA updates are a necessity for enterprises because it is difficult for critical patches to be made manually by the millions of computers running it. Bugs have surfaced in Bitcoin as well and we're lucky that it was mostly handled swiftly and efficiently.Secondly, this is an enterprise software and it probably can't be decentralized or open source. They have contracts and agreements with the various companies for providing services. Having an open codebase does nothing good for a security company to say the least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 20, 2024, 04:20:03 AM",
      "body": "Quote from: NotATether on July 19, 2024, 05:09:37 PMBitcoin never takes a break. Its architecture prevents someone from faulting millions of nodes worldwide. It also resists bugs like the one CrowdStrike just made on Windows. And even if some Bitcoin developer were to accidentally introduce a bug into Core, nobody is obligated to run the latest version of it so it will not even bring down their node.If Bitcoin Core is updated, isn't it obligatory for all nodes to update their Core to the new version? Or can it still work on the old version without problems? Is upgrading optional?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 20, 2024, 04:23:49 AMLast edit: July 20, 2024, 05:02:51 AM by franky1",
      "body": "bitcoins is reliant on core these days, which means there is increased risk of a incident of global bitcoin bug..this is why we NEED to decentralise the node choices and decentralise whom the protocol changes are decided byhaving the blockchain decentralised is not enough.. a decentralised blockchain is not the same as the current reality that we have a centralised powerhouse deciding on the protocol which controls what new blocks data should be like, what the rules should be.an analogy is although there are global computers all of which have their own files, they are all controlled by running windows(core) as the OS(protocol) so if there is a bug in windows(core) they all get affectedwe need to get devs to separate themselves from core and have different brands of full nodes wrote in different ways/languages come to a consensus of the main ruleset.. that then decide on which best rules apply and agree to a consensus of rules but have their own code to conform to the rules via different coding methods whereby if one had a bug other wont have the same bugand no i am not talking about lite client software. im talking about full nodes being decentralised produced. whereby many teams many brands come to a consensus of rules to evade a single powerhouse changing code and causing a bug overall",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "July 20, 2024, 08:56:42 AM",
      "body": "Quote from: Davidvictorson on July 20, 2024, 03:11:49 AMThis is exactly the reason that centralization and consolidation of our network infrastructure is not a good idea in the long run.In my estimation, it only makes sense if all you care about is to save cost and make money, it's very bad for world wide computer systems.Is decentralization possible for everything? In this accident, a software update for Falcon had malfunctioned and caused a crash on Windows computers. I don't know what kind of decentralization Falkon could have to avoid the issue or probably the users of Falcon. Yeah, Bitcoin is decentralized but there is a difference, I think we can't compare this accident to the decentralization of Bitcoin because it's comparing apples to oranges.Quote from: yhiaali3 on July 20, 2024, 04:20:03 AMIf Bitcoin Core is updated, isn't it obligatory for all nodes to update their Core to the new version? Or can it still work on the old version without problems? Is upgrading optional?You are not forced to update the Core to the latest version. Many people still use outdated client software these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 20, 2024, 09:02:25 AM",
      "body": "That was a major failure, even though CrowdStrike has identified the issue pretty fast. The article notes that it doesn't mean that everything was fixed because customers need to take steps themselves if their devices were affected. So far, it seems credible that it was not a cyberattack, and that is reassuring.As for Bitcoin, it wasn't impacted, but neither were any devices using Linux, of instance. My point is that it's now exactly about Bitcoin, but the point about development and decentralization that the op is making about Bitcoin is totally fair. So I'd say it's free PR for open-source code and for decentralization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "July 20, 2024, 09:03:40 AM",
      "body": "Quote from: yhiaali3 on July 20, 2024, 04:20:03 AMIf Bitcoin Core is updated, isn't it obligatory for all nodes to update their Core to the new version? Or can it still work on the old version without problems? Is upgrading optional?There are different tiers of updates and they can be a mandatory, or an optional update. However, that would not be the main reason to dissuade users from updating immediately.Bitcoin Core goes through multiple iterations of release candidates with multiple unit and functional test cases built in during the compilation phase. This sort of errors would've been caught before merging and they should not be present in the stable releases. Other than that, enterprise systems requires computers to be able to receive OTA updates and have them done automatically. If not, you would have the IT dept running around to update every computer for every minor update.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "July 20, 2024, 09:09:02 AM",
      "body": "That's a lot of damage made by Crowdstrike and the BSOD that have affected the global operations of most companies that are into it, really damaging. Quote from: NotATether on July 19, 2024, 05:09:37 PMBitcoin never takes a break.They will never understand this and even with that, they'd throw some argument about it and ask a question what if the internet is down? They don't realize that the entirety of everything that's reliant on the internet will be down as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "July 20, 2024, 09:41:16 AM",
      "body": "Although I understand what you're saying, I don't think it's fair to compare it with Bitcoin or blockchain technology in general. The blockchain technology is magnificent, and perhaps someday it could be integrated into our lives for the better. Not just with cryptocurrencies, but with everything connected to the internet, it's fair to assume that no option is 100% foolproof and safe. The most important lesson from the CrowdStrike incident is that a regular citizen is never protected. Everything started falling apart; chaos ensued in airports and hospitals, but no one was going to be compensated because it was a security issue outside their hands. In the end, it's always us who take the beating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "July 20, 2024, 02:08:39 PM",
      "body": "I was (not) shocked to see that Crowdstrike is one of the partners of WEF... that must be just a ''coincidence'', since they announced cyber attacks few years ago.And you can clearly see on their pages that all they are doing is cyberattack response services, cyberattack investigations, etc.This event was not an accident.Meanwhile, Bitcoin uptime is 99.989% and last downtime was 4149 days ago!https://bitcoinuptime.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 20, 2024, 02:19:06 PM",
      "body": "They serve different needs though. Bitcoin is not a replacement for airlines or hospitals. You can’t run airlines on the blockchain. It is because people make mistakes, shit happens, flights get delayed or even cancelled, pilots get sick etcBitcoin is doing alright but it is not going to replace credit cards/banking let’s be honest, so your examples don’t really mean much in the real world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legendbtc",
      "created_time": "July 20, 2024, 03:26:06 PM",
      "body": "Quote from: ranochigo on July 20, 2024, 04:17:36 AMI think it is unfair to compare it to Bitcoin, or generally the benefits of decentralization because it would be an apple-to-orange comparison.Firstly, this issue should have never happened, whether it concerns CrowdStrike, Apple or any centralized services. Updates that can obviously crash critical infrastructure should not have made it past QA, let alone been pushed. Likely poor CI/CD practices and this is an internal problem for them to solve. OTA updates are a necessity for enterprises because it is difficult for critical patches to be made manually by the millions of computers running it. Bugs have surfaced in Bitcoin as well and we're lucky that it was mostly handled swiftly and efficiently.Secondly, this is an enterprise software and it probably can't be decentralized or open source. They have contracts and agreements with the various companies for providing services. Having an open codebase does nothing good for a security company to say the least.Thank you for giving the fairest review. I also heard this news yesterday and many people on social network X also started mocking Microsoft, centralized companies, and mentioned bitcoin. But I find that really lame and unfair.Let's first look at the consequences of a Windows computer system crashing, causing banks, airlines, and hospitals to stop operating and causing heavy damage to the global economy. That is not something to celebrate and we should not gloat about it. Second: can bitcoin replace Microsoft's role in this incident? I guess bitcoin won't help in this case either. Because as you said, this is enterprise software and thanks to it we can solve and handle hundreds of different tasks. Everything is not simply related to transferring and sending money, so this comparison is lame.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "July 20, 2024, 09:19:26 PM",
      "body": "Quote from: NotATether on July 19, 2024, 05:09:37 PM...but not Bitcoin!https://techcrunch.com/2024/07/19/what-we-know-about-crowdstrikes-update-fail-thats-causing-global-outages-and-travel-chaos/QuoteA faulty software update issued by security giant CrowdStrike has resulted in a massive overnight outage that’s affected Windows computers around the world, disrupting businesses, airports, train stations, banks, broadcasters and the healthcare sector.CrowdStrike said the outage was not caused by a cyberattack, but was the result of a “defect” in a software update for its flagship security product, Falcon Sensor. The defect caused any Windows computers that Falcon is installed on to crash without fully loading.“The issue has been identified, isolated and a fix has been deployed,” said CrowdStrike in a statement on Friday. Some businesses and organizations are beginning to recover, but many expect the outages to drag on into the weekend or next week given the complexity of the fix. CrowdStrike CEO George Kurtz told NBC News that it may take “some time for some systems that just automatically won’t recover.” In a later tweet, Kurtz apologized for the disruption.Bitcoin never takes a break. Its architecture prevents someone from faulting millions of nodes worldwide. It also resists bugs like the one CrowdStrike just made on Windows. And even if some Bitcoin developer were to accidentally introduce a bug into Core, nobody is obligated to run the latest version of it so it will not even bring down their node.Free PR for crypto!ATMs and computers worldwide go down due to an update push from cyber security firm crowdstrike pushing windows updates lmao. I mean shoot man it’s ironic because the very thing these companies are paying so much money for is for ransomware protection but we didn’t account for downtime protection caused by the ransomeware protections lmfao. It’s hilarious imo. Huge loss to CS major sell of no surprises there. They’ll recover but lose their market dominance to probably SentinelOne or Bitdefender or like some other XDR firm possibly. Crazy marketplace that is. You can shut down Bitcoin tho! This would never happen with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 21, 2024, 06:31:07 AM",
      "body": "Quote from: ranochigo on July 20, 2024, 04:17:36 AMFirstly, this issue should have never happened, whether it concerns CrowdStrike, Apple or any centralized services. Updates that can obviously crash critical infrastructure should not have made it past QA, let alone been pushed. Likely poor CI/CD practices and this is an internal problem for them to solve. OTA updates are a necessity for enterprises because it is difficult for critical patches to be made manually by the millions of computers running it. Bugs have surfaced in Bitcoin as well and we're lucky that it was mostly handled swiftly and efficiently.I agree with this, but we also have to keep in mind that companies have in recent years been chipping away at QA in order to save costs - I know for one, that Microsoft is a very good example of this - updates every other week that effectively prevent certain drivers from working properly. And those don't hit the news as often, because only a small number of people get affected by them.These security companies especially do not know exactly how the OS they are integrating into works, whether it be Windows or Linux, and because development is not synchronized with that there will inevitably be serious bugs like this that happen which cause an oops/panic/BSoD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}