{
  "id": "topic_5416319",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "October 07, 2022, 03:25:55 PM",
  "content": "It's way too risky to be out of bitcoin right now because people are calling for 10,000$ per Bitcoin before they will start buying,  it sounds like when people are calling for 100,000$ per BTC months ago and the opposite happened, now people are calling for 10k again, the opposite might happen again, the best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the exact same thing the opposite always happens. Do not sit back and do nothing",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416319",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "October 07, 2022, 03:42:15 PM",
      "body": "Are you seriously moved by other's assumption? why not do your own research to find out what next could happen to bitcoin price any moment forward, if we are all to follow what the news and government says about bitcoin then we might all have dump it down, you quite alright know what you're looking for which the government or people can't afford to give you, bitcoin can do so with your investment, check the price volatility from 2009 to 2022 and see how the progress has been felt in a big way, another thing you could is to check the beginning of the year to where we are now, you could discover that bitcoin price fall and rises while the major event of halving also can give you more confidence that better days awaits bitcoin to jump up breaking the limit of it all time high price where we could have more than $68k and beyond.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "October 07, 2022, 03:59:43 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMIt's way too risky to be out of bitcoin right now because people are calling for 10,000$ per Bitcoin before they will start buying,  it sounds like when people are calling for 100,000$ per BTC months ago and the opposite happened, now people are calling for 10k again, the opposite might happen again, the best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the same thing the opposite always happens. Do not sit back and do nothingHonestly OP the price of BTC is volatile which means you can not access it anytime or know that the price will go up higher or lower, in short, it depends on the market. So if other said that they will buy BTC is the price will go down as they expected then that's their decision.  But for me now is a good time to buy because the price is lower 2x than  almost a year ago which the btc price is reaching $60k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 07, 2022, 04:28:24 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMIt's way too risky to be out of bitcoin right now because people are calling for 10,000$ per Bitcoin before they will start buyingDo you have anything to convince us that many people are calling for this before they buy, everyone wants to buy at a low price if the opportunity comes, but i don't think many people are waiting for 10k usd per BTC before they buy, people are buying now. But there is something that usually happens, you see those people that aren't buying now maybe because of some fud or the other, they would start fomo buying when price starts to go up.Quote from: KiaKia on October 07, 2022, 03:25:55 PMthe best way to deal with this is start buying BTC every week, maybe on Mondays? It musn't be Monday's, let people DCA in the way it is best expedient for them.Quote from: KiaKia on October 07, 2022, 03:25:55 PMremember, when people are calling for the exact same thing the opposite always happens. I don't know if this principle works with other things of life, but it doesn't with BTC, it is a bad way to try to analyse the movement of the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "October 07, 2022, 05:57:32 PM",
      "body": "Quote from: 348Judah on October 07, 2022, 03:42:15 PMAre you seriously moved by other's assumption? why not do your own research to find out what next could happen to bitcoin price any moment forward, if we are all to follow what the news and government says about bitcoin then we might all have dump it down...I can say that the phrase Do Your Own Research (DYOR) is somewhat ambitious and as well could mean different things to different people. You cannot separate the crypto market and news. News is the fundamental and it's one of the things that drive the market. News is the FUD. It helps the industry and it also fights it. You cannot keep deaf ears to rumors and people's assumptions all in the name of doing your own research. Personally, my first point of research is listening to what people believe will happen, then I'll draw a semi conclusion from the samples gotten.Quote from: Z-tight on October 07, 2022, 04:28:24 PMDo you have anything to convince us that many people are calling for this before they buy, everyone wants to buy at a low price if the opportunity comes, but i don't think many people are waiting for 10k usd per BTC before they buy, people are buying now. He doesn't need to convince you, read around the forum and you will be shocked that people are waiting for $3500  Many people are not buying bitcoin honestly, they are waiting for their comfortable bottom. While few are buying with DCA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "October 07, 2022, 06:15:47 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMIt's way too risky to be out of bitcoin right now because people are calling for 10,000$ per Bitcoin before they will start buying,  it sounds like when people are calling for 100,000$ per BTC months ago and the opposite happened, now people are calling for 10k again, the opposite might happen again, the best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the exact same thing the opposite always happens. Do not sit back and do nothing The majority of individuals have accumulated at this time in a bear market, and the price is scaring them to sell. Trading attitude is a different matter entirely; you have already made up your mind when investing in the bitcoin image. How do you feel if you buy a coin for 20 dollars and it drops to 7 or 5 dollars? It will be a tremendous loss. Don't even let the thought of selling a coin enter your mind when investing; instead, practice patience and learn to hold onto a position indefinitely (HODL) regardless of the coin's condition. Most investors in bitcoin borrow money, which might get them into problems. Don't borrow money to invest, and don't use your life savings to invest either; if you have another source of income, that's really excellent since it keeps you from having to attempt to sell. While trying to pay back most people have lost all of their assets to banks and individuals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "October 07, 2022, 07:35:42 PM",
      "body": "It is what it is, even big crypto influencers call for 150k per BTC in the bull market, you don't have to follow anyone's predictions because that's what it is, the truth is how will they lure more investors to invest when they are planning to take out their own money? Only those who bought at ATH will be at lose, now that BTC have lost over 70% of its value it's already a good buying opportunity, people are buying you are not just seeing it is all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "October 07, 2022, 08:21:49 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMIt's way too risky to be out of bitcoin right now because people are calling for 10,000$ per Bitcoin before they will start buying,  it sounds like when people are calling for 100,000$ per BTC months ago and the opposite happened, now people are calling for 10k again, the opposite might happen again, the best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the exact same thing the opposite always happens. Do not sit back and do nothingIts just assumption and you cannot say anything accurate to what people's sentiment at that time since its different scenario where market is in bullish since many people hope for more great things to happen. Also in bearish season we cannot also say that recovery might happen because we cannot still predict the outcome and might we could see the market dump more if more worst case situation occurs especially right now we are in crisis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "October 07, 2022, 08:39:24 PM",
      "body": "I agree with you OP buying now no matter how small the fraction may be just keep adding to your wallet and hodl. It's really hard to tell how accurate all this speculations about price hitting $10,000 can be. At this point Bitcoin price has dipped enough and anything can happen. This is a point in the market no one will want to be left behind. I will suggest instead of wait till $10,000 to buy just buy a fraction regularly that way even if it dips further the risk will be worth taking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "October 07, 2022, 08:52:40 PM",
      "body": "I mean, you should be investing for you, and that should be done under the conditions that you've basically researched thoroughly, and maintain a somewhat unbiased take on the market situation. I literally, don't follow one Bitcoin centric news site, I don't read Bitcoin news other than what's posted here on the forum, and even then I don't let that influence why I got into Bitcoin, and the reason I've still got Bitcoin to this day. Also, anyone that claims x price is talking through their arse. There's a certain point that charts doesn't help you. They're always based on assumption, and past happenings. However, we aren't in the same position we were six months ago, let alone a year ago. I keep saying it, but we're in unprecedented times, and no one really knows the short term direction we're going in.However, I think can somewhat predict the long term outcome to a certain degree of certainty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 07, 2022, 10:05:55 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMIt's way too risky to be out of bitcoin right now It is also risky and will be regrettable if we don't take advantage of this dip in price of bitcoin right now. It is also risky to want to buy bitcoins now and not have an updated knowledge about how to buy profitably. It will be risky also to get scared and bail out on bitcoins now because it may not look promising for the shortsighted. Likewise it is risky to keep holding bitcoins. Bottom line is choose your risk wisely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "October 07, 2022, 10:38:04 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMIt's way too risky to be out of bitcoin right now because people are calling for 10,000$ per Bitcoin before they will start buying,  it sounds like when people are calling for 100,000$ per BTC months ago and the opposite happened, now people are calling for 10k again, the opposite might happen again, the best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the exact same thing the opposite always happens. Do not sit back and do nothingJust don't mind them and mind your own business as you get and set to hold for more bitcoin. Them, are still waiting for it to go down, we don't know if there will be some major push that's about to happen and while they're still aiming for that and ignoring the opportunity that has already been there, they'll stick to what they're planning to do. Whether it will be on Mondays or any day of the week, as long as they have started their own accumulation and keeps to be focused doing the DCA strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "October 07, 2022, 11:13:35 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMremember, when people are calling for the exact same thing the opposite always happens. Do not sit back and do nothingI agree that you shouldn't seat back and do nothing but, the point were the opposite of popular demands is what I don't so much understand as to how, the opposite is always the reality. Popular opinions and demands often plays out but, I don't think majority of investors hope to see bitcoin at $10k before they would accept it to have hit the dip and start buying.Bitcoin already made a dip at $17k few months back, there might be a few thy still don't agree with that to be the dip but, I do think that's it and it would continueto struggle until it hits a pumps some more in preparation for a bull run.Hence, looking and procrastinating on when it's best to invest won't do you no good. Start where you can and with your spare cash too then, be ready to wait for the bullrun to occur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ihugbogo",
      "created_time": "October 07, 2022, 11:35:38 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMthe best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the exact same thing the opposite always happens. My people always says \"Nah who get food to chop they save\" (Its who, who have food to eat that will save for investment)Everyone has he or her own strategy of buying and holding btc, as for me buying btc every there and then is not a best option and 2ndly the fund which we use in buying the btc where are they stock. what if the price go down below what they actually where before your first purchase?. At my current status unless miracle happens btc is the last coin am thinking of buying currently, because it will make no meaning or add no much value if i buy btc worth  100$ now and when  btc hits 25k$ i will only make small or very little % of profit. i preferer accumulating other altcoins like matic than btc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 08, 2022, 07:51:52 AM",
      "body": "If I do not invest in bitcoin, what is risky about it? Nothing. But this could be indirect as well because someone can wait until bitcoin has low price already, waiting for a price that bitcoin may not fall to, but the bull run start and the price got so high again, leading to the person to fomo and invest at high price that could be a bull trap. I too would encourage people to hold now, the price is already low, but less than $20000 is still possible again and again until certain time that would be close to all-time-high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "October 08, 2022, 08:09:35 AM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMIt's way too risky to be out of bitcoin right now because people are calling for 10,000$ per Bitcoin before they will start buyingMissing a train and a chance to earn profit is not risky. It is different than when you take risk and get loss later. The first situation (what you're discussing) is only missing a chance, and you won't lose your initial capital so no risk with that situation.Quoteit sounds like when people are calling for 100,000$ per BTC months ago and the opposite happened, now people are calling for 10k again, the opposite might happen again, the best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the exact same thing the opposite always happens. It is better to apply DCA (Dollar Cost Averaging) Bitcoin and consider it as a long term investment. When you DCA, you have to prepare your regular capital for your DCA and fortunately you don't have to get headache when considering what price is good or perfect to buy Bitcoin.Website for DCA: https://dcabtc.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 08, 2022, 10:52:31 AM",
      "body": "Quote from: Ihugbogo on October 07, 2022, 11:35:38 PMQuote from: KiaKia on October 07, 2022, 03:25:55 PMthe best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the exact same thing the opposite always happens. My people always says \"Nah who get food to chop they save\" (Its who, who have food to eat that will save for investment)Everyone has he or her own strategy of buying and holding btc, as for me buying btc every there and then is not a best option and 2ndly the fund which we use in buying the btc where are they stock. what if the price go down below what they actually where before your first purchase?. At my current status unless miracle happens btc is the last coin am thinking of buying currently, because it will make no meaning or add no much value if i buy btc worth  100$ now and when  btc hits 25k$ i will only make small or very little % of profit. i preferer accumulating other altcoins like matic than btc BTC is a more reliable store of value than Matic, you said what if BTC falls more so I will ask you what if Matic falls even more because that's always the case with altcoins when BTC loses more value, if BTC loses 10% altcoins will lose 20% and more, there you have it, altcoins have the biggest risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "October 08, 2022, 12:48:27 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMIt's way too risky to be out of bitcoin right now because people are calling for 10,000$ per Bitcoin before they will start buying,  it sounds like when people are calling for 100,000$ per BTC months ago and the opposite happened, now people are calling for 10k again, the opposite might happen again, the best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the exact same thing the opposite always happens. Do not sit back and do nothingFirst of all, bitcoin should be viewed as a long-term project and trends and movements of bitcoin should be analyzed for a longer period of time.Many people write all kinds of things about bitcoin, they are euphoric when bitcoin goes up or they panic when bitcoin goes down. These are all nonsense that should be avoided.Bitcoin should be viewed like any other investment, make a clear investment plan after a detailed market analysis and have a clear exit strategy, and stick to it until the end.The biggest enemy of every investor is his emotions. Everyone must learn to control their emotions and make rational decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "October 08, 2022, 01:04:45 PM",
      "body": "Quote from: KiaKia on October 07, 2022, 03:25:55 PMIt's way too risky to be out of bitcoin right now because people are calling for 10,000$ per Bitcoin before they will start buying,  it sounds like when people are calling for 100,000$ per BTC months ago and the opposite happened, now people are calling for 10k again, the opposite might happen again, the best way to deal with this is start buying BTC every week, maybe on Mondays? This way you will feel better.....remember, when people are calling for the exact same thing the opposite always happens. Do not sit back and do nothingTell me first that do you invest on calls and guidance of other people? If this is thing that other people influence can make you buy/sell then you should not involve in this market because it's the whole time manipulated and those who are calling bitcoin to $10k now have no base for their nonsense talking so don't believe in them.We have seen bottom and we can go little bit lower then that but if you see bitcoin as a long term investment tool and see it's future growth you would believe in it not on others saying.As you said weekly or monthly investment they are best because I myself have been DCA investor and speaking frankly it's really good way to invest your funds and you can accumulate more in the long run when prices will be way higher.People have the opinion that bitcoin can make them rich within few months but it's not true because we have bull and bear cycle both in the market and you can make profits in bull market and investment for the same profit in these bearish time so choice is yours because whales want to dump coins on you to buy at even less making more out of your pockets.So invest and hold for long term in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "October 08, 2022, 01:11:22 PM",
      "body": "I don’t see the risk on what you implying on this topic. People will just missed profit in case they will sold or avoid investing Bitcoin but there is no risk of losing money in case they missed the profit opportunity because they still didn't get that profit to begin with. We are just talking opportunity here and it's really frustrating to be left behind if Bitcoin pump just because we are scared that Bitcoin will go deeper while we all know that Bitcoin price always come back on top on certain time.Crypto people including newbie just need to trust on the crypto cycle to avoid this kind of fear on Bitcoin investment so that they can sleep tight without thinking about there Bitcoin investment. Been there when I was newbie and gladly I decided to just hold during bear season while focusing on my own career to give me distraction on checking frequently my holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}