{
  "id": "topic_5429944",
  "title": "Pumpy555",
  "author": "Pumpy555",
  "created_time": "December 18, 2022, 01:14:25 PM",
  "content": "Im honest i Do pmp.We Will announce coin for Free in public.And for insiders you pay only 55$ monthly.And Premium class insiders Pay 200 $ monthly.Everybody else Will fomo in but we make good money first.If you want to get in ealry LET me know so the prices are 55$ regular and 200$ Premium class service those with Premium class Will get the best entry",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429944",
  "comments": [
    {
      "author": "Bitcoin_Arena",
      "created_time": "December 22, 2022, 10:54:17 PM",
      "body": "Old pump and dump scam. We all know how the scam works and by the way, you are basically a scammer yourself.Was so popular during the old days when Bittrex was one of the most used exchanges, but not anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "December 22, 2022, 11:04:43 PM",
      "body": "Quote from: Pumpy555 on December 18, 2022, 01:14:25 PM[snip]Everybody else Will fomo in but we make good money first.LMAO --this is the true color of the pump and dump service, they make money first and they will have benefited most before others will do if they are very lucky. It is a common practice of blindly scamming people, once you are greedy, you will bite this offer hoping for an easy way of making money but the sad fact is, you will not earn on this but instead --lose all your capital when you are late to their forecast.Stay away --no one will join you this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "December 22, 2022, 11:13:55 PM",
      "body": "LOL - this is a get-rich-quick scheme that only benefits the creator of the group. why are people still interested in this kind of practice that only benefits you and harms many others? Everyone will be fomo and jump in hoping for profits, but you and your team make a lot of money first, that sounds like a scammer implying that they will take the money of those who get fomo. those who are willing to pay $ 55 for regular and $ 200 for premium are just ordinary people who don't understand anything about trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "December 22, 2022, 11:58:32 PM",
      "body": "So you have the premium and the normal type of membership. Well, most of these paid groups are really going to make a lot of money from people who think that they're all accurate and profitable.Why not pay for your own memberships and let alone be the richest trader with all of that pump and dump that you're about to do? With that fee, I'll just have to learn my own trading and lessons from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}