{
  "id": "topic_5444835",
  "title": "irfan_pak10",
  "author": "irfan_pak10",
  "created_time": "March 14, 2023, 09:30:30 AM",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444835",
  "comments": [
    {
      "author": "irfan_pak10",
      "created_time": "March 14, 2023, 09:30:46 AMLast edit: March 14, 2023, 03:51:37 PM by irfan_pak10",
      "body": "",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "March 14, 2023, 01:02:59 PM",
      "body": "Quote from: irfan_pak10 on March 14, 2023, 09:30:46 AMKindly check and add the right link of the announcement thread to the bounty campaign",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ololajulo",
      "created_time": "March 22, 2023, 09:31:42 PM",
      "body": "It is recommended that all Syntrum community members, holders, developers, investors, marketers, or anyone else fill out this form. who knows there might be another airdrop. https://www.syntrum.com/participate.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ololajulo",
      "created_time": "April 05, 2023, 09:26:57 PM",
      "body": "Quote from: royalfestus on March 14, 2023, 01:02:59 PMKindly check and add the right link of the announcement thread to the bounty campaignThis has not yet been rectify on the bounty thread.Here is the link to join the weekly Zealy quest. There is a $10 fee for ten participants, and others are welcome to join as well. Visit this link to learn morehttps://zealy.io/c/syntrum/questboard?invitationId=dsBIwFpDMXrnHUMXjRrwK",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "June 11, 2023, 08:22:10 AMLast edit: June 11, 2023, 08:41:41 AM by royalfestus",
      "body": "https://t.me/syntrum/10610The project wallet has undergone several weeks of bug bounty and has now been updated and fixed for download. It will soon be available on Google Play for everyone to download. However, my main concern lies with the level of awareness surrounding the project. A few years ago, a similar project emerged with the same wallet concept. Crowdfunding is proposed for September",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "July 16, 2023, 09:04:45 PM",
      "body": "Unfortunately, the project encountered a setback during the initial stage of crowdfunding as it failed to generate sufficient funds, leading to the suspension of the campaign until further notice. Many similar cases have shown that once the momentum is lost, it becomes challenging to revive the interest and support. I attempted to convey to the team that there were signs indicating that the proposed campaign might not be able to raise enough funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}