{
  "id": "topic_5401037",
  "title": "willi9974",
  "author": "willi9974",
  "created_time": "June 01, 2022, 09:06:27 PM",
  "content": "Kooperation zwischen MediamarktSaturn mit Kurant als Automaten Betreiber.In Österreich schon seit 2019 im Pilotprojekt, jetzt Test in Deutschland dann vermutlich ein rollout in weitere Märkte.Bin gespannt wie schnell sich das entwickelt.https://www.mediamarktsaturn.com/press/press-releases/kryptow%C3%A4hrung-leicht-gemacht-bitcoin-automaten-bei-saturn",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401037",
  "comments": [
    {
      "author": "-doubleU-",
      "created_time": "June 01, 2022, 09:55:53 PM",
      "body": "Nette Meldung  Aber geht es Mediamarkt/Saturn wirklich um Bitcoin oder nur um eine werbewirksame Pressemeldung und Provision/Standortgebühren für die Automaten von Kurant, wodurch mit wenig Aufwand zusätzliche Einnahmen generiert werden?Klar sind in den Märkten technikbegeisterte Kunden unterwegs, welche auch Bitcoin kennen/kennen lernen wollen, aber würde es Mediamarkt/Saturn um die Akzeptanz von Bitcoin gehen, hätte man dies ja auch erst einmal unkompliziert als Zahlungsoption im Webshop implementieren können.Dennoch hoffe ich das dieses Pilotprojekt gut läuft und später in jedem Markt solch ein Automat aufgestellt wird. Für die breite Akzeptanz von Bitcoin/Kryptowährungen in der breiten Bevölkerung ist Sichtbarkeit ein nicht zu unterschätzender Faktor und an solch einem Automat kann ja jeder Interessierte ganz unkompliziert den ersten Schritt wagen und seine ersten Satoshis erwerben.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "June 01, 2022, 10:02:55 PM",
      "body": "Tolle Meldung, selbst wenn es nur als Werbung für Kryptowährungen dienen sollte ist es ein richtiger Schritt. Ideal wäre es noch wenn die MediaMarkt/Saturn Gruppe noch Bitcoin als Zahlungsmittel akzeptieren würden im Shop und auch Online - das wäre eine riesen Sache! Die Problematik die sich wohlmöglich infolge einer breiten Akzeptanz ergeben würde wären regulatorischer Natur, denn dann könnte man unverifiziert mit Kryptos einkaufen und das wird der Regierung nicht passen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "June 01, 2022, 10:32:03 PM",
      "body": "Wenn der Deal wirklich funktioniert und flächendeckend eingeführt wird, wäre das echt positiv für Kryptowährungen in Deutschland. Laut Wikipedia gibt es hierzulande über 400 Filialen von Mediamarkt / Saturn. Gibt es nicht schon ein breiteres Angebot in Österreicht? Wenn das dort gut verläuft, ist es kein Wunder, wenn nun in Deutschland der gleiche Weg eingeschlagen wird. https://www.blocktrainer.de/mediamarkt-bitcoin-automaten/Wie es scheint, ist in Österreich nicht nur Bitcoin angeboten, während in Deutschland laut Mitteilung erst einmal nur Bitcoin kommen soll. Edit: Bitcoin und Ethereum in Deutschland für das Pilotprojekt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "June 01, 2022, 11:19:06 PM",
      "body": "Quote from: 1miau on June 01, 2022, 10:32:03 PMWenn der Deal wirklich funktioniert und flächendeckend eingeführt wird, wäre das echt positiv für Kryptowährungen in Deutschland. Das wäre aufjedenfall mehr als nur positiv für Krypto und Bitcoin in Deutschland.Somit haben auch dann mal die jenigen die noch nicht viel am hut haben mit Bitcoin die chance ATMs aus der nähe anzuschauen.Wird bestimmt einige begeistern denke ich und hoffe das der einstieg bei  Mediamarkt und Saturn eventuell auch noch andere Shops aufhorchen lässt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "June 02, 2022, 05:15:35 AM",
      "body": "Die native Integration in den Warenkorb / POS ist noch nicht im Fokus, denke da sind die rechtlichen Hürden derzeit einfach noch zu groß. Aber eine Ausweitung um weitere Stores mit ATMs auszustatten ist schon mal ein guter Schritt und mit Mediamarkt und Saturn auch sehr öffentlichkeitswirksam. Selbst wenn eine Integration in den Warenkorb / POS technisch einfach wäre über einen Zahlungsprovider, sind die Kosten dafür (Kosten pro Transaktion für Exchange 2 Fiat) nicht zu unterschätzen, den ein Zahlungsprovider verlangt. Die Margen bei Retailer sind heutzutage nicht so groß, dass sich das trägt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Soonandwaite",
      "created_time": "June 02, 2022, 04:02:08 PM",
      "body": "Oha. Das klingt ja fast zu schön um wahr zu sein. Aber ich glaube das ganze erst wenn die ersten Automaten mindestens 6 Monate in Betrieb bleiben.Da werden doch bestimmt wieder komische Leute komische Gedanken bekommen und nachdem es anläuft paar Stöcker in die Speichen werfen.Aber wenn nicht nur BTC sondern wirklich auch ETH kommt.... das hätte schon was. Bin dann mal gespannt auf das Kleingedruckte was dann noch dazu kommt. Einfach...Deutschland ! Das geht ja mal gar nicht",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "June 02, 2022, 07:05:05 PM",
      "body": "Ich bin am Wochendende zufällig in einer der Städte unterwegs und werde da vielleicht einen Test Kauf machen. Dann würde ich das vielleicht dokumentieren und hier posten, falls es euch interessiert.Vorausgesetzt wäre allerdings, dass die Gebühren nicht zu hoch sind. 5 Minuten später:Nach Handynumer und E-Mail verlangen sie sämtliche persönliche Daten und so wie es aussieht, im Anschluss ein Video Ident Verfahren. Also dann kann ich auch bei einer richtigen Börse kaufen und muss mich nicht nackig machen, nur um mit Bargeld zu kaufen. Das ist mir zu viel Aufwand. Schade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "June 02, 2022, 07:16:17 PM",
      "body": "Tja das sind halt die deutschen Gesetze.Vermutlich wird man nirgends einen ATM haben der lange besteht, wenn das nicht eingehalten wird.Sehr schade eigentlich das der Staat da so eingreift.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "June 02, 2022, 10:09:58 PM",
      "body": "Quote from: sam00 on June 02, 2022, 07:05:05 PMIch bin am Wochendende zufällig in einer der Städte unterwegs und werde da vielleicht einen Test Kauf machen. Dann würde ich das vielleicht dokumentieren und hier posten, falls es euch interessiert.Vorausgesetzt wäre allerdings, dass die Gebühren nicht zu hoch sind. 5 Minuten später:Nach Handynumer und E-Mail verlangen sie sämtliche persönliche Daten und so wie es aussieht, im Anschluss ein Video Ident Verfahren. Also dann kann ich auch bei einer richtigen Börse kaufen und muss mich nicht nackig machen, nur um mit Bargeld zu kaufen. Das ist mir zu viel Aufwand. Schade.Danke für die Info. Die Frage ist, ob ein Normalbürger der sich bisher mit dem Thema Krypto nicht vertraut gemacht hat und seine ersten Schritte möglicherweise mit diesem Automaten machen könnte, eine volle (aufwendige) Verifizierung durchführen wird oder es dann doch sein lassen wird? Ich tippe eher auf letzteres, die Grundidee ist gut aber eine solche Verifizierung macht alles kaputt. Zumindest Kleinbeträge hätte man anders regeln können (beispielsweise pro Tag pro Telefonnummer nur 100€), damit sich die Menschen mit dem Thema vertraut machen können.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "June 03, 2022, 11:56:05 AM",
      "body": "Quote from: sam00 on June 02, 2022, 07:05:05 PM5 Minuten später:Nach Handynumer und E-Mail verlangen sie sämtliche persönliche Daten und so wie es aussieht, im Anschluss ein Video Ident Verfahren. Also dann kann ich auch bei einer richtigen Börse kaufen und muss mich nicht nackig machen, nur um mit Bargeld zu kaufen. Das ist mir zu viel Aufwand. Schade.Ich hab den Thread hier leider zu spät gesehen, aber die Info zum KYC hätte ich dir auch schon geben können. Es gibt mittlerweile auch schon einige gute Youtube-Videos die den Kaufprozess an deutschen Automaten vorstellen. Und der ist gelinde gesagt mehr als umständlich. Ohne vollständige KYC-Verifikation geht nämlich idR leider nichts mehr. Und ein Verkauf ist idR erst gar nicht möglich.Dann ist es natürlich auch kein Wunder, dass sich Bitcoin ATMs hier in Deutschland nicht durchsetzen und wir mittlerweile ziemlich abgeschlagen sind. Wenn man vorher in irgendeiner Einkaufspassage oder einem Bahnhof ein aufwendiges KYC-Verfahren vor dem Automaten durchführen muss, ist das Kundeninteresse natürlich gering. Wer macht das bitte? Dann doch besser entspannt vom heimischen Sofa verifizieren und für weniger Gebühren bei Kraken, Binance usw. einkaufen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "-doubleU-",
      "created_time": "June 03, 2022, 09:43:28 PM",
      "body": "Quote from: Unknown01 on June 02, 2022, 10:09:58 PMZumindest Kleinbeträge hätte man anders regeln können (beispielsweise pro Tag pro Telefonnummer nur 100€), damit sich die Menschen mit dem Thema vertraut machen können. Dies würde ich auch als sinnvoll empfinden um die Einstiegsschwelle niedrig zu halten. Aber das ist halt leider nicht gewollt von der Bafin. Krypto is ja schließlich böse - hoffentlich findet da in den nächsten Jahren noch ein Umdenken statt.Aber inzwischen ist alles was auch nur im entferntesten mit Geld zu tun hat hier im Lande total überreguliert. Allein wenn man mal paar alte Kochtöpfe zum Schrotthändler schafft, muss man für 1,40€ Auszahlung den Ausweis vorlegen  Hier mal noch die Links zu den 3 BTC-ATM Standortenhttps://coinatmradar.com/bitcoin_atm/51354/bitcoin-atm-general-bytes-frankfurt-saturn/https://coinatmradar.com/bitcoin_atm/51353/bitcoin-atm-general-bytes-cologne-saturn/https://coinatmradar.com/bitcoin_atm/51352/bitcoin-atm-general-bytes-dortmund-saturn/Alle 3 Automaten bieten nur den Kauf von BTC + ETH gegen EUR an, keinen verkauf von Kryptos.Der Dortmunder Automat reportet die Gebühren gar nicht, bei den anderen fallen derzeit 8.1%/8,2% an Gebühren an. Unter diesen Bedingungen werden wohl nur sehr wenige Neueinsteiger Ihre ersten Schritte in der Kyptowelt in einem Saturnmarkt wagen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "June 04, 2022, 09:58:43 PM",
      "body": "Ja leider bieten diese Automaten somit einfach 0 Mehrwert.Zum Verkauf müssen sich die Kunden/User sowieso auf einer Börse registrieren und wenn man den vollständigen KYC Prozess mitmachen muss, dann lieber gleich bei einer vertrauenswürdigen Börse… Da sehe ich aber auch leider keine Besserung, solange immer mehr reguliert werden soll :/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "-doubleU-",
      "created_time": "June 05, 2022, 08:17:38 AM",
      "body": "Quote from: sam00 on June 04, 2022, 09:58:43 PMJa leider bieten diese Automaten somit einfach 0 Mehrwert.Die Nutzung wird sicherlich sehr gerig sein, es sei denn wir ordnen dies mit unserem Wissen um Bitcoin und Börsen völlig falsch ein.Ganz bei Null würde ich den Mehrwert aber nicht einordnen. Sie stehen in stark frequentieren Geschäften wo hauptsächlich techn. Geräte gehandelt werden.Viele der Kunden dieser Geschäfte haben schon mal in den Medien was von Kryptowährungen gehört/gelesen und auf einmal wird es durch die physische Sichtbbarkeit greifbar, was durchaus einen Reiz auslösen könnte sich näher damit zu beschäftigen (was natürlich keinen Kauf an diesen Automaten auslösen muss). Die Richtige Zielgruppe läuft zumindest an diesen Automaten vorbei, Sichtbarkeit von Kryptos in der Öffentlichkeit/im Alltag ist auf jeden Fall erst einmal kein Fehler sondern ein Mehrwert für die Akzeptanz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "June 05, 2022, 01:05:23 PM",
      "body": "Sehe ich genauso. Two-way wäre besser, aber lieber so als nichts. So kommt Bitcoin ins Blickfeld und vielleicht kann man ja in Zukunft auch mehr damit machen. Hauptsache die ATMs sind mal da und werden benutzt. Wenn jemand auf den Geschmack kommt geht er den weiteren Weg vielleicht leichter oder überhaupt erst wegen der ATMs die er gesehen hat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinoRaiola",
      "created_time": "June 05, 2022, 02:03:39 PM",
      "body": "Quote from: -doubleU- on June 03, 2022, 09:43:28 PM... derzeit 8.1%/8,2% an Gebühren an.Wenn dazu noch eine schlechter Kurs angeboten wird, dann wären es mehr wie 8,2%. Es ist besser wie nichts, aber dadurch wird wahrscheinlich wenig, bis nichts passieren. Wenn es wirklich zu einem Vorteil für Bitcoiner werden soll, dann sollte man es attraktiver machen. Ähnlich wie bei shopinbit.com, dort gibt es 3% Rabatt wenn man mit Bitcoin bezahlt. Im Vergleich hierzu sind es +10% Preisvorteil... wenn soll das Angebot also anlocken? Eher Unwissende?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "-doubleU-",
      "created_time": "June 05, 2022, 03:13:20 PM",
      "body": "Quote from: MinoRaiola on June 05, 2022, 02:03:39 PMwenn soll das Angebot also anlocken? Eher Unwissende?Klar, jeder von uns hat doch mal unwissend angefangen und niederschwellige Einstiegsangebote (ok KYC ist in diesem Fall eher das Gegenteil ) sind meist der erste Schritt.wie Willi es bereits sagte...Quote from: willi9974 on June 05, 2022, 01:05:23 PMWenn jemand auf den Geschmack kommt geht er den weiteren Weg vielleicht leichter oder überhaupt erst wegen der ATMs die er gesehen hat.Der Anbieter bzw Saturn sieht aber auch das Thema Seriosität und Krypto Währung als wichtiges Thema.  Mediamarkt & Saturn sind nunmal etablierte seriöse Marken hier im Land wo ein Kunde vielleicht etwas mehr Vertrauen zum Einstieg hat als bei irgend einer Internetcryptobörse von der er gar nix gehört hatte bisher.QuoteHintergrund dieses Projektes, von dem jetzt auch Kunden in Dortmund profitieren sollen, soll der Faktor Seriosität sein. Es gebe im Internet zahlreiche Möglichkeiten, Kryptowährungen zu kaufen. Allerdings sei es für Laien ziemlich schwierig, seriöse von unseriösen Portalen zu unterscheiden.Quelle: https://www.ruhr24.de/dortmund/bitcoin-automat-dortmund-saturn-media-markt-kryptowaehrung-ethereum-koeln-frankfurt-91593054.htmlWäre auch interessant ob diese 3 Saturnmärkte jeweil einen geschulten Mitarbeiter beschäftigen, welcher neugierige Interessenten bei den ersten Schritten beratend unterstützen können.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "June 05, 2022, 05:14:17 PM",
      "body": "Quote from: willi9974 on June 05, 2022, 01:05:23 PMSehe ich genauso. Two-way wäre besser, aber lieber so als nichts. So kommt Bitcoin ins Blickfeld und vielleicht kann man ja in Zukunft auch mehr damit machen. Hauptsache die ATMs sind mal da und werden benutzt. Wenn jemand auf den Geschmack kommt geht er den weiteren Weg vielleicht leichter oder überhaupt erst wegen der ATMs die er gesehen hat.Puh, ich weiß nicht ob die ATM‘s genutzt werden? Es sind soviele Schritte vor dem Kauf zu absolvieren, da werden die wenigsten Neulinge Lust drauf haben und allen voran sind die Gebühren sehr stark erhöht wie ich finde. Ich hoffe zwar, dass das Angebot stark genutzt wird aber bezweifle eine breite Akzeptanz. Dennoch wird es zumindest als Werbung für Kryptowährungen dienen - auch wenn das Potenzial viel größer ist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "June 05, 2022, 05:42:09 PM",
      "body": "Die Automaten in Österreich werden sehr oft benutzt, deswegen wurde der Pilot erweitert",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unknown01",
      "created_time": "June 05, 2022, 05:48:58 PM",
      "body": "Quote from: willi9974 on June 05, 2022, 05:42:09 PMDie Automaten in Österreich werden sehr oft benutzt, deswegen wurde der Pilot erweitert Ich bin nächste Woche vielleicht sogar bei so einem Automaten und werde es mir mal ansehen und berichte dann gerne darüber wie kundenfreundlich oder besser anfängerfreundlich sie gestaltet sind. Selbstverständlich wünsche ich mir nichts anderes wie einen Erfolg",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}