{
  "id": "topic_5417442",
  "title": "Balmain",
  "author": "Balmain",
  "created_time": "October 17, 2022, 04:40:15 PM",
  "content": "Ballon d'Or, bu akşam sahibine gidecek. Ödül kime gidecek bana göre potada üç tane oyuncu var. Diğerlerini için bir ihtimal bile söz konusu değil. Benim favorim Karim Benzema bu sene kesinlikle bu ödülün ona gitmesi gerekiyor. Geçen sene tek başına şampiyonlar liginde Real Madrid'i sırtına aldı taşıdı peki bu adama gitmeyecekte bu ödül kime gidecek. Nihai karar bugün belli olacak.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417442",
  "comments": [
    {
      "author": "eightdots",
      "created_time": "October 17, 2022, 04:56:46 PM",
      "body": "Şampiyonlar ligini deyim yerindeyse tek başına almış Benzema dışındaki diğer adaylar ödül törenine alkışlamaya ve kendisiyle fotoğraf çekilmeye gidebilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "October 17, 2022, 06:42:02 PM",
      "body": "Quote from: eightdots on October 17, 2022, 04:56:46 PMŞampiyonlar ligini deyim yerindeyse tek başına almış Benzema dışındaki diğer adaylar ödül törenine alkışlamaya ve kendisiyle fotoğraf çekilmeye gidebilir.Bence de Benzema alacak. Benzema dışında en kuvvetli aday ise Lewandowski olurdu. Bu sene Barcelona ligde iyi gidiyor ama şampiyonlar liginde vasatı aşamadılar. Lewandowski’nin 40-50 gol atacağı bir sezon olmazsa gelecek sene de Haaland’a gideceğini biliyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "October 17, 2022, 07:04:13 PM",
      "body": "Benzema dışındaki isimlerin favori olması bence doğru değil, şu anda tek gerçek Benzema diyebiliriz. Bu yaşına rağmen bu performansı ödüllendirmezlerse büyük hata yaparlar.Haaland için çok erken, Lewandowski için pek istenen tarzda bir sezon değil, diğer isimler ise zaten güçlü değil. Kısa süre sonra ödülün sahibi belli olacak ama şaşıracağımı hiç sanmıyorum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "October 17, 2022, 07:53:06 PM",
      "body": "Quote from: xzone on October 17, 2022, 07:04:13 PMBenzema dışındaki isimlerin favori olması bence doğru değil, şu anda tek gerçek Benzema diyebiliriz. Bu yaşına rağmen bu performansı ödüllendirmezlerse büyük hata yaparlar.Haaland için çok erken, Lewandowski için pek istenen tarzda bir sezon değil, diğer isimler ise zaten güçlü değil. Kısa süre sonra ödülün sahibi belli olacak ama şaşıracağımı hiç sanmıyorum Benzema bu ödülü kesinlikle kazanır. Geçen sene yaptıklarını biliyorsunuz. Neredeyse Real Madrid’i tek başına sırtladı. Şampiyonlar liginde final maçı dahil tüm maçlarda elinden gelenin fazlasını yaptı. Ayağını her türlü, zekasını da her türlü kullandı. Bu ödülü alır. Lewandowski’nin performansı bir gerisinde kalacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "October 17, 2022, 08:50:05 PM",
      "body": "Ödülü hepimizin tahmin ettiği ve sonuna kadar hak eden Benzema kazandı. Geçen yıl yaptıklarını demeye gerek yok, gerçekten çok iyi bir sezon geçirmişti. Yılın en iyi genç oyuncusuna verilen Kopa Trophy, Barcelona’dan Gavi’nin oldu. Bayern Münih’in Senegalli yıldızı Sadio Mane, ülkesinde yaptığı yardımlardan dolayı Socrates ödülüne layık görüldü.  ‘Yılın en iyi forveti’ne verilen ödül olan Gerd Müller Trophy ise Polonyalı golcü Robert Lewandowski’ye gitti. Real Madrid ile kariyerinin en iyi sezonlarından birini yaşayan Thibaut Courtois, yılın en iyi kalecisi ödülünü (Yachine Trophy) kazandı. Yılın en iyi kulübü ise Manchester City seçildi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "October 17, 2022, 09:27:10 PM",
      "body": "Quote from: Gencecikmen on October 17, 2022, 08:50:05 PMÖdülü hepimizin tahmin ettiği ve sonuna kadar hak eden Benzema kazandı. Geçen yıl yaptıklarını demeye gerek yok, gerçekten çok iyi bir sezon geçirmişti. Yılın en iyi genç oyuncusuna verilen Kopa Trophy, Barcelona’dan Gavi’nin oldu. Bayern Münih’in Senegalli yıldızı Sadio Mane, ülkesinde yaptığı yardımlardan dolayı Socrates ödülüne layık görüldü.  ‘Yılın en iyi forveti’ne verilen ödül olan Gerd Müller Trophy ise Polonyalı golcü Robert Lewandowski’ye gitti. Real Madrid ile kariyerinin en iyi sezonlarından birini yaşayan Thibaut Courtois, yılın en iyi kalecisi ödülünü (Yachine Trophy) kazandı. Yılın en iyi kulübü ise Manchester City seçildi.Benzema bu ödülü sonuna kadar hak etmişti, gerçekten sıradışı bir futbolcu ve sıradışı bir yetenekle geçen seneyi tamamlamıştı, Real Madrid’de mükemmel maçlar çıkardı, onun bu güzel futbolu bu sene ona dünyanın en iyisi ödülünü kazandırdı, tebrikler Benzema, tebrikler Real Madrid, bir futbolcunun kazanabileceği en büyük ödülü kazandı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "October 18, 2022, 08:51:59 AM",
      "body": "Herkes Benzema'ya verilmesini bekliyodu. Beklenen oldu. Sürpriz çıkmadı bu defa Ballon d'Or'da. Gerçi başka güçlü bi aday olsa yine tartışma çıkardı sonuç hakkında. Benzema fanları yerine onlar beğenmezdi sonucu. Veya tam tersi. Benzema geçen sezon rakipsizdi. Ondan sürpriz olmadı. Tartışma çıkmadı. Ama bu ödülde tartışmalar hep oluyor. Ballon d'Or'un alternatifi ödüller yaratılırsa tartışmalar sonsuza kadar biter benim kanımca. Blockchain tabanlı bi oylama, ödül mesela. Kimse itiraz da edemez. Bütün taraftarlar, izleyiciler oylamaya katılabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "October 18, 2022, 08:45:23 PM",
      "body": "Quote from: Ondekinecakabilirim on October 18, 2022, 08:51:59 AMHerkes Benzema'ya verilmesini bekliyodu. Beklenen oldu. Sürpriz çıkmadı bu defa Ballon d'Or'da. Gerçi başka güçlü bi aday olsa yine tartışma çıkardı sonuç hakkında. Benzema fanları yerine onlar beğenmezdi sonucu. Veya tam tersi. Benzema geçen sezon rakipsizdi. Ondan sürpriz olmadı. Tartışma çıkmadı. Ama bu ödülde tartışmalar hep oluyor. Ballon d'Or'un alternatifi ödüller yaratılırsa tartışmalar sonsuza kadar biter benim kanımca. Blockchain tabanlı bi oylama, ödül mesela. Kimse itiraz da edemez. Bütün taraftarlar, izleyiciler oylamaya katılabilir.Balon dor ödülünü kazandığı için Benzema’yı tüm arkadaşları tebrik etmiş olmalı. Geçen sene bunu hak eden bir performans sergilemişti. Bu ödülde tartışmalar kişisel görüşlere göre değişiyor olmalı ama bu seneki lider hakkında tartışma olmamıştır. Benzema gerçekten geçen seneyi harika geçirmişti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "October 18, 2022, 08:52:12 PM",
      "body": "Quote from: Gencecikmen on October 17, 2022, 08:50:05 PMÖdülü hepimizin tahmin ettiği ve sonuna kadar hak eden Benzema kazandı. Geçen yıl yaptıklarını demeye gerek yok, gerçekten çok iyi bir sezon geçirmişti. Yılın en iyi genç oyuncusuna verilen Kopa Trophy, Barcelona’dan Gavi’nin oldu. Bayern Münih’in Senegalli yıldızı Sadio Mane, ülkesinde yaptığı yardımlardan dolayı Socrates ödülüne layık görüldü.  ‘Yılın en iyi forveti’ne verilen ödül olan Gerd Müller Trophy ise Polonyalı golcü Robert Lewandowski’ye gitti. Real Madrid ile kariyerinin en iyi sezonlarından birini yaşayan Thibaut Courtois, yılın en iyi kalecisi ödülünü (Yachine Trophy) kazandı. Yılın en iyi kulübü ise Manchester City seçildi.Gavi’de, benzema da bu ödülleri hak ediyordu. courtois da ödülü hak etti en iyi kaleci oldu. bu sene Lewandowskinin de gazını almak için ödül verdiler. herkesin gönlü olmuş oldu tabi. bence ballon d’or hak edilene verildi. müslüman bir futbolcu daha önce bu ödülü aldı mı bilmiyorum da benzema ilk olabilir. böyle bir notta var tabi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "October 18, 2022, 11:22:15 PM",
      "body": "bence biraz abartılsa da gerçekten çok önemli bir ödül... mbappe yeni kontratı ile psg'den dünyanın parasını kopardı ama hala mutlu değil çünkü fransa liginde kaldıkça bu ödülden uzak kalacağını ve bu ödülü kendisinin tek rakibi olan haaland'a her defasında kaptıracağını çok iyi biliyor. herif sırf bu yüzden psg'de sorun çıkarıyor ve ayrılmanın yollarını oluşturmaya çalışıyor bence... benzema'ya gelirsek; geçen sezon harika bir performans göstererek bu ödülü sonuna kadar hak etti, bu konuda herkes hemfikir ama bu ödülü yıllarca beraber oynadığı ve bir miktar arkasında kaldığı ronaldo'nun olmadığı bir ortamda/takımda alması da bence başka bir tartışmanın önemli bir konusu olabilir. ki zaten internette bu konu ile ilgili çok acayip capsler gördüm. :)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "October 19, 2022, 05:32:49 AM",
      "body": "Bende bu ödülü sonuna kadar hak ettiğini düşünüyorum özellikle şampiyonlar ligi performansı çok çok iyiydi geri düştüğü bir çok karşılaşmada goller atarak galibiyet almayı bildi. Real Madrid şampiyonlar ligini kazanmasında Benzema'nın katkısı çok büyük hem oynadı hem takım arkadaşlarına destek verdi ben bitti demeden bitmez gibisinden",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "October 19, 2022, 06:00:09 AM",
      "body": "Bence en doğru oyuncuya gitti ödül, bu arada geçen sene neredeyse herşeyi kazanan Real Madrid in en iyi 3. Takım olması çok anlamsız oldu, ayrıca Real Madrid kalecisi Courtois in bu ödülü asla bir kaleci kazanamayacak demesi de günün olaylarından biri oldu ki haksız da sayilmaz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "October 19, 2022, 02:32:43 PM",
      "body": "Hak eden bir oyuncu aldı herkesin dediği ve bahsettiği gibi. Ama bence eski şatavatı kalmadı gibi geliyor bana. Yani eskiden çok heyecanlanırdık kim alacak sabırsızlıkla beklerdik ama şimdi ise öyle hissetmiyorum. Belki de büyüdüğümüz için olabilir. Zaman geçtikçe içimizdeki heyecanı kaybediyor olabiliriz. Özellikle bu seneki performansıyla haketmişti. Lewa da iyi bir performans gösterdi ama benzemayı destekleyen daha fazla sanırsam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "October 19, 2022, 09:47:27 PM",
      "body": "KDB'yi de beğeniyorum ama Benzema'nın hak ettiği ortadaydı. Adam şampiyonlar ligini kazandırdı gibi bir şey oldu. Onun alması çok doğal. Mbappe'nin favoriler arasında olmadığını görmek de benim açımdan iyi oldu, adama bayağı gıcığım. Bu sene için kazananı tahmin etmek kolay oldu ama bakalım seneye nasıl olacak. Haaland alabilir gibi duruyor şimdi.Bu ödül törenini garip bulan benden başka kimse var mı? Çok cringe bir durum gibi geliyor bana. Bu Oscar törenleri stili değil de Nba MVP'si gibi yapmalılar bence. Bir de futbolcular koltuklarda otururken konuşturmuyorlar mı aşırı geriliyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "October 20, 2022, 05:57:47 AM",
      "body": "Quote from: püsür on October 19, 2022, 09:47:27 PMKDB'yi de beğeniyorum ama Benzema'nın hak ettiği ortadaydı. Adam şampiyonlar ligini kazandırdı gibi bir şey oldu. Onun alması çok doğal. Mbappe'nin favoriler arasında olmadığını görmek de benim açımdan iyi oldu, adama bayağı gıcığım. Bu sene için kazananı tahmin etmek kolay oldu ama bakalım seneye nasıl olacak. Haaland alabilir gibi duruyor şimdi.Bu ödül törenini garip bulan benden başka kimse var mı? Çok cringe bir durum gibi geliyor bana. Bu Oscar törenleri stili değil de Nba MVP'si gibi yapmalılar bence. Bir de futbolcular koltuklarda otururken konuşturmuyorlar mı aşırı geriliyorum. Kevin gerçekten emekli olduktan sonra bir DB geçti denilecek kadar kaliteli bir orta saha her futbol adamı ona sahip olmak ister Pepin ellerinde yeniden doğdu adam tabi geçen sene dediğin gibi bir Benzema vardı ki futbolu tek başına oynayıp Reale tek başına şampiyonlar ligi kupası kazandırdı bu ödül için ağır favoriydi ve kazandı kazanması şaşırtmadı Mbappe’yi sevmeyen olarak tek olmamak güzel his bende gıcığım bu lavuğa dünya benim etrafımda dönsün istiyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "October 20, 2022, 06:29:29 AM",
      "body": "Quote from: execijutiere on October 19, 2022, 02:32:43 PMHak eden bir oyuncu aldı herkesin dediği ve bahsettiği gibi. Ama bence eski şatavatı kalmadı gibi geliyor bana. Yani eskiden çok heyecanlanırdık kim alacak sabırsızlıkla beklerdik ama şimdi ise öyle hissetmiyorum. Belki de büyüdüğümüz için olabilir. Zaman geçtikçe içimizdeki heyecanı kaybediyor olabiliriz. Özellikle bu seneki performansıyla haketmişti. Lewa da iyi bir performans gösterdi ama benzemayı destekleyen daha fazla sanırsam.Büyüdük artık ve bunlar çok saçma gelmeye başladı.Aslında tam olarak yaşadığımız durum bu.Eskiden heyecan verip şimdi vermeyen onlarca şey var.Derbiler bile eski heyecanından çok uzaktalar.Neyse, konumuza dönecek olursak Karim Benzema kesinlikle hak ettiği bir ödülü kazandı.Geçmişte Messi mi Ronaldo mu sorusuyla geçerdi bu ödül ama artık her oyuncunun kazanma ihtimali olan bir ödül törenine dönüştü.Çünkü acı ama gerçek olan Messi ve Ronaldo futbol için sonlanmaya doğru yaklaştılar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}