{
  "id": "topic_5439823",
  "title": "crypticj",
  "author": "crypticj",
  "created_time": "February 14, 2023, 10:56:27 AM",
  "content": "What do you guys think about BUSD? Do you think it's worth using over USDT?What do you think about stables in general?I saw a lot of hate towards USDT in the past years, but it seems like despite everything it's still winning over other stables and it doesn't look like it will go down soon.I know that people see stables like something bad, but I think they are pretty useful when you trade on exchanges and some people are using them as a hedge against inflation so I don't see anything wrong in using them as long as the reserves of this stable are transparent enough.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439823",
  "comments": [
    {
      "author": "PrivacyG",
      "created_time": "February 14, 2023, 11:34:39 AM",
      "body": "The idea itself of a Stable coin is not bad.  It is bad that they are Centralized however, and prone to many flaws and to censorship.You can get your funds frozen.  Or, they can censor your Transactions.  Sure.  So many years have gone without a single user having such issues.  But, who guarantees today is not the day they start doing it.  USDT can closely work with Blockchain Analysis firms to choose whose Addresses to be allowed to continue using their USDT funds and whose Addresses shall be frozen.Transparency has been very questionable for USDT.  Many suspect their reserves are not as real and legitimate as they seem.  I have not researched this subject before, so if some body has more information feel free to continue this part of my reply.USDT is a good idea but its Centralization is bad.  The same thing goes for BUSD and any other Stable coin.  Stable coins that work on algorithms such as LUNA was are even worse.  LUNA proved why.It is best to stay away from them as much as you can.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "February 14, 2023, 11:49:26 AM",
      "body": "Quote from: crypticj on February 14, 2023, 10:56:27 AMWhat do you guys think about BUSD? Do you think it's worth using over USDT? BUSD is way worse than USDT. I keep saying this, and the cracks are finally starting to show. Not just BUSD, people should be careful with Binance affiliated coins like BNB. There is a lot of manipulations going on there.QuoteWhat do you think about stables in general?Before the emergence of stablecoins, wasn't the market doing just fine?Quote from: crypticj on February 14, 2023, 10:56:27 AMI know that people see stables like something bad, but I think they are pretty useful when you trade on exchanges and some people are using them as a hedge against inflation so I don't see anything wrong in using them as long as the reserves of this stable are transparent enough. They are bad. The purpose of crypto is decentralization. Stablecoins completely take that away.1. We are always looking at only inflation, how about deflation?2. Doesn't it feel good if you were trading your ETH/BTC pair and the whole market is going up?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "February 14, 2023, 12:42:54 PM",
      "body": "Quote from: crypticj on February 14, 2023, 10:56:27 AMWhat do you guys think about BUSD? Do you think it's worth using over USDT?..You have chosen the most unfortunate time to exchange your USDT for BUSD. You obviously don't know that the Paxos Trust Company, which is the issuer of BUSD, said that it stopped issuing this stablecoin and decided to burn it at the request of the SEC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vickysagar",
      "created_time": "February 14, 2023, 01:28:25 PM",
      "body": "Stables are a good option for transactions, and I'm using them sometimes. But I wouldn't keep my money in it, I think it's kinda dangerous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Westinhome",
      "created_time": "February 14, 2023, 01:32:39 PM",
      "body": "Now the BUSD and USDT was using as the stable coin for the transaction.Many people holding their huge crypto currency based on the form of Usdt and Busd.When the price of this two coin is stable and created only for the purpose of act like the American dollars.We know American dollars are used as the sable fiat used or the international transaction.But only thing is the transaction of the USD by the bank account is traceable one.So you need to pay the taxes for such transaction on your bank account.But this crypto currency trading is not a traceable one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ivankoh",
      "created_time": "February 14, 2023, 02:06:33 PM",
      "body": "Quote from: crypticj on February 14, 2023, 10:56:27 AMWhat do you guys think about BUSD? Do you think it's worth using over USDT?What do you think about stables in general?Unfortunately, BUSD is statistically behind USDT and USDC.  Considering the statistics of collateral assets of UsDT (December 31, 2022) ~ 67 billion, USDC ~ 44 billion, with BUSD (updated on January 31, 2023) is ~ 16 billion.  It is clear that BUSD is trusted as a 3rd option, and at the same time Paxos-BUSD is entangled in the accusation of \"unregistered securities of the SEC, which further makes BUSD's collateral assets lag behind in terms of trust,  prestige they can.  This is made worse by the fact that it seems that Circle itself is stabbing behind Paxos, it can be said that the future of stablecoins is putting a new order and the advantage is in USDT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MFahad",
      "created_time": "February 14, 2023, 02:29:22 PM",
      "body": "Busd was quite good stable coin and i was believing that it is safe to hold for many years but recently SEC notice to Paxos and they declare that they will not mint more Busd pegged fir Binance is something which is not good and now i am looking to convert my Busd to Dai or USDC. Usdt is not back up by any asset and they can any time stop or frozen token which is against decentralization. Main benefit of usdt is that it is Available in all chains and for shifting to another exchange usdt is right choice. Trading pair are also mostly available in Usdt. for daily trading in exchangs i think Usdt is best option and for holding i think Usdc is best option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "February 14, 2023, 02:33:25 PM",
      "body": "Quote from: Westinhome on February 14, 2023, 01:32:39 PMNow the BUSD and USDT was using as the stable coin for the transaction.Many people holding their huge crypto currency based on the form of Usdt and Busd.When the price of this two coin is stable and created only for the purpose of act like the American dollars.We know American dollars are used as the sable fiat used or the international transaction.But only thing is the transaction of the USD by the bank account is traceable one.So you need to pay the taxes for such transaction on your bank account.But this crypto currency trading is not a traceable one.Ok, we all agree that BUSD and USDT are stablecoins that are widely used for crypto transactions, but is it safe and will it protect your assets? Of course the answer is never, because stablecoin assets are still vulnerable to liquidation. Learn from UST which is a crypto stablecoin asset owned by LUNA which eventually had to crash miserably. That is an illustration that stablecoins will also not and also have more risky fluctuations. Instead of having to hold stablecoins without any movement and also having a high risk, it is better to buy bitcoin and hold it for the long term. It will be clearer and more profitable in the long run.The stablecoins I have are only as a pair for trading and as a gateway to exchange to Fiat, not for me to hold for too long",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JANUS23",
      "created_time": "February 14, 2023, 02:44:09 PM",
      "body": "Stables are a fundamental part of cryptocurrency world and I still think BUSD has a good deal of hate from USDC, perhaps it is because of competition USDC told on it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dbshck",
      "created_time": "February 14, 2023, 02:45:38 PM",
      "body": "Quote from: ivankoh on February 14, 2023, 02:06:33 PMThis is made worse by the fact that it seems that Circle itself is stabbing behind Paxos, it can be said that the future of stablecoins is putting a new order and the advantage is in USDT.Yeah, I just read that it was actually Circle who filed a complaint against Paxos. This might be Circle's way of retaliation against Binance who \"delist\" USDC by auto-converting it to BUSD a few months ago. Guess now Binance will either increase their reliance on USDT or \"re-list\" USDC. Curious how they're gonna handle this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "February 14, 2023, 02:53:22 PM",
      "body": "One of the stable coins in my basket for years has been BUSD, I usually try to equalize it with a few stable coins. Yes, the Paxos SEC statement looks scary, but I will continue to use BUSD because I don't use just one stable coin. The controls required for stable coins have to be tough and frugal, otherwise what would be the difference from fiat currencies?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "February 14, 2023, 02:54:26 PM",
      "body": "Quote from: crypticj on February 14, 2023, 10:56:27 AMWhat do you guys think about BUSD? Do you think it's worth using over USDT?What do you think about stables in general?In general, it should be pegged or backed by a physical dollar and it should be audited and regulated to maintain the 1:1 ratio.Many people are now switched on BSUD because they feel safer on it, not like USDT has previous controversy about their supply, they are still doubted this USDT.  But since USDT has a more liquid stable coin and it's the most popular, they still prefer to use it or blindly use this besides the allegations. They're the same concept of being centralized stablecoins, we also didn't forget that we have decentralized stablecoins like DAI and JAXX, they are also useful when it comes to decentralization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wajik-tempe",
      "created_time": "February 14, 2023, 03:07:15 PM",
      "body": "Both BUSD and USDT are popular stablecoins and widely accepted in the crypto ecosystem, but they have different issuers and are backed by different assets. Some users may prefer BUSD over USDT due to its more transparent and regulated approach, while others may choose USDT because it has a longer track record and wider adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "February 14, 2023, 03:10:51 PM",
      "body": "Quote from: sheenshane on February 14, 2023, 02:54:26 PMQuote from: crypticj on February 14, 2023, 10:56:27 AMWhat do you guys think about BUSD? Do you think it's worth using over USDT?What do you think about stables in general?In general, it should be pegged or backed by a physical dollar and it should be audited and regulated to maintain the 1:1 ratio.Many people are now switched on BSUD because they feel safer on it, not like USDT has previous controversy about their supply, they are still doubted this USDT.  But since USDT has a more liquid stable coin and it's the most popular, they still prefer to use it or blindly use this besides the allegations. They're the same concept of being centralized stablecoins, we also didn't forget that we have decentralized stablecoins like DAI and JAXX, they are also useful when it comes to decentralization.i thought so too. BUSD gained so much trust to the users since USDT already have issues before and BUSD has no issues and its sure backed by real USD base on Paxos information. could it be that SEC see this a threat to their pet USDT and so they started this crackdown? it does sound crazy that they let USDT slide while it has been around for a long time than BUSD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "February 14, 2023, 04:50:42 PM",
      "body": "Quote from: tvplus006 on February 14, 2023, 12:42:54 PMYou have chosen the most unfortunate time to exchange your USDT for BUSD. You obviously don't know that the Paxos Trust Company, which is the issuer of BUSD, said that it stopped issuing this stablecoin and decided to burn it at the request of the SEC.Honestly, when I saw this thread I thought OP's question was about the ongoing issue with the BUSD and its issuer. It appears OP hadn't known of that before making this post. To play safe, I've moved all my BUSD to Bitcoin. Now, I'm watching from the sideline to see how things go. I encourage OP to do same too until the dust around it settles down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "February 14, 2023, 08:21:41 PM",
      "body": "Quote from: crypticj on February 14, 2023, 10:56:27 AMWhat do you guys think about BUSD? Do you think it's worth using over USDT?What do you think about stables in general?I saw a lot of hate towards USDT in the past years, but it seems like despite everything it's still winning over other stables and it doesn't look like it will go down soon.I know that people see stables like something bad, but I think they are pretty useful when you trade on exchanges and some people are using them as a hedge against inflation so I don't see anything wrong in using them as long as the reserves of this stable are transparent enough. It is better to use USDC or DAI, there are negative events around BUSD right now, there are various accusations in the industry that BUSD does not have enough collateral. Although many of these accusations are FUD. In terms of long term reliability, I wouldn't use this stablecoin as no one knows what could happen to Binance and whether it will suffer the fate of FTX. Better to try to use projects like DAI, they are not centralized and do not depend on certain services or companies.My thoughts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "February 14, 2023, 08:57:04 PM",
      "body": "Quote from: crypticj on February 14, 2023, 10:56:27 AMWhat do you guys think about BUSD? Do you think it's worth using over USDT?What do you think about stables in general?I saw a lot of hate towards USDT in the past years, but it seems like despite everything it's still winning over other stables and it doesn't look like it will go down soon.I know that people see stables like something bad, but I think they are pretty useful when you trade on exchanges and some people are using them as a hedge against inflation so I don't see anything wrong in using them as long as the reserves of this stable are transparent enough. The hate towards UDST in the past did not came out of nowhere though. People became suspicious of USDT a few years ago when the company behind USDT changed the wording regarding the backign of USDT with real USD from \"we have enough USD to back every USDT minted\" to \"we have enough reserves to back every USDT minted\" but they did not say in what form those reserves exist and they also did not show any proof if those reserves even exist at all.Now USDT is publishing reserve data from time to time and BUSD and Binance itself is under attack. So the tides have kinda changed and now USDT seems to be the safest stablecoin of them all, together with USDC i guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "February 14, 2023, 09:49:25 PM",
      "body": "Quote from: crypticj on February 14, 2023, 10:56:27 AMWhat do you guys think about BUSD? Do you think it's worth using over USDT?What do you think about stables in general?I saw a lot of hate towards USDT in the past years, but it seems like despite everything it's still winning over other stables and it doesn't look like it will go down soon.I don't have experienced any problem with the two stablecoins USDT and BUSD,  and for me, they still can be trusted but to some level like just being used to transfer coins or just an exit point. But if we think about holding them for too long, I couldn't think it was the best option. Yes, it can't deny that there are issues and rumors regarding BUSD and other stablecoins which I think it was good to anticipate that situation rather than wait for it to happen. This is what we called - risky. And it is our choice if we use USDT or BUSD, or which of them are we preferred.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "February 14, 2023, 11:03:50 PM",
      "body": "it's all the same, as long as you are using them for saving your assets from inflation it's more or less the same.even if there's many rumours revolving around certain coins as long as it has the liquidity for you to cash out your assets then you're more likely be safe.the key is liquidity, you wouldn't use such coin that have low liquidity because they could prevent you from cashing out your investments eventually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}