{
  "id": "topic_5470087",
  "title": "SmartGold01",
  "author": "SmartGold01",
  "created_time": "October 12, 2023, 01:32:59 PM",
  "content": "This na one very important message I wan pass here because if no be God I no know where I for dey by now but our Maker saved me from the hands of my enemies.. Yesterday I leave my daughter for my husband say make I go buy food stuff for Mile 3 market along the line, as i dey walka come out from my street before \"You & I\" I see motor packed beside our street with one woman at front and the driver acting like say them dey wan carry passenger but I dey observed them. Nobody enter and as I enter them go turn for Eagle Cement Junction na so them carry me with speed zoom like, people come dey turn eyes dey look the kind speed the driver take zoom out na so I come dey wonder whether dem no go pick other passengers again even the people wey try stop them to enter the motor them no gree stop, na so dem dey carry me with speed approaching to Michael's Na so one thing tell me say make i tell dem to slow down say i wan pick something then we continue again. Immediately i relate am with them their two look each other faces come slow down say oya go pick am come back again i say okey, na so i jejely come down dey ask weda them fit wait for me, dem say yes say make i go take the tin com back. But based on say them wan carry me run i come pay them their money say make  dem go and yet dem come say no say make i go come back na so i enter the shop gum inside their i no gree come out again as them see say people don begin suspect them na so dem zoom run. my sisters and brothers na so God carry save me from hands of kidnappers of ooo if not una for hear say i don miss, na so come back to Bigtreat market after St. Johns come buy small food stuff run go back go meet my husband come explain the whole thing give am na so him just dey shock dey watch me. for some minutes him no fit talk..Please to all the lady's out there be very mindful with the kind of taxi and bus you enter, this same thing happened to my aunties daughter as well and God save her from those people but her phone and our food stuff was stolen from her, make we dey very careful this ember month because we go hear separate stories and, no keep night movement because this one happened for broad day light talk less of night. Abeg if the title no suit wetin i write here make una correct me as this is the only one i fit captioned am.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470087",
  "comments": [
    {
      "author": "CryptSafe",
      "created_time": "October 12, 2023, 02:09:47 PM",
      "body": "Thank God for your sharp move o. This ember month dey somehow o. One needs dey prayerful and dey careful as well because this period no be wetin person go dey do anything without the help of God. Kidnappers don full everywhere dey wait for who to fall enter their trap so that them go use the person shine this Christmas. Na God go protect and save us from them as e be say dem don begin come out now. E get the safety measures thread wey I been create for our local board here. I write down some safety measures wey person suppose take this period to safeguard themselves and family. I think say I go update am unto other areas so that people go read am then take measures too because na wetin person know and dey enlightened about Naim person dey do. Safety should be amongst our watch word  so as to be free of any occurrences that would hinder us from being in good state of mind and wellbeing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 12, 2023, 02:16:35 PM",
      "body": "Thank God for your life my dear, ur husband for they house they wait for you say u they come back come prepare food make him and pikin chop not knowing day them don carry you go where you know no. As you mention Eagle, which means nah Iwofe side for port harcourt, if I guess right this car nah all this mini keke bus Abi, if yes then, those people never really change that iwofe road nah where them they operate that mini bus they very dangerous to enter especially for that area, complain don come out well well for kidnap case both for the ones way we no no if them release them and the ones way come out come give testimony of their experience. We just gat to they careful. For that same area sometimes last year, eh get my neighbor babe way they work for hotel along that road them they close late around that kind 10-11pm dem get room to sleep for their but most times the girls too stubborn so she enter road that kind time they come our area but that day luck no they her side, she enter diz same kind of vehicle way them achieve her phone and bag way she hold for hand, if no be as this girl get mind jump down by her self we no no Watin for be next, Watin give her mind to jump down for tiled road nah Watin I never know reach today. Nah borrow she borrow phone carry call her guy, nah why eh good to they carry person line for head sometimes, we gat rush go their that day go see as she don wound wound for body, we gat carry her go clinic that night (expense way person no expect) but at the end of the day every body safe nah just phone lose.We all just gat to they careful the way we waka, they observe car who and who they inside before we enter inside if eh no move you for body avoid am, me sometimes I they trek if I no see car way suit me for body I they trek from that iwofe road reach rumuokwuta eh better day I use my Mercedes Benz well. Even bolt sometimes those drivers them no they be am we just gat be careful out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odohu",
      "created_time": "October 12, 2023, 03:48:13 PM",
      "body": "Omo na Baba God run this one for you o. For this Naija wey keep face like this wey person go dey suffer wetin no good for the hands of evil men wey no get joy. Untop of that, they go dey call money wey person no get. As I read the story, my mind go straight to your baby, how she for do base on say she still dey suck breast! We thank God for giving you the wisdom and for touching their heart to even listen to you. I know say na God wey no want make we cry run this one. As December don dey reach so, we gat dey careful abeg... e no dey safe to enter motor anyhow now o. I know say we no go sit one place dey chop but we go dey very careful and prayerful as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "October 12, 2023, 04:24:53 PM",
      "body": "Quote from: SmartGold01 on October 12, 2023, 01:32:59 PMThis na one very important message I wan pass here because if no be God I no know where I for dey by now but our Maker saved me from the hands of my enemies.. Yesterday I leave my daughter for my husband say make I go buy food stuff for Mile 3 market along the line, as i dey walka come out from my street before \"You & I\" I see motor packed beside our street with one woman at front and the driver acting like say them dey wan carry passenger but I dey observed them. Chai, omor, see matter, my dear you get big luck ooo, if to say no be baba God way dey for heaven maybe by naw nah only God nai know watin for don happen.This one nah to show say we done enter the season of kidnapping, as we dey approach Christmas and nah MBA month nai we dey so, all these ritualist them way dey this we country so, them don dey fine those way them go fit take use exchange their heads for them to see next year some dey fine money way them go take flex for this coming Christmas.QuoteNobody enter and as I enter them go turn for Eagle Cement Junction na so them carry me with speed zoom like, people come dey turn eyes dey look the kind speed the driver take zoom out na so I come dey wonder whether dem no go pick other passengers again even the people wey try stop them to enter the motor them no gree stop, na so dem dey carry me with speed approaching to Michael's Na so one thing tell me say make i tell dem to slow down say i wan pick something then we continue again. Madam abeg make you dey very careful next time and same thing to all of us for here, as we done hear your own story so nah to carry am tell others of us way no dey here for them to dey very careful we dem travel or go anywhere, whether close distance or near distance journey.Nah still for those of us way get chicken way still dey tender and still dey go school, make we still tell them and still put more eyes on them, because if them no sourced to kidnap adult them fit sourced to kidnap small children, so make we watch our children we too.QuoteImmediately i relate am with them their two look each other faces come slow down say oya go pick am come back again i say okey, na so i jejely come down dey ask weda them fit wait for me, dem say yes say make i go take the tin com back. But based on say them wan carry me run i come pay them their money say make  dem go and yet dem come say no say make i go come back na so i enter the shop gum inside their i no gree come out again as them see say people don begin suspect them na so dem zoom run. my sisters and brothers na so God carry save me from hands of kidnappers of ooo if not una for hear say i don miss, na so come back to Bigtreat market after St. Johns come buy small food stuff run go back go meet my husband come explain the whole thing give am na so him just dey shock dey watch me. for some minutes him no fit talk..You even get mind to seat down small as you notice there pattern, hmm, person like me, my dear I for done shout watin no good for that motor, but you try sha, because if to say you even shout maybe them for no even stop the vehicle, them for fit move faster than the way them been dey drive before, but you get luck ooo, now way the year self done dey even end.QuotePlease to all the lady's out there be very mindful with the kind of taxi and bus you enter, this same thing happened to my aunties daughter as well and God save her from those people but her phone and our food stuff was stolen from her, make we dey very careful this ember month because we go hear separate stories and, no keep night movement because this one happened for broad day light talk less of night. Abeg if the title no suit wetin i write here make una correct me as this is the only one i fit captioned am.Yes ooo, we done hear, same thing applicable to even the men, make we all dey very careful this MBA month, I go like talk say make we watch carefully before we enter any vehicle this period, no matter how safe the environment dey, make we still dey more careful because nah just one day nai all this bad bad things dem dey happen, so make we dey careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "October 12, 2023, 08:39:10 PM",
      "body": "We give glory to God that he came to your rescue at the right time. We need to be careful with the cab that we enter this period of time because mber month is here and during this period, expect the unexpected because every one is looking for money through any means possible.I am happy that you could escape from the kidnappers and you are safe and sound back to your family. It is also good that during this period, you shouldn't go out alone but have someone to accompany you or to monitor your movement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "October 12, 2023, 09:46:26 PM",
      "body": "Quote from: SmartGold01 on October 12, 2023, 01:32:59 PMPlease to all the lady's out there be very mindful with the kind of taxi and bus you enter, this same thing happened to my aunties daughter as well and God save her from those people but her phone and our food stuff was stolen from her, make we dey very careful this ember month because we go hear separate stories and, no keep night movement because this one happened for broad day light talk less of night. Abeg if the title no suit wetin i write here make una correct me as this is the only one i fit captioned am.We thank the Almighty for given you that wisdom to use escape the net of the wicked cos I suspect say them no be just kidnappers nah ritualist them bebased on how dem take arrange their plan e go get another set waiting on the other side wey Dem bin wan take you to but God forbid bad tin. This tin no dey only happens for women even men too dey fall victim sef, this kind tin happened to my guy for Etche na dem drive am to but God in his merci save am mysteriously. So make everybodi dey careful to check de settings of the vehicle him wan enta before him enta oh.  Dos wey de buk bolt too mk una careful cos tins de happen.... Lazy pipul wan use oda pipul blood to tk cash out but not our blood or familiiz. And also as OP tok am, avoid night muvment Naija now don de turn to small wild animal farm, no luv anymor from the street.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "October 12, 2023, 11:24:43 PM",
      "body": "Quote from: SmartGold01 on October 12, 2023, 01:32:59 PMD way u detail ur location like this con do me somehow but then, I get am say, na d joy way dey d body via watin God help make u escape from dey make I spill nd share ur all wth ur people.Schemes and schemes!Nothing way we no go see for this we nation nd evn inexperienced pple dey form kidnappers. Thank God say na these once way no sabi nothing I jam. Then no go evrly see ur end by instead, na so dere ears go dey open to listen 2 ur commands.Na why persn need dey careful mail drivers no in d name of traffic carry persn enter raid way dem no sabi nd zoom off.Thank God for you o nd b watchful, of course this lesson no be watin persn dey 4get or fail to take note of. Thank God for u.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}