{
  "id": "topic_5444745",
  "title": "OGsmall",
  "author": "OGsmall",
  "created_time": "March 13, 2023, 05:17:18 PMLast edit: March 13, 2023, 06:29:54 PM by OGsmall",
  "content": "A Bitcointalk forum or a White-Collar job?On this day I and my friends had a lengthy discussion on this case, and many ideas were coming up in the course of the discussion. Also, I noticed that a few of my friends do not believe in all these online jobs and they were throwing hotful words about they said a Government job is more 10x better than this nonsense forum you have been talking about all day they also call me a fool and I told them I know they are more things in this so-called government job like retirement pay and all that, but I said to them this forum is 100x better than that white collar job and also told them about Bounty and Signature and one can learn about crypto trading and I told them sometimes is not about the money is what we gain in the future form this forum, and I also told them that almost all the retired people I no today have nothing to show for it no money and the fucking government are still owning some retired old men some die and they they not get a piece coin from the government, I told them that all my household will ever be in this forum in the future. Guys, what did you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444745",
  "comments": [
    {
      "author": "Ebede",
      "created_time": "March 13, 2023, 06:38:22 PM",
      "body": "Bitcoin forum is not for job is the place we learn to Bitcoin, I have seen that many people have chosen forum as a job why is not meant to be so, why people is feeling that forum is a job is because of payment people are getting from signatures campaign, without the pay out many people will drop from forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "March 13, 2023, 07:07:57 PM",
      "body": "Quote from: OGsmall on March 13, 2023, 05:17:18 PMA Bitcointalk forum or a White-Collar job?Even if there is an opportunity to earn from the forum, you still should not consider it as a job. The forum is a place to learn.  If you have a white-collar job, you have to an extent a level and measure of job security from your appointment letter unlike the forum where there is no appointment letter. Also maybe the value of what you earn here in the forum is very high in your local currency, maybe that is why you are thinking like this, If what you earn here is not big in your local currency, you will know that the forum is not a job, it gives you an opportunity to get and gather bitcoins while learning more about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "March 13, 2023, 11:53:13 PM",
      "body": "Quote from: OGsmall on March 13, 2023, 05:17:18 PMA Bitcointalk forum or a White-Collar job?On this day I and my friends had a lengthy discussion on this case, and many ideas were coming up in the course of the discussion. Also, I noticed that a few of my friends do not believe in all these online jobs and they were throwing hotful words about they said a Government job is more 10x better than this nonsense forum you have been talking about all day they also call me a fool and I told them I know they are more things in this so-called government job like retirement pay and all that, but I said to them this forum is 100x better than that white collar job and also told them about Bounty and Signature and one can learn about crypto trading and I told them sometimes is not about the money is what we gain in the future form this forum, and I also told them that almost all the retired people I no today have nothing to show for it no money and the fucking government are still owning some retired old men some die and they they not get a piece coin from the government, I told them that all my household will ever be in this forum in the future. Guys, what did you think?Member will always advise that you shouldn't see the forum as a full-time job because the jobs here are not permanent. Your signature campaign can end and you might not immediately get another one which will affect your finance. Seeing the forum as a full-time job might also make one deviate from the main purpose of the forum which is learning. I don't know your location but some jobs pay better than what one can earn from the forum. This forum indeed offers few opportunities to earn but many members earn more from other areas because most of them are professionals in different fields. And I think you should be engaged in other viable sectors of the economy of your country.I am not a fan of relying totally on government jobs because they pay peanuts in my country. Every civil servant that doesn't want to suffer from lack and want should ensure they save and invest in a business. Owning your house could be a good investment option in my country becauase of high cost of rent. Buying and hodling bitcoin might not also be a bad investment platform. I am not thrilled by pension and gratuity because they don't guarantee a good standard of living.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "March 14, 2023, 02:51:16 AM",
      "body": "Quote from: OGsmall on March 13, 2023, 05:17:18 PMGuys, what did you think?What your friends say is quite true, especially if he works as a government employee with a high enough position, meaning he will get more facilities and with the position he has, he will get many other facilities so that he will not only get a salary but benefits from his status as a government employee. .In this forum maybe you can get money but it doesn't always go well, for the bounty there are times when it is not worth it and for the signature campaign it can stop at any time when the employer decides this.From earning in this forum with income in the real world it will be more convincing in the real world, the advantages of earning in this forum can be done at any time and are not bound by time and there is no need to leave the house like an office worker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 14, 2023, 09:21:51 AM",
      "body": "I agree with you 100%, especially in developing and poor countries. I am one of the people whose lives have been changed by Bitcoin and this forum. Before I knew Bitcoin, I was working as a government employee with a ridiculous salary that was not enough to cover a small part of my family's expenses.Now I quit the job and work on this forum and trading while sitting at home and earning at least 10-20 times better income than government salary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "March 14, 2023, 01:22:22 PM",
      "body": "You need to understand that it's not the forum that is paying you what you earn from the community but the signature campaign you are participating on give you your pay reward for advertising for them, but know that this forum has created the platform for such to take place, it also has many opportunities you can get through different threads created by members offering one or more services that may require your value and get paid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "March 14, 2023, 02:47:57 PM",
      "body": "You and your entire household wanna join bitcointalk for bounties? Well it's not worth the efforts, because 75% of bitcoin paying bounties are always reserved for friends and alts, and 99% of garbage coin bounties are nothing but scams, most of the times you won't even get anything at all because that's how much they are scammy. The bread you put on your table must come from a pure and legit source of income, do not pollute your lives with these questionable funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "March 14, 2023, 02:49:59 PM",
      "body": "Quote from: OGsmall on March 13, 2023, 05:17:18 PMA Bitcointalk forum or a White-Collar job?On this day I and my friends had a lengthy discussion on this case, and many ideas were coming up in the course of the discussion. Also, I noticed that a few of my friends do not believe in all these online jobs and they were throwing hotful words about they said a Government job is more 10x better than this nonsense forum you have been talking about all day they also call me a fool and I told them I know they are more things in this so-called government job like retirement pay and all that, but I said to them this forum is 100x better than that white collar job and also told them about Bounty and Signature and one can learn about crypto trading and I told them sometimes is not about the money is what we gain in the future form this forum, and I also told them that almost all the retired people I no today have nothing to show for it no money and the fucking government are still owning some retired old men some die and they they not get a piece coin from the government, I told them that all my household will ever be in this forum in the future. Guys, what did you think?I am not sure what kind of white-collar jobs are you talking about if you think bitcointalk would pay more or would be more secure? I have a paying job and this is a hobby to me. If i would rely purely on the bounties, i would be soon homeless. If you want to trade or hold cryptos then by all means do, we all do. But relying 100% something so volatile as crypto is just irresponsible. I am hoping if you do that, then you are only responsive of yourself, because if you are relying in crypto with your money that you need every day, and you need to provide for your family. Then as a someone who has seen few huge bear runs, some point you are going to be in trouble. Because you can't calculate volatility as huge as this for your budjet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "March 14, 2023, 06:28:20 PM",
      "body": "I suspect my forum income to be about that of a five dollar an hour job. Sure, posting on a forum and learning about bitcoin is a lot better than a minimum wage job, but as far as pay goes, you could definitely find more lucrative ways to support yourself than posting or selling things on an Internet forum. That being said, it is pretty cool that the forum pays anything at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NdaMk",
      "created_time": "March 14, 2023, 06:59:02 PM",
      "body": "It definitely depends on the country you are coming from, in some countries the pay here isn’t up to the minimum wage but reverse is the case in some countries. Regardless of the country the government job or a well established business should be priority because it is a continuous job unlike earnings From this forum or internet which could end at anytime. With even a government job one could take a side hustle with internet earnings since it isn’t that stressful",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "March 14, 2023, 07:05:27 PM",
      "body": "It all depends on the country which you are living and the kind of skill that you have or your school qualification. If you are living in a third world country with less job opportunities and bad government,then I will accept that the forum is playing a major role in your financial income,if you are a signature campaign participant. If you live in a big country,skillful or educated you will find out that the white collar jobs is a big earning job and the signature campaign pay is a peanut compared to your salary.It is always advisable not to lay all your eggs in one basket,see the forum as a part time job and get a physical or main job which you are relying on. See the forum as an alternative place to make profit and not a first choice of employment, so that you don't ruin your future incase things turn out the other way round. Remember nothing last forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OpenCEX",
      "created_time": "March 14, 2023, 07:18:05 PM",
      "body": "There’s no point in arguing with people you know who don’t understand the topic of discussion. You can’t persuade them so that they come over to your side.You don’t get paid to invite referrals to this forum, do you? Then you shouldn’t waste your time and effort on persuasion. Do what you like on your own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "March 14, 2023, 09:02:58 PM",
      "body": "Quote from: digaran on March 14, 2023, 02:47:57 PM The bread you put on your table must come from a pure and legit source of income, do not pollute your lives with these questionable funds.Woooh this make me feel guilty even before knowing what wrong I have done,  and upon seeing your comment I was forced to check your date of registration and you are an OG since 2016 far more on the ground than most of us, and reading this comment actually triggered a question in me, of what the source of money from signature campaign is. And a little brainstorming brought me to the only understanding that, the company we advertise are the source of the income we gain no matter how little it is since signature payments were just incentives for being active in the forum. So if I am a physical brand ambassador of a gambling company it then means the source of my income is from the casino until my contract expires with them, I may be wrong though. Looking forward to reading more from you, am curious to know more about the legitimacy of our payments from the signature. Thanks, the boss in anticipation!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "johnsaributua",
      "created_time": "March 15, 2023, 06:20:52 AM",
      "body": "Positive thinking is good, bro, why don't you choose both? You can learn bitcoin to support your work, maybe introduce to the environment or close people, an alternative for learning forums, you have added value.You will be able to develop in your work environment (if you choose it) that other people have in terms of insight. The forum of all types of information in terms of the financial peel both in big board  or local board.I prefer to develop myself if the opportunity exists anytime and anywhere,If you think Signature Campaign will be your hope in the future, you can rank your ranking to wear a signature if the manager campaign approves it. Click on  Here You first enjoy the process until you get the payment you want, that's an effective thing to convince your friends bro.If studying in a forum can while working, vacationing doing things that can provide a better effect is better bro, there are many habits of people in learning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "March 19, 2023, 06:52:46 AM",
      "body": "Please my advice for you is to let you know that the bitcoin talk forum is not a place where we do business that pays us but it's a place where we learn how to make money through Bitcoin and all the rest.I don't know why you think a bitcoin talk is a place for interchange or if is it because of the signature campaigns people participate in. Here on this forum, I understand that even those with a business idea can participate in this forum because they will be a little more confused about cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "March 19, 2023, 09:23:29 AM",
      "body": "The forum is not supposed to be a full time job, and should not be considered as such.You have no contract, no job security, and depending on the country, it may not be able to pay your bills or provide for your basic needs.However, the forum is a great way to increase your stock of satoshis through signature campaigns or bounties, while learning things and sharing what you already know.These campaigns, in my opinion, are a win-win system: you advertise sites or companies that you think are clean and legit, and in exchange you get paid. In addition, managers require a certain quality of posting, and a certain minimum frequency of activity.This is globally beneficial for the forum, it guarantees that at least a part of the regular active users post consistently, and with good quality posts. But in my opinion, you will only reach the necessary rank by acting as a normal member of the forum, and settling in, making quality posts. If the only motivation of a member is to farm an account to access the campaigns, it shows, and in general this member will not reach the necessary rank to participate in the said campaigns.In my country, the signing campaigns offer almost the equivalent of a local minimum wage. However, I prefer to keep my job (I'm lucky enough to earn much more than the legal minimum) and tell myself that I'll leave this second salary in BTC, for the future. If I had to rely solely on forum wages for my daily life, it could be stressful. And I remain convinced that doing it out of need, and not out of desire, would influence the quality of the posts. This would not be positive for me, nor for the campaing manager or nor for the forum itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "March 19, 2023, 10:06:26 AM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on March 19, 2023, 09:23:29 AMIn my country, the signing campaigns offer almost the equivalent of a local minimum wage. However, I prefer to keep my job (I'm lucky enough to earn much more than the legal minimum) and tell myself that I'll leave this second salary in BTC, for the future. If I had to rely solely on forum wages for my daily life, it could be stressful. And I remain convinced that doing it out of need, and not out of desire, would influence the quality of the posts. This would not be positive for me, nor for the campaing manager or nor for the forum itself.I agree with you on the desire and desperation aspect and its negative influence on the quality of posts, I am sure ranking up to a certain rank has thought us a good lesson and it is a product of our level of dedication and contributions to the active topics in the forum. -That being said a lot of other members have had a lot of misconceptions about the forum and thas ledsled many to get motivation drained along the line if their expectations fail to materialize,meleess that the forum is a place to come and make quick free money that is why they flood the bounty section and since they are not here to build financial knowledge and contribute to discussions, they tend to avoid other section of the forum. -It will take a long time and effort to become financially free and the time and effort must be spent on acquiring knowledge and building marketable skills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "March 19, 2023, 01:28:08 PM",
      "body": "Quote from: OGsmall on March 13, 2023, 05:17:18 PMA Bitcointalk forum or a White-Collar job?On this day I and my friends had a lengthy discussion on this case, and many ideas were coming up in the course of the discussion. Also, I noticed that a few of my friends do not believe in all these online jobs and they were throwing hotful words about they said a Government job is more 10x better than this nonsense forum you have been talking about all day they also call me a fool and I told them I know they are more things in this so-called government job like retirement pay and all that, but I said to them this forum is 100x better than that white collar job and also told them about Bounty and Signature and one can learn about crypto trading and I told them sometimes is not about the money is what we gain in the future form this forum, and I also told them that almost all the retired people I no today have nothing to show for it no money and the fucking government are still owning some retired old men some die and they they not get a piece coin from the government, I told them that all my household will ever be in this forum in the future. Guys, what did you think?Your argument with your friends is unarguable, but you became overly reliant on this forum, which is not supposed to be the case. Working as a forum member in a signature paid campaign or as a bounty hunter on occasion does not guarantee you long-term employment. If the signature or bounty campaign ends, it means your work has come to an end as well. It is not advisable to rely on the forum as your primary source of income, but rather as a side hustle to supplement your other earnings. One thing you'll take away from this forum is the knowledge you've gained about bitcoin and cryptocurrency in general.The white collar job can be relied on, as you are confident that it will last you for the number of years specified in the country's constitution. The issue with white collar jobs is that they do not pay on time, do not cover all of your needs, and so on. whether bitcointalk forum or white collar job, it's advisable you hold on to both as both has their advantages and value it'll add to one's life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yawa2020",
      "created_time": "March 19, 2023, 01:56:49 PM",
      "body": "Quote from: Ndabagi01 on March 19, 2023, 01:28:08 PMThe white collar job can be relied on, as you are confident that it will last you for the number of years specified in the country's constitution. The issue with white collar jobs is that they do not pay on time, do not cover all of your needs, and so on. whether bitcointalk forum or white collar job, it's advisable you hold on to both as both has their advantages and value it'll add to one's life.First of all, is Forum a working place? I thought we are here to learn one or more things about Bitcoin, crypto at large and other aspects of human dealings. For the clarity sake, OP should understands that this forum was/is not a working place initially. The paid signature campaign and bounty campaigns is the reason some users are misled hence, thinking here is a working place. Note that, the forum shall remain with or without running signature campaigns and bounties.There are high chances you might not get selected for a campaign for several weeks or months or even get removed in a campaign due to some reasons. White collar jobs are mostly permanent and pensionable. That means when you are retired, you're eligible for pension and gratuities. Here, once you're out of campaign that is all.In essence and conclusion, never you assume Forum as working place but a learning place and if you are lucky to be earning then it will be a bonus to your real life earning. The fact is get something doing out of forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}