{
  "id": "topic_5467755",
  "title": "DUPONDIUS",
  "author": "DUPONDIUS",
  "created_time": "September 22, 2023, 09:14:56 PM",
  "content": "Buenas noches.Tengo algunos Satoshis en una cartera en papel y no encuentro al forma de importarlos en Bitcoin Core.¿Alguien con experiencia?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467755",
  "comments": [
    {
      "author": "albert0bsd",
      "created_time": "September 22, 2023, 09:38:17 PMLast edit: September 22, 2023, 09:50:52 PM by albert0bsd",
      "body": "Yo te recomentario mejor utilziar un software como sparrow Pero si insistes en utilizar el bitcoin core tu tendrias que espeficiar si estas utilizando la version GUI o la version de linea de comandos (CLI)Si estas utulizando esta ultima tu puedes importar tu llave WIF con el siguiente comando:Quoteimportprivkey \"yourPrivateKeyInWIF\"Mas informacion enhttps://developer.bitcoin.org/reference/rpc/importprivkey.htmlPero reitero que bitcoin core actualmente no es una buena opcion como cartera, hoy en dia te recomendario Electrum o como ya lo mencione Sparrow o Samouraiwallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DUPONDIUS",
      "created_time": "September 22, 2023, 10:26:03 PM",
      "body": "Lo intento con sparrow, pero no se como meter la clave privada; que tengo apuntada en papel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 22, 2023, 10:37:02 PM",
      "body": "Antes que nada te recomendaria que te espere un poco, justo en este momento las comisiones de la red estan algo altas, eso lo puedes ver en https://mempool.space/La opcion de sparrow lo que hace es mueve los fondos de la cartera que le pases a una cartera dentro de sparrow, es decir, primero tienes que generar una nueva wallet en sparrow,  para poder transferir tu cartera de papel ahi.Por cartera de papel yo me imagino que tienes una llave WIF, pero tambien podrias tener una llave en hexadecimal o incluso una llave de 12 a  24 mnemonicos.Primero tienes que enteder que es lo que tienes en manos antes de realizar cualquier cosa.Te recomiendo que leas este link antes de proceder.Chapter 4. Keys, Addresses, Wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DUPONDIUS",
      "created_time": "September 22, 2023, 10:38:59 PM",
      "body": "Tengo las claves privada y publica generadas en BitAddress y no se como importarlas.Hace mucho que manejo bitcoin, pero he estado un tiempo apartado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 22, 2023, 10:43:04 PM",
      "body": "Para importarla solo escribe la Clave WIF que tienes en tu hoja de bitaddress en el campo para realizar el sweep de bitcoin, pero como recomensacion, es mejor esperarte un poc para que tengas nocion de que estas realizando.Por favor lee el link que te pase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DUPONDIUS",
      "created_time": "September 22, 2023, 10:47:36 PM",
      "body": "Tengo la dirección pública y la clave privada; ninguna WIF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 22, 2023, 10:53:33 PM",
      "body": "OK, he tomado un ejemplo random de bitaddressDireccion: 14XRqvTFCFWByfN6pRhYVTNw5qMsEbE1AfLlave publica: 035B1C1780A7EA28C30BF17814CAFE0814640B57B1F68675C2A3CF8BA0C281F30CWIF: KxASeaeMGSJwxe5EWKr42MyRaYJMskAZ8LYY4FfTbTEu8Mp4ZsNU   <<<-- Este valor es el que necesitasPrivate Key Hexadecimal Format (64 characters [0-9A-F]):1C28025FE19A16E2B7B10E47F47DFCAB883603FE4CDC73D5793D5E56E198B3CD <<<-- Este valor tambien puede servirSi no tienes la WIF o una clava de 64 caracteres en hexadecimal. entonces da por perdido ese balance que Actualmente ya no tienesPregunta, cuando guardaste tu Cartera de papel, imprimiste la pagina de bit address o salvaste el archivo como PDF ? o solo anotaste la direccion a Mano un una hoja de papel?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DUPONDIUS",
      "created_time": "September 22, 2023, 10:55:58 PM",
      "body": "Sólo anote las claves en un papel.> 1DXLFXNAmHBt68AqQrJjSJmaZcvauAMQt9Año 2018.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 22, 2023, 11:00:27 PMLast edit: October 31, 2023, 09:34:51 PM by albert0bsd",
      "body": "Por eso comento que tienes que leer para enterarte de lo que estas haciendo.Cuando dices Claves es muy ambigüo. En el ejemplo que puse hay Direccion, Llave publica, Llave privada en formato WIF y llave en Hexadecimal.Cuantos caracteres tiene tu clave? Las llaves WIF tiene cerca de 52 caracteres y las llaves en hexadecimal son de 64. (Estas son las que necesitas)Las llaves publicas pueden ser de 66 o 130 caracteres y las direcciones son variables pero no pasan de 35 Caracteres (Estas no te sirven para recuperar el saldo)Si solo tienes una de estas dos ultimas que mencione, entonces no podras recuperar tu balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DUPONDIUS",
      "created_time": "September 22, 2023, 11:09:29 PM",
      "body": "> 1DXLFXNAmHBt68AqQrJjSJmaZcvauAMQt9La llave privada tiene 51 carácteres.Tengo algo similar a esto.https://i.imgur.com/NcepdqM.pngY con esas dos claves tiene que ser posible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 22, 2023, 11:18:24 PM",
      "body": "Quote from: DUPONDIUS on September 22, 2023, 11:09:29 PMY con esas dos claves tiene que ser posible.La primera no es una clave, es una direccion de bitcoin, la segunda, la que dices que tiene 51 caracteres esa es la Clave WIF.Bro, tienes 14 mil satoshis en tu direccion, no te recomiendo moverlos ahorita. si te fijas en https://mempool.space/ la comision minina esta cerca de un dolar y medio y como tu cartera es legacy, dicha comision se va a comer todo tu balance.Te recomiendo encarecidamente que leas y te eduques primero.Saludos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DUPONDIUS",
      "created_time": "September 22, 2023, 11:20:55 PM",
      "body": "Sólo quiero saber cómo hacerlo con sparrow; no digo que lo vaya ha hacer ahora.¿Sparrow permite decidir que comisiones pago por la transaccion?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 22, 2023, 11:30:22 PM",
      "body": "Primero tienes que crear una cartera en sparrow, te recomiendo una con 24 Mnemonic, ya que te genera muchas direcciones con una sola llave.Una vez que tienes creada una cartera solo tienes que dar click en tools/Sweep private keyY te aparecerá una ventana como estaPegas la Clave WIF y le das en crear Transacción.Hay que notar que este proceso no es una Importación de llave, sino más bien un canje, donde retiras los fondos de tu vieja dirección y se depositan en tu nueva dirección menos las comisiones de la red.Quote from: DUPONDIUS on September 22, 2023, 11:20:55 PM¿Sparrow permite decidir que comisiones pago por la transaccion?Si, te da una recomendacion de la comision optima en ese momento.Si quieres practicar con sparrow, puedes reiniciar en TESTNET, la red de pruebas de bitcion y realizar transacciones ahi hasta que te familiarizes con la interfaz y las opciones",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DUPONDIUS",
      "created_time": "September 22, 2023, 11:57:33 PM",
      "body": "¿Alguna idea de cómo reducir la comisión al mínimo?Me da igual si tarda muchas horas en confirmarse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 23, 2023, 12:49:42 PM",
      "body": "Quote from: DUPONDIUS on September 22, 2023, 11:57:33 PM<…>Dependerá de la cartera que estés utilizando para realizar la TX, y de las prestaciones de éstas para poder elegir el fee. Electrum por ejemplo te da ciertas facilidades aunque, por lo menos en la versión Android, no siempre vas a poder elegir el valor exacto de sat/vB que quieras.Si miras ahora mismo la mempool, verás que, a lo largo de las últimas horas, los fees mínimos no han bajado apenas de los 20-24 sats/vByte, un tano la tónica desde hace días:https://mempool.space/es/Según indica la misma página, ahora mismo hay 455.671 TXs sin confirmar, situándose la purga en toda TX a razón de menos de 6,10 sat/vBytes. Es decir, ahora mismo, enviar valores menores de este último no tiene sentido.Mirando la web de Jochen-joenicke te puedes hacer un idea del número de TXs dispuestas a pagar qué fee a lo largo de los últimos 30 días por ejemplo, para ayudarte el fee:https://jochen-hoenicke.de/queue/#BTC,30d,countEn todo caso, si vas a poner un fee bajo para los valores que estamos viendo (tipo 10-15 sat/vByte), te interesaría asegurarte de tener el flag de RBF activo, por si has de subir el fee en algún momento dado.Ten en cuenta que los nodos mineros suelen desechar TXs con fees bajos que no hayan procesado a los 14 días aproximadamente, pero esto no es una ciencia exacta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "September 23, 2023, 01:50:46 PM",
      "body": "No entiendo bien una cosa: si tu fin último es importar los fondos a Bitcoincore o eso te da igual. ¿Es para abrir algun canal de LN? ¿Por qué no funciona la opción de importar clave privada en BitcoinCore?  Con esa cantidad mandar tus sats a una nueva wallet de Sparrow para después volverlos a mover no creo que valga la pena. Además si vas a abrir un canal de LN tendrá que ser con más fondos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DUPONDIUS",
      "created_time": "September 24, 2023, 07:22:45 PM",
      "body": "De acuerdo.Quote from: Drawesome on September 23, 2023, 01:50:46 PMNo entiendo bien una cosa: si tu fin último es importar los fondos a Bitcoincore o eso te da igual. ¿Es para abrir algun canal de LN? ¿Por qué no funciona la opción de importar clave privada en BitcoinCore?  Con esa cantidad mandar tus sats a una nueva wallet de Sparrow para después volverlos a mover no creo que valga la pena. Además si vas a abrir un canal de LN tendrá que ser con más fondos.Es largo de explicar, peor da igual.Muchas gracias por ponerme al día.Un saludo desde la \"España Vacía\".Chao.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}