{
  "id": "topic_5459822",
  "title": "Sitoshi_AnotherMoto",
  "author": "Sitoshi_AnotherMoto",
  "created_time": "July 14, 2023, 04:03:59 PM",
  "content": "This proposal aims to address the issue of dormant Bitcoin, commonly referred to as \"lost\" or \"unclaimed\" coins, by suggesting a mechanism to recycle them back into the mining process. By doing so, we strive to prevent Bitcoin from being permanently lost and ensure the long-term integrity and scarcity of the network.Bitcoin is a decentralized digital currency that relies on private keys for ownership and access to funds. However, numerous Bitcoin wallets remain inactive for extended periods, often due to users losing access to their private keys or abandoning their wallets. This results in a significant amount of Bitcoin becoming inaccessible and presumed lost forever.To prevent the permanent loss of Bitcoin, we propose the implementation of a mechanism that gradually and systematically sends dormant funds back into the mining process after a predefined period of inactivity. Specifically, if a Bitcoin wallet remains not accessed(by simply logging on, opening the wallet) for a continuous period of ten years, the funds associated with that wallet will be redistributed back to the network through the following steps:A comprehensive analysis of the blockchain will be conducted to identify wallets that have not shown any activity for ten years. This process will be automated to ensure accuracy and efficiency.This process will involve adding the dormant coins to the mining reward pool, where they will be available for miners to compete for during their usual mining operations.To ensure fairness and prevent concentration, the redistribution of dormant coins will be algorithmically divided among miners based on their proportional mining power, similar to the current mining reward distribution.The entire process, from identifying dormant wallets to the redistribution mechanism, will be transparent and publicly auditable. Detailed reports and statistics will be made available to ensure transparency and build trust within the Bitcoin community.Preservation of Scarcity: By recycling dormant coins back into the mining process, we ensure that the total supply of Bitcoin remains finite, maintaining the intended scarcity and economic principles of the network.Encouraging Active Ownership: This proposal incentivizes Bitcoin holders to actively manage and secure their wallets to avoid the risk of losing their funds. It promotes responsible ownership and strengthens overall network security.Enhanced Network Stability: The recycling of dormant coins helps distribute previously lost value among active miners, potentially reducing the concentration of mining power and contributing to a more stable and decentralized network.Minimizing Economic Loss: By recovering dormant funds, this proposal minimizes the economic loss associated with permanently lost Bitcoin, ensuring a more efficient allocation of the currency's value.This proposal aims to address the issue of dormant Bitcoin by implementing a mechanism to recycle lost coins back into the mining process after a specified period of wallets not being accessed. By doing so, we can prevent permanent losses, enhance network stability, and ensure the long-term integrity of the Bitcoin network. This proposal welcomes community input, further analysis, and consensus-building to refine and implement the suggested mechanisms successfully...just dont be a dick about it like in other posts i have seen. This space can be very very toxic.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459822",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 14, 2023, 04:08:58 PM",
      "body": "Because certain UTXOs are dormant, that does not mean they are lost. There is also no need to change anything.Lost coins are not actually lost, its value would be transferred to other people that still have access to their bitcoin, as the bitcoin that are still accessible become more scarce.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "July 14, 2023, 04:15:40 PM",
      "body": "Bitcoin wallet activity are not logged, and there is no way of telling if a user has accessed his wallet because that is not how Bitcoin functions. Something like this would either require a central authority or for such activities to be included in the blockchain. In addition, reclaiming or recovering lost Bitcoins presents an entire can of worms. There is no telling of the intentions of the owners, whether they would like to keep and preserve the Bitcoins or if they are truly lost. This process would just be outright stealing the Bitcoins from them, even if they were not moved for long periods of time. The network nor the algorithm shouldn't act as the government, to reclaim assets based on arbitrary criteria.Redistribution of coins isn't necessary because there isn't any threat to Bitcoin's existence if we can just make the denominations a lot smaller. The scarcity of the network and the pre-determined supply of Bitcoins makes it valuable and predictable. Re-distribution of Bitcoin causes unnecessary stress to the economic system, rather than the fixed inflation rates, the market would experience inflation in certain years and deflation in certain years which makes it unstable. Scarcity is directly correlated to the value as well, if the miners were to expect rewards to rise in the future, they would intentionally manipulate the system such that they would instead mine in the more profitable years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ripemdhash",
      "created_time": "July 14, 2023, 04:19:50 PM",
      "body": "How would you like to test that coins are \"lost\" or \"unclaimed\" coins?Sorry you cannot be sure that address whit balance are lost . A lot of People has BTC , but they do not anything -> they hold.Who according you should decised we will take this address and take the BTC for myself? it is Theft!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sitoshi_AnotherMoto",
      "created_time": "July 14, 2023, 05:02:58 PM",
      "body": "How to address coins are \"lost\"?Whenever you access your wallet, a 10 year timer will begin/reset. If the wallet is not accessed again in 10 years the coins will go back to the mine. Keep in mind, i never mentioned activity (sending or receiving), simply accessing, or logging on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "July 14, 2023, 05:37:49 PM",
      "body": "It breaks some protocols, for example Proof of Burn. You can burn a coin in your coinbase transaction, just by taking less coins than you could. Then, there is no lost UTXO, everything is 100% clean, you just have some coinbase output that has lower uint64 value, and there are no other traces. But even if you have some OP_RETURN, then still, there is no reason to bring it back, because using OP_RETURN means that a particular user intentionally removed some coins from circulation.Also, your proposal breaks some puzzles, for example this one: https://bitcointalk.org/index.php?topic=293382.0In that case, you would need to refresh those addresses every 10 years, just to say that \"this puzzle is still not solved, but because of demurrage rules, it has to be recreated\".Quoteby simply logging on, opening the walletYou cannot prove that you have access to some coin, without creating some kind of signature. You need to make a transaction, sign some coins without moving, or wrap some proof in some Homomorphic Encryption, but that way or another, \"logging on\" is not enough, you have to touch your private keys if you want to prove something. Also, you have to choose your accepted proof carefully, because there are ways to trick that you own something without having keys, for example in this way:Code:message=\"Hello World\"address=\"1psPJZYEJrjPtY6kw5Tqtj4mW2yXSSDuH\"signature=\"GwAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAABAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAE=\"Nobody has access to 1psPJZYEJrjPtY6kw5Tqtj4mW2yXSSDuH, but this signature is valid. So, if you want to accept some proofs, then choose them wisely, to avoid attacks like public key recovery.QuoteA comprehensive analysis of the blockchain will be conducted to identify wallets that have not shown any activity for ten years. This process will be automated to ensure accuracy and efficiency.If there will be some consensus rule, like \"UTXOs not touched for 10 years can be claimed by miners, without signatures\", then it will create a huge incentive to mine empty blocks. Currently, when the basic block reward will drop to zero, miners will need to encourage users to move their coins, because fees will be the only incentive. Your proposal breaks that assumption, because miners could collide, and say \"let's mine empty blocks for 10 years, and then we will start collecting a lot of coins from the old times, before all of those halvings\".QuoteTo ensure fairness and prevent concentration, the redistribution of dormant coins will be algorithmically divided among miners based on their proportional mining power, similar to the current mining reward distribution.Note that \"the current mining reward distribution\" is \"winner takes all\". Of course, we have mining pools, but it is not a part of the consensus rules. Also, how do you want to compute \"their proportional mining power\", without writing all shares on-chain?QuoteThe entire process, from identifying dormant wallets to the redistribution mechanism, will be transparent and publicly auditable. Detailed reports and statistics will be made available to ensure transparency and build trust within the Bitcoin community.I hope you don't want to introduce manual selection of outputs. That would be far worse than some simple, and automated rule, like \"move UTXO without signatures, if age is greater than 10 years\".In general, demurrage is something that could be tried on some altcoins, or even better, on some test network. But doing that on Bitcoin would be a disaster. That way or another, if you think seriously about it, you should start from some testnet anyway (or maybe even signet, if you want to manually decide, which coin should be redistributed).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lassdas",
      "created_time": "July 14, 2023, 05:52:15 PM",
      "body": "Why do people care so much about \"lost\" coins anyway?What's in it for them, or anyone (except miners)?I don't get it.You should instead be happy for every coin lost or burned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ripemdhash",
      "created_time": "July 14, 2023, 05:59:14 PM",
      "body": "Quote from: lassdas on July 14, 2023, 05:52:15 PMWhy do people care so much about \"lost\" coins anyway?What's in it for them, or anyone (except miners)?I don't get it.You should instead be happy for every coin lost or burned. Becouse:1. They want money for themself.2. It will kill BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 14, 2023, 06:05:58 PM",
      "body": "Quote from: Charles-Tim on July 14, 2023, 04:08:58 PMLost coins are not actually lost, its value would be transferred to other people that still have access to their bitcoin, as the bitcoin that are still accessible become more scarce.Satoshi once said that.😉I don't remember the quote/unquote though.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 05:02:58 PMWhenever you access your wallet, a 10 year timer will begin/reset. If the wallet is not accessed again in 10 years the coins will go back to the mine. Keep in mind, i never mentioned activity (sending or receiving), simply accessing, or logging on. OMG, you are telling me to set a timer or someday I will check my wallet and will see someone took my coins! Never going to happen. You are surely not the first one telling such stupid idea. I read the same somewhere long ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "garlonicon",
      "created_time": "July 14, 2023, 06:52:52 PM",
      "body": "QuoteSatoshi once said that.😉I don't remember the quote/unquote though.Maybe this one?Quote from: satoshi on December 10, 2009, 08:49:02 PMThose coins can never be recovered, and the total circulation is less.  Since the effective circulation is reduced, all the remaining coins are worth slightly more.  It's the opposite of when a government prints money and the value of existing money goes down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 15, 2023, 04:43:50 AM",
      "body": "Quote from: Sitoshi_AnotherMoto on July 14, 2023, 05:02:58 PMHow to address coins are \"lost\"?Whenever you access your wallet, a 10 year timer will begin/reset. If the wallet is not accessed again in 10 years the coins will go back to the mine. Keep in mind, i never mentioned activity (sending or receiving), simply accessing, or logging on. The only achievement of something like this is forcing people to spam the blockchain with pointless transactions. For example I have coins that I acquired back in 2014 when I found out about bitcoin and have not moved them since because there was no reason to move them and I don't want to! Something like this is going to force me to move those coins for no good reason!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "July 15, 2023, 04:52:53 AM",
      "body": "Quote from: ripemdhash on July 14, 2023, 05:59:14 PMBecouse:1. They want money for themself.2. It will kill BTC Both doesn't make sense. For the first point, an increased circulation results in the decrease in the value of each coin. There is no point in recovery that benefits all.For the second, Bitcoin is actually designed to be deflationary in the long run. Economic concepts says that deflation is bad but that concerns more of the fiat and their function as financial stabilizers. Having a lower amount of Bitcoin doesn't actually affect Bitcoin. You can go beyond Satoshis as the lowest denomination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "July 15, 2023, 09:40:41 AM",
      "body": "Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMTo ensure fairness and prevent concentration, the redistribution of dormant coins will be algorithmically divided among miners based on their proportional mining power, similar to the current mining reward distribution.1. Current mining reward distribution actually is \"winner takes all\".2. Hashrate of each miner/pool only can be estimated[1] based on block they've mined.3. How long past blocks should be checked in order to determine the distribution?Quote from: Sitoshi_AnotherMoto on July 14, 2023, 05:02:58 PMHow to address coins are \"lost\"?Whenever you access your wallet, a 10 year timer will begin/reset. If the wallet is not accessed again in 10 years the coins will go back to the mine. Keep in mind, i never mentioned activity (sending or receiving), simply accessing, or logging on. Bitcoin protocol doesn't force wallet software to make log about when the address/wallet is accessed. So your idea is essentially impossible.[1] https://bitcoin.stackexchange.com/a/115090",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d3bt3",
      "created_time": "July 15, 2023, 11:55:57 AM",
      "body": "I'd like to see your list of lost coins please",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "July 15, 2023, 01:00:00 PM",
      "body": "Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMThis proposal aims to address the issue of dormant Bitcoin, commonly referred to as \"lost\" or \"unclaimed\" coins, by suggesting a mechanism to recycle them back into the mining process. By doing so, we strive to prevent Bitcoin from being permanently lost and ensure the long-term integrity and scarcity of the network.Bitcoin is a decentralized digital currency that relies on private keys for ownership and access to funds. However, numerous Bitcoin wallets remain inactive for extended periods, often due to users losing access to their private keys or abandoning their wallets. This results in a significant amount of Bitcoin becoming inaccessible and presumed lost forever.I must say, I have a lot of problems with your proposal. First you usually can't decide in a trustless and decentralized way which coins are lost or where the owner simply doesn't want or have the need to move them. There shouldn't be an authority or force to have to move coins. Period.I even don't see the need for provably lost coins to recycle them back into circulation. Lost coins make those from everybody else a little more valuable. I don't appreciate any scheme that destroys coins deliberately, but as Bitcoin is decentralized and trustless I can't do anything about it.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMThis process will involve adding the dormant coins to the mining reward pool, where they will be available for miners to compete for during their usual mining operations.To ensure fairness and prevent concentration, the redistribution of dormant coins will be algorithmically divided among miners based on their proportional mining power, similar to the current mining reward distribution.The entire process, from identifying dormant wallets to the redistribution mechanism, will be transparent and publicly auditable. Detailed reports and statistics will be made available to ensure transparency and build trust within the Bitcoin community.Miners compete against each other and as said already there's a winner who takes all the block reward. Now you want to redistribute recycled coins based on estimated proportional mining power? Proportional to all miners at once? I'm not sure if I understand you properly. Please, elaborate in more detail!Transparency and auditability sound nice, but explain how you want to do that trustless and decentralized. If an audit shows issues, how do you want to fix those? Transactions are final and non-reversible.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMPreservation of Scarcity: By recycling dormant coins back into the mining process, we ensure that the total supply of Bitcoin remains finite, maintaining the intended scarcity and economic principles of the network.You have that already without your proposal. Active coins in circulation actually benefit in value by provably lost coins. You might not like it but that's your problem.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMEncouraging Active Ownership: This proposal incentivizes Bitcoin holders to actively manage and secure their wallets to avoid the risk of losing their funds. It promotes responsible ownership and strengthens overall network security.By the value of Bitcoins every owner is already incentivised to not loose his private keys or wallet(s). Your proposal forces owners to otherwise unnecessary actions if they don't want or need to move their stash.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMEnhanced Network Stability: The recycling of dormant coins helps distribute previously lost value among active miners, potentially reducing the concentration of mining power and contributing to a more stable and decentralized network.I see a contradiction here as concentration of mining power would benefit due to your proposed redistribution by proportional mining power.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMThis proposal aims to address the issue of dormant Bitcoin by implementing a mechanism to recycle lost coins back into the mining process after a specified period of wallets not being accessed. By doing so, we can prevent permanent losses, enhance network stability, and ensure the long-term integrity of the Bitcoin network.We have about 21*1014 coin units at max with current design and even if we loose half of it it's still more than 1014 coin units. I don't see the need for recycling nor it to be fair and justified in any way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 15, 2023, 01:05:27 PM",
      "body": "Let's keep it simple: Not this shit again!Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMThis proposal welcomes community input, further analysis, and consensus-building to refine and implement the suggested mechanisms successfully...just dont be a dick about it like in other posts i have seen. This space can be very very toxic.You're talking about taking people's money, forcing people to move their money around so they can't be seized by a centralized authority that can decide and change those criteria as it sees fit, and despite going against everything Bitcoin stands for you want us to just congratulate you for your great idea and not to stick it in the lost hole of Uranus?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 15, 2023, 05:31:14 PM",
      "body": "Quote from: stompix on July 15, 2023, 01:05:27 PMLet's keep it simple: Not this shit again!Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMThis proposal welcomes community input, further analysis, and consensus-building to refine and implement the suggested mechanisms successfully...just dont be a dick about it like in other posts i have seen. This space can be very very toxic.You're talking about taking people's money, forcing people to move their money around so they can't be seized by a centralized authority that can decide and change those criteria as it sees fit, and despite going against everything Bitcoin stands for you want us to just congratulate you for your great idea and not to stick it in the lost hole of Uranus? Didn't even thought of it from this point of view. Indeed, if people have Bitcoin hodled for longer than 10 years, then, they would have to move it forceably. It seems to me not a good thing. Of course we al would like to see Satoshi's sats being moved but that's just a wish, not a real need!I also think that the community needs to focus more in other mechanisms to help avoinding to \"lose\" Bitcoins instead of trying to recover them or sending them back to circulation via mining!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "July 16, 2023, 06:43:30 AM",
      "body": "Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMThis proposal aims to address the issue of dormant Bitcoin,Nonsense. It is not an \"issue\" for a person to decide that they want to save money for the future and not spend it right now.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMcommonly referred to as \"lost\" or \"unclaimed\" coins,I prefer to just call it what it is, \"unspent\".Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMby suggesting a mechanism to recycle them back into the mining process.Say what you mean: \"suggesting a mechanism to STEAL money from others\"Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMBy doing so, we strive to prevent Bitcoin from being permanently lostNothing lasts forever. If you don't want to lose your bitcoins, then make sure you have a good system of storing and securing your private keys.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMand ensure the long-term integritySounds to me like you're trying to DESTROY the integrity, not preserve it.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMand scarcity of the network.Wouldn't permanently lost bitcoins IMPROVE scarcity?Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMnumerous Bitcoin wallets remain inactive for extended periods, often due to users losing access to their private keys or abandoning their wallets.Or simply choosing not to spend their bitcoins.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMThis results in a significant amount of Bitcoin becoming inaccessibleThat's the point, isn't it?  My bitcoins are SUPPOSED to be inaccessible to you.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMand presumed lost forever.You can presume whatever you want, but that doesn't give you the right to steal them.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMTo prevent the permanent loss of Bitcoin, we propose the implementation of a mechanism that gradually and systematically sends dormant funds back into the mining process after a predefined period of inactivity.No thanks. This has been suggested hundreds of times before. Your scam to steal bitcoins is not welcome in the bitcoin community. Go take your stea-a-coin altcoin idea elsewhere. I'm sure there are some scammers and thieves in the world that would love to support you in this endeavor.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMSpecifically, if a Bitcoin wallet remains not accessed(by simply logging on,There's no such thing as \"logging on\" to Bitcoin.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMopening the wallet)There's no way to know whether or not someone has \"opened their wallet\". Perhaps you fail to understand what the word decentralized means?Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMfor a continuous period of ten years, the funds associated with that wallet will be redistributed back to the networkTen years? Ten years!?!If someone in their 20s wants to use Bitcoin to save for retirement, they may not touch those bitcoins for at least 40 and possibly as much as 70 years! And you want to steal their bitcoins just because they are planning and preparing for their future?Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMdont be a dick about it like in other posts i have seen.So you're already aware that this nonsense has been presented in the past, and you're already aware that it wasn't received well, and yet here you are being a dick about it and rehashing the same tired trash yet again.  Just go away please.Quote from: Sitoshi_AnotherMoto on July 14, 2023, 04:03:59 PMThis space can be very very toxic.That's what happens when thieves come here and try to convince the gullible among us to join them in their crusade to take bitcoins away from others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 16, 2023, 07:25:32 AM",
      "body": "I'm saving bitcoin for retirement and will not move my coins for 20 years. You've just stolen my money.I've timelocked some bitcoin for 21 years as an inheritance for a new family member. You've just stolen my money.I'm a political dissident who has been detained without trial by a dictatorship for 15 years. You've just stolen my money.I've been sent to jail for non-violent victimless crimes for 10 years. You've just stolen my money.I've been working in another country for 10 years with some wallets safely stored at my parent's/other family member's house which I have not accessed. You've just stolen my money.There are a hundred other reasons someone might not move their coins for 10 years. That does not give you the right to steal them.And that's without even touching on the crazy idea of implementing a system which allows coins to be moved with providing a signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "July 16, 2023, 10:53:46 AM",
      "body": "Quote from: Sitoshi_AnotherMoto on July 14, 2023, 05:02:58 PMHow to address coins are \"lost\"?Whenever you access your wallet, a 10 year timer will begin/reset. If the wallet is not accessed again in 10 years the coins will go back to the mine. Keep in mind, i never mentioned activity (sending or receiving), simply accessing, or logging on. It's Bitcoin, not a domain renewal, you know.Also, that approach, to recycle lost coins into mining process, is absolutely wrong and devastating. Imagine, I have a wallet where I hodl bitcoins. 8 years have passed and somehow bad thing happened to me, I got into a coma or was arrested for political reasons or etc. Let's assume I got wrongly convicted of attempting a crime. I spent 4 years in prison and then they freed me. What happens when I go outside? My wealth, my bitcoins, are lost. Also, radical changes like that, will finally bring bad power. If people feel okay to do such a huge changes, then I'm afraid a dictatorship will slowly take over bitcoin. At first we set 10 years, then 5 years, then someone will come up with an idea to recycle all bitcoin wallets that don't come from exchange and aren't KYC verified. Just leave things the way they are, there is no need of such a change at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}