{
  "id": "topic_5444519",
  "title": "MeCsc",
  "author": "MeCsc",
  "created_time": "March 11, 2023, 08:02:32 PM",
  "content": "Though Lightening Network has been helping in solving Scaling problem but the increase in block size would have been more effective than using lightening network. Am curious  why bitcoin doesn't want to increase it's block size from 1mb ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444519",
  "comments": [
    {
      "author": "digaran",
      "created_time": "March 11, 2023, 10:36:14 PM",
      "body": "Quote from: MeCsc on March 11, 2023, 08:02:32 PMThough Lightening Network has been helping in solving Scaling problem but the increase in block size would have been more effective than using lightening network. Am curious  why bitcoin doesn't want to increase it's block size from 1mb ? Various reasons, bitcoin is not ready for mass adoption.Price should be high and stable enough to make it profitable for miners and less costly for nodes.The concept of lightning network/off chain solutions is great, you just need to trust them enough and use them for small amounts, that's the idea of off chain network anyways.People are already paying the fees, though they are not trusting a third party when using the main chain, but if a solution such as LN is well known and trustworthy, I can't see a reason as to why people shouldn't use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 12, 2023, 04:30:48 AM",
      "body": "We did increase the block size and it hasn't been \"1MB\" ever since 2017 soft fork and the more people use SegWit in their transactions the bigger that size can be (up to 4MB).But as for scaling, the only solution to really scale bitcoin is to use a second layer because no matter how much the block size is increased, it will never be enough. So it has to be increased so much so that it doesn't hurt decentralization (eg. not making it difficult for people running full nodes among other reasons) while it can store more transactions.The current size is enough for now considering how blocks are either full or almost full most of the times without having any excess transactions that can't confirm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeCsc",
      "created_time": "March 12, 2023, 03:53:12 PM",
      "body": "Quote from: pooya87 on March 12, 2023, 04:30:48 AMWe did increase the block size and it hasn't been \"1MB\" ever since 2017 soft fork and the more people use SegWit in their transactions the bigger that size can be (up to 4MB).But as for scaling, the only solution to really scale bitcoin is to use a second layer because no matter how much the block size is increased, it will never be enough. So it has to be increased so much so that it doesn't hurt decentralization (eg. not making it difficult for people running full nodes among other reasons) while it can store more transactions.The current size is enough for now considering how blocks are either full or almost full most of the times without having any excess transactions that can't confirm.Doesn't LN using third party affect bitcoin Decentralization  ?Also is setting up a LN complex? And  does it work well for low Transactions?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "March 12, 2023, 06:34:31 PM",
      "body": "Quote from: MeCsc on March 11, 2023, 08:02:32 PMAm curious  why bitcoin doesn't want to increase it's block size from 1mb ? Comparably to the rest, I'll have to disagree with the common opinion, that the Bitcoin network can't handle larger blocks. The main reason I see, is that increasing the block size breaks backwards compatibility.Quote from: digaran on March 11, 2023, 10:36:14 PMPrice should be high and stable enough to make it profitable for miners and less costly for nodes.Completely your opinion. Price is high enough apparently; difficulty is in ATHs lots of months now. Also, running a node is cheap enough. Quote from: MeCsc on March 12, 2023, 03:53:12 PMDoesn't LN using third party affect bitcoin Decentralization  ?Depends on what third party you mean. Third parties like BlueWallet or Wallet of Satoshi that act as middlemen, do indeed hurt, not only decentralization, but in the ability to control custody of your funds. Quote from: MeCsc on March 12, 2023, 03:53:12 PMAlso is setting up a LN complex? And  does it work well for low Transactions? It is complex, in comparison with a simple on-chain wallet like Electrum. Yes, it works well for low-value transactions; in fact, it's specially designed for those.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeCsc",
      "created_time": "March 13, 2023, 04:35:25 AM",
      "body": "Quote from: BlackHatCoiner on March 12, 2023, 06:34:31 PMCompletely your opinion. Price is high enough apparently; difficulty is in ATHs lots of months now. Also, running a node is cheap enough. With U.S. Treasury Department Planning 30% increase in Tax on Crypto Mining Firms, will this not affect the cost of a node?  [NEWS] Biden budget proposes 30% tax on crypto mining electricity usageQuote from: BlackHatCoiner on March 12, 2023, 06:34:31 PMDepends on what third party you mean. Third parties like BlueWallet or Wallet of Satoshi that act as middlemen, do indeed hurt, not only decentralization, but in the ability to control custody of your funds. LN using third party is the biggest discouragement that affect people from using it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "March 13, 2023, 06:18:54 AM",
      "body": "Quote from: MeCsc on March 13, 2023, 04:35:25 AMQuote from: BlackHatCoiner on March 12, 2023, 06:34:31 PMCompletely your opinion. Price is high enough apparently; difficulty is in ATHs lots of months now. Also, running a node is cheap enough. With U.S. Treasury Department Planning 30% increase in Tax on Crypto Mining Firms, will this not affect the cost of a node?  [NEWS] Biden budget proposes 30% tax on crypto mining electricity usageThat is still a proposal and not a law. Besides it is not a global thing, it only affects like 4% of the world!QuoteLN using third party is the biggest discouragement that affect people from using it? LN doesn't need or use third parties. There was ways to use it through a third party just like there are ways to use bitcoin through a third party (eg. using centralized and custodial Coinbase wallet).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "March 13, 2023, 12:22:59 PM",
      "body": "Quote from: MeCsc on March 13, 2023, 04:35:25 AMQuote from: BlackHatCoiner on March 12, 2023, 06:34:31 PMCompletely your opinion. Price is high enough apparently; difficulty is in ATHs lots of months now. Also, running a node is cheap enough. With U.S. Treasury Department Planning 30% increase in Tax on Crypto Mining Firms, will this not affect the cost of a node?  [NEWS] Biden budget proposes 30% tax on crypto mining electricity usage1. You can run full node without perform any mining.2. For mining pool, cost of running few nodes is negligible compared with cost of running other infrastructure or pay their worker.3. Miner who perform mining by connecting to centralized pool don't need to run full node.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}