{
  "id": "topic_5427775",
  "title": "whalesbet",
  "author": "whalesbet",
  "created_time": "December 10, 2022, 09:36:26 PM",
  "content": "Hi guys,nice to meet you all, we just launched our platform https://whales.bet on RSK (Rootstock Blockchain).We are a fully decentralized,trustless blockchain-based web application in which anyone can participate on or create their own betting pools. There are no limits to what you can bet on; any website can be queried against via open APIs (Json,XML or HTML parse) and also via WolframAlpha and have the intended result parsed and uploaded to the blockchain using provable oracle service.RBTC is the main cryptocurrency of RSK EVM network and its pegged 1:1 with BTC BTC. You can know more about the project and how to get RBTC here: https://whales.bet/about.htmlWe have current a bet active, \"worldcup2022\" with a current pool of 0.001 RBTC , guess who the winner of World Cup and get the Prize.Twitter: https://twitter.com/whalesdotbetTelegram: https://t.me/whalesdotbet",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427775",
  "comments": [
    {
      "author": "AB de Royse777",
      "created_time": "December 10, 2022, 09:40:20 PM",
      "body": "The site does not load properly I guess although I was checking it on TOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whalesbet",
      "created_time": "December 10, 2022, 09:42:50 PM",
      "body": "Hi, yea it might be it, metamask is not fully compatible with TOR networks , our site uses ethersjs API to get the contract data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "December 10, 2022, 10:01:08 PM",
      "body": "It says here on the forum and on your website that you are a \"trustless blockchain-based web application\". Is this a mistake or is your application really trustless? That is, your application cannot be trusted? How can you use an application that cannot be trusted?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whalesbet",
      "created_time": "December 11, 2022, 04:52:56 PM",
      "body": "By \"Trustless\" we're meaning that we don't need to be trust, because us as creators can't alter results or choose what will be,lock user funds, alter code in favor of someone,choose what will be betted and so on..Everything is running in a blockchain smart contract and results gathered by its own trusting source choosed by the user, and gathered automatic via API by a network of servers running by the Oracle , we don't have any user information stored in servers and we don't hold any user funds aswell, its all stored on RSK blockchain smart contract which is merged mined with Bitcoin blockchain.Thanks for the question anyway, English is not my main language so maybe i have used the wrong word to describe this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mobile-Mining",
      "created_time": "December 12, 2022, 02:55:05 PM",
      "body": "Quote from: Xal0lex on December 10, 2022, 10:01:08 PMIt says here on the forum and on your website that you are a \"trustless blockchain-based web application\". Is this a mistake or is your application really trustless? That is, your application cannot be trusted? How can you use an application that cannot be trusted?https://i.imgur.com/C9qmQWg.png\"Trustless\" is a common term used here for decentralised. A platform that requires zero input from 3rd parties and only the users input is trustless because there is nobody that you need to trust to execute in the way you intend. I do agree though, it's confusing because it also can mean not trustworthy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "December 12, 2022, 03:30:15 PM",
      "body": "Quote from: Mobile-Mining on December 12, 2022, 02:55:05 PMQuote from: Xal0lex on December 10, 2022, 10:01:08 PMIt says here on the forum and on your website that you are a \"trustless blockchain-based web application\". Is this a mistake or is your application really trustless? That is, your application cannot be trusted? How can you use an application that cannot be trusted?\"Trustless\" is a common term used here for decentralised. A platform that requires zero input from 3rd parties and only the users input is trustless because there is nobody that you need to trust to execute in the way you intend. I do agree though, it's confusing because it also can mean not trustworthythe user is an old user in crypto. he knows what trustless mean in crypto.by the way, you have to connect your metamask to see the page loads. but after clicking, its just taking a long time. a minute past its still FETCHING BET... there really is an issue to it and i'm not using TOR. after many issues, i already doubt about that 1:1 BTC on some wrap system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "December 13, 2022, 06:52:33 PM",
      "body": "I have to say the \"idea\" is good, I have no clue if it will work or liked or hyped or whatever, maybe it will fail, maybe it will go for a long time, I have zero clue.All I can say right now is that the \"premise\" of this is good enough to support a whole business and I feel like someone who is famous and rich would have taken this to millions of dollars easily, because they have money and fame and that gives you the most important two things for any casino, one is capital as with every business, and the other is to influence people to check it out which is also important in every business. Will this go on? Depends on marketing and capital of the creators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whalesbet",
      "created_time": "April 05, 2023, 10:04:58 AM",
      "body": "Hi, thanks, have updated the site, now blockchain info reads even when not connected and its faster.Have also updated design and optimized code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}