{
  "id": "topic_5474817",
  "title": "Flein",
  "author": "Flein",
  "created_time": "November 20, 2023, 09:45:47 PM",
  "content": "Hi, can I sweep the private key directly to my Ledger address, or do I need to sweep it to Electrum standard wallet then send it to the Ledger address ?Also a noob question. Do I need to download and update Bitcoin Core to use Electrum?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474817",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "November 20, 2023, 09:55:03 PM",
      "body": "Quote from: Flein on November 20, 2023, 09:45:47 PMHi, can I sweep the private key directly to my Ledger address, or do I need to sweep it to Electrum standard wallet then send it to the Ledger address ?For security, you should first create a new wallet in ledger (generate a new seed). Save the seed in a paper.Then generate your public address Then you transfer all your funds from the old wallet (casascius) to this new public address you just generated.Don't sweep private keys. Generate a new seed in your ledger. Then move from electrum to ledger.QuoteAlso a noob question. Do I need to download and update Bitcoin Core to use Electrum?No. Just download the electrum wallet from electrum.orgNo need to use bitcoin core.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "November 20, 2023, 09:56:01 PM",
      "body": "Quote from: Flein on November 20, 2023, 09:45:47 PMHi, can I sweep the private key directly to my Ledger address, or do I need to sweep it to Electrum standard wallet then send it to the Ledger address ?You can. Just import the private key on Electrum rather than create a brand new wallet and then sweep the coins to it. After importing it, you can send the coins directly to your Ledger address. That will save you a step and an extra transaction.Open Electrum -> Import Bitcoin addresses or private keys -> Type your private-key -> Press NextQuote from: Flein on November 20, 2023, 09:45:47 PMDo I need to download and update Bitcoin Core to use Electrum?You don't. Electrum is a lightweight wallet, so you'll connect to a third party node by default.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "November 20, 2023, 10:03:20 PM",
      "body": "No need to sign online. Don't risk it, keep your private key offline.LoyceV post full instructions here tomorrow!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 20, 2023, 10:22:06 PM",
      "body": "You can import your private key in electrum and send the fund to any address you want. For more security, it's recommended to sign your transaction offline. To do so, you need to create a watch-only wallet with your address on an online device and another wallet with your private key on an offline device (preferably an air-gapped device). Create an unsigned transaction using your watch-only wallet, export the unsigned transaction using a QR code or a text file. Sign the transaction on your offline wallet, export the signed transaction and then broadcast it using your online device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flein",
      "created_time": "November 20, 2023, 11:30:49 PMLast edit: November 21, 2023, 12:00:02 AM by Flein",
      "body": "Thanks for the answers! Is there a video or step by step guide on this signing process? This seems very complicated to me.Quote from: hosseinimr93 on November 20, 2023, 10:22:06 PMFor more security, it's recommended to sign your transaction offline. To do so, you need to create a watch-only wallet with your address on an online device and another wallet with your private key on an offline device (preferably an air-gapped device). Does existing Ledger qualify as offline device? Or should I generate a new seed like bitmover advices? Can this be done offline?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "November 20, 2023, 11:58:43 PM",
      "body": "Quote from: Flein on November 20, 2023, 11:30:49 PMThanks for the answers! Is there a video or step by step guide on this signing process? This seems very complicated to me.You need two devices to be able to make an airgap/offline transaction. Please read the guide from Electrum docs here below- https://electrum.readthedocs.io/en/latest/coldstorage.htmlOr follow the guide from this video below.- https://youtu.be/DQumISxkJsQ?si=KtBwBzhwjefpGClp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flein",
      "created_time": "November 21, 2023, 12:10:25 AM",
      "body": "Quote from: BitMaxz on November 20, 2023, 11:58:43 PMQuote from: Flein on November 20, 2023, 11:30:49 PMThanks for the answers! Is there a video or step by step guide on this signing process? This seems very complicated to me.You need two devices to be able to make an airgap/offline transaction. Please read the guide from Electrum docs here below- https://electrum.readthedocs.io/en/latest/coldstorage.htmlOr follow the guide from this video below.- https://youtu.be/DQumISxkJsQ?si=KtBwBzhwjefpGClpThe video was very good, thanks. But how do I proceed in the start with the private key, do I use sweep on the offline wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 21, 2023, 01:31:55 AM",
      "body": "Quote from: Flein on November 20, 2023, 11:30:49 PMDoes existing Ledger qualify as offline device? Or should I generate a new seed like bitmover advices? Can this be done offline?Ledger is an hardware wallet which yes qualifies as an offline wallet, the problem is we do not know how you were signing your transaction or how you were using the seed generated with it. If by any chance it has been imported before into an online wallet then it doesn’t qualify again to be an offline wallet. You remove all this doubt I would say it is best you create another one, since you have a better knowledge now of how offline wallet are at least you will protect this one better Quote from: Flein on November 21, 2023, 12:10:25 AMThe video was very good, thanks. But how do I proceed in the start with the private key, do I use sweep on the offline wallet?Yes technically the sweeping of private key is just like sending bitcoin to an address (this time to your own already generated address) so it could be done on an offline device and then singed on the online one. Just follow the link above to Create an offline transaction and how to sign it on the online device but use this guide to sweeping it instead of regular transactions,  https://electrum.readthedocs.io/en/latest/faq.html#can-i-sweep-private-keys-from-other-bitcoin-clients",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "November 21, 2023, 04:30:53 AM",
      "body": "Quote from: Flein on November 21, 2023, 12:10:25 AMThe video was very good, thanks. But how do I proceed in the start with the private key, do I use sweep on the offline wallet?In you offline machine, proceed to create a new wallet and select the option \"Import bitcoin address or private keys\" and paste your prvKey there.Your Casascius' mini-private key is supported by Electrum and wont be needing additional prefix since the address is legacy.In you online machine, do the same procedure but import the address instead of the mini-private key.Then you can follow the same cold-storage setup procedure to create, sign and broadcast a transaction that'll send the entire funds to your Ledger.I noticed that the video is old, in the new version, you can export/import PSBT transactions as file via \"Share->Save to file\".Note: Confirm every character of the address before broadcasting the finalized transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seek3r",
      "created_time": "November 21, 2023, 05:12:40 AM",
      "body": "I dont know where you are located right now but you might wanna consider to sell these casascius instead of peeling it.You will get a good premium on the coin as long as it is still unpeeled. We have a collectibles section in the forum where there are enough collectors who are always looking for these coins. Especially Casascius The user @minerjones - who is really trusted here and has already accompanied or concluded a number of deals himself - will certainly be able to help you with the sale. Maybe worth considering... the coin stays unpeeled and you would get more than the nomination of that coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flein",
      "created_time": "November 21, 2023, 07:01:58 AM",
      "body": "Ok, so on the offline account I just use import in the start instead of sweep on an standard account? Where in the steps do I input my newly generated Ledger address?About selling these. I live in Norway. Sadly there is no market for this here. I used to be very active here in the marketplace, and after being offline for some months my account got hacked and scammed someone. I registered again, and just posted a few posts, when I returned here some months later my new account had been banned for spamming(?). Seems to me this site isn’t very secure. I have a hard time trusting selling and buying here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "November 21, 2023, 07:14:07 AM",
      "body": "Quote from: Flein on November 21, 2023, 07:01:58 AMOk, so on the offline account I just use import in the start instead of sweep on an standard account?\"Offline Electrum wallet\", yes, what you need is to create a new 'imported' wallet containing the private key.This wallet is only required to sign the transaction that you'll create in the online Electrum wallet.Quote from: FleinWhere in the steps do I input my newly generated Ledger address?During the step when sending a new transaction in the 'Send' tab of online Electrum wallet.That'll be your recipient \"Pay to\" address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flein",
      "created_time": "November 21, 2023, 07:42:58 AM",
      "body": "Quote from: nc50lc on November 21, 2023, 07:14:07 AMQuote from: Flein on November 21, 2023, 07:01:58 AMOk, so on the offline account I just use import in the start instead of sweep on an standard account?\"Offline Electrum wallet\", yes, what you need is to create a new 'imported' wallet containing the private key.This wallet is only required to sign the transaction that you'll create in the online Electrum wallet.Quote from: FleinWhere in the steps do I input my newly generated Ledger address?During the step when sending a new transaction in the 'Send' tab of online Electrum wallet.That'll be your recipient \"Pay to\" address.Excellent, thank you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seek3r",
      "created_time": "November 21, 2023, 07:53:18 AM",
      "body": "Quote from: Flein on November 21, 2023, 07:01:58 AMAbout selling these. I live in Norway. Sadly there is no market for this here. I used to be very active here in the marketplace, and after being offline for some months my account got hacked and scammed someone. I registered again, and just posted a few posts, when I returned here some months later my new account had been banned for spamming(?). Seems to me this site isn’t very secure. I have a hard time trusting selling and buying here.Ok, understandable. If I were you I would choose that way aswell, especially if it's one of the larger coins. The risk of something going wrong during transport is simply too great.With the new account, the buyer will certainly only agree to an exchange with middleman.However, with the help of others the process shouldn't be a problem. To be on the safe side, test with a quickly created paper wallet or similar with a small amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 21, 2023, 08:14:06 AM",
      "body": "Quote from: Flein on November 20, 2023, 11:30:49 PMIs there a video or step by step guide on this signing process?This is how I would do it:Quote from: LoyceV on February 19, 2021, 05:35:55 PMOnline:Install Electrum on your PC.Import your address to create a watch-only wallet.Preview the transaction, Copy the unsigned transaction. Put it on a USB stick.Offline and running without hard drive storage:Get a Linux LIVE DVD. Use Knoppix or Tails for instance, or any other distribution that comes with Electrum pre-installed.Unplug your internet cable. Close the curtains. Reboot your computer and start up from that DVD. Don't enter any wireless connection password. Keep it offline.Start Electrum. Import your private key.Copy your unsigned transaction from the USB stick, load it into Electrum.CHECK the transaction in Electrum. Check the fees, check the amount, check all destination addresses (character by character).If all is okay, sign the transaction. Copy it back to your USB stick.Turn off the computer. That wipes the Live LINUX from memory and all traces are gone.Online:Use your normal online Electrum to (check again and) broadcast the transaction.Bonus:After moving all your Bitcoin, and once the transaction confirmed, check if you own Forkcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flein",
      "created_time": "November 21, 2023, 08:25:33 AM",
      "body": "The Linux Live DVD is too complicated, but thank you anyway! I will give the offline signing a try with 0.5 Casascius and report back. Thank you all so far!Edit: Can I create a new Ledger Wallet on an offline machine?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 21, 2023, 09:00:45 AM",
      "body": "Quote from: Flein on November 21, 2023, 08:25:33 AMThe Linux Live DVD is too complicated, but thank you anyway!It's really not that complicated, but takes some time. When dealing with 0.5 Bitcoin, it's the only way to be certain malware can't get to your coins. The chance may be small but the risk is huge.QuoteEdit: Can I create a new Ledger Wallet on an offline machine?I can't tell: if the new Ledger wants an update first, it may not work. But it doesn't hurt to just try.Note that \"offline\" is not the same as air gapped, if you plug your internet cable back in later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flein",
      "created_time": "November 21, 2023, 09:13:31 AM",
      "body": "My Ledgers are old now an will probably need to be updated. I probably need create a new Ledger wallet on an online machine, but there shouldn’t be much risk right? The Ledger is only receiving unless I missed something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abdussamad",
      "created_time": "November 21, 2023, 09:42:44 AM",
      "body": "You can sweep directly to an address in your ledger wallet. You don't need to create a new wallet to do this. https://bitcoinelectrum.com/sweeping-your-private-keys-into-electrum/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}