{
  "id": "topic_5441081",
  "title": "Onyeeze",
  "author": "Onyeeze",
  "created_time": "February 24, 2023, 10:39:45 AM",
  "content": "Some people understand Bitcoin in different specifications, some people out there always think that Bitcoin is the shortcut of getting rich when you invest in Bitcoin, but have not seen Bitcoin as short way of making money, as Bitcoiner, are we not sure that it's encouraging to think that Bitcoin is the shortest way of making money, because i heard people arguing of Bitcoin as as source of liberating people from financial problems but i disagree with that, because if bitcoin were the shortest root to solve financial problems many people would have be out of financial issues. What's your take on these?. I know that what have advantages still have disadvantages, hoping with Bitcoin to survive can cause delay on some of our opportunities,",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441081",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "February 24, 2023, 11:21:08 AM",
      "body": "If you do not have money, how are you going to invest in bitcoin? It will not be possible. You need money to have more money. But in the past, some people were earlier engaging themselves in everything that has to do with bitcoin, what you can afford wilth little amount, this people are very rich now. Someone that mistakenly bought bitcoin in the past very early and he never sold it till now, or sold it at a very high price, that may be true about them if they were not reach at that time. They may not be rich in money, but they were rich in knowledge and they were positive about bitcoin.But now that bitcoin marketcap has increased very significantly, the volatility may reduce, and even if the volatility is still not reduced significantly but reduce just slightly and bitcoin get to $1 million, this will take many years before it will be achieved. Also knowing that we must do something to earn bitcoin, or using fiat or other money to buy bitcoin. If you invest at the right time, as bitcoin still remain a speculative asset, there is opportunity in the future, but for people that think it can bring financial freedom very soon, they may be disappointed, but if they buy at the right time like now and do not sell for a long time, they will not be disappointed as bitcoin will reach 10x or more again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "February 24, 2023, 12:18:59 PM",
      "body": "Quote from: Onyeeze on February 24, 2023, 10:39:45 AMSome people understand Bitcoin in different specifications, some people out there always think that Bitcoin is the shortcut of getting rich when you invest in Bitcoin, but have not seen Bitcoin as short way of making moneyFine and good people want an alternative to their finances in a decentralized way as bitcoin but when they first heard about the news on bitcoin, what first comes their mind is that long waited opportunity to make wealth, which is true but not the way they had thought because they are newbies viewing it from the outside scope, it requires learning it and knowing it before starting, which also takes time for maturition.Quote from: Onyeeze on February 24, 2023, 10:39:45 AMas Bitcoiner, are we not sure that it's encouraging to think that Bitcoin is the shortest way of making moneyNothing bad about it if you think about it that way, because you can actually realize that dream come through with bitcoin but this does not applies to everyone, some trade and instantly get their reward while some leave it down for a long time serving as an investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "February 24, 2023, 12:31:09 PM",
      "body": "Quote from: Onyeeze on February 24, 2023, 10:39:45 AMSome people understand Bitcoin in different specifications, some people out there always think that Bitcoin is the shortcut of getting rich when you invest in Bitcoin,They are wrong about this, there are more people who lose money than those who made a profit from investing in Bitcoin, that's a misconception because those who believe are not properly educated Quotebut have not seen Bitcoin as short way of making money, as Bitcoiner, are we not sure that it's encouraging to think that Bitcoin is the shortest way of making money, because i heard people arguing of Bitcoin as as source of liberating people from financial problems but i disagree with that, because if bitcoin were the shortest root to solve financial problems many people would have be out of financial issues. What's your take on these?. I know that what have advantages still have disadvantages, hoping with Bitcoin to survive can cause delay on some of our opportunities, I think people have to go back to learn what Bitcoin is and read the whitepaper to fully understand the concept and goal of why Satoshi Nakamoto created Bitcoin, he never mentioned that its a way to make money or get rich, opportunities are just one of the outcome when Bitcoin becomes fully adopted by the majority of the society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Getmon",
      "created_time": "February 24, 2023, 12:36:55 PM",
      "body": "Those who bet on the beginning of bitcoin many years ago are now free of financial difficulties if they were able to hold onto their profits and avoid wasting them. However, this time, the total circulating supply of bitcoin is worth $460 billion and a price of $24,000 per coin. Unless we talk about holding it for another ten years, I am not too assuring of another 2000% growth. When bitcoin is worth trillions of dollars, the time has come when its volatility will slow down. Additionally, the time will come when we will be able to use bitcoin as a form of payment with relative ease in our day-to-day lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fadhilz123",
      "created_time": "February 24, 2023, 12:45:22 PM",
      "body": "Quote from: Onyeeze on February 24, 2023, 10:39:45 AMSome people understand Bitcoin in different specifications, some people out there always think that Bitcoin is the shortcut of getting rich when you invest in Bitcoin, but have not seen Bitcoin as short way of making money, as Bitcoiner, are we not sure that it's encouraging to think that Bitcoin is the shortest way of making money, because i heard people arguing of Bitcoin as as source of liberating people from financial problems but i disagree with that, because if bitcoin were the shortest root to solve financial problems many people would have be out of financial issues. What's your take on these?. I know that what have advantages still have disadvantages, hoping with Bitcoin to survive can cause delay on some of our opportunities, I also don't really agree that Bitcoin is said to be a tool to make money in the short term. Because as I understand it, Bitcoin is very suitable for long-term investments which are also very suitable for making money in the long term. So in my opinion it's not worth it if Bitcoin is only said to be a money maker in the short term. Because while Bitcoin can be very suitable for investment in the long term, of course it can also be in the short term even though the profits that can be generated may not be that big. And one more thing is Bitcoin is also not a shortcut to get rich quick even though many people have gotten rich through Bitcoin when they get multiple profits. But basically Bitcoin is not a shortcut to make everyone rich quicker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "February 24, 2023, 02:36:15 PM",
      "body": "Quote from: Onyeeze on February 24, 2023, 10:39:45 AMSome people understand Bitcoin in different specifications, some people out there always think that Bitcoin is the shortcut of getting rich when you invest in Bitcoin, but have not seen Bitcoin as short way of making money, as Bitcoiner, are we not sure that it's encouraging to think that Bitcoin is the shortest way of making money, because i heard people arguing of Bitcoin as as source of liberating people from financial problems but i disagree with that, because if bitcoin were the shortest root to solve financial problems many people would have be out of financial issues. What's your take on these?. I know that what have advantages still have disadvantages, hoping with Bitcoin to survive can cause delay on some of our opportunities,  People have different way of understanding Bitcoin it because of how they knew about Bitcoin like you said there are many people who will say that Bitcoin is the shortcut of getting rich it because they knew from the commercial or someone told them that if you invest in bitcoin you will get rich which is only the positive effect of Bitcoin without further notice that there are negative effect as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "February 24, 2023, 03:31:56 PM",
      "body": "for those who have knowledge and skills, of course, Bitcoin can make them rich. it is for those who see an opportunity. but not for those with blind ambition.get rich in no time, I don't see that anyone can do. including with Bitcoins. all successful people have a steep road. they achieve it with hard work and perseverance. those who have seen Bitcoin change someone's finances for the better, with trust and consistency in Bitcoin investment. many beginners think it's easy, but in fact, more of those who try to fail to hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "February 24, 2023, 04:24:45 PM",
      "body": "It's so believed everyone on Bitcoin is for a major aim which is to make money, but I must say before you invest in Bitcoin, you sure need money to invest which on a long run, it means before you can be registered on Bitcoin and start making profits you need money, which also implies that Bitcoin doesn't help people from scratch, you need money first before you can invest..Secondly I will say this again Bitcoin is not a 100% crypto for profits because of it inflation and deflation most times, if you really wish to make profits on Bitcoin then you should exercise a little patience and learn more about Bitcoin and it trading,Don't have a serious motive of trying to eradicate poverty with Bitcoin else you might be frustrated and heart broken when you will incure loses, sincerely I would never advice anyone to take Bitcoin as his/her only source of income,if you have the opportunity to invest in other businesses please don't hesitate to do it.This are my thoughts though...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "February 24, 2023, 04:31:22 PM",
      "body": "Wealth and poverty belong to the individual, the way he saves it and deals with money, even if he has more than 100,000 bitcoins, he will be poor within several years, no matter how high the bitcoin price is, if he does not modify his way of thinking and how he deals with liabilities and investing in assets, or moving away from extravagance in lusts.Therefore, Bitcoin is not the solution to be rich, but it will help you get rich, especially if you are from a country where a million dollars is considered obscene wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "February 24, 2023, 05:06:55 PM",
      "body": "Quote from: Onyeeze on February 24, 2023, 10:39:45 AMWhat's your take on these?. I know that what have advantages still have disadvantages, hoping with Bitcoin to survive can cause delay on some of our opportunities, There is no perfect system. Yes bitcoin might be a good reason of some solving financial freedom and problems. Maybe for early buyers who really trusted bitcoin. But those people are probably either a risky investor or just fond of the idea of bitcoin. You cant be sure what wouls be the end game for bitcoin, but many believe it will be use for long term. It is an asset that backed by nothing or reserve but many believed in it thats why its value is ver far since its inception. Me too, I adherr to its uses and advantages. Though we cant deny that bitcoin as well have not all pros it can offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "February 24, 2023, 05:20:04 PM",
      "body": "Some people may differ in some of their views, for example bitcoin is an alternative for future payment instruments by fighting fiat which is inflation or they have views about getting rich from bitcoin investments. I think every individual has a way with their pattern to treat bitcoin as he pleases, including the average is the wishing rich on long-term investments.But bitcoin is the right way to make money in a short time, this is not a shitcoin that can be pumped 100x times and then thrown away, because the process of increasing bitcoin is long and there is always a history that we see and it is not easy to invest in bitcoin there is still a big risk in it due to high volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "February 24, 2023, 06:14:35 PM",
      "body": "People has made profits from owning estates or land properties and people have lost money doing so. This is just an explanation of the unpredictable nature of investing. My problem is not that people are telling others that Crypto-currency is gives profits but the way and manner people explain this to others. Never give someone a financial advice and stand on your ground as hundred percent always educate them also about the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "akuntester1",
      "created_time": "February 24, 2023, 06:47:07 PM",
      "body": "Quote from: Onyeeze on February 24, 2023, 10:39:45 AMi heard people arguing of Bitcoin as as source of liberating people from financial problems but i disagree with that, because if bitcoin were the shortest root to solve financial problems many people would have be out of financial issues. What's your take on these?. I think the mindset of people who think Bitcoin is the shortest way to quickly fix their financial problems, sometimes it might end up being a disappointment.Because of their initial mindset they expected big profits quickly and it was not as easy as they imagined.People who can be successful and rich with Bitcoin in my opinion are people who can really take advantage of the opportunities that exist with the money they have.Sometimes successful people with Bitcoin seem easy to others, but in reality they are faced with many risks that we may not necessarily be able to deal with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "February 24, 2023, 07:20:50 PM",
      "body": "Quote from: ajiz138 on February 24, 2023, 05:20:04 PM~snip~But bitcoin is the right way to make money in a short time, this is not a shitcoin that can be pumped 100x times and then thrown away, because the process of increasing bitcoin is long and there is always a history that we see and it is not easy to invest in bitcoin there is still a big risk in it due to high volatility.It is that reality that attracts some people and plunges into disadvantage. Because they don't want to learn much and immediately benefit. Worse they don't hesitate to borow money in the Bank to get into this highly volatile trade with large funds. In the end, they suffered a lot of losses because they didn't understand crypto so they said crypto as a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "February 24, 2023, 09:31:30 PM",
      "body": "Almost people mindset about Bitcoin is the way how to be richest person by investing or trading, no doubt with many people want to earn much profit and increasing their investment assets trough Bitcoin with shorth time. There are not matter about mindset want to earn much profit in Bitcoin investment if have right way and smart analyze how to research with Bitcoin price day by day.Have fatal mistake mindset with Bitcoin investment and not ready if price dropped later, many people have one side accepted from Bitcoin how to earn much profit but they was forget about how Bitcoin investment make us losing our fund when price drop drastically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "February 24, 2023, 10:44:35 PM",
      "body": "People have different understandings and different points of view of bitcoin. It is not necessary for everyone to have that same kind of understanding of bitcoin, unless they have the basics. People think Bitcoin is some quick rich scheme, and the reason behind this is very clear. Some people bought bitcoin very early and kept it until the price grew high, and they became so rich with that money. The internet got better of the news, and they got viral for investing so little money and in return, they got millions, I think for this kind of viral news, common people think that bitcoin is something that can make them rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "February 25, 2023, 03:10:01 AM",
      "body": "Quote from: Onyeeze on February 24, 2023, 10:39:45 AMSome people understand Bitcoin in different specificationsIt is not a matter if we all use Bitcoin on Bitcoin network. Agree or disagree, if we use Bitcoin on its network, we are contributing to keep its network alive and become bigger. We are helping Bitcoin adoption.Quotesome people out there always think that Bitcoin is the shortcut of getting rich when you invest in Bitcoin, but have not seen Bitcoin as short way of making money, as Bitcoiner, are we not sure that it's encouraging to think that Bitcoin is the shortest way of making moneyIf they see shortcut with Bitcoin, they will use leverage and bet then lose money. However it is not anything faulty from Bitcoin, those people are only stupid and very greedy.It is more like a shortcut to get poorer for those people, not to get richer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "February 25, 2023, 03:48:01 AM",
      "body": "Quote from: Onyeeze on February 24, 2023, 10:39:45 AMSome people understand Bitcoin in different specifications, some people out there always think that Bitcoin is the shortcut of getting rich when you invest in Bitcoin, but have not seen Bitcoin as short way of making money, as Bitcoiner, are we not sure that it's encouraging to think that Bitcoin is the shortest way of making money, because i heard people arguing of Bitcoin as as source of liberating people from financial problems but i disagree with that, because if bitcoin were the shortest root to solve financial problems many people would have be out of financial issues. What's your take on these?. I know that what have advantages still have disadvantages, hoping with Bitcoin to survive can cause delay on some of our opportunities, On my experience, When I say bitcoin, here are their mindset, Crypto, Investment, Scam, Digital Money, blockchain, for the people who have been a victim of scam, using bitcoin, their thinking is scam, which we cannot blame them not to trust bitcoin, for others who understand and learn the benefit of it, its either investment, digital money.The liberating of the people is that we have full control of the money, unlike the money in our banks that being held, and being use to get more profit for our money, giving us a few slice, of the bigger circle, liberating is not about having money but free from other organization, just for example, when you deposit money, they don't have any restriction, but once we are going to withdraw all the money we are being for to just get it in a hard way which is wrong, with bitcoin/blockchain, we have full control of our money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "February 25, 2023, 05:19:57 AM",
      "body": "Quote from: Onyeeze on February 24, 2023, 10:39:45 AMSome people understand Bitcoin in different specifications, some people out there always think that Bitcoin is the shortcut of getting rich when you invest in Bitcoin, but have not seen Bitcoin as short way of making money, as Bitcoiner, are we not sure that it's encouraging to think that Bitcoin is the shortest way of making money, because i heard people arguing of Bitcoin as as source of liberating people from financial problems but i disagree with that, because if bitcoin were the shortest root to solve financial problems many people would have be out of financial issues. What's your take on these?. I know that what have advantages still have disadvantages, hoping with Bitcoin to survive can cause delay on some of our opportunities, There's nothing bad depending on Bitcoin as a means of elevating yourself from your financial problem. Bitcoin can be used as an investment opportunity because of the features it has like it's limited supply and constant demand it gets from the public. This features bring about the price appreciation of the coin so you can use it as both an investment opportunity and a currency. There's no shortcut of getting rich and that's what people don't understand. No matter what you want to do to get rich, you'll always put work in them and most times the amount of work needed will be more than what you were putting in at the other means you tried in getting yourself rich.If you results to scamming in trying to get rich, you'll need money invested in some tools that can be used to deceive gullible investors. You'll need sleepless night working on your schema etc. The shortcut people think leads to success actually end up costing them more as you could sacrifice your life in the process or freedom of movement by ending up in jail so youactually end up risking more when those shortcut are taken.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}