{
  "id": "topic_5449398",
  "title": "Greggry",
  "author": "Greggry",
  "created_time": "April 19, 2023, 07:21:48 AM",
  "content": "Please am trying to understand how the systems work that's why I need more clarification from you. I watch this cryptocurrency prices going up and down the axis but often times I ask myself outside the fact that when people made withdrawal it affects the price going down and when people invest high capitals it increases the price automatically but is there some kind regulators like human agents or electronic technology who always do the regulatory price actions especially when trading bitcoin? Or is totally program that way? Only your views please.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449398",
  "comments": [
    {
      "author": "un_rank",
      "created_time": "April 19, 2023, 07:36:14 AM",
      "body": "Withdrawals from exchanges does not have an effect on the price, it is the exchange when the coin is traded for fiat that does. Investing high capital does not have an automatic effect, it has the possibility of influencing the value but depends on the process of purchase, the amount involved and the influence of the buyer, if known.Quote from: Greggry on April 19, 2023, 07:21:48 AMbut is there some kind regulators like human agents or electronic technology who always do the regulatory price actions especially when trading bitcoin? Or is totally program that way? Only your views please.No, there are no regulators or tech that regulates the price. Traders have an impact but that is from the exchange between buyer and seller. Sell and buy pressure is also a factor.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "April 19, 2023, 07:39:58 AM",
      "body": "I was once like you when I started trading in the financial market, the principle of price movement and charting of Bitcoin is not an exception. I would advise you not to bother yourself much with the accuracy of the price gauge, but the factor that decides the price is what is setting the price of Bitcoin and the currency paired with it.What happens to either of them (BTC/USD for example) could be technical (market sentiment in which the technical chart would dictate the prevailing price) or fundamental (economical factors in which the news and events surrounding or linked to Bitcoin and the paired currency, including the country spending the paired currency).Either of this or both could be detrimental or appraisal to the price of the coin as you see it moving up and down at the slightest influence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "April 19, 2023, 07:46:57 AM",
      "body": "What I thought about with the agents are those that are in the Matrix. Agent Smith. Lol. Anyway, It's affected by the people who have significant amounts of BTC and really affecting the market with their decision. There are a lot of factors that could be about why they chose to sell, but it's not easy to quantify. As long as people buy and Sell the crypto, it will change in price depending on the demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 19, 2023, 07:52:11 AM",
      "body": "No there is no central authority controlling bitcoin price and that is the sole purpose of why people address it as a decentralized currency. The driving factor for bitcoin price is the demand and supply of investors, just like what we are witnessing now that many banks are having trouble you see many people moving into bitcoin and this has increased the price. Also the bad news from either exchanges collapsing or either a threat to bitcoin or cryptocurrency by the government which prompts people to withdraw from it which leads to it dropping in price. Another factor is the mining equipment, if the mining equipment gets expensive like the ASIC tools it gets hard to have more miners and the less people mining the more fees they earn and this Also affects the bitcoin price. This ability of bitcoin not be controlled by a central body makes it an hedge against inflation because there’s no central body to regulate the interest rate like banks or governments do to our fiats",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "April 19, 2023, 10:11:32 AM",
      "body": "I think we Humans still play an important role in the cryptocurrency ecosystem. Traders, analysts and other market participants can influence sentiment and contribute to the overall price direction through trading actions and decisions.Yes, the Algorithm can be programmed to execute trades based on a variety of factors, including market trends, technical indicators and news events. Additionally, the decentralized nature of Bitcoin means that there is no central authority or regulatory body that can manipulate prices, further strengthening the role of electronic technology in shaping market outcomes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "April 19, 2023, 10:20:47 AM",
      "body": "Withdrawing your coins won't have any impact to Bitcoin because you're still holding Bitcoin, right? it's different with converting your coins to fiat and you withdraw your fiat. Selling your coins will not have a direct impact to make the market down, especially you not sell a huge amount of coins.There's no such human agents or electronic technology which will control Bitcoin price, but they did make a correction whenever the price is too far from the average price on other big exchanges, if not there's people who will take advantage though arbitrage trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 19, 2023, 10:30:13 AM",
      "body": "Quote from: Greggry on April 19, 2023, 07:21:48 AMI ask myself outside the fact that when people made withdrawal it affects the price going down and when people invest high capitals it increases the price automaticallyWhat do people want to do with deposit to exchanges and withdrawal from exchanges?Not all of them make deposits to sell their bitcoins. They can do it to consider exchange wallet as their wallet to store their bitcoins. That is a bad idea.Reminder: do not keep your money in online accountsThey can make withdrawal from exchanges to store their bitcoins more safely in their non custodial wallets. It does not help to increase demand or reduce selling pressure on exchanges. Just your theory.Quoteis there some kind regulators like human agents or electronic technology who always do the regulatory price actions especially when trading bitcoin?A best thing they can do is using regulations, regulatory news, proposals to make panic on the market to manipulate it. This market is manipulated by news, fuds which have biggest effects if related to regulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "April 19, 2023, 11:13:35 AM",
      "body": "There may be technical factors that may help influencing the price of Bitcoin, namely the value spent to keep miners mining. Specifically the price of electricity running those miners. But this is part of the system and PoW. If, all of a sudden all countries decide to ridiculously increase price of electricity, price of bitcoin can also raise because it becomes more expensive to mine new Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "April 19, 2023, 11:21:34 AM",
      "body": "You need to conduct research and gain a thorough understanding of Bitcoin. The price of Bitcoin is primarily based on demand, but it's important to note that not all demands are organic. Whales can manipulate the market by causing it to pump and dump when they play. If you're interested in short-term trading, it's crucial to be aware of this information. However, if you plan to invest in Bitcoin for the long-term, it's sufficient to understand the basics and trust in the future of Bitcoin, which will be driven by real demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "April 19, 2023, 11:51:59 AM",
      "body": "Quote from: Greggry on April 19, 2023, 07:21:48 AMPlease am trying to understand how the systems work that's why I need more clarification from you. I watch this cryptocurrency prices going up and down the axis but often times I ask myself outside the fact that when people made withdrawal it affects the price going down and when people invest high capitals it increases the price automatically but is there some kind regulators like human agents or electronic technology who always do the regulatory price actions especially when trading bitcoin? Or is totally program that way? Only your views please.The price of Bitcoin is not controlled by human agents nor electronic technology, but one factor which affect the price of Bitcoin is it's demand and supply, i.e the higher the worldwide demand, the more its price tend to increases due to it's limited supply, while if there is a lower demand in the use of Bitcoin, it automatically causes a decrease in price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 19, 2023, 11:52:39 AM",
      "body": "Supply and demand makes the market open, and therefore what leads to balance in the price is arbitrage.When I find that the price of bitcoin on one platform is $31,000 and on another platform it is $28,000, I will definitely try to transfer my currencies to that platform, and this is how the cycle of supply and demand is achieved until the market balances.But the difference can be very large, because I remember in 2017, the difference between one platform and another was more than 30% on the same day, but it is rare to find that these days.You will notice that the difference is simple between CEXs and is greater in DEXs.example:Binance $29,309.71Birake Network $30,191.90",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Similificator",
      "created_time": "April 19, 2023, 12:06:06 PM",
      "body": "Quote from: Greggry on April 19, 2023, 07:21:48 AMPlease am trying to understand how the systems work that's why I need more clarification from you. I watch this cryptocurrency prices going up and down the axis but often times I ask myself outside the fact that when people made withdrawal it affects the price going down and when people invest high capitals it increases the price automatically but is there some kind regulators like human agents or electronic technology who always do the regulatory price actions especially when trading bitcoin? Or is totally program that way? Only your views please.Up to now, there are only speculations on whether there really is someone, an organization or whatever group of people behind the movement of crypto prices. While it has a possibility, we are yet to find any proof about this. On small cap coins though, there can be manipulation but on huge coins specially bitcoin it would be really difficult if the person or the group of people don't have a huge amount of capital to use in manipulating prices. Hence, we can only conclude for now that the holders and traders are the ones responsible for the price movements of the price of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "April 19, 2023, 12:07:54 PM",
      "body": "Quote from: Zaguru12 on April 19, 2023, 07:52:11 AMNo there is no central authority controlling bitcoin price and that is the sole purpose of why people address it as a decentralized currency. The driving factor for bitcoin price is the demand and supply of investors, just like what we are witnessing now that many banks are having trouble you see many people moving into bitcoin and this has increased the price. Also the bad news from either exchanges collapsing or either a threat to bitcoin or cryptocurrency by the government which prompts people to withdraw from it which leads to it dropping in price. Another factor is the mining equipment, if the mining equipment gets expensive like the ASIC tools it gets hard to have more miners and the less people mining the more fees they earn and this Also affects the bitcoin price. This ability of bitcoin not be controlled by a central body makes it an hedge against inflation because there’s no central body to regulate the interest rate like banks or governments do to our fiatsIn theory, what you say is true, and the value of bitcoin will be determined by supply and demand. But in my opinion, with what is going on, we have no central authority managing and controlling the price of bitcoin. But the price of bitcoin is still manipulated by the big players instead of depending on supply and demand. The bitcoin market is still very small and without regulation, so it is more susceptible to manipulation than any other financial market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "April 19, 2023, 02:30:45 PM",
      "body": "Quote from: hugeblack on April 19, 2023, 11:52:39 AMSupply and demand makes the market open, and therefore what leads to balance in the price is arbitrage.When I find that the price of bitcoin on one platform is $31,000 and on another platform it is $28,000, I will definitely try to transfer my currencies to that platform, and this is how the cycle of supply and demand is achieved until the market balances.But the difference can be very large, because I remember in 2017, the difference between one platform and another was more than 30% on the same day, but it is rare to find that these days.You will notice that the difference is simple between CEXs and is greater in DEXs.example:Binance $29,309.71Birake Network $30,191.90I do not think that it is that common to have that much gap anymore, when there is a gap arbitrage people and bots take care of that and get it closer, you may find it rarely here and there but most of the time that's covered. Even in dex projects when you have spread in the LP there are bots that take care of it as well and make some profit.This is why I have to say that it is important to keep that in mind when you are making this difference, I would highly suggest that anyone who tries to make this should be able to realize how difficult it is. Even if you want to create a new bot for it, that would be start hard, because there are ones who have been doing this and fixing every little issue for many years now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "April 19, 2023, 08:36:17 PM",
      "body": "There aren’t any human agent or bots that regulate the price. Bitcoin price is subjected to the law of supply and demand. Economics 101: Less supply and high demand would result to an increment in bitcoin price and vice versa, it’s historically proven that certain negative events in the crypto space such as FTX scam, Mt. Gox collapse, can cause the price of bitcoin to go down for a period of time. Quote from: Greggry on April 19, 2023, 07:21:48 AMwhen people made withdrawal it affects the price going down and when people invest high capitals it increases the price automaticallyThese buy/sell orders cannot affect the price of bitcoin on a large scale. This topic should be in Economics board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "April 19, 2023, 08:53:48 PM",
      "body": "Not exactly, there isn't a single person or a group of people behind it to determine the price of bitcoin but it can happen that a large whale influences its trend for a short time. Just as there isn't a technology behind directing the orchestra but instead everything depends on a series of factors linked together.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "April 20, 2023, 01:19:51 AM",
      "body": "Quote from: Greggry on April 19, 2023, 07:21:48 AMPlease am trying to understand how the systems work that's why I need more clarification from you. I watch this cryptocurrency prices going up and down the axis but often times I ask myself outside the fact that when people made withdrawal it affects the price going down and when people invest high capitals it increases the price automatically but is there some kind regulators like human agents or electronic technology who always do the regulatory price actions especially when trading bitcoin? Or is totally program that way? Only your views please.It's always at the market price. When people buy Bitcoin, it goes up, when people sell, it goes down.This is true for all the markets around the world because you can buy and sell online 24/7 so people and companies try to get money by using arbitrage:Quote from: arbitrageThe simultaneous purchase and sale of equivalent assets or of the same asset in multiple markets in order to exploit a temporary discrepancy in prices.There's no trade halting like in wall st for example, and you can always just trade Bitcoin peer2peer anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "April 20, 2023, 01:57:14 AM",
      "body": "Quote from: Greggry on April 19, 2023, 07:21:48 AM(....) Or is totally program that way? Only your views please.If you understand Bitcoin first, Bitcoin is decentralized, no one owns it, and no one can control it. So in terms of price, I agree that it's not being controlled by other entities too.Like any other asset, the price of bitcoin is influenced by market supply and demand dynamics. It is influenced by a number of things, including international political and economic developments, cryptocurrency-related news, or about laws, other regulations of different governments, and many more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crunck",
      "created_time": "April 20, 2023, 03:07:40 AM",
      "body": "Bitcoin is a decentralized asset, so no one can control the price, and no one can control the bitcoin network, it all depends on our supply and demand. But the bitcoin price can still be manipulated in the short term by people with a lot of money, and manipulation occurs in most financial markets, not just bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}