{
  "id": "topic_5399157",
  "title": "Maestro75",
  "author": "Maestro75",
  "created_time": "May 18, 2022, 08:53:10 AM",
  "content": "The CEO of Terra Luna, Do Kwon will be explaining to the South Korean Assembly what actually happened to Luna that has caused many investors to lose their money in the investment. He has been summoned by the assembly lawmakers to explain what he has been doing to safeguard investors after the sad crash of Luna.According to the spokes person, Chang-Hyun \"We should bring related exchange officials, including CEO Do Kwon of Terra, which has become a recent problem, to the National Assembly to hold a hearing on the cause of the situation and measures to protect investors.\" Chang-Hyun also wants crypto exchanges to account for their behavior during the crash.I think he maybe caught in some hidden games that led Luna to crash because there are many Luna released to the market. How did that come about if not that it was a game played. Will this be more troubles for Kwon?https://www.theblockcrypto.com/post/147269/south-korean-politician-calls-for-hearing-terra-do-kwon",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399157",
  "comments": [
    {
      "author": "Beparanf",
      "created_time": "May 18, 2022, 08:57:49 AM",
      "body": "He deserves that and his team that bunch of egoistic that didn't care about retail investors. Until now he is insisting to fork the Luna and leave the retail traders with useless Luna Classic while the rest of his gang that enjoy ponzinomics on anchor for long time will have the reset and off the hook easily? He should be put in jail and seized all his asset. Let the court distribute available funds to all the victims and prioritize small investors.CZ suggestion is what make sense, I don't care if CZ is just bullshitting and playing the good man here but his statement about buy back or retail trader refund is the best path if he wants to continue Luna project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nivia1st",
      "created_time": "May 18, 2022, 09:21:02 AM",
      "body": "Quote from: Maestro75 on May 18, 2022, 08:53:10 AMWill this be more troubles for Kwon?yes, this will be a big problem. he will be charged with fraud because of his stablecoin. I heard there is currently an attempt to confiscate the personal assets that he owns. This problem caught the attention of many people because there were many who suffered losses due to the collapse of Luna and UST. and I doubt he'll escape prosecution this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "May 18, 2022, 09:59:15 AM",
      "body": "Quote from: Maestro75 on May 18, 2022, 08:53:10 AMI think he maybe caught in some hidden games that led Luna to crash because there are many Luna released to the market. How did that come about if not that it was a game played. Will this be more troubles for Kwon?I do believe the hidden story is not yet revealed. How the hell they can stop or halt the blockchain and they were refusing to do that and let people to pay the hyper inflation coin with their money. I do believe if that will be more trouble for kwon. The regulators are taking the action and im sure that even when there are so many US citizens that lost their money and that will make SEC to join in the game and they will be investigating this problem. I hope that we will see the real story behind it and justice will be there. This is hurting so many people and ruining their lifes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drumamat",
      "created_time": "May 18, 2022, 10:04:04 AM",
      "body": "Something is hidden or not from the eyes of investors, but in reality the CEO definitely knows the real cause of the crash. (I am very glad that I sold this asset at the time).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "May 18, 2022, 01:51:40 PM",
      "body": "Quote from: Maestro75 on May 18, 2022, 08:53:10 AMI think he maybe caught in some hidden games that led Luna to crash because there are many Luna released to the market. How did that come about if not that it was a game played. Will this be more troubles for Kwon?It is looking that way too for me. The CEO of Terra Luna might have rubbed his hands in oil secretly with the team for such kind of lost on investors. It is good that he will face the legislators maybe something could be squeeze out of him. It however depend on the government to make sure investors are compensated if his having hand in the shady crashing of investors money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aprilnot",
      "created_time": "May 18, 2022, 02:30:10 PM",
      "body": "Quote from: aubert on May 18, 2022, 09:59:15 AMQuote from: Maestro75 on May 18, 2022, 08:53:10 AMI think he maybe caught in some hidden games that led Luna to crash because there are many Luna released to the market. How did that come about if not that it was a game played. Will this be more troubles for Kwon?I do believe the hidden story is not yet revealed. How the hell they can stop or halt the blockchain and they were refusing to do that and let people to pay the hyper inflation coin with their money. I do believe if that will be more trouble for kwon. The regulators are taking the action and im sure that even when there are so many US citizens that lost their money and that will make SEC to join in the game and they will be investigating this problem. I hope that we will see the real story behind it and justice will be there. This is hurting so many people and ruining their lifesyeah you're right, if he tried to fix it they should be able to stop the network and stop printing luna during yesterday's crash. but in reality they were silent and seemed to let everything happen. and what irritates me even more is CEO luna refusing all suggestions and help from other people. he was too confident that he could solve the problem. but look today luna and UST have become shit coins. I hope this person is prosecuted and gets a severe punishment for this matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inanilujimi",
      "created_time": "May 18, 2022, 05:09:29 PM",
      "body": "I hope he solves all the problems first instead of having to come up with something new again.How could he make Luna again and leave the current luna as a community token only As if to run away from problems, but in fact new, bigger problems will continue to approach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StarKay",
      "created_time": "May 18, 2022, 05:34:00 PM",
      "body": "It is sad that cryptocurrency has come to this, Satoshi Nakamoto never imagined a day like this will come where the blockchain he created will now be a tool for scams and Ponzi schemes to thrive.If we now need government to save crypto investors then I no longer understand what crypto is all about anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little_Sister",
      "created_time": "May 18, 2022, 05:38:55 PM",
      "body": "Quote from: inanilujimi on May 18, 2022, 05:09:29 PMI hope he solves all the problems first instead of having to come up with something new again.How could he make Luna again and leave the current luna as a community token only As if to run away from problems, but in fact new, bigger problems will continue to approach.I guess he knew that it wouldn't work to ignore the community rather than the pool of support from the project, I was surprised that he prioritized his own desires over CZ suggestion. So they deserve an examination from the authorities to find the core of the problem that has caused investors' losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MonsterV",
      "created_time": "May 18, 2022, 05:46:12 PM",
      "body": "Quote from: StarKay on May 18, 2022, 05:34:00 PMIt is sad that cryptocurrency has come to this, Satoshi Nakamoto never imagined a day like this will come where the blockchain he created will now be a tool for scams and Ponzi schemes to thrive.If we now need government to save crypto investors then I no longer understand what crypto is all about anymore.I am sure that the founder of cryptocurrency has never envision for something bad like this to happen, but on contrary, for the crypto world to prosper and be beneficial for all. However, we cannot prevent such event because of people’s intentions, which differ from one another. I believe that government intervention has entered the picture because the welfare of citizens has been affected, that being said, the involvement of large scale complaints and such.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "May 18, 2022, 08:17:11 PM",
      "body": "That's really a possibility that he had played something behind for the two coins to crash into the pit. The latest news that I've seen is about the possible arrest of him after this summons. So, I think that he shows up there, he's aware that any potential arrest would lead him on jail time if it's proven that he did play shady games with the money of the people. There is no longer help and any solution he proposes, existing investors that have lost money won't believe him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "May 18, 2022, 09:34:40 PM",
      "body": "Quote from: StarKay on May 18, 2022, 05:34:00 PMIt is sad that cryptocurrency has come to this, Satoshi Nakamoto never imagined a day like this will come where the blockchain he created will now be a tool for scams and Ponzi schemes to thrive.If we now need government to save crypto investors then I no longer understand what crypto is all about anymore.Satoshi knew that he could not avoid the appearance of altcoins in the market, as the code of bitcoin was open source it was trivial for anyone with the right knowledge to fork bitcoin or modify the code and release their own coin.The lessons that we need to learn here are the same as always, do not invest in something that seems to be too good to be true, avoid centralized coins, avoid coins which promise you to earn money after a period of time and avoid dishonest and mediocre developers, I know that if  we were to do this then we will have to avoid more than 99% of the coins in the market, but that is precisely my point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "May 18, 2022, 09:46:11 PM",
      "body": "The South Korea Assemble should watch this video : https://www.youtube.com/watch?v=y_otSD3LYCAGreat overview and explanation of the prediction of how \"LUNA\" Ponzi scheme could ended disaster, the great things about this overview. Created 2 month ago before this disaster is happened, so is really worth to be watch.If people want to know too, freely to watch this video.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "24Kt",
      "created_time": "May 18, 2022, 09:50:36 PM",
      "body": "Quote from: wxa7115 on May 18, 2022, 09:34:40 PMQuote from: StarKay on May 18, 2022, 05:34:00 PMIt is sad that cryptocurrency has come to this, Satoshi Nakamoto never imagined a day like this will come where the blockchain he created will now be a tool for scams and Ponzi schemes to thrive.If we now need government to save crypto investors then I no longer understand what crypto is all about anymore.Satoshi knew that he could not avoid the appearance of altcoins in the market, as the code of bitcoin was open source it was trivial for anyone with the right knowledge to fork bitcoin or modify the code and release their own coin.The lessons that we need to learn here are the same as always, do not invest in something that seems to be too good to be true, avoid centralized coins, avoid coins which promise you to earn money after a period of time and avoid dishonest and mediocre developers, I know that if  we were to do this then we will have to avoid more than 99% of the coins in the market, but that is precisely my point.It is easy to say this kind of piece of advice, however, in actuality, we don't know if a certain project will rug pull or not, even if we say, we have done our research. Like for example, this LUNA, it was seemingly a very solid project, no one knew this crash was coming. Maybe, the dev team themselves as they know what's going on internally. But for their holders, I don't think they have idea that there will be dump like this.Ok, this YouTuber Consider knew what was about to happen.  Quote from: ryzaadit on May 18, 2022, 09:46:11 PMThe South Korea Assemble should watch this video : https://www.youtube.com/watch?v=y_otSD3LYCAGreat overview and explanation of the prediction of how \"LUNA\" Ponzi scheme could ended disaster, the great things about this overview. Created 2 month ago before this disaster is happened, so is really worth to be watch.If people want to know too, freely to watch this video.He nailed what was about to happen in LUNA + UST. If some holders have watched this, maybe they have cashed out their holdings before this crashed happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 18, 2022, 10:40:46 PM",
      "body": "Tough road ahead for Kwon and the remaining Terra team. I can't imagine how they will recover from this. I'm curious why they also summoned the exchanges or their representative just because they earned from the LUNA trades. It's in their discretion to stop trading and they usually do it if they find irregularities or if there are reports of hacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "May 18, 2022, 11:31:05 PM",
      "body": "Quote from: aprilnot on May 18, 2022, 02:30:10 PMQuote from: aubert on May 18, 2022, 09:59:15 AMQuote from: Maestro75 on May 18, 2022, 08:53:10 AMI think he maybe caught in some hidden games that led Luna to crash because there are many Luna released to the market. How did that come about if not that it was a game played. Will this be more troubles for Kwon?I do believe the hidden story is not yet revealed. How the hell they can stop or halt the blockchain and they were refusing to do that and let people to pay the hyper inflation coin with their money. I do believe if that will be more trouble for kwon. The regulators are taking the action and im sure that even when there are so many US citizens that lost their money and that will make SEC to join in the game and they will be investigating this problem. I hope that we will see the real story behind it and justice will be there. This is hurting so many people and ruining their lifesyeah you're right, if he tried to fix it they should be able to stop the network and stop printing luna during yesterday's crash. but in reality they were silent and seemed to let everything happen. and what irritates me even more is CEO luna refusing all suggestions and help from other people. he was too confident that he could solve the problem. but look today luna and UST have become shit coins. I hope this person is prosecuted and gets a severe punishment for this matter.This project is full with so many shady things. Recently CEO of luna was manipulating the vote by changing it into the token power voting after the first voting the majority of holders said no and the mechanism changed by him to make sure if what already targetted by him to create the new token will be getting yes by the majority of holders. he was doing so many manipulation and i guess that hyper inflation case was also a part of manipulation that already made by him as well. I fully distrust this project. Its CEO pretty similar with scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TelolettOm",
      "created_time": "May 18, 2022, 11:50:41 PM",
      "body": "Quote from: Maestro75 on May 18, 2022, 08:53:10 AMWill this be more troubles for Kwon?If the assembly lawmakers find out the fraud evidence on Do Kwon's explanation, he is probably in big trouble. He can be sentenced to jail and pay a fine with big money. Luna price dropped very unusually, looks like manipulation or played by a group of people. Do Kwon may have a role in this case as he is the CEO of Luna project, he must know what's happening. If there is evidence of his involvement, he could be charged with a severe sanction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "May 18, 2022, 11:54:50 PM",
      "body": "Quote from: drumamat on May 18, 2022, 10:04:04 AMSomething is hidden or not from the eyes of investors, but in reality the CEO definitely knows the real cause of the crash. (I am very glad that I sold this asset at the time). Definitely, CEO should know the real cause of the crash.  Aside from that, it is questionable why they inflate the supply of Terra instead of using their BTC holdings to support the Terra Market.  I don't find it convincing how they spend the Terra BTC  because the report was to vague and somehow doesn't tally to the value of the sold BTC fund.I do hope the Luna CEO will be held responsible for the mismanagement, incompetence or possible fraud activities  of the Luna Project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "May 18, 2022, 11:56:58 PM",
      "body": "It'd be great if this summoning could make out a clear reasoning behind the massive UST collapse.even better if there is an effort in making LFG reimburse any victims of their UST collapses since UST was supposed to be a coin for reserving wealth not the other way around.not to mention the massive correction for LUNA that make it almost loses 100% of its value alone should be of concern. after all LUNA is a former of major alts that are ranked 4th so it's not some measly matters that the reasoning for their collapses should be clear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}