{
  "id": "topic_5412500",
  "title": "BlackHatCoiner",
  "author": "BlackHatCoiner",
  "created_time": "September 05, 2022, 06:46:00 PM",
  "content": "I recently read this article, and excuse me for not understanding Satoshi's explanation, but why is the MIT licensed chosen, when that very license allows closed-source bitcoin-related software to be created, when this very action is against the pro-transparency philosophy?Unless I haven't acknowledged how licenses work, and if it'd be legally okay to re-create closed-source wallet software from scratch (such as Exodus) even if Bitcoin Core was released under AGPL (which prohibits re-distribution if source code isn't going to be disclosed).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412500",
  "comments": [
    {
      "author": "kaggie",
      "created_time": "September 05, 2022, 09:24:39 PMLast edit: September 05, 2022, 09:48:16 PM by kaggie",
      "body": "Because Bitcoin had to be available for commercial purposes. In brief, the 2008 MIT allows any usage or additional developments, whether freeware or commercial, with no recognition of previous authors works, other than that you may not claim that you did the original work yourself.Bitcoin was intended as a currency, which meant that businesses should be left unconstrained for how they incorporate it. This allowed developers freedom to develop without fear that some capricious original developer could usurp, and thus negate, their work. This prevented the need for additional licensing or agreements for any start-up businesses. Otherwise you would have seen a lot more lawsuits related to Bitcoin. A simple one would be early developers who thought their contributions should be paid after projects took off that are secondary to their work. Or even trying to enforce FOSS, but killing projects along the way that would have been helpful to the community. (Of course they deserve compensation, but if they do not like the MIT license then they can develop on different projects. Bitcoin is a currency intended to be much broader than any individual.)MIT, instead of copyleft, was the best option for being open while allowing people to develop their own projects. People have a choice to not use closed source projects -- or to use them, if they fit within their philosophy.Yes, the MIT license allows all sorts of shenanigans (like new developments not being FOSS), but it allows businesses to develop. There is no perfect license, yet. Satoshi said himself that he was not a lawyer, so coming up with a new license might have exposed his code to additional legal holes. It was better to go with an already existing license. Thus, MIT.If businesses had to concern themselves with copyleft, then it would create even worse shenanigans, like contributors of minor changes fighting for a share after projects became much larger. Even a FOSS model has problems for Bitcoin, as they do not all allow businesses to have their independent implementation of the software without being subject to restrictions -- even having to put in a notice with every software distribution can be overly burdensome for smaller IOT projects.I personally have nothing against copyleft, and it makes sense in many cases. But MIT made the most sense to help the project flourish in what was intended to become, and has become, a global project across many different municipalities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gmaxwell",
      "created_time": "September 06, 2022, 12:01:23 AM",
      "body": "There is *tons* of commercial use of GPLed software, and concerns like lawsuits are essentially non-existence in the wider world of free software (with a few narrow examples of utterly flagrant violators).  I don't believe there is a single identifiable business in Bitcoin today that would be materially impeded by the bitcoin software itself being GPLed -- particularly because cryptocurrency software almost always has to be free software for pure security reasons (if someone else controls your cryptocurrency software then can potentially take your funds hostage).But regardless of the underlying truth-- some people would think that they couldn't use it commercially or would think there would be some relevant liability.  And just the fact that people would think it would be a reason to go about making more implementations which is not good for the security and stability of the network. Perceptions matter too, even when they are wrong.I was a contributor to the Vorbis royalty free audio codec, and when we first created it we asked RMS for input on licensing and RMS advised using a three-clause BSD (MIT style license)-- his reasoning went along the lines of 'the proprietary world already has acceptable codecs, denying them this one wouldn't advance the cause of free software significantly,  but because codecs benefit significantly from network effect, having them use a codec that is available to free software would advance the cause significantly'.I think that same logic would apply to Bitcoin, but even more so because the existence of many re-implementations is a significant cost to the bitcoin ecosystem, and while compatibility issues arise for codecs too they're much less severe.It seems like it was a good decision-- we haven't seen too much abuse of the communities generosity:  There have been some altcoins that have built their system on 95%+ code written by the bitcoin community but then adopted proprietary licenses specifically engineered to prohibit bitcoin from using their code.  But it turns out that the kind of people who do stuff like this typically have nothing of their own of value to offer.  Code itself is pretty cheap too-- if you want a re-implementation of bitcoin you can just insert some money and have someone do it.  The insights that go into varrious design features are more valuable but much less protected by copyright in any case.  Stuff like 'exodus' would still exist-- I believe they're not even directly using any bitcoin code to begin with. The protection against closed wallets is and must be that the community of users is well informed enough to not use them.If the bitcoin community does come to regret the permissive license they could switch to using different licensing for future work.  But if that happens I expect really the only cause would be something like one of those scammy altcoins using their proprietary licensing as an excuse to spin up harassment lawsuits against bitcoin developers for 'copying' fixes or simple features that were in actuality independently developed (the fact that their codebase is 95%+ taken from bitcoin makes it somewhat likely that some similar changes would get made independently). ... but if someone wants to spin up harassment lawsuits it's unclear how much licenses can really block them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 06, 2022, 12:22:20 AM",
      "body": "Quote from: kaggie on September 05, 2022, 09:24:39 PMOtherwise you would have seen a lot more lawsuits related to Bitcoin. A simple one would be early developers who thought their contributions should be paid after projects took off that are secondary to their work. Or even trying to enforce FOSS, but killing projects along the way that would have been helpful to the community. (Of course they deserve compensation, but if they do not like the MIT license then they can develop on different projects. Bitcoin is a currency intended to be much broader than any individual.)I want to point out that this lawsuit mania is going on right now against companies using [L]GPL v2/3 software which did not make any link to the GPL'ed module available. It's because [L]GPL requires not only attribution but also a link to download that particular code in order to use it. So it can be seen a bit why Satoshi wanted to avoid that kind of early torpedo to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaggie",
      "created_time": "September 06, 2022, 05:06:49 AM",
      "body": "There is also Satoshi's identity to think about. Copyleft is tied to an individual who can exercise some rights. Since Satoshi wanted to remain anonymous and not exercise any rights, he used MIT. Copyleft would have caused a more difficult legal defense against several Satoshi claimants, whereas MIT allows that to be foregone entirely (hopefully).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "September 06, 2022, 12:07:56 PM",
      "body": "Quote from: BlackHatCoiner on September 05, 2022, 06:46:00 PMbut why is the MIT licensed chosen, when that very license allows closed-source bitcoin-related software to be created, when this very action is against the pro-transparency philosophy?Even if Bitcoin Core (also called Bitcoin or Bitcoin-Qt on older version) use AGPLv3 or other strict license, it won't prevent people from creating closed-source Bitcoin-related software. They can read documentation about Bitcoin protocol and networking, then create their implementation from scratch. IMHO if Satoshi choose AGPLv3 for Bitcoin Core, Bitcoin Core would have less dominance today.Quote from: kaggie on September 05, 2022, 09:24:39 PMeven having to put in a notice with every software distribution can be overly burdensome for smaller IOT projects.Is it really overly burdensome? At least for less restrictive license, you just need to make a list of used on About page once. For example,Code:Library nameLibrary creatorShort description (usually 1 sentence to 1 paragraph)Library licenseLink to library source code",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 06, 2022, 04:26:07 PM",
      "body": "Quote from: kaggie on September 05, 2022, 09:24:39 PMBecause Bitcoin had to be available for commercial purposes. Well that probably enabled CSW Faketoshi to claim the ownership of Bitcoin whitepaper, that was also released with MIT license if I am not mistaken.I understand reasoning for code being with this license but I can't understand doing the same thing for whitepaper.Quote from: kaggie on September 06, 2022, 05:06:49 AMThere is also Satoshi's identity to think about. Copyleft is tied to an individual who can exercise some rights. Since Satoshi wanted to remain anonymous and not exercise any rights, he used MIT. Copyleft would have caused a more difficult legal defense against several Satoshi claimants, whereas MIT allows that to be foregone entirely (hopefully).There is also public-domain license he (or they) could use back then for Bitcoin, and there is no ownership issues with this license.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gmaxwell",
      "created_time": "September 06, 2022, 06:49:32 PMLast edit: September 06, 2022, 07:14:48 PM by gmaxwell",
      "body": "Quote from: dkbit98 on September 06, 2022, 04:26:07 PMI can't understand doing the same thing for whitepaper.You have that backwards.  Wright alleges that the whitepaper wasn't released under a free license, even though it's part of the accompanying documentation specifically called out in the license grant.  The free licenses is a big part of the only reason that the bitcoin whitepaper is available on anything but darknet/pirate sites right now.Quote from: dkbit98 on September 06, 2022, 04:26:07 PMThere is also public-domain license he (or they) could use back then for Bitcoin, and there is no ownership issues with this license.No one sane would give away software without a hard disclaimer of liability, to do so would be financial suicide.  If Wright gets his way it'll be financial suicide even with a hard disclaimer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaggie",
      "created_time": "September 06, 2022, 08:07:18 PM",
      "body": "Bitcoin source code and the white paper were both published under the MIT license.Perhaps the MIT license is not completely unrestricted?It's interesting that there is a copyright on the Bitcoin Core source code, which is owned by \"The Bitcoin Core developers\". This means that the code cannot be 100% used without restriction, with the single case that it can be protected against someone who were to claim that they wrote the code instead of acknowledging the developers who did. Who knows -- the copyright owners might even be able to stop others from using their code entirely, if those others performed continual mis-acknowledgement?? Has that ever been tested?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 07, 2022, 02:48:50 AM",
      "body": "Quote from: dkbit98 on September 06, 2022, 04:26:07 PMWell that probably enabled CSW Faketoshi to claim the ownership of Bitcoin whitepaper, that was also released with MIT license if I am not mistaken.To be fair scammers like Wright are exploiting the public using their lack of knowledge and also exploiting the legal system by finding loopholes in it (like the court against someone who doesn't show up which votes in the scammer's favor). So I seriously doubt that the type of license or if whitepaper wasn't under that license would have changed much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 07, 2022, 02:10:44 PM",
      "body": "Quote from: gmaxwell on September 06, 2022, 06:49:32 PMYou have that backwards.  Wright alleges that the whitepaper wasn't released under a free license, even though it's part of the accompanying documentation specifically called out in the license grant.  The free licenses is a big part of the only reason that the bitcoin whitepaper is available on anything but darknet/pirate sites right now.Maybe I was wrong, but my understanding was that Wright changed the license and added copyright later, and I not saying at all that Bitcoin whitepaper should been released with non-free or copyright license in any way. I don't know exactly how various Linux distributions handles their licenses but I would say they are very flexible with GNU General Public License.And you can easily build on top of for commercial stuff like Red Hat or Suse are doing.I am not saying Bitcoin = Linux, just saying there a lot more free licenses available.Quote from: ETFbitcoin on September 07, 2022, 01:07:23 PMI doubt CSW know or care about license on Bitcoin whitepaper before he decide to act as faketoshi.His legal team certainly cares about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}