{
  "id": "topic_5461290",
  "title": "incloudibly",
  "author": "incloudibly",
  "created_time": "July 28, 2023, 08:15:54 AM",
  "content": "Hello from COIN.HOST, the provider of fast and secure VPS solutions, backed by Bitcoin and other cryptocurrencies. Explore our Crypto-backed VPS offerings, where you can pay with ease using cryptocurrencies. For the past 12 years, we have been providing a wide range of hosting solutions to both businesses and individuals. We take pride in our ability to serve over 25 thousand clients from more than 100 countries, and we are delighted to continue doing so.Why Choose COIN.HOST? Pay with Bitcoin: You can pay for your VPS hosting with BTC and other cryptocurrencies, stablecoins, and tokens. VMware®-powered: Our VPS nodes are powered by reliable VMware® hypervisors for high availability hosting. SSD Storage: We use ultra-fast all-flash SSD array solutions by SolidFire® for our VPS nodes. Linux & Windows Support: Choose from a variety of operating systems including Linux/BSD and Windows. Premium Connectivity: All VPS nodes are connected via a 10 GE high capacity multihomed network with direct access to SwissIX. Free DDoS Protection: Every VPS comes with a highly scalable, resilient, and sophisticated DDoS attack mitigation solution. 24/7 Live Support: Our multilingual support desk is ready to answer all of your questions and provide assistance 24/7. Backup and Snapshots: Automatic and manual snapshots are included free of charge with top-tier VPS configurations. Instant Deployment: Your VPS will be deployed immediately after payment confirmation. Swiss Privacy: We operate exclusively from an ultra-secure, carbon-neutral Interxion™ data center in Zurich, SwitzerlandOur carbon-neutral Interxion™ data center in Zurich, Switzerland, is certified to comply with ISO 27001 and ISO 22301 information security and business continuity standards.VPS Plans [4.37/5⭐] [BUY NOW]ProductCPU CoresRAMStorageBandwidth and IPDDoS ProtectionBackupOperating SystemPrice per MonthBTC PriceVPS-V22 cores2048 MB40 GB all-flash SSD3 TB monthly @ 10 Gbps / 1 IPv4 addressFree of charge4.5 CHF /monthLinux/BSDCHF 12.000.0005 BTCVPS-V32 cores4096 MB60 GB all-flash SSD4 TB monthly @ 10 Gbps / 1 IPv4 addressFree of charge4.5 CHF /monthLinux/BSDCHF 17.000.0007 BTCVPS-V44 cores8192 MB80 GB all-flash SSD5 TB monthly @ 10 Gbps / 1 IPv4 addressFree of charge4.5 CHF /monthLinux/BSDCHF 35.000.0014 BTCVPS-V58 cores12288 MB120 GB all-flash SSD10 TB monthly @ 10 Gbps / 1 IPv4 addressFree of charge4.5 CHF /monthLinux/BSDCHF 69.000.0027 BTCVPS-V68 cores16384 MB160 GB all-flash SSD15 TB monthly @ 10 Gbps / 1 IPv4 addressFree of chargeIncluded free of chargeLinux/BSDCHF 104.000.0041 BTCVPS-WIN11 cores1024 MB30 GB all-flash SSD2 TB monthly @ 10 Gbps / 1 IPv4 addressFree of charge4.5 CHF /monthWindowsCHF 40.000.0016 BTCVPS-WIN22 cores2048 MB40 GB all-flash SSD3 TB monthly @ 10 Gbps / 1 IPv4 addressFree of charge4.5 CHF /monthWindowsCHF 46.000.0018 BTCVPS-WIN32 cores4096 MB60 GB all-flash SSD4 TB monthly @ 10 Gbps / 1 IPv4 addressFree of charge4.5 CHF /monthWindowsCHF 52.000.0020 BTCVPS-WIN44 cores8192 MB80 GB all-flash SSD5 TB monthly @ 10 Gbps / 1 IPv4 addressFree of charge4.5 CHF /monthWindowsCHF 69.000.0027 BTCVPS-WIN58 cores12288 MB120 GB all-flash SSD10 TB monthly @ 10 Gbps / 1 IPv4 addressFree of charge4.5 CHF /monthWindowsCHF 104.000.0041 BTCVPS-WIN68 cores16384 MB160 GB all-flash SSD15 TB monthly @ 10 Gbps / 1 IPv4 addressFree of chargeIncluded free of chargeWindowsCHF 138.000.0054 BTCFor more information, visit our website or feel free to ask any questions in this thread.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461290",
  "comments": [
    {
      "author": "incloudibly",
      "created_time": "October 03, 2023, 01:04:13 PMLast edit: October 03, 2023, 01:45:36 PM by incloudibly",
      "body": "BITCOINTALK EXCLUSIVE 50% DISCOUNTGrab a limited time 50% discount coupon for your first month payment for any VPS from our range. Just three coupons in total, hurry up to use the discount before somebody else does!https://coin.host/vps-hosting/bitcoinCode:BITTALK01BITTALK02BITTALK03Available through Nov, 3rd 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles Magma",
      "created_time": "October 17, 2023, 01:07:25 PM",
      "body": "can i buy your VPS hourly?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}