{
  "id": "topic_5398152",
  "title": "Lontor",
  "author": "Lontor",
  "created_time": "May 11, 2022, 09:48:23 AM",
  "content": "I planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398152",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "May 11, 2022, 10:19:22 AM",
      "body": "Instead of timing the market (which you will most likely fail) to buy altcoins, why not instead buy bitcoin to minimize the risk? That way you won't have to obsessively follow the market to find the best time to sell it like you have to do with shitcoins since they have short pump period which are then followed by the dump. And yeah, best time to buy bitcoin is always now.Also, if you think that bitcoin might go down more (and that could be the case), you can always use DCA method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "May 11, 2022, 10:32:36 AM",
      "body": "Quote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? As said by @Rikafip above that instead of buying altcoins you should invest in bitcoin which will provide you some sort of guarantee returns if you are planning to hold long term.As we have already entered the bearish trend and prices have gone to $30k at this time with shitcoins following the trend you could invest at this time on the contrary basis.We have been down from ATH of around $68k near coinsbase listing and from then we have seen dips with some little pumps for the ants but now the volatility is High but if you have a look at the past patterns and price charts for bitcoin you will have an idea that even after losing it's 70-80% bitcoin has survived and proved that bitcoin is dead obituaries wrong so it's the best alternative for you.For some people like you some other coins might be tempting due to high returns then bitcoin but you completely ignore the fact that they are cheap and don't have huge market cap so it's easy to have more growth but on the other side billion of dollars worth of investment in bitcoin move it little high but all the world accepting it and so much growth over these years is not a joke so why fear it? You can stack sats(the lowest unit of bitcoin) with whatever amount you are willing to put in bitcoin rather than going for altcoins.There might be more dumps or not can't be said but this time you will definitely get some bitcoin at sale so grab as much you can to secure your future without wasting it on altcoins.Rest it's your personal choice where to invest but don't go for some scam projects out there and also invest what you afford to loose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 11, 2022, 10:42:16 AM",
      "body": "Quote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? Its gonna be hard predicting the bearish sentiment. If you are worried its gonna go down more, then do dca instead of buying at certain lows. Its gonna average your bought altcoin going down instead basef on your quantity. Its hard to suddenly buy the dip and youll expect a pump right away. It could go lower and thats unpredictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kelonmusk",
      "created_time": "May 11, 2022, 11:24:07 AM",
      "body": "Quote from: cryptoaddictchie on May 11, 2022, 10:42:16 AMQuote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? Its gonna be hard predicting the bearish sentiment. If you are worried its gonna go down more, then do dca instead of buying at certain lows. Its gonna average your bought altcoin going down instead basef on your quantity. Its hard to suddenly buy the dip and youll expect a pump right away. It could go lower and thats unpredictable. Yes Knowing that the current market conditions are in a bearish phase, then I agree with your statement Instead  investing the same amount of assets on a regular basis or often called investing at the average purchase price. I think that's what we can do when the market situation is bearish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "May 11, 2022, 12:04:41 PM",
      "body": "It's hard to find which altcoin will be worth investing in while in the bear market. But if you still want then only choose any coin under the top 10 on Coingecko or coinmarketcap. About the time when to buy. No one can predict the exact time but for me, every time the price drop it is always the right time to buy. Another tip is you can use the strategy available on tradingview called Stochastic RSI its also help you to decide when to buy or sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aprilnot",
      "created_time": "May 11, 2022, 12:18:46 PM",
      "body": "Quote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? very easy, you just need to look at the price of bitcoin and its dominance. if the price of bitcoin goes up, and dominance goes down, that's a sign the market will reversal. buy it when it happens, but if not better don't buy anything. what your friend said is very accurate, so follow his advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "May 11, 2022, 02:02:34 PM",
      "body": "Quote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? You can buy that in the various positions and i do agree with your friend if there are so many uncertainties in the market and that's why you must have divided your positions into some positions that will decrease the potential for you to get rekt. I just wanna try suggest you to take a look at the market right now. You can see how volatile the market is. Im sure that if anyone is trying to buy more but they are also ended in a big loss",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "May 11, 2022, 02:40:34 PM",
      "body": "Quote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? Just as no one else can know, neither can you. The best you can do is estimate based on market sentiment and a set of facts that give you some sense of the wisdom of crowds. Since you are inexperienced in trading, I suggest you stay away from altcoin cryptocurrencies. They are much more volatile than bitcoin. Remember, with assets such as bitcoin, your return is almost guaranteed. But with altcoins, your return is less certain.The safest way is to only invest a portion of your net worth, preferably as a small percentage of your income. The idea is to be patient and let the market make its choices for you. Do not try to time the market by going in and out. As you are learning, patience is the best virtue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "May 11, 2022, 02:57:20 PM",
      "body": "The right time to buy a coin is when the price drops and you can see it now.But don't be in a hurry to buy in bulk as the price could fall even deeper.Better you buy little by little at each price drop and let it sit for a while.And if the price falls even deeper, then you can buy it again.But you should have a limit on the number of times you need to buy and don't use all your money to buy at multiple prices because it will be worth buying if the price drops drastically to the lowest level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "May 11, 2022, 03:06:33 PM",
      "body": "Quote from: traderethereum on May 11, 2022, 02:57:20 PMThe right time to buy a coin is when the price drops and you can see it now.(....)Still difficult, we don't know until when the dip is over, it is very difficult to catch falling knives, especially now.Some people are tend to buy on the bounce while some are fans of buying the dips just like now which I can consider as a dip, still not guaranteed.Overall, best thing to do is doing our own research especially analyzing some chart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "May 11, 2022, 03:17:29 PM",
      "body": "The worst time to buy token for short term but i will suggest you to take on this position for long term. The bearish market is indeed making so many crypto in the market become very volatile at this moment. This is why so many people are only doing shorting or long when it was possible. The volatility has been making so many people got liquidated and you must be careful when investing in this time. it's caused by so many people are blindly not seeing what happened with the market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VRExpress",
      "created_time": "May 11, 2022, 03:58:48 PM",
      "body": "Quote from: Rikafip on May 11, 2022, 10:19:22 AMInstead of timing the market (which you will most likely fail) to buy altcoins, why not instead buy bitcoin to minimize the risk? That way you won't have to obsessively follow the market to find the best time to sell it like you have to do with shitcoins since they have short pump period which are then followed by the dump. And yeah, best time to buy bitcoin is always now.Also, if you think that bitcoin might go down more (and that could be the case), you can always use DCA method.BTC is the best choice at this time like you said but not all altcoins are good for short term I don't agree on that, some altcoins will be as good as BTC in future, there is nothing wrong in buying ETH or BNB and holding on for years just as much as holding BTC,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nivia1st",
      "created_time": "May 11, 2022, 04:04:53 PM",
      "body": "Quote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? when a trend reversal occurs. it is the right time to buy. and forget about the dip, you'll only lose if you try. I prefer to buy when the trend has really changed. it may look like FOMO, but this method is better than buying during a bear market because it takes a long time to wait for the price to go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mame89",
      "created_time": "May 11, 2022, 05:02:52 PM",
      "body": "There hasn't been a lot of information about where bitcoin and altcoins are going, what I'm doing now is just multiplying my assets into USDT first. because the movement of this bitcoin can go down and can continue to reach 22k which I am looking for information. it could happen again after the halving of bitcoin arrives in the coming year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "newdevices",
      "created_time": "May 11, 2022, 05:44:45 PM",
      "body": "Quote from: aprilnot on May 11, 2022, 12:18:46 PMQuote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? very easy, you just need to look at the price of bitcoin and its dominance. if the price of bitcoin goes up, and dominance goes down, that's a sign the market will reversal. buy it when it happens, but if not better don't buy anything. what your friend said is very accurate, so follow his advice.There may be some point but it would be nice to keep analyzing it for yourself as a whole,Most importantly, don't be in a hurry to make a decision.Besides that, we must also realize that everyone sometimes has their own time to buy either during a trend or when it is bearish",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "May 11, 2022, 05:48:54 PM",
      "body": "Quote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? Nobody really knows except for the whales. Small investors are just riding the waves of the whales. We can't time the markets. Don't even try it. If you think these prices are low enter with a small amount and double it if it gets even lower. If the markets do a U turn, then you'll make some profits. You won't make huge profits since you entered with a small amount to begin with but it is still better than nothing. Just don't be greedy and be grateful if you ever make any money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0verseer",
      "created_time": "May 11, 2022, 06:26:47 PMLast edit: May 12, 2022, 03:59:50 AM by 0verseer",
      "body": "Unless you got 'clairvoyance' to see the future or exclusive news from inside trading, no you just can't time it right. What we should do is wait till the market shows a good sign that we're out of the bear market. So we can invest in the market and expect a good margin of profit from price differences (buy low, sell high). Trying to catch the dips when there is no good sign on the market's recovery is the quickest way to become a long-time holder. You might eventually get out the entry price, back to where you've brought it. But your fund is wasted by sitting there frozen for a long time instead of cutting loss, which put you back to square one with less money than before. See the risk of timing wrong instead of waiting and being reactive?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "May 11, 2022, 07:09:46 PM",
      "body": "Quote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? No one really knows on what would be the right or exact time for us to get in or minding about with the lowest price as possible because the market had always been unpredictable which means thatno trader/investor could able to predict on what would be the bottom or peak prices which it is really hard to determine on what price you should get inand this is where risk taking factor or decision would really come into play and that would really vary on each person because there are people who could takerisk compared into others and there are some who do really love to play safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StarKay",
      "created_time": "May 11, 2022, 10:11:44 PM",
      "body": "Quote from: Lontor on May 11, 2022, 09:48:23 AMI planned to buy some altcoins now that we are in a bear market but someone I knew is telling me not to, that its possible more dumps will take place, my question is how will I know when it's the right time to buy coins? That time is not what anyone can confidently tell you because there's always something new to learn in Crypto and past experience doesn't necessarily mean that it will happen again.It is obvious that we are in a bear market already, I'll advice you start DCA at the current price although it seems too early but there can be a reversal of trend when you least expect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}