{
  "id": "topic_5447893",
  "title": "Edcrypto91",
  "author": "Edcrypto91",
  "created_time": "April 07, 2023, 06:27:11 AM",
  "content": "I recently purchased some Bitcoins butAccording to most posts and replies on this forum it seem the best way to hodl Bitcoin is to use a hardware wallet as long as you can keep it safe.Well is the hard ware wallet better than a custodial wallet??",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447893",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "April 07, 2023, 06:49:25 AMLast edit: April 07, 2023, 12:14:50 PM by OmegaStarScream",
      "body": "Custodial wallets are the worst type of wallets you can use. When you're using that, you're trusting someone else to keep the funds safe for you (from hacks when someone is targeting that service's hot wallet directly or your personal account, the wallet provider running away with the funds, etc.).You don't have to deal with any of that when using an HW. But make sure you're buying the wallet directly from the manufacturer, and keep your seed phrase somewhere safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 07, 2023, 07:00:39 AM",
      "body": "You already admitted to seeing a few posts here that talk about how unsafe it is to save your coins in a custodial wallet. Just grab yourself a hardware wallet from a trusted seller and set it up. If you can't also grab a hardware wallet for now, for the time being, I will recommend you try using the Electrum mobile or desktop wallet; it's kind of safer from there. Just as @OmegaStarScream has said above, every coin held in a custodial wallet is to some point not yours; they can be frozen, stolen, or sometimes you might be restricted from having access to them because the service providers of those custodial wallets can decide what ever they want to do with your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Supreemo",
      "created_time": "April 07, 2023, 07:10:02 AM",
      "body": "the feeling of putting your money or cryptocurrencies inside a custodial wallet is the same feeling as going inside a comfort room and being watched by a CCTV camera. what's the hardest part about those custodial wallets is that, they can implement their own rules to their platforms and you didn't have any choice but to abide those laws. in my case for example, here in our country there are only few providers of custodial wallets, and all of them will be asking for your verified identity or ID/KYC for you to be verified and to be able to use their platform. even if I personally don't have issues on providing personal information, what i am heavily concern is that, they will attach limits on your account depending on what level of verification you have. there are even cases here that even if they provided their information they are not yet verified or their account is still under review for the sake of \"user security\" which is just utter b*llsh*t, and if you mistakenly transfer your money on that wallet, you won't have any choice but to verify it since you cannot withdraw it unless the system recognized you as a verified user.providing personal information alone has already become a huge problem, there was this one friend of mine, who's account got locked due to him being unemployed but he transferred big amount of money from an exchange. i speculated that maybe the wallet provider thought that he is laundering money, and because of that incident other wallet providers here will require us to tell them what or where is the source of funds came from and they will still put limits on that, if we exceed that limits either the account will be in question or it will be locked forever, the worst part is that since you provided personal information initially, there is a high chance you'd get arrested if you cannot provide proper explanation. now compare that to non-custodial wallets or hard wallets? you can just easily plug in/out anywhere and transfer funds without worries other than transaction fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 07, 2023, 07:31:29 AM",
      "body": "Custodial vs. Non Custodial Wallets - \"Not your keys, not your coin\" Explained.[General] Bitcoin Wallets - Which, what, why?Custodial wallets are like exchange, online accounts and you only have a public address that is given to you by that exchange, that online platform. You don't own a private key of that public address, so you rely on that platform to receive and spend your bitcoins. It's not your coins, it's that platform coin.Non custodial wallets are different and you own its private keys, you own your coins. You are completely free to do everything you want with your coin with coin control features.Hardware wallet is most recommended because when you spend your coins, you don't have to leak your private key to Internet, so no risk to be hacked. Of course, there are back doors if you buy second hand hard ware wallets from bad people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "April 07, 2023, 07:40:15 AM",
      "body": "Quote from: Edcrypto91 on April 07, 2023, 06:27:11 AMI recently purchased some Bitcoins butAccording to most posts and replies on this forum it seem the best way to hodl Bitcoin is to use a hardware wallet as long as you can keep it safe.Well is the hard ware wallet better than a custodial wallet??It is a good thing to see that as a newbie to buying bitcoins, you are already taking the safety of your bitcoins seriously. A hardware wallet is the first option for optimally keeping your bitcoins safe but it is not affordable to everyone, and usually recommended for people who have a large amount of bitcoin, not really newbies in bitcoins who just purchased a small amount. As a new person in bitcoins, a non-custodial wallet can work for you so far as you practice safety measures until you can afford a hardware wallet. Quote from: tbct_mt2 on April 07, 2023, 07:31:29 AM course, there are back doors if you buy second hand hard ware wallets from bad people.There are many things you should not buy as fairly used or second hand, and a hardware wallet is one of them majorly, no matter how cheap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "April 07, 2023, 07:54:05 AM",
      "body": "One of Bitcoin's attractive features and one of the reasons why Satoshi created it was thatit enables us to take FULL CUSTODY of our money/finance/wealth. This means not having to trust a bank to hold that money whichgives us limited access to it.Why would anyone not spend <$100 on a hardware wallet and take full control of theirBitcoin? There then would be no need to TRUST others to look after your Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "April 07, 2023, 07:58:06 AM",
      "body": "See for yourself why custodial wallets are bad for long-term holding: https://chainsec.io/exchange-hacksAs for wallets in general, summary: hardware wallets > mobile non-custodial wallets > desktop non-custodial wallets > custodial walletsIf you want it more detailed: https://chainsec.io/wallets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "April 07, 2023, 08:12:00 AM",
      "body": "Custodial wallet means someone else is taking care for the security of your bitcoin. While non custodial (hot/cold) or hardware wallet refers to take care of your bitcoin yourself. What do you think? Which one is better? When someone else is responsible for taking care of your coins, remember that you don't own the coin like they say \"Not your keys, not your coins.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blurr007",
      "created_time": "April 07, 2023, 08:44:13 AM",
      "body": "Crucial Topic.Custodial wallet is a type of wallet that requires a third party to takes hold of private keys on behalf of every user.Which makes asset more secure, because only the third party and the user knows the private key.In a case where there is missing asset, the private key must have been shared to someone outside the third party and user.As for Hardware wallet, just misplacing it could put the user at risk, because no third party to help checkmate the security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "April 07, 2023, 08:52:58 AM",
      "body": "Quote from: Edcrypto91 on April 07, 2023, 06:27:11 AMI recently purchased some Bitcoins butAccording to most posts and replies on this forum it seem the best way to hodl Bitcoin is to use a hardware wallet as long as you can keep it safe.Well is the hard ware wallet better than a custodial wallet??What I mean by custodial wallet in simple terms is that using it means giving access to your funds to someone else.Custodial wallets should never be used for holding and the reason why can only be understood if you look at the FTX exchanger incident. Noncustodial hardware wallets are always best for securing your funds. First of all it is not connected to the internet so no one can easily fall into the trap of phishing or hacking. Also, since it is physical, its encryption security capabilities are stronger, so the answer to your answer is yes, of course, hardware wallets are always better than custodial wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "April 07, 2023, 09:03:37 AM",
      "body": "OP custodial wallets are wallets that are controlled by the developers, they work like banks, meaning if you keep 1000$ in the wallet, the developers have access to the wallet, behind your back.There is one thing we call a private key or recovery seed, this is what you need to gain control of your wallet, no one will have access to your funds if you are in control of your private key or your recovery seed. What you need is a Non-custodial wallet, for example Electrum, when you open this wallet and create a new account you will be given your recovery seed straight away, all you need to do is keep the recovery seed safe, do not share with anyone. Assuming your phone gets lost one day, you can download the Electrum wallet into a new phone and import the recovery seed into the Electrum wallet, all your funds will be back again.Recovery seed and Private key are very important for any crypto investors, keep them safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "April 07, 2023, 09:09:08 AM",
      "body": "Quote from: Edcrypto91 on April 07, 2023, 06:27:11 AMI recently purchased some Bitcoins butAccording to most posts and replies on this forum it seem the best way to hodl Bitcoin is to use a hardware wallet as long as you can keep it safe.Well is the hard ware wallet better than a custodial wallet??Simple answer: Yes!The past few years have shown time and again how important it is to keep your bitcoins yourself. So many people have lost their coins because they entrusted their private keys to other people. In order to prevent this, you should always have sole control over the private keys and thus over the bitcoins. Everything else always carries a risk that you could lose the coins. Therefore you should not use a custodial wallet or leave the coins on an exchange, casino or anywhere else.Currently you can even win a Ledger hardware wallet here in the forum. So if you don't have money for a hardware wallet, try your luck there.  [FREE RAFFLE] Betnomi Cold Wallet 🦊",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "April 07, 2023, 09:21:38 AM",
      "body": "Quote from: Blurr007 on April 07, 2023, 08:44:13 AMCrucial Topic.Custodial wallet is a type of wallet that requires a third party to takes hold of private keys on behalf of every user.Which makes asset more secure, because only the third party and the user knows the private key.In a case where there is missing asset, the private key must have been shared to someone outside the third party and user.As for Hardware wallet, just misplacing it could put the user at risk, because no third party to help checkmate the security. The bolded part of your post caught my attention. I'm not sure by what you mean by \"makes it more secure\".Are you implying that using a custodial wallet makes your coin more secure or what? The fact that it's called a \"private key\" and not a \"shared/public key\" should already give you the idea that its not meant to be shared with others only the owner of the wallet should know the private key of his or her wallet. To the Op, if you're unable to afford a hardware wallet then you can also use some reputable non-custodial wallet like Electrum,  you can use it has a cold wallet and that will provide the same security as a hardware wallet. The way you use your wallet determines how much secure your coin will be. but if you decide to be careless with your wallet even if you use the most secure hardware wallet your coin might still be stolen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "April 07, 2023, 09:35:16 AM",
      "body": "A custodial wallet is managed by a third party, like an exchange or wallet provider. They keep your private keys and manage your funds on your behalf. You put your trust in them to keep your assets safe, but there is always the possibility of a hack or the third party going out of business. Some custodial wallets may provide insurance or security measures, however it is critical to be aware of the risks. Hardware wallets on the other hand though, you are the one responsible for the safety of your bitcoins so if you think that you can be sure that you can secure your hardware wallet yourself, you can go that way but if not, considering a custodial wallet might be your best choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 07, 2023, 09:39:14 AM",
      "body": "Quote from: Blurr007 on April 07, 2023, 08:44:13 AMCrucial Topic.Custodial wallet is a type of wallet that requires a third party to takes hold of private keys on behalf of every user.Which makes asset more secure, because only the third party and the user knows the private key.In a case where there is missing asset, the private key must have been shared to someone outside the third party and user.As for Hardware wallet, just misplacing it could put the user at risk, because no third party to help checkmate the security. I think people that are too afraid to hold on to private keys by themselves and prefer custodian wallets are people that are easily comfortable with banks and exchanges having their private keys. Losing an hardwallet doesn’t necessarily means the coins are gone forever because there’s the seed phrases that could be used to recover or generate the private key. This seed phrase could then be imported into a new hardware wallets to recover funds. To secure one’s seed phrase or private key from missing, multiple backups are required and could be stored in different locations just in case of natural emergencies. And if at ones is afraid of security needs another human back then a family relative could even be less risky than having to trust a custodian wallets which could be face by hacks and could expose the keys to not just the hacker but multiple others",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "April 07, 2023, 10:36:04 AM",
      "body": "Custodian wallet is controlled by someone and you are at big risk with your investment in such wallet because, this custodial wallets are vulnerable to attack. For example information of clients can easily be accessed by someone out or inside and this will be used as advantage for hackers to penetrate in it and steal all funds, or the exchange or platform can misuse your money which you entrust to them and this will lead to the crash of the platform. All your funds will be gone and there will be nothing that you can do to claim your funds. Recently Paxful exchange crashed in my country with all customers funds gone.Noncustodial wallet is the best and keep your coin very secured from anyone to easily have access into it. With this wallet only you control and know about your funds,and you are you own bank. Don't forget bitcoin slogan that says not your keys,not your coins. Only keep funds that you can afford to lose in a custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "April 07, 2023, 11:33:21 AM",
      "body": "Quote from: Edcrypto91 on April 07, 2023, 06:27:11 AMI recently purchased some Bitcoins butAccording to most posts and replies on this forum it seem the best way to hodl Bitcoin is to use a hardware wallet as long as you can keep it safe.Well is the hard ware wallet better than a custodial wallet??Just for the sake of explanation custodian wallet is bank whereas the hardware or non custodial wallet is your own vault so which gives access to your money and complete control of it. When it comes to hardware its more secure because it keeps the assets safe even if we connect it to an infected device but everything comes with pros and cons so the negative side of hardware wallet is it can be damaged physically by accident, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "April 07, 2023, 12:11:36 PM",
      "body": "When you use custodial and exchange wallets like you deposit money in a bank, you don't have full control over your assets, your assets can be frozen or locked at any time. But when using non-custodial and hardware wallets, you become your own bank, you have full control over everything, and whether your assets are safe or not is up to you to decide. Hardware wallets are the best, but if you are not ready to own them, you can also look for another solution like a non-custodial wallet, it is still more secure than a custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 07, 2023, 01:31:46 PM",
      "body": "Quote from: Bananington on April 07, 2023, 07:40:15 AMQuote from: tbct_mt2 on April 07, 2023, 07:31:29 AM course, there are back doors if you buy second hand hard ware wallets from bad people.There are many things you should not buy as fairly used or second hand, and a hardware wallet is one of them majorly, no matter how cheap.There are alternatives for hardware wallets like cold wallets, multi-signature wallets with SPV wallet softwares like Electrum wallet. If you don't afford to buy a hardware wallet from official store, don't buy second-hand hardware wallet. You can always use alternatives which are safer and free to use.Electrum wallet is free for download and use. If you want to use it as a cold wallet or multi-signature wallet, you only have to learn a little bit and can set up yours.Creating a cold storage wallet in ElectrumCreating a Multi-sign wallet in Electrum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}