{
  "id": "topic_5453351",
  "title": "Onset",
  "author": "Onset",
  "created_time": "May 19, 2023, 09:31:10 PM",
  "content": "Throwback to last year, there were only few mixers you’d be able to pick from. And even these were for the most part unknown and you couldn’t tell much about how safe they are and whether they’re honey pots or real mixers.Fast forward to this day, there are so many mixers you can now choose from! Which begs the question for me, why is that? I get it, Chipmixer is down so some people saw an opportunity. But is this the real answer or is there some kind of service creating mixers out of thin air like those services we used to have which allowed you to create a new Altcoin in literally minutes?To be fair and honest with you, I’m scared of using these unknown mixers especially now that new ones pop up so often.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453351",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "May 19, 2023, 09:55:12 PM",
      "body": "Probably a bit of a few things1) CM is gone and other ones that were small / under used are now being used & promoted more. It was tough to fight CM2) CM is gone and people who were thinking about setting one up decided to see if they could make a go at it3) Privacy is being discussed more and more so more people are looking for mixers4) Some are probably 'white label' mixers [ https://en.wikipedia.org/wiki/White-label_product ] so spinning one up was not much work.5) Other?Could be other reasons too but I would think those 4 are the big ones.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "May 19, 2023, 09:58:36 PM",
      "body": "Why many mixers all of a sudden?Well, you could say the fall or Chipmixer case has brought about these projects coming to look out for customers they could grab from the on going propaganda but, its also possible that,These guys weren't doing his publicity on there project and just feels its time to get things running which still boils down to grabbing more customers.Still, you could say the projects sprang out of the need for a more valued service and privacy oriented nature of the cryptocurrency industry.I tell you this, without privacy, the cryptocurrency industry would be a meaning short. Hence, I would probect [banned mixer] to mix your legitimate coins Tor you and ensure privacy without compromise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "May 19, 2023, 10:23:58 PM",
      "body": "Quote from: Onset on May 19, 2023, 09:31:10 PMTo be fair and honest with you, I’m scared of using these unknown mixers especially now that new ones pop up so often.Bitcoin mixer industry currently has a thriving market, and CM has vanished. The public demands alternative mixer services to safeguard their privacy. Numerous Bitcoin mixing websites have started promoting their services to meet the market's needs.To ensure a safer experience with mixers, you can refer to a curated list of trusted Bitcoin Mixers compiled by @LeGaulois. In that thread, you will find additional information such as official mixer website links to avoid scams, Tor links, official threads on Bitcointalk, service fees, and minimum amounts required for using mixing services.2023 List Bitcoin Mixers Bitcoin Tumblers WebsitesMeanwhile, any suspected scam Bitcoin mixing services will be continually updated in this thread.Scams Bitcoin Mixers List and Services closedYou can learn to identify the characteristics of scam mixer services by referring to the compiled list. It is highly recommended to utilize well-established mixer services that have been in operation for several years, rather than opting for newly launched mixer services. Always pay attention to both clearnet and Tor links to ensure that you don't end up visiting the wrong websites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "May 19, 2023, 10:29:24 PM",
      "body": "When the greatest company has fell down and these competitors can't be par with them during its existence. So upon learning the news, this is an opportunity that they just can't let it pass.There's no greatest now on this niche, market and business so, everyone is rushing as if there's a gold rush for these mixing companies to be in. That's no surprising when the competition on this niche is tough and the greatest have already been out.It's time for each of them to get to the top as soon as they can and that's why marketing for most of the new ones have been aggressive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "May 19, 2023, 10:33:19 PM",
      "body": "Quote from: Smartvirus on May 19, 2023, 09:58:36 PMWhy many mixers all of a sudden?Well, you could say the fall or Chipmixer case has brought about these projects coming to look out for customers they could grab from the on going propaganda but, its also possible that,These guys weren't doing his publicity on there project and just feels its time to get things running which still boils down to grabbing more customers.Still, you could say the projects sprang out of the need for a more valued service and privacy oriented nature of the cryptocurrency industry.I tell you this, without privacy, the cryptocurrency industry would be a meaning short. Hence, I would probect [banned mixer] to mix your legitimate coins Tor you and ensure privacy without compromise. Funny that I saw a couple of people already mentioning that it's because Chipmixer was gone, when even during Nov 2022 a lot of mixers have been popping up out of nowhere. I guess it's just because there's money to be made in this type of cryptocurrency business, and since there's not much work really, especially if you're White label mixers like what DaveF mentioned since there's not much work to do it, which means more cashflow for these people. It's still probable that it's because of Chipmixer that these mixers suddenly gained confidence, but that only counts for those that have been here after Feb, for the rest of the bunch, I don't think that's the reasons for their existence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "May 19, 2023, 10:36:04 PMLast edit: May 19, 2023, 10:48:28 PM by AmoreJaz",
      "body": "Quote from: jossiel on May 19, 2023, 10:29:24 PMWhen the greatest company has fell down and these competitors can't be par with them during its existence. So upon learning the news, this is an opportunity that they just can't let it pass.There's no greatest now on this niche, market and business so, everyone is rushing as if there's a gold rush for these mixing companies to be in. That's no surprising when the competition on this niche is tough and the greatest have already been out.It's time for each of them to get to the top as soon as they can and that's why marketing for most of the new ones have been aggressive.i guess that's one of the major reasons why suddenly new mixers are coming to this market. CM is one of the biggest in terms of this business, and once they got out of business, definitely, people will try to fill in the empty seat. competition is good so they would want to attract their potential users by offering some sort of incentives or rewards. but we knew, only few can survive in this business. also, be careful in choosing which mixer you would want to use. you may end up not getting your money if you happen to deal with a fly-by-night mixer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "May 19, 2023, 10:42:28 PM",
      "body": "Because privacy become more uncommon these days, from different crypto regulations and the rise of chain analysis. Also, there's a huge market  in crypto mixers, not just for bitcoin but for some alts too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 19, 2023, 10:44:54 PM",
      "body": "Firstly, the Chipmixer case, which involved the shutdown of a popular cryptocurrency mixing service, created a void in the market. This event drew attention to the importance of privacy and the need for reliable alternatives. It prompted both existing and new projects to step up and fill the gap by offering their own mixing services.Secondly, competition among these mixers plays a role in their proliferation. Each project aims to attract customers and establish a strong presence in the market. With the ongoing discussions and publicity surrounding privacy in the cryptocurrency industry, these mixers see an opportunity to capture the attention of users who are seeking secure and private transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 19, 2023, 10:59:23 PM",
      "body": "Maybe you weren't so observant back then, but there were a fair number of mixers around before Chipmixer came into the picture and even after they established themselves. The difference is they weren't advertising so much in the forum like Chipmixer did. Bestmixer's and bitblender's stay was short-lived, but they were two of the few mixers that tried to compete with Chipmixer while advertising here in the forum. After their demise, Chipmixer remained dominant until recently.Yomix among other mixers were operational some months before Chipmixer was shutdown.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "May 19, 2023, 11:04:34 PM",
      "body": "Quote from: Onset on May 19, 2023, 09:31:10 PMThrowback to last year, there were only few mixers you’d be able to pick from. .Fast forward to this day, there are so many mixers you can now choose from!  why is that?Coinomize was launched in May 2019.Sinbad was launched in  2022.Yomixer was launched in 2022.UniJoin Bitcoin mixer was launched in 2022.I'm not sure when Mixero was launched, but they created their own thread on this forum on November 2022.The only mixer that was Lounched this year is the Whirlwind.So, you are wrong to say that a lot of Bitcoin mixers were lounched this year. Most of them have existed, but they have not been advertised on the forum yet through signatures.Also, the reason for more Bitcoin mixers being in existence is to increase anonymity in Bitcoin transactions. For example, if there are people who have passed different KYCs on different platforms where they bought their Bitcoin, those platforms can still track the individual through their KYC details and login IP, but if, after buying Bitcoin on CEX, you mix your Bitcoin on the mixer, your coin cannot be tracked again because the mixers help to protect their privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "May 19, 2023, 11:15:59 PM",
      "body": "I think Dave said it all, chipmixer was a force that couldn't be contended with, for as long as it was running, it was like it buried every other mixers to the background, if we try to find out when this other mixers were launched, we might discover that most of them were not launched this year, some were probably launched last year, and other launched the year before last year, but the presence of chipmixer seemed to have thwarted all their efforts to try to come to the limelight,  and now that chipmixer is no more, we see all of the other mixers springing up, like they were launched yesterday, it's like a jailer that died, and the prisoners set free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "May 19, 2023, 11:46:50 PM",
      "body": "There is no longer a tough competition, and the mixers that you are seeing which are appearing now were the ones that used to be on the sidelines barely existing. They are trying their best to advertise their services to hopefully get the market share that CM left. There may be a lot of other factors that we might not know, but we all know that the major one is Chipmixer leaving the scene. Most of these services also existed years before, too, so no they are not appearing like mushrooms during a thunderstorm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "May 19, 2023, 11:48:16 PM",
      "body": "Quote from: Onset on May 19, 2023, 09:31:10 PMThrowback to last year, there were only few mixers you’d be able to pick from. And even these were for the most part unknown and you couldn’t tell much about how safe they are and whether they’re honey pots or real mixers.Fast forward to this day, there are so many mixers you can now choose from! Which begs the question for me, why is that? I get it, Chipmixer is down so some people saw an opportunity. But is this the real answer or is there some kind of service creating mixers out of thin air like those services we used to have which allowed you to create a new Altcoin in literally minutes?To be fair and honest with you, I’m scared of using these unknown mixers especially now that new ones pop up so often.Supply and demand. ChipMixer was a solution that was seemingly unbeatable. It had (seemingly) good administration, it was (seemingly) untouchable and it (seemingly) did the job for those looking for privacy. As soon as it was seized, many old mixers began their advertising campaigns and news ones stepped in to try and take some of the large market-share wedge that ChipMixer left behind, with the additional opportunity of being a 'better' solution. I don't believe there is white-label software for mixers as DaveF said. However if this is true, that would definitely lower the entry barrier and allow virtually anyone to get into the market cheaply and easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TelolettOm",
      "created_time": "May 20, 2023, 12:46:53 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on May 19, 2023, 11:04:34 PMSo, you are wrong to say that a lot of Bitcoin mixers were lounched this year. Most of them have existed, but they have not been advertised on the forum yet through signatures.Agree. Most Bitcoin mixers already existed before this year, they just become popular now since they are promoted in this forum now. Why they are just promoted/advertised currently? It probably has a correlation with the fall of Chipmixer. Chipmixer is the most popular mixer previously, people even only know Chipmixer as a Bitcoin mixer. It is impossible to compete Chipmixer in this forum, especially when it was promoted by almost all top members. When it is fallen, those Bitcoin mixers have a chance to be popular mixers. So, they pushed efforts by advertising them through the signature campaign in this forum.Quote from: Dr.Bitcoin_Strange on May 19, 2023, 11:04:34 PMAlso, the reason for more Bitcoin mixers being in existence is to increase anonymity in Bitcoin transactions. For example, if there are people who have passed different KYCs on different platforms where they bought their Bitcoin, those platforms can still track the individual through their KYC details and login IP, but if, after buying Bitcoin on CEX, you mix your Bitcoin on the mixer, your coin cannot be tracked again because the mixers help to protect their privacy. The need for privacy may also be another reason. Moreover, there are many issues about hackers, people are afraid about their Bitcoin assets. One of the ways to prevent hackers is people use mixers to make their Bitcoins unable to track. Towards the bullrun season, people add more Bitcoin to their wallets. So, the demand for mixers is raising due to this matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "May 20, 2023, 01:14:50 AM",
      "body": "Quote from: TelolettOm on May 20, 2023, 12:46:53 AMWhen it is fallen, those Bitcoin mixers have a chance to be popular mixers. So, they pushed efforts by advertising them through the signature campaign in this forum.I'm not convinced that they decided to advertise because Chipmixer is no longer operational though. If I'm not wrong, some mixers already promoted themselves even before Chipmixer closed down. Sure, some of them increase their budget, but they already have a relatively high budget to begin with. If anything, I guess they find that signature advertising is one of the most effective ways to build their brand awareness compared to other alternatives.Quote from: TelolettOm on May 20, 2023, 12:46:53 AMMoreover, there are many issues about hackers, people are afraid about their Bitcoin assets. One of the ways to prevent hackers is people use mixers to make their Bitcoins unable to track. Is there any case where a hacker knows what address you own and then simply 'hacks' your wallet? That being said, what you said definitely relates to privacy issues. If anything, they can send spam e-mails or something similar if they find your personal information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "May 20, 2023, 01:26:25 AM",
      "body": "After the largest mixer was seized by the authorities, there must be a lot of people who were looking for alternatives. There wasn't much options around. Developers must have noticed this and come up with new ones. Meanwhile, the likes of Sinbad, for example, which has been around since Chipmixer's time rose to the fore. They must have thought it was their perfect time to shine. So there was a sort of meeting halfway. Privacy-conscious people were searching for a new mixer to transfer to. Developers responded to the market demand. However, it must also concern people that Chipmixer left with trust and confidence issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "May 20, 2023, 01:29:07 AM",
      "body": "Chipmixer is seized by the government and pretty much mixing is a profitable business. Just by looking at the campaign alone, you can see a bunch of it, and all of it pay a heavy amount of money for signature. The business is high profitable just like gambling that is why is all over the place and after the chipmixer is gone there is a big hole and everyone want fill that hole.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "May 20, 2023, 01:39:50 AM",
      "body": "Quote from: Onset on May 19, 2023, 09:31:10 PMFast forward to this day, there are so many mixers you can now choose from! Which begs the question for me, why is that? I get it, Chipmixer is down so some people saw an opportunity. But is this the real answer or is there some kind of service creating mixers out of thin air like those services we used to have which allowed you to create a new Altcoin in literally minutes?I see many of them have their mixers in this forum years ago. It is only their matter of failure to attract people to use their services because ChipMixer was there and so famous.After ChipMixer was seized, those old mixers decided to run more marketing when they saw more chances to get new customers.There are only two new mixers if I am not mixing: Whirlwind and Sinbad. Other mixers are very old.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 20, 2023, 01:58:39 AM",
      "body": "Perhaps the correct question is why so many mixers are  started signature campaigns here, and the reason for this is the increase in the number of users who are beginning to care about privacy, especially since solutions such as coinjoin are questionable in their ability to hide identity.Wasabi Wallet’s CoinJoin Coordinator to Blacklist Certain Bitcoin TransactionsThis news was in the year 2022, and here, many users are using mixing services, and with the absence of a ChipMixer, this market has become in need of many alternatives, which are now limited to less than 6 mixing services, while in the past there were many.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}