{
  "id": "topic_5469125",
  "title": "albert0bsd",
  "author": "albert0bsd",
  "created_time": "October 04, 2023, 12:52:24 AM",
  "content": "I am trying to quote some messages to this topic that i started: https://bitcointalk.org/index.php?topic=5468949.0But all that I get is this error.I also try to reply to it and  manually quoting in the form page to post a reply and nothing works.Is this an issue on my side or some kind of limitation?Another strange thing that I notice is that the topic doesn't appear in the list of  \"Show the last topics started by this person.\"",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469125",
  "comments": [
    {
      "author": "OcTradism",
      "created_time": "October 04, 2023, 12:56:42 AM",
      "body": "I believe you unwanted and mistakenly Ignore that board.I test one of my topic, before I changed the setting for Ignore boards preference, I can quote it normally.After I changed my Ignore Boards Preference, Ignore that board, I can not quote it.Let check your setting and see is it a cause of your problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 04, 2023, 01:00:31 AM",
      "body": "It is working from my side, I just clicked on some comments to quote and it works.Try to refresh your page and try it again I don't it's a restriction or error maybe is your network.You are right @OcTradism let him check to know if actually he has ignored that board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "October 04, 2023, 01:04:25 AM",
      "body": "Quote from: albert0bsd on October 04, 2023, 12:52:24 AMI am trying to quote some messages to this topic that i started: https://bitcointalk.org/index.php?topic=5468949.0But all that I get is this error.I also try to reply to it and  manually quoting in the form page to post a reply and nothing works.Is this an issue on my side or some kind of limitation? quoting own thread is allowed and there is no limitations but don't know why you get this error. have you check on different browsers? maybe problem with your side or you missed something in the quoting code cause this to happen. I checked your thread and quote is working well here. Quote Another strange thing that I notice is that the topic doesn't appear in the list of  \"Show the last topics started by this person.\"It's working fine for me and your thread in available in your latest post history. kindly you check again and confirm that thread is not showing for you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 04, 2023, 01:49:40 AM",
      "body": "Quote from: OcTradism on October 04, 2023, 12:56:42 AMI believe you unwanted and mistakenly Ignore that board.You are right this was the issue. Thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}