{
  "id": "topic_5472996",
  "title": "headingnorth",
  "author": "headingnorth",
  "created_time": "November 05, 2023, 10:27:05 PM",
  "content": "Correct me if I am wrong, I'm not very familiar with multi-sig backup and never used it before.1. Is your multi-sig backup used only in case of emergency if you lose your (hardware) wallet, or you forget the PIN number of your wallet? 2. Or do you always require third party permission(s) in order to sign for every normal day to day transactions you want to make?3. If so, how does that work?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472996",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "November 05, 2023, 10:31:11 PM",
      "body": "Quote from: headingnorth on November 05, 2023, 10:27:05 PM1. Is your multi-sig backup used only in case of emergency if you lose your (hardware) wallet, or you forget the PIN number of your wallet? You can use it in case of emergency, like you lost your hardware wallet. But people can also use it because it is one of the most secure means of generating bitcoin keys. Quote from: headingnorth on November 05, 2023, 10:27:05 PM2. Or do you always require third party permission(s) in order to sign for every normal day to day transactions you want to make?No. Your have all your keys, you have full control.Quote from: headingnorth on November 05, 2023, 10:27:05 PM3. If so, how does that work?Read these:https://electrum.readthedocs.io/en/latest/multisig.htmlhttps://bitcoinelectrum.com/creating-a-multisig-wallet/It works in a way that you can use more than one seed phrase or private key in a way you will need the private keys to sign bitcoin transnation. Example is 2-of-2 which will require 2 keys to sign bitcoin transaction and 2 keys to be able to make transaction possible.Another is 2-of-3 which will require 2 keys to sign bitcoin transaction, but 3 public keys to be able make transaction possible.Example in 2-of-2, if a hacker compromise 1 private key, he can not still be able to compromise the wallet, unlike in a single signature wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "November 05, 2023, 10:42:45 PM",
      "body": "Quote from: headingnorth on November 05, 2023, 10:27:05 PM1. Is your multi-sig backup used only in case of emergency if you lose your (hardware) wallet, or you forget the PIN number of your wallet? Your wallet backup is used to restore your wallet whenever you want to and in any situation, either your want to import your wallet into another device or the situations you mentioned above.Quote from: headingnorth on November 05, 2023, 10:27:05 PM2. Or do you always require third party permission(s) in order to sign for every normal day to day transactions you want to make?If you created your multisig wallet with other cosigners, like in a join business or company, then you need to send PSBT's to the other cosigners involved in the multisig set up to also sign the tx in order for it to be broadcasted to the network. But if only you control the keys, but in different devices, you do everything yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 05, 2023, 11:04:54 PM",
      "body": "Quote from: headingnorth on November 05, 2023, 10:27:05 PM1. Is your multi-sig backup used only in case of emergency if you lose your (hardware) wallet, or you forget the PIN number of your wallet? If you lose access to your (non-custodial) wallet or you want to import it somewhere else for any reason, you can use your backup. People usually use a single-signature wallet with a 12 word seed phrase and that's all they need to recover their wallet. If you created a m of n multi-signature wallet, there are n seed phrases. For recovering your wallet and spending fund from your wallet, you need m of seed phrases in addition to master public keys derived from the other seed phrases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "November 22, 2023, 01:07:24 PM",
      "body": "Quote from: headingnorth on November 05, 2023, 10:27:05 PM1. Is your multi-sig backup used only in case of emergency if you lose your (hardware) wallet, or you forget the PIN number of your wallet? A multisig backup is like a singlesig backup. You can use it for various reasons, but most importantly to never lose your funds.Imagine having one wallet (A). You would keep a backup of the seed phrase somewhere. Correct?Now imaging having one more wallet (B). You will also keep a backup of the seed phrase somewhere.Those two wallets can construct a multisig wallet where one (1-of-2) or both of them (2-of-2) are needed to sign a transaction. In fact, I don't think a 1-of-2 is useful, because you can use a singlesig wallet instead.Quote from: headingnorth on November 05, 2023, 10:27:05 PM2. Or do you always require third party permission(s) in order to sign for every normal day to day transactions you want to make?There are basically 2 options:1. you control all the cosigners (keys).2. you control most of the cosigners and there is also one entity (company) holding one of your keys. This is called collaborative custody.I always use option (1).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 22, 2023, 01:48:09 PM",
      "body": "Quote from: headingnorth on November 05, 2023, 10:27:05 PM1. Is your multi-sig backup used only in case of emergency if you lose your (hardware) wallet, or you forget the PIN number of your wallet? Your multisig backup seeds are what gives you access to your wallet, wether you lost the device or not, the other security measures you take such as using pin to lock your wallet in other for someone not to have access to it is only effective on the device you're using, once your back up seeds are exposed your bitcoin is gone, they don't need to know your pin, your bitcoin is on the blockchain and not on the wallet used, what gives them access to your bitcoin is the possession of the keys to unlock the lock coins on the blockchain, not your keys not your coins.Quote from: headingnorth on November 05, 2023, 10:27:05 PM2. Or do you always require third party permission(s) in order to sign for every normal day to day transactions you want to make?Not third parties but cosigners, that's why it's a multisig bitcoin wallet, if you choose to allow for that.Quote from: headingnorth on November 05, 2023, 10:27:05 PM3. If so, how does that work?Refer to all the above suggestions already given including their links to learn more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}