{
  "id": "topic_5436230",
  "title": "jeraldskie11",
  "author": "jeraldskie11",
  "created_time": "January 21, 2023, 10:32:25 AM",
  "content": "May gagawing workshop sa D'CUP COFFEE REPUBLIC ngayong January 28, 2023.Kahit sino pwede sumali, mairerecommenda ko ito sa mga taong walang alam sa crypto or bago palang sa crypto. May mga mga listahan na din sila kung ano ang ituturo nila at magtatagal po ito ng 3 hours. Makikita nati dito ang iba pang detalye: https://bitpinas.com/event/cryptok-crypto-101/Siyempre kailangan ng ticket para makasali, sa tingin nyo worth it ba ito or maghanap nalang ng mga free learnings about sa crypto?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436230",
  "comments": [
    {
      "author": "blockman",
      "created_time": "January 21, 2023, 12:27:21 PM",
      "body": "Para sa 500 pesos na ticket, tingin ko hindi yan worth it. Mga basic lang din yung topic kaya kapag ganyan na seminar, tingin ko pang free mga ganyan pero dahil hindi naman free ang venue, need na may ticket pambayad din. Naka attend na ako sa mga free seminars dati na related sa crypto at masasabi kong masaya kasi marami akong na meet na talagang zero knowledge sa crypto. Meron namang mga bihasa na at gusto lang ng network, masaya din yan kasi may free foods siguro.So, para sakin kung ganyan ang topics at ticket, hindi worth it. Pero kung gusto mo ng socialization dyan, tingin ko ok kung isa yun sa gusto mo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "January 21, 2023, 01:07:00 PM",
      "body": "Since nilabas na nila yung list ng dapat pag-usapan sa event, why bother attending the conference? Unless gusto mo mapalawak yung connection mo for business purposes, then go.But if ang habol mo lang is the introduction about crypto in general; i-search mo na lang isa-isa yung topic sa net, hindi ka pa pagod sa pag commute. Baka nga ma out of place ka pa don sa event kapag wala kang kakilala na kasama .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "January 21, 2023, 04:11:59 PM",
      "body": "Quote from: Maus0728 on January 21, 2023, 01:07:00 PMSince nilabas na nila yung list ng dapat pag-usapan sa event, why bother attending the conference? Unless gusto mo mapalawak yung connection mo for business purposes, then go.But if ang habol mo lang is the introduction about crypto in general; i-search mo na lang isa-isa yung topic sa net, hindi ka pa pagod sa pag commute. Baka nga ma out of place ka pa don sa event kapag wala kang kakilala na kasama .Tama! If connection yung hanap mo maybe it's worth it pero di din nila dinisclose kahit yung mga aattend dun sa workshop. Mostly ng sasali dun is we can expect na wala pa masyadong alam sa crypto but of course may mga sasali dun na may mga business at gusto nila mag adapt sa crypto. I think na konti lang yung sasali sa workshop nila because of the ticket, yes it's the ticket. Pero isa din sa iniisip nila kaya ganun is gusto lang nila maging part ng workshop nila is yung pursigido at ready mag risk given almost all things in crypto has risks. I'm just thinking if di nila ma hit yung quota nila sa tickets, Will the event continue?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "January 21, 2023, 09:20:36 PM",
      "body": "For beginners malaking tulong ito, pero if you already have good knowledge about cryptocurrency and alam mo naman on where to search for the right details then it can be worth it. Siguro yung habol nalang talaga ng iba dito is connections or looking for a partners and personal mentor. I’ve seen events like this before on the same venue, mukang ito talaga ang focus nila. If safety ren yung concern mo, baka hinde ito worth it para sayo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "January 21, 2023, 10:35:13 PM",
      "body": "Quote from: Johnyz on January 21, 2023, 09:20:36 PMFor beginners malaking tulong ito, pero if you already have good knowledge about cryptocurrency and alam mo naman on where to search for the right details then it can be worth it. Siguro yung habol nalang talaga ng iba dito is connections or looking for a partners and personal mentor. I’ve seen events like this before on the same venue, mukang ito talaga ang focus nila. If safety ren yung concern mo, baka hinde ito worth it para sayo. Kaya siguro mura lang ang fees kase basic information and ituturo so technically ang target nila is yung mga wala pa masyadong alam sa cryptocurrency, I don’t know if they are really doing this to spread information or ginagawa ren nila ito to offer services especially with the trading signal or a group that will guide you.Mas ok sana if magkaroon mismo ng conference that can talk more about cryptocurrency and how to maximize its potential, looking forward ako para dito kase namiss ko yung web3 event last year so hopefully magkaroon ulit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "January 22, 2023, 09:44:37 PM",
      "body": "Nasubukan ko na makaattend sa mga small gathering like noong baguhan palang, and masasabe ko na worth it naman ito at dipende nalang talaga ito sa kung ano ba ang hinahanap mo sa mga crypto event like this. Mabuti naman at nilagay nila yung mga topics to be discussed para magkaroon naren ng idea yung nakakarami so they can know if need paba nila umattend to know more or maghahanap dila ng other events that offers a more intensive course with regards to crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 22, 2023, 10:51:37 PM",
      "body": "Para sa mga walang nalalaman sa cryptocurrency masasabi kong sulit ang Php500 para sa lecture na ibibigay ng CRYPTOK.  Though personally para sa mga marunong magresearch ay pwede naman nilang iskip yang lesson na iyan dahil halos ang ididiscuss dyan ay nasa Youtube at mga tutorial website na.  Enjoy pa nila ang comfort ng bahay nila habang nag-aaral.Personally I believe ang grupong ito ay iniexploit ang trend ng cryptocurrency para pagkakitaan.  Hindi ko naman sinasabing mali ito, instead I find it a good strategy since hindi na sila mahirapang maghagilap ng information or gumawa ng sarili nilang guidelines dahil pwedeng copy paste na lang ng information from the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "January 23, 2023, 11:50:33 AM",
      "body": "Quote from: serjent05 on January 22, 2023, 10:51:37 PMPara sa mga walang nalalaman sa cryptocurrency masasabi kong sulit ang Php500 para sa lecture na ibibigay ng CRYPTOK.  Though personally para sa mga marunong magresearch ay pwede naman nilang iskip yang lesson na iyan dahil halos ang ididiscuss dyan ay nasa Youtube at mga tutorial website na.  Enjoy pa nila ang comfort ng bahay nila habang nag-aaral.May mga taong tamad mag research lalo na magbasa ng napaka raming article kaya mainam tong ganito para da kanila pero sulit ang bayad nito if crypto education talaga ang ituturo hindi yung pang ha hype lang sa isang project at iba pang walang katuturang bagay na misleading.Quote from: serjent05 on January 22, 2023, 10:51:37 PMPersonally I believe ang grupong ito ay iniexploit ang trend ng cryptocurrency para pagkakitaan.  Hindi ko naman sinasabing mali ito, instead I find it a good strategy since hindi na sila mahirapang maghagilap ng information or gumawa ng sarili nilang guidelines dahil pwedeng copy paste na lang ng information from the internet.Maraming nag grab na professional advisor or financial advisor na ginagawa ito kaya not surprising yung iva na manghingi ng bayad since minsan ginagawa na nila itong negosyo at yung iba deserve nila ito since naghirap din naman at yung iba namunuhunan din dito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "January 24, 2023, 09:51:42 PM",
      "body": "Quote from: abel1337 on January 21, 2023, 04:11:59 PMQuote from: Maus0728 on January 21, 2023, 01:07:00 PMSince nilabas na nila yung list ng dapat pag-usapan sa event, why bother attending the conference? Unless gusto mo mapalawak yung connection mo for business purposes, then go.But if ang habol mo lang is the introduction about crypto in general; i-search mo na lang isa-isa yung topic sa net, hindi ka pa pagod sa pag commute. Baka nga ma out of place ka pa don sa event kapag wala kang kakilala na kasama .Tama! If connection yung hanap mo maybe it's worth it pero di din nila dinisclose kahit yung mga aattend dun sa workshop. Mostly ng sasali dun is we can expect na wala pa masyadong alam sa crypto but of course may mga sasali dun na may mga business at gusto nila mag adapt sa crypto. I think na konti lang yung sasali sa workshop nila because of the ticket, yes it's the ticket. Pero isa din sa iniisip nila kaya ganun is gusto lang nila maging part ng workshop nila is yung pursigido at ready mag risk given almost all things in crypto has risks. I'm just thinking if di nila ma hit yung quota nila sa tickets, Will the event continue?  Kung pera lang talaga ang habol nila, siguradong hindi matutuloy ang workshop na yan kung hindi nila ma hit ang quota. Pero sa tingin ko baka meron pa silang mga pasabog dyan or baka meron silang ipopromote na project. Nakaranas na rin kasi ako sa mga ganyan eh, pero about yun sa pagtrade pero at the end of the day may dinadala pala silang project nila kaya baka pwede ring ganyan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "January 26, 2023, 12:42:38 PM",
      "body": "Quote from: jeraldskie11 on January 24, 2023, 09:51:42 PMQuote from: abel1337 on January 21, 2023, 04:11:59 PMQuote from: Maus0728 on January 21, 2023, 01:07:00 PMSince nilabas na nila yung list ng dapat pag-usapan sa event, why bother attending the conference? Unless gusto mo mapalawak yung connection mo for business purposes, then go.But if ang habol mo lang is the introduction about crypto in general; i-search mo na lang isa-isa yung topic sa net, hindi ka pa pagod sa pag commute. Baka nga ma out of place ka pa don sa event kapag wala kang kakilala na kasama .Tama! If connection yung hanap mo maybe it's worth it pero di din nila dinisclose kahit yung mga aattend dun sa workshop. Mostly ng sasali dun is we can expect na wala pa masyadong alam sa crypto but of course may mga sasali dun na may mga business at gusto nila mag adapt sa crypto. I think na konti lang yung sasali sa workshop nila because of the ticket, yes it's the ticket. Pero isa din sa iniisip nila kaya ganun is gusto lang nila maging part ng workshop nila is yung pursigido at ready mag risk given almost all things in crypto has risks. I'm just thinking if di nila ma hit yung quota nila sa tickets, Will the event continue?  Kung pera lang talaga ang habol nila, siguradong hindi matutuloy ang workshop na yan kung hindi nila ma hit ang quota. Pero sa tingin ko baka meron pa silang mga pasabog dyan or baka meron silang ipopromote na project. Nakaranas na rin kasi ako sa mga ganyan eh, pero about yun sa pagtrade pero at the end of the day may dinadala pala silang project nila kaya baka pwede ring ganyan.Kaya dapat talaga alamin ang intention ng seminar para hindi masayang yung pera at oras mo dito. Pero kung lehitimo namang paksa ang kanilang tatalakayin ay maganda yun dahil yung perang pinambayad mo para matuto ay doble o di kaya triple pa ang balik nun sayo lalo na pag tumalas ka sa usapinb crypto at alam muna ang iba't ibang paraan para kumita rito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 26, 2023, 11:21:34 PM",
      "body": "Quote from: arwin100 on January 26, 2023, 12:42:38 PMKaya dapat talaga alamin ang intention ng seminar para hindi masayang yung pera at oras mo dito. Pero kung lehitimo namang paksa ang kanilang tatalakayin ay maganda yun dahil yung perang pinambayad mo para matuto ay doble o di kaya triple pa ang balik nun sayo lalo na pag tumalas ka sa usapinb crypto at alam muna ang iba't ibang paraan para kumita rito.given yung scope na tatalakayinQuoteSome of the things you will learn:What is Blockchain?What is Crytpocurrency?How to spot the ‘bad’ crypto projectsCrypto Exchanges/WalletsSetting up Your Crypto WalletHow to Buy Your First CryptoTingin ko maiksi ang 3 hours dito unless gagawin nilang ampaw ang discussion at parang general knowledge lang ang datingan ng walang gaanong indepth na discussion.  Possible din na may ipromote silang isang crypto project since sinabi na ilan lang iyan sa malalaman sa discussion.  Anyway, sa mga aattend pakishare na lang sa amin ang result ng workshop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "March 28, 2023, 11:29:49 PM",
      "body": "Kamuta ang mga ganitong event? May nakapunta ba dito?Gusto ko maexperience ito pero sana yung topic will become more interesting so many will attend. If basic topics yung ididiscuss nila panigurado marami ang madidiscourage pumunta. If ever magkaroon ulit this quarter pipilitin ko na makapunta together with my friends para mas lalo pa nila maintindihan ito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "March 28, 2023, 11:47:29 PM",
      "body": "Quote from: samcrypto on March 28, 2023, 11:29:49 PMGusto ko maexperience ito pero sana yung topic will become more interesting so many will attend. If basic topics yung ididiscuss nila panigurado marami ang madidiscourage pumunta. You mean yung mga complex topic dapat? Like smart contract, BIP, defi, swaps, etc., Parang di pa mangyayari yan, knowing na andami pang wala or hindi pa alam mga basic things sa crypto. Ang maganda pa attend diyan talaga is para maka meet ng ibat ibang personality, connections, peers or maybe new friends na din. Bastabwg kalang bida-bida na kesyo ganito na kalaki trade volume mo, or ganito na balance mo kase ma ri'risk ang privacy at sarili mo sa mga masasamang loob. Smooth and basic talks lang dapat",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}