{
  "id": "topic_5463038",
  "title": "Altcoiner007",
  "author": "Altcoiner007",
  "created_time": "August 12, 2023, 01:56:11 PM",
  "content": "At age 16, I attempted to participate in FIFA eWorld Cup, an annual tournament that is organized by FIFA and EA Sports. It is the world’s largest and most prestigious gaming tournament for the FIFA video game series. The tournament is open to all players of the FIFA series, regardless of their skill level.Now as an older adult and a cryptocurrency enthusiast, it was thrilling to stumble on some blog articles on Crypto tournaments like CryptoWars, a blockchain-based strategy game that allows players to build and battle armies of digital warriors. Players purchase, trade, and battle their warriors using a variety of digital currencies. The game seem to be designed to be a fun and engaging way to learn about blockchain technology and cryptocurrency. But I imagine an event where actual cryptocurrency traders from every corner of the globe can join in the competition to compete for a grand prize. I don't know if there are crypto enthusiast out there already engaging in similar events other than Bets and casino events using Blockchain platforms, that seem to be the popular blockchain events I find around.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463038",
  "comments": [
    {
      "author": "Beparanf",
      "created_time": "August 12, 2023, 02:04:09 PM",
      "body": "Quote from: Altcoiner007 on August 12, 2023, 01:56:11 PMNow as an older adult and a cryptocurrency enthusiast, it was thrilling to stumble on some blog articles on Crypto tournaments like CryptoWars, a blockchain-based strategy game that allows players to build and battle armies of digital warriors. Players purchase, trade, and battle their warriors using a variety of digital currencies. The game seem to be designed to be a fun and engaging way to learn about blockchain technology and cryptocurrency. But I imagine an event where actual cryptocurrency traders from every corner of the globe can join in the competition to compete for a grand prize. I don't know if there are crypto enthusiast out there already engaging in similar events other than Bets and casino events using Blockchain platforms, that seem to be the popular blockchain events I find around.If you are not aware on NFT games and other DeFi shit then you should research more about them because all that you mentioned is already become idea and materialized on a certain NFT games.Crypto trading tournaments usually launch on exchange. There’s a lot of tournaments from different exchange that let fight against traders in terms of trading volume and win rate. There’s also a PVP on Kucoin before that let you compete with other players for on the spot predictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 12, 2023, 03:58:43 PM",
      "body": "There is, but mostly this tournament is conducted by different centralised exchanges or some other altcoin project. With your topic, I have just scanned and searched through my notes to see if I can get a particular exchange that I am aware of conducting this trading tournament, but it seems I have deleted it already, and I can't remember the name of the exchange, but what you must know is that there are tournaments like this that exist and reward winners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "August 12, 2023, 04:43:41 PM",
      "body": "There are some crypto trading tournaments that are host by the centralized exchanges where the traders have to make trades to earn various rewards. I have seen such tournaments on Binance exchange and they require certain amount of trades and trading volume from a user who wants to participate in those tournaments. I must say that those tournaments are not for the traders who make very low amount trades as they won't be able to stand against the ones who make higher amount trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iamcrypticguy",
      "created_time": "August 12, 2023, 05:38:05 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on August 12, 2023, 03:58:43 PMThere is, but mostly this tournament is conducted by different centralised exchanges or some other altcoin project. With your topic, I have just scanned and searched through my notes to see if I can get a particular exchange that I am aware of conducting this trading tournament, but it seems I have deleted it already, and I can't remember the name of the exchange, but what you must know is that there are tournaments like this that exist and reward winners.Certainly, you're correct about such tournaments organized by exchanges. I conducted a brief search and came across this upcoming KCGI tournament, which appears to be sophisticated.https://www.bitget.com/blog/articles/bitget-announces-trading-tournament-kcgi-2023",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShinyStarPrincess",
      "created_time": "August 12, 2023, 05:50:40 PM",
      "body": "Quote from: SamReomo on August 12, 2023, 04:43:41 PMThere are some crypto trading tournaments that are host by the centralized exchanges where the traders have to make trades to earn various rewards. I have seen such tournaments on Binance exchange and they require certain amount of trades and trading volume from a user who wants to participate in those tournaments. I must say that those tournaments are not for the traders who make very low amount trades as they won't be able to stand against the ones who make higher amount trades.If you join alone, yes it is difficult for low CAP traders BUT if you join as a team or with a team the chances are much higher, I worked with a KOL in the past, and alone he couldn't but as a team, they won the first place. If you have a good team of traders we might be able to win something",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "August 12, 2023, 06:23:43 PM",
      "body": "Quote from: Altcoiner007 on August 12, 2023, 01:56:11 PMNow as an older adult and a cryptocurrency enthusiast, it was thrilling to stumble on some blog articles on Crypto tournaments like CryptoWars, a blockchain-based strategy game that allows players to build and battle armies of digital warriors. Players purchase, trade, and battle their warriors using a variety of digital currencies. There are NFT gaming platforms that are known for these and are centralized organizations, we have some of them like Axie Infinity, Sandbox, Immutable, Gala gala, Apecoin Ape, plants vs undead, Flow flow and many other examples to mention few, you can enjoy the experience in playing them in their varieties using cryptocurrency and also enable you to customize your desired mode on how to play any one of your choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 12, 2023, 06:46:51 PM",
      "body": "First of all Op, this is not a play secondly who said there are no tournaments for trading, most of the new centralized exchanges and other platforms even newly lunched tokens or coins held their trading tournaments with decent rewards and many trades take entries. These tournaments are mainly lunched for marketing. Most of the top tier assets tournaments are held in future trading which is highly risky and the competition rate you can judge traders like me and you cant take part in such tournaments due to low budget or you can say smaller portfolio. that is always used by the whales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "August 12, 2023, 07:18:39 PM",
      "body": "Such tournaments like this exist. Those are mostly held by centralized organizations like CEX or project teams. From my point of view, those are rigged. As they are centralized, I don't think they will let people do it without any interference. Maybe some of them are legit but I like to avoid them. But the main thing is, they do exist. This happens with new projects launched by people on CEXs. But if we want a fair game of trading tournament, we will need to do it with an existing crypto. My thinking is Bitcoin. That way it will stay decentralized and there will be no interference from outside or inside. Also, traders will be able to keep their privacy secure. Most of the projects nowadays are scams. That's the reason I do not feel interested in them, let alone joining a trading competition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Incarts",
      "created_time": "August 12, 2023, 07:36:06 PM",
      "body": "Quote from: Iamcrypticguy on August 12, 2023, 05:38:05 PMQuote from: Dr.Bitcoin_Strange on August 12, 2023, 03:58:43 PMThere is, but mostly this tournament is conducted by different centralised exchanges or some other altcoin project. With your topic, I have just scanned and searched through my notes to see if I can get a particular exchange that I am aware of conducting this trading tournament, but it seems I have deleted it already, and I can't remember the name of the exchange, but what you must know is that there are tournaments like this that exist and reward winners.Certainly, you're correct about such tournaments organized by exchanges. I conducted a brief search and came across this upcoming KCGI tournament, which appears to be sophisticated.https://www.bitget.com/blog/articles/bitget-announces-trading-tournament-kcgi-2023 Trading competitions like this is usually a win for both parties. While traders are incentivized, exchanges see engagements go up significantly on their platforms. The pool for this event is particularly interesting, something of a shift from the regular",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "August 12, 2023, 07:47:01 PM",
      "body": "I have only learnt about some e-tournaments, but not any that had to do directly with crypto traders. On this forum at least, I have learnt about the Roobet contest or should I say drawing/painting/visual design contest. It is for everyone that is a a participant here and perhaps as online customer.I did a quick research and even discovered that Bitget did something similar by unveiling a crypto kinda trading competition to mark its fourth edition.  QuoteVictoria, Seychelles, Aug. 12, 2023 (GLOBE NEWSWIRE) -- Bitget, top crypto derivatives and copy trading platform, is thrilled to unveil the much-anticipated King's Cup Global Invitational (KCGI) 2023, an extraordinary global crypto spot, futures, demo trading and copy trading competition. Proudly marking its fourth edition, KCGI 2023 promises a captivating array of contests, an exhilarating roulette game, and a live session that will set the trading world ablaze. Traders worldwide are poised to compete for a breathtaking prize pool of up to 2,650,000 USDT, accompanied by an array of extravagant prizes, including a Tesla Cybersquad and a Airbus H135 helicopter.KCGI 2023 kicks off on August 18 with the adrenaline-pumping Spot Trading Contest, followed by the thrilling Demo Trading, Futures Copy Trading, and Futures Trading Contests. Traders from every corner of the globe can either join the competition individually or form formidable teams to claim their stake of the coveted grand prize. Additionally, participants will be treated to two spectacular events—the riveting roulette game and live roulette session—where fabulous prizes, such as the latest iPhone and the awe-inspiring Tesla Cyberquad, await the lucky victors.https://www.globenewswire.com/news-release/2023/08/12/2723962/0/en/Bitget-Announces-Trading-Tournament-KCGI-2023-with-a-Whopping-2-6-Million-and-Helicopter-Prize-Pool.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lalabotax",
      "created_time": "August 12, 2023, 09:59:40 PM",
      "body": "Quote from: Altcoiner007 on August 12, 2023, 01:56:11 PMAt age 16, I attempted to participate in FIFA eWorld Cup, an annual tournament that is organized by FIFA and EA Sports. It is the world’s largest and most prestigious gaming tournament for the FIFA video game series. The tournament is open to all players of the FIFA series, regardless of their skill level.It may be slightly different and quite difficult. Usually, trading competitions are actually carried out a lot, and are even still often carried out by certain exchanges or platforms. And the prizes also vary. It becomes a global trading competition or a local competition, depending on the organizer.however, if a large area is being carried out like FIFA, the question is who will organize this competition? And will it be trusted because after all many people do trading competitions while staying private.In addition, sports competitions will be very different from trading competitions like this. many people do trading but only to get a lot of profit every day and they will focus on that. only a few of them also conduct or participate in trading competitions at the same time. And they all still want to be private, to maintain privacy so that no one knows who they really are behind the account. So it might be a bit difficult to apply like eWorld cup by FIFA or similar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 13, 2023, 07:42:34 AM",
      "body": "What is the relationship of these games to the blockchain? It is called a blockchain, but the games require a large amount of processing and synchronization, which makes them suitable only for computers with good capabilities and with high-capacity Internet to ensure that the output is in real time. The blockchain can be a way to make payments or money transfers between members instead of relying on payment using Google Play or credit cards, or NFT can be added as gifts and rewards for the winners, but a game cannot be built on the basis of it being a crypto blockchain game.Popular game companies can develop tokens or NFTs that people buy from all over the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "August 13, 2023, 08:49:29 AM",
      "body": "Quote from: Altcoiner007 on August 12, 2023, 01:56:11 PMAt age 16, I attempted to participate in FIFA eWorld Cup, an annual tournament that is organized by FIFA and EA Sports. It is the world’s largest and most prestigious gaming tournament for the FIFA video game series. The tournament is open to all players of the FIFA series, regardless of their skill level.Now as an older adult and a cryptocurrency enthusiast, it was thrilling to stumble on some blog articles on Crypto tournaments like CryptoWars, a blockchain-based strategy game that allows players to build and battle armies of digital warriors. Players purchase, trade, and battle their warriors using a variety of digital currencies. The game seem to be designed to be a fun and engaging way to learn about blockchain technology and cryptocurrency. But I imagine an event where actual cryptocurrency traders from every corner of the globe can join in the competition to compete for a grand prize. I don't know if there are crypto enthusiast out there already engaging in similar events other than Bets and casino events using Blockchain platforms, that seem to be the popular blockchain events I find around.Crypto exchanges have local crypto trading tournaments, including Futures trading, spot trading and so on. If you are looking for a global crypto trading event, such an event simply can't exist because no one is going to invest and manage such an event. What do you think, what percentage of people are going to watch how people trade in live? Zero point something. Also, you have to keep in mind the way Bitcoin's price works, this idea of worldwide tournament just won't work, it's not a FIFA or Dota, it's not a game. Trading is not as exciting as Poker. Even Bitcoin isn't as famous as the games listed above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "August 13, 2023, 10:20:17 AM",
      "body": "I certainly share in your view and I must say that I've thought of this many times and the answer coming to my head is that we will still get there. This often happens among forex brokers but not big as you described it in which all platforms would come together like a world event to compete for a prize. What also helped is the demo account possibility on the retail brokers' platform which is not so with exchanges. It would have been coming bit by bit with exchanges as well but since the platforms are wired directly by a live trading capability without a demo account, such bit in trying it by organizers and individuals is not easy.Like I always say, cryptocurrency is still young, but with time, exchanges will definitely plan thing better. Businesses often follow the pattern they meet before a revolution takes place, it's a matter of more competition and a business starting something differently, and then others would follow.If not for this, I would have introduced trading competition on this forum and would have done it in such a way that would be attractive to participants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altcoiner007",
      "created_time": "August 13, 2023, 01:38:12 PM",
      "body": "Quote from: Hamza2424 on August 12, 2023, 06:46:51 PMFirst of all Op, this is not a play secondly who said there are no tournaments for trading, most of the new centralized exchanges and other platforms even newly lunched tokens or coins held their trading tournaments with decent rewards and many trades take entries. These tournaments are mainly lunched for marketing. Most of the top tier assets tournaments are held in future trading which is highly risky and the competition rate you can judge traders like me and you cant take part in such tournaments due to low budget or you can say smaller portfolio. that is always used by the whales.Not that I haven't seen any, I have noticed a few but I think those ones are basically just to increase trading volume on an exchange or a particular token trading volume. That's not more like what I am thinking in my head because with those ones, a particular whale can simply inject a huge some and manipulate the entire thing to win the game. That's what I think of trading volume competitions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "August 13, 2023, 02:08:52 PM",
      "body": "Quote from: Altcoiner007 on August 12, 2023, 01:56:11 PMNow as an older adult and a cryptocurrency enthusiast, it was thrilling to stumble on some blog articles on Crypto tournaments like CryptoWars, a blockchain-based strategy game that allows players to build and battle armies of digital warriors. Players purchase, trade, and battle their warriors using a variety of digital currencies. The game seem to be designed to be a fun and engaging way to learn about blockchain technology and cryptocurrency. But I imagine an event where actual cryptocurrency traders from every corner of the globe can join in the competition to compete for a grand prize. I don't know if there are crypto enthusiast out there already engaging in similar events other than Bets and casino events using Blockchain platforms, that seem to be the popular blockchain events I find around.Sounds like a trading simulation game, where everybody gets a demo account and trades against each other. After a few months the traders with the highest returns win. In my country banks offer such games every year for student with quite large cash prizes. I took part in a few challenges and even won a trip to London back in the days. The thing is that without real prizes it won't attract any people. As a successful trader why would you invest your time to trade demo accounts, when at the same time you could make real money. Maybe some big crypto exchange could be found to offer some prize pool for some advertising. But as soon as there is decent money involved it also needs strong rules and oversight, as some people might try to get an unfair advantage. So, as long as the event is free, offers prices and is easy to take part in I would expect many people to join.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "August 13, 2023, 02:46:01 PM",
      "body": "Quote from: Altcoiner007 on August 13, 2023, 01:38:12 PMNot that I haven't seen any, I have noticed a few but I think those ones are basically just to increase trading volume on an exchange or a particular token trading volume. That's not more like what I am thinking in my head because with those ones, a particular whale can simply inject a huge some and manipulate the entire thing to win the game. That's what I think of trading volume competitions.I don't think you're allowed to deposit with your money to be counted for trading volume competitions. What I know the exchanges will give fake money that used to trade for 24 hours or few days and the user with the highest trading volume or highest end of balance will win the competitions.However this kind of trading competitions aren't nothing new.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altcoiner007",
      "created_time": "August 14, 2023, 02:40:25 AM",
      "body": "Quote from: Cryptomultiplier on August 12, 2023, 07:47:01 PMI have only learnt about some e-tournaments, but not any that had to do directly with crypto traders. On this forum at least, I have learnt about the Roobet contest or should I say drawing/painting/visual design contest. It is for everyone that is a a participant here and perhaps as online customer.I did a quick research and even discovered that Bitget did something similar by unveiling a crypto kinda trading competition to mark its fourth edition.  QuoteVictoria, Seychelles, Aug. 12, 2023 (GLOBE NEWSWIRE) -- Bitget, top crypto derivatives and copy trading platform, is thrilled to unveil the much-anticipated King's Cup Global Invitational (KCGI) 2023, an extraordinary global crypto spot, futures, demo trading and copy trading competition. Proudly marking its fourth edition, KCGI 2023 promises a captivating array of contests, an exhilarating roulette game, and a live session that will set the trading world ablaze. Traders worldwide are poised to compete for a breathtaking prize pool of up to 2,650,000 USDT, accompanied by an array of extravagant prizes, including a Tesla Cybersquad and a Airbus H135 helicopter.KCGI 2023 kicks off on August 18 with the adrenaline-pumping Spot Trading Contest, followed by the thrilling Demo Trading, Futures Copy Trading, and Futures Trading Contests. Traders from every corner of the globe can either join the competition individually or form formidable teams to claim their stake of the coveted grand prize. Additionally, participants will be treated to two spectacular events—the riveting roulette game and live roulette session—where fabulous prizes, such as the latest iPhone and the awe-inspiring Tesla Cyberquad, await the lucky victors.https://www.globenewswire.com/news-release/2023/08/12/2723962/0/en/Bitget-Announces-Trading-Tournament-KCGI-2023-with-a-Whopping-2-6-Million-and-Helicopter-Prize-Pool.htmlThis looks a bit more like what I have been thinking .. But what are the modalities put in place to monitor participation? Except for people trading in the demo category,  those participating in the spots, futures Copy Trading and futures will they be using their own real trading funds or will the Exchange also provide each user same trading amount?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aima55",
      "created_time": "August 14, 2023, 07:55:19 PM",
      "body": "Quote from: Altcoiner007 on August 14, 2023, 02:40:25 AMQuote from: Cryptomultiplier on August 12, 2023, 07:47:01 PMI have only learnt about some e-tournaments, but not any that had to do directly with crypto traders. On this forum at least, I have learnt about the Roobet contest or should I say drawing/painting/visual design contest. It is for everyone that is a a participant here and perhaps as online customer.I did a quick research and even discovered that Bitget did something similar by unveiling a crypto kinda trading competition to mark its fourth edition.  QuoteVictoria, Seychelles, Aug. 12, 2023 (GLOBE NEWSWIRE) -- Bitget, top crypto derivatives and copy trading platform, is thrilled to unveil the much-anticipated King's Cup Global Invitational (KCGI) 2023, an extraordinary global crypto spot, futures, demo trading and copy trading competition. Proudly marking its fourth edition, KCGI 2023 promises a captivating array of contests, an exhilarating roulette game, and a live session that will set the trading world ablaze. Traders worldwide are poised to compete for a breathtaking prize pool of up to 2,650,000 USDT, accompanied by an array of extravagant prizes, including a Tesla Cybersquad and a Airbus H135 helicopter.KCGI 2023 kicks off on August 18 with the adrenaline-pumping Spot Trading Contest, followed by the thrilling Demo Trading, Futures Copy Trading, and Futures Trading Contests. Traders from every corner of the globe can either join the competition individually or form formidable teams to claim their stake of the coveted grand prize. Additionally, participants will be treated to two spectacular events—the riveting roulette game and live roulette session—where fabulous prizes, such as the latest iPhone and the awe-inspiring Tesla Cyberquad, await the lucky victors.https://www.globenewswire.com/news-release/2023/08/12/2723962/0/en/Bitget-Announces-Trading-Tournament-KCGI-2023-with-a-Whopping-2-6-Million-and-Helicopter-Prize-Pool.htmlThis looks a bit more like what I have been thinking .. But what are the modalities put in place to monitor participation? Except for people trading in the demo category,  those participating in the spots, futures Copy Trading and futures will they be using their own real trading funds or will the Exchange also provide each user same trading amount? Absolutely! To jump into the competition, you'll need to use your own funds. For spot trading, captains and team members require a minimum net value of 100 USDT in spot assets during registration. If it's futures trading you're into, each team member needs at least 300 USDT. Beyond the challenge itself, there are irresistible rewards waiting. You just might be lucky to win the helicopter or Tesla. Good luck with that if you're gonna participate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}