{
  "id": "topic_5477712",
  "title": "Mynameis123",
  "author": "Mynameis123",
  "created_time": "December 13, 2023, 12:21:57 PM",
  "content": "Hii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477712",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "December 13, 2023, 12:25:05 PM",
      "body": "On exchanges, like Binance, you can watch the video of what you do not understand. Before you will start any trading, you will need to answer questions and also be given a video guide. I have noticed this on many exchanges but it is Binance that come my mind because it was the first exchange that I noticed something like that. On the exchange, you can also browse for anything you do not understand, their articles and videos as guides are there on the exchange.Anything that you do not understand, do not hesitate to ask us on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "December 13, 2023, 02:45:41 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.Binance academy cover what you are looking for. I attached the link below for their easy to understand lecture about futures and options contracts. Actually they are almost the same but it only depends on duration since options has specific date of expiration while futures gives you the flexibility to open a contract as long as it didn’t liquidate.https://academy.binance.com/en/glossary/futures-contracthttps://academy.binance.com/en/articles/what-are-options-contracts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 13, 2023, 04:32:17 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.I can understand this, even Google searches these days are not as proficient as they were before since they are trying to compete with ChatGPT with their Bard. I believe that has disarranged their system somehow. Regardless, I implore you to keep on searching but with better service commends. Also, save a whole lot of them as they pop up since trading is a journey, you get to keep gathering resources until you get to your desired destination. Mind you, you should stop searching for options trading as a course to avoid confusing yourself, just learn how to trade and you are good to go. Also, exchanges do not make options trading easy for anybody, so you might want to avoid them, or else you lose. The best place to trade options is through the traditional forex brokers that offer it. They will again furnish you with the necessary resources to know how to go about it in their guide.Finally, I would like you to start Googling \"online trading\", \"forex trading\", \"crypto trading\", \"Bitcoin trading\" and so on. You might be mistaken about Googling directly with futures or options trading. Like this, you might be furnished with limited resources as futures trading is not that popular in terms of articles to search and read from published by seasoned authors. And once you know forex trading itself, you can know all, because that is the basis, and it's what is helping me till today.You may also use these two sites to Google in addition;1. Investopedia2. Easyforex",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "December 13, 2023, 06:25:10 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.no course will teach you how to make money in the market. Even if you learn the theory perfectly and learn by heart what formation has what probability of success, how to define appropriate support levels, there is still no guarantee that you will make money, because in the end it will be you, a human, who will decide, and a human is not a rational machine, only emotional. So you will make mistakes that will cause you to make more mistakes because they will affect your emotions and thus your decissions. Study slowly, day by day, and keep trading. All you need is $10 in your account to be able to open your first position  and learn to control your emotions and remain somewhat rational.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mame89",
      "created_time": "December 13, 2023, 07:46:04 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.The world of crypto is now increasingly popular, including trading, if you want to search on Google and on YouTube you will find knowledge about trading and there are even free courses. But trading is not enough with just theories, you need action so you can learn straight away.And now there are many exchanges that provide demo accounts, you can use them as a form of practice and after that you can use real money, but it would be better if you tried with a small capital first. Courses are important, but what is more important is how you control your emotions when trading so that the decisions you make are not wrong. Because without you controlling your emotions, your money will run out in an instant because emotions play a very important role in trading, so don't let bad emotions dominate you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "December 13, 2023, 07:52:50 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.I guess those courses that you've gone through are also the ones that you can get freely from the internet. Aside from the given guides, there can be this guide which said to be the ultimate[1] one made by Binance and hopefully it helps you out to trade in futures. But as a newbie, you shouldn't trade yet on futures if you're still new but then, how can you learn if you're not going to do that, right?[1] https://www.binance.com/en/blog/futures/the-ultimate-guide-to-trading-on-binance-futures-8534557745009080271",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "December 13, 2023, 10:06:18 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.The link to these online course are everywhere but the real ones become very scarce. You've gone through crypto future and option courses without finding any solid information to comprehend, we quite understand the system and knows the necessities we need to grab our points. Crypto trading that involves futures, which is regarded to be the oil well of trading in crypto. There are PDFs that would served important aides to one. There's nothing more enjoyable about obtaining the legit details of the market and just doing the right options.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "December 14, 2023, 02:24:19 AM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.Because you felt you don't understand Futures and Option trading, it is good if you don't trade with Futures and Option.Even when you feel like you already understood about those trading type, you still should not trade with it because those trading types are most risky and you will lose money with it.You can not say I understood about this and that if you only read documents, guides, and all are on paper. To understand anything in trading, you must practice it and experience it in an actual market, with an actual account (not demo account) and with your actual money.Because they are very risky, the bottom line is Don't trade with them is the best advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "8rch7",
      "created_time": "December 14, 2023, 04:14:33 AM",
      "body": "To make easily understood about future and contract trading system beside read guide on some exchange rule you need to practice it with small fund, Binance available with future and use $10 capital to understand about future and contract trading working way. Some respond above have give source link to make you easily understood about trading way concept in some exchange, after understanding all theoretical just spent small your fund and action with trading of you want as future or contract trading model.Don't read one side of advantage from future and contract trading only, you must read with bad side of this kinds of trading because many people just explore or showing profitable only for us and hidden with how much loss after try with future trading concept have bigger risk exactly for beginner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "December 14, 2023, 06:27:08 AM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.The truth is, even if you get a free course, and you don't study it practically, you still may not understand anything, and besides, be rest assured that free course won't contain as much details as the paid one.What I did advice you to do is to head to udemy.com, you will find alot of premium courses at a very low cost, usually starts from $4 to up to $100 I think, but then, you will for sure get value for your money, the courses are not just text, but video courses, you will be watching the instructor do it live, and you can also follow along practically so you better understand it.This is what I advice you do, you may probably not get what you are looking through free courses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "December 14, 2023, 07:12:22 AM",
      "body": "the difference is of leverage in options we get leverage or borrowed money there is nothing important which you need to learn like a course focused on just to trade options and futures.if you know TA and how to trade or have trading experience than you can trade options but when starting to trade options you need to take small positions or use low leverage to get to know everything.There are many youtube channels teach about trading crypto for free.you can check this playlist to learn trading and options trading on popular exchanges like bybit and binance: https://www.youtube.com/playlist?list=PLy4Sgr8MEx89AagIJ83bG6HeeEcbtQlRL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "December 14, 2023, 09:17:55 AM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.This forum platform, in my opinion, can help you gain knowledge about what you want to know. Most of the communities here are friendly and accommodating; there are even others here who will even provide source links so you can better understand the answer you are looking for.Just write down the questions you want to know in the crypto space, whether it's trading, opportunity, etc. Don't hesitate to ask, dude; most of the community is ready to accommodate you as much as they can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GbitG",
      "created_time": "December 14, 2023, 10:59:42 AM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.Hey, Mr. OP, I don't understand, that's how you don't understand. I mean, If we talk about basic courses, there are many courses on YouTube and many sources to learn from. If you want to learn basic things about future trading, then I have the best course available on Udemy. I think it is not that expensive; for just $12 dollars, you can learn all the basic things in simple words, and this will help you a lot. And if you mean how to earn money or teach me how to earn profit, then it depends on you that how you make a strategy to get profit or how much money i mean how much dollars you can earn from trade. So there is no need to explain it to anyone, and no one can advise you. it comes to financial abuse, you have to make your own decision. The rest of you should learn everything from the course, etc., create a demo account and practice in it, and after that, take trades, etc. at your own discretion.If you have any questions or problems, you can ask them here without hesitation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "December 14, 2023, 01:45:35 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.OP, if you ask me personally, of course I will answer that there is no real course I have ever taken in trading crypto, I do it based on information, friends, experts and my own daily, weekly and monthly experience, from my experience I continue to learn from the mistakes I make, automatically I have an established trading level, especially for myself.However, I've seen crypto trading course websites on the internet, maybe you can see them below.* The FUTURE of trading is here.* The Complete Cryptocurrency & Bitcoin Trading Course 2023.The point is: the website is only for information, the important thing is for you to investigate and be thorough, whether the website can be relied on or not, the point is to study it in detail first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "December 14, 2023, 01:47:20 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.Were these courses that you paid money for or did you study on your own? If this is the first option, then it can be stated that the money was wasted. Do not rush into futures trading and options until you reach profitable trading on the spot market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "December 14, 2023, 01:57:00 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.If you can spare your little time and data in watching some online YouTube videos, or go to some exchanges that has a tutorial guide on this, you could get served with several opportunities for learning, there's no amount of knowledge you could desired and not have through the use of the internet as long as you understand the way to make the search through, don't be in rush while learning, this platform is also another home you could learn and gain from other's experience if you're active in enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "December 14, 2023, 06:16:45 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.I can find some good links for you but suggesting what I have not used would be useless so I will simply say give it a try to tutsnode website, it is a pirated type website full of many courses and projects, I recently came to know about it and it is very good and totally free website, but the drawback is, you will be given a 10 GB of data to download from that platform so, to download more than that you might have to change the device with different IP or have to pay some money to them.I did find some good trading and technical analysis courses there and they seem to be good. But I want to clarify one thing that you might not find courses specifically related to Future or option trading because they are no different than spot trading in terms of analysis. The analysis has two types, one is fundamental and the second is technical and performs trading, whether if its spot, future, margin, etc. You have to learn both types of analysis.So, they will basically help you to learn analysis and then you can use those analysis courses for any reason, maybe for future or margin or for the spot. It all depends on your choice. The main unit of trading is analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "December 14, 2023, 07:09:06 PM",
      "body": "You have no problem with resources if you have internet connection. Start with guide and tutorials on websites like YT for free.There is no need for you to buy these courses because they do not have a lot of difference from the usual free tutorials you see in YT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alankasman",
      "created_time": "December 14, 2023, 07:46:24 PM",
      "body": "Quote from: Mynameis123 on December 13, 2023, 12:21:57 PMHii everyone,i have gone through multiple crypto future and option courses but didn't understand much. So i just wanted to know is there any good and detailed crypto future and option trading course available for free of cost. If yes, just provide me link of that course.More or less it is still theoretical in nature which we find on various platforms with material content that is almost general in trading. Likewise with the courses you choose to take. The content of the material that will be discussed is almost the same as what we read on various media platforms.There is no link that I can share here because you can use an internet browser and search for it there. Why do I say that, because I never took that course.I think this forum is good enough to be used as a place to discuss trading because the responses are the result of previous experiences. Possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}