{
  "id": "topic_5475500",
  "title": "lothian",
  "author": "lothian",
  "created_time": "November 25, 2023, 05:52:14 PM",
  "content": "Hi all!Ive noticed recently that more and more crypto sites are requesting KYC, and more and more restricted jurisdictions are being added to said sites Ts and Cs. This is a problem for a lot of people on this forum who like to gamble anonymously, and, perhaps use sites that are \"blocked\" in their home countries.My question then is, which are the best countries that can access these sites without issues, and pass all KYC checks? I'd love to hear your opinions!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475500",
  "comments": [
    {
      "author": "Sunderland",
      "created_time": "November 25, 2023, 06:39:18 PM",
      "body": "Quote from: lothian on November 25, 2023, 05:52:14 PMHi all!Ive noticed recently that more and more crypto sites are requesting KYC, and more and more restricted jurisdictions are being added to said sites Ts and Cs. This is a problem for a lot of people on this forum who like to gamble anonymously, and, perhaps use sites that are \"blocked\" in their home countries.My question then is, which are the best countries that can access these sites without issues, and pass all KYC checks? I'd love to hear your opinions!Im not able to tell you which country is the best because it depends on the casino license, for example:The players from UK are banned from playing on any casino with Curacao license, but they can play on any casino with Malta license.To prevent any issues you mentioned above, play from the countries where the online gambling is legal and make sure the casino you choose is allowed to operate in your region.For the KYC, it depends on the documents and if you able to provide them with the right documents and online gambling is legal from where you belong then there will be no problem at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "November 25, 2023, 06:52:14 PM",
      "body": "Doesn't every platform have almost the same rules for KYC despite being in any country? Or are we talking about the documents that you need to provide to pass the KYC verification? If so, I don't think I can answer that. As far as I know, if the documents are correct and legit, you will not face any kind of issue to verify it. But sounds like those crypto casinos seem to favour some specific country's document. Also, anonymity is not the thing you should be looking for when you are dealing with centralized platforms. Those documents are required to know their customers and to prevent scams and illegal activities. Your focus should be on finding reputable platforms that are easy to verify. Not what county it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "November 25, 2023, 06:59:18 PM",
      "body": "Quote from: lothian on November 25, 2023, 05:52:14 PMHi all!Ive noticed recently that more and more crypto sites are requesting KYC, and more and more restricted jurisdictions are being added to said sites Ts and Cs. This is a problem for a lot of people on this forum who like to gamble anonymously, and, perhaps use sites that are \"blocked\" in their home countries.My question then is, which are the best countries that can access these sites without issues, and pass all KYC checks? I'd love to hear your opinions!It would vary because licenses and its regulatory  aspect or conditions would really vary or depends on a certain to follow. Not everyone would really be the same in terms of rules and exemptions and exclusions on which it would really be just that right that you should really be that always reads up in speaking about sites TOS. I do believe that in todays we do still haveplatforms which arent that strict and allow most countries when it comes to this matter, it would really be that wise that you should really be making out some research and find out for yourself on which one and i can assure that you would still able to find out some good list about into those platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sunderland",
      "created_time": "November 25, 2023, 07:16:52 PM",
      "body": "Quote from: tjtonmoy on November 25, 2023, 06:52:14 PMDoesn't every platform have almost the same rules for KYC despite being in any country? Or are we talking about the documents that you need to provide to pass the KYC verification? If so, I don't think I can answer that. As far as I know, if the documents are correct and legit, you will not face any kind of issue to verify it. But sounds like those crypto casinos seem to favour some specific country's document. Also, anonymity is not the thing you should be looking for when you are dealing with centralized platforms. Those documents are required to know their customers and to prevent scams and illegal activities. Your focus should be on finding reputable platforms that are easy to verify. Not what county it is. Correct, its easy to fake an ID's card from certain countries and that is why some casinos will asks some users to provide them with a passport not an ID card.Anyway, that can be fake either with the photoshop. So, some casinos starting to ask for a selfie with the documents with different angle and video call verification.There are some casinos still lenient with their KYC policies, if we are not trying to abuse or cheat on their platform then they will not bother us with the KYC thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "November 25, 2023, 07:27:19 PM",
      "body": "Quote from: lothian on November 25, 2023, 05:52:14 PMHi all!Ive noticed recently that more and more crypto sites are requesting KYC, and more and more restricted jurisdictions are being added to said sites Ts and Cs. This is a problem for a lot of people on this forum who like to gamble anonymously, and, perhaps use sites that are \"blocked\" in their home countries.My question then is, which are the best countries that can access these sites without issues, and pass all KYC checks? I'd love to hear your opinions!Currently, i don't really know any gambling sites that don't require KYC, but what i have noticed is that not all gambling players actually want to play on online casino sites that require KYC, in many countries, KYC has become mandatory for people to comply with gambling business owners, if they violate this then their online casino site will be punished, usually KYC in online casinos has various levels, such as level 1 (usually only full name and date of birth), KYC 2 and so on, In countries that are famous for the legality of their gambling, KYC is still mandatory.  anyway, i'm quite curious, why would you want to play on a gambling site that doesn't require KYC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "November 25, 2023, 07:29:01 PM",
      "body": "Every casino today is asking KYC, there is no way you can escape it anymore especially if you have an outstanding balance in your account. While you don't wanna get scammed, it's best to just go to the most trusted ones rather than trying to avoid KYC by using some casinos that claim they will not and then scam you.But one way to avoid KYC is just to limit your funds based on the casino's policy where they won't mandate users to send some documents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "November 25, 2023, 07:41:54 PM",
      "body": "Quote from: lothian on November 25, 2023, 05:52:14 PMHi all!Ive noticed recently that more and more crypto sites are requesting KYC, and more and more restricted jurisdictions are being added to said sites Ts and Cs. This is a problem for a lot of people on this forum who like to gamble anonymously, and, perhaps use sites that are \"blocked\" in their home countries.My question then is, which are the best countries that can access these sites without issues, and pass all KYC checks? I'd love to hear your opinions!The answer to this question depends on which crypto casino you choose to play and what gambling license they hold.So first find a casino that you want to gamble,Then go to the terms and conditions section where you will see a list like thisBanned Regions:Aruba, Austria, Belgium, Bonaire, Curaçao, Denmark, France, Germany, Netherlands, Australia, UK, Spain, Saba, Slovakia, Slovenia, Statia, St Martin, USA, or any other jurisdiction that the Central Government of Curaçao (formerly the Netherlands Antilles) https://duelbits.com/tosFollowed by restricted regions if there are any.Quote from: bittraffic on November 25, 2023, 07:29:01 PMEvery casino today is asking KYC, there is no way you can escape it Quote from: macson on November 25, 2023, 07:27:19 PMCurrently, i don't really know any gambling sites that don't require KYC, Please read OP again before commenting on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "November 25, 2023, 07:44:36 PM",
      "body": "Quote from: Sunderland on November 25, 2023, 07:16:52 PMThere are some casinos still lenient with their KYC policies, if we are not trying to abuse or cheat on their platform then they will not bother us with the KYC thing.I don't think that's how it works mate. If you try to cheat or abuse the system then they will ask for verification that's for sure but they will also try to seize your wallet at any point in time. Could be a reason that they made up entirely. Thinking of them as lenient would be foolish because no one is going to willingly give up an opportunity to fill their bags. No matter how much decency you show them, once they see a good amount of money in your account, they will try to find reasons to seize your account. This is why it is important to stick to reputable platforms that offer user-friendly activity and won't try to scam you. Even if the KYC is mandatory, once done, reputable platforms won't try to take away your money from you by doing some shady activity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "November 25, 2023, 07:47:20 PM",
      "body": "I think that even if a country \"blocks\" a crypto casino, it's very easy to overcome this block. You can just change your DNS to a more free (as in freedom) dns provider. Generally a government can force ISPs operating under its territory to block certain gambling sites but these blocks usually being on the DNS layer. In the past I've used servers recommended by the German CCC, which is an organization focused on privacy. You can see their recommendations here (scrolling down): https://www.ccc.de/censorship/dns-howto/ Utilizing this tech I think that no matter where you live, you can use crypto to gamble as freely as you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "November 25, 2023, 07:48:11 PM",
      "body": "Some countries restricts crypto, hence crypto gambling won't be allowed. But, any country where crypto is allowed, citizens from the country can participate in crypto gambling. But, they'll have to submit their KYC. It's now a must for every casino under the law to require KYC. So, I can't say for sure if there's any need for having the best country, where KYC can be bypassed or for crypto gambling. Unless country based online casinos, that refuses to comply to KYC, and made their casino accessible to citizens of their country. Yet, I've not seen such a casino. You can elaborate more on the base of your question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "November 25, 2023, 08:09:09 PM",
      "body": "Quote from: Accardo on November 25, 2023, 07:48:11 PMIt's now a must for every casino under the law to require KYC. So, I can't say for sure if there's any need for having the best country, where KYC can be bypassed or for crypto gambling.But there are still some casinos and other gambling sites, especially the new and not well known gambling sites that are providing gambling services that do not require KYC. These gambling sites that I am talking about are centralized. They can force any of their customers to do KYC at anytime though, but they are no KYC gambling sites.Also are other gambling sites that are web3. Web3 do not require KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "November 25, 2023, 08:19:04 PM",
      "body": "Quote from: Sunderland on November 25, 2023, 07:16:52 PMQuote from: tjtonmoy on November 25, 2023, 06:52:14 PMDoesn't every platform have almost the same rules for KYC despite being in any country? Or are we talking about the documents that you need to provide to pass the KYC verification? If so, I don't think I can answer that. As far as I know, if the documents are correct and legit, you will not face any kind of issue to verify it. But sounds like those crypto casinos seem to favour some specific country's document. Also, anonymity is not the thing you should be looking for when you are dealing with centralized platforms. Those documents are required to know their customers and to prevent scams and illegal activities. Your focus should be on finding reputable platforms that are easy to verify. Not what county it is. So, some casinos starting to ask for a selfie with the documents with different angle and video call verification.There are some casinos still lenient with their KYC policies, if we are not trying to abuse or cheat on their platform then they will not bother us with the KYC thing.All these stress for what? Because you want to gamble online? I don't really get the reason for KYC in online crypto casinos, crypto it's is a decentralized currency, so what's the essence of KYC when you're using a decentralized currency on the casino, if it's a normal online casino that doesn't require the use of crypto, then it's cool, but it just don't make any sense making KYC mandatory before you can bet on crypto casinos. This is the reason gamblers as slowly moving aware from online crypto casinos that requires KYC and very soon I bet we won't be seeing more of them and they'll be forced to change that policy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "November 25, 2023, 08:24:50 PM",
      "body": "There are many countries where you can access most of crypto casinos without any problems and censorships. Even though my country, Brazil, is an example of country where casinos are forbidden to operate physically, it's also a good example of a country where you can have access to a plethora of virtual casinos without restrictions, therefore I consider it to be a good answer for the question you made.Anyway, there are many others as well. Virtual casinos made gambling much easier, especially for people from countries where physicall gambling isn't a possibility. And I really don't believe there is a worst or best country on that matter. Actually, there are many countries equally good.What we can consider are countries which charge more or less taxes over gamblers' winnings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "November 25, 2023, 08:42:13 PM",
      "body": "My country can access crypto without being asked upon the completion of the KYC and I can say that our government is slowly supporting crypto, in fact they are already encouraging people to cryptocurrency. If this is the only reason then I can say my country which is the Philippines is one of the best option or country to live in if you want to gamble online plus we also have a good tourist destinations where you can spend your time whole you are playing online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "November 25, 2023, 08:48:38 PM",
      "body": "Quote from: lothian on November 25, 2023, 05:52:14 PMHi all!Ive noticed recently that more and more crypto sites are requesting KYC, and more and more restricted jurisdictions are being added to said sites Ts and Cs. This is a problem for a lot of people on this forum who like to gamble anonymously, and, perhaps use sites that are \"blocked\" in their home countries.My question then is, which are the best countries that can access these sites without issues, and pass all KYC checks? I'd love to hear your opinions!Here in my country, gambling casinos and platforms are allowed but to expect about dealing with fiat based casinos then it would really be understandable that KYC is something that you would be needing to comply which it is really just that standard. If you are someone whose really that wanting to be anonymous then this is something that wont really be liking to deal with.Basing up on my experience on trying out to hover in other platforms then i do experience that i had been blocked by a specific site on which it do simply shows that there are really rules and regulations by some license provider that they would really be needing to comply or follow.We do know that not every corners of the world would be sharing up on the same rules and laws on which it would really be that normal that there would really bedifferences on between on which it is really that something normal or common.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "November 25, 2023, 08:58:30 PM",
      "body": "Quote from: lothian on November 25, 2023, 05:52:14 PMHi all!Ive noticed recently that more and more crypto sites are requesting KYC, and more and more restricted jurisdictions are being added to said sites Ts and Cs. This is a problem for a lot of people on this forum who like to gamble anonymously, and, perhaps use sites that are \"blocked\" in their home countries.My question then is, which are the best countries that can access these sites without issues, and pass all KYC checks? I'd love to hear your opinions!Online casinos is not about the country per se as with regards to KYC, almost all of the crypto based casinos are requiring KYC because that's what regulatory body mandated them and before a license could be granted to them.So in any case that you want to gamble, then you have to read first their ToS with regards to KYC or see countries that they totally ban or not allowed to used their platform.There could be a new set of Web3 crypto based casinos wherein there's no KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "November 25, 2023, 08:59:43 PM",
      "body": "Quote from: lothian on November 25, 2023, 05:52:14 PMMy question then is, which are the best countries that can access these sites without issues, and pass all KYC checks? I'd love to hear your opinions!In this case, there is no best, first of all, check if the casino accepts players from your country and if the answer is yes, then you can also pass KYC in that casino. Many of us here on the forum do not like KYC, and we have been actively avoiding it for years. I guess each for our own reasons, and there are a few good reasons for sure. If you are not lazy you can check some threads about it here in the gambling section, there are pretty nice comments, you can start from these ones:- Is KYC data on Gambling sites safe?- Information of Crypto Casinos License and KYC requirementsAnd there are good & nice casinos around that still don't ask for KYC, especially if you are a fair player you won't get in a situation to be asked for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "November 25, 2023, 09:17:15 PM",
      "body": "Quote from: Johnyz on November 25, 2023, 08:42:13 PMMy country can access crypto without being asked upon the completion of the KYC and I can say that our government is slowly supporting crypto, in fact they are already encouraging people to cryptocurrency. If this is the only reason then I can say my country which is the Philippines is one of the best option or country to live in if you want to gamble online plus we also have a good tourist destinations where you can spend your time whole you are playing online. Have to agree on this and in most of the KYC, we passed since our documents is widely accepted in KYC.I think some site is not allowing some country on their platform for some reasons and it’s either about their government regulations or the casinos itself is prohibiting you to gamble. If your country is not on the list, better not to try to register or use any VPN option because many sites don’t allow this one so make sure to read the terms before you register and know if your country is on a the approved list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "November 25, 2023, 09:19:02 PM",
      "body": "Quote from: lothian on November 25, 2023, 05:52:14 PMHi all!Ive noticed recently that more and more crypto sites are requesting KYC, and more and more restricted jurisdictions are being added to said sites Ts and Cs. This is a problem for a lot of people on this forum who like to gamble anonymously, and, perhaps use sites that are \"blocked\" in their home countries.My question then is, which are the best countries that can access these sites without issues, and pass all KYC checks? I'd love to hear your opinions!Accessibility depends and passing the KYC also depends if they'll accept the document/s you've passed onto them. Look for sites and compare them on other sites on which are the countries that aren't that restricted as much because I think that's what you're looking for, and I guess a developing third world countries is your choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}