{
  "id": "topic_5446448",
  "title": "Sexylizzy2813",
  "author": "Sexylizzy2813",
  "created_time": "March 27, 2023, 08:56:54 AM",
  "content": "I just dey ponder on dis mata as my baby put to bed. Prior to now, I don dey see how we society dey take d issue of childbirth and I say make I bring am here since some of us here na fadas and modas and such una fit help spread more light to doz of us for forum wey never get the experience. Pikin dey regarded as gift, joy and happiness for family and to women their motherhood never complete if dem no get tata (pikin).Women for our society nid plenty love no mata say dem get dia own bad side, women dy try I no go lie. Wen dem get belle (even period) dem nid plenty attention love care even respect plus patience, becos some with belle go even say dem wan chop wetin no dy house for night or anytime self, dem go dy crave for wetin no dy at your reach, no be dia doings oh na the pikin. E dy frustrating and annoying for men oh and I know, but some women dy use dat one sufa some men dat depends on how dem treat dem but e no mean oh, for me. Na to just try and flow with d pressure, I know say no be all men fit try but make dem try.Some men no sabi endure or show dat attention, even at pregnancy stage some go still wan nor-nor not minding how she feel or even dy hala her to go and arrange food do your duty as a wife or is it bcos you're pregnant, some men dy beat dia wife even with belle, E dy pain me. Make men try not to dy touch woman with or without belle cos d battle dem dy face wen belle dy and for labor room e no easy.I know say some men dem no born dem with d ability I care and all day, but communication is d key, understanding dy help for relationship. Na to just dy try for her no be say she no sabi wetin she suppose do oh but with all these small small help she go come appreciate all you dy do cos she know say na she suppose do am on a normal by dat way you go ease her stress.I go like una to put mouth for the mata wey I carry put for table...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446448",
  "comments": [
    {
      "author": "Davidvictorson",
      "created_time": "March 27, 2023, 04:58:36 PM",
      "body": "I take God bed una our Nigerian brothers make we stop all this kind posts na. This one nor follow at all. Abeg na. Wetin concern this your topic concern bitcoin, cryptocurrency, economy. Abeg this place nor be Nairaland wey dem dey discuss relationship or marriage matter na. If this thing continue like this before we know now, dem go start to do tribal talk and all those nonsense. Abeg OP you need to lock this topic, it is not worth discussing on this forum or this board. Or better still, move am go off topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}