{
  "id": "topic_5408371",
  "title": "PhysicalBitcoinArt",
  "author": "PhysicalBitcoinArt",
  "created_time": "August 01, 2022, 06:15:25 PM",
  "content": "Please watch this Youtube video to view the detail of this Cutting board.https://youtu.be/8SO4keE-UfYTo participate in this auction & view the Cutting Board, please go to Plebeian Market here:https://plebeian.market/auctions/V3AAEach Sapele Hardwood #Bitcoin Cutting Board takes approximately 2 days to create, it is hand glued together, sanded, 4hrs of CNC carving, pouring Epoxy, 72hrs to dry properly, sanding the epoxy to level of #BTC Logo, and finishing touches.This is #1 of a Limited Edition of 21 with the Block Height of 747115 carved into the back.The carved side is for displaying (not cutting) the other side is for the purpose you desire..This cutting board will outlast your life and be something to pass down to your family one day.The Cutting Boards will evolve as time goes on and color of epoxy will change as well.The Black Epoxy represents the Void where life began, all life on Earth begins in Darkness and starts to Germinate. Light is shared and it begins to grow & evolve.This is the concept behind my Limited Edition Carvings, which will also evolve and become more creative and enhanced.Additional designs will be shared as well in the future with extremely exotic woods & other techniques.www.PhysicalBitcoinArt.comwww.Twitter.com/BitcoinDesigns -- Send me a DM if you have any questions.www.instagram.com/physical_btcShipping from USAhttps://twitter.com/BitcoinDesigns/status/1553705985323065347?s=20&t=keh9Y7j0J6OXBaZNtUtm6w",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408371",
  "comments": [
    {
      "author": "PhysicalBitcoinArt",
      "created_time": "August 04, 2022, 11:46:46 PM",
      "body": "The auction is ending in 11 hours, if you have any issues with making a bid, let me know! https://plebeian.market/auctions/V3AA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinageMint",
      "created_time": "August 05, 2022, 10:05:23 AM",
      "body": "Is this WoodCollecor making a comeback?  https://bitcointalk.org/index.php?action=profile;u=392383",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PhysicalBitcoinArt",
      "created_time": "August 05, 2022, 10:42:27 AMLast edit: August 05, 2022, 11:49:47 AM by PhysicalBitcoinArt",
      "body": "hahaha what da! I had no clue about all this, I didn't get started with carving wooden stuff till around 2019.. I wish I was that guy, if that is all true, just did a search and read his posts about it all. Pretty neat idea tbh.. thanks for sharing!! (after reading more, I didn't realize when replying to you that he scammed people, so I take that back 100%)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinageMint",
      "created_time": "August 05, 2022, 12:44:24 PM",
      "body": "Quote from: PhysicalBitcoinArt on August 05, 2022, 10:42:27 AMhahaha what da! I had no clue about all this, I didn't get started with carving wooden stuff till around 2019.. I wish I was that guy, if that is all true, just did a search and read his posts about it all. Pretty neat idea tbh.. thanks for sharing!! (after reading more, I didn't realize when replying to you that he scammed people, so I take that back 100%) Sorry, i was not accusing you of anything, just joking around.If you have not heard of him before, the whole story is defiantly worth reading, it was interesting at the time. There are a few threads about him and the whole prize/scam.Your art does look very nice. Best of luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}