{
  "id": "topic_5450546",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "April 28, 2023, 07:50:05 PMLast edit: April 04, 2025, 07:47:31 PM by joker_josue",
  "content": "WWW.TALKIMG.COMI present a new image hosting service, specially designed for BitcoinTalk and the entire community.After a few years of noticing how many images do not appear correctly in the forum or are very slow to load, not to mention the images that stop appearing after a few months or years, the TalkImg project was born. Purpose  ____________________Provide a hosting service dedicated to the BitcoinTalk forum that is useful and practical for everyone.It is intended that the images remain available in the forum, and have a fast loading. Features ____________________- All uploaded images can only be used in the forum (unless requested by a user; it can be done after an evaluation by joker_josue).- It is only allowed to upload images in formats accepted by the forum (JPG, JPEG, PNG, GIF).- Images must have a maximum size of 2.5MB.- Once uploaded, images cannot be deleted (unless you use the link generated at the time of upload, which is only accessible at that time).- NSFW images are not allowed.- No registration of user information is performed (only the IP is saved for spam control).- All EXIF information is deleted by the system when uploading.- Option in the code to embed the BBCode already with the actual height and width of the image (just choose \"BBCode full fix HxW\").- new Upload via link, applying the same rules for uploading files. (Temporarily Suspended) Long Term  __________________I have several years of experience with online galleries, and based on that experience I hope to keep this project online for as long as possible. Of course, we cannot predict the future, but what depends on me, this project will be maintained for many, many years. Server  _____________________The server dedicated to TalkImg is located in the Netherlands, consisting of NVMe SSD disks guaranteeing the best read/write speeds.It uses LiteSpeed Web Server software, which guarantees better performance. And with AMD EPYC processors, so all information is processed as quickly as possible. This service is already assured for the coming years, with the capacity to expand whenever necessary. Account ____________________This service is intended for exclusive use on BitcoinTalk, in this sense only forum users can have an account on TalkImg, for this reason the account creation option is not active for the general public. Users who want to have an account should contact joker_josue by PM to request it. The request will be evaluated and if approved the account will be created. Backups ___________________- The server automatically performs daily backups that will be kept for up to 30 days.- A ZIP is created weekly with all the new image uploads from the last week, which will be available for download for 15 days, here: talkimg.com/tempbackups/new ZIP Tool _________________Auxiliary tool, which allows you to ZIP images larger than 2.5MB. Compression is performed via PHP features, which can significantly reduce image quality. The image is automatically loaded, converted and sent to TalkImg, providing the link/BBCode to be used on the forum. This tool is still in BETA phase, and there may be errors.Access: Image Zip Tool - TalkImgnew Statistics ________________Total statistical data, since the project started (April 28, 2023):                                                                      Images: 176 591Disk Space: 52.7GBLast update: 04/04/2025Monthly statistics:[First 15 days][May'23][Jun'23][Jul'23][Aug'23][Sep'23][Oct'23][Nov'23][Dec'23][Jan'24][Feb'24][Mar'24][First Year][Apr'24][May'24][Jun'24][Jul'24][Ago'24][Sep'24][Oct'24][Nov'24][Dec'24][Jan'25][Feb'25][Mar'25] Donations & Ad  ______________The project should be supported by donations from the community and with advertisements similar to the forum signature campaigns.- Donations: Anyone wishing to support this project can make their bitcoin donations to the address: bc1qhwnncpdd8gfzqwjkk9n052wf7g9mvks3xaa7qa or Lightning Address: talkimg@wallets.fyoumoneypod.com- Ad: There will only be one ad on the homepage, similar to what we have today in user signatures. If a campaign manager wants to place an ad on TalkImg, please contact me. Coming Soon  ________________- Automatic file conversion system. (no scheduled date)- Possibility to define the size (height or width) of the image in BBCode. (no scheduled date) More Details _________________The site is managed by joker_josue, who will maintain it and provide full support to users.I am waiting for your opinion and suggestions; this service was made for the community and to better serve the community.It is intended that this project lasts as long as possible, whether it has a lot of acceptance or not. Therefore, all images that are uploaded are available forever. Links, Scripts & Add-ons  _______TalkImgTerms of ServicePrivacy Policynew TalkImg Service Statusnew Image Zip Tool - TalkImgSig Promote TalkImg###[Add-on] Add a button to upload an image directly from the forum - Created by TryNinja[Script] Imgur to TalkImg - automatically fix your broken images - Created by TryNinjaIf you develop a script or add-on that is public, let me know to update the list.new Events  ___________________TalkImg Awards - Image of the Year 2023 | sponsored by BC.Game / Icarus Local Boards _________________This topic is the only one that will support TalkImg users, and will always have official information about the project.But here is the list of topics translated to local boards:العربية (Arabic) Kavelj22Bahasa Indonesia (Indonesian) dansus021Bengali roksana.heeDeutsch (German) cyganEspañol (Spanish)  PorfiriiHrvatski (Croatian) ovcijisirNigeria (Naija)  ChilwellPakistan (Urdu) JunaidAziziPilipinas PeanutswarPolski cyganPortuguês (Portuguese) joker_josuePyccкий (Russian) zasad@Română (Romanian) GazetaBitcoinTürkçe (Turkish) mindrustIf you do a translation, let me know to update the list.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450546",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "April 28, 2023, 07:50:18 PMLast edit: July 27, 2024, 09:49:53 AM by joker_josue",
      "body": "Change Log:27/07/2024 | OP added donation information via Lightning.27/04/2024 | v1.30 - Script update, with several bug fixes. More highlight the tool for zipping larger MB images. More details here.                  | ZIP v0.60 - Improvement in compression and more details about it for the user.26/03/2024 | OP updated with information about events and new service features.                  | v1.20 - Added the possibility of uploading images via link. (Temporarily Suspended)14/11/2023 | OP updated with the link \"TalkImg Service Status\", where it is possible to check uptime.07/11/2023 | ZIP v0.45 - It is now possible to convert WebP and BMP images. Improvements to zipping configuration.25/09/2023 | ZIP v0.34 - Launch of the new tool to compress images larger than 2.5MB.18/08/2023 | v1.19 - Several graphic adjustments were made, for better visualization of some information.07/08/2023 | OP updated with total project statistical information.10/07/2023 | v1.17 - Added more information about donations.05/06/2023 | v1.16 - Added button to resize image before upload, and improvements in the way to select the link to embed.30/05/2023 | OP updated the translations list.28/05/2023 | OP updated with information about system backups.26/05/2023 | v1.14 - The file is now renamed at the time of upload, to a random name.19/05/2023 | v1.13 - Auto checked terms when uploading, to facilitate use via TOR browser and similar.17/05/2023 | Updated to OP with more information (Server/Account/Links, Scripts & Add-ons).15/05/2023 | Upgraded the server to better performance.13/05/2023 | v1.12 - Adjustments to the Flood Protection system.09/05/2023 | v1.11 - Improvements to the user area.06/05/2023 | v1.10 - Created The option for the code to incorporate BBCode already with the actual height and width of the image. Settings in the area of user accounts.03/05/2023 | OP updated with some more details about the project (Long Term).02/05/2023 | v1.03 - Added information for donations.01/05/2023 | OP updated with some more details about the project.                  | v1.02 - Adjusting the supported size of 2.5MB and at the hosting level.28/04/2023 | v1.00 - Launch of the TalkImg website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 28, 2023, 07:50:24 PMLast edit: May 01, 2023, 11:04:57 PM by joker_josue",
      "body": "Code:-----BEGIN BITCOIN SIGNED MESSAGE-----Today is 28/04/2023 and I'm joker_josue, owner and manager of the website www.talkimg.com-----BEGIN SIGNATURE-----1498wXNYWsg4s3QMvCZhc12a2dR6WFbGUmHAb/LiYvEET+Bbm0qU+E6KODMrP0k05QY2FR7v6l3OfbDBinfpNK7Lri1gfWGZbaUvUcwOhyZpw+G/ZQHouID6w=-----END BITCOIN SIGNED MESSAGE-----Code:-----BEGIN BITCOIN SIGNED MESSAGE-----Today 02/05/2023 I joker_josue, inform you that the address for donations to the www.talkimg.com project is the following: bc1qhwnncpdd8gfzqwjkk9n052wf7g9mvks3xaa7qa-----BEGIN SIGNATURE-----1498wXNYWsg4s3QMvCZhc12a2dR6WFbGUmGzxVbilpxCesvMX+1YBWN8EJarmi5VMFwIRlNn8qdDwDcMwdjMzzfmvCU3l4PLJ22ust6gjMDlsRBGcOOroIs44=-----END BITCOIN SIGNED MESSAGE-----See also...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "April 28, 2023, 08:45:51 PM",
      "body": "Wow, congratulations Joker, this is excellent, mainly because of this:Quote from: joker_josue on April 28, 2023, 07:50:05 PMAfter a few years of noticing how many images do not appear correctly in the forum or are very slow to load, not to mention the images that stop appearing after a few months or years, the TalkImg project was born.I have always used imgur or imgbb but after a while the images disappear and/or get broken.A lot of old topics get weird or meaningless without the images, and I think the best feature will be this.I will do the tests, but I can already tell you that I will start using your site and if I need to I will make some suggestions.Just one question, as time goes by, won't the cost of maintaining all the images become too expensive?(even if your tool is only for the forum)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "April 28, 2023, 08:58:53 PM",
      "body": "Nice JobThe only constraint members like me might have, is that some of us use third party screenshot and image uploading apps like Sharex. These apps upload images automatically to preset sites like Imgur, So I wonder if it would be possible to incorporate your site to such apps.How long do you plan to run this project?  You know it would be heartbreaking for the images hosted on the site that are linked to great threads in the forum to disappear after about 4-5 years when the site stops operating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "April 28, 2023, 09:04:07 PM",
      "body": "Quote from: joker_josue on April 28, 2023, 07:50:05 PMI present a new image hosting service, specially designed for Bitcointalk and the entire community.After a few years of noticing how many images do not appear correctly in the forum or are very slow to load, not to mention the images that stop appearing after a few months or years, the TalkImg project was born.Great work, but one issue I have with this hosting... what happens if in a few years this website hosting stops working, all images will be gone forever or there is some backup archiving solution in this case?Some of the worst things in forum for me is opening interesting old thread that is  full of error images that can't be loaded anymore. My suggestion is to add Delete button, if user decides to delete image himself for privacy or any other reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "April 28, 2023, 09:12:26 PM",
      "body": "This is an outstanding accomplishment. I also see it as a service to the bitcointalk community since it is solely designed for us. I have had issues with using images because of the process and other issues that I have also encountered. It is also good to know that your new site promotes privacy which is very important to many members of the community. But my only reservation is the inability to delete uploaded pictures. Sometimes one might make a mistake in the selection of the picture and will only discover it when it has been uploaded. I think there should be freedom to delete pictures easily without any form of difficulty. I want to deeply appreciate you for your effort. I am hoping to be one of the first users of this package. Best regards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "April 28, 2023, 09:50:08 PM",
      "body": "First of all, congratulations on this tool @joker_josue! It never hurts such a vast community to have its own image hosting, but I do have some questions/remarks (some already shared):What will happen to the image database if something happens to you? Would you consider give access to another (trusted) user in the future perhaps?Are you considering backups in the future? It would be a tremendous loss if anything happens to the pool of images later down the line;How are you planing dealing with the exponential hosting costs of such service? Depending on various factors (# users, # requests, image sizes) you'll probably be looking to a hefty price in the long term. Even if you do accept donations sadly I believe you won't be able to achieve a balance at the end of the month (thus paying out of your pocket which isn't feasible long term).;Shouldn't the website be accessible only to bitcointalk users? Like everything on the Internet, as soon as it gets more attention surely people will start to upload dozens of images (and probably some illegal as well). I know that this would be easy to circumvent - basically anyone would just create an account here just to get free image hosting - but perhaps this could also become a tool that would only be unlocked whenever a certain amount of merit & activity was reached?The way I see the verification happen is very manual - A user would input his/her username on your registration form and then perhaps you could have a username registered for the service here (like talkimgverification) that would demand a message to be sent from that username in order to verify that it was the owner who tried to registered in the platform.;How will you control NSFW/illegal pictures being submitted (because it is the Internet right?). By user reports? Won't you get in problems if there are many submissions/reports of this nature? (one more reason to restrict this tool to members of our community);I'm unaware of the user page, but having the possibility to create groups of pictures and a gallery view would be a nice addition in the future (no idea if it is an easy implementation to do...);Then again, great initiative! Looking forward to see what more experienced users have to say about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "April 28, 2023, 10:00:30 PM",
      "body": "Quote from: rdluffy on April 28, 2023, 08:45:51 PMI have always used imgur or imgbb but after a while the images disappear and/or get broken.A lot of old topics get weird or meaningless without the images, and I think the best feature will be this.I will do the tests, but I can already tell you that I will start using your site and if I need to I will make some suggestions.I have been using https://imgur.com/ till now but there were some issues as sometimes the uploaded images won't load etc but now i will try this new tool and already bookmarked  https://www.talkimg.com/  Already like the clean interface.Quote from: Fiatless on April 28, 2023, 09:12:26 PMThis is an outstanding accomplishment. I also see it as a service to the bitcointalk community since it is solely designed for us. People who don't use bitcointalk can also use this talkingIMG and it will be interesting to see how quickly it becomes popular in the general public",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vapourminer",
      "created_time": "April 28, 2023, 10:17:14 PM",
      "body": "w00t!very easy and clean UI, i like it.imjr and its ilk all try to be everything and all it dose is make it harder to do what you want. this is about as close to \"one click\" as ive seen in a long time.great job!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "April 28, 2023, 10:25:05 PM",
      "body": "Great job on this tool, joker_josue. I had to test it right away and it really works fine. But the only question is, how long of these image are hosted because I very rarely save every image after posting them on bitcointalk. It might be good to have one dedicated tool to host images posted on bitcointalk, your tool is one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "April 28, 2023, 10:46:05 PM",
      "body": "Wow, this sounds like a great project! I can definitely attest to the frustration of images not loading or disappearing after a while. It's great to see that you have taken this issue into your own hands and created a solution with TalkImg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 28, 2023, 10:55:06 PM",
      "body": "@joker_josue I bet I love this and probably the first person to use it. Weeeh.. 👇👇👇.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "April 28, 2023, 11:00:15 PM",
      "body": "Previously I used imgbb to upload images to the forum while Imgur always had problems, but I'm happy @joker_josue made a site that was easier for us as a forum community and I will use TalkImg.com as the main choice today. very simple and elegant.Loading images here is faster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 29, 2023, 12:30:06 AM",
      "body": "First of all, thank you for everyone's support so far. Your feedback only makes me want to continue.  I'm going to answer some questions that were asked, I hope I can clarify:Quote from: rdluffy on April 28, 2023, 08:45:51 PMJust one question, as time goes by, won't the cost of maintaining all the images become too expensive?(even if your tool is only for the forum)In an initial phase, because I don't know how well accepted the service will be, I'm using cloud services, such as support for website hosting, which, as it still has little space, means it doesn't have a high cost. Let's see how things evolve, and if it goes well, I'll try new solutions. Perhaps, I can appeal for donations, but at this stage I did not think it was right to do so.Quote from: JeromeTash on April 28, 2023, 08:58:53 PMHow long do you plan to run this project?  You know it would be heartbreaking for the images hosted on the site that are linked to great threads in the forum to disappear after about 4-5 years when the site stops operating.No one can predict the future, but normally I don't like to let go of this type of project. So my plan is to keep it online as long as possible.Worst case scenario, disable new uploads, and keep existing images. But I hope to make sure that never happens. It all depends on community support.Quote from: dkbit98 on April 28, 2023, 09:04:07 PMGreat work, but one issue I have with this hosting... what happens if in a few years this website hosting stops working, all images will be gone forever or there is some backup archiving solution in this case?So that will be the next step will be to better structure the backup system so that everything can be kept online. In this initial phase I am using cloud services to ensure the hosting of the images, and based on acceptance by the community, I will readjust to keep everything safe. As I said, the evolution of the project will depend on how the community accepts it. I want to grow at the pace of community acceptance, because that's the only way I'll be able to keep everything working in a viable way.Quote from: dkbit98 on April 28, 2023, 09:04:07 PMMy suggestion is to add Delete button, if user decides to delete image himself for privacy or any other reasons.When uploading, a link is generated that serves to delete the photos. If you save the link, you can do this later. But, in a way, this is what you want to avoid, so as not to generate a post without images. And if the user wants to have greater control over their photos, they can request an account.Quote from: RickDeckard on April 28, 2023, 09:50:08 PMWhat will happen to the image database if something happens to you? Would you consider give access to another (trusted) user in the future perhaps?How are you planing dealing with the exponential hosting costs of such service? Depending on various factors (# users, # requests, image sizes) you'll probably be looking to a hefty price in the long term. Even if you do accept donations sadly I believe you won't be able to achieve a balance at the end of the month (thus paying out of your pocket which isn't feasible long term).;Shouldn't the website be accessible only to bitcointalk users? Like everything on the Internet, as soon as it gets more attention surely people will start to upload dozens of images (and probably some illegal as well). I know that this would be easy to circumvent - basically anyone would just create an account here just to get free image hosting - but perhaps this could also become a tool that would only be unlocked whenever a certain amount of merit & activity was reached?The way I see the verification happen is very manual - A user would input his/her username on your registration form and then perhaps you could have a username registered for the service here (like talkimgverification) that would demand a message to be sent from that username in order to verify that it was the owner who tried to registered in the platform.;How will you control NSFW/illegal pictures being submitted (because it is the Internet right?). By user reports? Won't you get in problems if there are many submissions/reports of this nature? (one more reason to restrict this tool to members of our community);I'm unaware of the user page, but having the possibility to create groups of pictures and a gallery view would be a nice addition in the future (no idea if it is an easy implementation to do...);Just highlighting the points I haven't answered yet:- If usage growth is large, I will certainly enlist the help of other users to help moderate and perhaps create a plan, in case something happens.- There will be costs, no doubt. But I'm already used to dealing with image hosting site. And that's why I can find servers with minimally affordable costs to keep everything running. We'll see how things evolve.- For now, I think the project is still in its infancy, I didn't want to create that level of limitation. But if I really see that this is necessary, I can create this kind of limitation.- This may prove to be the biggest challenge. It's always tricky to have highly automatic systems, but I will gradually create automatic filters. But most work will be done manually. But there will always have to be human moderation, initially me and maybe I can invite other users to be moderators.- If you want to have an account, you can request it.  For those who know, for example, the ImgBB service, I can say that it is very similar. Therefore, these are resources that can be implemented.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husna QA",
      "created_time": "April 29, 2023, 01:56:09 AMLast edit: May 16, 2023, 01:09:19 PM by Husna QA",
      "body": "Nice. The process flow reminds me of the imgbb.comI usually use Imgur and create an account there to make it easier to manage the uploaded images, such as deleting images for specific reasons.I recently tried TalkImg's service to upload some images I used in the following post.Quote from: Husna QA on April 29, 2023, 01:12:45 AM-snip--snip-Quote from: joker_josue on April 29, 2023, 12:30:06 AMNo one can predict the future, but normally I don't like to let go of this type of project. So my plan is to keep it online as long as possible. -snip-Yeah, no one can predict what will happen in the future. As a backup, I also used an alternative image link to another image hosting that can be seen when the mouse is hovered over the image.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "April 29, 2023, 04:49:36 AM",
      "body": "You did a really great job.The good thing about the site is that it does not require registration, and what is also interesting is that it gives a BB code for the thumbnail, medium and fixed images. This is very nice. Every time I had to add this code to resize the image.It would be very interesting if you obtained approval from the forum administration to integrate the site within the image tools for ease of access.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "April 29, 2023, 05:06:15 AM",
      "body": "You have a great Project Congratulations!!It actually loads images faster, and uploading images was really easy.I've been using Imgur ever since when uploading images, and it might be a great alternative but I'm just concerned about this website's database.The images might also be deleted when the images host is down, So far you did a really great job Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roksana.hee",
      "created_time": "April 29, 2023, 05:14:53 AMLast edit: April 30, 2023, 01:40:27 AM by roksana.hee",
      "body": "@joker_josue,Congratulations on the launch of TalkImg, a fantastic new image hosting service designed specifically for the BitcoinTalk community. It's great to see a solution to the problem of slow-loading and disappearing images on the forum. The features, including the limitation of image format, size, and usage, along with spam control, will make it a valuable tool for users. It's impressive that no user registration is required, and all hidden information is deleted when uploading. I am excited to see the upcoming features, and I am sure the community will appreciate the effort and support provided by joker_josue. Well done! I already use it. Really it's a great invention for BitcoinTalk Community. Also, I'll publish a post on my local Board named    [Re: বাংলাদেশ (Bengali)].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "April 29, 2023, 05:25:04 AM",
      "body": "Quote from: joker_josue on April 29, 2023, 12:30:06 AMIn an initial phase, because I don't know how well accepted the service will be, I'm using cloud services, such as support for website hosting, which, as it still has little space, means it doesn't have a high cost. Let's see how things evolve, and if it goes well, I'll try new solutions. Perhaps, I can appeal for donations, but at this stage I did not think it was right to do so.The only sensible way is to opt for ads. They might cause some minor annoyance but someone has to pay the bills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}