{
  "id": "topic_5473087",
  "title": "Gencecikmen",
  "author": "Gencecikmen",
  "created_time": "November 06, 2023, 03:19:25 PM",
  "content": "Şu an asgari ücret 11.500 TL, güncel dolar kuru üzerinde baktığımızda 404 dolar ediyor. Ülkemizdeki enflasyon ve alım gücünü düşününce, bu para ile hayatta kalmak imkansız. Asgari ücretli ailelere ve kişilere Allah kolaylık versin. Asgari ücrete yüne güzel bir güncelleme geleceğinden bahsediliyor yandaş basından. Enflasyon böyle olursa bir aya o gelen zam eriyecek orası ayrı. Yeni yıl ve Mart'ta ki yerel seçimler düşünülünce, yüksek oranda bir asgari ücret zammı gelebilir. Peki sizlerin tahmini nedir? 1 Şubat 2024'te asgari ücretli ne kadar para alacak? 404 dolardan fazla mı olacak az mı olacak? Çalışma ve Sosyal Güvenlik Bakanı Vedat Işıkhan: \"Yıl sonunda asgari ücrette enflasyon yükünü hafifletmek adına önemli bir gündemimiz var.\" böyle dedilerse asgari ücretli yandı.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473087",
  "comments": [
    {
      "author": "gospodin",
      "created_time": "November 06, 2023, 03:52:03 PM",
      "body": "geçen seneki enflasyon oranına ve asgari ücrete yapılan zam oranına bakmak lazım. yine de benim tahminim %35'i geçmeyeceği yönünde. her ne kadar asgari ücrete artık senede bir kere zam yapacağız deseler de bence sene ortasında bir zam daha gelecektir. ha asgari ücrete bu dediğim zam oranı gelirse memur ve memur emeklisine gelecek zamın yanında düşük kalacak. (memurunki her ne kadar zam olmasa da.) keşke anket olarak açsaydınız hocam konuyu daha keyifli olurdu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "November 06, 2023, 03:56:08 PM",
      "body": "Yeniden değerleme oranı %58 iken asgari ücrete bu oranlara yakın bir zam yapılmalı. Yok bundan az yapılırsa önümüzdeki seçimde asgari ücretliler kazan kaldırabilir. Bunu pek göze almazlar. Zaten tek zam ile 2024 savuşturulacak gibi duruyor. Emekli için 2023 ne ise asgari ücretli için 2024 aynı durumda olacaktır. Hani ben yüksek söyledim ancak bunu ben söyledim. Keşke ben zam verebilseydim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "halloweenn666",
      "created_time": "November 06, 2023, 05:32:11 PM",
      "body": "Asgari ücret 12 bin iken 7500 ile geçinmeye çalışan emeklilere haksızlık yapıldığını düşünüyorum.Asgari ücret yerine emekli maaşı artmalı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 06, 2023, 10:45:56 PM",
      "body": "Benim sağdan soldan duyduğum asgari ücretin 17.500 civarında bir rakam olarak belirleneceği, ve bu rakam kronikleşmiş sorunları iyice içinden çıkılmaz hale getirecek.Her şeyden önce asgari ücret ne demek? Minimal fayda elde edilen, vasıfsız veya tecrübesiz ya da düşük profilli çalışana verilecek en düşük yasal ücret demek. Bu rakam çok politik olduğu için pazarlık vb hikayelerine kanmayın, iktidar aslında şartlar içerisinde en yüksek rakamı vermeyi tercih eder, çünkü işine gelir. Ama \"asgari\" diğerlerine göre fazla yükseldiği zaman ücretler arasındaki makas daralır, vasıflı ile vasıfsızın farkı kalmaz ve çalışma huzuru bozulur, kaldı ki şu an yaşanıyor. Ayrıca rakam yine diğerlerine göre yüksek olunca asgari ücretle çalışan sayısı çok artar ve saçma sapan bir durum ortaya çıkar.Şöyle örnekleyeyim, Avrupada asgari ücretle çalışan oranının en yüksek olduğu ülke AB garibanı Romanya ve Yaklaşık %20-25 arası bir çalışan kitlesi var, en iyi durumdaki Hollanda'nın asgari ücretle çalışan oranı %5'in altında. Hemen Türkiye'ye dönüyoruz: Bizde asgari ücretle çalışan oranı %60-65 aralığında.Bunun dışında emekli maaş geçinebilmek için gereken en düşük ücret olarak kabul edilen asgari ücretin aslında yarısı kadar olduğu ve açıktan verilen bahşişle yükseltildiği gerçeğini de unutmamak lazım.Türkiye'de sosyal güvenlik sistemi ve gelir adaleti oldum olası bomboktu ama bu iktidar iyice tüy dikti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kastoriante",
      "created_time": "November 07, 2023, 11:46:38 PM",
      "body": "50 bin TL olsa ne olur, 30 TL'ye aldığın süt 150 TL olacaksa? İktidar avroya geçmeli. AB bildiğim kadarıyla tam üyelik için koyduğu şartlardan biri de bu. Mutlaka kolaylık da sağlayacaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "November 08, 2023, 08:17:13 AM",
      "body": "Quote from: kastoriante on November 07, 2023, 11:46:38 PM50 bin TL olsa ne olur, 30 TL'ye aldığın süt 150 TL olacaksa? İktidar avroya geçmeli. AB bildiğim kadarıyla tam üyelik için koyduğu şartlardan biri de bu. Mutlaka kolaylık da sağlayacaktır. AB’ye girmeden Euro’ya geçiş oluyor mu? Bildiğim kadarıyla önce üyelik sonra para birimi olayı oluyor çünkü sonradan AB’ye giren ülkelerde kademeli geçişlerle yerel para birimi ve Euro baz alınarak devam etti. Euro daha sonra tamamen devam etti. Ticareti Euro ile yapıyoruz burada ama günlük kullanımda böyle bir şey şimdilik mümkün değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "November 08, 2023, 05:12:45 PM",
      "body": "Quote from: Mustang Shelby on November 08, 2023, 08:17:13 AMQuote from: kastoriante on November 07, 2023, 11:46:38 PM50 bin TL olsa ne olur, 30 TL'ye aldığın süt 150 TL olacaksa? İktidar avroya geçmeli. AB bildiğim kadarıyla tam üyelik için koyduğu şartlardan biri de bu. Mutlaka kolaylık da sağlayacaktır. AB’ye girmeden Euro’ya geçiş oluyor mu? Bildiğim kadarıyla önce üyelik sonra para birimi olayı oluyor çünkü sonradan AB’ye giren ülkelerde kademeli geçişlerle yerel para birimi ve Euro baz alınarak devam etti. Euro daha sonra tamamen devam etti. Ticareti Euro ile yapıyoruz burada ama günlük kullanımda böyle bir şey şimdilik mümkün değil. İngilter kendi para birimini kullanarak ab üyesi olmuştu. Ab üyeliğinden ayrıldığı güne kadar da euro kullanmadı. Ayrılık tamamlandı şimdi yine kendi para birimini kullanıyor. Bizim Tl yi güçlendirmeden başka bir şansımız yok. Neye geçersek geçelim sonumuz yine hüsran olacaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 08, 2023, 05:35:44 PM",
      "body": "17 bin gibi rakamlar konuşuluyor muhtemelen benzer rakamlarda bir asgari ücret belirlenir. 15 binden az olacağını sanmıyorum. Her zaman dediğimiz gibi maaşların arttırılmasından ziyade alın gücü arttırılmalı, her geçen zam ve fiyat artışlarına yetişmek mümkün değil fiyat takibi bile yapamıyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "November 08, 2023, 05:36:18 PM",
      "body": "Umarım çok yüksek olmaz yine geçen sene yaptıkları gibi devasa zam yaparlarsa bu ürün fiyatlarına çok daha büyük bir zam olarak yansıyacaktır. Enflasyonu kontrol altında tutmak imkansız ama ipin ucu kaçtı mı geri gelmiyor en azından hala yaşanabilir seviyede kalması lazım ülkenin. Gerçi yargı ile o kadar oynuyorlar ki böyle bir güvensizlik ortamında ekonomiden olumlu bir şey beklemek hayalcilik olur. Ülkede adalet yoksa bu ekonomiye doğrudan yansır, ne dış yatırımcı gelir ne içeride bir güven ortamı oluşabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "November 08, 2023, 07:32:08 PM",
      "body": "Quote from: ZekiBeyy on November 08, 2023, 05:35:44 PM17 bin gibi rakamlar konuşuluyor muhtemelen benzer rakamlarda bir asgari ücret belirlenir. 15 binden az olacağını sanmıyorum. Her zaman dediğimiz gibi maaşların arttırılmasından ziyade alın gücü arttırılmalı, her geçen zam ve fiyat artışlarına yetişmek mümkün değil fiyat takibi bile yapamıyoruz.Çözüm hep gözümüzün önünde hocam, dediğiniz gibi maaş artmasin piyasa stabil kalabilsin sadece o bile yeter ama direkt hayatımıza etki eden ne varsa fiyatı artarken maaşların yerinde kalması kötü sonuçlar doğurur, zaten yıl sonu enflasyonu ile ortaya çıkacak ve zam oranlarını belirleyecek rakam bir kazanım değil, 6 ay boyunca cebe giren miktardaki erimenin tolere edilmesi. Yani 6 ay eksiye düşüyoruz sonra ne kadarı doğru olduğu tartışılır hesaplarla düşen miktar yılbaşında telafi ediliyormuş gibi yapılıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "November 16, 2023, 05:01:49 PM",
      "body": "Quote from: totti67 on November 08, 2023, 07:32:08 PMQuote from: ZekiBeyy on November 08, 2023, 05:35:44 PM17 bin gibi rakamlar konuşuluyor muhtemelen benzer rakamlarda bir asgari ücret belirlenir. 15 binden az olacağını sanmıyorum. Her zaman dediğimiz gibi maaşların arttırılmasından ziyade alın gücü arttırılmalı, her geçen zam ve fiyat artışlarına yetişmek mümkün değil fiyat takibi bile yapamıyoruz.Çözüm hep gözümüzün önünde hocam, dediğiniz gibi maaş artmasin piyasa stabil kalabilsin sadece o bile yeter ama direkt hayatımıza etki eden ne varsa fiyatı artarken maaşların yerinde kalması kötü sonuçlar doğurur, zaten yıl sonu enflasyonu ile ortaya çıkacak ve zam oranlarını belirleyecek rakam bir kazanım değil, 6 ay boyunca cebe giren miktardaki erimenin tolere edilmesi. Yani 6 ay eksiye düşüyoruz sonra ne kadarı doğru olduğu tartışılır hesaplarla düşen miktar yılbaşında telafi ediliyormuş gibi yapılıyor.Kasım 15'ini geride bıraktık ve yılbaşına 1.5 ay kaldı. Yılsonuna yaklaştıkça düşünülen artış oranı konuşulmaya başlanır. Haber kanalları nabız yoklar. Henüz tam olarak o zamana girmedik belli ki yani çok fazla konuşulmuyor. Az da olsa konuşuluyor ama gündem hala asgari ücret değil. Aslında herkes ücretteki artışın enflasyon olarak döneceğini bildiği için ilk başlardaki gibi şu kadar artsın bu kadar artsın gibi konuşmuyor. Genel olarak söylenen şey yılbaşından sonra her şeye zam gelmesin bunun önüne geçilsin.Tolere edilmesi konusunda söylediklerinize katılıyorum. 6 ay zamlanıyor her şey ve maaşın sabit kalıyor o zamana kadar idare ediyorsun ve sonra zamlı maaş alıyorsun. Bu şekildeki ilerleyişin durması ve zam gelmemesi adına yapılan çalışmaların sonuç vermesi gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "halloweenn666",
      "created_time": "November 16, 2023, 05:03:37 PM",
      "body": "Şuan açlık sınırı 15 binde. Doğal olarak 17-20 bin civarında olmalı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "November 16, 2023, 06:46:56 PM",
      "body": "Quote from: flyingcarpet on November 16, 2023, 05:01:49 PMQuote from: totti67 on November 08, 2023, 07:32:08 PMQuote from: ZekiBeyy on November 08, 2023, 05:35:44 PM17 bin gibi rakamlar konuşuluyor muhtemelen benzer rakamlarda bir asgari ücret belirlenir. 15 binden az olacağını sanmıyorum. Her zaman dediğimiz gibi maaşların arttırılmasından ziyade alın gücü arttırılmalı, her geçen zam ve fiyat artışlarına yetişmek mümkün değil fiyat takibi bile yapamıyoruz.Çözüm hep gözümüzün önünde hocam, dediğiniz gibi maaş artmasin piyasa stabil kalabilsin sadece o bile yeter ama direkt hayatımıza etki eden ne varsa fiyatı artarken maaşların yerinde kalması kötü sonuçlar doğurur, zaten yıl sonu enflasyonu ile ortaya çıkacak ve zam oranlarını belirleyecek rakam bir kazanım değil, 6 ay boyunca cebe giren miktardaki erimenin tolere edilmesi. Yani 6 ay eksiye düşüyoruz sonra ne kadarı doğru olduğu tartışılır hesaplarla düşen miktar yılbaşında telafi ediliyormuş gibi yapılıyor.Kasım 15'ini geride bıraktık ve yılbaşına 1.5 ay kaldı. Yılsonuna yaklaştıkça düşünülen artış oranı konuşulmaya başlanır. Haber kanalları nabız yoklar. Henüz tam olarak o zamana girmedik belli ki yani çok fazla konuşulmuyor. Az da olsa konuşuluyor ama gündem hala asgari ücret değil. Aslında herkes ücretteki artışın enflasyon olarak döneceğini bildiği için ilk başlardaki gibi şu kadar artsın bu kadar artsın gibi konuşmuyor. Genel olarak söylenen şey yılbaşından sonra her şeye zam gelmesin bunun önüne geçilsin.Tolere edilmesi konusunda söylediklerinize katılıyorum. 6 ay zamlanıyor her şey ve maaşın sabit kalıyor o zamana kadar idare ediyorsun ve sonra zamlı maaş alıyorsun. Bu şekildeki ilerleyişin durması ve zam gelmemesi adına yapılan çalışmaların sonuç vermesi gerekiyor. Şu anda ülkede gündem bence bilerek başka yerlere çekiliyor, hali hazırda iki savaş varken, ayrıca önce yüksek yargı birbirine girdi, sonra Hrant Dink in katili tahliye edildi, dolayısı siyaset şu anda bu tarafta aşık atıyor daha çok, yıl sonu enflasyon oranı zaten daha önceden söylenen veya hedeflenene göre ayarlanacak, şu anda sadece dikkati başka yerlere çekip zaman kazanıyorlar bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "November 16, 2023, 09:05:43 PM",
      "body": "Merkez Bankası 2024 yılı için Dolar kuru beklenti anketi 38 TL civarı. 2023 yıl sonunda dolar kurunun 30 TL'yi göreceğini düşünüyorum. Kabaca hesaplarsak Türkiyede genellikle asgari ücret 380-450 Dolar arası bir seviyede gidip geliyor. 2024 yılı beklentisini baz alırlarsa ve artık asgari ücrete senede bir kez artış yapılacağını düşünürsek ortalama asgari ücretin 15.000 TL ile 16.000 TL arası bir yerde olacağını düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}