{
  "id": "topic_5464146",
  "title": "Jolbors",
  "author": "Jolbors",
  "created_time": "August 22, 2023, 11:28:45 AM",
  "content": "Dear Friends,We are thrilled to introduce you to a unique opportunity in the world of cryptocurrencies and financial markets – our captivating course, \"Master the Art of Crypto Trading.\" This course has been developed by experts with years of experience trading on crypto exchanges and achieving investment success. Our aim is to help you navigate the dynamic world of cryptocurrencies and teach you the fundamentals of successful trading.Our goal is to equip you with all the necessary tools to make informed decisions in the market. We offer not only theoretical knowledge but also practical skills that will help you achieve stability and success in crypto trading.To make our course even better and more accessible to all enthusiasts, we turn to you, our amazing audience. Your support can make a difference! We accept Bitcoin donations to invest in further research, develop interactive lessons, and create enhanced educational materials.Donating Bitcoin towards the development of our course is not just an investment in your own education but also a way to contribute to a shared endeavor. Every Satoshi you contribute will go towards improving the quality of our education and help us share knowledge with a larger audience.We believe in the power of education and are confident that knowledge is the key to success in the cryptocurrency market. Join us, invest in education, and let's grow and succeed together. We want to translate to 50 languages and make our education free for everybody.Thank you for your support!Education course link in russian language: https://www.udemy.com/course/akmcryptoBTC wallet: bc1q5gfv85s8lvaal9fkprgvkp59wsj53eg4865clw",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464146",
  "comments": [
    {
      "author": "coin-investor",
      "created_time": "August 23, 2023, 01:24:49 PM",
      "body": "Why the need to donate You're already selling this course, and you'll already be making a profit from the sales of your course, so why ask to translate to other languages your promotion to your course it's like asking to promote it for free without knowing if the course is really that good, I'll be more willing if it's a free course.If you think your course is that good then why not offer a vouch to seasoned traders here in Bitcointalk?I'm not going to get a vouch if you are going to offer one, but this is to prove that buyers here will get their money's worth Let seasoned traders check how good your course is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jolbors",
      "created_time": "August 23, 2023, 04:13:32 PM",
      "body": "Quote from: coin-investor on August 23, 2023, 01:24:49 PMWhy the need to donate You're already selling this course, and you'll already be making a profit from the sales of your course, so why ask to translate to other languages your promotion to your course it's like asking to promote it for free without knowing if the course is really that good, I'll be more willing if it's a free course.If you think your course is that good then why not offer a vouch to seasoned traders here in Bitcointalk?I'm not going to get a vouch if you are going to offer one, but this is to prove that buyers here will get their money's worth Let seasoned traders check how good your course is.Thank you for your qeustion. Here in Central Asia people are suffering from financial pyramids because of lack of true information. The sizes of cheaters are enormous. I want to translate with Neurodub and hire workers who will help me to enlight people all over the world. I already spent money for my courses. If I had an opportunity I could expand this course for free. I have already spent lots of money to create this content. If you want to double your community in BITCOINTALK or if you want to help people to understand cryptomarket you can donate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "August 24, 2023, 06:48:06 AM",
      "body": "Quote from: Jolbors on August 23, 2023, 04:13:32 PMI already spent money for my courses. If I had an opportunity I could expand this course for free. I have already spent lots of money to create this content. If you want to double your community in BITCOINTALK or if you want to help people to understand cryptomarket you can donate. I understand that it costs money to make great lessons, but it doesn't really paint a good picture for you if you're asking for donations like this. Maybe you can start a Patreon while you create content and offer exclusive benefits to your patrons. Alternatively, you can translate or use English as your lesson language instead. At the end of the day though, you should be aware that making educational content through Udemy needs time and resources if you want to make it profitable, such as spending some money on marketing through other means (creating YouTube videos, etc).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jolbors",
      "created_time": "August 24, 2023, 08:18:47 AM",
      "body": "Quote from: joniboini on August 24, 2023, 06:48:06 AMQuote from: Jolbors on August 23, 2023, 04:13:32 PMI already spent money for my courses. If I had an opportunity I could expand this course for free. I have already spent lots of money to create this content. If you want to double your community in BITCOINTALK or if you want to help people to understand cryptomarket you can donate. I understand that it costs money to make great lessons, but it doesn't really paint a good picture for you if you're asking for donations like this. Maybe you can start a Patreon while you create content and offer exclusive benefits to your patrons. Alternatively, you can translate or use English as your lesson language instead. At the end of the day though, you should be aware that making educational content through Udemy needs time and resources if you want to make it profitable, such as spending some money on marketing through other means (creating YouTube videos, etc).Thank You for ur advice. I dont really think that it will somehow show me from bad side. Everybody has a right to explain his point of view. I see my project development in this way . May be your variant is also good but I know that I will succeed too. Your variant is good for 90% of users. My variant is good for other 10% . Big whales want to expand market but its raising too slow because its very hard to teach ordinary man for cryptotrading. I have a formula that works. If they analyze my lessons they will be sure that it will work. Discussion with you actually, helping me to send them that information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 24, 2023, 11:02:24 AM",
      "body": "Quote from: Jolbors on August 23, 2023, 04:13:32 PMQuote from: coin-investor on August 23, 2023, 01:24:49 PMWhy the need to donate You're already selling this course, and you'll already be making a profit from the sales of your course, so why ask to translate to other languages your promotion to your course it's like asking to promote it for free without knowing if the course is really that good, I'll be more willing if it's a free course.If you think your course is that good then why not offer a vouch to seasoned traders here in Bitcointalk?I'm not going to get a vouch if you are going to offer one, but this is to prove that buyers here will get their money's worth Let seasoned traders check how good your course is.Thank you for your qeustion. Here in Central Asia people are suffering from financial pyramids because of lack of true information. The sizes of cheaters are enormous. I want to translate with Neurodub and hire workers who will help me to enlight people all over the world. I already spent money for my courses. If I had an opportunity I could expand this course for free. I have already spent lots of money to create this content. If you want to double your community in BITCOINTALK or if you want to help people to understand cryptomarket you can donate. OK, that makes sense. But there is only one problem:How are you going to get these videos in front of the right people?I'm not sure if Udemy is used so much in central asia countries, but as you probably know, Youtube is used practically everywhere in the world, so that will be a chance to put this in front of more eyeballs if you use both platforms - maybe you put basic stuff on the Youtube channel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 25, 2023, 05:01:24 AM",
      "body": "You should know that this is not a charitable forum, but rather an open forum for discussion, learning and exchange of experiences, so asking for donations, especially from newbie members, angers many here, so you should avoid asking for donations directly, otherwise you will lose the trust of members instead of gaining it.You have to gain the trust of the community first, for example, you can provide samples of your lessons for free or a small price, then if your lessons are liked, you can sell them at the appropriate price, or perhaps the members who liked your work will donate to you on their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "August 25, 2023, 05:33:22 AM",
      "body": "Many educaters claiming same and there are lot of free and paid courses but there is no big difference in both these two. Many time a high paid course include nothing except basics. So what do you think what is unique in your course and will it help traders because it's not necessary that one strategy worked with you will also be helpful for others too? I am not degrading you but asking only samples questions comes in my mind. Quote from: NotATether on August 24, 2023, 11:02:24 AMI'm not sure if Udemy is used so much in central asia countries, but as you probably know, Youtube is used practically everywhere in the world, so that will be a chance to put this in front of more eyeballs if you use both platforms - maybe you put basic stuff on the Youtube channel.Yes right, first time I hear about Udemy while Youtube is using by almost all users. It will be more profitable to upload all videos in youtube and also can use donation address in youtube video description. OP can. make some introduction video about his course which will help learner to start course if they believe that it will beneficial for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "August 29, 2023, 11:41:09 PM",
      "body": "Quote from: Jolbors on August 22, 2023, 11:28:45 AMDonating Bitcoin towards the development of our course is not just an investment in your own education but also a way to contribute to a shared endeavor. Every Satoshi you contribute will go towards improving the quality of our education and help us share knowledge with a larger audience.You can only ask for donations if you're giving it for free, Your course is very affordable why not concentrate on promoting and reaching out If you really want to help other people, you can ask those who take the course to spread the word or ask people to sponsor other people by selling discounts, or promoting the gift this course feature of Udemy. QuoteEducation course link in russian language: https://www.udemy.com/course/akmcryptoBased on the information on Udemy it is only available in the Russian language, Is it really is, then it's no use offering it here for those who want to take this course but do not know Russia, you'll have to promote it first in the Russian board and once you come out with an English version then you can post it in the service section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "September 01, 2023, 11:58:17 AM",
      "body": "Speaking frankly, the way the world is tilting, one needs to be her/his own employer and one of the best way to achieve that is getting involved in the blockchain technology and crypto space. Imagine having to work for yourself and earn without depending on someone else to pay you with certain conditions that might not be favorable.Trading, to me, seems like the way out but to achieve this you must invest heavily in learning and acquiring the skills relevant to that practice. If you achieve this, you can comfortably earn while you work for yourself, feel free to also share the knowledge or sponsor someone who wants to learn the same, you would have done more than enough for the society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "September 07, 2023, 04:59:51 PM",
      "body": "As much as I can be jovial and charitable. It is good to mention that we should realize that this forum is not a Fundraiser or so. It's an open forum for discussions and learning.Secondly, you're still a newbie here and you have little knowledge and credibility as far as Bitcointalk is concerned. So you need to firstly build that confidence between the members of the forum before bringing up such things.Lastly, the course is in Russia. Most of here can't completely understand the Russian language as well as the texts. Next time, make more options in times of languages so that it can be multi-lingual.Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "September 08, 2023, 01:04:37 PM",
      "body": "A wrong marketing formula can make a supposed genuine programme seem doubtful and misconstrued. The idea of integrating  donations from the public into a programme that's been paid for by interested persons that's wants to acquire the knowledge that it offers doesn't tally. The donations you're seeking for of it was to be used to sponsor maybe interested student's that don't have money to  partake in the programme that would have made a lot of sense but rather these donations are going into your purse to be used to expand your business. If you're not running a charitable business you don't have right to seek for donations except otherwise.What I had also expected is you giving a preamble of the quality of the crypto knowledge you have packaged for your potential students, as that might trigger an interest to forum members that will be needing it especially those of the Russian language speaking. No one will be ready to pay for the quality of a product or service he has no clue of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jolbors",
      "created_time": "November 24, 2024, 12:45:40 PM",
      "body": "Quote from: Jolbors on August 22, 2023, 11:28:45 AMDear Friends,We are thrilled to introduce you to a unique opportunity in the world of cryptocurrencies and financial markets – our captivating course, \"Master the Art of Crypto Trading.\" This course has been developed by experts with years of experience trading on crypto exchanges and achieving investment success. Our aim is to help you navigate the dynamic world of cryptocurrencies and teach you the fundamentals of successful trading.Our goal is to equip you with all the necessary tools to make informed decisions in the market. We offer not only theoretical knowledge but also practical skills that will help you achieve stability and success in crypto trading.To make our course even better and more accessible to all enthusiasts, we turn to you, our amazing audience. Your support can make a difference! We accept Bitcoin donations to invest in further research, develop interactive lessons, and create enhanced educational materials.Donating Bitcoin towards the development of our course is not just an investment in your own education but also a way to contribute to a shared endeavor. Every Satoshi you contribute will go towards improving the quality of our education and help us share knowledge with a larger audience.We believe in the power of education and are confident that knowledge is the key to success in the cryptocurrency market. Join us, invest in education, and let's grow and succeed together. We want to translate to 50 languages and make our education free for everybody.Thank you for your support!Education course link in russian language: https://www.udemy.com/course/akmcryptoBTC wallet: bc1q5gfv85s8lvaal9fkprgvkp59wsj53eg4865clw\"I had a referral program with the Bitget exchange. As soon as I was politically targeted by the authorities in Kyrgyzstan and falsely accused of extorting the president—despite the fact that they knew my daughter was battling cancer and I was in dire need of funds—they terminated our agreement. They took the commissions from my traders—around 100 of them—totaling about $30,000 USD. They refuse to pay me the money I rightfully earned. According to the evidence in my criminal case, it’s clear I was set up by Kyrgyzstan’s intelligence services due to my opposition activities, and I will be acquitted. Despite this, I’ve reached out to the Bitget team, and they continue to ignore me, even though my students from Udemy and other platforms are still joining the exchange. Colleagues, do you think this is how partners should treat each other? I’m sure this is cheating.\"Account choco.kg@gmail.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}