{
  "id": "topic_5467780",
  "title": "Trawda",
  "author": "Trawda",
  "created_time": "September 23, 2023, 05:21:07 AM",
  "content": "مرحبا إخوانيكثرت في الفترة الماضية الأخبار والتكهنات حول انقطاع الانترنت عن العالم كله لفترة عدة أشهر بحلول 10 تشرين الأول/أكتوبر 2023 كما يزعم البعض عبر وسائل التواصل والذين يأخذون كلامهم عن العرافين مثل العرافة اللبنانية ليلى عبد اللطيف وحتى ومما زاد شدة هذه الشائعات تحذيرات أطلقتها وكالة ناسا من عاصفة شمسية محتملة، ما يعني أن هذا الانقطاع قد يكون بسبب تأثير الرياح الشمسية على كوكب الأرض. هذا فيديو يناقش هذه المسألة:  انقطاع الإنترنت عن العالم .. جدل لا يتوقف هناك فيديو آخر يناقش المسألة ويتكلم عن دور إيلون ماسك في القصة وأنه مؤمن بهذه التنبؤات ولذلك فهو أطلق سلسلة أقمار ستارلينك حول العالم لتزويد الانترنت للعالم في حال انقطاعه وبالطبع هو يفكر فيه كمشروع تجاري ناحج سوف يكسب منه المليارات:  نكشف مخطـ ط انقطاع الانترنت و الكهرباء عن العالم و دور ايلون ماسك العرافة البلغارية الشهيرة جدا كانت قد تنبأت بأمور كثيرة ستحدث في عام 2023 والأهم فيها عاصفة شمسية ستضرب الأرض سينتج عن هذه العاصفة انقطاع في الانترنت والكهرباء ووسائل الاتصال وهذه بعض تنبؤاتها لعام 2023: Quoteما هي توقعات العرافة العمياء 2023اشتهرت العرافة البلغارية ” بابا فانجا” بتوقعاتها وتنبؤاتها التي أثارت الخوف والرعب في العالم، خاصة بعد صدق نسبة كبيرة من هذه التوقعات والتي مثلت مفاجئة لدى الكثيرين والذين أصبحوا يتبعون باهتمام توقعات العرافة العمياء للعام 2023، والذي تنبأت له بأحداث مُخيفة كالتالي:دولة كبرى تستخدم أسلحة بيولوجية.موت آلاف الأشخاص بفعل تجارب على الأسلحة البيولوجية.عاصفة شمسية ستضرب الأرض.سينتج عن هذه العاصفة انقطاع في الانترنت والكهرباء ووسائل الاتصال.غطاء من الظلام سيجل على الأرض يتخلله هجوم فضائي أجنبي على الأرض.انفجار إحدى محطات الطاقة النووية في قارة آسيا.تحكم الأطباء ولعلماء بعمليات الولادة والتي ستكون في المختبرات.https://s.i-trends.net/ما-هي-توقعات-العرافة-العمياء/طبعا أنا مؤمن أنه لا أحد يمكنه أن يطلع على الغيب سوى الله سبحانه وتعالى أو من اختاره من رسول وأنه كذب المنجمون ولو صدقوا، لكن بغض النظر في حال حدوث هذه التوقعات سواء هذا العام أو أي وقت آخر وانقطع الانترنت عن العالم  كله يدور في ذهني عدة تساؤولات: 1 -  ماذا سيكون مصير البيتكوين والبلوكتشاين بشكل عام على المدى القريب والبعيد؟ 2 - ماهو السيناريو المتوقع لحظة انقطاع الانترنت وبعد عودته بعد شهر أو أشهر؟ يعني ماذا سيحدث للبلوكتشاين لحظة انقطاع الانترنت أو الكهرباء عن العالم كله؟ كما نعلم سيكون هناك معاملات لم يتم تأكيدها بعد ، ماذا سيكون مصير هذه المعاملات؟ هل سيتم تأكيدها فيما بعد أم أنه سيتم إلغاؤها واعتبارها معاملات باطلة؟ 3 - ماذا سيحدث بعد عودة الأنترنت هل سيكون هناك تغييرات على البلوكتشاين ؟ أم سيتم استئناف العمل كأن شيئا لم يكن ولن يكون هناك أي تغيير؟ 4 - هل ستتأثر العملات المخزنة في المحافظ أو تلك التي في المنصات؟ 5 - هل سيتأثر التعدين؟ لا أقصد من الناحية المالية بالطبع لكن أقصد من الناحية الفنية؟ هل سيتابعون عملهم بعد عودة الانترنت دون أي تغيير أم أنهم سيفقدون عملهم السابق ويبدأون من الصفر. أسئلة كثيرة تدور في ذهني صراحة وأتمنى أن أعرف الإجابة.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467780",
  "comments": [
    {
      "author": "Kavelj22",
      "created_time": "September 23, 2023, 12:02:44 PM",
      "body": "Quote from: Trawda on September 23, 2023, 05:21:07 AM1 -  ماذا سيكون مصير البيتكوين والبلوكتشاين بشكل عام على المدى القريب والبعيد؟ 2 - ماهو السيناريو المتوقع لحظة انقطاع الانترنت وبعد عودته بعد شهر أو أشهر؟ يعني ماذا سيحدث للبلوكتشاين لحظة انقطاع الانترنت أو الكهرباء عن العالم كله؟ كما نعلم سيكون هناك معاملات لم يتم تأكيدها بعد ، ماذا سيكون مصير هذه المعاملات؟ هل سيتم تأكيدها فيما بعد أم أنه سيتم إلغاؤها واعتبارها معاملات باطلة؟ 3 - ماذا سيحدث بعد عودة الأنترنت هل سيكون هناك تغييرات على البلوكتشاين ؟ أم سيتم استئناف العمل كأن شيئا لم يكن ولن يكون هناك أي تغيير؟ 4 - هل ستتأثر العملات المخزنة في المحافظ أو تلك التي في المنصات؟ 5 - هل سيتأثر التعدين؟ لا أقصد من الناحية المالية بالطبع لكن أقصد من الناحية الفنية؟ هل سيتابعون عملهم بعد عودة الانترنت دون أي تغيير أم أنهم سيفقدون عملهم السابق ويبدأون من الصفر. 1- لا أعرف ما الذي تقصده بمصير البيتكوين و البلوكشين لأنه لو صدقت نبوؤال اولئك المنجمين بعد ان تنقطع الكهراباء عن الأرض و ينفجر مفاعل نووي في اسيا و يهاجمنا الفضائيون، لأنني أعتقد أن مصير البشرية سيصبح السؤال الأهم و لن يفكر أحد في البلوكشاين. عموما يا ريت المنجمين يستطيعوا الاجابة عن سؤالك حول مصير البلوكشين و لكن أشك في ذلك لأنهم لم يسمعوا بها أصلا و كل اهتمامهم حول الفضائيين ههههههه. عذرا لكن هذه التنجيمات مضجكة فعلا و مسلية  2- لو انقطعت الكهرباء عن الكوكب فان هذا يعني انقطاع الانترنت أيضا. لا تخف على البلوكشين لأن هناك نسخا عديدة منها مسجلة على خوادم و يمكن اعادة المزامنة synchronisation بسهولة بعد عودة الكهرباء و لو بعد سنة. بالنسبة للمعاملات التي لن يتم تأكيدها فانه من السهل الغاؤها و بأقصى الحالات لن تضيع الأرصدة على تلك المعاملات. يكفي ان تطلع على بروتوكول البيتكوين (معاملات، تعدين، عناوين...) لتدرك أنه لا خطر في ذلك.3- لن يحصل شيء و يمكن مواصلة العمل بالبلوكشين و لكن يجب ان يشمل سؤالك بقية جوانب الحياة الانسانية التي ستتأثر بفعل الانقطاع.4- العملات على المحفظات لن يمسها شيء و يمكنك اليوم قطع الانترنت الى مالانهاية عن الجهاز الذي عليه محفظتك و لن يحصل شيء. هذا يشمل ايضا محفظات المنصات التي لن تتأثر بالانقطاع مثل غيرها من المحفظات و لكن لا يمكن الاقرار بما يمكن ان يقرره القائمون على تلك المنصات و جميع الاحتمالات واردة في هذه الحالة.5- يمكن مواصلة التعدين لأن هناك نسخا من البلوكشين عديدة يتم حفظها على خوادم و على اساسها يمكن حفظ البلوكشين من هذه الاحتمالات الغريبة.أخيرا أريد طمأنتك أن الكهرباء لن تنقطع عن العالم حتى لو ضرب نيزك الأرض و أن العلم تقدم و أصبح قادرا على مواجهة هذه الاحتمالات. دعك من حكايات المنجمين و لديك هيئات علمية و مراكز بحث علمي يمكنها مدك بالمعلومات التي تحتاجها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trawda",
      "created_time": "September 24, 2023, 02:27:09 AM",
      "body": "Quote from: Kavelj22 on September 23, 2023, 12:02:44 PMأخيرا أريد طمأنتك أن الكهرباء لن تنقطع عن العالم حتى لو ضرب نيزك الأرض و أن العلم تقدم و أصبح قادرا على مواجهة هذه الاحتمالات. دعك من حكايات المنجمين و لديك هيئات علمية و مراكز بحث علمي يمكنها مدك بالمعلومات التي تحتاجها.أهنئك على تفاؤلك وثقتك بالعلم، أوافقك الرأي أن الكهرباء من الصعب أن تنقطع عن الأرض لأنه حتى لو تعطلت شبكات الكهرباء هناك بديل عن طريق الطاقة الشمسية أو حتى المولدات العادية، لكن بالنسبة للانترنت لا تنسى أن الأنترنت مركزي وهناك عدة سيرفرات رئيسية في العالم فقط وهذه ممكن أن تتعرض للتعطل لسبب أو لآخر (أو حتى بشكل مقصود). لست أنا الوحيد الذي يناقش القضية، رأيت فيديوهات لمحللين اقتصاديين وتقنيين مهمين يناقشون هذا الاحتمال وتأثيراته المحتملة على كافة مناحي الحياة الاقتصادية والاجتماعية وخاصة أن كل شيء بحياتنا أصبح مرتبط بالانترنت. بالنهاية أعود وأؤكد أنني لست ممن يؤمنون بالتنجيم، لكن هذا احتمال وارد ولو بنسبة 1 بالمليون.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 24, 2023, 04:44:47 PM",
      "body": "Quote from: Trawda on September 24, 2023, 02:27:09 AMQuote from: Kavelj22 on September 23, 2023, 12:02:44 PMأخيرا أريد طمأنتك أن الكهرباء لن تنقطع عن العالم حتى لو ضرب نيزك الأرض و أن العلم تقدم و أصبح قادرا على مواجهة هذه الاحتمالات. دعك من حكايات المنجمين و لديك هيئات علمية و مراكز بحث علمي يمكنها مدك بالمعلومات التي تحتاجها.أهنئك على تفاؤلك وثقتك بالعلم، أوافقك الرأي أن الكهرباء من الصعب أن تنقطع عن الأرض لأنه حتى لو تعطلت شبكات الكهرباء هناك بديل عن طريق الطاقة الشمسية أو حتى المولدات العادية، لكن بالنسبة للانترنت لا تنسى أن الأنترنت مركزي وهناك عدة سيرفرات رئيسية في العالم فقط وهذه ممكن أن تتعرض للتعطل لسبب أو لآخر (أو حتى بشكل مقصود). و لكن ما الذي سيستفيده أي شخص او جهة ينوي قطع الانترنت عن العالم بالرغم من ان هذا خيالي قليلا لان كابلات و سيرفيرات الانترنت ليست بيد جهة واحدة و لا يمكن لطرف واحد ان يقرر مصير الانترنت في العالم خصوصا في عالمنا اليوم. الذي سيقرر قطع الانترنت عن العالم سيكون هو أول المتضررين لأنه لا فوائد من هذا على الاطلاق. هذا يشبه محاولات اختراق البلوكشين عبر هجوم 51% و الذي لو افترضنا ان جهة تملك اكثر من نصف الهاش يمكنها التلاعب بالبيانات على البلوكشين و لكن بالتفكير عقليا فان اي ارباح من هذه العملية لو نجحت ستكون اقل بكثير من تكلفة القيام بها و اذا كان يريد ان يربح بيتكوين من خلال هذا فهو بعمله سيفقد البيتكوين اي قيمة له.بالنسبة لمصير العالم لو انقطعت الانترنت فبالتأكيد ستكون هناك اضرار مباشرة بما ان جهات عديدة اصبحت تعتمد على الانترنت و هناك اقتصاديات كاملة تقوم على هذه التكنولوجيا و لكن بالنهاية لن يحصل شيء كثير لأن الانترنت ليست عنصرا حيويا للحياة على سطح الارض و سنعود خطوة للوراء الى مراحل الهواتف النقالة العادية و التلفزيون و الحواسيب الجامدة التي لا تتصل ببعضها البعض.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 26, 2023, 03:35:33 AM",
      "body": "Quote from: Kavelj22 on September 24, 2023, 04:44:47 PMو لكن ما الذي سيستفيده أي شخص او جهة ينوي قطع الانترنت عن العالم بالرغم من ان هذا خيالي قليلا لان كابلات و سيرفيرات الانترنت ليست بيد جهة واحدة و لا يمكن لطرف واحد ان يقرر مصير الانترنت في العالم خصوصا في عالمنا اليوم. الذي سيقرر قطع الانترنت عن العالم سيكون هو أول المتضررين لأنه لا فوائد من هذا على الاطلاق. هذا يشبه محاولات اختراق البلوكشين عبر هجوم 51% و الذي لو افترضنا ان جهة تملك اكثر من نصف الهاش يمكنها التلاعب بالبيانات على البلوكشين و لكن بالتفكير عقليا فان اي ارباح من هذه العملية لو نجحت ستكون اقل بكثير من تكلفة القيام بها و اذا كان يريد ان يربح بيتكوين من خلال هذا فهو بعمله سيفقد البيتكوين اي قيمة له.كلامك صحيح أخي بالطبع ليس هناك لأحد مصلحة بقطع الانترنت عن العالم. لكن حسب ما فهمت من الفيديو الثاني هناك تلميح أن إيلون ماسك ربما يكون له دور في القصة بحيث يتم ضرب الانترنت الموجود حاليا ولايبقى للعالم خيار سوى استخدام شركة ستارلينك الفضائية التابعة لإيلون ماسك. طبعا هذا السيناريو مجنون ولكن الجنون ليس غريب على رجل كإيلون ماسك أنا لا أقول أن القصة حقيقية وأن هناك مخطط بالفعل لكن لا أستغرب أن تكون خطرت ببال إيلون ماسك، لأن لدينا في سوريا قصة مشابهة يمكن أن لا تصدقها، هنا في سوريا يحدث العجب ، مثلا تخيل أن بعض التجار الكبار قاموا باستيراد البطاريات وكل المواد الخاصة بالطاقة الشمسية ومولدات الطاقة وكل ما يتعلق بتوليد الكهرباء في حال انقطاع الشبكة العامة، ولتصريف منتجاتهم قاموا بالاتفاق مع  وزير الكهرباء وبعض المسؤولين الكبار لاستمرار قطع الكهرباء العامة، حيث تصل معدل انقطاع الكهرباء عندنا إلى 20 ساعة في اليوم، هل تصدق هذا، نعم إنها حقيقة نعيشها. حتى أن هناك روايات أن محطات الكهرباء التي تم تفجيرها وإخراجهم عن الخدمة بواسطة الجماعات المسلحة المتشددة كان بالاتفاق مع هؤلاء الوزراء والتجار لتبرير قطع الكهرباء كل هذه المدة. أعرف أن هذه الأمور صعب تصديقها لكنها تحدث للأسف.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "September 26, 2023, 10:10:28 PM",
      "body": "Quote from: yhiaali3 on September 26, 2023, 03:35:33 AMQuote from: Kavelj22 on September 24, 2023, 04:44:47 PMو لكن ما الذي سيستفيده أي شخص او جهة ينوي قطع الانترنت عن العالم بالرغم من ان هذا خيالي قليلا لان كابلات و سيرفيرات الانترنت ليست بيد جهة واحدة و لا يمكن لطرف واحد ان يقرر مصير الانترنت في العالم خصوصا في عالمنا اليوم. الذي سيقرر قطع الانترنت عن العالم سيكون هو أول المتضررين لأنه لا فوائد من هذا على الاطلاق. هذا يشبه محاولات اختراق البلوكشين عبر هجوم 51% و الذي لو افترضنا ان جهة تملك اكثر من نصف الهاش يمكنها التلاعب بالبيانات على البلوكشين و لكن بالتفكير عقليا فان اي ارباح من هذه العملية لو نجحت ستكون اقل بكثير من تكلفة القيام بها و اذا كان يريد ان يربح بيتكوين من خلال هذا فهو بعمله سيفقد البيتكوين اي قيمة له.كلامك صحيح أخي بالطبع ليس هناك لأحد مصلحة بقطع الانترنت عن العالم. لكن حسب ما فهمت من الفيديو الثاني هناك تلميح أن إيلون ماسك ربما يكون له دور في القصة بحيث يتم ضرب الانترنت الموجود حاليا ولايبقى للعالم خيار سوى استخدام شركة ستارلينك الفضائية التابعة لإيلون ماسك. طبعا هذا السيناريو مجنون ولكن الجنون ليس غريب على رجل كإيلون ماسك أنا لا أقول أن القصة حقيقية وأن هناك مخطط بالفعل لكن لا أستغرب أن تكون خطرت ببال إيلون ماسك، لأن لدينا في سوريا قصة مشابهة يمكن أن لا تصدقها، هنا في سوريا يحدث العجب ، مثلا تخيل أن بعض التجار الكبار قاموا باستيراد البطاريات وكل المواد الخاصة بالطاقة الشمسية ومولدات الطاقة وكل ما يتعلق بتوليد الكهرباء في حال انقطاع الشبكة العامة، ولتصريف منتجاتهم قاموا بالاتفاق مع  وزير الكهرباء وبعض المسؤولين الكبار لاستمرار قطع الكهرباء العامة، حيث تصل معدل انقطاع الكهرباء عندنا إلى 20 ساعة في اليوم، هل تصدق هذا، نعم إنها حقيقة نعيشها. حتى أن هناك روايات أن محطات الكهرباء التي تم تفجيرها وإخراجهم عن الخدمة بواسطة الجماعات المسلحة المتشددة كان بالاتفاق مع هؤلاء الوزراء والتجار لتبرير قطع الكهرباء كل هذه المدة. أعرف أن هذه الأمور صعب تصديقها لكنها تحدث للأسف. هناك جانبان في حديثك:- سوريا: حين تصل مؤشرات الفساد في الدولة الى مستويات قياسية فهذا يعني ان كل شيء جائز. ما الذي سيمنع الاشخاص الذين يقبلون تفجير القنابل في سوق شعبي الى التردد في التضحية بالحاجيات الاساسية لمن مازالوا أحياء. لقد سمعت فضائع في سوريا من هذا القبيل ايضا خصوصا اثناء الصراعات و القصف اذ ان هناك مقاولي بناء و شركات اعادة اعمار ستستفيد من عقود اعادة التشييد فيما بعد و كذلك ما يسمى بمنظمات الاغاثة التي تستفيد من تشريد الناس لتحصل عي على ميزانيات الدعم. يعني ليس اكثر من ان تجد ملفات فساد في منظمات انسانية يفترض ان اولويتها انقاذ الناس. سوريا و اي منطقة حروب تخضع لنفس منطق الفساد و هذه هي الحرب للأسف.- الون ماسك: انا متأكد أن الون ماسك ليس به ليس لديه نوايا خبيثة الى هذه الدرجة و لا يمكن ان يصل الى هذه الدرجة نظرا للطبيعة الحيوية للانترنت في عالمنا اليوم. حتى مشروع الون ماسك للانترنت لا يمكن ان يقدم خدماته حاليا للجميع نظرا لعدة اعتبارات من اهمها ان ماسك يحتاج الى الانترنت في وقتنا الحالي و ان مشروعه لايزال في مرحلة مبكرة لم تصل بعد الى اتباع سياسات احتكارية و اخيرا لان هناك شركات عملاقة في مجال الانترنت الارضي لن تسكت امام هذه الخطط التي ستهدد مصالحها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 27, 2023, 03:22:02 AM",
      "body": "Quote from: Kavelj22 on September 26, 2023, 10:10:28 PM حتى مشروع الون ماسك للانترنت لا يمكن ان يقدم خدماته حاليا للجميع نظرا لعدة اعتبارات من اهمها ان ماسك يحتاج الى الانترنت في وقتنا الحالي و ان مشروعه لايزال في مرحلة مبكرة لم تصل بعد الى اتباع سياسات احتكارية و اخيرا لان هناك شركات عملاقة في مجال الانترنت الارضي لن تسكت امام هذه الخطط التي ستهدد مصالحها.كلامك منطقي أخي، فكرت في الأمر ووجدت أنه مستحيل تقنيا تقريبا، لأن إيلون ماسك ليس لديه سيرفرات انترنت مركزية خاصة به لتوزيع الانترنت على العالم، ما تقوم به شركته الفضائية أنها تأخذ الأنترنت من السيرفرات الرئيسية وتقوم بإعادة بثه إلى المشتركين في مناطق أخرى عن طريق الأقمار الصناعية. في حال حدوث هذا السيناريو الخرافي سوف تتوقف السيرفرات الرئيسية للانترنت وبالتالي من أين سيحصل إيلون ماسك على الأنترنت ليقوم بإعادة بثه عن طريق أقماره الصناعية. أعتقد أنها شطحات خيالية غير ممكنة الحدوث على أرض الواقع، كما تفضلت أخي هذه الأمور ممكن أن تحدث في بلد صغير ومدمر بالحروب ومليء بالفساد مثل سوريا أما أن تحدث على مستوى العالم كله فأنا أستبعد مثل هذا السيناريو.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "September 27, 2023, 11:54:06 PM",
      "body": "بالفعل، القول ان الخدمة التي يقدمها الون ماسك يمكن أن تكون الحل و البديل في حال توقف شبكة الإنترنت فيه نوع من المبالغة و حتى المغالطة المقصودة بهدف الترويج لهذه الخدمة. و هذا النوع من المغالطات هو نقطة قوة الون ماسك.النقاش في هذا الموضوع ليس بالأمر الجديد كما يتصور البعض فيمكن العودة إلى المواضيع في القسم الانجليزي الرئيسي و هو قسم النقاشات العامة و ستجد العديد و العديد من هذه المواضيع نشرت منذ سنوات.اغلب الإجابات كانت انه في حال حدوث كارثة عالمية لا قدر الله فان البيتكوين و شبكة البلوكتشاين لن تكون من الأولويات التي سيركز عليها العالم.لكن لو حدث امر مماثل فلا اعتقد انه سيؤثر كثيرا على الشبكة و ستعود لعملها بشكل طبيعي بعد أن ترجع شبكة الانترنات.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}