{
  "id": "topic_5452099",
  "title": "BBitcoin92",
  "author": "BBitcoin92",
  "created_time": "May 09, 2023, 01:46:47 PM",
  "content": "Hi AllI sent some BTC to Local Coin Swap on Saturday 06/05/2023 (UK) and did not check mempool and selected my usual low fee as i'm in no rush.  -Fee   4,251 sat£0.94-Fee rate   25.7 sat/vBAs i can see from reading on here it is very congested and its not processing.I then went to 'bump it'/increase the fee using Electrum, i connect fine but to load my transaction history i have to select the middle option/path -p2sh-segwit (p2wkph-p2sh)The bottom option that it recommends in the guide does not load any transaction history at all?GUIDE - https://support.ledger.com/hc/ru/articles/6183300395037-How-to-speed-up-a-stuck-Bitcoin-BTC-transaction-with-Electrum?docs=trueWhen all my transactions are loaded it does not show the transaction that is stuck? Also the odd thing is that when i sent it on the Saturday 6th it did show in Local Coin Swap but now it is has gone/removed.When you try to look at your transaction history on LCS it only shows your trades and not what goes in/out of your wallet!Anyone got any ideas on what is going on here and why the transaction does not show on Electrum but does on my ledger?What are my next steps, what are my options if any? It makes no sense that its not showing on Electrum??Here it is - https://mempool.space/tx/4d915efe1c467c2611896c2314c91f9b5283a32bb69fb399d6fb7f152990421eAnyone help?Cheers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452099",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "May 09, 2023, 01:50:33 PM",
      "body": "I'm not sure about the exchange, but for Electrum does your balance reflect the transaction you did or not? Make sure you're propertly connected to Electrum servers. The path you chose should be the correct one since your address starts with 3.I submitted your transaction to ViaBTC: https://www.viabtc.com/tools/txaccelerator/So that if you don't manage to bump the fee, you should expect it to get confirmed soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 09, 2023, 01:53:37 PMLast edit: May 14, 2023, 04:58:14 PM by Charles-Tim",
      "body": "You can use https://www.viabtc.com/tools/txaccelerator/ free accelerator as OmegaStarScream commented already.When ever ViaBTC mine a block next, your transaction will be confirmed because your transaction is included in ViaBTC candidate block.If your transaction is less than 500 sat in size and the fee is not more less than 10 sat/byte (around 16 sat/vbyte when sending from segwit to segwit), you can use ViaBTC free accelerator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BBitcoin92",
      "created_time": "May 09, 2023, 03:42:02 PMLast edit: May 09, 2023, 03:58:09 PM by BBitcoin92",
      "body": "Thanks for that, much appreciated.All transactions show on Electrum and match my ledger transactions perfectly except for the one i have linked? It is simply not showing??I recall the 'free' bump or 'accelerators' from years ago but never had any joy with them tbh.Is it worth checking again on Electrum, as above i only put in a fee of 25.7 sat/vB / £0.93.I've always just kept it under £1 when sending and never had any problems, i have never seen it this congested before! It's becoming unusable, surely something has to be done?This is another one, is it worth me broadcasting on there as well?https://bitaccelerate.com/ThanksUPDATE -It is showing again on LCS but it has not been confirmed, how can that be? It done this when i first sent it Saturday but after a few hours the balance returns back as showing not received...There's no way of tracking BTC in and out on the platform, all you have is a balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 09, 2023, 04:03:43 PM",
      "body": "Quote from: BBitcoin92 on May 09, 2023, 03:42:02 PMIs it worth checking again on Electrum, as above i only put in a fee of 25.7 sat/vB / £0.93.Just be calm and let ViaBTC mine a block and your transaction will be confirmed.You can check the mining pool that mine the recent blocks on mempool.space: https://mempool.space/blocks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "May 09, 2023, 04:07:31 PM",
      "body": "Quote from: BBitcoin92 on May 09, 2023, 03:42:02 PM-snip-Have you rebroadcasted your transaction with the tool you shared? I'm just guessing here but maybe that's why LCS can see it again.As mentioned above, ViaBTC will make sure to include your transaction in their next mined block. Bitaccelerate is not as efficent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BBitcoin92",
      "created_time": "May 09, 2023, 04:42:49 PM",
      "body": "Thanks, i've also set a countdown timer so i can broadcast it every hour.Also it now shows on Electrum and gives me option to increase the fee, the lowest i can set it is 250 sat/byte !!I will wait i think as i detest paying high fees and i am in no rush whatsoever.You all have been a great help, i'll update when confirmed.I'm off to read with why its so crowded....Cheers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "May 09, 2023, 06:20:38 PM",
      "body": "Quote from: OmegaStarScream on May 09, 2023, 04:07:31 PMQuote from: BBitcoin92 on May 09, 2023, 03:42:02 PM-snip-Have you rebroadcasted your transaction with the tool you shared? I'm just guessing here but maybe that's why LCS can see it again.As mentioned above, ViaBTC will make sure to include your transaction in their next mined block. Bitaccelerate is not as efficent.Just curious about a few things here:How does one include the transaction in the block manually or submit a request to a specific miner to mine my transaction and confirm it? Is there any simple explanation for this in nontechnical language or maybe with a real-life example of Gary and Bob? I have seen that there were threads in the services section where individuals used to ask for their transaction hash and they were able to accelerate the related transaction just like that. I believe this is done in the hope that they are getting associated spent fees in their pockets. Am I correct in this theory here? What happens if I submit it in 3-4 accelerators?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 09, 2023, 06:36:12 PM",
      "body": "Quote from: so98nn on May 09, 2023, 06:20:38 PMHow does one include the transaction in the block manually or submit a request to a specific miner to mine my transaction and confirm it?Anyone that control mining pool can include the transaction that they like and when the mining pool mine a block, the transactions the mining pool included into their candidate block will have confirmation.Your txid is enough. Use the txid of your unconfirmed transaction on a free accelerator like: https://www.viabtc.com/tools/txaccelerator/. Quote from: so98nn on May 09, 2023, 06:20:38 PMWhat happens if I submit it in 3-4 accelerators? Most accelerators are fake because they are not accelerating anything. Consider mining pool hashrates in relation to others to know how fast the mining pool can mine a block. But if they they (I mean the mining pool) include the transaction to be accelerated, your transaction will be mined at anytime that any of the mining pool mine a block",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BBitcoin92",
      "created_time": "May 09, 2023, 07:28:18 PM",
      "body": "@Charles-Tim Great description and as you say most of these ''accelerators' don't achieve anything.I'm still waiting on my tx, if there a better way to monitor it once its been inputted to ViaBTC?The increased fee's are ridiculous, over £9 for the smallest increase.How long will it take approx?Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "May 09, 2023, 08:41:11 PMLast edit: May 09, 2023, 09:12:23 PM by OmegaStarScream",
      "body": "Quote from: BBitcoin92 on May 09, 2023, 07:28:18 PM@Charles-Tim Great description and as you say most of these ''accelerators' don't achieve anything.I'm still waiting on my tx, if there a better way to monitor it once its been inputted to ViaBTC?The increased fee's are ridiculous, over £9 for the smallest increase.How long will it take approx?ThanksI don't see any ViaBTC blocks here[1], so I would imagine it's very soon.You can use Blocknomics wallet watcher if you want to monitor your address[2]. AFAIK, they only send notifications (through email) when a transaction is confirmed, and not as soon as it happens so it should do the trick.EDIT: Your transaction has been confirmed.[1] https://www.blockchain.com/explorer/blocks/btc[2] https://www.blockonomics.co/blockonomics#/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BBitcoin92",
      "created_time": "May 09, 2023, 10:15:00 PM",
      "body": "Thanks, yep confirmed and saved myself some money.Great advice and help as usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 09, 2023, 10:17:50 PM",
      "body": "Quote from: BBitcoin92 on May 09, 2023, 10:15:00 PMThanks, yep confirmed and saved myself some money.Great advice and help as usual.  ViaBTC mined block 788978 which your transaction would have been included. It was the last eight block mined as I posted this after block 788986 has been mined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "May 11, 2023, 03:16:03 PM",
      "body": "Quote from: Charles-Tim on May 09, 2023, 06:36:12 PMQuote from: so98nn on May 09, 2023, 06:20:38 PMHow does one include the transaction in the block manually or submit a request to a specific miner to mine my transaction and confirm it?Anyone that control mining pool can include the transaction that they like and when the mining pool mine a block, the transactions the mining pool included into their candidate block will have confirmation.Your txid is enough. Use the txid of your unconfirmed transaction on a free accelerator like: https://www.viabtc.com/tools/txaccelerator/. Quote from: so98nn on May 09, 2023, 06:20:38 PMWhat happens if I submit it in 3-4 accelerators? Most accelerators are fake because they are not accelerating anything. Consider mining pool hashrates in relation to others to know how fast the mining pool can mine a block. But if they they (I mean the mining pool) include the transaction to be accelerated, your transaction will be mined at anytime that any of the mining pool mine a blockThat is an interesting way to accelerate the transaction, and that is what I wanted to include in one of my ideas here: Way to Send Bitcoin without Internet [Theoretical Idea]All we want to submit a txid to the miner and they can do the rest. This post gave me little hope for the topic that I posted above. Since we are already accelerating the transactions by manually submitting our txid to the miners then sending BTC offline is no big deal, via SMS.About the multiple accelerator submission: So does it mean I can still send txid to multiplier miners and whoever includes it to the immediate block will be able to register it as confirmed while others will just give me more confirmation by increasing the confidence level?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}