{
  "id": "topic_5411714",
  "title": "eightdots",
  "author": "eightdots",
  "created_time": "August 30, 2022, 10:42:17 AM",
  "content": "Thodex'in firari CEO'su Fatih Özer, Arnavutluk polisinin yaptığı operasyon sonucu Vlora şehrinde yakalandı.İçişleri Bakanlığı'ndan yapılan açıklamada, \"Arnavutluk Cumhuriyeti İçişleri Bakanı Bledar Çuçi bugün sabah saatlerinde İçişleri Bakanı Süleyman Soylu’ya Kırmızı bültenle aranan Thodex’in kurucusu firari Faruk Fatih Özer Arnavutluk’ta Vlora’da yakalandığını ve kimliğinin biyometrik sonuçlar ile teyit edildiğin iletti\" denildi.https://www.milliyet.com.tr/ekonomi/thodexin-kurucusu-fatih-ozer-yakalandi-6815828",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411714",
  "comments": [
    {
      "author": "Gencecikmen",
      "created_time": "August 30, 2022, 12:36:19 PM",
      "body": "Faruk Fatih Özer'in Türkiye'ye iadesi işlemlerine de başlandığı söyleniyor. Faruk Fatih Özer'in Türkiye'de açılan davasında kendisi hakkında 3 ayrı suçtan 40 bin 562 yıla kadar hapsi isteniyordu. Ama bugün okuduğum bir iddiaya göre yakalanmadan önce, avukatları aracılığıyla dava açanlara paranızın %25ini verelim davayı çekin şeklinde bir teklif yaparak bir çok davanın geri çekildiği yazıyordu. Küçük bir ceza ile sıyrılma durumu olduğu yazıyordu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "August 30, 2022, 03:53:30 PM",
      "body": "40 bin yıl yatacak falan değil, yatsa yatsa göstermelik 3-5 ay yatırırlar. Herkese parasını geri vereceğim çok güzel yatırımlar yaptım diyerek işin içinden çıkacaktır. Adam bir döneme adını vurdu, ülkede herkes Thodex konuştu. Şimdi para kaybedenler dışında kimsenin aklına bile gelmiyordur. Parasını aldığı kişilere de verecek 3-5 kuruş umut diyerek mağdur olan kişiler de geri vitese atacaktır. 100 bin lirasını bu adama kaptıran kişi zaten 1 sene içerisinde 25 bin liraya düşecekti, %25'lik teklif gelirse çoğu kişi kabul eder",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "execijutiere",
      "created_time": "August 30, 2022, 04:18:02 PM",
      "body": "Geç bile kalındı yakalamakta. Hoş elinde para kalmış mıdır diye sorarsanız belki bir ihtimal birşeyler kalmıştır. Yoksa yakalanmazdı sorusunu akıllara getiriyor. Umarım en azından birkaç kişinin parasını geri verirse insanlar biraz olsun rahatlar. Bu haberi duyan para kaptıran insanlar az çok sevinmiştir ama şimdi parasının geri alınıp alınamayacağını öğrenmek için haber bekliyordur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "August 30, 2022, 06:53:54 PM",
      "body": "Quote from: xzone on August 30, 2022, 03:53:30 PM40 bin yıl yatacak falan değil, yatsa yatsa göstermelik 3-5 ay yatırırlar. Herkese parasını geri vereceğim çok güzel yatırımlar yaptım diyerek işin içinden çıkacaktır. Adam bir döneme adını vurdu, ülkede herkes Thodex konuştu. Şimdi para kaybedenler dışında kimsenin aklına bile gelmiyordur. Parasını aldığı kişilere de verecek 3-5 kuruş umut diyerek mağdur olan kişiler de geri vitese atacaktır. 100 bin lirasını bu adama kaptıran kişi zaten 1 sene içerisinde 25 bin liraya düşecekti, %25'lik teklif gelirse çoğu kişi kabul eder Vereceğinin garantisi var mı peki yok. Yine umut tacirliği ile diyecek ki önce davayı çekin ve alacağınızı bize bildirin, ben içeriden çıktıktan sonra size yüzde 25 vereceğim. Herkes davasını çekince içeriden tıpış tıpış çıkacak ve o dakikadan sonra sabaha kadar şikayetçi olsunlar, adam çıkmış olacak. Sürecin işleyişi büyük ihtimalle böyle gerçekleşecek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 30, 2022, 06:56:15 PM",
      "body": "Hocam kimlerle resmi olduğunu biliyoruz ben o kadar da yatacağını sanmıyorum göstermelik yatıp çıkacaktır mahkeme dışarıdan devam edecektir istedikleri kadar şikayet etsinler birşey olmaz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "August 30, 2022, 09:02:32 PM",
      "body": "inşallah onu böyle gülşen gibi tutuklu yargılarlar da adamın işin ciddiyetinin farkında olmasını sağlarlar. bu kişi hem ceza almalı hem de insanlara parasını yatırmalı. böyle bir sistemin varlığı, bunun üstüne çalışmaları yüzünden hala adam yeni bir sistem kursa ona bile para yatıracak enayi çok bizim memlekette.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "August 30, 2022, 11:10:40 PM",
      "body": "Quote from: Red Pie on August 30, 2022, 09:02:32 PMinşallah onu böyle gülşen gibi tutuklu yargılarlar da adamın işin ciddiyetinin farkında olmasını sağlarlar. bu kişi hem ceza almalı hem de insanlara parasını yatırmalı. böyle bir sistemin varlığı, bunun üstüne çalışmaları yüzünden hala adam yeni bir sistem kursa ona bile para yatıracak enayi çok bizim memlekette. Saadet zinciri yada kullanıcıların parasını alıp kaçan borsa sahiplerinin genellikle hesap etmedikleri en önemli şey bir kaçak olduklarında yaşamanın eskisi kadar ucuz olmayacağıdır. Çiftlik bank olayında da Thodex borsa olayında da kullanıcılardan çalınan paralar çok büyük fakat kaçak hayat sürüp adalet mekanizmasından kaçabilmeleri için verdikleri rüşvetler yüzünden paralarının kaldığını zannetmiyorum.Lüks bir hayat yaşamak için insanları dolandırdıklarını düşündüğünüzde çok fazla paraları varken bir kenara çekilip yaşamayı tercih etmiyorlar. Pablo Escobar'ın bile uzun süren kaçış hikayesinde çeşitli sebeplerle neredeyse tüm parasını kaybettiği aklıma geldi. Mahkeme olsa bile geriye verecek parası yoktur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "August 31, 2022, 01:28:37 PM",
      "body": "Quote from: mandown on August 30, 2022, 06:56:15 PMHocam kimlerle resmi olduğunu biliyoruz ben o kadar da yatacağını sanmıyorum göstermelik yatıp çıkacaktır mahkeme dışarıdan devam edecektir istedikleri kadar şikayet etsinler birşey olmazHocam, resmi birileri ile olduğu için adam yakalanacağı tarihi biliyor ki avukatı bu tarihten önce bir çok kişi ille görüşüp davayı geri çektiriyor. Şimdi gelir birkaç gün göstermelik içerde kalır ki, kaldığı yeri 5 yıldızlı pansiyon kıvamına getirirler. Sonra da birilerinin danışmanı olur yada saygın(!) bir iş adamı olup hayatına devam eder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "August 31, 2022, 01:46:49 PM",
      "body": "Quote from: Bthd on August 30, 2022, 11:10:40 PMQuote from: Red Pie on August 30, 2022, 09:02:32 PMinşallah onu böyle gülşen gibi tutuklu yargılarlar da adamın işin ciddiyetinin farkında olmasını sağlarlar. bu kişi hem ceza almalı hem de insanlara parasını yatırmalı. böyle bir sistemin varlığı, bunun üstüne çalışmaları yüzünden hala adam yeni bir sistem kursa ona bile para yatıracak enayi çok bizim memlekette. Saadet zinciri yada kullanıcıların parasını alıp kaçan borsa sahiplerinin genellikle hesap etmedikleri en önemli şey bir kaçak olduklarında yaşamanın eskisi kadar ucuz olmayacağıdır. Çiftlik bank olayında da Thodex borsa olayında da kullanıcılardan çalınan paralar çok büyük fakat kaçak hayat sürüp adalet mekanizmasından kaçabilmeleri için verdikleri rüşvetler yüzünden paralarının kaldığını zannetmiyorum.Lüks bir hayat yaşamak için insanları dolandırdıklarını düşündüğünüzde çok fazla paraları varken bir kenara çekilip yaşamayı tercih etmiyorlar. Pablo Escobar'ın bile uzun süren kaçış hikayesinde çeşitli sebeplerle neredeyse tüm parasını kaybettiği aklıma geldi. Mahkeme olsa bile geriye verecek parası yoktur.Katılıyorum, kaçak yaşamak öyle sanıldığı kadar komik değil, bin bir kişiye para yediriyorsun, yedirmezsen korumayız derler, allah bilir kaç kişi ne paralar yedirmiştir.Eeee ne oldu 3-5 ay kaçtı yakalandı, yiyebildi mi paraları sanmıyorum başkaları daha çok yemiştir eminim. Hayatına yazık etti, kolay kolay bırakacaklarını sanmıyorum dışarıya içerde yatar iyi bir süre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "September 01, 2022, 12:13:49 AM",
      "body": "Quote from: MK-74 on August 31, 2022, 01:46:49 PMKatılıyorum, kaçak yaşamak öyle sanıldığı kadar komik değil, bin bir kişiye para yediriyorsun, yedirmezsen korumayız derler, allah bilir kaç kişi ne paralar yedirmiştir.Eeee ne oldu 3-5 ay kaçtı yakalandı, yiyebildi mi paraları sanmıyorum başkaları daha çok yemiştir eminim. Hayatına yazık etti, kolay kolay bırakacaklarını sanmıyorum dışarıya içerde yatar iyi bir süre.Kullanıcıları dolandırdığı toplam miktar kaçarken elinde değildi çünkü neredeyse 1 sene öncesinde borsaya yani kullanıcılara ait parayla binance borsasına aktarılan paralar var. Sahibi kaçıp giden borsaların bir kısmında görülen sorunlardan bir tanesi bu. Kullanıcılara ait parayı değerlendirmek için farklı platformlara aktarıp para kazanmayı planlıyorlar, kaybettiklerinde ise kurtaramayacaklarını bildikleri için kullanıcılara ait son paralar ile kaçmayı deniyorlar. Olay aslında UST üzerinden gelir elde edebilmek yada 3AC gibi kapitallere borç vermek için kullanıcı yatırımlarını emanet eden merkezi ve merkeziyetsiz faiz platformlarının başına gelenin farklı bir modeli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "September 01, 2022, 10:24:19 AM",
      "body": "Ben bu abinin bu kadar yüklü parayla kaçabilmesine bile çok şaşırmıştım. Eğer siyasi ve hukuki bağlantılarınız yoksa böyle büyük paraları asla size yedirmezler, paranızı çarpar sizi yerler. Bu abi de yakalanmış iyi olmuş. Ama neye yarar bilmiyorum bir Thodex gitti, muhtemelen binlerce insanı kriptoparalara küstürdü üzücü biçimde. Ayrıca o paraların da kurtarılabileceğini hiç mi hiç zannetmiyorum. 10-15 yıl yatar çıkar paraları da yer sonra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "September 01, 2022, 11:08:44 AM",
      "body": "Quote from: Pierre 2 on September 01, 2022, 10:24:19 AMBen bu abinin bu kadar yüklü parayla kaçabilmesine bile çok şaşırmıştım. Eğer siyasi ve hukuki bağlantılarınız yoksa böyle büyük paraları asla size yedirmezler, paranızı çarpar sizi yerler. Bu abi de yakalanmış iyi olmuş. Ama neye yarar bilmiyorum bir Thodex gitti, muhtemelen binlerce insanı kriptoparalara küstürdü üzücü biçimde. Ayrıca o paraların da kurtarılabileceğini hiç mi hiç zannetmiyorum. 10-15 yıl yatar çıkar paraları da yer sonra.Hocam zaten siyasi tarafta bir bağlantısı olmayan bir kaçak şuandaki iletişim ve istihbarat teknolojisiyle yakalanması dakikalar alır. Bu adamın besbelliydi nasıl kaçtığı neler çevirdiği şimdi 3-5 sene yatar çıkar birde çalınan paraların %25'i iade gibi bir tartışma vardı tam içeriğini hatırlamıyorum o kadarını bile ödemeyeceklerdir, insanların parası uçtu gitti 3-5 kişininde cebine kar kaldı hiç bir sıkıntı çekmeden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "September 01, 2022, 07:21:52 PM",
      "body": "Quote from: Pierre 2 on September 01, 2022, 10:24:19 AMBen bu abinin bu kadar yüklü parayla kaçabilmesine bile çok şaşırmıştım. Eğer siyasi ve hukuki bağlantılarınız yoksa böyle büyük paraları asla size yedirmezler, paranızı çarpar sizi yerler. Bu abi de yakalanmış iyi olmuş. Ama neye yarar bilmiyorum bir Thodex gitti, muhtemelen binlerce insanı kriptoparalara küstürdü üzücü biçimde. Ayrıca o paraların da kurtarılabileceğini hiç mi hiç zannetmiyorum. 10-15 yıl yatar çıkar paraları da yer sonra.Paraları alıp yurtdışına kaçmadan önce de düzgün çalışan bir borsa değildi ki. Foruma başlık açmış acemi bir kullanıcıya yanlış gönderilmiş birimleri kurtarmak için yardımcı olmaya çalışıyordum. Kullanıcılarla cüzdan private keyi paylaşıyorlardı daha da ötesi ilk 3 denemede private key zannederek işlemin txID bilgisini paylaşacak kadar da acemi teknik servisleri vardı. Kaçmasalar bile er yada geç içerisi boşaltılacak bir borsaydı. Para kaptıran insanların çok büyük bölümü de kripto ile ilgisi olmayan sadece fiyat hareketliliği üzerinden kumar oynamak isteyen insanlardır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "September 03, 2022, 09:52:21 AM",
      "body": "Bu adamın ne vasfı var da bu kadar uzun süre yakalanmadan saklanabiliyor. Binlerce kişiyi dolandırmış bir kişiden bahsediyoruz. Bundan sonrası için kaçırılan paranın peşine düşülmeli. Paralar bulunmadıktan sonra yakalanmış, yakalanmamış çok da önemli değil açıkçası. Kaç sene yatacak ki sanki. Cezaevinden çıkar çıkmaz kaldığı yerden devam eder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "September 03, 2022, 08:08:55 PM",
      "body": "Vasıfsız adamın Arnavutluk gibi küçücük ülkede bu kadar kalması bile enteresandı. Çoktan yakalanması gerekiyordu bu dolandırıcı adamın. Zararın neresinden dönülürse kardır. En azından Türk yargısı karşısında hesap verme vakti. Şikayetçilerin tek tek bu adam hakkında cezaları görülür. İnşallah zararları karşılanır diyeceğim de imkansız maalesef o.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "September 16, 2022, 04:39:31 PM",
      "body": "Bu Fatih Özer, Arnavutluk makamları tarafından verilen karara avukatları aracılığıyla itiraz etmiş ve kararı temyize götürmüşler.Yasal sürecin iade olarak başlayabilmesi için Arnavutluk makamlarının adli süreci bitirip, Türkiye’ye iade sürecini başlatmasını içişleri ve adalet bakanlığı bekliyor.Temyizdeki duruşma 20 Eylül günü yapılacak ve alınacak kararı Türkiye’de yakından takip ediyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "September 16, 2022, 05:58:11 PM",
      "body": "Quote from: W Jr. on September 16, 2022, 04:39:31 PMBu Fatih Özer, Arnavutluk makamları tarafından verilen karara avukatları aracılığıyla itiraz etmiş ve kararı temyize götürmüşler.Yasal sürecin iade olarak başlayabilmesi için Arnavutluk makamlarının adli süreci bitirip, Türkiye’ye iade sürecini başlatmasını içişleri ve adalet bakanlığı bekliyor.Temyizdeki duruşma 20 Eylül günü yapılacak ve alınacak kararı Türkiye’de yakından takip ediyor.Diyelim ki Arnavutluk serbest kararı verdi, Türk makamlar iadesini isteyebilir mi acaba, kafamda bir sürü soru oldu bak şimdi, ben sanıyorum ki yakaladılar direkt Türkiye’ye iade edecekler, Arnavutluk’ta bir suça karışmadıysa, Arnavutluk nasıl ceza verecek acaba, bülten çıkarılmıştı hakkında, galiba onunla ilgili bir kaç işlem yapılır,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}