{
  "id": "topic_5444166",
  "title": "Bialke",
  "author": "Bialke",
  "created_time": "March 09, 2023, 08:44:12 PM",
  "content": "What if: The unpegging and collapsing of Tether USDI do have a hypothetical scenario:In the next days the stablecoin USDT is unpegging from the US-dollar and is collapsing. Question:- What in detail would happen? Which coins, token, banks, funds, DEX' and CEX' would be ~stable and which one would die like flys?- What would be the best strategies in the situation of a unpegging and collapsing of USDT?- Which behaviour would have which (group of) person(s) and why?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444166",
  "comments": [
    {
      "author": "o48o",
      "created_time": "March 09, 2023, 08:56:01 PMLast edit: March 09, 2023, 09:06:17 PM by o48o",
      "body": "Quote from: Bialke on March 09, 2023, 08:44:12 PMWhat if: The unpegging and collapsing of Tether USDI do have a hypothetical scenario:In the next days the stablecoin USDT is unpegging from the US-dollar and is collapsing. Question:- What in detail would happen? Which coins, token, banks, funds, DEX' and CEX' would be ~stable and which one would die like flys?- What would be the best strategies in the situation of a unpegging and collapsing of USDT?- Which behaviour would have which (group of) person(s) and why?Only good strategy at that point would be to leverage short everything to the ground in an exchange that wouldn't crash. Because every coin and token out there would crash. If usdt would crash people would jump to other stable coins and the volume would guarantee that they would fail the peg and people would have to pay premium for them.There would be ton of bank runs that would crash many exchanges that didn't have enough reserves. It would affect on EVERYTHING and no coin or token would be safe. Also i don't think i would need to even mention that it would launch the longest bear run we have ever seen. You thought that UST was bad? This would be exponentially worse.So good think it's hypotethical and won't happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "March 09, 2023, 09:01:58 PM",
      "body": "Well it's hard to answer this hypothetical question, but- their could be banks behind that will suffer the most, maybe like the Silvergate scenario, collapsing and filing for bankruptcy.- then perhaps get out of the USDT, move it to some other crypto, at least the bleeding will stop on your end- I don't understand what you mean by behavior, but it's obvious that when there is a panic, you will have to sell to stop the bleeding of our portfolioNevertheless this scenario might not happen though, not defending Tether or USDT, but they have been in the market for so long that perhaps they have toom much reserves to cover the possible collapse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bialke",
      "created_time": "March 09, 2023, 09:18:09 PM",
      "body": "Quote from: Yaunfitda on March 09, 2023, 09:01:58 PM- I don't understand what you mean by behavior, but it's obvious that when there is a panic, you will have to sell to stop the bleeding of our portfolioFirst, thank you for the answers!With \"bahavior\" I meant f.E. what would the mayority of influencers would promote, and for what reason? Or f.E. what would the CEX owners do? -- I know, to forsee all that is not possible at all - but f.E. a stable CEX? Isn't there any you would trust in this scenario?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "March 09, 2023, 09:43:34 PM",
      "body": "On 2017, when Tether keeps on printing, it had made the speculation that it's injecting those printed USDT to bitcoin. And that's why if that happens that it unpegs or depegs to its mother value which is the USD then we might see the sudden correction of the market.So, that means that bitcoin's price will go down and the entire market will just follow bitcoin then with their prices.And as for the best strategy to do, that is to buy those cheap bitcoins that's possible to be seen and that is only if you still have that enthusiasm about the market because I'll still have it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "March 09, 2023, 09:50:15 PM",
      "body": "Quote from: livingfree on March 09, 2023, 09:43:34 PMOn 2017, when Tether keeps on printing, it had made the speculation that it's injecting those printed USDT to bitcoin. And that's why if that happens that it unpegs or depegs to its mother value which is the USD then we might see the sudden correction of the market.So, that means that bitcoin's price will go down and the entire market will just follow bitcoin then with their prices.And as for the best strategy to do, that is to buy those cheap bitcoins that's possible to be seen and that is only if you still have that enthusiasm about the market because I'll still have it.Yeah, there could be a problem with Tether de-pegs, I think the main issues with them is that a bank run. Meaning if many of us withdraw our Tether it might collapse for that reason.And then we have the regulators also in their tail as early as 2017-2018 because of that fears and yet Tether stood their ground.So they can either influence the price of bitcoin negatively/positively. It's not a direct manipulation though, but if the price de-peg, for sure there will be consequences and it's going to be bad, in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "March 10, 2023, 01:34:16 AM",
      "body": "Quote from: Bialke on March 09, 2023, 08:44:12 PMIn the next days the stablecoin USDT is unpegging from the US-dollar and is collapsing. If USDT de-pegs, it would be a super big shock for cryptocurrency market but fud around Tether USDT is not new and it has years of history even before 2017.After collapses of Terra and FTX exchange, there is pressure from cryptocurrency community to force stable coin companies and centralized exchanges to give more public and transparent reports about their fund, treasury management.I read the report of Tether months ago and honestly it looks good that is matched with history of Tether to fight against fud in many years. Except if Tether report was cooked very cleverly, I think that stable coin company is good and healthy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "March 10, 2023, 03:28:33 AM",
      "body": "Quote from: Bialke on March 09, 2023, 09:18:09 PMWith \"bahavior\" I meant f.E. what would the mayority of influencers would promote, and for what reason? Or f.E. what would the CEX owners do? -- I know, to forsee all that is not possible at all - but f.E. a stable CEX? Isn't there any you would trust in this scenario?The majority of influencers would start creating videos about stable coin FUD, maybe they will start to promote CBDC since it's more regulated and created by the government. CEX owners wouldn't do anything because they don't have any relation with the stable coin's developer, except for stable coin issued by the centralized exchange e.g. Binance with their BUSD. Centralized stable coin can't be trusted, only DAI can be trusted since it's a decentralized stable coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 10, 2023, 03:48:08 AM",
      "body": "Quote from: Bialke on March 09, 2023, 08:44:12 PM- What would be the best strategies in the situation of a unpegging and collapsing of USDT?- Which behaviour would have which (group of) person(s) and why?I think the best way is to shift to altcoins that are more stable or your preferred one. Or the most least you can do is usdt to fiat on any platform that can allow you to do so. But if you are a person whose not panicking and okay to do some reconnaissance first well jump into potential alts to lose inflatiom on unpegging situation. Risky but only if you can take it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "March 10, 2023, 04:10:28 AM",
      "body": "Quote from: Bialke on March 09, 2023, 08:44:12 PMWhat if: The unpegging and collapsing of Tether USDI do have a hypothetical scenario:In the next days the stablecoin USDT is unpegging from the US-dollar and is collapsing. Question:- What in detail would happen? Which coins, token, banks, funds, DEX' and CEX' would be ~stable and which one would die like flys?- What would be the best strategies in the situation of a unpegging and collapsing of USDT?- Which behaviour would have which (group of) person(s) and why?Are you asking what will happen in detail? The whole crypto industry will again roll back some positions. With every similar negative situation, this is exactly what happens. It is not known which coins, banks, etc. will be affected. We can say for sure that those who will keep their assets at USDT. We will not know their names for 100% if these projects and banks have not published information about it.The best strategy? - Don't hold your assets in USDT or other stablecoins. How many stablecoins have already had problems? Doesn't the history of the crypto market teach you anything?Behavior will be typical. USDT holders will get angry and cry about their losses, while non-holders will generally not care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terciduk123",
      "created_time": "March 10, 2023, 04:30:17 AM",
      "body": "If USDT \"Tether\" encounters a price crash/price stability issue similar to Terra Luna, the impact will be greater than the impact of the Terra Luna price fall. Given that the third-largest cryptocurrency by market capitalization is USDT. I truly didn't think this would happen, but if it does, the best course of action for us is to immediately trade the USDT we have for fiat money or cash it out to the bank because a decline in the USDT will have an impact on all pricing.  Be it Bitcoin or Altcoins, cryptocurrencyThe best course of action is to convert it to fiat; after the issue has been resolved and the panic has begun to abate, we can return to the market and purchase Bitcoin or other altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 10, 2023, 05:50:24 AM",
      "body": "Tether won’t depeg, don’t believe what you read on the internet. Sure there are times when there was massive panic and it depegged slightly but usually after a few minutes it returned to its original 1:1 value.These stablecoin providers have no reason to rip you off. Most of these US dollars are held in short term treasuries, they are making billions of dollars per year for doing nothing, why scam people?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d3nz",
      "created_time": "March 10, 2023, 07:49:59 AM",
      "body": "Quote from: adaseb on March 10, 2023, 05:50:24 AMTether won’t depeg, don’t believe what you read on the internet. Sure there are times when there was massive panic and it depegged slightly but usually after a few minutes it returned to its original 1:1 value.These stablecoin providers have no reason to rip you off. Most of these US dollars are held in short term treasuries, they are making billions of dollars per year for doing nothing, why scam people?OP says \"what If\", so I think the best way is to buy BTC or ETH and consider swapping it to altcoins that you think will not go beyond the value of the USDT. We can also consider buying another stablecoin like BUSD, DAI, USDC, etc.But if the unpegging happens then it will really affect the crypto market maybe some investors/traders will pull out their assets and convert them to fiat if they think the crypto market has no future and can be easily manipulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "March 10, 2023, 09:20:48 AM",
      "body": "Quote from: adaseb on March 10, 2023, 05:50:24 AMThese stablecoin providers have no reason to rip you off. Most of these US dollars are held in short term treasuries, they are making billions of dollars per year for doing nothing, why scam people?The same reason like FTX where it's already become one of the most trusted centralized exchange since they offer cheaper fees and the best choice for trader. Sam Bankman doesn't need to make a big change, centralized exchange just need to add more crypto and follow the trend. FTX do make billions of dollars too, but Sam Bankman just too greedy to make more money.Maybe the Tether company will be greedy like Sam Bankman? who knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "March 10, 2023, 10:03:47 AM",
      "body": "Quote from: Bialke on March 09, 2023, 08:44:12 PM-snip-- What in detail would happen? Which coins, token, banks, funds, DEX' and CEX' would be ~stable and which one would die like flys?- What would be the best strategies in the situation of a unpegging and collapsing of USDT?- Everything will be affected, there is no further stability. But I'm not sure some will actually have a value of 0, especially algorithmic tablecoins that retain value as far as their algorithm goes, there may only be some value left.- Convert to bitcoins as long as there is a chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dragonfund",
      "created_time": "March 10, 2023, 10:41:14 AM",
      "body": "Quote from: Bialke on March 09, 2023, 08:44:12 PMWhat if: The unpegging and collapsing of Tether USDI do have a hypothetical scenario:In the next days the stablecoin USDT is unpegging from the US-dollar and is collapsing. Question:- What in detail would happen? Which coins, token, banks, funds, DEX' and CEX' would be ~stable and which one would die like flys?- What would be the best strategies in the situation of a unpegging and collapsing of USDT?- Which behaviour would have which (group of) person(s) and why?That will be a disaster because there will be FUD in every market if it happens, but the question is, will it happen? According to Tether, their reserve is equivalent to USD for every USDT that has been minted into circulation, so the possibility of deppeging is out of the question; if it would have happened, it would have happened since 2018 because it is the first stable coin to be adopted by the public, and others that came after had been put to the test and failed. The DEX and CEX will be OK; for example, look at BUSD, which has never depreciated despite the SEC's sanctions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "March 10, 2023, 11:00:23 AM",
      "body": "Quote from: Bialke on March 09, 2023, 08:44:12 PM...In the next days the stablecoin USDT is unpegging from the US-dollar and is collapsing... This would be the biggest dump that would be on the cryptocurrency market. It is possible that someone will earn on such a fall by opening a short position, but most traders will lose their money. To save your deposit, you will need to withdraw your money to fiat or buy bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "March 10, 2023, 12:10:00 PM",
      "body": "None of them, it's gonna to be a collapse for crypto.Even the value of \"Bitcoin' are gonna to getting effect, did you see on \"LUNA\" case? even it's only a small things compared to USDT the effect is not only on his ecosystem but also on other crypto value as well.So, USDT unpegging just like Black Friday in Crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "March 10, 2023, 07:48:28 PM",
      "body": "Quote from: Jating on March 09, 2023, 09:50:15 PMQuote from: livingfree on March 09, 2023, 09:43:34 PMOn 2017, when Tether keeps on printing, it had made the speculation that it's injecting those printed USDT to bitcoin. And that's why if that happens that it unpegs or depegs to its mother value which is the USD then we might see the sudden correction of the market.So, that means that bitcoin's price will go down and the entire market will just follow bitcoin then with their prices.And as for the best strategy to do, that is to buy those cheap bitcoins that's possible to be seen and that is only if you still have that enthusiasm about the market because I'll still have it.Yeah, there could be a problem with Tether de-pegs, I think the main issues with them is that a bank run. Meaning if many of us withdraw our Tether it might collapse for that reason.And then we have the regulators also in their tail as early as 2017-2018 because of that fears and yet Tether stood their ground.So they can either influence the price of bitcoin negatively/positively. It's not a direct manipulation though, but if the price de-peg, for sure there will be consequences and it's going to be bad, in my opinion.I still don't know if the printing of it is monitored. It seems that they can really just print unlimited of it especially on the earlier years when the market is mostly certain unregulated. We saw how it can be influenced a lot based on the situation and news that can be scattered for effective price changes.Good thing that we haven't saw it yet being depegged and that's a lot of trouble and worry if it ever will.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "March 10, 2023, 07:59:05 PM",
      "body": "Quote from: livingfree on March 10, 2023, 07:48:28 PMQuote from: Jating on March 09, 2023, 09:50:15 PMQuote from: livingfree on March 09, 2023, 09:43:34 PMOn 2017, when Tether keeps on printing, it had made the speculation that it's injecting those printed USDT to bitcoin. And that's why if that happens that it unpegs or depegs to its mother value which is the USD then we might see the sudden correction of the market.So, that means that bitcoin's price will go down and the entire market will just follow bitcoin then with their prices.And as for the best strategy to do, that is to buy those cheap bitcoins that's possible to be seen and that is only if you still have that enthusiasm about the market because I'll still have it.Yeah, there could be a problem with Tether de-pegs, I think the main issues with them is that a bank run. Meaning if many of us withdraw our Tether it might collapse for that reason.And then we have the regulators also in their tail as early as 2017-2018 because of that fears and yet Tether stood their ground.So they can either influence the price of bitcoin negatively/positively. It's not a direct manipulation though, but if the price de-peg, for sure there will be consequences and it's going to be bad, in my opinion.I still don't know if the printing of it is monitored. It seems that they can really just print unlimited of it especially on the earlier years when the market is mostly certain unregulated. We saw how it can be influenced a lot based on the situation and news that can be scattered for effective price changes.Good thing that we haven't saw it yet being depegged and that's a lot of trouble and worry if it ever will.Maybe this will help us all,QuoteTether continues to be the target of outdated, inaccurate, and misleading coverage and allegations from the Wall Street Journal (WSJ) whose latest report insinuates that Tether operates on the outskirts of regulation. This conflicts with the reality that Tether operates under substantial financial regulations and cooperates on a near-daily basis with global law enforcement. This includes regular cooperation with the U.S. Department of Justice and other top tier US agencies, while not servicing US-based customers.https://tether.to/en/more-outdated-allegations-from-the-wsj/Although it comes from them, but I'm somewhat that they have been targeted ever since, and I think it become prevalent again because of the collapse of Silvergate, a bank that is very friendly to crypto.There is also a company that audit Tether and reported back that they have reserves, I just can't find that report though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}