{
  "id": "topic_5470335",
  "title": "TryNinja",
  "author": "TryNinja",
  "created_time": "October 14, 2023, 03:21:36 PM",
  "content": "Como já tinha a carteira crypto instalado no meu iPhone, sigo tendo ele, mas pesquisei na loja e o app desapareceu. Caso tivesse que reinstalar ou trocar para outro dispositivo da Apple, não conseguiria instalá-lo novamente. Ainda não vi uma declaração por parte da MetaMask, mas eles devem fazer uma em breve.Não é um problema isolado da minha loja/celular: MetaMask appears to have been removed from the Apple App StoreSerá que a Apple vai começar a fechar o certo com os apps crypto ou foi algo pontual? Na Play Store do Android o app segue disponível sem problemas.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470335",
  "comments": [
    {
      "author": "alegotardo",
      "created_time": "October 14, 2023, 04:53:41 PM",
      "body": "Uma vez uma tive um iPhone (consegui largar esse vício) e na época eu utilizava a AltSotre para instalar uns apps não oficiais, o bacana é que não precisa nem fazer o jailbreak para isso, por mais que já tivesse tutorial \"confiável\" para o meu aparelho da época.Enfim, não tenho mais como testar isso, mas vocÊ já verificou se por lá ainda seria possível instalar o MetaMask no seu iOS?O mais estranho é que acessando pelo navegador a página deles, não fala nada sobre bloqueio ou descontinuação... https://apps.apple.com/us/app/metamask-blockchain-wallet/id1438144202Então, será que não é alguma \"incompatibilidade\" de seu aparelho ou conta em receber essa nova versão? Do contrário, talvéz tenha sido algo temporário mesmo.Enfim... o assunto é novo, talvéz foi só algum bugzinho ou problema ontratual entre as duas empresas, senão alguém já teria se manifestado oficialmente... acredito eu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "October 14, 2023, 06:10:05 PM",
      "body": "Quote from: alegotardo on October 14, 2023, 04:53:41 PMUma vez uma tive um iPhone (consegui largar esse vício) e na época eu utilizava a AltSotre para instalar uns apps não oficiais, o bacana é que não precisa nem fazer o jailbreak para isso, por mais que já tivesse tutorial \"confiável\" para o meu aparelho da época.Enfim, não tenho mais como testar isso, mas vocÊ já verificou se por lá ainda seria possível instalar o MetaMask no seu iOS?O mais estranho é que acessando pelo navegador a página deles, não fala nada sobre bloqueio ou descontinuação... https://apps.apple.com/us/app/metamask-blockchain-wallet/id1438144202Então, será que não é alguma \"incompatibilidade\" de seu aparelho ou conta em receber essa nova versão? Do contrário, talvéz tenha sido algo temporário mesmo.Enfim... o assunto é novo, talvéz foi só algum bugzinho ou problema ontratual entre as duas empresas, senão alguém já teria se manifestado oficialmente... acredito eu.Eita, não sabia que dava pra fazer sideload no iOS. Pelo que eu entendi você meio que finge ser o dev do app pra poder usar um app fora da AppStore. Interessante saber.Sobre a notícia do TryNinja, parece que eles já voltaram para a AppStore. Então acho que deve ser algum problema pontual:https://twitter.com/MetaMask/status/1713235991174214131",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "October 14, 2023, 06:22:47 PM",
      "body": "Acabei de conferir aqui, e agora está disponível na APP StoreSerá que foi alguma atualização que foram colocar no ar e deu algum problema, ficando indisponível na loja de aplicativos?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "October 14, 2023, 06:29:44 PM",
      "body": "Quote from: alegotardo on October 14, 2023, 04:53:41 PMUma vez uma tive um iPhone (consegui largar esse vício) e na época eu utilizava a AltSotre para instalar uns apps não oficiais, o bacana é que não precisa nem fazer o jailbreak para isso, por mais que já tivesse tutorial \"confiável\" para o meu aparelho da época.Enfim, não tenho mais como testar isso, mas vocÊ já verificou se por lá ainda seria possível instalar o MetaMask no seu iOS?Também uso o AltStore, mas esse processo nem se compara com a facilidade de fazer sideloading de apps no android (saudades baixar um .apk e instalar na hora).O maior problema é que essa falta de facilidade afasta muita gente (até eu, que quase não faço sideload de nada). Quase ninguém vai ficar fazendo sideload do MetaMask se ele sair do ar.Bom saber que provavelmente foi algo pontual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 14, 2023, 11:25:36 PM",
      "body": "O Android tem essa vantagem de baixar apk, muito vezes do site do próprio desenvolvedor,  do site oficial. Isso é uma vantagem, e em breve pode ser que o cerco feche cada vez mais no iOS.Até a electrum nem se deu ao trabalho de disponibilizar versão para o iOS.https://electrum.org/#download",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}