{
  "id": "topic_5400666",
  "title": "Thiagofelipe",
  "author": "Thiagofelipe",
  "created_time": "May 29, 2022, 11:21:27 PM",
  "content": "qual sua opinião sobre a terra luna 2.0 ? A terra luna perdeu a confiança de diversos investidores, e causou prejuízos milionarios.será que alguem ainda tem coragem de investir nesse projeto ??",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400666",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "May 30, 2022, 07:07:00 AM",
      "body": "Vai ter quem invista, claro. Principalmente a galera mais despreparada que perdeu tudo na LUNA 1.0 e agora quer fazer de tudo por uma \"segunda chance\".Tenho acompanhado os threads do FatManLuna, que tem mostrado como o Do Kwon + pessoal da Luna são maliciosos: https://mobile.twitter.com/FatManTerra",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 31, 2022, 02:37:10 PM",
      "body": "Quote from: Thiagofelipe on May 29, 2022, 11:21:27 PMqual sua opinião sobre a terra luna 2.0 ? A terra luna perdeu a confiança de diversos investidores, e causou prejuízos milionarios.será que alguem ainda tem coragem de investir nesse projeto ??A binance está apoiando a luna 2.0https://www.moneytimes.com.br/terra-luna-binance-anuncia-listagem-de-luna-2-0-distribuicao-nao-sai-como-esperado/Todos sabem aqui da minha deaconfianca de altcoins. E certamente,  quem mais lucram com esses movimentos são as corretoras e os criadores das moedas.Minha sugestão pessoal é ficar longe disso. Procure projetos menos conhecidos e melhor reputação. Além disso, lembre que o Bitcoin é uma critomoeda única e diferente de todas as outras. Na minha opinião,a única cripto que realmente merece um percentual grande noeu portfolio",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cassiolucena",
      "created_time": "June 04, 2022, 06:44:00 AM",
      "body": "O pior de tudo é que o CEO não fez basicamente nada para tentar ressarcir as inúmeras pessoas prejudicadas, eles basicamente criaram uma nova rede com a Luna 2.0 e fizeram um airdrop ridículo. Resumindo, não da mais pra confiar de forma alguma nesse projeto.Quote from: Thiagofelipe on May 29, 2022, 11:21:27 PMqual sua opinião sobre a terra luna 2.0 ? A terra luna perdeu a confiança de diversos investidores, e causou prejuízos milionarios.será que alguem ainda tem coragem de investir nesse projeto ??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 04, 2022, 11:17:18 AM",
      "body": "Quote from: cassiolucena on June 04, 2022, 06:44:00 AMO pior de tudo é que o CEO não fez basicamente nada para tentar ressarcir as inúmeras pessoas prejudicadas, eles basicamente criaram uma nova rede com a Luna 2.0 e fizeram um airdrop ridículo. Resumindo, não da mais pra confiar de forma alguma nesse projeto.Ué. A pessoa investe num ativo altamente especulativo em uma tecnologia experimental, descobre-se depois de meses  que o ativo não tem valor e a tecnologia experimental tem falhas.Daí o CEO deve ressarcir quem arriscou?;Não é assim que funcionam as coisas. Isso é investimento de altíssimo risco, uma tecnologia experimental.Nunca espere alguém se importar com suas perdas de criptomoedas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "June 04, 2022, 11:31:45 AM",
      "body": "Quote from: bitmover on June 04, 2022, 11:17:18 AMUé. A pessoa investe num ativo altamente especulativo em uma tecnologia experimental, descobre-se depois de meses  que o ativo não tem valor e a tecnologia experimental tem falhas.Daí o CEO deve ressarcir quem arriscou?;Não é assim que funcionam as coisas. Isso é investimento de altíssimo risco, uma tecnologia experimental.Nunca espere alguém se importar com suas perdas de criptomoedas.Eu concordaria com você, mas falta entender o caso.O CEO introduziu uma reserva de $1,1 bilhão para garantir pelo menos um fallback caso uma bank run acontecesse. Ele tinha a responsabilidade de: a) tentar manter o peg de forma eficiente; b) deixar ela falhar logo e bolar um plano para um bail out entre os peixes pequenos. Ele falhou em ambas.Já calcularam que daria para garantir o saldo de pelo menos 90% dos investidores, mas preferiram dar um exit para as baleias e VCs. Foi malicioso, então a crítica ao indivíduo é válida.Lembrando que essa moeda era uma das mais cobiçadas do mercado, ainda que com sua economia evidentemente fragia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 04, 2022, 11:47:02 AM",
      "body": "Quote from: TryNinja on June 04, 2022, 11:31:45 AMO CEO introduziu uma reserva de $1,1 bilhão para garantir pelo menos um fallback caso uma bank run acontecesse. Ele tinha a responsabilidade de: a) tentar manter o peg de forma eficiente; b) deixar ela falhar logo e bolar um plano para um bail out entre os peixes pequenos. Ele falhou em ambas.Já calcularam que daria para garantir o saldo de pelo menos 90% dos investidores, mas preferiram dar um exit para as baleias e VCs. Foi malicioso, então a crítica ao indivíduo é válida.Lembrando que essa moeda era uma das mais cobiçadas do mercado, ainda que com sua economia evidentemente fragia.não estou sabendo dessa história toda de fato e vc parece mais por dentro.Mas como eram duas moedas top 20 ou top 10, em termos de marketcap, 1 bilhão me parece pouca coisa para ressarcir 90% do saldo dos investidores. Para o tamanho desses marketcap,  imagino q não deva cobrir em 20%. Olhei na coingecko chegou a 20bi d marketcaphttps://www.coingecko.com/pt/moedas/terraclassicusdLuna olhei rápido me parece que chegou a 5bi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "June 04, 2022, 11:55:34 AM",
      "body": "Quote from: bitmover on June 04, 2022, 11:47:02 AMMas como eram duas moedas top 20 ou top 10, em termos de marketcap, 1 bilhão me parece pouca coisa para ressarcir 90% do saldo dos investidores. Por isso precisamos olhar os dados.Eu realmente errei na segunda escrita, daria para ressarcir ainda mais: 99.6% dos mais pobres, não 90%. Estava pensando em como escreve \"bottom investors\" e esqueci, vide o que eu escrevi antes: \"b) deixar ela falhar logo e bolar um plano para um bail out entre os peixes pequenos.\"Quote from: https://twitter.com/PersianCapital/status/1525226153304199168I repeat: By prioritizing the bottom 99.6%, Terra could literally afford to return every dollar that was invested by the poorest 99.6%How come?Well, the VERY vast majority of UST is held by regular people in smaller wallets (non b/millionaires).Quanto à LUNA, a mecânica da moeda é servir de liquidez para os holders do UST. Não tem o que fazer ai, por que a proposta é essa mesmo: expandir a base monetária até que o UST volte à paridade. Como isso não acontecia, ela inflou mais que o dólar de zimbabwe e foi de $90 para $0,00005.E você também já devia saber que marketcap não representa valor no mercado crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 04, 2022, 12:12:14 PM",
      "body": "Quote from: TryNinja on June 04, 2022, 11:55:34 AMPor isso precisamos olhar os dados.Eu realmente errei na segunda escrita, daria para ressarcir ainda mais: 99.6% dos mais pobres, não 90%. Estava pensando em como escreve \"bottom investors\" e esqueci, vide o que eu escrevi antes: \"b) deixar ela falhar logo e bolar um plano para um bail out entre os peixes pequenos.\"Procedimento bastante questionavel né, de salvar apenas os peixes pequenos. Embora seja politicamente correto e realmente uma boa ideia, não acredito que deva ter respaldo legal e poderia dar mais problemas juridicos ainda. Afinal, eles só tem 1/20 do dinheiro.era isso que estava no contrato do fundo, por exemplo? Mudar as regras exatamente na hora da partilha e enrolado tb. Além de altamente fraudavel... o cara pode ter 1 bi de carteiras com 0.5 ust e levar quase tudo.Quote from: TryNinja on June 04, 2022, 11:55:34 AME você também já devia saber que marketcap não representa valor no mercado crypto.não é todo mundo que concorda com essa afirmaçãoO marketcap nesse caso serve para saber quantos ust existem. 20bi de marketcap de ust são 20bi usd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "June 04, 2022, 03:59:49 PM",
      "body": "Quote from: bitmover on June 04, 2022, 12:12:14 PMProcedimento bastante questionavel né, de salvar apenas os peixes pequenos. Embora seja politicamente correto e realmente uma boa ideia, não acredito que deva ter respaldo legal e poderia dar mais problemas juridicos ainda. Afinal, eles só tem 1/20 do dinheiro.era isso que estava no contrato do fundo, por exemplo? Mudar as regras exatamente na hora da partilha e enrolado tb. Além de altamente fraudavel... o cara pode ter 1 bi de carteiras com 0.5 ust e levar quase tudo.Questionável na sua opinião.Na minha opinião, os VCs da LUNA lucraram em cima do peixe pequeno do retail, que colocou mais do que deveria e perdeu o que passou a vida toda juntando. Vi vários relatos de gente pensando no suicidio e sobre amigos que seguiram esse caminho. Antes eles não perderem nada do que todo mundo perder tudo, ou deixar as grandes baleias arcarem com esse custo, sendo focadas por último.E ninguém está preocupado com questão jurídica. Você mesmo falou que tudo isso é experimental e de alto risco. A moeda lançou via ICO sem permissão de governo algum, gerenciou bilhões de dólares de reserva também sem consultar normais governamentais, torrou essas reservas da mesma forma, e lançaram um plano independente (LUNA 2.0) baseado no que o pessoal achou melhor. Só o bail out para o retail que precisa disso?Quote from: bitmover on June 04, 2022, 12:12:14 PMO marketcap nesse caso serve para saber quantos ust existem. 20bi de marketcap de ust são 20bi usd. Claro, por que UST é \"cripto\" mas para o lado da stablecoin (\"garante\" 1 = $1). Falhou, mas essa era a proposta.Já a LUNA, cujo \"marketcap chegou a 20bi\", nunca precisaria garantir $20b para \"pagar todo mundo\", já que o único fator para esse marketcap é o supply atual * valor do bid/ask executado mais recente. Ou seja, métrica completamente inútil devido à volatilidade e falta de liquidez da mesma relativo ao valor do marketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "June 05, 2022, 10:37:27 PM",
      "body": "Quote from: TryNinja on June 04, 2022, 11:31:45 AMEu concordaria com você, mas falta entender o caso.O CEO introduziu uma reserva de $1,1 bilhão para garantir pelo menos um fallback caso uma bank run acontecesse. Ele tinha a responsabilidade de: a) tentar manter o peg de forma eficiente; b) deixar ela falhar logo e bolar um plano para um bail out entre os peixes pequenos. Ele falhou em ambas.Já calcularam que daria para garantir o saldo de pelo menos 90% dos investidores, mas preferiram dar um exit para as baleias e VCs. Foi malicioso, então a crítica ao indivíduo é válida.Lembrando que essa moeda era uma das mais cobiçadas do mercado, ainda que com sua economia evidentemente fragia.Nossa, confesso que também estou totalmente por fora desses acontecimentos!  Ninja, tu acha que esse lançamento da LUNA 2.0 poderá ser só \"\"um voo de galinha!!?\"\" Ou ainda a Terra Luna terá chances ainda de sobreviver!!?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "June 06, 2022, 08:37:55 AM",
      "body": "Quote from: gagux123 on June 05, 2022, 10:37:27 PMNinja, tu acha que esse lançamento da LUNA 2.0 poderá ser só \"\"um voo de galinha!!?\"\" Ou ainda a Terra Luna terá chances ainda de sobreviver!!? Tem como sobreviver, claro. Ainda que a UST fosse responsável por todo o crescimento da moeda, e a maioria dos projetos giravam em torno da stablecoin, eles podem muito bem pensar em outras soluções para manter a rede viva como mais uma L1.Agora, recuperar o valor anterior, principalmente a ponto de compensar quem perdeu dinheiro, eu acho muuuuito improvável.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}