{
  "id": "topic_5417726",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "October 20, 2022, 07:13:23 AM",
  "content": "What is the meaning of unlimited allowance in Revoke.cash website? I am a new user and I heard this website can help you terminate unwanted connections in your wallet, I tried it today and this is what I get, I don't know what I'm looking at, maybe anyone can help.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417726",
  "comments": [
    {
      "author": "owlcatz",
      "created_time": "October 20, 2022, 02:34:50 PM",
      "body": "Quote from: Crypt0Gore on October 20, 2022, 07:13:23 AMWhat is the meaning of unlimited allowance in Revoke.cash website? I am a new user and I heard this website can help you terminate unwanted connections in your wallet, I tried it today and this is what I get, I don't know what I'm looking at, maybe anyone can help.This article explains better than I could... https://cointelegraph.com/news/simple-steps-to-safeguard-your-wallet-from-unlimited-erc-20-allowance-risks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "October 20, 2022, 03:10:51 PM",
      "body": "To put up simply, allowance is the maximum funds(tokens) that are able to be spent, if something bad happens, the attackers could have all the funds within your wallet. In case you set an allowance, let's say, 10 DODO, the attackers can only steal 10 DODO. You can also revoke the allowance, which in this case, that means the funds can't be moved without your authorization.The term token approval or token allowance is interchangeable. You can learn more about it on https://metamask.zendesk.com/hc/en-us/articles/6174898326683.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 21, 2022, 09:24:08 AM",
      "body": "Quote from: vv181 on October 20, 2022, 03:10:51 PMTo put up simply, allowance is the maximum funds(tokens) that are able to be spent, if something bad happens, the attackers could have all the funds within your wallet. In case you set an allowance, let's say, 10 DODO, the attackers can only steal 10 DODO. You can also revoke the allowance, which in this case, that means the funds can't be moved without your authorization.The term token approval or token allowance is interchangeable. You can learn more about it on https://metamask.zendesk.com/hc/en-us/articles/6174898326683.Thank 🙇 you Sir Owlcatz and Sir vv181, your explanation and links are very helpful, I stumbled on this while doing some research so I needed to make sure I am doing the right thing with my wallet, you've been very helpful, God bless you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "October 24, 2022, 03:49:16 AM",
      "body": "I really want to know how secure this website is and i very curious about it.From my view it seems like for a website to have such feature you might given access to phrase or person keys, and what if somethings happened to that same wallet in a way you didn't remember that you sets those security protection or its being compromised without permission, what will you do at this point?Do you blame the website you connected your wallets with or whom do you blame for such activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "October 24, 2022, 05:19:28 AM",
      "body": "Quote from: MainIbem on October 24, 2022, 03:49:16 AMI really want to know how secure this website is and i very curious about it.From my view it seems like for a website to have such feature you might given access to phrase or person keys~If you bother to visit the website, you should be able to see that the site did not require such kinds of things. The information that I referred to on the MetaMask link above should also suffice to get a grasp of what this kind of platform can do.The platform is also open-sourced, so you can run it locally and those who can inspect the code are able to do it. It is one of the listed smart contract revoking tools that listed by MetaMask:  How to revoke smart contract allowances/token approvals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}