{
  "id": "topic_5456212",
  "title": "fathafraink",
  "author": "fathafraink",
  "created_time": "June 13, 2023, 09:26:40 AM",
  "content": "Saya ingin bertanya kepada agan-agan, khususnya yang sangat berpengalaman di dunia Crypto, saya ingin menanyakan, Kenapa token sekuritas ketika dinyatakan sebagai token Sekuritas oleh SEC harganya malah makin anjlok. Contohnya yaitu Solana yang mengalami penurunan 40% hanya dalam 1 minggu. Kenapa dan apa alasannya?, saya tidak paham, Sepemahaman saya token sekuritas itu aman karena bisa dibilang eligible dan jauh dari kemungkinan adanya \"SCAM\". Namun mengapa, kenapa token Eligible tersebut malah turun atau Anjlok ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456212",
  "comments": [
    {
      "author": "Luzin",
      "created_time": "June 13, 2023, 10:53:57 AM",
      "body": "Quote from: fathafraink on June 13, 2023, 09:26:40 AMKenapa dan apa alasannya?, saya tidak paham, Sepemahaman saya token sekuritas itu aman karena bisa dibilang eligible dan jauh dari kemungkinan adanya \"SCAM\". Namun mengapa, kenapa token Eligible tersebut malah turun atau Anjlok ?Saya pikir Solana semenjak kebangkrutan FTX, harganya terus menurun. Berita yang saya dengar dulu Solana dibuat oleh perusahaan yang berubungan dengan proyek  Serum  dan itu berhubungan dengan Sam Bankman-Fried. Tapi entah kebenarannya. Selain itu memang kondisi pasar memang sedang memerah, akibat gugatan SEC pada Binance. Saya amati hampir semua coin token saat BTC crash mereka ikut crash. Kemudian mengenai Securitas yang ditetapkan oleh SEC. Sepertinya Solana tidak mengakui, bahkan Solana Foundation telah membantahnya. Quote from: https://www.coindesk.id/berita/solana-foundation-tegaskan-token-sol-bukan-sekuritasSOL merupakan native token blockchain Solana, sebuah proyek perangkat lunak yang kuat, bersumber terbuka, dan berbasis komunitas yang bersandar pada pengguna terdesentralisasi dan pengembang untuk memperluas dan berevolusi.” Sumber: https://www.coindesk.id",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uruhara",
      "created_time": "June 15, 2023, 05:03:13 AM",
      "body": "Saya tidak memiliki pengalaman yang banyak dalam crypto tapi ijinkan saya ikut nimbrung dalam utas ini. Saya memiliki jawaban versi saya dalam hal ini. Terkait penurunan yang terjadi adalah karena seperti yang telah diberitakan dibanyak media diluar sana. Bahwa setelah SEC mengugat Binance US dan juga pemiliknya yaitu CZ. Maka beberapa bursa yang juga beroperasi disana (US) membuat langkah antisipasi supaya tidak tidak digugat oleh SEC dengan mendelisting beberapa koin yang berpotensi dianggap sekuritas oleh SEC. Seperti ADA,Matic dan lainnya. Bahkan Binance mendelisting hampir 100 pasangan perdagangan lebih dibursa mereka setelah gugatan tersebut muncul. Maka tidak heran jika banyak pengguna disana yang menjual sebelum didelisting. Sehingga menyebabkan penurunan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "June 15, 2023, 01:01:17 PM",
      "body": "Quote from: Uruhara on June 15, 2023, 05:03:13 AMBahwa setelah SEC mengugat Binance US dan juga pemiliknya yaitu CZ. Maka beberapa bursa yang juga beroperasi disana (US) membuat langkah antisipasi supaya tidak tidak digugat oleh SEC dengan mendelisting beberapa koin yang berpotensi dianggap sekuritas oleh SEC. Seperti ADA,Matic dan lainnya.Jawaban yang om @Uruhara berikan hanya memiliki sedikit relevansi di sini, kita tahu bahwa ketika SEC mengklasifikasikan sebuah koin/token sebagai sekuritas, maka mau tidak mau sebuah exchange yang berada di yuridiksi USA harus melakukan desliting terhadap assets tersebut. Yang pada akhirnya akan menyebabkan penurunan harga karena adanya bad news (delisting).Tidak sedikit proyek yang menjadi korban dari gugatan-gugatan yang SEC layangkan ke Binance US, Coinbase ataupun Bittrex, diantaranya sebagai berikut: 1. Gegara SEC Kategorikan Kripto AMP Sebagai Sekuritas, Binance US Akan Hapus Token Tersebut2. Tim di Balik Solana, Cardano, dan The Sandbox Bantah Tuduhan SECDiatas hanyalah 2 contoh berita yang saya dapatkan, dan saya yakin masih ada banyak sekali berita-berita yang serupa, kemudian, muncul pertanyaan-pertanyaan di benak saya dan mungkin hal ini juga yang sebenarnya menjadi pertanyaan OP.1. Apa itu token sekuritas?2. Mengapa sebuah koin/token jika diketegorikan sebagai sekuritas oleh SEC, maka koin/token itu harus di delisting?3. Apakah koin/token sekuritas itu adalah hal yang buruk sehingga harus di delisting?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "June 15, 2023, 03:44:41 PMLast edit: June 15, 2023, 04:09:12 PM by Ahli38",
      "body": "Quote from: fathafraink on June 13, 2023, 09:26:40 AMKenapa dan apa alasannya?, saya tidak paham, Sepemahaman saya token sekuritas itu aman karena bisa dibilang eligible dan jauh dari kemungkinan adanya \"SCAM\". Namun mengapa, kenapa token Eligible tersebut malah turun atau Anjlok ?Penurunan yang terjadi pada beberapa aset crypto atau koin crypto yang dianggap masuk dalam aset sekuritas oleh SEC ini memang dikarenakan oleh beberapa bursa di AS yang melakukan delisting terhadap koin-koin crypto tersebut. Walaupun hanya Binance dan Coinbase yang saat ini di tuntut tapi nyatanya bursa lainnya yang beroperasi di AS mengikuti untuk mendelisting Koin-koin yang dianggap sekuritas tersebut. Dan koin-koin tersebut dianggap sekuritas hanya sebatas oleh pengakuan SEC saja. Karena pada dasarnya belum ada ketentuan pasti tentang koin-koin crypto tersebut apakah tergolong Sekuritas ataukah komoditas. Contohnya XRP juga dianggap sekuritas oleh SEC sehingga XRP dituntut karena tidak mendaftarkan koinnya pada SEC. Sedangkam pihak XRP sendiri merasa bahwa koin mereka mungkin bukan sekuritas sehingga sejak awal menjadi tidak didaftarkan ke SEC. SEC ini kalau di indonesia seperti OJK . Yaitu badan yang mengawasi dan mengatur seputar aset yang dianggap sekuritas seperti saham dll (Maaf jika salah soalnya nulisnya tanpa googling dulu). Sedangkan di indonesia Crypto sendiri dianggap komoditas sehingga diawasinya oleh Bappebti yang memang bertugas mengatur dan mengawasi aset komoditas.  Jadi sebenarnya koin-koin yang didelisting itu sendiri mungkin mereka bahkan tidak menganggap koin-koin mereka sebagai sekuritas. Hanya saja di AS nampaknya SEC menganggap Crypto selain Bitcoin sebagai sekuritas. Terutama yang mengadopsi Proof of stake. Tapi walaupun demikian sebenarnya belum ada kejelasan regulasi tentang hal ini di AS sana. Sehingga tindakan delistingpun hanya antisipasi saja atas ketakutan beberapa bursa supaya tidak di tuntut seperti Binance dan Coinbase. Dan sebenarnya kepanikan penjualan pada koin ADA,SOL dan matic juga di picu oleh pengumuman Robinhood yang juga akan mendelisting ketiga koin tersebut. Sedangkan Robinhood diketahui menyimpan aset mereka sebesar 583 juta dollar AS di tiga koin tersebut. Sehingga wajar jika para trader memutuskan untuk cari aman terlebih dahulu dengan menjual ketiga koin tersebut. (Sourch)Dan secara fundamental market juga sedang koreksi setelah pengumuman FOMC. Yaitu walaupun laju kenaikan bunga dihentikan sementara tapi masih ada rencana akan dinaikan lagi. Jadi antara bad and good news nya bercampur. Jadi intinya banyak fud dll masih banyak lagi alasan lainnya. Tapi mungkin juga Whales juga mungkin sedang bermain-main dengan harga pasar saat ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "June 18, 2023, 08:16:17 AM",
      "body": "Quote from: MAAManda on June 15, 2023, 01:01:17 PM2. Mengapa sebuah koin/token jika diketegorikan sebagai sekuritas oleh SEC, maka koin/token itu harus di delisting?Sebelumnya kita harus tahu dulu perbedaan antara sebuah security dan unregistered security. Aturan untuk sebuah security diperdagangkan pada publik itu macam-macam, misalnya pada bursa saham kita. Saham sebelum menjadi terbuka (Tbk) dan diperdagangkan di bursa, itu banyak aturan yang harus dipenuhi. Penawaran perdana-nya pun memiliki aturan. Nah kalau suatu token dinyatakan sebagai security secara tidak langsung itu sudah menuding kalau token itu adalah unregistered security karena mekanisme kek ICO, IEO, dll itu tidak diakui. Pasti nanti akan kenak sanksi dari SEC.Nah kalau dinyatakan sebagai security tentunya token itu tidak bisa lagi diperdagangkan di bursa kripto yang tidak memiliki ijin untuk memperdagangkan security. Bursa untuk security sudah ada sendiri entah itu stock, bond, derivatif, dll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "June 18, 2023, 01:40:31 PM",
      "body": "Quote from: mu_enrico on June 18, 2023, 08:16:17 AMSebelumnya kita harus tahu dulu perbedaan antara sebuah security dan unregistered security. Aturan untuk sebuah security diperdagangkan pada publik itu macam-macam, misalnya pada bursa saham kita. Saham sebelum menjadi terbuka (Tbk) dan diperdagangkan di bursa, itu banyak aturan yang harus dipenuhi. Penawaran perdana-nya pun memiliki aturan. Nah kalau suatu token dinyatakan sebagai security secara tidak langsung itu sudah menuding kalau token itu adalah unregistered security karena mekanisme kek ICO, IEO, dll itu tidak diakui. Pasti nanti akan kenak sanksi dari SEC.Nah kalau dinyatakan sebagai security tentunya token itu tidak bisa lagi diperdagangkan di bursa kripto yang tidak memiliki ijin untuk memperdagangkan security. Bursa untuk security sudah ada sendiri entah itu stock, bond, derivatif, dll.Thanks atas tanggapannya om @mu_enrico, sedikit banyaknya kini saya sudah paham korelasi dari tudingan SEC terhadap koin/token sekuritas dan delisting yang berimbas kepada anjlok-nya value dari koin/token terkait. Dengan balasan ini, saya rasa sepertinya semuanya sudah jelas dan tidak perlu diskusi lebih lanjut dari sisi sayanya .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "June 22, 2023, 10:49:56 PM",
      "body": "Menyimpulkan dari tulisan Rober Steven di Coindesk ini https://www.coindesk.com/learn/securities-vs-commodities-why-it-matters-for-crypto/, Menurutku jadi ada beberapa alasan kenapa projek Kripto malah dapat sentimen buruk kalau ditetapkan sebagai Sekuritas oleh SEC. 1. Jadi dianggap tidak desenteral, karena SEC hanya akan menetapkan suatu kripto sebagai Sekuritas jika dalam sistem suatu kripto terdapat entitas -entah perorangan/perusahaan- sentral yang mengatur kripto tersebut, dan komunitas secara umum lebih menyukai projek kripto yang sifatnya desentral, karena menganggap desentralisasi adalah salah satu alasan utama bitcoin dan kripto diciptakan dan kalau ada sentral apa bedanya dengan sistem keuangan sekarang yang memang diatur oleh Bank Sentral. 2. Bursa / Exchange cenderung tidak akan mau untuk listing kripto yang dianggap sebagai Sekuritas. Jika kripto ditetapkan senagai Sekuritas oleh SEC maka projek tersebut diwajibkan untuk memenuhi beberapa kriteria agar mendapatkan ijin sekuritas oleh SEC, jika tidak terpenuhi maka akan dianggap sebagai Sekuritas yang ilegal, dan bursa yang me-listing projek kripto tersebut bisa dituntut oleh SEC.Dua hal diatas sepertinya cukup untuk memberikan sentimen negatif terhadap suatu projek apabila projek tersebut di tetapkan sebagi Sekuritas oleh SEC, dan membuat investor kripto enggan untuk menaruh uangnya pada projek yang sudah ditetapkan sebagai Sekuritas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rimueng",
      "created_time": "December 10, 2023, 03:46:08 AM",
      "body": "Quote from: fathafraink on June 13, 2023, 09:26:40 AMSaya ingin bertanya kepada agan-agan, khususnya yang sangat berpengalaman di dunia Crypto, saya ingin menanyakan, Kenapa token sekuritas ketika dinyatakan sebagai token Sekuritas oleh SEC harganya malah makin anjlok. Contohnya yaitu Solana yang mengalami penurunan 40% hanya dalam 1 minggu. Kenapa dan apa alasannya?, saya tidak paham, Sepemahaman saya token sekuritas itu aman karena bisa dibilang eligible dan jauh dari kemungkinan adanya \"SCAM\". Namun mengapa, kenapa token Eligible tersebut malah turun atau Anjlok ?Setau saya SEC di amrik menyatakan bahwa suatu token kripto sebagai sekuritas, artinya token tersebut dianggap mirip dengan saham perusahaan. Jadi banyak dampak hukumnya. Mungkin alasan kenapa harga bisa anjlok. karena investor perlu kepasian juga gimana solana ini diperdagangkan di masa depan. Karena regulator itu bisa sangat berdampak pada harga kripto. Misalnya, platform yang menawarkan token tersebut mungkin perlu lisensi khusus untuk menjual sekuritas. jadi agak ribe sih. Kalau regulator seperti SEC tiba-tiba turun tangan, bisa bikin suasana jadi tegang dan berdampak ke harga. Ya kayak kasus ceo binance kemaren lah kalau udah berurusan sama SEC di amrik",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aula ola",
      "created_time": "December 13, 2023, 03:29:10 AM",
      "body": "Quote from: fathafraink on June 13, 2023, 09:26:40 AMSaya ingin bertanya kepada agan-agan, khususnya yang sangat berpengalaman di dunia Crypto, saya ingin menanyakan, Kenapa token sekuritas ketika dinyatakan sebagai token Sekuritas oleh SEC harganya malah makin anjlok. Contohnya yaitu Solana yang mengalami penurunan 40% hanya dalam 1 minggu. Kenapa dan apa alasannya?, saya tidak paham, Sepemahaman saya token sekuritas itu aman karena bisa dibilang eligible dan jauh dari kemungkinan adanya \"SCAM\". Namun mengapa, kenapa token Eligible tersebut malah turun atau Anjlok ?https://i.ibb.co/bQQQKGV/Screenshot-4.pngsekuritas anjlok di sebab kan beberapa faktor salah satu nya dalam memperkembangkan asset sekuritas dengn cara tidak maksimal.di pasar crypto saat ini kita liat telah banyak hadir\\mendirikan token token terbaru di pasar crypto yang sangat berkembang dan poluller dan tidak kalah saing sama token tersebut.sekuritas bisa di simpulkan mengapa harga token tersebut anjlok di karna kan kalah saing sama token lainnya di pasar crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "December 14, 2023, 04:12:54 AM",
      "body": "Quote from: aula ola on December 13, 2023, 03:29:10 AMsekuritas bisa di simpulkan mengapa harga token tersebut anjlok di karna kan kalah saing sama token lainnya di pasar crypto.Kalau kalah bersaing itu sudah jelas gan, kan yang jadi pertanyaan di OP itu mengapa setelah dinyatakan oleh SEC itu malah anjlok, padahal kan kalau dipikir-pikir lagi, SEC itu kan lembaga yang berada di yuriksi pemerintahan terkuat dunia. Walau pun independent, tapi tetap saja SEC ini bertanggung jawab atas pengelolaan keuangan di AS. Jadi ya tetap jadi acuannya investor dong, dan malah bisa menambah volume suatu token itu sendiri. Kalau ane berpendapat sih itu hanya sementara saja, mungkin bertepatan dengan apa yang dinamakan fase bearish. Lihat saja sekarang bagaimana semua token dan coin mengikuti pergerakan harga bitcoin, artinya, apa yang yang kamu quote kemaren itu terdapat perbedaan waktu yang signifikan dengan sekarang,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}