{
  "id": "topic_5417103",
  "title": "Andzi",
  "author": "Andzi",
  "created_time": "October 14, 2022, 01:28:10 PM",
  "content": "Hello all! Just starting out in the crypto space, I'm currently studying Blockchain Development at Uni. I'm very interested in learning anything I can about the subject and I eventually found my way here.I know the basics of blockchain and writing code for it but I am at a loss for any real litterature on the subject.So my question is, can anybody recommend a good book on the subject, YouTube vids and online bootcamps only go so farand all my courses are using webpages as source material. I love a good read and would love if there are some book worms out there who have found out what's good. My recommendation is Blockchain Development Philosophy by Kalle Rosenbaum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417103",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "October 14, 2022, 10:29:28 PM",
      "body": "There are lots of sources to learn about blockchain in many different languages ill give you a few links below where you can learn more about Bitcoin and blockchain.- https://github.com/yjjnls/awesome-blockchain- https://github.com/hitripod/awesome-blockchain- https://github.com/openblockchains/awesome-blockchainsAnd the last link above would be the best source because it includes a DIY blockchain guide in different languages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 14, 2022, 11:00:11 PM",
      "body": "There's Ratimov's thread created last year a huge list of blockchain books. Big Library of Bitcoin & Blockchain BooksThere's a title there and the author that you'll surely easy to find out which you like. Quote from: Andzi on October 14, 2022, 01:28:10 PMMy recommendation is Blockchain Development Philosophy by Kalle Rosenbaum. A computer scientist?  Not bad, it's an interesting one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 15, 2022, 05:05:20 AM",
      "body": "I haven't read them because I'm not super technical, but I've heard good things about Andreas Antonopoulos' Mastering Bitcoin[1] and Jimmy Song's Programming Bitcoin[2].[1] https://aantonop.com/books/mastering-bitcoin/[2] https://programmingbitcoin.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Andzi",
      "created_time": "October 15, 2022, 06:47:13 AM",
      "body": "Aweei! Thanks to all of you! Im going to have reads for weeks! BTCBTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "October 15, 2022, 10:15:58 AM",
      "body": "Quote from: Andzi on October 14, 2022, 01:28:10 PMI love a good read and would love if there are some book worms out there who have found out what's good. Let me also recommend this from the threads on the forum with huge number of books listed for suggestion to read about https://bitcointalk.org/index.php?topic=5395652.msg59934528#msg59934528 i believe you could find some resourceful materials in there as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}