{
  "id": "topic_5436586",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "January 24, 2023, 10:54:11 AMLast edit: January 25, 2023, 02:21:15 PM by DdmrDdmr",
  "content": "Bajo un punto de vista de márketing, no está mal la idea: Una serie de patrocinadores han participado para cargar una wallet con 0,03453 BTC (3,453,443 sats), con una semilla de 12 palabras asociada + 1 passphrase.  Desde ayer, 23/01/2023, y durante una semana, los partners irán indicando algún término de los 13 precisos para poder abrir la wallet y llevarse su botín. Las palabras serán indicadas de manera aleatoria en el Twitter de alguno de los partners (supongo que cada uno anuncia un término) con el hashtag #HuntingSats. Las palabras también se anuncias (aunque puede que con mayor retraso) en la web oficial del evento.Entiendo que las palabras no se dan en orden, sino que el orden es aleatorio, y que la passphrase se reconocerá por ser una palabra o secuencia que no forma parte de las 2048 palabras bip-39.Siendo así, si todo es aleatorio, aun sabiendo los 13 términos, la probabilidad de acertar el orden es de uno en :P(12,12) = 12! / (0!) = 12! = 479.001.600Estoy asumiendo que la passphrase se distinguirá, y por tanto ya va fijo como el último elemento (luego queda por permutar 12 elementos sin repetición).Se espera fuerza bruta en algún punto ...  Las primeras palabras publicadas han sido las siguientes:BLAST (por cryptosteel -> ver video https://twitter.com/cryptosteel/status/1617532574045192194)HOLLOW (Coinkite)Ver:https://www.criptonoticias.com/comunidad/descifras-semilla-recuperacion-ganas-usd-700-bitcoins/https://twitter.com/wasabiwallet/status/1617522199342239744https://twitter.com/search?q=HuntingSats&src=typed_query",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436586",
  "comments": [
    {
      "author": "famososMuertos",
      "created_time": "January 25, 2023, 01:58:39 PM",
      "body": "Y bueno!! esto si que no es dinero muerto en Twitter, que tiene su trabajo, si se tienen los recursos de Hardware y tiempo va tener la eficacia, pero seguramente alguien con semejantes recursos no mire este tipo eventos o juegos.Seguramente terminen dando pistas adicionales...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "January 25, 2023, 02:29:36 PM",
      "body": "Aquí no sé si alguien tiene experiencia con fuerza bruta (me suena que quizás Seoincorporation), pero sería un ejercicio interesante cuando se tengan todas las palabras. Dudo que nadie lo intente con menos palabras, donde además de las permutaciones, habría que probar uno de los huecos con un término desconocido dentro de un diccionario de 2048 posibilidades (menos las que ya se tienen, al no poder repetirse).He leído que sí, darán pistas si efectivamente nadie lo acierta aun teniendo todas las palabras (en desorden).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}