{
  "id": "topic_5497318",
  "title": "xiver88",
  "author": "xiver88",
  "created_time": "May 21, 2024, 11:27:53 PM",
  "content": "Hey guys. I don't want to sell my btc, but I need some money for my family vacation. I looked around several DeFi platforms where I can lock wrapped BTC and get stablecoins, also looked to companies like SALT and Unchained. I don't like 2 things: high interest rate and liquidations. Anyone took BTC backed loans? What is your experience?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5497318",
  "comments": [
    {
      "author": "CODE200",
      "created_time": "May 22, 2024, 04:54:23 AM",
      "body": "First time that I've heard of such thing, I think that it's a good idea but I haven't tried it yet, probably the closest that I've ever had this is with asking for a big loan from one of my friends to pay for something personal and I made my bitcoins at that time a collateral for the loan, there was some interest though it's not as high as you might consider with your situation. Whatever you're planning to do, make sure to get the lowest rates because you don't exactly know how you'll pay for that loan. It's also understandable that they will do this kind of thing with bitcoin involved loans, there's not a lot of options so they can just charge whatever interest that they feel like is the most justified.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "May 22, 2024, 05:35:07 AM",
      "body": "Quote from: xiver88 on May 21, 2024, 11:27:53 PMHey guys. I don't want to sell my btc, but I need some money for my family vacation. I looked around several DeFi platforms where I can lock wrapped BTC and get stablecoins, also looked to companies like SALT and Unchained. I don't like 2 things: high interest rate and liquidations. Anyone took BTC backed loans? What is your experience?I love family vacays. It is always a refreshing, relaxing, and bonding time. Okay. Personally, I have no experience with BTC backed loans, but I got the time to read up on it during the bankruptcy case that came up against Celsius and heard the stories of those who borrowed against bitcoin pre-bankruptcy case. One of the things they loved about Celcuis over their competitors was they had lower interest rates compared to other platforms. One person in particular didn't like that to borrow against bitcoin, one has to lock in more bitcoins than the amount you have to borrow. But I understand, because the borrower gotta be protected against market volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harapan",
      "created_time": "May 22, 2024, 05:42:48 AM",
      "body": "Quote from: CODE200 on May 22, 2024, 04:54:23 AMFirst time that I've heard of such thing, I think that it's a good idea but I haven't tried it yet, probably the closest that I've ever had this is with asking for a big loan from one of my friends to pay for something personal and I made my bitcoins at that time a collateral for the loan, there was some interest though it's not as high as you might consider with your situation. Whatever you're planning to do, make sure to get the lowest rates because you don't exactly know how you'll pay for that loan. It's also understandable that they will do this kind of thing with bitcoin involved loans, there's not a lot of options so they can just charge whatever interest that they feel like is the most justified.BTC loans that quite weird to me,but I think I've seen that borrowing crypto on Binance is easy that you'll use your cryptocurrency as collateral to get a loan instantly without credit checks.I don't really understand it although but getting a loan from BTC is the same as getting a loan from fait and dollars as well.It entails some differences,Just like you would do for a bank loan, you will need to make an application and provide the collateral together with the terms and conditions applied.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "May 22, 2024, 05:43:04 AM",
      "body": "I wouldn’t touch any of these platforms tbh. If you need FIAT just sell your other assets if you have any. If you have everything in btc, then you are doing it wrong anyway. You need to diversify your wealth into different assets  and you should definitely hold some FIAT. 10% is a good start and 15% ideal imo. Not too much, not too less. It won’t drag your portfolio down and it will have enough buying power to purchase a vacation or some health emergency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "May 22, 2024, 06:03:19 AM",
      "body": "Quote from: xiver88 on May 21, 2024, 11:27:53 PMHey guys. I don't want to sell my btc, but I need some money for my family vacation. I looked around several DeFi platforms where I can lock wrapped BTC and get stablecoins, also looked to companies like SALT and Unchained. I don't like 2 things: high interest rate and liquidations. Anyone took BTC backed loans? What is your experience? Yeah it's the right decision go ahead at last all we want is some good time with our family and that's why it really matters , all the money the efforts and the time we are investing is for these good times.And what you have thought it is good don't worry it'll not effect the worth of BTC in your wallet much. Just go ahead and have a good time don't think too much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "May 22, 2024, 06:07:46 AM",
      "body": "I never take any Bitcoin backed loans, so I didn't have any experience with that.But, there's a good thing for you, you can ask a loan in this forum, just post the amount you required, rate, how long the loan and mention if you use Bitcoin as the collateral, post on this section Lending",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "May 22, 2024, 06:15:36 AM",
      "body": "Quote from: harapan on May 22, 2024, 05:42:48 AMQuote from: CODE200 on May 22, 2024, 04:54:23 AMFirst time that I've heard of such thing, I think that it's a good idea but I haven't tried it yet, probably the closest that I've ever had this is with asking for a big loan from one of my friends to pay for something personal and I made my bitcoins at that time a collateral for the loan, there was some interest though it's not as high as you might consider with your situation. Whatever you're planning to do, make sure to get the lowest rates because you don't exactly know how you'll pay for that loan. It's also understandable that they will do this kind of thing with bitcoin involved loans, there's not a lot of options so they can just charge whatever interest that they feel like is the most justified.BTC loans that quite weird to me,but I think I've seen that borrowing crypto on Binance is easy that you'll use your cryptocurrency as collateral to get a loan instantly without credit checks.I don't really understand it although but getting a loan from BTC is the same as getting a loan from fait and dollars as well.It entails some differences,Just like you would do for a bank loan, you will need to make an application and provide the collateral together with the terms and conditions applied.There's such a thing in Binance, I've been using Binance ever since until their closure here in my country and never knew of that feature, I guess I didn't really use it for too long that I would discover such things, I only use Binance to do P2P after all and now that I know of this one, I hope that we can have Binance available here in my country and look for that loan section. How's the interest in that one though?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "May 22, 2024, 06:16:23 AM",
      "body": "Quote from: xiver88 on May 21, 2024, 11:27:53 PMHey guys. I don't want to sell my btc, but I need some money for my family vacation. I looked around several DeFi platforms where I can lock wrapped BTC and get stablecoins, also looked to companies like SALT and Unchained. I don't like 2 things: high interest rate and liquidations. Anyone took BTC backed loans? What is your experience? I don't know if there is any such thing as bitcoin backed loans but I can speak of using your bitcoin as collateral when borrowing from someone who knows the values of your bitcoin but perhaps a lot of people wouldn't want that to be the case because it's might be hard to be sure you're the right owner of the assets in a wallet if evidence not tendered. High interest rates and liquidation are the side effects of taking loans from those Defi so if you don't have any other source then you're left with no option than to take their offers. But why would you have extra funds to fund your lifestyle? It's absolutely against the methodologies which we have in bitcoin AFAIK, you must have at least an emergency funds that can last for at least 3 - 6 months and if you did that you wouldn't be caught out with situations like this, and perhaps it seems yiu don't have another source of income to facilitate your desires, the solution here is find someone closer loan/ borrow from em then you pay back when the time is due.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HideYourKeys",
      "created_time": "May 22, 2024, 06:17:34 AM",
      "body": "I have never tried these loans yet... But if you can repay the loan in the currency you borrowed, (usually dollars or another fiat currency), it could be a good option. I guess that the Bitcoin you used as collateral is returned to you once you fully repay the loan and any interest... If you default on the loan, the lender may liquidate your Bitcoin to cover the amount owed. If you trust the lender as well... It could be a worth a try",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 22, 2024, 06:25:16 AM",
      "body": "Quote from: xiver88 on May 21, 2024, 11:27:53 PMHey guys. I don't want to sell my btc, but I need some money for my family vacation. I looked around several DeFi platforms where I can lock wrapped BTC and get stablecoins, also looked to companies like SALT and Unchained. I don't like 2 things: high interest rate and liquidations. Anyone took BTC backed loans? What is your experience?Bitcoin has a volatile price and it's not suitable for a collateral, even though some lenders might accept it as a collateral.I've never tried borrowing crypto because I don't need loans. I'm pretty OK financially and I hate being in debt.Nobody is going to give you low interest rates, when it comes to borrowing/lending cryptocurrencies. The risk is higher, so the interest rates are higher as well. I remember some BTC lending platforms from 5 years ago(Like BTCJam, if I remember the name correctly), but all of them disappeared. I assume that the crypto lending business model isn't sustainable in the long run.Why don't you try to get fiat loan or a credit card?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoinaditya",
      "created_time": "May 22, 2024, 06:26:32 AM",
      "body": "There are a few platforms that offer such loans. If you look online, you will find them. But if the amount is small, you can consider taking a fiat loan and HODL your Bitcoins. The interest rates you pay on fiat will be significantly lesser than your gains on Bitcoin holdings. Hope this helps. - Aditya, The Bitcoin Guy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "May 22, 2024, 09:11:54 AM",
      "body": "Sounds very risky to me. Many DeFi have questionable decentralization, while Wrapped Bitcoin require you to trust company behind it. I'm not expert, but have you looked for loan offered by conventional banking/financial service? Depending on where you live and financial condition, you could get offer which doesn't require collateral.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khalidkhan82118",
      "created_time": "May 22, 2024, 10:24:41 AM",
      "body": "Quote from: xiver88 on May 21, 2024, 11:27:53 PMHey guys. I don't want to sell my btc, but I need some money for my family vacation. I looked around several DeFi platforms where I can lock wrapped BTC and get stablecoins, also looked to companies like SALT and Unchained. I don't like 2 things: high interest rate and liquidations. Anyone took BTC backed loans? What is your experience?Taking a Bitcoin-backed loan can be a good way to access cash without selling your BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "May 22, 2024, 10:43:54 AM",
      "body": "You can do this easily via the Binance, KuCoin, or other popular exchange platforms that provide lending features. They will give you a loan quickly with just your Bitcoin as collateral, and you can immediately get the money directly into your account. However, entrusting your Bitcoin to a third party means you lose control of your Bitcoin, and whenever they change their rules, your assets could be affected. So consider again if you want to borrow from a third party with your Bitcoin as collateral, because if you don't understand the risks then you will be the one who will be harmed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "May 22, 2024, 11:07:02 AM",
      "body": "Quote from: CODE200 on May 22, 2024, 04:54:23 AMFirst time that I've heard of such thing, I think that it's a good idea but I haven't tried it yet, probably the closest that I've ever had this is with asking for a big loan from one of my friends to pay for something personal and I made my bitcoins at that time a collateral for the loan, there was some interest though it's not as high as you might consider with your situation. Same here. I do not have personal experience with how op wants to have a loan but from research it seems that it depends on the platform you’ll be using the interest rates. Some would have higher rates while some would have lower.Taking loans from personal friends or family members might be good but also pose some serious risks. For instance, due to personal relationships they can consider a lower interest rate. However this whole business might come in a way of your relationship. Do what you think is best for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "May 22, 2024, 11:14:07 AM",
      "body": "Quote from: xiver88 on May 21, 2024, 11:27:53 PMbut I need some money for my family vacation.First thing I want to ask you.  Is this REALLY a priority, can you not live with out this vacation while trying to save more Money for the next one?Quote from: xiver88 on May 21, 2024, 11:27:53 PMI looked around several DeFi platforms where I can lock wrapped BTC and get stablecoins, also looked to companies like SALT and Unchained.I would personally not trust my Bitcoin with these.  Wrapped Bitcoin is not Bitcoin.  I would keep my Bitcoin in my Bitcoin Wallet only.  Not locked up on some Shit Coin platform that promises to give me returns.Is there no way you can get money other than throwing your Bitcoin into the pot?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 22, 2024, 12:47:09 PM",
      "body": "Quote from: xiver88 on May 21, 2024, 11:27:53 PMHey guys. I don't want to sell my btc, but I need some money for my family vacation. I looked around several DeFi platforms where I can lock wrapped BTC and get stablecoins, also looked to companies like SALT and Unchained. I don't like 2 things: high interest rate and liquidations. Anyone took BTC backed loans? What is your experience?Centralized exchanges have this feature so check it out with Binance and other popular ones like Bybit. I've checked what bybit has to offer and they've got flexible terms of payment.But you might be surprised with the interest rate that they're going to give you. For 7 days of payment term, you'll already getting 20%+ of interest rate.And more with the longer payment term.https://www.bybit.com/en/trade/spot/loanAnyway, this is more than a tip. If you can't afford to get into vacation because you are lack of funds, don't go and save more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "May 22, 2024, 01:18:43 PM",
      "body": "Quote from: btc78 on May 22, 2024, 11:07:02 AMQuote from: CODE200 on May 22, 2024, 04:54:23 AMFirst time that I've heard of such thing, I think that it's a good idea but I haven't tried it yet, probably the closest that I've ever had this is with asking for a big loan from one of my friends to pay for something personal and I made my bitcoins at that time a collateral for the loan, there was some interest though it's not as high as you might consider with your situation. Taking loans from personal friends or family members might be good but also pose some serious risks. For instance, due to personal relationships they can consider a lower interest rate. However this whole business might come in a way of your relationship. Do what you think is best for you. The matter of loans when it comes to your relatives or friends is from the fact that you're going to not just be loaning their money but also their trust of you and it's a really difficult thing to break for you because once you do break it, it's over for you, that trust won't be mended so easily once broken, that's why loans should be the least of your priorities, as best as you can, you should never consider it if you can find a way for yourself to make some money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "May 22, 2024, 03:16:11 PM",
      "body": "I suppose it really depends on a country one's from and the local culture there, but the idea of taking a loan to go on a vacation sounds kind of wild to me. I mean, I understand the desire to go on a vacation, and I understand that sometimes money can be tight while you also don't want to miss opportunities to share experiences with your loved ones. But taking a loan for that, knowing that you'd have to pay it back, would make me nervous about going, and the op even has the funds to avoid taking loans but simply doesn't want to sell BTC for that. I think it's better to sell and go and not worry about debt later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}