{
  "id": "topic_5407322",
  "title": "Oluwa-btc",
  "author": "Oluwa-btc",
  "created_time": "July 23, 2022, 07:23:03 AM",
  "content": "Following gas cuts by Russia, the European Union is looking to Nigeria as an alternative to augment its gas needs.The Deputy Director-General of the European Commission’s Department of Energy, Matthew Baldwin, said Friday “Europe is in a tight spot in relation to gas following the Russian invasion of Ukraine and instability in our gas market, the threat perhaps to cut off supply altogether.”Mr Baldwin, who visited Abuja, told journalists that the EU is looking to increase Liquified Natural Gas (LNG) imports from Nigeria to above the current levels.Nigeria currently supplies 14 per cent of the EU’s gas imports, while 60 per cent of the entire shipments of LNG from Nigeria goes to Europe, he said.“We want to expand what is currently at 14 per cent share of total LNG.https://www.premiumtimesng.com/business/business-news/544394-european-union-seeks-more-gas-imports-from-nigeria.html?s=09https://www.nairaland.com/7242241/eu-looks-nigeria-gas-replace?utm_source=dlvr.it&utm_medium=twitter&s=09Bad Governance will still be an issue here, not for the Europeans but 4 Nigerians and her citizens. Most Refining Petroleum Companies have been dormant for a while since this year. E.g Port Harcourt/ Eleme Refinary haven't done shit as far as I know.  Talks about it's partnership should commence from August.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407322",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 23, 2022, 07:54:56 AM",
      "body": "I do not read much about the present Ukraine war any longer if compared to two or three months when the war started, but as at then, I have been reading news concerning the countries that European Union will export more gas from and some of the countries are from Africa, especially Nigeria, Libya and Egypt. These countries are supplying EU before but there would be increase in the supply of gas to EU.Ukraine crisis: Can Africa replace Russian gas supplies to Europe?According to what I read in the past, that the supply from Africa may not be enough for EU, so seen a proposal for the supply to be increased is not a surprise, this will help Nigeria economy. Quote from: Oluwa-btc on July 23, 2022, 07:23:03 AMBad Governance will still be an issue here, not for the Europeans but 4 Nigerians and her citizens. Most Refining Petroleum Companies have been dormant for a while since this year. E.g Port Harcourt/ Eleme Refinary haven't done shit as far as I know.  Talks about it's partnership should commence from August.It is far more than 10 years ago that largest Nigerian refineries have not been functional. Presently today, Nigeria export crude oil and import refined oil by-products from outside Nigeria, that has been a curse on the country as a result of mismanagement. I do not even hear much about Dangote Lekki refinery any longer, which suppose to be the largest refinery in Africa if the refinery is fully operational Also because of petroleum, Nigeria diverted their productivity away from Agriculture and export of some natural resources like coal deposit in Enugu. But the worst part of it is that Nigeria is not growing in technology which makes the future of the country have little or retarded development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "July 23, 2022, 07:56:21 AM",
      "body": "The EU are searching for alternatives to Russian gas, gas is a major player in this war between Ukraine and Russia, with Russia using Europe's dependence on its gas to escape some more threatening sanctions, and also to keep their economy going, needless to say that is why they now want only their currency, the rubles, to be the only currency used when buying gas from them.The problem for the EU is if they will be able to get enough alternatives that will be sufficient to supply gas to them, it won't be easy, breaking off dependency is always hard, not only in this situation. Gas will continue to be scarce for a long while, and it will be expensive to purchase, a total removal of dependency on Russian gas might even take many years, and in those years there will be problems coping with demand for gas.Though the EU has to try, Nigeria can be a good option for them if they explore the opportunities properly, other alternatives too; the EU just has to try, i am sure they are not only thinking of now, it is unpredictable what can happen in some years time, they wouldn't want a similar thing to happen some years from now where Russia takes another harsh action, and everyone has to dance to their tune because they supply you most of your gas. This is proactive measures i think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "July 23, 2022, 08:51:19 AM",
      "body": "Russian gas, in fact, has become a new \"economic weapon of mass destruction\" ... This is how Russia wanted to do it. Well, the country is a terrorist - it's stupid to expect something else from it!But it turned out that this is more like mining your house, and shouting \"if you do not agree to our conditions now, we will blow it up!\" Why ? And here's why! This is not what Ukrainian politicians or journalists are talking about (who can be suspected of some kind of propaganda), but the EU is talking about it. And he says the following: \"Russian gas not bought by Europe is tearing the gas industry of Russia from the inside! Gazprom, from March 2022 to today, has already reduced gas production by 15%. Gas storage facilities are almost fully loaded, soon Russia will be forced to mothball wells.\"At the same time, the EU, in addition to finding new suppliers, including Nigeria, adopts a resolution on a 15% reduction in the consumption of Russian gas. For review link: https://ec.europa.eu/commission/presscorner/detail/en/IP_22_4608Nigeria in this situation has a great chance to provide itself with high-quality contracts for the supply of gas to the EU for many decades, which will allow it to continue to actively develop and become a leader in the region!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 23, 2022, 09:50:41 AM",
      "body": "I have expected this to happen since the Russian and Ukrainian war started and the supply of gas and crude was cut off from Europe by Russia. Surely Europe can't stay comfortably without warning their houses. Africa and Asia seem to be the option for Europe but that visit to Nigeria by the commission says it all that Nigeria has been found as the preferred choice. This is suppose to make Nigeria to increase in gas production and it is also suppose to increase her national income but the refineries are not functional and most of the crude is still refined outside the shores of Nigeria. Nigeria is the 6th largest producer of crude but it has not reflected in her economy because refineries are not functioningThis is still not going to make more of a common sense where crude will be processed out of the country and the by products are still imported to the country as finished products. It is disheartening in Nigeria the way the government has managed her affairs and incentives that are suppose to be an advantage to the economy won't reflect that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "July 23, 2022, 10:07:04 AM",
      "body": "Quote from: Gozie51 on July 23, 2022, 09:50:41 AM the supply of gas and crude was cut off from Europe by Russia.It is the EU that does not want to buy gas from Russia; Russia does not cut anything off from the EU.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 23, 2022, 10:23:54 AM",
      "body": "Quote from: VKcams.com on July 23, 2022, 10:07:04 AMYou chose to believe the lying narrative. I guess it help you sleep better.However, you're off topic here.Quote from: DrBeer on July 23, 2022, 08:51:19 AMRussian gas, in fact, has become a new \"economic weapon of mass destruction\" ...The Russians thought that Europe will turn a blind eye on the war, like they did with Crimea, to keep them connected to the pipe.Also they've made it overly expensive (to finance the war), forgetting that on such prices other sources can easily become attractive.Quote from: Oluwa-btc on July 23, 2022, 07:23:03 AMNigeria currently supplies 14 per cent of the EU’s gas imports, while 60 per cent of the entire shipments of LNG from Nigeria goes to Europe, he said.I guess than only the LNG part can be expanded; the pipes for actual gas are long and might need developed more, and that's overly costly.However, it can easily be a good move for both Nigeria and Europe. And even if the current govt doesn't do great there, there's always hope the next one will do better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "July 23, 2022, 10:53:51 AM",
      "body": "Quote from: NeuroticFish on July 23, 2022, 10:23:54 AMQuote from: VKcams.com on July 23, 2022, 10:07:04 AMYou chose to believe the lying narrative. I guess it help you sleep better.However, you're off topic here.Uncle, who imposed sanctions on whom?\"Oil and gasRussia is thought to have earned nearly $100bn (£82.3bn) from oil and gas exports during the first 100 days of the war.Sanctions targeting its exports have been announced:The European Union (EU) says it will ban all imports of oil brought in by sea from Russia by the end of 2022The US is banning all Russian oil and gas importsThe UK will phase out Russian oil imports by the end of 2022Germany has frozen plans for the opening of a major gas pipeline from RussiaThe EU said it will halt Russian coal imports by AugustThe EU is less keen to impose sanctions on Russian gas, because it relies on it for about 40% of its gas needs.In March, it said it would reduce gas imports by two-thirds within a year, but has not agreed further action.\"https://www.bbc.com/news/world-europe-60125659",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 23, 2022, 12:10:27 PM",
      "body": "Quote from: VKcams.com on July 23, 2022, 10:07:04 AMIt is the EU that does not want to buy gas from Russia; Russia does not cut anything off from the EU.According to what I read some days ago:Since Russia invaded Ukraine it has cut supplies to a number of countries which have rejected its demand for payment for gas in roubles, including Poland, Bulgaria, the Netherlands, Denmark and Finland.EU were not paying in Rubles before, Russia want to force EU to pay in Rubles, EU do not want to pay in Rubles. Then Russia do not want to supply. I also read a news related to how Russia is not supply gas to Germany through the Nord Stream 2, but said to be under maintenance.Germany fears Russia might not resume service after gas supply halts for repairsNord Stream 2: US and Germany reach deal on controversial Russian gas pipelineRussia Resumes Nord Stream Gas Flow, Bringing Europe RespiteThe last I read was that Russia has begun to supply gas through the Nord Stream 2 again. But we all know how that might be related to the war, or maybe not.Just brought this up to see if your claim is true or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "July 23, 2022, 12:30:08 PMLast edit: July 23, 2022, 01:05:01 PM by VKcams.com",
      "body": "Quote from: Charles-Tim on July 23, 2022, 12:10:27 PMThe last I read was that Russia has begun to supply gas through the Nord Stream 2 again. But we all know how that might be related to the war, or maybe not.Just brought this up to see if your claim is true or not.10 EU countries pay safely in rubles.Nord Stream 2 is blocked by Germany, they don't give a certificate.Nord Stream works, but it lacks a turbine.This pipeline was on a planned technical shutdown, everyone concerned knew about it. But someone started the hysteria.Don't confuse the two different pipelines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeavensPro",
      "created_time": "July 23, 2022, 01:21:18 PM",
      "body": "Nigerian gas may close the supply gap, but it will definitely not be a full-fledged replacement, since the EU bought gas from Russia at the best price on the market. Even if the volumes are the same, the price will obviously be higher, which will also be a cause for dissatisfaction",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 23, 2022, 01:35:41 PM",
      "body": "Quote from: HeavensPro on July 23, 2022, 01:21:18 PMNigerian gas may close the supply gap, but it will definitely not be a full-fledged replacement, since the EU bought gas from Russia at the best price on the market. Even if the volumes are the same, the price will obviously be higher, which will also be a cause for dissatisfactionIt is difficult to expect that anyone will be able to offer the price of gas that the EU paid (and still pays) to Russia and which is delivered by gas pipeline. Everything that comes by sea is of course more expensive because the gas must be converted into a liquid for transport and then converted back into gas in the LNG terminal. The EU is looking for gas everywhere, so Canada has been mentioned as one of the possible partners for some time, although agreements have yet to be reached. However, regardless of all the negotiations, next winter in the EU we will face restrictions, because it is not realistic to fill the underground storages to the appropriate capacity in such a short period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 23, 2022, 01:48:27 PM",
      "body": "Quote from: HeavensPro on July 23, 2022, 01:21:18 PMNigerian gas may close the supply gap, but it will definitely not be a full-fledged replacement, since the EU bought gas from Russia at the best price on the market. Even if the volumes are the same, the price will obviously be higher, which will also be a cause for dissatisfactionThe volumes will most probably also not be the same. And I find this a bigger problem than the prices.The international prices have skyrocketed anyway for no reason: the gas hasn't change, just the Russians have decided to ask more for it (and in their unrealistically \"strong\" fiat too).Imho the more sources the better: let there be competition. We can see where allowing the (Russian) monopoly got us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "July 23, 2022, 03:54:34 PM",
      "body": "Am I the only one to whom this idea seems absurd if it is expected to be realized in the near future? How long will it take to lay the pipes and build the stations? If obtaining licenses from transit countries alone may cost years, then how is the case with energy companies that may not have the capacity to bear such a huge project, especially if we exclude from them the Russian and Chinese companies, which will not support the idea in any case and will therefore not stand by and watch the path of their interests It turns towards the south of the globe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 23, 2022, 04:01:33 PM",
      "body": "Quote from: Charles-Tim on July 23, 2022, 07:54:56 AMUkraine crisis: Can Africa replace Russian gas supplies to Europe?According to what I read in the past, that the supply from Africa may not be enough for EU, so seen a proposal for the supply to be increased is not a surprise, this will help Nigeria economy. Isn't Nigeria already in the bag with China (as in they already do major business with them), so a comparable oil trade with the EU is out of the question? At least that is what I can infer with the other African countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "July 23, 2022, 04:16:18 PM",
      "body": "Quote from: NeuroticFish on July 23, 2022, 10:23:54 AMI guess than only the LNG part can be expanded; the pipes for actual gas are long and might need developed more, and that's overly costly.However, it can easily be a good move for both Nigeria and Europe. And even if the current govt doesn't do great there, there's always hope the next one will do better.Yeah they can be developed since not really having a higher standard and as equipped as they should be. Transportation of this gas across won't be a drawback as they would be reduced. I pray and hope that funds and revenues generated from this are well circulated and allocated tod the masses and not  to them selfish leaders ( we hope for a better change we have always envisaged since the Endsars protests ).LNG and Nigerian Securities are also doing well to keep off and combat Anti-.Pipeline Vandalism in some areas with big trace of Crude oil.Resides close to a Refinary Company so I have seen all of these acts carried out. But ditching Russians Gas and oil will still take some time. Good to see how Europeans are improvising. Lately, POTUS also paid visit to Saudi Arabia, seems like it should be Gas related.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "July 23, 2022, 05:30:59 PM",
      "body": "Quote from: VKcams.com on July 23, 2022, 10:07:04 AMQuote from: Gozie51 on July 23, 2022, 09:50:41 AM the supply of gas and crude was cut off from Europe by Russia.It is the EU that does not want to buy gas from Russia; Russia does not cut anything off from the EU.It is not that they do not want to buy from Russia, they are forced by what Russia are doing. Why fund a WAR by buying oil from Russia, that might end up at their door step in the future. It was a collective decision from a lot of countries not to buy from Russia... so they are keeping their promise. Also, why should you buy from a country that are at war.... when you can buy from other countries where they have a stable economy and also a solid political stance on that war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "July 23, 2022, 06:18:19 PM",
      "body": "Quote from: Kakmakr on July 23, 2022, 05:30:59 PMAlso, why should you buy from a country that are at war.... when you can buy from other countries where they have a stable economy and also a solid political stance on that war.  Are you talking about Nigeria now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "July 23, 2022, 06:49:56 PM",
      "body": "Quote from: Kakmakr on July 23, 2022, 05:30:59 PMAlso, why should you buy from a country that are at war.... when you can buy from other countries where they have a stable economy and also a solid political stance on that war.  Because they'll surely benefit from it. Those gas will surely be at a lower rate since the country wants to dispose of it faster and get more funds to get their war machinery going. The Europeans aren't known for their righteousness anyways, so they'd still buy from a country that is at war with itself and get a better deal while they're at it.The only problem though is the proceeds on these purchase. Nigeria is known to be plagued with corrupt government officials, but I guess that is a problem that the country has to solve on its own and the Europeans couldn't care less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "July 23, 2022, 06:58:33 PM",
      "body": "Quote from: DrBeer on July 23, 2022, 08:51:19 AMAt the same time, the EU, in addition to finding new suppliers, including Nigeria, adopts a resolution on a 15% reduction in the consumption of Russian gas. For review link: https://ec.europa.eu/commission/presscorner/detail/en/IP_22_4608Shame on Robert Habek: no one wants to help him save energyQuoteThe EU Commission's plan to force member states to save energy turns out to be unrealistic just hours after the announcement. A number of EU countries are categorically against the idea put forward by Germany: Greece, Portugal, Poland, Cyprus, Hungary and Spain categorically reject the plan to collectively reduce energy consumption by 15 percent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}