{
  "id": "topic_5417480",
  "title": "ZBhouse",
  "author": "ZBhouse",
  "created_time": "October 18, 2022, 01:50:59 AM",
  "content": "原文連結：https://www.zb.house/state-of-tezos-q3-2022/【本文章轉載自鑄幣局 - 提供專業的加密貨幣行業的研究成果的分析平台。】关于Tezos的简单介绍Tezos是一个依靠低功耗和高能效共识的液体收购证明（LPoS）区块链网络。它将链上治理与自我修正功能相结合，以实现无桩网络升级和管理未来的变化。Tezos支持多种智能合约语言，有一个强大的NFT生态系统，并通过EVM和WASM兼容的滚动和数据可用性层的改进进行扩展。性能分析财务概览第二季度是过去十年来加密货币市场最糟糕的一个季度，加密货币市场总市值下降了58%。多个看跌事件同时发生，包括Terra LUNA崩溃，3AC破产，俄乌战争升级，以及美联储的鹰派。Tezos也未能幸免于这场大屠杀，按市值计算损失了61%的价值。在第三季度，Tezos通过31%的熊市反弹挽回了部分损失。然而，由于央行持续的鹰派言论，这种反弹是短暂的。最终，Tezos在本季度结束时接近开盘水平。与XTZ代币有关的内部指标是一致的，而以收入为中心的指标则大幅下降。在第三季度，Tezos的收入为19.1万美元（环比下降60%），流通的P/S比率为2,181倍。受欢迎的交易费用下降（58%）主要推动了收入的下降和交易量的小幅下降（6%）。作为比较，Avalanche第三季度的收入为230万美元，流通的P/S比率为665倍，Polkadot（特别是Polkadot Relay Chain）的收入为11.5万美元，流通的P/S比率为19,945倍。按照传统的标准，这些基础层中的每一个都有糟糕的指标。以收入为中心的糟糕指标与高估值相搭配，突出了评估底层协议的困难。XTZ是Tezos生态系统的原生代币，它有4.5%的平均年化膨胀率，没有最大供应量。XTZ也有多种烧毁机制，包括：在创建新的Tezos账户时，在创建新的智能合约时，在分配额外的智能合约存储时，以及在验证者失误时进行削减。代币的烧毁是故意的，没有实质意义；相反，它们的存在是为了抑制网络垃圾邮件和验证人的错误。到2022年，Tezos平均每月烧掉73,000XTZ（相当于每月新铸币供应的2%和总供应的0.01%）。网络概况总的来说，第三季度整个网络的活动减少。下降的情况分散在DeFi、游戏和NFT领域（更多内容见生态系统和发展部分）。从2022年的整体来看，网络使用量保持良好，而与账户相关的指标则稳步下降。网络活动的保持与用户的减少相搭配，表明活跃用户在网络上非常活跃。尽管如此，在第三季度，整体账户活动有所下降。被清空的账户，定义为被清空的账户，下降到2021年开始以来的最低水平。清空账户的减少是一个净利好，因为它表明离开网络的人越来越少。同时，新创建的账户减少到2021年开始以来的最低水平。总体而言，在过去七个季度中，新创建的账户有六个减少。在分析新账户创建时，有一些关键点需要注意。首先，所有在Tezos上创建的新账户必须支付少量的一次性费用，通常在0.25美元左右。该费用的存在是为了阻止人们通过创建多个新账户来破坏网络。此外，如果有人第一次获得Tezos资产，如NFT，但没有创建一个账户，他们将被排除在这个数据集之外。在评估跨生态系统的账户活动时，这些是需要考虑的重要因素。与账户相关指标不同，由智能合约调用和交易组成的网络使用量一直很稳定。智能合约调用被定义为从终端用户钱包到智能合约的直接调用。交易被定义为代币转移。在网络的大部分时间里，智能合约调用是总活动的一小部分。然而，从2021年第一季度开始，智能合约调用开始迅速增加。他们从每月不到10万次到2022年1月高峰时的360万次。这种上升始于第一个NFT平台Hic et Nunc的推出，并随着随后Tezos NFT牛市的到来而持续。相对而言，交易量一直很稳定。通过2022年的熊市，Tezos平均每月有130万笔交易，比2021年的牛市增加了25%。总体而言，在2022年期间，网络活动相对平稳，这可以说是熊市期间的一个净利好。6月，Tezos在雅加达升级期间发布了交易优化卷（TORU）。TORU是通过卷积进行扩展的第一步。作为一个漫长的路线图中的第一个产品发布，TORU是特意简化的，只允许交换资产。因此，预计采用率极低，因此，网络活动预计不会增加。在L-upgrade中即将发布的智能合约优化卷（SCORU）应该会启动活动。SCORUs将通过支持智能合约的执行和引入WebAssembly（WASM）的执行环境，极大地扩展卷积能力。本文總結及更多內容可詳見於：https://www.zb.house/state-of-tezos-q3-2022/【本文章轉載自鑄幣局- 提供專業的加密貨幣行業的研究成果的分析平台。】",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417480",
  "comments": []
}