{
  "id": "topic_5461689",
  "title": "Flexystar",
  "author": "Flexystar",
  "created_time": "August 01, 2023, 01:19:39 PM",
  "content": "In the recent news a crypto influencer named Richard Heart was sued by the SEC because he found guilty using the investors crypto fund to buy personal leisure's. This includes luxury car, 555 karat Enigma Diamond, luxury watches etc. When the estimate is calculated it comes to be around ~12 million in USD. The money trail is very simple. Heart published a brand new project under HEX business name that is unregistered and with the product PulseChain. This project is for the investors who wants to have wealthy lifestyle. As we know, crypto is full of interested people, and they ended up investing lot of money into the project. Heart successfully raised $1 billion through the project mentioned above. From this money he started buying the mentioned assets that includes:$534,916 McLaren sports car, $314,125 Ferrari Roma, $1.38 million Rolex watch,$5 million The Enigma Diamond. This is really bad news in the crypto sphere and influencers clearly seen very greedy in this case scenario. He literally did not even care that this is someone else money that was put into his business to grow it and have some returns for doing so. This is what caused SEC to file the lawsuit against Richard Heart and that I think was the right decision whatsoever. QuoteCrypto influencer Richard Heart is facing a lawsuit from the Securities and Exchange Commission over claims he used “at least” $12 million in proceeds from his crypto products to buy luxury products. That includes the purchase of sports cars, luxury watches, and a 555-carat black diamond called The Enigma — supposedly the largest in the world.Heart was born in the US and currently lives in Finland. He has operated a YouTube channel since 2017, where he promotes his own crypto products, including the Hex token and its sister product PulseChain, which operates on the PulseX protocol.In its lawsuit, the SEC alleges Heart raised over $1 billion through his unregistered Hex, PulseChain, and PulseX crypto securities. According to the SEC, Heart marketed his products as “a pathway to grandiose wealth for investors” and espoused claims that Hex “was built to be the highest appreciating asset that has ever existed in the history of man.”While Heart said the investments in his products were for promoting “free speech,” the SEC claims he never revealed that he actually spent “millions of dollars of PulseChain investor funds to buy luxury goods for himself.” Some of those purchases include a $534,916 McLaren sports car, a $314,125 Ferrari Roma, and a $1.38 million Rolex watch. In February 2022, he allegedly spent $5 million of investors’ assets to purchase The Enigma.Additionally, the lawsuit states that from December 2019 to November 2019, Heart accepted over 2.3 million Ethereum valued at around $678 million in exchange for Hex tokens. However, the SEC claims 94 to 97 percent of these ETH deposits were “recycling” transactions that allowed Heart and other insiders to control “a large number of Hex tokens” while also “creating the false impression of significant trading volume and organic demand.”“Heart called on investors to buy crypto asset securities in offerings that he failed to register. He then defrauded those investors by spending some of their crypto assets on exorbitant luxury goods,” said Eric Werner, the director of the SEC’s Fort Worth regional office. “This action seeks to protect the investing public and hold Heart accountable for his actions.”This follows a wave of lawsuits from the SEC that have unfolded over the past several months. In addition to a lawsuit against Binance and its CEO Changpeng Zhao, the SEC is also taking action against Coinbase and Tron founder Justin Sun. Out of all these lawsuits, though, this one stands out for the sheer amount of luxury items that Heart (allegedly) spent investors’ funds on.SEC sues crypto influencer for allegedly buying sports cars and a rare black diamond with investor funds",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461689",
  "comments": [
    {
      "author": "Cuenta Alternativa",
      "created_time": "August 01, 2023, 01:41:44 PM",
      "body": "I don't understand it very well, and I guess there is a lack of information, because you have to be very stupid to raise $1 billion and spend $12 million in customer luxury, instead of having taken that $12 million as profit in commissions or whatever (which would be 1.2%) and being able to spend it legally. I guess they see themselves on the crest of the wave and are overconfident that they can do whatever they want. Something like FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 01, 2023, 01:56:24 PM",
      "body": "I am pretty sure that if in  2019 the SEC had said something against Hex an army of useful idiots that can be bought with 2 shitcoins a piece would have gone on a rampage defending this reincarnation of Bitcoin Jesus and telling the government to fuck off as it's their money their shitcoins!I can't wait to see the Pickachu faces when that house of cards scams Binance goes down and what are all those asslickers going to do.QuoteThe SEC alleges that the funds raised for PulseChain development and marketing, or allegedly to support Heart's claim of fostering \"freedom of speech,\" were instead used for Heart's personal luxuries, including a 555-carat diamond, high-end timepieces, and premium vehicles.The usual story, tell the sheep you're fighting for their freedom while emptying their pockets.MagicalTux vibes!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 01, 2023, 04:37:29 PM",
      "body": "crypto influencers are people that promote a product of someone elses company.. this guy mentioned in OP being sued is a crypto ICO manager.. totally different situationdifferent charges compared to what some influencers get hit byEG kevin o'leary was an influencer of FTX's FTTEG ScamBankmanFraud was a ICO manager of FTX's FTT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "August 01, 2023, 04:52:32 PM",
      "body": "Quote from: Flexystar on August 01, 2023, 01:19:39 PMIn the recent news a crypto influencer named Richard Heart was sued by the SEC because he found guilty using the investors crypto fund to buy personal leisure's. This includes luxury car, 555 karat Enigma Diamond, luxury watches etc. When the estimate is calculated it comes to be around ~12 million in USD. It seems that you mischaracterized while creating a title for your topic, because Mr. Richard Heart is the owner of an investment project and is not influential on any of the social media. He was held accountable on the basis of his irresponsible behavior with the investors’ money, and not because he influenced them to deposit their money with him under the cover of the legitimacy of his project.This explains that it is not permissible to hold accountable those who influence using various means of communication, because their work ends with the end of the advertising campaign for which they were paid. If this were permissible, all advertising campaigns for projects that turned into scam or projects whose owners received criminal charges would have been tracked. Take the example of Chipmixer, whose servers have been seized by the authorities, and its owners are being tracked. Is it permissible to hold accountable the participants in the signature campaign that it was running here on the forum to promote the service?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 01, 2023, 05:10:08 PM",
      "body": "Quote from: Flexystar on August 01, 2023, 01:19:39 PMThis is really bad news in the crypto sphere and influencers clearly seen very greedy in this case scenario. He literally did not even care that this is someone else money that was put into his business to grow it and have some returns for doing so. This is what caused SEC to file the lawsuit against Richard Heart and that I think was the right decision whatsoever. I don't see it as a piece of bad news to the crypto space because a crime was dictated by the SEC and the person behind it will be persecuted. So it is a piece of good news that the people giving the crypto space a bad image is been identified and sued. This is another reason why people that want to make quick cash from the industry should have a rethink. There is also a need not to listen to all the hype from some of these celebrities that promote unverified projects because most of them are not genuine. If you don't do your research, regrets might be the outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 01, 2023, 05:18:50 PM",
      "body": "Such crypto influencers are damaging the reputation of Crypto and we should not support them and there projects. Well, HEX is apy platform where investors commit there money to earn more money by doing nothing instead they just risk there money with a centralized entity who them could blame. If things go side ways. So, investors should also chose platforms wisely and in other terms these APY providing platform aren't the one who use that money to make more profits then if the influencer had bought the assets then they are not any liabilities in my sight because he could still sell them to make profit.Other then just providing APYs he has HEX coin which is mineable i think. (i might took the whole things wrong here but please bear with me i am still learning). SEC is mostly right all the time about celebrities like last they sued some celebrities who tried to manipulate investor's interest towards Tron even the Tron CEO was also sued. IMHO, its a small case and will be dealt quickly as he (Heart) has many options to deal with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 01, 2023, 05:19:42 PM",
      "body": "Quote from: franky1 on August 01, 2023, 04:37:29 PMcrypto influencers are people that promote a product of someone elses company.. this guy mentioned in OP being sued is a crypto ICO manager.. totally different situationdifferent charges compared to what some influencers get hit byEG kevin o'leary was an influencer of FTX's FTTEG ScamBankmanFraud was a ICO manager of FTX's FTTThe difference is that Richard had not paid any sitting politician that could help him. Bankman did prepare for it to which his charges are absolutely dropped and are just in his house with some guards to secure his safety so that no disgruntling investors will visit him. Heart is a sitting duck and its gonna be more than 12M will be taken from him and all the HEX shitcoin holders will shit themselves seeing the price down the hole. Gensler needs a lot o money to find more like him in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 01, 2023, 06:19:28 PMLast edit: August 01, 2023, 10:52:45 PM by franky1",
      "body": "Quote from: bittraffic on August 01, 2023, 05:19:42 PMThe difference is that Richard had not paid any sitting politician that could help him. Bankman did prepare for it to which his charges are absolutely dropped and are just in his house with some guards to secure his safety so that no disgruntling investors will visit him. SBF had 13 charges.. all designated for trial in october.. latest news is 5 are set aside and may be charged in 2024so only 8 are going to trial in october..influencers only get 1 charge for promoting a deceptive product of someone elses branda ICO scammer gets multiple charges.. also heart \"facing a lawsuit\" does not mean locked up in prison. so its not like SBF is free and heart is locked up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "August 01, 2023, 06:37:22 PM",
      "body": "Quote from: Zlantann on August 01, 2023, 05:10:08 PMI don't see it as a piece of bad news to the crypto space because a crime was dictated by the SEC and the person behind it will be persecuted. So it is a piece of good news that the people giving the crypto space a bad image is been identified and sued. This is another reason why people that want to make quick cash from the industry should have a rethink. There is also a need not to listen to all the hype from some of these celebrities that promote unverified projects because most of them are not genuine. If you don't do your research, regrets might be the outcome. IT is a good news for those who's money was not seized in it but bad for those who's had. And if we see it from another angle which is, this news only hurts new investors to trust US government which is a bad thing for whole crypto industry for specific region which is under skeptical eyes. Why USA is under skeptical eyes because they are continuously seizing a lot of platform and then selling those funds if they are not in FIAT. Point being made here is, We as a small, big, short term or long term investors, must not risk our money into others hand instead we should make profits with our money by making our own efforts. For example by trading etc. Such APY platforms must not be encouraged i am not in favor of such platform who make other people lazy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "August 01, 2023, 07:33:49 PM",
      "body": "That's another point for SEC. If this is what they're doing, chasing those people that have used their investors fund or misled people. Majority from the community are going to count on them because they're doing a great job on this one. And doing so, will alert the other influencers that have been doing misconduct.Also those that have plans of following.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "August 01, 2023, 08:15:54 PM",
      "body": "Quote from: Flexystar on August 01, 2023, 01:19:39 PMIn the recent news a crypto influencer named Richard Heart was sued by the SEC because he found guilty using the investors crypto fund to buy personal leisure's. This includes luxury car, 555 karat Enigma Diamond, luxury watches etc. When the estimate is calculated it comes to be around ~12 million in USD. The money trail is very simple. Heart published a brand new project under HEX business name that is unregistered and with the product PulseChain. This project is for the investors who wants to have wealthy lifestyle. As we know, crypto is full of interested people, and they ended up investing lot of money into the project. Heart successfully raised $1 billion through the project mentioned above. From this money he started buying the mentioned assets that includes:$534,916 McLaren sports car, $314,125 Ferrari Roma, $1.38 million Rolex watch,$5 million The Enigma Diamond. This is really bad news in the crypto sphere and influencers clearly seen very greedy in this case scenario. He literally did not even care that this is someone else money that was put into his business to grow it and have some returns for doing so. This is what caused SEC to file the lawsuit against Richard Heart and that I think was the right decision whatsoever. You call him an influencer, and no doubt he had a platform and enough personality to trick people into parting money with him, but he's a fairly bog standard fraudster in the grand scheme of things. Many have existed before him and many will come along after him. It just takes a new range of tools that are required to pick apart the elaborate scam that they build up and surprisingly in the age of instant internet information, he was able to disguise so much - but this is what scammers required, a suspension of the truth by would be buyers. Even if all the alarm bells were ringing, there will be a small audience that will reach out and fall into these carefully constructed traps, it's just crazy he was able to get so much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "August 01, 2023, 08:53:57 PM",
      "body": "That's just what it is with most of those altcoins: the project owners usually organise and launch a project, and after obtaining a certain amount from investors, they will just disappear into thin air. In most of those cases, since the project owners are not being identified, the SEC doesn't do anything to anyone because there's nobody to hold responsible for investors losses, but in this case, where Richard has been sued by the SEC, I think it serves him right. I really wonder why, as the CEO of a crypto project, he would use investors funds for his personal needs rather than using it to grow the project so that his investors can gain more profit in return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "August 01, 2023, 08:59:31 PM",
      "body": "Holy shit...  This is the first time I'm reading about this.  Richard Heart is a total douchebag, but did he basically give the Hex tokens away for free?  I guess he had a schedule to sell them as well if I remember, but I would think the \"free\" offer would have protected him here.  I know nothing about pulsechain or pulsex though, and it seems those are his recent offerings so maybe he strayed a little from his original Hex distribution.  Richard Heart is sort of like the crypto version of PunchMadeDev so it would interesting to be a fly on the wall of his lawyer's office.  I wonder where he is now and if he's planning on running like Do Kwon did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 01, 2023, 10:59:43 PMLast edit: August 01, 2023, 11:11:26 PM by franky1",
      "body": "heres the thing thoughif the SEC wants to fight that he sold a security. then they are vouching that the ICO has value and is an investment. kind of then self defeats their argument to try to classify it as a security to gain jurisdiction to charge him.. however by showing the guy sold a product of his creation and used the proceeds for personal lifestyle, wouldnt that prove that he was not selling a security.. but just a personal belongingif their punchline is to finally say the sold items have no value then it is not a security.. the other thing is.. whenever any company does a shares raise or offer bonds.. those incomes raised from selling securities do get spent on whatever the company wants to spend them on. EG elon sold tesla stock and used proceeds for personal vanity to buy twitter, a toilet and a new shirt, rather then just let the funds just fester in a bank doing nothingi think the SEC is mixing up the idea's of a security vs property vs a reserve locked stablecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayeds56",
      "created_time": "August 01, 2023, 11:38:54 PM",
      "body": "Quote from: Zlantann on August 01, 2023, 05:10:08 PMI don't see it as a piece of bad news to the crypto space because a crime was dictated by the SEC and the person behind it will be persecuted. So it is a piece of good news that the people giving the crypto space a bad image is been identified and sued. This is another reason why people that want to make quick cash from the industry should have a rethink. There is also a need not to listen to all the hype from some of these celebrities that promote unverified projects because most of them are not genuine. If you don't do your research, regrets might be the outcome. You are absolutely right that SEC taking action against Richard Hart is not bad news, in fact it is positive development that bad actors are being filtered out from crypto space, which is good for long term growth and adoption of crypto currencies. However, a valid concern in this regard is why SEC took so much time to establish charges against him while he has been involved such illegal activities for many years. It is important for regulatory authorities to be more vigilant and proactive in their actions against such wrongdoers to maintain the integrity and trust of crypto industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "August 02, 2023, 01:07:31 PM",
      "body": "Quote from: bittraffic on August 01, 2023, 05:19:42 PMThe difference is that Richard had not paid any sitting politician that could help him. Bankman did prepare for it to which his charges are absolutely dropped and are just in his house with some guards to secure his safety so that no disgruntling investors will visit him. Heart is a sitting duck and its gonna be more than 12M will be taken from him and all the HEX shitcoin holders will shit themselves seeing the price down the hole. Gensler needs a lot o money to find more like him in crypto.I think if possible Richard Heart would also bribe some valuable politics, but I think his relationship or position is inaccessible to those people, and a lot smaller than SBF, but look In general, they all have bad problems in the crypto space. A little sideline, as I am also someone who has observed HEX and the hype about it and the flashiness during the previous bull season with confidence about a HYPE project.I do feel a bit skeptical at times about the legitimacy and some kind of lie that emerges about them, but the profit story and Richard Heart's involvement in recent incidents may need to be the same. Go to the end of transparency with this project as well as Richard Heart personally. Really Richard Heart in my eyes, he is a Ponzi scammer in this crypto environment, but admittedly he has a very strong team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 02, 2023, 04:51:58 PM",
      "body": "Quote from: ZAINmalik75 on August 01, 2023, 06:37:22 PMIT is a good news for those who's money was not seized in it but bad for those who's had. And if we see it from another angle which is, this news only hurts new investors to trust US government which is a bad thing for whole crypto industry for specific region which is under skeptical eyes. Why USA is under skeptical eyes because they are continuously seizing a lot of platforms and then selling those funds if they are not in FIAT. My heart goes to people that have lost their hard-earned money in this scheme. Unfortunately, they have to learn their lesson the hard way. But regulators will always do their jobs. If the SEC is doing what is right, they should be encouraged. I will not fail to praise the good acts of the government because we don't want people to trust them. Criminals in the crypto sectors should be identified and persecuted. While genuine businesses should be given the liberty to operate without intimidation from the government. The US government led by SEC is unfriendly with crypto so they will always sell seized assets and use the funds to repay victims or cover the cost of investigation. I always think that this news can also create the needed awareness for investors to consider controlling their coins in decentralized platforms.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "August 02, 2023, 05:00:53 PM",
      "body": "I don't know what's bad with this story, it's very good, we got rid of a scammer with an army of idiots who throw their money in the hope of getting rich quick when all that happens is that they buy luxury for this idiot, and this story will be repeated because most altcoins aim to make Developers are wealthy, and those who sell first, so do not be greedy if you see an investment opportunity in an alternative currency and sell it quickly.I do not think that he got a billion dollars form HEX scam project, all he did was print more coins and use them in his own interests, as the market capacity of this currency will be much less than the trading numbers.Quote from: bluebit25 on August 02, 2023, 01:07:31 PMI do feel a bit skeptical at times about the legitimacy and some kind of lie that emerges about them, but the profit story and Richard Heart's involvement in recent incidents may need to be the same. This advertisement is enough to get away from this currency. Everyone who gives false promises of a quick return on investment is scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}