{
  "id": "topic_5474111",
  "title": "Geremia",
  "author": "Geremia",
  "created_time": "November 15, 2023, 03:47:00 AM",
  "content": "Now that Purse.io has been sunsetted, I'm wondering what are some online bookstores that accept ₿?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474111",
  "comments": [
    {
      "author": "logfiles",
      "created_time": "November 15, 2023, 01:32:04 PM",
      "body": "It's better if you move this topic to service discussion board. You will get quicker responses from members that have used some other alternative before.In this thread (Alternative to Purse.io), one member suggested shopping.io but that was a while back, like 2 years ago. I have never used the service, so I am not vouching for it. Please read reviews and do your own research before you use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "November 16, 2023, 05:39:41 PM",
      "body": "Quote from: Geremia on November 15, 2023, 03:47:00 AMNow that Purse.io has been sunsetted, I'm wondering what are some online bookstores that accept ₿?I managed to find a few on multiple Bitcoin directory sites, but I prefer not to vouch for any of them [DYOR]:Note: I didn't include bookstores that only had books in their local languages.BookZapperThe White People’s PresseBooksChoiceBitcoinBook [a.k.a Konsensus Network]Kioskaantonop",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "November 16, 2023, 06:22:06 PM",
      "body": "You could also look through merchant directories such as:1. cryptwerk.com2. spendbitcoins.com[keep in mind that not everything listed will be legitimate, watch out for scams]or look into gift card providers instead, see list: https://bitcointalk.org/index.php?topic=5208530.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Geremia",
      "created_time": "November 17, 2023, 12:40:50 AM",
      "body": "Quote from: SFR10 on November 16, 2023, 05:39:41 PMBookZapperThe White People’s PresseBooksChoiceBitcoinBook [a.k.a Konsensus Network]KioskaantonopThanks, but those seem to be mostly e-books. I'm looking for hardcopy book stores.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 17, 2023, 02:33:43 AM",
      "body": "I tried looking for one through spendabit. There are a number of books available but they're mostly not sold from a bookstore. Many of these stores are offering other stuff aside from books. They all accept Bitcoin payment, of course. But I found Mises Bookstore, though. It has more than 600 books available. I don't know which specific books or what type of books you're looking for, but you might want to drop by their site.Please note that I haven't tried buying from this bookstore. This isn't a recommendation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 22, 2023, 03:43:10 PM",
      "body": "Quote from: Geremia on November 17, 2023, 12:40:50 AMThanks, but those seem to be mostly e-books. I'm looking for hardcopy book stores.Maybe you should think in a different direction than looking for someone who sells books for Bitcoin and if you find a good site that has books that interest you, you can always ask the owner to add that payment option. Maybe you like comics? Even if not, maybe someone else will be happy that there is a site like this https://www.octopuscomics.com/shop",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}