{
  "id": "topic_5405408",
  "title": "Accardo",
  "author": "Accardo",
  "created_time": "July 06, 2022, 03:45:52 PM",
  "content": "They've been some kind of let's say an argument or two-sided opinions if it's okay for the bank of America to publish genuine cryptocurrency stats. A few hours ago, a tweet was made on this report about the decline of active cryptocurrency users in high numbers, ranging from 1 million to 500k. To me, this sounds like FUD news and in other people's opinion a true stat since it could be generated from exchanges. How possible could this be? Although we know, the cryptocurrency market is bearish now and people are withdrawing their funds as quickly as they could. But, not to such a number unless the LUNA deceased investors made up most of the stats. What do you think? https://twitter.com/WatcherGuru/status/1544364935806844930",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405408",
  "comments": [
    {
      "author": "mindrust",
      "created_time": "July 06, 2022, 03:49:27 PM",
      "body": "Big if true. But also very natural. That'!s what happens during the bear markets. Bitcoin and other crypto tanks, people speak of crypto no more and when they least expect it, bitcoin makes a huge jump and everybody talks about it again. Happened many times before and it will happen again. This is the accumulation phase. Don't let it go to a waste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "July 06, 2022, 03:54:01 PM",
      "body": "Quote from: mindrust on July 06, 2022, 03:49:27 PMBig if true. But also very natural. That'!s what happens during the bear markets. Bitcoin and other crypto tanks, people speak of crypto no more and when they least expect it, bitcoin makes a huge jump and everybody talks about it again. Happened many times before and it will happen again. This is the accumulation phase. Don't let it go to a waste.I thought so, though human nature in the case of a friend when he got some issues they'll definitely back down or maybe stop visiting. In this case of bitcoin they'll wait to make profits real quick when the price is booming and people discuss how they made profits out of bitcoin. The stats is too big though, that means bitcoin is meant/ was created for only lesser, patient and strong hodlers or people to benefit or see huge profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 06, 2022, 04:00:25 PM",
      "body": "Do they have an explanation of the statistical methodology they follow? It is difficult to track the number of active users so we can say the number of logins to a platform, tweets, shares but it is very difficult to determine the number of users in a decentralized network.Luna Case will pay many novices to stay away for the time being.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChrisPop",
      "created_time": "July 06, 2022, 04:00:51 PM",
      "body": "There is not enough info for this stat. Is it referring to crypto users from the Bank of America customer base? - If yes, how is one active crypto user defined as?It is normal the buying volume to be lower in bear markets. Didn't think it is quite so much (50%), but again I need more info of how this statistic has been created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "July 06, 2022, 04:05:14 PM",
      "body": "I don't think that those statistics are contributed by bitcoin users only. The end of last year was the memecoin hype and a few other moments that sparked newcomers, then left again as the hype had ended.After all, it is currently a bearish phase that most bitcoin users choose to be passive (only holding).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "July 06, 2022, 04:06:54 PM",
      "body": "That's how it works. New and more users come in the Euphoria phase, not Capitulation or accumulation.Not even surprised I would say. And when Bank of America is giving you this data, that means the part of the world where there are the most crypto investors are no longer interested, you can think about the other regions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "July 06, 2022, 04:08:56 PM",
      "body": "I do think they do realize that feds just increased their interest rates which made most people quite reluctant to sell their coins and invest in the normal banking as well, therefore I do think that, it's completely okay since this number does not define the people who are doing p2p trading and holding as well, they would choose to keep their coins safe from the governmental eyes as well, other than that there are several Altcoins which are outperforming bitcoins this years so I do believe that people are definitely having a very different outlook regarding them and are willing to take a chance on them, that's just the market, you see where you wanna invest in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0verseer",
      "created_time": "July 06, 2022, 05:38:37 PM",
      "body": "It was expected. I mean look back then when BTC hit ATH and covid lockdown, it wasn't hard to get where most Americans would put their stimulus and relief money to stocks and cryptos. Since the BTC fall, most just gonna cash back to fiat from whatever is left and quit after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 06, 2022, 06:19:33 PM",
      "body": "Without knowing the details of what they mark as a cryptocurrency user it's tough to be sure.If they are using 'people that deposit or withdraw funds from known cryptocurrency exchanges' then as others have said above the 50% is not out of the realm of possibility.On that same thought there are more and more places that you can get BTC / crypto from that may or may not show up depending on how they are doing it.PayPal now has the ability to buy and withdraw BTC. Does that show up as crypto or just as regular PayPalTransferring money to cashapp. I can use it to get lunch at a place that uses square / block as a processor or I can buy BTCAnd so on. Without knowing how they came up with their number it's all a guess.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "July 06, 2022, 06:40:55 PMLast edit: June 12, 2023, 08:17:09 PM by stompix",
      "body": "Quote from: Accardo on July 06, 2022, 03:45:52 PMTo me, this sounds like FUD news Of course of course, if it's not positive and it's not about laser eyes, the price at 1 million soon it's FUD.What do you expect with a declining price, with shitcoins getting trashed into oblivion, with the NFT madness dying down, with play-to-earn blockchain 'games\" losing millions of players? The amount of money available in crypto has shrunk nearly 3 times, there is less money floating around, and there is less incentive to trade and invest.Look at the number of blockchain transactions:https://www.blockchain.com/charts/n-transactionsDespite getting a next block confirmation with 2 satoshi per byte the number of actual transactions is way lower than two years ago, people are either hoarding or ditching usage altogether, and people holding coins in their cold wallets can't be called \"active users\".It's pretty normal, it's a bearish trend and until the price goes up again you will not see an increase in active users, it simply doesn't work so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "July 06, 2022, 06:45:58 PM",
      "body": "Quote from: mindrust on July 06, 2022, 03:49:27 PMBig if true. But also very natural. That'!s what happens during the bear markets. Bitcoin and other crypto tanks, people speak of crypto no more and when they least expect it, bitcoin makes a huge jump and everybody talks about it again. Happened many times before and it will happen again. This is the accumulation phase. Don't let it go to a waste.Is it big though or have I missed the sarcasm implied here? Judging by your following sentence I'd assume so. Anyway, I'll chip in with its absolutely 100 percent expected, and by no means is unprecedented. This isn't really news per say, more confirmation of something that was already assumed. Quote from: stompix on July 06, 2022, 06:40:55 PMDespite getting a next block confirmation with 2 satoshi per byte the number of actual transactions is way lower than two years ago, people are either hoarding or ditching usage altogether, and people holding coins in their cold wallets can't be called \"active users\".It's pretty normal, it's a bearish trend and until the price goes up again you will not see an increase in active users, it simply doesn't work so.Yeah, and we can't blame people to be holding or getting out. We're probably heading for a global recession that few have seen worse. Natural for people to ditch things that they aren't quite confident in or on the contrary hoard them, in hopes that'll put them in a better position years down the line when we're coping with the recession a little more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "July 06, 2022, 06:50:26 PM",
      "body": "If the decline is true, then I think it makes quite a bit of sense if you look at the bear market from the start that some of them are going to rest their money. Reports appear released, it does not mean that crypto users left the market without returning. We will see a mass arrival if the market approaches a bull run in the future. This sounds like the character of a long-term investor who doesn't want to be too ambitious in a deep bear market. It could be that they had taken their share when Bitcoin was under $20K at the time.It would be too early to sell them now, the decision made them temporarily leave the market and look forward to ATH in sight.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "July 06, 2022, 06:53:27 PM",
      "body": "Quote from: Accardo on July 06, 2022, 03:45:52 PMThey've been some kind of let's say an argument or two-sided opinions if it's okay for the bank of America to publish genuine cryptocurrency stats. A few hours ago, a tweet was made on this report about the decline of active cryptocurrency users in high numbers, ranging from 1 million to 500k. To me, this sounds like FUD news and in other people's opinion a true stat since it could be generated from exchanges. How possible could this be? Although we know, the cryptocurrency market is bearish now and people are withdrawing their funds as quickly as they could. But, not to such a number unless the LUNA deceased investors made up most of the stats. What do you think? https://twitter.com/WatcherGuru/status/154436493580684493050% is pretty big decline in my opinion but it's possible. People who jumped on crypto during the bull market where most likely on a loss right now and possibly jumped out on crypto. There are many who just take advantage of market by profiting then leaving crypto as soon as big downfall movement happened. I can expect that people will come again next bull run when everyone is talking about crypto. Everything now is down it's all time high including users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 06, 2022, 07:08:32 PM",
      "body": "I am not sure how trustworthy such data is because I don't know how they estimate these numbers, what counts as active usage to them, how much might not be accounted for. Also, even looking at the chart, it's clear that it went pretty low before but then jumped back up, so there's no reason to believe that won't happen again. Moreover, if it's about active usage, it might be that many people just tend to hodl their coins during bad times instead of trading them. It doesn't mean they don't care about the market or abandon it, they just don't sell at low price, which is wise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "July 06, 2022, 07:22:09 PM",
      "body": "Quote from: Accardo on July 06, 2022, 03:45:52 PMThey've been some kind of let's say an argument or two-sided opinions if it's okay for the bank of America to publish genuine cryptocurrency stats. A few hours ago, a tweet was made on this report about the decline of active cryptocurrency users in high numbers, ranging from 1 million to 500k. To me, this sounds like FUD news and in other people's opinion a true stat since it could be generated from exchanges. How possible could this be? Although we know, the cryptocurrency market is bearish now and people are withdrawing their funds as quickly as they could. But, not to such a number unless the LUNA deceased investors made up most of the stats. What do you think? It's unsurprising in a way, crypto has lost it's sparkle in the last few months and no longer looks like the rollercoaster that is climbing ever higher. People were drawn to it for such a long time because more money was piling in every day, but it was almost bound to reverse like any bubble in history. In the long run it will be better for Bitcoin if it returns to a much more realistic price, like it's at right now, and avoids the huge mass of speculators who were not properly interested in it's functionality. It has a great role for moving money around between countries, but for day to day transactions it is pretty inefficient when you compare it to existing payment networks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 06, 2022, 08:45:10 PM",
      "body": "Well, I can say that when BTC was at $50,000 I had a dozen friends ask me about buying in.  I pretty much told them all the same thing, \"We're in the 9th inning of this bull run, if you buy in now and don't immediately take profits you'll probably lose money.\"  None of them listened and most of them decided to buy shitcoins instead of Bitcoin.  Some of them bought miners.  Now, all the miners are shut off and all the shitcoins have been sold except for the ones who refuse to take a loss.  I try to tell them that now is the time to be getting in for the next cycle, but they only want to chase get rich quick schemes, not invest.  I imagine that's pretty common with what is happening in the market right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 06, 2022, 09:57:40 PM",
      "body": "So how do they come up with stats, though?Are these figures from compliant exchanges, or just Bitcoin addresses created/transactions made?Regardless, more people tend to get into crypto in bull runs due to FOMO and get out when there is a bear market, which is normal. So I don't know why this is making news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 06, 2022, 10:29:44 PMLast edit: July 06, 2022, 10:40:11 PM by franky1",
      "body": "im guessing its based on wire-transfers for BoA accounts to known exchange accountsthat said.the number of wire transfers in jan 2020 was under 100k..but their own numbers reveal that since then they average over 400k people have been depositing into exchanges a month every month. where sometimes double that people do at peak or for different reasonsnever ever take an ATH number of any chart and deem it to be the \"norm\"ATH(all time highs) are never the norm expectation.. the April 2021 was not the norm/expected, its just the temp high. so no one was making press releases in july 2021 when the hype settled down..so dont take the Nov 2021 as a \"norm\" either. and again dont treat the april 22 as the bad press news sign of hate.. its just the calm after the tsunamiexpect the waves in any chart.. just ride the waves and try to find where the real low tide lays to find the \"norm\" and then look at the chart from bottom up not top down..if numbers never go below say 150,200 or 300 again. then thats the new norm.. the new low",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "July 06, 2022, 10:50:40 PMLast edit: July 10, 2022, 12:31:11 AM by usekevin",
      "body": "The reason is very simple,it was due to the bear market.The market was fall down to the huge demands was immediately reduced.The market change was huge difference.After few weeks,the price of bitcoin was made the people to think of longer period.So it made the new people to make a involvement in the cryptocurrency for now.This will change when the price of the bitcoin back to the 40k market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}