{
  "id": "topic_5417977",
  "title": "Trofo",
  "author": "Trofo",
  "created_time": "October 22, 2022, 09:33:14 AM",
  "content": "I am always looking for a way to take my ROI with the bookies on the next level so i decided to open a topic where we can share tips from sports that aren't that popular and does not have their threads on the forum. It can be anything that you are watching or have solid knowledge about. For instance your local football league if you are from smaller country, like Croatia for me. Or maybe you are following cycling, table tennis or volleyball. Basically anything that has markets on major bookie sites and isn't really popular.To start I will share my top pick for today. It comes from snooker, sport I used to watch a lot and got hooked to it for short period of time few years ago. Not following it that much this year but I watch a couple of matches on all majors.Zhou Yuelong +1.5 @ 1.6 for high stakeZhou Yuelont to win against Anthony McGill @1.9 for medium stakeH2H is on Yuelong side with 3 wins against one loss, he also covered +1.5 handicap in that one loss. Yuelong is also a player with much higher ceiling so I am a bit confused why this match has even odds. Those 1.6 odds for handicap seem like free money but still I have to warn you guys I did not see these 2 play on this tournament. This match looks very good on paper and historically, but maybe bookies know something that I missed.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417977",
  "comments": [
    {
      "author": "Trofo",
      "created_time": "October 24, 2022, 08:42:22 PM",
      "body": "BumpWell my initial pick passed easy and brought me some money but this topic got even less heat than I anticipated. I will probably post few more tips during the week and then let the topic die in silence if nobody latches on   We have qualifications for English open in snooker this week and I expect to find some more gems there. I guess fringe sports aren't really popular while we have Premier and Champions League football every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}