{
  "id": "topic_5432413",
  "title": "coreyishaze",
  "author": "coreyishaze",
  "created_time": "December 30, 2022, 06:13:39 PMLast edit: December 31, 2022, 06:41:20 AM by coreyishaze",
  "content": "www.jupiterrising.xyzwww.slots.videoAccepting crypto through Coinbase, via APIAlso accepting cash.app transactions but that is not through the website.Payouts over $250 Will Have a 3 Day Processing.You're allowed 1 Payout per Day until we raise more Capital.89-97% RTPEnjoy all the latest and greatest slots, fish tables, keno & more.We have the OG stuff too.No KYC, Offshore server hosting.All Games Work, if you do find any bugs please report them to me through email or SMS.+1 (209) 659-7070admin@jupiterrising.xyzedit:So I apologize if I upset anyone with my payout rules and such. I'm not doing it to be a cheap skate, I'm just trying to get by. I've spent months and so many hours of my life putting this all together. It really was a lot of work. I wish I did have the money to be able to pay you all out as soon as you request it. I really do...https://i.imgur.com/fcTW094.pnghttps://i.imgur.com/zrijm1D.pnghttps://i.imgur.com/rmFLEfy.pnghttps://i.imgur.com/ACfI05v.png",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432413",
  "comments": [
    {
      "author": "acroman08",
      "created_time": "December 30, 2022, 07:02:56 PM",
      "body": "Quote from: coreyishaze on December 30, 2022, 06:13:39 PMPayouts over $250 Will Have a 3 Day Processing.I'm sorry what? 3 days of Processing for a withdrawal above $250? this will become a huge issue with your casino and I am pretty sure many gamblers will be discouraged by this too.Quote from: coreyishaze on December 30, 2022, 06:13:39 PMYou're allowed 1 Payout per Day until we raise more Capital.this is quite concerning, it gives the impression that your casino lacks the necessary funds to pay its gamblers. it also explains the 3 days Processing for a withdrawal above $250.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "December 30, 2022, 07:57:35 PM",
      "body": "First, welcome to the forum. Next, it's better for you to have a better way of thread through purchasing Copper Membership and have some image posted from your casino.Lastly, those rules that you've set, that will surely drive away customers to your casino. A $250 withdrawal that will take up to 3 days, no one would like to wait that much for their money to be processed.You may not require KYC but if your reasoning is to only have 1 withdrawal per day and you'll have to raise money first for more allowed withdrawals per day.Then, it's best for you to raise your capital first before launching.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 30, 2022, 08:20:56 PM",
      "body": "Welcome to Bitcointalk forum OP. I hope you are familiar with the forum rules which could result of your account being banned. Not that I am saying you have broken or violated some because you are not in trouble at all. Anyway, are you the owner of the gambling site you mentioned?. Honestly, I am not familiar with it or you could say I don't know anything about that site you promoted here. You can buy copper membership if you want to post images which newbies doesn't have the permission to images. Copper membership will remove that restriction once you bought it. You can buy here https://bitcointalk.org/index.php?action=credit;promote.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "December 30, 2022, 08:27:51 PM",
      "body": "Quote from: coreyishaze on December 30, 2022, 06:13:39 PMPayouts over $250 Will Have a 3 Day Processing.You're allowed 1 Payout per Day until we raise more Capital.This is unaccaptable for me and for many other players here.Nobody likes waiting and slow withdrawals.coreyishaze can you tell me if are you the official representative for this JupiterRising gambling website?Website was loading slower than usual for me, and I don't like using domains like xyz, and it's better to use something different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coreyishaze",
      "created_time": "December 30, 2022, 08:51:02 PM",
      "body": "Quote from: notblox1 on December 30, 2022, 08:27:51 PMQuote from: coreyishaze on December 30, 2022, 06:13:39 PMPayouts over $250 Will Have a 3 Day Processing.You're allowed 1 Payout per Day until we raise more Capital.This is unaccaptable for me and for many other players here.Nobody likes waiting and slow withdrawals.coreyishaze can you tell me if are you the official representative for this JupiterRising gambling website?Website was loading slower than usual for me, and I don't like using domains like xyz, and it's better to use something different.I 100% am the owner of this casino, I've spent the last numerous months developing it to what it is now. You should see my old script. It's a massive overhaul. https://prnt.sc/sYTWXBwoVZushttps://prnt.sc/AbTKJOimUGzyQuote from: notblox1 on December 30, 2022, 08:27:51 PMQuote from: coreyishaze on December 30, 2022, 06:13:39 PMPayouts over $250 Will Have a 3 Day Processing.You're allowed 1 Payout per Day until we raise more Capital.This is unaccaptable for me and for many other players here.Nobody likes waiting and slow withdrawals.coreyishaze can you tell me if are you the official representative for this JupiterRising gambling website?Website was loading slower than usual for me, and I don't like using domains like xyz, and it's better to use something different.Yes I am the owner and official rep.The website is hosted in Germany, as I stated in my original post it's in an offshore server.And I own the domain slots.video is that better?^^Don't actually use slots.video right now though. That's not the production server, it's the dev server and it doesn't load any of the games up. It's strictly for theme building and laravel integration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 30, 2022, 11:42:21 PM",
      "body": "Quote from: coreyishaze on December 30, 2022, 08:51:02 PMYes I am the owner and official rep.The website is hosted in Germany, as I stated in my original post it's in an offshore server.And I own the domain slots.video is that better?^^Don't actually use slots.video right now though. That's not the production server, it's the dev server and it doesn't load any of the games up. It's strictly for theme building and laravel integration.So you are the owner and it seems you didn't have a good bankroll amount base on your reply which withdrawal amount or payout amount of $250 above will have a 3 day processing. Any plan on the bankroll?. I am sure that sooner or later, you will earn more money to add in the bankroll so that $250 above won't be delayed for 3 days. Are you alone in building the platform yourself or you have a team. I know that it will take a lot of effort and time if you are alone and the expenses too. When you have good reputation then try announcing if anybody wants to invest in bankroll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "December 30, 2022, 11:47:43 PM",
      "body": "Quote from: nakamura12 on December 30, 2022, 11:42:21 PMQuote from: coreyishaze on December 30, 2022, 08:51:02 PMYes I am the owner and official rep.The website is hosted in Germany, as I stated in my original post it's in an offshore server.And I own the domain slots.video is that better?^^Don't actually use slots.video right now though. That's not the production server, it's the dev server and it doesn't load any of the games up. It's strictly for theme building and laravel integration.So you are the owner and it seems you didn't have a good bankroll amount base on your reply which withdrawal amount or payout amount of $250 above will have a 3 day processing. Any plan on the bankroll?. I am sure that sooner or later, you will earn more money to add in the bankroll so that $250 above won't be delayed for 3 days. Are you alone in building the platform yourself or you have a team. I know that it will take a lot of effort and time if you are alone and the expenses too. When you have good reputation then try announcing if anybody wants to invest in bankroll.this will be the bottleneck of his business. he should tap private individuals to pitch in with his bankroll. the worry of most players is usually the withdrawal aspect. if they will be waiting for days before the can see their money, that would pose problem for them to play again on his site. better if he can find people who can sufficiently fund this platform. the worry also of having disappearing act here is high. even if we say, he put a lot of effort on this project, once he saw a good amount of money, what is the chance that he will just abandon this gambling site?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "December 31, 2022, 02:41:55 AM",
      "body": "To be honest mate, I really appreciate your efforts. But to be honest, no one will really like to play on the site. The basic reason is that you don’t have enough money to fund the site’s bankroll. You are so broke that, you don’t have enough money to buy a premium domain and bought this free .xyz domain. But still I loved the honesty that is shown in the OP. I would suggest you rather get some funding from other companies and then officially make a launch. Else this will be nothing other than just waste of time,money and energy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 31, 2022, 03:03:36 AM",
      "body": "Quote from: Nrcewker on December 31, 2022, 02:41:55 AM I would suggest you rather get some funding from other companies and then officially make a launch. Else this will be nothing other than just waste of time,money and energy.Yes, and make a proper launch, with a proper ANN thread, with its copper membership bought to put images in the thread, otherwise it is a crappy presentation. A well run casino is a very profitable business, but you have to do things right, and with the competition out there, with the number of sites that people have to choose from, making a bad presentation that includes a 3 day wait for withdrawals of more than 250 does not encourage people to try the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "December 31, 2022, 03:11:18 AM",
      "body": "Welcome to Bitcointalk and enjoy your time.I suggest you buy copper membership that can give more benefits to post an image and make your ANN looks good.But I'd like to know why the withdrawal over $250 Will Have a 3 Day Processing?If so, you should have an automated payment system so members will not have to wait for 3 days.I see that your site is ready to promote Bitcointalk so that is your next step to introduce your casino to all members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "December 31, 2022, 03:35:39 AM",
      "body": "Quote from: coreyishaze on December 30, 2022, 06:13:39 PMSo I apologize if I upset anyone with my payout rules and such. I'm not doing it to be a cheap skate, I'm just trying to get by. I've spent months and so many hours of my life putting this all together. It really was a lot of work. I wish I did have the money to be able to pay you all out as soon as you request it. I really do...It's not really upsetting, especially if you consider how most haven't exactly experienced it but it does have a negative effect on attracting users to your casino. I honestly would just sell the backend and maybe just get hired somewhere since you have experience developing it on your own as you've said. The effort is there, but that's not the only thing needed in a business. A Proper system, marketing, and the like that's aligned with the norms (and a 3-day processing of withdrawals is not one of them). Even no KYC is not enough to offset that. Maybe build up capital by attracting investors first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "December 31, 2022, 03:44:32 AM",
      "body": "Quote from: traderethereum on December 31, 2022, 03:11:18 AMBut I'd like to know why the withdrawal over $250 Will Have a 3 Day Processing?If so, you should have an automated payment system so members will not have to wait for 3 days.I see that your site is ready to promote Bitcointalk so that is your next step to introduce your casino to all members.It is simple, low bankroll is the answer as stated by OP himself and proved by the xyz domain (it shows that he cant afford to buy good domain). This make me wonder how much is his current bankroll and how much is the max win limit per bet in his casino? He provides 3rd party games, mostly slots where it is so possible for anyone to win big with small bets. It is better to not play in this casino for now due to these several facts. Maybe it sounds harsh, but I do believe it is the wise decision if we look at all the fact about this new casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joeperry",
      "created_time": "December 31, 2022, 04:52:44 AM",
      "body": "The UI looks decent to me and you sure do have a massive amount of games but why your domain is in .xyz? do you have budget to at least get a decent domain? You also don't have any terms and conditions in your website and only FAQs at the bottom. Honestly, I am sketchy about your website if you could provide more information about it and am I the only one having problem with the games whenever I clicked it says \"500 Server Error\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 31, 2022, 05:34:30 AM",
      "body": "Maybe you need to raise capital first before you do this and want customer on your casino. Even if you're that honest that processing time may take days, it's still a no-no to most of the players that will risking their money to bet and decreased on them easily yet when you get payout it will take time, that's unacceptable. It should reciprocate tbh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coreyishaze",
      "created_time": "December 31, 2022, 05:43:54 AM",
      "body": "Quote from: joeperry on December 31, 2022, 04:52:44 AMThe UI looks decent to me and you sure do have a massive amount of games but why your domain is in .xyz? do you have budget to at least get a decent domain? You also don't have any terms and conditions in your website and only FAQs at the bottom. Honestly, I am sketchy about your website if you could provide more information about it and am I the only one having problem with the games whenever I clicked it says \"500 Server Error\"500 error?Which games? you are using jupiterrising.xyz right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 31, 2022, 05:44:20 AM",
      "body": "Quote from: coreyishaze on December 30, 2022, 06:13:39 PMPayouts over $250 Will Have a 3 Day Processing.You're allowed 1 Payout per Day until we raise more Capital.with this mate , I'm not sure if you are going to lure any gamblers from this forum because as you have admitted with limited capital, why do you think gamblers here will turn in your site when there are many of legit and proven to be Paying with huge wins for many years now?but still welcome to the forum guys  , hope you will gain that capital to increase that withdrawal amount .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "December 31, 2022, 06:16:54 AM",
      "body": "Quote from: joeperry on December 31, 2022, 04:52:44 AMThe UI looks decent to me and you sure do have a massive amount of games but why your domain is in .xyz? do you have budget to at least get a decent domain? You also don't have any terms and conditions in your website and only FAQs at the bottom. Honestly, I am sketchy about your website if you could provide more information about it and am I the only one having problem with the games whenever I clicked it says \"500 Server Error\"This is also what my thoughts is in the beginning, why it is on the .xyz domain? I mean top gambling site are into the .com for obvious reason. I know it's hard to get a good domain name because it might cause some money but that's how casino are being built, from the name and then it's reputation.Someone suggested to get a copper membership to be able to post image, that might be good advise.As for the withdrawal, it should be instant or at least in just matter of hours not days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coreyishaze",
      "created_time": "December 31, 2022, 06:40:42 AM",
      "body": "Quote from: btc78 on December 31, 2022, 05:44:20 AMQuote from: coreyishaze on December 30, 2022, 06:13:39 PMPayouts over $250 Will Have a 3 Day Processing.You're allowed 1 Payout per Day until we raise more Capital.with this mate , I'm not sure if you are going to lure any gamblers from this forum because as you have admitted with limited capital, why do you think gamblers here will turn in your site when there are many of legit and proven to be Paying with huge wins for many years now?but still welcome to the forum guys  , hope you will gain that capital to increase that withdrawal amount .I am seeing that you are correct.. Maybe I should seek an investor? I have the time, knowledge and dedication to run this casino at production level. That's everything besides the fat wallet to fund it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 31, 2022, 07:15:21 AM",
      "body": "Welcome to the forum. I've check your terms and service and surprisingly you're not asking KYC, VPN usage and there's no restricted countries including Russia, does it's legit or you're forget to include those rules. I'm interested to know because you have a promotion and this will be easy to abuse if there's no rules about those verification. Even you're not allow VPN usage, someone could use VPN and use different device to access your casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}