{
  "id": "topic_5413283",
  "title": "Bthd",
  "author": "Bthd",
  "created_time": "September 12, 2022, 02:58:33 PM",
  "content": "Bugün foruma göz atarken yeni özelliği fark ettim. Bir başlık açtığınızda kullanıcı adınızın yanına \"(OP)\" eklentisi alıyorsunuz ve aynı başlık içerisindeki diğer postlarınızda da aynı eklenti kullanıcı adınızın yanında görünüyor. Değişiklik meta bölümünde PowerGlove tarafından önerilmiş ve bugün theymos tarafından eklenmiş.Seçenekler arasındaki görsel daha iyi bir seçim olabilirdi. Her ne kadar Türk Dil Kurumuna göre operatör kelimesinin kısaltması Opr. olarak verilse de Türkçe'de OP kısaltması genellikle operatör kelimesinin kısaltması olarak daha yaygın kullanılıyor. mIRC, forum yada online oyunlarda sıklıkla kullanılıyor olması başlığı okuyan kişilerde gönderilen mesajın bir yönetici tarafından gönderildiği yanılgısına sebep olabilir.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413283",
  "comments": [
    {
      "author": "Red Pie",
      "created_time": "September 12, 2022, 06:54:34 PM",
      "body": "Bence de op yerine italik olarak değişen yazı tipleriyle birlikte kullanıcı adının değişmesi daha iyi bir işaret olabilirmiş yine de güzel bir öneri. farklılık katmış foruma. yenilikleri seviyorum. 1 nisanda şaka amaçlı bile olsa bazı forumda yeni şeyler yayınlanınca keyifle takip ediyorum neler yapılacak veya yapılmış diye. theymosun da buna karşılık vermesi çok ince bir hareket olmuş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "September 12, 2022, 07:06:10 PM",
      "body": "Ne espirisi var bunun? Mantıklı birşey göremedim. Konuyu başlatan normalde belli değil mi? Forumu mobiliteye uygun hale getirmedikleri taktirde hiçbir yenilik yenilik sayılmaz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "September 12, 2022, 07:32:14 PM",
      "body": "Quote from: Red Pie on September 12, 2022, 06:54:34 PMBence de op yerine italik olarak değişen yazı tipleriyle birlikte kullanıcı adının değişmesi daha iyi bir işaret olabilirmiş yine de güzel bir öneri. farklılık katmış foruma. yenilikleri seviyorum. 1 nisanda şaka amaçlı bile olsa bazı forumda yeni şeyler yayınlanınca keyifle takip ediyorum neler yapılacak veya yapılmış diye. theymosun da buna karşılık vermesi çok ince bir hareket olmuş. Seçenekler arasında italik yazı ve altı çizgili kullanıcı adı da vardı. Quote from: mandown on September 12, 2022, 07:06:10 PMNe espirisi var bunun? Mantıklı birşey göremedim. Konuyu başlatan normalde belli değil mi? Forumu mobiliteye uygun hale getirmedikleri taktirde hiçbir yenilik yenilik sayılmaz.4-5 yada onlarca sayfa olmuş başlıklarda işe yarayabilir. Theymos'un üzerinde çalıştığı bir değişiklik değil topluluktan öneri geliyor yine topluluktan birisi kodları yazıyor ve theymos sadece ekleme işlemini gerçekleştiriyor. Birileri bunu ihtiyaç görüyor ve foruma bir zararı yok. Mobil uygulama geç kalındığı konusunda haklısınız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "September 12, 2022, 11:00:45 PM",
      "body": "Bunu farkettim ve Meta'da baktım sonra aklıma dedim ki bunun konusu açılmıştır açtıysa ya EFS ya da Bthd hocamız açmıştır. Sağolsun Bthd hocam yüzümü kara çıkartmadı. Malum bir konu açılıyor ve sonraki sayfalarda konu sahibini belirtmesi güzel bir şey. Ancak ismin yanında olması pek dikkat çeker mi bence hayır. Bunun yerine mesajların sağ üst kısmında quote ve merit verme butonunun soluna dikkat çekecek bir imge konulsa daha işlevsel olurdu diye düşünüyorum. Çünkü konu içerisinde mesajları okurken o alan daha çok göze çarpar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "September 13, 2022, 03:43:51 PM",
      "body": "Güzel ve yerinde bir eklenti olmuş, bazı başlıklar sayfalarca oluyor. Aralardaki tartışmalarda konuyu başlatanın OP olarak görünmesi gayet iyi oldu. Burada tek eleştirim OP yazısını daha ince harflerle yazılabilirdi, daha estetik görünmesi açısından buda çok büyük bir şey değil. Ayrıca evet keşke forumu mobile uygun hale getirseler bir çok kullanıcının beklediği bir yenilik olacak böyle bir şey yapılırsa. Ufak ufak forumda değişikliklerin olması da hoşuma gidiyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "September 14, 2022, 12:14:33 PM",
      "body": "Açıkçası foruma sık sık mobilden girdiğim için bazen ilk sayfadan sonra başlığı açan kişinin nickini ben de unutuyordum. Mobilde takip etmek aşırı zor. Beğenmeyenler neyini beğenmemiş anlamadım kimseye zararı yok hatta benim gibilere faydası var. En azından yanıtlaşırken tekrar tekrar ilk sayfaya geri dönmeye gerek kalmaz kimle konuştuğumu bilip ona göre yanıt veririm. Bu tarz minik QoL (Quality of Life) gelişmeleri çok faydalı bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 13, 2022, 08:30:43 AM",
      "body": "PowerGlove bu seferde mesajın yazarının bir sonraki ya da bir önceki mesajına iletecek buton yaması hazırlamış bakalım theymos bunu yayına alacak mı https://bitcointalk.org/index.php?topic=5416941.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "October 13, 2022, 10:42:07 AM",
      "body": "Mobiliteye uygunluk bence herşeyden daha önemli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "October 13, 2022, 01:39:42 PM",
      "body": "Ben önce bende niye yok diye düşündüm. Herhalde yeni bir rütbe mantığı zannettim. Sonra açtığım başka başlıkta bende de aynı işareti görünce durum anlaşıldı. Gerek yoktu bence ama sonuçta forum sahibi biz değiliz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "October 13, 2022, 08:26:42 PM",
      "body": "yine bi ara vermiştim, geldiğimde gördüm bu olayı bizim aklımız biraz fena işlere çalışır dedim ki iyi ki OC falan olmamış kimse başlık açmazdı",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "October 20, 2022, 03:57:15 PM",
      "body": "Quote from: meser# on October 13, 2022, 08:30:43 AMPowerGlove bu seferde mesajın yazarının bir sonraki ya da bir önceki mesajına iletecek buton yaması hazırlamış bakalım theymos bunu yayına alacak mı https://bitcointalk.org/index.php?topic=5416941.0aslında bu özellik çok güzel. bakmayın türkçe forumunda her başlık en fazla 3-5 yorumdan ve 1-2 kişiden oluştuğu için anlamsız durabilir ama globalde işe yarar. burada da eskiden işe yarardı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "October 20, 2022, 08:57:55 PM",
      "body": "Quote from: meser# on October 13, 2022, 08:30:43 AMPowerGlove bu seferde mesajın yazarının bir sonraki ya da bir önceki mesajına iletecek buton yaması hazırlamış bakalım theymos bunu yayına alacak mı https://bitcointalk.org/index.php?topic=5416941.0Bu özelliğin de foruma eklenmesi gerektiğini ve ekleneceğini düşünüyorum. Tek kişiye ait mesajları takip etme olayını müthiş kolaylaştırıyor. Şu anki versiyonda kullanıcının mesajlarını tarayıp içerisinde bulmanız gerekiyor yada TryNinja'ya ait Ninjastic Space üzerinde bu aramayı gerçekleştirmeniz gerekiyordu. https://ninjastic.space/topic/5416941Örneğin PowerGlove kullanıcısının öneri başlığındaki mesajlarını içeriyor. Yada daha genel olarak herkesin kaç post attığını ve postlarını görmek isterseniz topic ID olarak aratıp users sekmesini kullanmak gerekiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "October 20, 2022, 09:05:59 PM",
      "body": "Quote from: Bthd on October 20, 2022, 08:57:55 PMQuote from: meser# on October 13, 2022, 08:30:43 AMPowerGlove bu seferde mesajın yazarının bir sonraki ya da bir önceki mesajına iletecek buton yaması hazırlamış bakalım theymos bunu yayına alacak mı https://bitcointalk.org/index.php?topic=5416941.0Bu özelliğin de foruma eklenmesi gerektiğini ve ekleneceğini düşünüyorum. Tek kişiye ait mesajları takip etme olayını müthiş kolaylaştırıyor. Şu anki versiyonda kullanıcının mesajlarını tarayıp içerisinde bulmanız gerekiyor yada TryNinja'ya ait Ninjastic Space üzerinde bu aramayı gerçekleştirmeniz gerekiyordu. https://ninjastic.space/topic/5416941Örneğin PowerGlove kullanıcısının öneri başlığındaki mesajlarını içeriyor. Yada daha genel olarak herkesin kaç post attığını ve postlarını görmek isterseniz topic ID olarak aratıp users sekmesini kullanmak gerekiyor.Evet eklenmesi gerçekten de işlevselliği arttıracaktır. Tabi bizim lokalde fazla işlevsel olmayabilir şu aralar ama globalde gerçekten de işe yarayacaktır. Aslında benim beklentim bir mesaja gelen cevaplar eklentisi olması yönünde. Örneğin bir mesaj atılmış 40 sayfalık bir konuda ve mesaj sizi ilgilendiriyor ya da cezbediyorsa hakkında nasıl cevaplar geldiğine dair bakmanız gerekebiliyor. Ya da bununda bir kısayolu var mı bilmiyorum   Mesajı yazan ben olduğum zaman telegram botu olan BitcoinTalk SuperNotifier V2 gerçektende işlevsel oluyor ( Kamu spotu: mesajınız alıntılandığında, kullanıcı adınız bir mesajda geçtiğinde veya merit aldığınızda telegram üzerinden bildirim almak isterseniz @BTTSuperNotifier_bot bu botu kullanabilirsiniz bunun ana konusu vardı ama hatırlayamadım şimdi) ama dediğim gibi başkasının mesajında biraz uğraştırabiliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "October 21, 2022, 10:39:21 AM",
      "body": "Hoş bi yenilik bence. Her yenilik hoştur gerçi. Ama Bitcointalk yenilik konusunda biraz ağır bi forum olduğu için yeniliklerin hepsi hoş oluyor gerçi.  Forumdaki yazılımcılar yenilik yapsa. Sonra yenilikler oylansa. Yazarların katılımıyla gelişen eşitlikçi bi yer olsa burası. Süper olur. Ama gelenekselcilik hakim forum yönetiminin düşüncesinde sanırım. Forumu eskisi gibi muhafaza etmeye çalışıyorlar. Yeniliklere çok açık değiller. Açıksalar bile hızlı değişime açık değiller sanırsam. Bitcointalk'a bildirim, mobilite özellikleri gelse kullanıcı sayısı da artar buranın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}