{
  "id": "topic_5466082",
  "title": "apilpirman17",
  "author": "apilpirman17",
  "created_time": "September 08, 2023, 07:13:51 AM",
  "content": "In short, the answer is no. Banks and crypto are not opposites, but they have different purposes and ways of working. Banks are traditional financial institutions that provide services such as savings, loans, and money transfers. Crypto is a digital currency that uses blockchain technology.There are some potential conflicts between banks and crypto. For example, banks are concerned that crypto could reduce the use of fiat currency and reduce their revenue from services such as credit cards and loans. Additionally, banks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.However, there is also potential for collaboration between banks and crypto. For example, banks can use crypto to improve efficiency and reduce costs. Additionally, banks can use crypto to provide new services to customers, such as loans based on crypto assets.Here are some examples of potential conflict and collaboration between banks and crypto:Conflict:Banks are concerned that crypto could reduce the use of fiat currency and reduce their revenue from services such as credit cards and loans.Banks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.Collaboration:Banks can use crypto to improve efficiency and reduce costs.Banks can use crypto to provide new services to customers, such as loans based on crypto assets.Ultimately, the future of the relationship between banks and crypto is uncertain. However, it is clear that both will continue to evolve and influence each other.Additional thoughts:It is important to note that the relationship between banks and crypto is still in its early stages. As both technologies continue to develop, it is likely that we will see new and innovative ways for them to work together",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466082",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "September 08, 2023, 07:31:22 AM",
      "body": "I don't know where this is coming from but one thing that is certain is that banks and crypto are never in competition whatsoever as Crypto can't do without banks but banks can do without crypto.Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMHere are some examples of potential conflict and collaboration between banks and crypto:Conflict:Banks are concerned that crypto could reduce the use of fiat currency and reduce their revenue from services such as credit cards and loans.Banks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.What you stated above are the concerns of the government and not banks, only that some banks will not tell you when they are behaving anti-crypto, it's the government's undertone and regulators on their neck. It's business as usual for banks as no one can purchase crypto without the banks and no one will sell crypto for money and not get the money in their bank account or in fiat online.QuoteCollaboration:Banks can use crypto to improve efficiency and reduce costs.Banks can use crypto to provide new services to customers, such as loans based on crypto assets.Ultimately, the future of the relationship between banks and crypto is uncertain. However, it is clear that both will continue to evolve and influence each other.I believe that fiat banks and crypto banks will always be separated unless a bank has both in their different branches of operations. Mind you, the risk with crypto is very high, fiat banks might not consider it but might continue to deal with crypto-related businesses if there is no restriction in their country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "September 08, 2023, 07:54:06 AM",
      "body": "Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMBanks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.This is false, it's not that easy to use crypto for illegal activity, do you think fiat can't be used for illegal activity? go search in google. Even you use a privacy coin, you still need to trust someone and it's sometime will expose your identity, receiving money through bank will make the sender know your real name.QuoteBanks can use crypto to improve efficiency and reduce costs.Yes. But since Bitcoin is decentralized, it shouldn't be associated with banks or any other third party intermediary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 08, 2023, 08:31:49 AM",
      "body": "Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMConflict:Banks are concerned that crypto could reduce the use of fiat currency The government of a country decides which currency should be used and not banks. Since government knows that they can't control the use of bitcoin because it is decentralized that is why some countries see it as a threat to their local currency,making them to ban cryptocurrency.Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMBanks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.Not banks but the government. Who says bank isn't used for money laundry. In my country as long as you know the bank manager of a branch and you are a politician, you have the free access to launder money and give the bank manager his own quarter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "September 08, 2023, 08:34:39 AM",
      "body": "Banks are concerned that crypto can affect their source of income, they are concern that it will affect their business and people won't want to deposit large amount of money in the banks anymore, remember that Banks are very good at using their customers funds to make more money, especially those amounts in fixed accounts locked for a long period of time. Crypto is eye opening, as banks as made many people believe that interest way is the way to make money off your deposited amount, the longer you leave the money in your account the more you get get some percentage annually, now we all know it's nonsense, crypto gets people to where they wanted to get to, and faster. Government is worried about a few different things too, they pretend that they are saving the people from a big bubble but that's not true, there is more to their concerns, they control banks and they have no control over Bitcoin because it's decentralized, Bitcoin also brings better ROI than Real estate and co, meaning many lives can change if done right, the poorer people gets the better for the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 08, 2023, 09:17:53 AM",
      "body": "Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMHere are some examples of potential conflict and collaboration between banks and crypto:Conflict:Banks are concerned that crypto could reduce the use of fiat currency and reduce their revenue from services such as credit cards and loans.Banks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.I understand that cryptocurrencies can be used to launder money, but the only individuals who will engage in such criminal activity are those who hold crypto assets for illicit purposes. Now, I want to ask you, Isn't money laundering also done using fiat currency? Doesn't it also apply to things that are illegal?In other words, fiat money is identical to cryptocurrency, which is utilized for criminal purposes like money laundering. Because of this, I occasionally find it puzzling when individuals claim that Bitcoin or other cryptocurrencies can be used in criminal activity when the same is true with conventional money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "September 08, 2023, 09:20:31 AM",
      "body": "Another possibility is that banks may be reluctant to embrace cryptocurrencies because they cannot regulate and control them. They may not want to jeopardize their success with FIAT currencies. Maintaining a good relationship with the government is advantageous for banks since they can open or close the door to cryptocurrencies at their discretion.In fact, banks can also respond to the public's demand for cryptocurrency adoption by implementing Central Bank Digital Currencies (CBDCs), where cryptocurrency is backed by FIAT currency but the network is centralized and controlled by the bank.Individuals familiar with Bitcoin must accept the reality that government and bank policies are the key determinants of how extensively the public can use Bitcoin. Governments and banks also undoubtedly consider profit as a significant factor influencing decisions related to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legendbtc",
      "created_time": "September 08, 2023, 09:46:15 AM",
      "body": "Quote from: Helena Yu on September 08, 2023, 07:54:06 AMQuote from: apilpirman17 on September 08, 2023, 07:13:51 AMBanks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.This is false, it's not that easy to use crypto for illegal activity, do you think fiat can't be used for illegal activity? go search in google. Even you use a privacy coin, you still need to trust someone and it's sometime will expose your identity, receiving money through bank will make the sender know your real name.Sadly, up to now, there are still many cryptocurrency investors with that distorted mindset. Those are just silly, ridiculous claims that the government has spread to keep people away from bitcoin, and most people realize that. But why hasn't the OP realized that yet?Quote from: Helena Yu on September 08, 2023, 07:54:06 AMQuoteBanks can use crypto to improve efficiency and reduce costs.Yes. But since Bitcoin is decentralized, it shouldn't be associated with banks or any other third party intermediary.What he's saying in general is cryptocurrencies including altcoins, not just bitcoin. And we can also see altcoins like LINK or XRP collaborating and being used in the banking system. That would create a huge effect, but unfortunately it is still a centralized system and they cannot compare to the decentralization of the bitcoin network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "September 08, 2023, 10:00:04 AM",
      "body": "Ordinarily banks issue payments and savings, similar to what cryptocurrency is about. But, there are multiple differences between the both. Cryptocurrency transactions have nothing to do with banks. Bitcoin as a network keeps record of all transaction in the blockchain and users can access the transaction histories using explorers. It's open for everyone to see. Banks on the other hand, don't have a place where customers can see what another account is doing with their funds. Only the banking authorities have access to individual accounts. That's is contrary to bitcoin, where a specific address can be examined, though the owner is not known, to find where a transaction was sent to and the amount removed from the address. Bitcoin use private keys and digital signature to access funds stored on the blockchain; input and output. Signatures are used on banks too and the facial recognition, that's for inside bank transactions. But, no private keys whatsoever is needed in banks. Unless banks have started looking out to implementing such features. Cryptocurrency and banks are two different financial systems, where fiats are converted to cryptocurrency and vice versa. But, in a transaction where both parties don't need fiat, its crypto to crypto without any third party. And, it's necessary not to forget that p2p is the primary aim of cryptocurrency, which keeps it far different from banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 08, 2023, 10:13:54 AM",
      "body": "Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMIn short, the answer is no. Banks and crypto are not opposites, but they have different purposes and ways of working. Banks are traditional financial institutions that provide services such as savings, loans, and money transfers. Crypto is a digital currency that uses blockchain technology.In my country, the rate of inflation is concerning and I do not see any wise person or knowledgeable person that should safe in fiat. But you are not wrong, some people are business men and women and they have to depend on banks if their customers pay more in fiat and that is how most businesses are. Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMThere are some potential conflicts between banks and crypto. For example, banks are concerned that crypto could reduce the use of fiat currency and reduce their revenue from services such as credit cards and loans. Additionally, banks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.In countries with high inflation rate, many people in the countries are saving money using cryptocurrencies. Fiat are mostly used in illegal activities and money laundering.Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMHowever, there is also potential for collaboration between banks and crypto. For example, banks can use crypto to improve efficiency and reduce costs. Additionally, banks can use crypto to provide new services to customers, such as loans based on crypto assets.Bank will not use cryptocurrencies to reduce cost, they will use it like those exchanges with high transaction fees. Banks will use crypto for earning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 08, 2023, 10:40:45 AM",
      "body": "They're opposites in some sense and not in others. For example, banks are heavily centralized while Bitcoin is decentralized, or banks are third parties while Bitcoin eradicates third parties. Those are opposites. However, in the sense that they're both providing financial services to the people, they're not really opposites. It's just that they have different systems. I guess it's acceptable to a certain extent that banks would adapt to the growing demand and use of Bitcoin. The problem, however, is that the current banking system is fundamentally flawed. Fractional reserve, for example, is both risky and unfair. And if they continue to apply this principle while embracing Bitcoin, the main purpose of Bitcoin is defeated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "September 08, 2023, 10:43:45 AM",
      "body": "Quote from: apilpirman17 on September 08, 2023, 07:13:51 AM-snip-If a bank is a service that provides transaction services, then crypto also functions the same. Many cryptos are similar to banks in that they are centralized. Unlike bitcoins.I don't want to equate bitcoin with crypto including banks. Apart from all that. The presence of bitcoin as a payment system is able to provide the best that is different, such as managing bank transactions.Banks are never honest. They take advantage of customer deposits to be rotated which can bring profits through interest percentages.The central bank does not like the uncontrolled bitcoin system.Do banks need to be trusted? everyone has the answer.Quote from: https://satoshi.nakamotoinstitute.org/posts/p2pfoundation/1/#selection-45.95-45.539The central bank must be trusted not to debase the currency, but the history of fiat currencies is full of breaches of that trust. Banks must be trusted to hold our money and transfer it electronically, but they lend it out in waves of credit bubbles with barely a fraction in reserve. We have to trust them with our privacy, trust them not to let identity thieves drain our accounts. Their massive overhead costs make micropayments impossible.I know that bank collaboration with crypto, such as XRP, is already underway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "September 08, 2023, 10:44:20 AM",
      "body": "Banks and cryptocurrencies will be used together, central banks and banks or generally governments won't be able to stop it. People have their voice and power so governments can not prohibit their citizens to use cryptocurrencies in all nations globally. Simply, they can not do it in nations where power is not centralized in dictators and dictatorship.Banks will follow central banks that are going to create more CBDCs that will be used by citizens. Citizens have other options, Bitcoin and cryptocurrencies and if they feel unsafe with CBDCs or any cryptocurrency deployed by banks, they will choose Bitcoin.CBDC tracker with information about CBDC developments globally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "September 08, 2023, 11:08:29 AM",
      "body": "Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMThere are some potential conflicts between banks and crypto. For example, banks are concerned that crypto could reduce the use of fiat currency and reduce their revenue from services such as credit cards and loans. Additionally, banks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.Banks shouldn’t be concerned just yet about the so called reduction of the use of fiat currency. Fiat money is for now, what’s legally recognized as money, used as the medium of exchange and somewhat unrivaled as the primary means of making payments so banks shouldn’t fret. Banks concerned about crypto being used to launder money and fund terrorists? More like unhappy they’re losing out on the revenue that would have been gotten from laundering the funds themselves. Financial institutions have long been used to launder funds as well as fund terrorist organizations and activities perhaps unwittingly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "September 08, 2023, 12:02:45 PM",
      "body": "-  Is there any chance that the bank has an interest in cryptocurrency? It's like I've never heard news like this, because usually banks don't like cryptocurrency because they see it as a competitor. And a big obstacle to their business. Few people really recognize Bitcoin and crypto in the reality that is happening today.Even though they know they can really help, they still pretend not to. Because they are afraid or worried that their customers might switch from fiat to cryptocurrency. After all, they are not the same, and they have many differences from each other in reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "September 08, 2023, 12:04:15 PM",
      "body": "Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMConflict:Banks are concerned that crypto could reduce the use of fiat currency and reduce their revenue from services such as credit cards and loans.Banks are concerned that crypto could be used for illegal activities such as money laundering and terrorist financing.I assume that you are referring to the Central Bank because commercial banks will always abide by the regulations of the former. Central Banks will always stand against cryptocurrencies because it is decentralized. They are scared that they will lose control of the nation's financial sector. The central banks use monetary policy to control inflation, hence they assume that allowing cryptos is like transferring monetary control to actors in the cryptosystem. Crypto is the most inappropriate currency to use for financing criminal activities. We shouldn't forget that crypto transactions is recorded on the blockchain and can be accessed by everyone. So transactions can be traced especially if the actors use a centralized platform. But cash fiat cannot be traced which is why it is best to finance criminal activities. QuoteCollaboration:Banks can use crypto to improve efficiency and reduce costs.Banks can use crypto to provide new services to customers, such as loans based on crypto assets.Ultimately, the future of the relationship between banks and crypto is uncertain. However, it is clear that both will continue to evolve and influence each other.Commercial banks are not against cryptocurrencies because they can always offer profitable services in the sector. Banks can offer exchange services and give cryptos loans and credit facilities. It is the central bank that is against cryptos because commercial banks have more to gain than lose if they integrate crypto services with fiat operations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 08, 2023, 12:20:05 PM",
      "body": "Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMIn short, the answer is no. Banks and crypto are not opposites, but they have different purposes and ways of working.Banks and cryptocurrency are different, maybe you should then put it this way that fiat and cryptocurrencies which you will still get the response that they are different fro each other, only the similarity is in the means of making payments, having the different purpose they both come to serve is what makes their difference, bank is a physical building where financial activities are being done, cryptocurrency is a digital form of currency that uses blockchain to operate it's activities.Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMBanks are traditional financial institutions that provide services such as savings, loans, and money transfers. Crypto is a digital currency that uses blockchain technology.Which means they are different from each other, you can have loan in cryptocurrency because it work by a decentralized network of blockchain, where every other applications and contracts and networks on blockchain independently exist on its own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "September 08, 2023, 02:01:33 PM",
      "body": "Quote from: tbct_mt2 on September 08, 2023, 10:44:20 AMBanks and cryptocurrencies will be used together, central banks and banks or generally governments won't be able to stop it. People have their voice and power so governments can not prohibit their citizens to use cryptocurrencies in all nations globally. Simply, they can not do it in nations where power is not centralized in dictators and dictatorship.Banks will follow central banks that are going to create more CBDCs that will be used by citizens. Citizens have other options, Bitcoin and cryptocurrencies and if they feel unsafe with CBDCs or any cryptocurrency deployed by banks, they will choose Bitcoin.CBDC tracker with information about CBDC developments globally.With my firm conviction, I believe in the coexistence and development of both.  But saying that the government cannot ban us from using bitcoin is not entirely correct, they are still the ones who make all the decisions. If we really have a voice and power, why can't anyone fight for bitcoin to become a currency? Meanwhile, the government only accepts bitcoin as a commodity and they will never allow bitcoin to become a currency and we will have no right to demand that from them. CBDC will be what they force us to use and we do not have the right to choose bitcoin as an alternative payment method to CBDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "September 08, 2023, 02:18:48 PM",
      "body": "First thing first, Fiat is actually a lot easier to be used for illegal activity, especially if the transaction is not a wired transfer, just cash, and no deposit or anything to the Bank. If what you mean as Banks are the institution where you safe your money, then no, they never have any problem with crypto, some of Banks in my countries actually supporting Crypto Exchange. The institution that has problem with Crypto is Central Bank which is controlled by the Government, they would never let crypto to be widely used as a currency replacing their fiat currency, for many and complicated reasons but mainly because Crypto is a lot harder for government to be controlled and monitored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "September 08, 2023, 02:24:46 PM",
      "body": "Quote from: apilpirman17 on September 08, 2023, 07:13:51 AMIn short, the answer is no. Banks and crypto are not opposites, I think you misunderstand between the two. Banks are controlled and supervised under the auspices of the government, while cryptocurrencies are decentralized and cannot be controlled by any government throughout the world. One of the reasons why many people prefer Cryptocurrency transactions over transactions using bank services is because banks can face failure while cryptocurrency does not face a single point of failure. Another advantage of Cryptocurrency compared to banks is that it is a peer to peer transaction method and does not have intermediary services like banks.The government has control/supervision and can limit some transactions in banking, Cryptocurrency allows users to transfer funds instantly without restrictions because Cryptocurrency is not under government supervision. You can transfer Cryptocurrency across countries without working hours restrictions, whereas Banks have working hours limitations and it takes some processes to transfer across countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}