{
  "id": "topic_5440927",
  "title": "FFrankie",
  "author": "FFrankie",
  "created_time": "February 23, 2023, 04:54:24 AMLast edit: February 23, 2023, 12:15:10 PM by FFrankie",
  "content": "Yep little ridiculous I sent them 0.001 btc to fund 2 notes.They funded neither of themI loaded one note a couple years later and gave it away.  They will NOT refund me the 0.005 btc or put it on the note. That is literally stealing",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440927",
  "comments": [
    {
      "author": "polymerbit",
      "created_time": "February 23, 2023, 05:46:08 AM",
      "body": "This is an open and shut case of slander. Here is our response to him:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "February 23, 2023, 05:53:26 AM",
      "body": "FFrankie - the note you tried to auction earlier this week but ended shows no funding",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hookzup1",
      "created_time": "February 23, 2023, 06:16:24 AM",
      "body": "I really want this note if it's still available 🙏",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FFrankie",
      "created_time": "February 23, 2023, 12:13:11 PM",
      "body": "Quote from: polymerbit on February 23, 2023, 05:46:08 AMThis is an open and shut case of slander. Here is our response to him: Thats not true. I sent you BTC to fund the note. YOU did not fund the note. I sent more BTC to the note to fund it. and now you wont fund the note because it already has BTC on it? or give me back the 0.005 btc that is stealing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "February 23, 2023, 12:56:29 PM",
      "body": "to be able and to want to solve all this, so that nobody is put into the black light hereplease FFrankie should post the two polymerbit notes with the respective BTC fundig addresses and additionally the tx-id of the respective transactions which then shows that the respective amount has been sent to exactly these addresses by you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "February 23, 2023, 03:30:23 PM",
      "body": "ok so there are 2 notes in question here.first one was not funded (funding was sent to polymerbit) then FFrankie funded one of the two notes. did you follow up when you received the notes initially to have Polymerbit fund it at that time? if so, provide this message. if you never followed up upon receiving the notes and then funded one yourself, then you cannot expect polymerbit to fund the note for a second load - maybe refund you? not sure. the second note should easily be funded with no issues - provided you can show proof of you sending the funding to polymerbit.Seems like fault would lie on the point of whether it was ever communicated to polymerbit that you received your notes.if you informed them and they never did the funding,  the fault is on polymerbit.if you received the notes and after 3 years are finally stating you need your funding, the fault is on you.at least that is my opinion.that said - if you work with polymerbit, I am sure they would make you whole - one way or another. if you slander them and/or attack them, they are less likely want to assist - especially if the initial reason the notes are not funded is because you never followed up years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FFrankie",
      "created_time": "February 23, 2023, 07:24:55 PM",
      "body": "Quote from: FFrankie on July 13, 2019, 10:52:48 PMCan you give me a btc payment address and a USD total that I owe you for the two notes? my 50$ scrib note coupon is \"jC7F7Jnu\"I also overpaid 0.0003 btc on the loading fee as seen by the transaction here:https://www.blockchain.com/btc/tx/22b27a6c6c771b10f0347a1315864a5b68d99f6066aeb2851a8097d60ec325c7I don’t have the second note in question because I gave it away",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "polymerbit",
      "created_time": "March 06, 2023, 08:32:51 PM",
      "body": "Quote from: FFrankie on February 23, 2023, 07:24:55 PMQuote from: FFrankie on July 13, 2019, 10:52:48 PMCan you give me a btc payment address and a USD total that I owe you for the two notes? my 50$ scrib note coupon is \"jC7F7Jnu\"I also overpaid 0.0003 btc on the loading fee as seen by the transaction here:https://www.blockchain.com/btc/tx/22b27a6c6c771b10f0347a1315864a5b68d99f6066aeb2851a8097d60ec325c7I don’t have the second note in question because I gave it awayKindly check the wallets again. Thanks. Note 42 is blacklisted.We now consider this matter closed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}