{
  "id": "topic_5406545",
  "title": "Cryptornd",
  "author": "Cryptornd",
  "created_time": "July 16, 2022, 08:27:37 PM",
  "content": "My trust wallet  has been  hacked by someone .some of my funds has been sent to hacker's address . when i send funds to that address again ( wallet is trust wallet ) those funds are automatically send away to another address before it comes to wallet .how could it be possible ? any solutions?  i have some valuable tokens in that wallet which has no market value yet. i need to send them to another address .so i tried to send some bnb ( bsc ) to that address and send my rest of tokens to another address . ( all of tokens which i think to transfer are Bep20 ) So i sent some bnb for transaction fee. thats when the problem happened . Help me guyz. How to stop automatic sending to another address",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406545",
  "comments": [
    {
      "author": "dragonvslinux",
      "created_time": "July 16, 2022, 08:56:39 PM",
      "body": "First off, never send funds to a hacked address, the hackers will simply steal your coins (again).Second, create a new wallet securely. Ideally use a hardware wallet to avoid getting hacked in the future.Third, scan your device for malware/viruses etc. There's a chance someone has access to your device. Maybe also avoid using wallet's that have the word \"trust\" in them. They are probably not as trust-worthy as you think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 16, 2022, 09:03:52 PM",
      "body": "Quote from: Cryptornd on July 16, 2022, 08:27:37 PMMy trust wallet  has been  hacked by someone .some of my funds has been sent to hacker's address . when i send funds to that address again ( wallet is trust wallet ) those funds are automatically send away to another address before it comes to wallet .how could it be possible ? any solutions?  i have some valuable tokens in that wallet which has no market value yet. i need to send them to another address .so i tried to send some bnb ( bsc ) to that address and send my rest of tokens to another address . ( all of tokens which i think to transfer are Bep20 ) So i sent some bnb for transaction fee. thats when the problem happened . Help me guyz. How to stop automatic sending to another address I didn't even understand what exactly happened. You say that when you send funds to that address, they are sent away to yet another address before it comes to the wallet. I don't understand this last part \"before it comes to the wallet\" What you mean by this? Can you be a bit more specific on how it all happened?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 16, 2022, 09:19:11 PM",
      "body": "Quote from: Cryptornd on July 16, 2022, 08:27:37 PMMy trust wallet  has been  hacked by someone .some of my funds has been sent to hacker's address . when i send funds to that address again ( wallet is trust wallet ) those funds are automatically send away to another address before it comes to wallet .how could it be possible ? any solutions? Stop sending coins to that wallet. It's compromised. The hacker injected some script to forward whatever coins you sent to the wallet. So anything you send to the wallet it will be forwarded to the hackers given address.Quotei have some valuable tokens in that wallet which has no market value yet. i need to send them to another address .so i tried to send some bnb ( bsc ) to that address and send my rest of tokens to another address . ( all of tokens which i think to transfer are Bep20 ) So i sent some bnb for transaction fee. thats when the problem happened . Help me guyz. How to stop automatic sending to another address Try to move all tokens / coins to a new wallet which is not compromised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 16, 2022, 09:20:45 PM",
      "body": "Quote from: Cryptornd on July 16, 2022, 08:27:37 PM Help me guyz. How to stop automatic sending to another address You can't stop it. The hacker probably has a bot set up to detect any incoming transaction into the wallet and then spend the coins as soon as they reach the address, probably in seconds.Solution?Stop seeing the BNB to the wallet and move on. Good thing you said the tokens in the address have no value. Also, try to find out how your wallet was hacked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 16, 2022, 09:33:46 PM",
      "body": "Quote from: JeromeTash on July 16, 2022, 09:20:45 PMAlso, try to find out how your wallet was hacked. OP said trust wallet. I thought they had a desktop version but it seems they don't. So it's basically a mobile wallet. For crypto I will never trust a mobile device to have any wallet. Mobile devices are more vulnerable then desktop and laptops.There are no use to find how it was hacked. If I was in OP's situation I would format the entire device to wipe away everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 16, 2022, 09:58:27 PM",
      "body": "Quote from: BitcoinGirl.Club on July 16, 2022, 09:33:46 PMSo it's basically a mobile wallet. For crypto I will never trust a mobile device to have any wallet. Mobile devices are more vulnerable then desktop and laptops.I beg to disagree, desktops are more vulnerable than any kind of android phones of this current security patch.. It's just a difference of good practice on how people using their device while doing their crypto stuff.By the look of it op probably got phished which is more vulnerable in phones if you dont have any idea of what you are downloading.Always check the sources and its main website before downloading apps especially in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "July 16, 2022, 10:09:46 PM",
      "body": "Quote from: PX-Z on July 16, 2022, 09:58:27 PMQuote from: BitcoinGirl.Club on July 16, 2022, 09:33:46 PMSo it's basically a mobile wallet. For crypto I will never trust a mobile device to have any wallet. Mobile devices are more vulnerable then desktop and laptops.I beg to disagree, desktops are more vulnerable than any kind of android phones of this current security patch.. It's just a difference of good practice on how people using their device while doing their crypto stuff.By the look of it op probably got phished which is more vulnerable in phones if you dont have any idea of what you are downloading.Always check the sources and its main website before downloading apps especially in crypto.They are both online wallet and they are both vulnerable, depending on the one you use more for online activities. But mobile wallets are said to be more vulnerable because you take mobile device outdoor and putting it in your pocketbwhich have more chances of being lost, being outside makes it more vulnerable. For malware attack, they can both be protected by your online anti hack or anti malware practice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 16, 2022, 10:27:57 PM",
      "body": "Quote from: Oshosondy on July 16, 2022, 10:09:46 PMThey are both online wallet and they are both vulnerable, depending on the one you use more for online activities. But mobile wallets are said to be more vulnerable because you take mobile device outdoor and putting it in your pocketbwhich have more chances of being lost, being outside makes it more vulnerable. For malware attack, they can both be protected by your online anti hack or anti malware practice.Of course, all device that has internet access are vulnerable, but androids dont get malware as much and as severe as desktop/laptops.Phones cannot be infected malware just by carrying it outside — Obviously, we're talking malware vulnerabilities, any device carrying outside is prone to loss and damage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "July 16, 2022, 11:03:23 PM",
      "body": "If I am reading this correctly then the problem is not with the trust wallet being hacked, rather the problem is in the device he is using to send coins to the trust wallet.I believe his device is infected with the clipboard malware which changes the trustwallet address with the hacker's address.What makes me believe this is him saying \"those funds are automatically send away to another address before it comes to wallet\"If his wallet was comproized then the coins should appear at least for a moment before they get transfered again by the hacker or he could see the transactions on the transactions history.OP, take a look at this thread to know if your device is indeed infected with clipboard malware and how to move your coins safely in such case:How to lose your Bitcoins with CTRL-C CTRL-V",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "July 16, 2022, 11:10:33 PM",
      "body": "That's pretty bad you can't able to do anything if your BNB is automatically sent to someone's address every time you funded it for transferring your tokens you have nothing to do.Unless if you are faster than the bot make a transaction right away after you sent bnb to that wallet.Or better wait for a few weeks and maybe the bot will stop sending them automatically. Have you exposed your private key to someone or other websites?There is nothing we can do if someone already has access to your private key and set a bot to automatically send funds to the hacker's address. What you can only do is wait for a few weeks or months until the hacker's bot is stop running.Quote from: khaled0111 on July 16, 2022, 11:03:23 PMOP, take a look at this thread to know if your device is indeed infected with clipboard malware and how to move your coins safely in such case:I never heard someone has been infected with clipboard malware using a phone Android or IOS. So I guess someone already has access to his private key and uses a script to run and automatically send funds to another wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "July 16, 2022, 11:39:53 PM",
      "body": "As in the previous post this had taken place through some person who have got access to the private key. Trust wallet is highly secure against the rest of the non custodial wallets. It is not secure as hardware wallets, because it is connected to the network. Now OP may request support from the Trust wallet team. You may contact support@trustwallet.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "July 16, 2022, 11:57:22 PM",
      "body": "Quote from: BitMaxz on July 16, 2022, 11:10:33 PMQuote from: khaled0111 on July 16, 2022, 11:03:23 PMOP, take a look at this thread to know if your device is indeed infected with clipboard malware and how to move your coins safely in such case:I never heard someone has been infected with clipboard malware using a phone Android or IOS. So I guess someone already has access to his private key and uses a script to run and automatically send funds to another wallet.Android devices can be infected by the clipboard hijacker malware too: https://www.welivesecurity.com/2019/02/08/first-clipper-malware-google-play/I believe OP is sending the coins to his trustwallet from a different device and that's the one which might be infected. Afaik, unlike bitcoin, you can't transfer bep coins unless the transaction gets confirmed. So, the sent coins must appear in his wallet before they get stolen if the hacker is using a bot to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "July 17, 2022, 12:13:01 AM",
      "body": "If you wallent has been hacked then you funds plus token is gone. although I don't know how it works, but I was made to understand that, once you misplaced, lost your seed phrase or forgot your wallet password then your fund is ever last gone. So, if a hacked penetrate to your wallet, that means, he has breaking your password and have access to your wallet and do whatever he likes. so to what extent, are you trying to retrieve your wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bestcoins1",
      "created_time": "July 17, 2022, 01:42:22 AM",
      "body": "Quote from: Cryptornd on July 16, 2022, 08:27:37 PMMy trust wallet  has been  hacked by someone .some of my funds has been sent to hacker's address . when i send funds to that address again ( wallet is trust wallet ) those funds are automatically send away to another address before it comes to wallet .how could it be possible ? any solutions?  i have some valuable tokens in that wallet which has no market value yet. i need to send them to another address .so i tried to send some bnb ( bsc ) to that address and send my rest of tokens to another address . ( all of tokens which i think to transfer are Bep20 ) So i sent some bnb for transaction fee. thats when the problem happened . Help me guyz. How to stop automatic sending to another address Has your BSC wallet ever been connected to several sites and to several exchanges such as Dex .?If there are still sites linked to your BSC wallet, try to disconnect them first. Although it won't completely save your wallet, because hackers may already know your wallet's private key, and don't send any more fees to transfer tokens that are still in the wallet unless you're willing to forfeit a very small fee for testing.Because you said \"the funds are automatically sent to another address before entering the wallet\". It looks like it was redirected by a hacker who might also own a site that your wallet was linked to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptornd",
      "created_time": "July 17, 2022, 01:45:54 AM",
      "body": "Quote from: BitcoinGirl.Club on July 16, 2022, 09:19:11 PMQuote from: Cryptornd on July 16, 2022, 08:27:37 PMMy trust wallet  has been  hacked by someone .some of my funds has been sent to hacker's address . when i send funds to that address again ( wallet is trust wallet ) those funds are automatically send away to another address before it comes to wallet .how could it be possible ? any solutions? Stop sending coins to that wallet. It's compromised. The hacker injected some script to forward whatever coins you sent to the wallet. So anything you send to the wallet it will be forwarded to the hackers given address.Quote How to prevent that? thats what i need to preventi have some valuable tokens in that wallet which has no market value yet. i need to send them to another address .so i tried to send some bnb ( bsc ) to that address and send my rest of tokens to another address . ( all of tokens which i think to transfer are Bep20 ) So i sent some bnb for transaction fee. thats when the problem happened . Help me guyz. How to stop automatic sending to another address Try to move all tokens / coins to a new wallet which is not compromised. yeah i need to transfer those tokens. but when i transfer some bnb for transaction fee, those are send away to another address as soon as they arrived. what shoul i do??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "July 17, 2022, 02:39:00 AM",
      "body": "Quote from: Cryptornd on July 17, 2022, 01:45:54 AMyeah i need to transfer those tokens. but when i transfer some bnb for transaction fee, those are send away to another address as soon as they arrived. what shoul i do??Stop sending BNB to the compromised wallet address for the time being. The attacker would just drain your wallet till you ran out of BNB. Plus, I assume that the attacker is smart enough to not bother keeping your worthless tokens in tact in the wallet while your BNB is being stolen right after it has been received.Either you wait for a week or two until the bot stops working, or you move on and make a fresh-new wallet on a formatted device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 17, 2022, 02:40:47 AM",
      "body": "First, you must see if the coins reach the wallet or not, if they reach the wallet and then are transferred to another address, this means that your wallet has been hacked, or if the coins never reach the wallet but are transferred to another address immediately, this It means that your computer or mobile is infected with the clipboard virus that monitors any encrypted currency address in the clipboard and automatically changes it to the hacker address when it is pasted and thus all coins are transferred to the hacker’s address, in this case you have to download an updated virus program and clean the device or do Make a software for the device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GigaBit",
      "created_time": "July 17, 2022, 03:18:49 AM",
      "body": "As your wallet has gone under someone else's control that means hacked. You can no longer recover it. Rather, if you send any funds here, it will incur more losses. So you should open a new wallet and of course, to avoid hacking from your mobile device, it is best to scan any unnecessary apps or phishing sites. You should be more careful with your seed phrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smartaction",
      "created_time": "July 17, 2022, 03:44:46 AM",
      "body": "Quote from: Cryptornd on July 16, 2022, 08:27:37 PMMy trust wallet  has been  hacked by someone .some of my funds has been sent to hacker's address . when i send funds to that address again ( wallet is trust wallet ) those funds are automatically send away to another address before it comes to wallet .how could it be possible ? any solutions?  i have some valuable tokens in that wallet which has no market value yet. i need to send them to another address .so i tried to send some bnb ( bsc ) to that address and send my rest of tokens to another address . ( all of tokens which i think to transfer are Bep20 ) So i sent some bnb for transaction fee. thats when the problem happened . Help me guyz. How to stop automatic sending to another address Since it has passed to the control of the hacker. It will be very difficult for you to transfer any good token from here. Because the hacker is more smarter than you. Perhaps he has linked your wallet to a bot  When something is input or output to that wallet.  The hacker gets that notification within moments. And he instantly transfers it to another wallet. So I argue to you that  You leave this wallet. And open a new wallet and use that wallet carefully. If the wallet is for holding a large amount. In that case you can use a hardware wallet. It will protect you completely.Note -Stop sending coins to that wallet. and Since your problem is not related about bitcoin . This is a wallet issue and you were holding altcoins in your wallet.  And hackers are constantly taking altcoins from your wallet. you should move your topic to Beginners & Help or Altcoin Discussion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}