{
  "id": "topic_5499846",
  "title": "bbc.reporter",
  "author": "bbc.reporter",
  "created_time": "June 14, 2024, 12:59:20 AM",
  "content": "Do not be tricked by the government's storylines. It is always in their playbook to create fud very much similar to this new EU storyline then when the fear, uncertainty and doubt has been spread, they will begin regulatory proposals and rules on how to control this. This is not about your safety or the capturing of criminals. This is about government control.A new report from the EU has singled out Bitcoin's Lightning Network and other layer 2 solutions as \"data obfuscation\" technologies that could be \"abused by criminals.\"The First Report on Encryption by the EU Innovation Hub for Internal Security, a \"collaborative network of innovation labs\" from across EU member states, argues that alongside technologies including Mimblewimble, zero-knowledge (zk) proofs, coin mixers and privacy coins such as Monero and Zcash, \"layer 2 solutions such as the lightning network might also be abused by criminals.\"The report notes that the Lightning Network's \"two-party multisignature payment channels will not broadcast all transactions to the blockchain, but only the opening and closing of the channel,\" adding that it and other layer 2 solutions could cause cause \"problems for law enforcement investigations.\"Read in full https://decrypt.co/234748/bitcoin-lightning-network-and-layer-2-scaling-could-be-abused-by-criminals-says-eu",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5499846",
  "comments": [
    {
      "author": "BlackBoss_",
      "created_time": "June 14, 2024, 01:46:17 AM",
      "body": "Quote from: bbc.reporter on June 14, 2024, 12:59:20 AMA new report from the EU has singled out Bitcoin's Lightning Network and other layer 2 solutions as \"data obfuscation\" technologies that could be \"abused by criminals.\"They selectively attack Bitcoin and cryptocurrency, mixing services and even Mixing protocol, source code like Tornado Cash, in order to attack this industry.If they apply the same set of rules with knife, gun, Internet and other things in society, they will go to ban all things in human civilization. They will even have to ban their own centralized bank systems because banks and bank products are used by criminals too.I guessed that after attacking Bitcoin mixers, they will move their targets to Bitcoin Lightning Network but it will not stop here, layer 2, DeFi platforms, bridges will be their next targets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "June 14, 2024, 02:45:17 AM",
      "body": "lolNews Alert!! Criminals are gonna do criminal things!According to that kind of thinking we better ban cash and setup cameras in everyone's homes for the police to watch for criminal activity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Felicity_Tide",
      "created_time": "June 14, 2024, 02:55:00 AM",
      "body": "Quote from: bbc.reporter on June 14, 2024, 12:59:20 AMA new report from the EU has singled out Bitcoin's Lightning Network and other layer 2 solutions as \"data obfuscation\" technologies that could be \"abused by criminals.\"Oh I see. They've seen another possible threat to their proposed centralization. Just because the two-party multisignature payment channels will not allow them to monitor all transactions that looks to be happening behind the scene, they find it as a heavy threat. They are scared because the only thing they might have access to are all finalized transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 14, 2024, 03:16:49 AM",
      "body": "both EU and US are categorising LN as payment facilitators/money services in regards to users that act as routers in the US LN routers are classed as money service businessesin the EU LN routers are classed as PF (payment facilitators) so those operating as routers to get \"commission from facilitating a payment on behalf of someone else\", end up having a barrier of entry.. those routers need to either go extreme on privacy tools to evade getting found and demanded to go legit.. or go legit and operate in compliance to regulations to then be able to run without needing to hidefor those taking the evasive option end up doing so many things to effectuate obfuscation of their geo location and peer connectivity, they then fail at being able to promote their service of operating as a router, becasue they have to hide their advertising and connectivity so less people end up connecting to them thus get less income compared to a legit service with a licence. this then causes the legit service with a licence to then become the main route paths(institutional centralisation of network). because most businesses drop connections that are not legit/forthcoming, as peering to non legit peers becomes a problem for legit services",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 14, 2024, 03:55:57 AM",
      "body": "But is there anything that is not under attack in the EU? Well, yes, things like veganism, new genders (gender fluid and such), bike lanes that create more traffic jams in cities, mass immigration, victim mentality, permissiveness with criminals and aggressiveness against the honest citizen if he gets the wrong bin when throwing out the garbage. Things like that.If something is bullshit and it comes from the EU, I'm not surprised, given what I've seen. It's business as usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "June 14, 2024, 11:25:51 AM",
      "body": "Everything government can't control will be marked as criminal and illegal, that's why decentralization matters so much and that's why LN is doomed due to it's nature of becoming more and more centralized over time.Law can be abused, so there should be no law.  The only law mankind needs is the \"eye for an eye\" law, everything else is here to enslave us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 14, 2024, 11:44:49 AM",
      "body": "Quote from: bbc.reporter on June 14, 2024, 12:59:20 AMDo not be tricked by the government's storylines. It is always in their playbook to create fud very much similar to this new EU storyline then when the fear, uncertainty and doubt has been spread, they will begin regulatory proposals and rules on how to control this. This is not about your safety or the capturing of criminals. This is about government control.They should have by now been tired of all these because its taking them to nowhere, they have always been setting targets on attack for bitcoin and none availed till now, government will never support anything that can give us the required privacy that we want because its going to completely render them effortless towards having control over the system, we are the ones that should get determined and go for what we want and shift focus on news like this coming from them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "June 14, 2024, 01:05:13 PM",
      "body": "Politicians REALLLLLYYYYY need to get a bitcoin education. When you don't have a clue what you are talking about it is easy to turn a payment method into some sort of criminal facilitator in your mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 14, 2024, 01:53:01 PMLast edit: June 15, 2024, 10:24:36 AM by franky1",
      "body": "Quote from: thecodebear on June 14, 2024, 01:05:13 PMPoliticians REALLLLLYYYYY need to get a bitcoin education. When you don't have a clue what you are talking about it is easy to turn a payment method into some sort of criminal facilitator in your mind.you might want to learn what their regulations actually are. i have seen a few topics of people creating clickbait/fearbait titles nothing to do with the actual regulations but instead are OP's misinterpretation just to click bait discourse for viewsit then becomes harder to campaign/ petition against real negave changes of jurisdiction/treatment by government if these silly clickbait topics are distracting people away from the real issuesEGthe EU going after LN routers has nothing to do with bitcoin.. it about LN routing(totally different software needed(not bitcoin node) its also about a different network(not bitcoin) its also about the payment method and model is different to bitcoinLN routers process payments completely and utterly different to how mining pools and bitcoins nodes relay bitcoin transactions..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 14, 2024, 02:18:12 PM",
      "body": "Quote from: Poker Player on June 14, 2024, 03:55:57 AMBut is there anything that is not under attack in the EU? Well, yes, things like veganism, new genders (gender fluid and such), bike lanes that create more traffic jams in cities, mass immigration, victim mentality, permissiveness with criminals and aggressiveness against the honest citizen if he gets the wrong bin when throwing out the garbage. Things like that.If something is bullshit and it comes from the EU, I'm not surprised, given what I've seen. It's business as usual.Their job is to attack anything they don't like or don't understand, and anything to do with cryptocurrencies is an obvious target for a simple reason - it doesn't fight back in most cases. At one time, they even attacked their own currency because they concluded that the EUR 500 banknote is mainly used by terrorists and criminals, so they decided to remove it from use and years later they concluded that they were wrong. I wonder why Switzerland has a 1000 franc banknote and they never thought of such nonsense.When you mention trash, in my capital city, which was taken over by incompetent green politicians, they even established \"green spies\" who go around and dig through trash cans - and the people mockingly named them after a notorious communist organization that spied on everything possible at the time. However, in the elections for the EU parliament, we saw that the average EU resident has had enough of the green agenda and the policy of mass immigration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "June 14, 2024, 03:48:03 PM",
      "body": "Not just EU, every government will slowly try to control the circulation of cryptocurrency in their country. United States has started. EU has passed many bills regarding Anti Money Laundering approach and included cryptos in them. So what is happening was very much fixed from the beginning. It's very normal for the government to start and attack on something that they cannot fully control. EU is not an exception. But at least they haven't imposed a blanket ban on cryptocurrency. That would have been disastrous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "June 14, 2024, 05:48:04 PM",
      "body": "Quote from: avikz on June 14, 2024, 03:48:03 PMIt's very normal for the government to start and attack on something that they cannot fully control. EU is not an exception. But at least they haven't imposed a blanket ban on cryptocurrency. That would have been disastrous. I really believe this option is still on their cards if their attempts to enforce a more Law Abiding Bitcoin end up failing.  It is clear as day they are afraid of alternatives to the Fiat system that they can not have control over.  They want to make sure they know each and every little thing about you.I am very thankful Cash is still an option as long as it remains available.  I am very thankful of Lightning Network, Monero and Pre Paid cards.  When all of these are banned, hell will be on Earth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Itty Bitty",
      "created_time": "June 14, 2024, 05:48:52 PMLast edit: June 14, 2024, 06:00:09 PM by Itty Bitty",
      "body": "One would hope that a thoughtful court of law (should it come to that) would recognize that the usefulness to the public of greatly reduced time to complete a transaction ( a few seconds at most), along with  transaction fees that are a tiny fraction of main chain fees, would overwhelmingly dwarf the negative impact of the few illegal transactions that may be occurring (much like with cash). This is why I am kind of unimpressed with Phoenix wallet running away from the US market so quickly after the Samourai charges, when they weren't requested to block  US cutomers or charged with anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "June 14, 2024, 08:37:54 PMLast edit: June 16, 2024, 05:50:23 PM by Saint-loup",
      "body": "Yes I have been surprised when I read that yesterday, I really thought polices and law enforcement agencies had some means to track suspicious transactions over the Lightning Network but it seems to be very difficult for them actually. That's a pretty good news for the Lightning Network technology because it means it must also be difficult for private surveillance and intelligence agencies to track people and the transactions they do when they use this network, unlike what it can happen with blockchain transactions.https://www.europol.europa.eu/cms/sites/default/files/documents/EU_Innovation_Hub_First%20Report%20on%20Encryption.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 15, 2024, 06:54:08 AMLast edit: June 15, 2024, 10:23:10 AM by franky1",
      "body": "Quote from: Saint-loup on June 14, 2024, 08:37:54 PMYes I have been surprised when I read that yesterday, I really thought polices and law enforcement agencies had some means to track suspicious transactions over the Lightning Network but it seems to be very difficult for them actually. cryptocurrencies dont have eyes, ears or brains. they are just code. governments cant control the crypto because decentralised code has no brain. and authorities dont have the manpower to control, monitor all of cryptohowever authorities can control the businesses and people that interact with cryptogovernment and law enforcement do not track suspicious transactions of any/all crypto currency themselves..you will not find any office where cops or government leaders are sat at computers monitoring crypto transactions.... they delegate and use businesses to monitor their own customers and share information and then that information is used to investigate suspect crimes reported to authorities by the businesseslaws are made to cause businesses to become the monitoring services of their own customersEG river financial/bitrefills and all other known services that do/will operate on lightning offering payment facilitation services such as routing and 'renting balance' will become the monitors and reporterslaws are made to cause a barrier of entry for small business/individuals to offer services, so that the larger businesses that are licenced(regulated/delegated) where they are set up to KYC/monitor customers actions become the defacto gateways that customers use to enter/exit/use crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "June 15, 2024, 07:50:23 AM",
      "body": "Quote from: BlackBoss_ on June 14, 2024, 01:46:17 AMThey selectively attack Bitcoin and cryptocurrency, mixing services and even Mixing protocol, source code like Tornado Cash, in order to attack this industry.The thing is that normies will believe whatever the government comes up with because they couldn't be bothered to make their own research and make up their own opinions because it meant they would have to go against what the government is offering.QuoteI guessed that after attacking Bitcoin mixers, they will move their targets to Bitcoin Lightning Network but it will not stop here, layer 2, DeFi platforms, bridges will be their next targets.I cannot wait to hear what insane reason they can make up to try and bad mouth crypto particularly bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "June 15, 2024, 08:07:38 AM",
      "body": "Quote from: bbc.reporter on June 14, 2024, 12:59:20 AMA new report from the EU has singled out Bitcoin's Lightning Network and other layer 2 solutions as \"data obfuscation\" technologies that could be \"abused by criminals.\"How is LN doing data obfuscation, this part needs more clarity. Bitcoin LN for me is not Bitcoin and that is why I won't consider this ruling as an attack on Bitcoin. I also fail to understand why will criminals use LN when they have multiple options available to commit financial crimes, money laundering, convert black to white, etc. This decision according to me is trying to curb more regulation over the existing one and hamper Bitcoin LN adoption in the EU.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "June 16, 2024, 07:53:15 AM",
      "body": "Quote from: pakhitheboss on June 15, 2024, 08:07:38 AMQuote from: bbc.reporter on June 14, 2024, 12:59:20 AMA new report from the EU has singled out Bitcoin's Lightning Network and other layer 2 solutions as \"data obfuscation\" technologies that could be \"abused by criminals.\"How is LN doing data obfuscation, this part needs more clarity. Bitcoin LN for me is not Bitcoin and that is why I won't consider this ruling as an attack on Bitcoin.I think the attack is more directed on the lightning network instead of bitcoin itself. Still this might give a negative impact on to bitcoin itself as people have a hard time separating different concepts about crypto.Quote I also fail to understand why will criminals use LN when they have multiple options available to commit financial crimes, money laundering, convert black to white, etc. I too do not understand how this can be used for illegal activities but I will guess that it is because of the off-chain transaction that sets them off. The additional privacy can also be another factor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "B1-66ER",
      "created_time": "June 16, 2024, 08:44:10 AM",
      "body": "I hope that is not an article from Russian hackers attacking the EU and US via infowarfare propaganda. We should also consider how governments are dealing with these issues in Russia and China.BTC>The Lightning Network (LN) and GDPR share a goal of empowering individuals to have more control over their personal data. However there are challenges in both technical aspects. For example LN reduces on chain data storage, which aligns with GDPRs data minimization principles.When it comes to pseudonymity, versus anonymity, data controllers and processors must consider that LN transactions are linked to pseudonymous addresses rather than directly to personal identities. By implementing anonymity measures it becomes easier to uphold another core GDPR principle; the right to be forgotten.Additionally determining the roles of data controllers and processors is complicated by the nature of LN.Stepping back for a perspective the question arises; Should messages exchanged in LN be considered \"personal data \" or should they exclusively be viewed as financial data?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}