{
  "id": "topic_5397960",
  "title": "malcovi2",
  "author": "malcovi2",
  "created_time": "May 10, 2022, 12:29:27 AM",
  "content": "price: $.67 during the time of the posthttps://www.coingecko.com/en/coins/terra-usdDoes anyone know why its losing its value? I havent dived into terra because i am not interested on the project. Im glad, I didnt since i think TerraUsd and Terra affect each other.I think terra will be exposed a project that is just a big ponzi scheme.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397960",
  "comments": [
    {
      "author": "Psynthax",
      "created_time": "May 10, 2022, 01:06:11 AM",
      "body": "Terra was a scam project. Do known just emptied the bitcoin wallet as this used to back the UST. Remember that if UST unlike another stable token which fully pegged with dollar but UST was a bit different. This is algoritmic stable token that used different mechanism. That's why the price was dumping so hard. Do known has even sold some of his bitcoin to backed this stable token. It was so garbage as fuck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "May 10, 2022, 01:09:30 AM",
      "body": "I believe that this is just temporary. Terra Luna's team already released a statement about this case. A lot of people are worried about this, even me I have some UST but I am still calm. This is also because of the recent dump, for sure they didn't anticipate this but I am positive that they will become stable soon and fix this issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "May 10, 2022, 01:30:47 AM",
      "body": "Quote from: GreatArkansas on May 10, 2022, 01:09:30 AMI believe that this is just temporary. Terra Luna's team already released a statement about this case. A lot of people are worried about this, even me I have some UST but I am still calm. This is also because of the recent dump, for sure they didn't anticipate this but I am positive that they will become stable soon and fix this issue.I hope so, lots of people got liquidated for this clown show and media are starting to cover it, this incident will again would let more people cry for more stricter regulation. I really dont like when governments add more regulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IShishkin",
      "created_time": "May 10, 2022, 01:34:46 AM",
      "body": "Quote from: GreatArkansas on May 10, 2022, 01:09:30 AMI believe that this is just temporary. Terra Luna's team already released a statement about this case. A lot of people are worried about this, even me I have some UST but I am still calm. This is also because of the recent dump, for sure they didn't anticipate this but I am positive that they will become stable soon and fix this issue.Everything is possible in this world. There were cases when scammers successfully run second iteration of the same ponzi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "May 10, 2022, 02:19:33 AM",
      "body": "Supose they come back at the original price.But... the \"TRUST\" its completly destroyed in this \"run\". How can you explain this asides of losing / winning money.Why they are still losing value? They dont have a secure to cut out all the transaction like in normal wall street when the market its falling a lot they cut the round.Im not into this coin but seems particular.Quote from: malcovi2 on May 10, 2022, 01:30:47 AMQuote from: GreatArkansas on May 10, 2022, 01:09:30 AMI believe that this is just temporary. Terra Luna's team already released a statement about this case. A lot of people are worried about this, even me I have some UST but I am still calm. This is also because of the recent dump, for sure they didn't anticipate this but I am positive that they will become stable soon and fix this issue.I hope so, lots of people got liquidated for this clown show and media are starting to cover it, this incident will again would let more people cry for more stricter regulation. I really dont like when governments add more regulation.And THIS its the more important aside of all the discusion this made like a fire starter a lot, to the came of government with more regulation. Dont cry after if you make bad things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WalkerIVIV",
      "created_time": "May 10, 2022, 02:24:49 AM",
      "body": "Yeah and those blindly believers if terra luna still claim that if that will go back again to the $1 but yeah this proves that if terra luna UST is not even worth to be considered as a worthy stable token. Im so bad to see even those UST holders claimed to be stable token has been loosing their money. What a big shame. This foundation can't even build a proper stable token that truly pegged with the dollar value. So, any implementation other than using the real dollar to back the stable token was a big lie. People are distrusting this foundation and the price of token plunged so hard",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hichamito37",
      "created_time": "May 10, 2022, 03:20:17 AM",
      "body": "Quote from: Psynthax on May 10, 2022, 01:06:11 AMTerra was a scam project. Do known just emptied the bitcoin wallet as this used to back the UST. Remember that if UST unlike another stable token which fully pegged with dollar but UST was a bit different. This is algoritmic stable token that used different mechanism. That's why the price was dumping so hard. Do known has even sold some of his bitcoin to backed this stable token. It was so garbage as fuck. UST used to drop more than 40%, shortly after that LFG moved 28k2 bitcoin to binance to support and support UST price but this will cause a massive crash to the market. LFG is using all 3 billion USD of bitcoin accumulated previously to save UST. If it fails, Do known will be the cause of a large market crash like in 2018.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Osh",
      "created_time": "May 10, 2022, 03:37:39 AM",
      "body": "the current price of UST is $0.7, well, it started going up since this thread was created. however, its price development is slow enough to be considered a stable coin. that's why I prefer to use USDT or BUSD which has been used for a long time. however, if this continues, it will certainly create panic, and USDT users can quickly convert their assets into other stable coins. however, I hope that this is fixed soon. Even on social media, many people started writing on their walls about this. this can have a bad impact on the stability of other coins, especially for UST itself",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 10, 2022, 03:46:15 AM",
      "body": "Particularly some inside plays. Bitcoin is having a straigh dump and some big whales dump ust and at the same time short Luna resulting to a massive crash. But Do Kwon already said that a loan of 1.5b to repeg UST is currently deployed. This is like a wave timely on the bitcoin dump. Imagine if bitcoin pump, obviously others will recover too including luna and ust. However knowing stablecoin can be depeg such as this is quite scary. Especially I am taking advantage of their 18 to 19% apy now its down. But I do hope it could recover pretty fast to avoid such panic sell",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "May 10, 2022, 04:00:27 AM",
      "body": "Woke up an hour ago to this mess, I'm truly dumbfounded and never expected that such a thing would happen. I had a decent sum of money on a BUSD - UST vault on Beefy, which for some reason still displays my investment as 1:1. I truly don't know what to believe or to expect anymore, that's what I least expected to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "May 10, 2022, 04:08:05 AM",
      "body": "Wow finally the real face of terra luna already exposed. So many people are blaming this company even the active chart on CMC have so many people called this as another ponzi scheme. more than 51% dump and the worst thing that i have ever seen these days. People are starting to disbelief with this company and yeah welcome to the top 100 CMC soon. I believe this will become another medium  tier of exchange site. Only using bitcoin as a way to back the stable token. worst thing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "May 10, 2022, 04:15:05 AM",
      "body": "And probably this is affecting bitcoin market too, months ago if I'm not mistaken they said that they are going to invest billions in bitcoin, and maybe this is the after effect of it.Hopefully though they can cover this one, otherwise, they are just running on fractional reserves and actually don't have the money to back it up. And I agree that it really hurt their reputation here and it will be very difficult to recover from such 'negative' rep.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "May 10, 2022, 04:17:08 AM",
      "body": "Quote from: malcovi2 on May 10, 2022, 12:29:27 AMprice: $.67 during the time of the posthttps://www.coingecko.com/en/coins/terra-usdWhat the heck! I've just looked at it a few hours ago @ $0.95 and then it's more than it was before. Anyway, it's $0.7 right now and yeah, this is a crazy thing that the Terra team has made.Quote from: malcovi2 on May 10, 2022, 12:29:27 AMDoes anyone know why its losing its value? I havent dived into terra because i am not interested on the project. Im glad, I didnt since i think TerraUsd and Terra affect each other.It's because of what they did wasn't sustainable. There were many have said that it's going to fall as what the others have said. Their hype for buying bitcoin didn't do good for their own economy.Quote from: malcovi2 on May 10, 2022, 12:29:27 AMI think terra will be exposed a project that is just a big ponzi scheme.We'll see, but we have to see if this so called stable coin of theirs will recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "May 10, 2022, 04:31:11 AM",
      "body": "Quote from: Ultegra134 on May 10, 2022, 04:00:27 AMWoke up an hour ago to this mess, I'm truly dumbfounded and never expected that such a thing would happen. I had a decent sum of money on a BUSD - UST vault on Beefy, which for some reason still displays my investment as 1:1. I truly don't know what to believe or to expect anymore, that's what I least expected to happen.If you check coingecko and Binance its true that its depeg now. Tradimg at 0.77 as of this writing. Me too caught up in the mess with my ust holding but remain calmly as possible. If the ust failed then expect some fear on other stablecoins too that it could happened also to them. Well it happened before, but managed to overcome well we just think positively it would.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 10, 2022, 04:36:13 AM",
      "body": "It shouldn't go that low. DAI or the old USDT also decreases its value at some point but it won't be less than 0.95 I have not seen it 0.98 actually. I can't see what the team did to ensure its a stablecoin but when they mint it, Terra's price mooned. In CMC, its now $0.7811 while it ranked at 11th but you can't really consider this a stablecoin. If you did try to hedge using that UST lately, it means you lose money still",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "May 10, 2022, 04:41:13 AM",
      "body": "Quote from: GreatArkansas on May 10, 2022, 01:09:30 AMI believe that this is just temporary. Terra Luna's team already released a statement about this case. A lot of people are worried about this, even me I have some UST but I am still calm. This is also because of the recent dump, for sure they didn't anticipate this but I am positive that they will become stable soon and fix this issue.Well obviously they are going to write their positive spin about this. But this was always a possibility with algorithmic stablecoins and people will see that it wasn't the working holy grail believers thought it would be. Imho this could be beyond recovery, and after more and more people abandon the luna-ship, it won't be sailing without any users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davian144",
      "created_time": "May 10, 2022, 04:49:54 AM",
      "body": "Quote from: malcovi2 on May 10, 2022, 12:29:27 AMprice: $.67 during the time of the posthttps://www.coingecko.com/en/coins/terra-usdDoes anyone know why its losing its value? I havent dived into terra because i am not interested on the project. Im glad, I didnt since i think TerraUsd and Terra affect each other.I think terra will be exposed a project that is just a big ponzi scheme.I also don't understand why TerraUsd has dropped in price, even though other stablecoins like BUSD, USDT and USDC have always stayed at $1 as usual.While TerraUsd has experienced a decline like other coins while conceptually TerraUsd is also a stablecoin just as good as the others, but with the current decline, TerraUsd no longer looks like a decent stablecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "May 10, 2022, 04:56:23 AM",
      "body": "Quote from: Davian144 on May 10, 2022, 04:49:54 AMQuote from: malcovi2 on May 10, 2022, 12:29:27 AMprice: $.67 during the time of the posthttps://www.coingecko.com/en/coins/terra-usdDoes anyone know why its losing its value? I havent dived into terra because i am not interested on the project. Im glad, I didnt since i think TerraUsd and Terra affect each other.I think terra will be exposed a project that is just a big ponzi scheme.I also don't understand why TerraUsd has dropped in price, even though other stablecoins like BUSD, USDT and USDC have always stayed at $1 as usual.While TerraUsd has experienced a decline like other coins while conceptually TerraUsd is also a stablecoin just as good as the others, but with the current decline, TerraUsd no longer looks like a decent stablecoin.From what I've understood, UST was backed with Luna and Bitcoin (while Luna was practically back with nothing), both volatile assets. Since Bitcoin crashed down to $30.000, they could no longer keep the peg to $1. Please, correct me if I'm wrong, that's what I quickly summarized in all this panic. I believe I got the general idea correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ItsCrafty",
      "created_time": "May 10, 2022, 06:05:53 AM",
      "body": "Do Kwon, the project's founder, said the move to loan out $750 million of bitcoin shouldn't be seen as LFG trying to exit its BTC position but, rather, increasing the liquidity around the UST peg. LFG will buy more BTC if UST expands from here, which we think is the more likely outcome,\"My question from senior members it's possible for Ust to recover back to 1 usdt price?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}