{
  "id": "topic_5433663",
  "title": "Alone055",
  "author": "Alone055",
  "created_time": "January 09, 2023, 07:33:12 PM",
  "content": "After the merit system, it seemed like the things are getting normal, spam and spammers getting less than before and everything is falling in place. But, what I see in Digital goods section is not really pleasing. Account farmers are still openly selling merits and accounts, and for some reason, their threads are not locked/closed.Why? What's the essence of the merit system if we still allow such things in the forum?Attaching one thread for reference:Thread link: https://bitcointalk.org/index.php?topic=5407070.0OP: https://bitcointalk.org/index.php?action=profile;u=3492180",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433663",
  "comments": [
    {
      "author": "digaran",
      "created_time": "January 09, 2023, 08:35:25 PM",
      "body": "As long as people pay for it, there will be a never ending supply of accounts, it was easier to do before the merit.That's it, now is just harder with the possibility of monopoly. Forum doesn't ban account sales just like they don't ban *profanity.*= I should know. 🙂",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 09, 2023, 08:44:37 PM",
      "body": "What a way of doing business, offering escrow too. I wonder who is that escrow member he has and how people believe the escrow manager. Just checked out the thread, that guy is doing business very fine. I saw Legendary account getting banned for copy pasting twitter post on this forum but this guy is doing the most restricted activity in this forum and is still alive from last year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "January 09, 2023, 09:31:58 PM",
      "body": "Quote from: Mahirap on January 09, 2023, 08:44:37 PMWhat a way of doing business, offering escrow too. I wonder who is that escrow member he has and how people believe the escrow manager.No problem on the escrow part, usually DT1-DT2 members trustworthy enough to hold the funds, whether they have a moral code or not, is their busuness, but you could point them out if you find them with evidence, just to let the communiy know who they are, because lack of morality leads to corruption if left alone and not dealt with properly, so for the sake of future generations of this forum report them by openning reputation topic on them, some one with no moral code to follow and value, will one day steal millions if they get the chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "January 09, 2023, 09:40:31 PM",
      "body": "Quote from: Alone055 on January 09, 2023, 07:33:12 PMAfter the merit system, it seemed like the things are getting normal, spam and spammers getting less than before and everything is falling in place. But, what I see in Digital goods section is not really pleasing. Account farmers are still openly selling merits and accounts, and for some reason, their threads are not locked/closed.Why? What's the essence of the merit system if we still allow such things in the forum?There are many points to be taken from your questions:Selling merit may seem bad but not forced to be prohibited. Only if a merit source found to be involved in selling merit then Theymos will remove him from the list.Account buy sell is discouraged, forum members do not like it so they tag accounts. Threads are not locked/closed because there are no such rules that enforce to lock a thread by mod. This forum is a prime example of freedom of speech and open for you to do anything. If you find anyone spamming, report it to moderator.Merit system was introduced 5 years ago, it's pointless now to continue talking about it. We accepted all pros and cons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "January 09, 2023, 10:34:25 PM",
      "body": "With a lot of sales you can generally tell when an account has changed hands anyway which is probably why the forum doesn't care about it.I think account farmers are a lot less likely now too and people sell personal accounts which means you probably get a lot of their history (good and bad) too so that'll make it even harder for potential buyers to impersonate people. The account farmers being gone now (particularly in the main boards) is generally due to people not meriting any sub par posts and mods getting a bit more active too (imo they seem to be responding to more requests).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "January 09, 2023, 10:49:15 PM",
      "body": "Account farming is actually frowned at...Infact, Theymos has made it very possible for the least unimportant OP to have an opportunity to be relevant... YEAH...SO, for that fact, peeps go as far as misusing his simplicity for cowardice or something... Account farmers have been raging an unending war with the DT squad over the years -- it's not starting today.. that'll only make you realize that alot are in here for the purpose of making some few Bucks every other time, for themselves -- they don't have any positive contributions to the forum neither -- at some point, they become toxic just like this set of dimwittys that we get on a regular...Edit 1: They usually get reported and tagged... Anyone that's buying farmed account is simply bidding \"farewell\" to his cashSandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 09, 2023, 11:39:53 PM",
      "body": "Because they are free to do it, but it doesn't mean decent members and the forum doesn't care.Later on maybe we will see the seller or the accounts that on sale will be exposed on reputation board as i remember one of the scam buster member did this lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "January 10, 2023, 12:40:53 AMLast edit: January 10, 2023, 12:53:32 AM by SquirrelJulietGarden",
      "body": "Selling or buying accounts or merit is not prohibited, it is only discouraged by the forum and community.You can only do this to join bounty but unfortunately you can not join any good signature campaign. When you buying account or merit, you're not a good poster (if you're, you don't do this), not be able to write meaningful posts so no campaign manager will accept you in a good signature campaign.Quote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alone055",
      "created_time": "January 10, 2023, 05:26:19 PM",
      "body": "Quote from: digaran on January 09, 2023, 08:35:25 PMAs long as people pay for it, there will be a never ending supply of accounts, it was easier to do before the merit.What I meant was that there should be a way to tackle this.Quote from: Mahirap on January 09, 2023, 08:44:37 PMI wonder who is that escrow member he has and how people believe the escrow manager.The guy said in one of his comments in that thread that he got connections in the forum. He can probably also use one of the accounts that he has as the escrow, if he got one with positive feedback.Quote from: BitcoinGirl.Club on January 09, 2023, 09:40:31 PMSelling merit may seem bad but not forced to be prohibited. Only if a merit source found to be involved in selling merit then Theymos will remove him from the list.Merit system was introduced 5 years ago, it's pointless now to continue talking about it. We accepted all pros and cons.I know that it is not prohibited but they should be hunted down and negative tagged to stop such activities. I understand that the merit system is already old, I was an active member when it was first introduced and I understand all the pros and cons, but we need to keep filtering such stuff to further clean up the forum.Quote from: SquirrelJulietGarden on January 10, 2023, 12:40:53 AMYou can only do this to join bounty but unfortunately you can not join any good signature campaign. When you buying account or merit, you're not a good poster (if you're, you don't do this), not be able to write meaningful posts so no campaign manager will accept you in a good signature campaign.Some managers accept average posters in their signature campaigns, and account buyers only purchase accounts or merits to bypass the rule for getting some merits in the last 120 days which is a requirement for most signature campaigns these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "January 10, 2023, 05:37:50 PM",
      "body": "Having multiple accounts is allowed by the forum rules so there is no reason to ban him or trash the account sale thread but looking at his thread it seems he is not really selling anything just trying to lure people who want to buy account and steal their money and obviously no forum escrow is accepting account trade deals so its just only used to show as real trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "January 10, 2023, 05:39:29 PM",
      "body": "Quote from: Alone055 on January 10, 2023, 05:26:19 PMQuote from: BitcoinGirl.Club on January 09, 2023, 09:40:31 PMSelling merit may seem bad but not forced to be prohibited. Only if a merit source found to be involved in selling merit then Theymos will remove him from the list.Merit system was introduced 5 years ago, it's pointless now to continue talking about it. We accepted all pros and cons.I know that it is not prohibited but they should be hunted down and negative tagged to stop such activities. I understand that the merit system is already old, I was an active member when it was first introduced and I understand all the pros and cons, but we need to keep filtering such stuff to further clean up the forum.Feel free. I don't think it will make any change. Theymos himself forbid the community to tag anyone for merit abusing. Maybe you were there when the system was introduce but surely you missed the development or you wouldn't even create the thread. Get yourself upgraded LOL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "January 10, 2023, 05:44:17 PM",
      "body": "Quote from: digaran on January 09, 2023, 09:31:58 PMQuote from: Mahirap on January 09, 2023, 08:44:37 PMWhat a way of doing business, offering escrow too. I wonder who is that escrow member he has and how people believe the escrow manager.No problem on the escrow part, usually DT1-DT2 members trustworthy enough to hold the funds, whether they have a moral code or not, is their busuness<snip>Yes, and this discussion has been had at least once over the years, and while everyone can voice their opinions about what they think is right nothing is going to change from the administrative end.  I've said before that I don't fault an escrow for ensuring a safe transaction even if it's between two motherfuckers exchanging bitcointalk accounts for money.The merit system has eliminated a lot of account farmers.  There's no way it could have failed to do so, since it's made it orders of magnitude harder to rank up multiple accounts as was common in the pre-merit days.  This fucker referenced in the OP could have had those accounts for a long time or could have purchased them himself; it's not a fault of the merit system or of the forum.By the way, I have the Digital Goods section on ignore.  If anyone sees an account that isn't a throwaway trying to buy or sell a bitcointalk account, shoot me a PM and I'll tag them with the trusty red paint gun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "January 10, 2023, 05:56:48 PM",
      "body": "See:Quote from: mprep on July 21, 2014, 05:27:51 PMQ: I saw a guy selling Bitcointalk accounts. Why is that allowed?A: Since we can't effectively prevent these sales (proxies, TOR, sales on other forums), we don't because otherwise we would be giving the users a false sense of security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 10, 2023, 09:49:17 PM",
      "body": "Quote from: Alone055 on January 10, 2023, 05:26:19 PMQuote from: Mahirap on January 09, 2023, 08:44:37 PMI wonder who is that escrow member he has and how people believe the escrow manager.The guy said in one of his comments in that thread that he got connections in the forum. He can probably also use one of the accounts that he has as the escrow, if he got one with positive feedback.What a guy! He is probably logged in with another high ranked account to escrow the deal and get it done. Plus the high ranked account has a good reputation because he is selling various types of accounts so managing one is not that complicated for him. I am curious how these deals get completed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "January 10, 2023, 10:26:01 PM",
      "body": "Quote from: The Sceptical Chymist on January 10, 2023, 05:44:17 PMThe merit system has eliminated a lot of account farmers.  There's no way it could have failed to do so, since it's made it orders of magnitude harder to rank up multiple accounts as was common in the pre-merit days. It has definitely... But you seeee, people will always take an advantage of whatever loophole is left unsealed -- as long as it's gonna pay 'em back someday, they won't mind going a long way just to get it done. It's prolly no one's fault that these guys are still bypassing the well-designed barrier -- to the point that Merit is sold for some few bucks? Sheesshh!!Quote I'll tag them with the trusty red paint gun.  This has been done right from time; even before CHYMIST got registered in here, but this is still what we got ? Does it mean there's never a time this would end? ..... sometimes i keep wondering how it was before the meritocracy.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "January 11, 2023, 02:29:20 AM",
      "body": "Quote from: Sandra_hakeem on January 10, 2023, 10:26:01 PMThis has been done right from time; even before CHYMIST got registered in here, but this is still what we got ? Does it mean there's never a time this would end? ..... sometimes i keep wondering how it was before the meritocracy.Sandra 🧑‍🦰Reputable members work strides ahead to stop such practices, especially for users that break the forum rules in the essence of account farming. They've been a member who was tracked down on this thread https://bitcointalk.org/index.php?topic=5356476.0 he had made jest of the forum's merit system by giving merits out to his accounts and vice versa, just to boost his more than 61 accounts, yet not all his accounts were banned. It's quite difficult to trace these activities considering the hard work and time invested by @Ratimov to achieve this strenuous goal of investigating his victim. Though it's worth it for the cleanliness of the forum, but for such a forum like bitcointalk where it's not a strict rule not to farm account it's difficult to wipe out such people like you're suggesting. Considering that it's still feasible to farm account despite the merit system available that means before the merit system got introduced it was a league of spam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 11, 2023, 10:45:25 AM",
      "body": "Quote from: The Sceptical Chymist on January 10, 2023, 05:44:17 PMBy the way, I have the Digital Goods section on ignore.  If anyone sees an account that isn't a throwaway trying to buy or sell a bitcointalk account, shoot me a PM and I'll tag them with the trusty red paint gun.  From what I see on all the accounts that deal with that activity, it seems that most DT members have that board on ignore, and if you look at each of those accounts, you will see that they have only 1 or 2 red tags. In the past, even the question about the possible purchase of a BTT account was punished with a red tag, but the approach has obviously changed over the years.However, there are those who still fight against those who do this, and most of you must have noticed that there is a thread about it in Reputation -> [Investigation] Fighting The Account Mafia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "January 11, 2023, 02:48:02 PM",
      "body": "Quote from: Alone055 on January 10, 2023, 05:26:19 PMI know that it is not prohibited but they should be hunted down and negative tagged to stop such activities. I understand that the merit system is already old, I was an active member when it was first introduced and I understand all the pros and cons, but we need to keep filtering such stuff to further clean up the forum.Merit trades will not occur for higher ranks. maybe buy 10 merits to be able to rank up Member. but that won't be enough for someone to join the signature campaign. although some are open to lower ratings.Quote from: Alone055 on January 10, 2023, 05:26:19 PMSome managers accept average posters in their signature campaigns, and account buyers only purchase accounts or merits to bypass the rule for getting some merits in the last 120 days which is a requirement for most signature campaigns these days.I'm not sure it can help merit buyers to participate in signature campaigns.what percentage can he be accepted when the merit is only small, and he is not an active member of the forum?the campaign manager will not only see the number of merits earned in 120 days. with accounts like that, I doubt they can compete with other accounts that deserve Merit.we can only supervise and if something goes wrong with account trading and Merit, we can carry out an investigation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "January 11, 2023, 03:03:19 PM",
      "body": "Quote from: Alone055 on January 10, 2023, 05:26:19 PMI know that it is not prohibited but they should be hunted down and negative tagged to stop such activities.So what do you think about how to stop such account selling activity, Do you have any ideas?So far, account sellers and accounts that are known to change hands are most likely marked with negative tag, that is the consequence of not being liked by forum users. But as you can see, they are also unstoppable despite being hunted and tagged with negative tag. The basic rule is, \"account sales are allowed, but account sales are discouraged\".Quote18. Having multiple accounts and account sales are allowed, but account sales are discouraged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}