{
  "id": "topic_5471529",
  "title": "Bitcoin Smith",
  "author": "Bitcoin Smith",
  "created_time": "October 25, 2023, 12:11:49 AMLast edit: October 25, 2023, 06:07:15 PM by Bitcoin Smith",
  "content": "Hindustan Petroleum, one of India’s largest oil and gas companies, is launching a blockchain system to enable automated verification of purchase orders.HPCL has partnered with the blockchain software firm Zupple Labs to integrate its blockchain-based digital credentialing technology into the purchase order system, the firms said in a joint announcement.\"These POs will be dispatched to vendors, which in turn can be shared with third parties. Any third-party verifier can directly verify these POs on the HPCL vendor portal verification application\"SourceThis is not related to cryptocurrency but its related to payment and blockchain so I guess this should be considered as good thing to happen in India which may expose blockchain to more people which may eventually let them know about cryptocurrency too. Any of you guys came across this news? Because its announced almost a week ago and I didn't notice it until yesterday so I just wanted to share this and also would like to hear your views about this news and especially will it helps cryptocurrency in anyway?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471529",
  "comments": [
    {
      "author": "bitnote",
      "created_time": "October 25, 2023, 04:24:08 AM",
      "body": "Hindustan Petroleum is taking a big step in blockchain. This may not be directly related to cryptocurrencies but projects like this can help raise awareness of the bitcoin and blockchain technology, which is always good. The fact that purchase orders are shared with third parties and verified in the vendor portal application is a great example of blockchain transparency and security this news that I was not aware of. Thank you for sharing this. I wonder if such developments will eventually lead to greater awareness and use of cryptocurrencies in India. What do you think guys?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "October 25, 2023, 04:33:45 AM",
      "body": "Quote from: bitnote on October 25, 2023, 04:24:08 AMI wonder if such developments will eventually lead to greater awareness and use of cryptocurrencies in India. What do you think guys?Eventually big companies will embrace Blockchain technology for thier own good. That doesn't mean that it would help Bitcoin or other cryptocurrency market in India. The market will only boom when our government stops thinking about Bitcoin as a gamble. Relates it to a bubble that will burst in the near future. Comes up with a regulation to safeguard individual investors. Reduces the tax slab and considers Bitcoin as a regular assets.Already without any ground work they have implemented a 30% tax. That has resulted in big decline in volumes in Indian exchanges. If you can't understand technology hire someone who does, whereas our government is stiil working with babus who have zero clue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 25, 2023, 04:35:13 PM",
      "body": "It is another example of application of blockchain into the existing systems and hence development of the same. This has been happening over the last 5-6 years in many sectors and HP is the next one on the ever-increasing list.However the sad part is that even though the government here is lenient about blockchain based systems they are not so lenient about bitcoin and its transactions.Anyway getting to know development is always a good news. Also, correct the spelling of blockchain in the thread title.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "October 25, 2023, 06:10:58 PM",
      "body": "Quote from: TheUltraElite on October 25, 2023, 04:35:13 PMAlso, correct the spelling of blockchain in the thread title.Thanks for noticing it. Thanks for your feedbacks guys.Something is better than nothing so It's good to embrace anything may relate to cryptocurrency in my opinion and blockchain technology is going to be the future apart from crypto, so this is also the transition phase for the upcoming generation to choose their right path in their graduation which will help them to survive in the unstable employment space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 31, 2023, 06:14:46 PM",
      "body": "This is a great example of Blockchain application in real world. Everything that has a chain of linked communications, can be benefited greatly from Blockchain architecture. It's great that big corporates have started noticing that benefit and started implementation. This will reduce cost for the company as less number of human intervention will needed in the purchase requisition process. Good development! Thanks for sharing!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}