{
  "id": "topic_5475243",
  "title": "AlfGod",
  "author": "AlfGod",
  "created_time": "November 23, 2023, 06:54:42 PM",
  "content": "Tryed to send BTC over Lightning from Binance to Electrum.- Lightning channel have income capacity on my electrum wallet- Created the invoice with 1 day expiration- Binance Android App reports invalid invoice number.- Tryed again several times creating different invoices, same result.- Contacted Binance support, after reviewing the case they tell me the invoice has some errorSome one can help me?Thanks in advance...P.S.: Apologies for any error regarding my english",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475243",
  "comments": [
    {
      "author": "Findingnemo",
      "created_time": "November 23, 2023, 07:01:30 PMLast edit: November 23, 2023, 07:12:11 PM by Findingnemo",
      "body": "Quote from: AlfGod on November 23, 2023, 06:54:42 PMTryed to send BTC over Lightning from Binance to Electrum.How to Use the Bitcoin Lightning Network to Deposit and Withdraw BTC on BinanceElectrum Lightning Network walkthroughCheck out this article and go through the process.In Electrum make sure the channel is open and connected to the node. I assume your issue is with the invoice or the inbound capacity of your channel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "November 24, 2023, 04:57:27 AM",
      "body": "Quote from: AlfGod on November 23, 2023, 06:54:42 PM- Tryed again several times creating different invoices, same result.- Contacted Binance support, after reviewing the case they tell me the invoice has some errorHave you been scanning the QR code?Because Binance seems to only support invoices in lowercase but Electrum's QR is composed of uppercase characters.I tried to paste a full uppercase invoice (converted from a working full lowercase invoice) and the same error showed.Or manual copy-paste, perhaps?In this case, Electrum's invoice should be lowercase.I haven't tried this but it may be caused by them not supporting \"On-chain fallback\" mechanism to lightning invoices.So try to untick \"Add on-chain fallback to lightning requests\" in the small setting icon at the upper-right-hand side of 'Receive' tab.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AlfGod",
      "created_time": "November 24, 2023, 06:30:42 PM",
      "body": "Hi nc50lc,All letters are uppercase.I manually copy the invoice using the \"Copy\" button on Electrum for Android.On Electrum for Android I don't see any way to untick \"Add on-chain fallback to lightning requests\", only have the invoice (either in QR format, or in plain text), and the buttons \"Copy\" and \"Share\". You are referring to Electrum on Android?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "November 25, 2023, 04:31:09 AM",
      "body": "Quote from: AlfGod on November 24, 2023, 06:30:42 PMHi nc50lc,All letters are uppercase.In that case, it wont be accepted by Binance as I mentioned in my reply.Find a way to convert those uppercase characters into lowercase.Quote from: AlfGod on November 24, 2023, 06:30:42 PMOn Electrum for Android I don't see any way to untick \"Add on-chain fallback to lightning requests\", only have the invoice (either in QR format, or in plain text), and the buttons \"Copy\" and \"Share\". You are referring to Electrum on Android?The instrcutions are for the desktop version.In Android, the option is in the settings: Tap the green circle icon -> Tap \"Preferences\" and scroll-down.But given the above result, I think that this isn't the cause of the issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}