{
  "id": "topic_5446456",
  "title": "Ketesnuko",
  "author": "Ketesnuko",
  "created_time": "March 27, 2023, 09:37:39 AM",
  "content": "Zksync is coming sooner or later, days ago they have released their ZKsync ERA which is their Mainnet, if you want to qualify for this airdrop, you will have to do some transactions on the Mainnet too, I know some have done a lot of transactions on the testnet and the zksync 1.0 lite version, remember that this is the Mainnet, Bridge your wallet to the Miannet and start doing some transactions before its too late, ZKsync will be bigger than Arbitrum airdrop.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446456",
  "comments": [
    {
      "author": "someone703",
      "created_time": "March 27, 2023, 09:50:56 AM",
      "body": "I understand that it is a great opportunity to receive an airdrop and I will try to do some trading on the Mainnet to qualify for this airdrop. I also understand that ZKsync may be larger than the Arbitrum airdrop in the future. But even so, don't be too fomo according to people who are talking about a great opportunity to change positions, I think the strategy to increase the chances of getting an airdop is not complicated, it is simply that we are often active on mainnet will have a chance to receive airdrop",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "March 27, 2023, 12:34:55 PM",
      "body": "After the successful airdrop from Arbitrum, all attention is focused on the upcoming airdrop from zkSync Era. In order not to be a bystander and qualify for the upcoming airdrop, it is necessary to interact with the main zkSync Era network. You can see a detailed guide here: https://airdropclaimers.medium.com/zksync-era-mainnet-complete-guide-575a439feabb",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raidarksword",
      "created_time": "March 27, 2023, 01:02:09 PM",
      "body": "Getting free money now is getting harder at it may seems, have to spent enormous amount of gas fees just to quality for the airdrop. I love to participate on this one because I missed the arbitrum one, so hoping I could gathered some funds to participate on this zsync era.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "March 27, 2023, 01:21:33 PM",
      "body": "Quote from: Ketesnuko on March 27, 2023, 09:37:39 AMZksync is coming sooner or later, days ago they have released their ZKsync ERA which is their Mainnet, if you want to qualify for this airdrop, you will have to do some transactions on the Mainnet too, I know some have done a lot of transactions on the testnet and the zksync 1.0 lite version, remember that this is the Mainnet, Bridge your wallet to the Miannet and start doing some transactions before its too late, ZKsync will be bigger than Arbitrum airdrop.I received an Arbitrum airdrop(around 8000+) as well. Then I moved to the zksync ERA mainnet tasks. This time there will be more users. Also, the airdrop eligibility criteria will be different from the previous ones. Also, Zksync ERA announced a token at the end of this year(Q4 2023). But I believed they will take the snapshot in Q2 2023 and release a $ZKC token .  What you can do is build the number of transactions and the volumes. Also, mint an NFT in the nft marketplace and buy a few nfts as well. In addition to that, please interact with DAO proposals as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "March 27, 2023, 02:29:17 PM",
      "body": "Quote from: tvplus006 on March 27, 2023, 12:34:55 PMAfter the successful airdrop from Arbitrum, all attention is focused on the upcoming airdrop from zkSync Era. In order not to be a bystander and qualify for the upcoming airdrop, it is necessary to interact with the main zkSync Era network. You can see a detailed guide here: https://airdropclaimers.medium.com/zksync-era-mainnet-complete-guide-575a439feabbThis one feels different from ARB.  With ARB I mostly used it out of interest to see what the fuss was all about with L2's...  And I liked using it because it didn't require me to buy a token.  The airdrop was an added bonus and it's good to feel that early users are appreciated.Now that a lot of people realized they missed out on ARB, they're all going into zKSync to get their chance for getting into an airdrop of their own.  But I don't think it's gonna be the next rotation that everybody is waiting for.  I think it's gonna be Zero Layer's airdrop.  Same vibe as ARB.  No announcement of an airdrop but you know it would be stupid of them not to have one.Still worth playing around zKSync tho, don't get me wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "March 27, 2023, 03:56:33 PM",
      "body": "Quote from: tokeweed on March 27, 2023, 02:29:17 PMQuote from: tvplus006 on March 27, 2023, 12:34:55 PMAfter the successful airdrop from Arbitrum, all attention is focused on the upcoming airdrop from zkSync Era. In order not to be a bystander and qualify for the upcoming airdrop, it is necessary to interact with the main zkSync Era network. You can see a detailed guide here: https://airdropclaimers.medium.com/zksync-era-mainnet-complete-guide-575a439feabbThis one feels different from ARB.  With ARB I mostly used it out of interest to see what the fuss was all about with L2's...  And I liked using it because it didn't require me to buy a token.  The airdrop was an added bonus and it's good to feel that early users are appreciated.Now that a lot of people realized they missed out on ARB, they're all going into zKSync to get their chance for getting into an airdrop of their own.  But I don't think it's gonna be the next rotation that everybody is waiting for.  I think it's gonna be Zero Layer's airdrop.  Same vibe as ARB.  No announcement of an airdrop but you know it would be stupid of them not to have one.Still worth playing around zKSync tho, don't get me wrong.  In addition to these projects, it is necessary to pay attention to Arbitrum Nova, whose team stated that the protocol will have its own token. And it is obvious that the airdrop distribution conditions for this network will be similar to the ARB airdrop. Therefore, in my opinion, everyone should do the necessary minimum so that later, when there is an airdrop distribution, they do not regret their inaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GEMIN_M4",
      "created_time": "March 27, 2023, 06:39:12 PM",
      "body": "Quote from: tvplus006 on March 27, 2023, 12:34:55 PMAfter the successful airdrop from Arbitrum, all attention is focused on the upcoming airdrop from zkSync Era. In order not to be a bystander and qualify for the upcoming airdrop, it is necessary to interact with the main zkSync Era network. You can see a detailed guide here: https://airdropclaimers.medium.com/zksync-era-mainnet-complete-guide-575a439feabbI'm currently working on this right now, I need money to keep DCA into several good projects in this bear market, this airdrop money is enough to have some crazy crypto portfolio in place, I hope I get lucky with Zksync and Scroll, lets hope for the best and I hope Zksync will not randomly select the qualifiers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "March 28, 2023, 11:16:42 AM",
      "body": "Quote from: tvplus006 on March 27, 2023, 03:56:33 PMIn addition to these projects, it is necessary to pay attention to Arbitrum Nova, whose team stated that the protocol will have its own token. And it is obvious that the airdrop distribution conditions for this network will be similar to the ARB airdrop. Therefore, in my opinion, everyone should do the necessary minimum so that later, when there is an airdrop distribution, they do not regret their inaction.What is the point of releasing another coin, when there is already an ARB coin? I think it is just a hype. There is no at least a 1% percent chance to release another coin now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "irsykes",
      "created_time": "March 28, 2023, 11:27:05 AM",
      "body": "Quote from: raidarksword on March 27, 2023, 01:02:09 PMGetting free money now is getting harder at it may seems, have to spent enormous amount of gas fees just to quality for the airdrop. I love to participate on this one because I missed the arbitrum one, so hoping I could gathered some funds to participate on this zsync era.there are still lots of airdrops that turn into money for free, tesnet, wallet applications and much more. it's just that we don't be lazy to be able to get free money, airdrops that use money or costs are also not certain according to speculation in terms of expenses used. I hope you keep the spirit so you don't get left behind by other friends",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "March 28, 2023, 01:50:57 PM",
      "body": "I see a lot of people are having exaggerated fomo about airdrop opportunities, some users are only interested in this. I also saw the announcement of a large increase in the number of users and a large amount of money pouring into the ecosystem. Although very impressed with the information about the amount of capital raised by the project and they also have very professional project supporters, but I personally think there is no need to rush to experience the ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "killerfrost",
      "created_time": "March 28, 2023, 05:32:45 PM",
      "body": "Although it is currently one of the most popular ecosystems in the crypto space, I see people overdoing the airdrop issue. After many events, some big projects in the market conduct airdrops to users, perhaps many people are chasing like this is a job and life-changing opportunity for them, be more realistic and don't waste your time. money and spend it on something more useful like doing market research or doing your main job. The more interested people, the greater the competition, which means that the chances of everyone getting an airdrop will be less, looking at the previous arbtrum announced airdrop conditions I believe in the future the conditions will be even more complicated and not everyone can afford to go with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "March 28, 2023, 08:13:37 PM",
      "body": "Quote from: @sriyan on March 28, 2023, 11:16:42 AMQuote from: tvplus006 on March 27, 2023, 03:56:33 PMIn addition to these projects, it is necessary to pay attention to Arbitrum Nova, whose team stated that the protocol will have its own token. And it is obvious that the airdrop distribution conditions for this network will be similar to the ARB airdrop. Therefore, in my opinion, everyone should do the necessary minimum so that later, when there is an airdrop distribution, they do not regret their inaction.What is the point of releasing another coin, when there is already an ARB coin? I think it is just a hype. There is no at least a 1% percent chance to release another coin now.Considering the fact that the commissions in the Arbitrum Nova network are less than one cent, this will not lead you to a big loss. And the execution of activities in this network will not take much time. But I think that if there is at least 1%, you should join the activity, especially since the Arbitrum team constantly said that there would be no token. How it all ended, you know yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "March 28, 2023, 08:16:33 PM",
      "body": "Quote from: tokeweed on March 27, 2023, 02:29:17 PMNow that a lot of people realized they missed out on ARB, they're all going into zKSync to get their chance for getting into an airdrop of their own.  But I don't think it's gonna be the next rotation that everybody is waiting for.  I think it's gonna be Zero Layer's airdrop.  Same vibe as ARB.  No announcement of an airdrop but you know it would be stupid of them not to have one.Still worth playing around zKSync tho, don't get me wrong.  A lot of people now have focused on doing some deals with new projects like for example zkSynch, Starknet, Suit Network, LayerZero etc it's been a hype on twitter because some influencers are giving some guides how to fit in those criteria although this is not sure in the airdrop but some of them believe zkSynch and other projects will do the same with Arbitrum.I didn't want to be left behind and started some transactions a few days ago to try something mainnet in the zksync ERA with some interaction on the other ecosystems that zksynch supports.We never know what will happen later, just do what they can to do bridges and other swaps, but remember don't get your hopes up too much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitkanu",
      "created_time": "March 28, 2023, 09:20:24 PM",
      "body": "it seems zksync got bigger funding compared with arbitrum but the airdrop itself is still rather unclear, there's no clarification whatsoever so everyone doing the swapping, etc in their blockchain should always be prepared for any scenario.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "March 28, 2023, 09:35:42 PM",
      "body": "Quote from: bitkanu on March 28, 2023, 09:20:24 PMit seems zksync got bigger funding compared with arbitrum but the airdrop itself is still rather unclear, there's no clarification whatsoever so everyone doing the swapping, etc in their blockchain should always be prepared for any scenario.I read some tweet from them that airdrop wont happen this year and might take a year, so don’t get overhyped and continue to analyze. This could be bigger but there’s no need to rush based on their own statement. Did some transaction already, i just don’t know if its enough already because the fees are too high for me. Looking forward for the success of this project as well, this can be big.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "March 28, 2023, 10:34:21 PM",
      "body": "Zksync is all over my social media after the arbitrum airdrop which those airdrop hunters gained so much money from. I think Zksync is one of the most anticipated airdrop after arbitrum and airdrop hunters are doing their best in being included in it's snapshot which I guess is closed already. Even if the gas fees are high, I feel airdrop hunters will still try to pursue the airdrop knowing that it has a very high potential to pump and have a massive profits on it. I also noticed that airdrop projects started to increased after arbitrum project had been successful. It seems airdrop hunters don't want to missed out in those future airdrop projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "March 28, 2023, 10:51:10 PM",
      "body": "Quote from: Scripture on March 28, 2023, 09:35:42 PMQuote from: bitkanu on March 28, 2023, 09:20:24 PMit seems zksync got bigger funding compared with arbitrum but the airdrop itself is still rather unclear, there's no clarification whatsoever so everyone doing the swapping, etc in their blockchain should always be prepared for any scenario.I read some tweet from them that airdrop wont happen this year and might take a year, so don’t get overhyped and continue to analyze. This could be bigger but there’s no need to rush based on their own statement. Did some transaction already, i just don’t know if its enough already because the fees are too high for me. Looking forward for the success of this project as well, this can be big. They made it clear and also most of my friend shares how to do the airdrop, most of them get hyped because of $ARB result, this can be big in the future so there’s still time to participate. I don’t know if small transaction can give you huge airdrop but there is nothing to lose here as long as you are willing to paid for the fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "March 29, 2023, 02:09:25 AM",
      "body": "Quote from: tvplus006 on March 27, 2023, 12:34:55 PMAfter the successful airdrop from Arbitrum, all attention is focused on the upcoming airdrop from zkSync Era. In order not to be a bystander and qualify for the upcoming airdrop, it is necessary to interact with the main zkSync Era network. You can see a detailed guide here: https://airdropclaimers.medium.com/zksync-era-mainnet-complete-guide-575a439feabbgreat Share here mate , and yes  I missed the Arbitrum airdrop in which I really felt stupid for not listening to my friends .but this time I will take this opportunity not to lose the chance of earning.Quote from: bitkanu on March 28, 2023, 09:20:24 PMit seems zksync got bigger funding compared with arbitrum but the airdrop itself is still rather unclear, there's no clarification whatsoever so everyone doing the swapping, etc in their blockchain should always be prepared for any scenario.yeah from what I am reading in some other groups , there seems to be a Big funding and lets take this chance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "March 29, 2023, 08:09:43 AM",
      "body": "Quote from: tvplus006 on March 27, 2023, 12:34:55 PMAfter the successful airdrop from Arbitrum, all attention is focused on the upcoming airdrop from zkSync Era. In order not to be a bystander and qualify for the upcoming airdrop, it is necessary to interact with the main zkSync Era network. You can see a detailed guide here: https://airdropclaimers.medium.com/zksync-era-mainnet-complete-guide-575a439feabbPerfect guide. I have some ETH in my wallet for holding and will use part of them for experiencing Zksync ERA wallet, bridge, swap and dApps. I missed Arbitrum and hopefully I won't be disappointed with Zksync ERA this time.That article is informative, detailed but I wonder is it a best Medium channel for Airdrop announcements and guides? Do you know any others ?Quote from: kotajikikox on March 29, 2023, 02:09:25 AMyeah from what I am reading in some other groups , there seems to be a Big funding and lets take this chanceafaik, that project has five crow-funding rounds (Seed, Series A, Series B, Funding Round, Series C) with total fund successfully raised is up to $458M",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}