{
  "id": "topic_5420049",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "November 09, 2022, 06:12:45 AM",
  "content": "So let me share a real incident with all of you that happened two months before in India. There was a businessman and he used to own some crypto for trading and also as an investment. His friends came to know about exact amount he had which was quite big amount in my country. It happened because he casually mentioned it to them and showed them his investment and profit. Now these friends made a plan and kidnapped him and then asked him to trasfer all the crypto to their wallets. It was about 3 BTC in total. But the good thing was that he escaped them and then told police about all this and the funds were recovered. But he could might have lost his life and all the crypto because of this incident. So the lesson here is to never tell anyone exact amount you hold. You can inform just one member like your parents or wife about this so that they can recover the funds in case anything happens to you but never tell this information to casual friends or distant relatives.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420049",
  "comments": [
    {
      "author": "rat03gopoh",
      "created_time": "November 09, 2022, 06:21:49 AM",
      "body": "The rules of the game are quite clear in this space, \"you're the sole determinant of the extent to which your privacy is maintained\". However, because some people think that wealth is a pride that must be shown, they don't pay much attention to it, especially since the crime rate isn't too high in their area.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "November 09, 2022, 06:40:36 AM",
      "body": "This topic applies to many things in life. For example, it's even been said that you shouldn't talk about the things you want to do. Those who say this are right. Because Bitcoin may not be the only thing stolen. Methods that will allow you to earn income for buying Bitcoin can also be stolen. That's why we shouldn't talk about everything. There's no point in saying that and taking risks. The outcome of such events can also be undesirable. Therefore, paying attention and thinking for a few minutes before speaking can save us from negative consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "November 09, 2022, 06:48:25 AM",
      "body": "Quote from: eightdots on November 09, 2022, 06:40:36 AMThis topic applies to many things in life. For example, it's even been said that you shouldn't talk about the things you want to do. Those who say this are right. Because Bitcoin may not be the only thing stolen. Methods that will allow you to earn income for buying Bitcoin can also be stolen. That's why we shouldn't talk about everything. There's no point in saying that and taking risks. The outcome of such events can also be undesirable. Therefore, paying attention and thinking for a few minutes before speaking can save us from negative consequences.There are a lot of factors involved like1) Cunning friends: If you some friends who are very cunning, their purpose is just to get maximum benefit from you. They will always pretend to be nice and caring for you so you cannot even differentiate them from genuine friends. What is worse today is that most of the friends are like this only. There are very less real friends who are with you in your bad times and will never exploit your weakness.2) Nature of the person: Nature of the person also has an impact on whether this will happen or not. Extrovert people are at higher risks for these type of problems because they are not able to control their mouth. They express all their feelings and emotions even in front of strangers. This is the basic nature of person and it cannot be changed also. Only thing they can do is to remind themselves continuously not to revel information like that related to crypto or btc holdings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "November 09, 2022, 07:16:57 AM",
      "body": "You may share it to those people who you really want to share it with ,that's just simple but avoid sharing your 100% asset. There's no need to show everything because it will just put you at risk; of being borrowed from or killed. These possibilities are no joke and has tendency of occuring especially if that's the wrong person whom you shared it with. Keep in mind that money talks and money is a powerful piece of paper. Just know the limits or lose everything, you choose.Quote from: rat03gopoh on November 09, 2022, 06:21:49 AMThe rules of the game are quite clear in this space, \"you're the sole determinant of the extent to which your privacy is maintained\". However, because some people think that wealth is a pride that must be shown, they don't pay much attention to it, especially since the crime rate isn't too high in their area.They know their thing. If they really want to brag it they might be expecting something from other people which is for others to envy him/her(just an example, it could also be an inspiration but this is more likely to happen). If there is awareness on the risks, then he must be okay with consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "November 09, 2022, 07:28:21 AM",
      "body": "Quote from: krishnaverma on November 09, 2022, 06:12:45 AMSo the lesson here is to never tell anyone exact amount you hold. You can inform just one member like your parents or wife about this so that they can recover the funds in case anything happens to you but never tell this information to casual friends or distant relatives. Or, never tell anything at all that may involve money, trust no one. I even rarely tell my wife how much I own but she's not the persistent one so it's fine for both of us in the end. Not everyone was really happy with what they got, others get jealous or they have others intent bad behind you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "November 09, 2022, 07:41:55 AM",
      "body": "3 words. Trust no one. I still remember the Netflix documentary regarding QuadrigaCX with a title \"Trust no One\".This applies especially when it comes to crypto investment. TBH, I'm not telling anything to other people about cryptocurrency. If they will approach me then I will give advice and some tips but not my whole crypto investment. No one knows how much my total crypto portfolio is and maybe I'm lucky but there are no people around me who knows anything about cryptocurrency which is a good thing for me as it decreases my chances of my holdings getting stolen.Don't trust anybody even your family members because you don't know what they can do to you. Maybe in the future, I will share it to my partner but only my Bitcoins and I will not give him the whole amount .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 09, 2022, 07:55:21 AM",
      "body": "It sounds like a fake story How can a kidnapped person can escape and told the police about a criminal in his home? businessman or an average person doesn't learn self defense since they're only learn about money management and investment. I just imagine a person who get kidnapped or $5 wrench attack, they must tell the private key or seed phrase to the criminal since he will scared and think his life is more important than money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "November 09, 2022, 08:13:21 AM",
      "body": "It was dumb to show what he earned exactly really. If you really wanted to share (or brag), vaguely suggesting it should be enough, no need to go into specifics about it. If possible you don't really have to share it, especially if your profile was pretty vulnerable/public to the people you were sharing it about. Got curious and snooped around, and found this article detailing a kidnapping and ransom event. https://en.cryptonomist.ch/2022/08/19/beaten-kidnapped-exchange-bitcoin-india/Except it wasn't 3, it was 8 BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 09, 2022, 09:01:09 AM",
      "body": "Quote from: krishnaverma on November 09, 2022, 06:12:45 AMSo the lesson here is to never tell anyone exact amount you hold. You can inform just one member like your parents or wife about this so that they can recover the funds in case anything happens to you but never tell this information to casual friends or distant relatives. Heck, I'm going to go as far as to not mention bitcoin/crypto in general unless really needed. Pretty much only my closest friends know that I'm into crypto, and I mention my other non-crypto ventures when asked by other people about my income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "November 09, 2022, 09:29:20 AM",
      "body": "Quote from: krishnaverma on November 09, 2022, 06:12:45 AM You can inform just one member like your parents or wife about this so that they can recover the funds in case anything happens to you but never tell this information to casual friends or distant relatives. Tbh not even people that are part of my contingency plan in case something happens to me don't really know how much in crypto I have and you simply don't share that info around (I can understand telling your wife though if she asks).Quote from: Solosanz on November 09, 2022, 07:55:21 AMHow can a kidnapped person can escape and told the police about a criminal in his home? Maybe kidnappers were amateurs (and probably are as they were his \"friends\") that made a mistake and he managed to escape, and who said that they were still in his home when police came? I don't see it as very unlikely to happen.Quote from: Solosanz on November 09, 2022, 07:55:21 AMbusinessman or an average person doesn't learn self defense since they're only learn about money management and investment. I just imagine a person who get kidnapped or $5 wrench attack, they must tell the private key or seed phrase to the criminal since he will scared and think his life is more important than money.Since he said that funds were recovered, it probably means that kidnapped person eventually gave them bitcoin, and after police arrested them they managed to retrieve it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 09, 2022, 09:43:15 AM",
      "body": "He's lucky not to have learnt a lesson frombthe best mistake of his life, having 3btc is not something some holders could consider big because they have about 30btc in their disposal, but his mouth could have place him to where he would ever regret being, i wonder how he  had managed to get to where he was without being secretive, privacy is what some people with their own hands chased away and they will always find excuses to blame others for thier actions they should be responsible for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "November 09, 2022, 09:44:21 AM",
      "body": "Quote from: krishnaverma on November 09, 2022, 06:12:45 AM~Was it locally reported in India? I do not reside in India, but I have never read any news about any kidnappings of a businessman in crypto.This unwritten rule does not only apply in crypto but to fiat as well. Never tell anyone how much you earn weekly, daily, and even monthly. Even if you see plenty of influencers like Musk and Jeff out there sharing their net worth to the whole world, you are far more at risk encountering some scums including backstabbers from either your friends or anyone inside your social circle. Usually I just tell my relatives and close friends that I am particularly just an enthusiastic about crypto, but I had never told anyone that I am earning from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "November 09, 2022, 10:12:56 AM",
      "body": "This story is not only applicable to crypto hold. it's a story about criminals who want someone's money, the form of the money doesn't matter.what is interesting to me, is how the hell your acquaintance considered such people to be his friends. let's be clear, maybe that amount of 3BTC seems big to you, but it's certainly not big enough to risk prison. even if that amount is divided among several people, it is definitely not worth such a risk.so, they weren't real friends, plus they weren't particularly smart either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "November 09, 2022, 10:19:13 AM",
      "body": "Quote from: rhomelmabini on November 09, 2022, 07:28:21 AMQuote from: krishnaverma on November 09, 2022, 06:12:45 AMSo the lesson here is to never tell anyone exact amount you hold. You can inform just one member like your parents or wife about this so that they can recover the funds in case anything happens to you but never tell this information to casual friends or distant relatives. Or, never tell anything at all that may involve money, trust no one. I even rarely tell my wife how much I own but she's not the persistent one so it's fine for both of us in the end. Not everyone was really happy with what they got, others get jealous or they have others intent bad behind you.It is never important to let people know your worth of bitcoin,  people always tell the public what they have one wants to show up to let people know they are doing well to have such amount of bitcoin.  I don't see any reason for someone to let friends know the amount of bitcoin  he/she is investing if not to become relevant or to intimidate people. Amount of bitcoin for investment should be kept secrete because some people thinks to have some amount bitcoin it means you are super rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "November 09, 2022, 10:41:02 AMLast edit: November 09, 2022, 10:58:30 AM by pixie85",
      "body": "Quote from: mk4 on November 09, 2022, 09:01:09 AMQuote from: krishnaverma on November 09, 2022, 06:12:45 AMSo the lesson here is to never tell anyone exact amount you hold. You can inform just one member like your parents or wife about this so that they can recover the funds in case anything happens to you but never tell this information to casual friends or distant relatives. Heck, I'm going to go as far as to not mention bitcoin/crypto in general unless really needed. Pretty much only my closest friends know that I'm into crypto, and I mention my other non-crypto ventures when asked by other people about my income.I do the same but not because I'm scared but it also changes the social conversations into something awkward where they ask me if it's legal, if I'm laundering money, if I'm a hacker. I had enough of it so now I tell people that I manage social media and stuff OP is showing a general problem with showing off wealth, not only crypto. There's a guy in my town who was a famous youtuber and he bought a Mercedes AMG and used it in his videos. The car was parked in front of his house surrounded by a high fence and automatic gate. He also had cameras. Some guys came at night, unscrewed hinges of the gate and moved it out of the way, then used an electronic cracking tool to find frequency of his car, unlocked it and drove away. The car was later recovered but some of the parts were stripped. They probably got 10k just for the wheels.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "November 09, 2022, 11:13:50 AM",
      "body": "Envy and jealousy is a very bad thing. Not everyone who rolls with you are your friends. No matter who they are there should be boundaries as to what you reveal to them and what you don't. This extends far beyond your crypto holdings. This goes further into other investments - real estate, companies etc. This brings to mind the Law 2 of the 48 Laws of Power By Robert Greene: Never put too much trust in friends, learn how to use enemiesBe wary of friends—they will betray you more quickly, for they are easily aroused to envy. They also become spoiled and tyrranical. But hire a former enemy and he will be more loyal than a friend, because he has more to prove. In fact, you have more to fear from friends than from enemies. If you have no enemies, find a way to make them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 09, 2022, 12:07:43 PM",
      "body": "As has been said, this is not just a crypto thing. Don't let people know how much liquid / easily available funds you have in general.It's not just the criminals who are going to rob you, or kidnap you and hold for ransom. It's the conmen, the relatives who need money, the tax people.No, I'm not saying you should tell nobody. But, keeping your finances private and only let some people know is always a good thing.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "November 09, 2022, 12:12:03 PM",
      "body": "If the goal is to get people to know more and try to follow what you are investing in, it may have a positive impact. But such cases have also brought him into danger. I prefer to keep my holdings in crypto assets confidential. Although other people know what I invest but not by the amount and the most important thing is not to show off my popularity in public. The nature of large ownership always makes us want to look valued and show off in the eyes of the public as a social status.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 09, 2022, 12:14:08 PM",
      "body": "Quote from: Solosanz on November 09, 2022, 07:55:21 AMIt sounds like a fake story How can a kidnapped person can escape and told the police about a criminal in his home? businessman or an average person doesn't learn self defense since they're only learn about money management and investment. I just imagine a person who get kidnapped or $5 wrench attack, they must tell the private key or seed phrase to the criminal since he will scared and think his life is more important than money.This account might also be real. We have had several cases of people escaping from the kidnappers' den in my location. Kidnappers are humans and are prone to errors. They can oversee or even fail to secure their hideouts.It's hard to trust people this period because greed and materialism rule the world. There are so many stories of close family members killing each other because they want to have access to the victim's money. Currently, people can do anything just to get money. Revealing your financial status to only trusted persons is paramount because unveiling it to more persons increases the chances of becoming a target of these criminals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}