{
  "id": "topic_5448034",
  "title": "rahulzx",
  "author": "rahulzx",
  "created_time": "April 08, 2023, 12:48:05 PM",
  "content": "I have seen that there are a number of Hero and Legendary members here on this forum. I assume that you all done at least one mistake when you actively participating in the forum. If you would like to share a mistake you have made, it could help newcomers avoid making the same mistake when posting here.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448034",
  "comments": [
    {
      "author": "pakhitheboss",
      "created_time": "April 08, 2023, 01:02:23 PM",
      "body": "Quote from: rahulzx on April 08, 2023, 12:48:05 PMI have seen that there are a number of Hero and Legendary members here on this forum. I assume that you all done at least one mistake when you actively participating in the forum. If you would like to share a mistake you have made, it could help newcomers avoid making the same mistake when posting here.So you mean to say that only Hero and Legendary rank holders are allowed to reply on your topic. I feel you have come into the conclusion that they were never a Jr Member, Member, Full Member or a Senior Members. I have nothing against you. The only issue I have with this topic is that everyone makes mistakes before reaching the ultimate rank. There are members who are trying to reach those ranks. This topic should be generic in nature for you to evaluate and decide which mistake mattered the most as per your reasoning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "April 08, 2023, 01:09:27 PM",
      "body": "Quote from: rahulzx on April 08, 2023, 12:48:05 PMI have seen that there are a number of Hero and Legendary members here on this forum. I assume that you all done at least one mistake when you actively participating in the forum. If you would like to share a mistake you have made, it could help newcomers avoid making the same mistake when posting here.Mistake can be done by anyone, but the depth to the extent at which a mistake is made depends on individuals level of or areas of involvements, but if has always been careful in his dealings, maybe some errors could have been corrected instead of turning to be their mistakes, i dont think i have any in the past but the ones that may be common is on meriting wrong account or number of merits to a user,  wrongly sending a PM to a different user unknowingly, or even posting off topics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "April 08, 2023, 01:15:27 PM",
      "body": "Quote from: rahulzx on April 08, 2023, 12:48:05 PMI have seen that there are a number of Hero and Legendary members here on this forum. I assume that you all done at least one mistake when you actively participating in the forum. If you would like to share a mistake you have made, it could help newcomers avoid making the same mistake when posting here.I have been here for a year plus and probably have made a lot of mistakes along the way, my posts at the beginning weren’t that good. I struggled till it became easier for me to contribute what I have learned. One profound mistake I made and I see others doing the same mistake today is that I was careless with my privacy, with time I have seen reasons why it is important to dissociate your real life from your avatar on bitcointalk. It’s not very likely that newbies visit meta as much, I think this topic should be in Beginners & Help for reach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rahulzx",
      "created_time": "April 08, 2023, 01:16:30 PM",
      "body": "Quote from: pakhitheboss on April 08, 2023, 01:02:23 PMQuote from: rahulzx on April 08, 2023, 12:48:05 PMI have seen that there are a number of Hero and Legendary members here on this forum. I assume that you all done at least one mistake when you actively participating in the forum. If you would like to share a mistake you have made, it could help newcomers avoid making the same mistake when posting here.So you mean to say that only Hero and Legendary rank holders are allowed to reply on your topic. I feel you have come into the conclusion that they were never a Jr Member, Member, Full Member or a Senior Members. I have nothing against you. The only issue I have with this topic is that everyone makes mistakes before reaching the ultimate rank. There are members who are trying to reach those ranks. This topic should be generic in nature for you to evaluate and decide which mistake mattered the most as per your reasoning. I don't mean it that way  , they are the experience guys than others in forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daniel91",
      "created_time": "April 08, 2023, 01:21:57 PM",
      "body": "I'm not sure you'll get many honest answers here  None of us want to talk about our mistakes in public, as you know.However, I will still admit one of my mistakes, which is a personal conflict with a prominent member of the forum, which took place publicly, so that it was visible to everyone.Each of us felt that he was right and did not want to give up, but in fact it would be much better if we could resolve our misunderstandings privately, outside of the forum.We should try to avoid personal conflicts on the forum and in public, so that the forum remains a place for the crypto community to socialize and exchange useful information and opinions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "April 08, 2023, 01:26:19 PM",
      "body": "Quote from: rahulzx on April 08, 2023, 12:48:05 PMI have seen that there are a number of Hero and Legendary members here on this forum. I assume that you all done at least one mistake when you actively participating in the forum. If you would like to share a mistake you have made, it could help newcomers avoid making the same mistake when posting here.Creating a topic that is duplicate topic already from the past post due not using the forum search bar. This is what common mistake of user here even high rank when they are starting thread.Also creating a thread that giving an advice while the OP itself is still a low rank and just listing the most obvious advice that everyone else in the forum knew. I sometimes  do post a topic without putting the source link but I quickly edit it after someone noticing when I publish the thread. This kind of mistakes can ruined the Bitcointalk account even if it’s just an honest mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rahulzx",
      "created_time": "April 08, 2023, 02:24:56 PM",
      "body": "Quote from: Daniel91 on April 08, 2023, 01:21:57 PMI'm not sure you'll get many honest answers here  None of us want to talk about our mistakes in public, as you know.However, I will still admit one of my mistakes, which is a personal conflict with a prominent member of the forum, which took place publicly, so that it was visible to everyone.Each of us felt that he was right and did not want to give up, but in fact it would be much better if we could resolve our misunderstandings privately, outside of the forum.We should try to avoid personal conflicts on the forum and in public, so that the forum remains a place for the crypto community to socialize and exchange useful information and opinions. if personal conflict in publicly happen, mods will warn and remove the post no?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "April 08, 2023, 03:14:15 PM",
      "body": "I can't really think of anything much at all? I don't think there are much mistakes to be made on an online forum besides the typical plagiarism.Probably replying to a very old grave-dug thread that's unnecessarily revived by a spammer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "April 08, 2023, 03:18:56 PM",
      "body": "The only mistake I know newbies might make is to spam the forum. Meaning as a beginner you have to read the rules and regulations before you starts posting, then followed by not taking part in holding Bitcoin during my joining here then bitcoin were very affordable but since I wasn't that exposed to know that I have to hold for sometimes then I missed the whole increase of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 08, 2023, 03:23:47 PM",
      "body": "The mistakes on the forum could only be silly mistakes like getting an account banned due to getting plagiarism and later then that i don’t see too mistakes that can be made on this forum. In general if you are asking for advice to newbies about grave mistake they shouldn’t commit. I would say newbies  shouldn’t make mistake of investing into things because a member posted them here or doing business with just any member on the forum. Also newbies should be wary of the links and telegram they join on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "April 08, 2023, 03:50:50 PM",
      "body": "Quote from: pakhitheboss on April 08, 2023, 01:02:23 PMSo you mean to say that only Hero and Legendary rank holders are allowed to reply on your topic. I feel you have come into the conclusion that they were never a Jr Member, Member, Full Member or a Senior Members. I have nothing against you. The only issue I have with this topic is that everyone makes mistakes before reaching the ultimate rank. There are members who are trying to reach those ranks. This topic should be generic in nature for you to evaluate and decide which mistake mattered the most as per your reasoning. I get OP’s pov, newbie rank is when most accounts make silly mistakes like poor referencing, plagiarism, bumping old threads, e.t.c the newbies who do this probably do not realize what they are doing is wrong. As one gets more acquainted with the forum, you grow and learn from your mistakes.  Quote from: rahulzx on April 08, 2023, 02:24:56 PMif personal conflict in publicly happen, mods will warn and remove the post no?Lol no. Mods do not get involved in the quarrels between members. You should visit reputation more often, that’s where all the fun is. It’s like bitcointalk’s own reality tv show, full of drama and suspense. I missed some of the famous quarrels that happened before I joined the forum but it’s all still there for everyone to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "April 08, 2023, 04:58:49 PM",
      "body": "Quote from: rahulzx on April 08, 2023, 12:48:05 PMI have seen that there are a number of Hero and Legendary members here on this forum. I assume that you all done at least one mistake when you actively participating in the forum. If you would like to share a mistake you have made, it could help newcomers avoid making the same mistake when posting here.I'm honestly not sure if you'll get lot of honest answers from users, but of course we did. The most common mistake is posting off-topic, low quality or something like that. This is a mistake of the average user so you will surely get some of their posts which have been deleted by the moderators so far.If you are interested in knowing the statistics, then have a look at this one: Most Posts/Topics Deleted by ModeratorsBut rest assured, it is always possible to find a user making mistake whether intentional or not and out of these 33 forum rules I think there is always the potential to be broken.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "April 08, 2023, 05:25:50 PM",
      "body": "Quote from: rahulzx on April 08, 2023, 12:48:05 PMIf you would like to share a mistake you have made, it could help newcomers avoid making the same mistake when posting here.To trust a few users who had some positive ratings [mostly from DT2 users] to pay once I'm done delivering the work [I'm not implying that none of those who have positive ratings can be trusted, but if you can use escrow services, it'd be better (or at least have some respect for what you'll be doing and go with the 50-50 term)]!Note: Back then, we had a slightly different trust system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2double0",
      "created_time": "April 08, 2023, 05:26:00 PM",
      "body": "The most stupid mistake a person would do here is by saving their password to this forum, on their PC or phone.I believe that such sensitive data should never be kept on devices that remain online whole day and are vulnerable to malicious attacks which could lead to your account being compromised here. I did that mistake once, and thought that my account got compromised. But it didn't, and I immediately changed my password to a new, stronger and longer string to let hackers take years to get into my account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "April 08, 2023, 05:54:57 PM",
      "body": "During my early days I got a 1 or 2 week ban for low quality posts for a sig campaign I joined. At the time I barely knew anything about the forum and had not taken the time to learn any of the rules. If there is anything a newbie should do, it's read the RULES and the stickies in each section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RapTarX",
      "created_time": "April 08, 2023, 06:15:29 PM",
      "body": "Let me be honest. The great mistake was joining signature campaign; sometimes I feel like I'm posting low-quality here which doesn't make any sense LOL. It was happening when I was in campaigns that used to require X posts in a signature week. Though I have quit it so many times, I enjoy receiving the BTC; hence, I didn't quit completely.Quote from: yahoo62278 on April 08, 2023, 05:54:57 PMDuring my early days I got a 1 or 2 week ban for low quality posts for a sig campaign I joined. At the time I barely knew anything about the forum and had not taken the time to learn any of the rules. If there is anything a newbie should do, it's read the RULES and the stickies in each section.Thank you a lot for being honest. Shit happens & most people don't want to understand that. We are lucky that you weren't permanently banned. Otherwise, how would we get a quality campaign manager like you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "April 08, 2023, 07:02:19 PM",
      "body": "My biggest mistake is not being heavier on the ignore button.  I always tried to respond to questions and concerns about my activities, but there came a point where trolls and scammers used this attempt to maintain truth about my activities as a way to try and elevate themselves in the community.  It didn't matter what lies they told or how many alt accounts they had to burn making ridiculous claims, they just wanted attention and to damage my reputation by any means possible.  I see now that engaging with them only 'got them off' and even after some of them have been ignored for years, they still try their best to gain my attention with whatever lies they think the ignorant will believe.  Just hit the ignore button on trolls.  They outnumber contributing members to Bitcoin here 100 to 1 and with the trust network being a popularity contest to inflate trust for potential scams (see ColdKey scam) it is clear the train has gone off the rails and the inmates are running the asylum.  All you have to do is look at the DT1 members that still include Vod in their trust networks after Vod openly tried to extort me on this forum.  Truth is something here that literally doesn't matter anymore.  Don't fight for it.  It's a losing battle that will only negatively reflect against you here until those running this forum get their heads out of their ass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "April 08, 2023, 07:12:11 PM",
      "body": "No great mistakes so far in my journey on bitcointalk, only minor ones . I am just taking notes from other members and from threads which were made to serve as guides to newer users. I am still in the learning phase, no one completely leaves this phase.If there is something I would like to do more of, it would be to help out moderators in their job by reporting posts which need their attention. I never seem to be able to find enough time to do as much as I would want to and hope to find the perfect balance between the forum and other engagements one has.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "April 08, 2023, 07:34:06 PM",
      "body": "getting temporarily banned for 14 days for spamming/off-topic/posting extremely low-quality posts. this happened in 2019, checking my inbox on my messages, there are at least more than 30+ posts deleted in the span of 2 weeks which caused me to get temporarily banned for two weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}