{
  "id": "topic_5475882",
  "title": "jerry0",
  "author": "jerry0",
  "created_time": "November 29, 2023, 05:13:23 AM",
  "content": "So I heard about what happened a while back with terra luna going down and also the stablecoin.  At the moment, what is the current price for the original terra luna and the stablecoin related to it?  I remember at one  point it was close to 100 dollars usd for the original coin but how much is it now?Also, I heard there then became another terra luna coin and USTC?  Can someone explain this to me?  Now I also notice on coinmarket, the USTC went up a lot.  I also notice a post about this as well.  Does this mean right now you can buy and sell and thus trade these 2 coins at the moment?  So wouldn't it be like the risk are low but the rewards are high because it already is very low?  I thought I read like the stablecoin was something like $0.001 or something like that so if it goes up, well there is a ton of potential like you can 10x or 100x it?  You can also lose 90% or 100% but if you don't put a lot of money on it... well isn't the amount you going to risk losing going to be very small compared to how much it goes up?  Example you put $100 in both of these coins.  The most you will lose is pretty much all of it so $200 total.  But since it's so low if you double up even, you can just cash out.  But not only that, you can probably 5x or 10x?  Whereas if you go down 5x or 10x, well you the most you can lose is what you put in which is $100 each on terra luna and USTC each?  I remember when that happened a while back, people said doesn't hurt to put money in terra luna and the stablecoin because it already dropped like 80%.  But the point here is your returns can be many x the amount right?Now which exchanges can you buy or sell this terra luna and USTC?  Also these coins are completely different from the original terra luna 2 coins right?  Can you buy/sell on coinbase or gemini or you need access to say binance or binance US?  Would you have to use those decentralized exchanges like uniswap or pancakeswap for this?  I never used any of these so no clue how they work.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475882",
  "comments": [
    {
      "author": "kentrolla",
      "created_time": "November 29, 2023, 08:21:49 AM",
      "body": "Take my sincere suggestion and stay away from these Terra related coins it will just kill your piece of mind and push you to anxiety if you are not actively monitoring and trading because it's been three days I have entered into it for some quick profits and indeed I have got good returns but being a tenured trader I find it difficult to control emotions and the price fluctuations are really difficult to manage, it's a clear manipulation by the whales to end up dumping everything in the market with big shorting. If you want you may try one time trade for some quick profit but at per high risk potential. Don't indulge into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 01, 2023, 11:15:27 PM",
      "body": "How much is the original terra luna worth now compared to back then?  Is it still called terra luna and the original one?  What about the terra usdt coin that lost it's peg from 1.00.  How much is it now and is it still that terra usdt?  Or is it a different name in terra classic usd?So did anyone who owned terra luna or terra usdt... the original 2 coins lost everything or the coins still exist but it's worth 1% or whatever it is now?I was confused reading about it because I remember the issue people said was something about having to burn coins so if terra luna goes up, terra usdt has to go down and lose it's peg or vice versa.  So what exactly happened there?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "poodle63",
      "created_time": "December 01, 2023, 11:34:18 PM",
      "body": "Quote from: jerry0 on December 01, 2023, 11:15:27 PMHow much is the original terra luna worth now compared to back then?  Is it still called terra luna and the original one?  What about the terra usdt coin that lost it's peg from 1.00.  How much is it now and is it still that terra usdt?  Or is it a different name in terra classic usd?So did anyone who owned terra luna or terra usdt... the original 2 coins lost everything or the coins still exist but it's worth 1% or whatever it is now?I was confused reading about it because I remember the issue people said was something about having to burn coins so if terra luna goes up, terra usdt has to go down and lose it's peg or vice versa.  So what exactly happened there?there are two coin luna and lunc basically just forked coins, their value now was just only a fraction of what they have back then, also USTC losing losing peg when there was a swap that amounts to 85 million dollars if im not mistaken taking place in one single swoop making the entire system that ustc was built on basically fragile system where each 1 USTC isn't truly pegged to 1 dollar, so when that swap take place, terra luna and USTC crashed so hard it just have fraction of its value.overall its already a dead coin don't invest in it if you don't want to lose your entire saving and let it vanish into thin air, current pump was more likely due to short lates hypes of future contract by binance but eventually it will go down again after all, what can a dead coin do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "December 02, 2023, 03:50:42 AM",
      "body": "There are 3 coins now 1) Lunc: This is original Luna coin 2) USTC 3) Terra Luna (Luna 2.0): This is new coin. Regarding price, you could search yourself on CMC/CG, you will find there exchanges listed them as well. LUNC, USTC are rising due to speculated revamp plan. You can read more about it here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 02, 2023, 04:10:19 AM",
      "body": "I checked LUNC the original terra luna.  It's worth $0.0001?  So basically 1% of 1 penny?USTC the original terra luna stable coins is around $0.05 so it lost 95% of it's peg?So if you were to buy any of these 3 coins, only buy LUNC or USTC and avoid the Terra Luna (Luna 2.0)?  It shows Terra Luna is about $0.80 but it doesn't mean 80 cents or it does?  So if you buy 100 LUNA now, it's worth $80?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samlucky O",
      "created_time": "December 02, 2023, 04:47:56 AM",
      "body": "Quote from: jerry0 on November 29, 2023, 05:13:23 AMSo I heard about what happened a while back with terra luna going down and also the stablecoin.  At the moment, what is the current price for the original terra luna and the stablecoin related to it?  I remember at one  point it was close to 100 dollars usd for the original coin but how much is it now?I think the price is $0.803 now Tera Luna was a very big shock to it's investors. When this Luna fall dip 2022 I was not even much into crypto system, but the shock was everywhere on Twitter and crypto websites. What happened to Tera Luna is a warning sign to people to always diversify there portfolio in other no to incure much loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "December 02, 2023, 08:54:16 AM",
      "body": "I will still remember that the UST pool was \"attacked\" on Curve, BTC decreased, leading to UST losing the threshold of 1 USD (depeg). And the days that followed were a series of price disasters. The project side seems to not have enough capacity to resolve the situation.''domino'' on the crypto market.A series of projects related to this platform have suffered the same situation. In fact, it is impossible to measure the exact amount of damage that the LUNA-UST \"disaster\" has caused, is causing, or is about to cause to the cryptocurrency market.The garbage dump in the market will still have people operating and creating hype for their own purposes, but in my opinion, forget about it and look forward to the good future of the crypto field. Incidents like Luna teach us that crypto is not always safe, as financial vulnerabilities can cause another major disaster to occur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God bless u",
      "created_time": "December 02, 2023, 10:13:03 AM",
      "body": "You asked so many questions OP.. I will answer some questions according to my knowledge. QuoteAt the moment, what is the current price for the original terra luna and the stablecoin related to it?  I remember at one  point it was close to 100 dollars usd for the original coin but how much is it now?Current price you can check in the coinmarkecap  which will give you real time price. I want to clear one thing that  Luna classic and Ustc is no more real token and now just working just like meme coins and listed in many exchanges.. The purpose of coins is just like meme coin which has no use case, no team, no road map.. Luna V2 is now official token of luna team but this project already lost trust and now it cannot be like before. Currently token is trading at 0.8$https://coinmarketcap.com/currencies/terra-luna-v2/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slashz9",
      "created_time": "December 02, 2023, 12:07:53 PM",
      "body": "Quote from: kentrolla on November 29, 2023, 08:21:49 AMTake my sincere suggestion and stay away from these Terra related coins it will just kill your piece of mind and push you to anxiety if you are not actively monitoring and trading because it's been three days I have entered into it for some quick profits and indeed I have got good returns but being a tenured trader I find it difficult to control emotions and the price fluctuations are really difficult to manage, it's a clear manipulation by the whales to end up dumping everything in the market with big shorting. If you want you may try one time trade for some quick profit but at per high risk potential. Don't indulge into it.it applies to people who want to make quick profits.because every year or every month there will continue to be pump and dump schemes like that and people are still interested in it.meaning people consciously follow it, so they know the risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "December 02, 2023, 12:35:11 PM",
      "body": "Quote from: jerry0 on December 01, 2023, 11:15:27 PMHow much is the original terra luna worth now compared to back then?  Is it still called terra luna and the original one?  What about the terra usdt coin that lost it's peg from 1.00.  How much is it now and is it still that terra usdt?  Or is it a different name in terra classic usd?So did anyone who owned terra luna or terra usdt... the original 2 coins lost everything or the coins still exist but it's worth 1% or whatever it is now?I was confused reading about it because I remember the issue people said was something about having to burn coins so if terra luna goes up, terra usdt has to go down and lose it's peg or vice versa.  So what exactly happened there?You already mentioned it. Terra  $LUNA was worth over $105 prior to the crash and it immediately dipped 50% to $51 before plummeting hard and yes, the CEO of Terraform Labs (which was the parent company behind UST and LUNA). There's no clear information right now whether or not he still owns LUNA because the total supply was exponentially increased so even if he owned a lot of the original LUNA, it should be worth close to nothing. Last I heard about Do Kwon, he was on the run and later apprehended by authorities.I wouldn't put too much efforts on this considering the protocol already failed outright. Best bet would be to get hands on a new an exciting project that can replicate achieve similar level of success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "December 02, 2023, 01:09:40 PM",
      "body": "Everything related to Terra related coins is an attempt to give you false hope in something that may never happen at all, and it is, at best, a pump dump if not a scam. The currency died a long time ago and all efforts to revive it will be related to achieving a temporary profit before it leads to you losing your money. The names are different but the meaning is the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 02, 2023, 01:18:02 PM",
      "body": "Quote from: jerry0 on November 29, 2023, 05:13:23 AMSo I heard about what happened a while back with terra luna going down and also the stablecoin.  At the moment, what is the current price for the original terra luna and the stablecoin related to it?  I remember at one  point it was close to 100 dollars usd for the original coin but how much is it now?Also, I heard there then became another terra luna coin and USTC?  Can someone explain this to me?  Now I also notice on coinmarket, the USTC went up a lot.  I also notice a post about this as well.  Does this mean right now you can buy and sell and thus trade these 2 coins at the moment?  So wouldn't it be like the risk are low but the rewards are high because it already is very low?  I thought I read like the stablecoin was something like $0.001 or something like that so if it goes up, well there is a ton of potential like you can 10x or 100x it?  You can also lose 90% or 100% but if you don't put a lot of money on it... well isn't the amount you going to risk losing going to be very small compared to how much it goes up?  Example you put $100 in both of these coins.  The most you will lose is pretty much all of it so $200 total.  But since it's so low if you double up even, you can just cash out.  But not only that, you can probably 5x or 10x?  Whereas if you go down 5x or 10x, well you the most you can lose is what you put in which is $100 each on terra luna and USTC each?  I remember when that happened a while back, people said doesn't hurt to put money in terra luna and the stablecoin because it already dropped like 80%.  But the point here is your returns can be many x the amount right?Now which exchanges can you buy or sell this terra luna and USTC?  Also these coins are completely different from the original terra luna 2 coins right?  Can you buy/sell on coinbase or gemini or you need access to say binance or binance US?  Would you have to use those decentralized exchanges like uniswap or pancakeswap for this?  I never used any of these so no clue how they work.There are so many questions there and I do not want to snip anyone, but I will summarize the replies based on my understanding.First, be very careful in dealing with the Terra project, but still, it might earn you so much if you are an aggressive risk-taker. By the old USTC, you mean UST and the price is $0.01594 according to CoinDesk. Of which Terra is planning to burn more of it to make it more scarce, maybe it will help the Terra projects further, I can ascertain, however, burning often help coins/token to appreciate.During the crypto bull run, I don't think there is any popular asset that will not have a share of the bull run, this is why we see the dead or almost-dead coins/tokens, including the Terra projects coming back to life. Although I knew that projects like LUNA and LUNC would appreciate due to halving and wanted to buy months ago. It's always like that. But be careful and do thorough research if you would buy them at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mdzahed134",
      "created_time": "December 02, 2023, 05:24:36 PM",
      "body": "I was hold some LUNA when it was crashed value was almost zero that's why i can't sell old LUNA, then holding in Binance, Then Tera Classic (LUNC) is implemented and i got some LUNC for LUNA, So i think now LUNC is a real LUNA coin and listed on the Binance exchange & people’s trading it & volume over 300$ million. USTC is Tera Classic USD it’s a stable coin of LUNA but price is dumping hardly now 0.05$.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oneandpure",
      "created_time": "December 02, 2023, 05:32:28 PM",
      "body": "All coins from Terra Luna network have been upgrading with new kinds of coins and change smart contract, if you hold old terra luna your coins have been automatically replace by other kinds of Luna coins with cheapest values. Forget with how much assets before when investing in Terra Luna platform coins exactly after crashing not start good moment recovery to higher price. The only one of Terra Luna coins not change smart contract is USTC, still the same USTC you hold before price dropping drastically and current USTC price around $0.05. There are many question for Terra Luna coin holder if not seeing with current news, they will be shocked and surprised what happen with Luna coins dropped drastically and assets above $100 will be nothing right nor if hold some of Luna coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "December 02, 2023, 05:36:47 PM",
      "body": "Quote from: jerry0 on December 01, 2023, 11:15:27 PMHow much is the original terra luna worth now compared to back then?  Is it still called terra luna and the original one?  What about the terra usdt coin that lost it's peg from 1.00.  How much is it now and is it still that terra usdt?  Or is it a different name in terra classic usd?So did anyone who owned terra luna or terra usdt... the original 2 coins lost everything or the coins still exist but it's worth 1% or whatever it is now?I was confused reading about it because I remember the issue people said was something about having to burn coins so if terra luna goes up, terra usdt has to go down and lose it's peg or vice versa.  So what exactly happened there?After the terra luna crash the team failed to repeg their stablecoin and they saw there is no way around to fix the problem. So they renamed their old terra luna to LUNAC and stable coin to USTC. They have also issued a new terra luna with the same name LUNA and stable coin UST. Old LUNA which is renamed LUNAC, was around 100$ i think but the new LUNA coin is below one dollar. They lost the community and trust from their user. No one is talking about LUNA right now which was talk of the town in the last bull run.That burn event you are talking about is from recent airdrop speculation, I think. I saw it somewhere that those who owned UST before the crash can burn their UST and get an airdrop in their ecosystem. This can be bit different as i don't have that news link right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "December 03, 2023, 04:33:20 PM",
      "body": "Quote from: Samlucky O on December 02, 2023, 04:47:56 AMQuote from: jerry0 on November 29, 2023, 05:13:23 AMSo I heard about what happened a while back with terra luna going down and also the stablecoin.  At the moment, what is the current price for the original terra luna and the stablecoin related to it?  I remember at one  point it was close to 100 dollars usd for the original coin but how much is it now?I think the price is $0.803 now Tera Luna was a very big shock to it's investors. When this Luna fall dip 2022 I was not even much into crypto system, but the shock was everywhere on Twitter and crypto websites. What happened to Tera Luna is a warning sign to people to always diversify there portfolio in other no to incure much loss.What you said there about the lesson might be true but I also think that some coins like BTC are safe to entrust with our money alone. Other than that, if we always monitor our investments and always be updated on the coin that we HODL and the happenings around, I think we can take-off at a right time, before the worse things happens.It's only sad to know that some projects here have a bad intention. They are only good at the start, so that they can get the trust of their investors. We need to take time to investigate before we invest, so that we can avoid bad projects like this. Now that we are now close to a supposed bull run, a lot of projects like that are going to spawn. So, stay safer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "redsun114",
      "created_time": "December 05, 2023, 05:59:55 PM",
      "body": "The original Terra Luna Coin, called LUNA previously, has turned into a meme coin after the incident where the stablecoin, UST (Now USTC) lost its peg and dropped below $1 and the reason for that was that the peg wasn't backed by real money but it was an algorithmic stablecoin which means that the value would depend on an algorithm and that thing created by Terra backfired badly and it took the whole project down in no time, investors of their coins lost millions of dollars in that.They then created a new chain with a new coin, named it LUNA, and renamed the old LUNA coin to LUNC (LUNA Classic), UST, the stablecoin, was named USTC, and all of them are still tradeable in most cryptocurrency exchanges, Binance has them all listed and they are being traded like any other cryptocurrency.They do lose and gain value over time, a couple of days ago, USTC and LUNC were rising a bit, however, they lost the trust they had before and people only use them for very short terms just to gain small percentages of profit now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "puloweh555",
      "created_time": "December 05, 2023, 08:41:39 PM",
      "body": "Quote from: mdzahed134 on December 02, 2023, 05:24:36 PMI was hold some LUNA when it was crashed value was almost zero that's why i can't sell old LUNA, then holding in Binance, Then Tera Classic (LUNC) is implemented and i got some LUNC for LUNA, So i think now LUNC is a real LUNA coin and listed on the Binance exchange & people’s trading it & volume over 300$ million. USTC is Tera Classic USD it’s a stable coin of LUNA but price is dumping hardly now 0.05$. Talking about LUNA coin, there are certainly many who feel hurt and disappointed with this coin which has caused them losses, which in the end they replaced it with Tera Classic (LUNC). And for me, even though they get LUNC, this still doesn't cover their losses when holding LUNA. And even though the price of LUNC has gone up recently, I'm sure many people are traumatized by investing in this coin.Because I think coin It will fall back to where it was for over a year, the whales buy and push coins and we buy then they sell everything and then it will fall even lower, there is no hope before they burn that 5 trillion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lamkuthang",
      "created_time": "December 06, 2023, 03:23:28 PM",
      "body": "Quote from: redsun114 on December 05, 2023, 05:59:55 PMThey do lose and gain value over time, a couple of days ago, USTC and LUNC were rising a bit, however, they lost the trust they had before and people only use them for very short terms just to gain small percentages of profit now.Coincidentally, some time ago we saw that the movement was quite good, but now it has dropped slightly. If we look at it, it seems like they lack focus and expect too much from buyers. I'm just arguing that if they want to speed up and gain market confidence, do a pump when the price is corrected, even though it's not deep.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}