{
  "id": "topic_5472845",
  "title": "jrrsparkles",
  "author": "jrrsparkles",
  "created_time": "November 04, 2023, 05:56:00 PM",
  "content": "We have lot of choices for bitcoin in the crypto industry but there are very limited choices when it comes to open source, non-custodial, multi-crypto wallet so let's hear your apps and it may be useful for the altcoin holders to choose the right wallets for long term storage.Android/IOS = Unstoppable walletDesktop = crypto-com/chain-desktop-walletBoth these wallets support multi-crypto and open sourced so anyone looking for alternatives for Trust wallet, Mycelium and Coinomi which al are closed source then let's give it a try to the apps mentioned above.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472845",
  "comments": [
    {
      "author": "Orpichukwu",
      "created_time": "November 04, 2023, 06:37:14 PM",
      "body": "I also started making use of an unstoppable wallet recently after my thread on the technical board. A lot of members recommended it for use, and even the forum administrator is among those who recommend the use of the wallet. You can check out the coins that are supported by the unstoppable wallet here: . Coins Supported by Unstoppable Wallet  I also make use of the Metamask wallet. I don't know if they are open source, but it's been part of the oldest wallet I have been making use of in the past, and there is no problem. It has both desktop and mobile compatibility, but the desktop version has more features built into it than the mobile version.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 04, 2023, 07:31:39 PM",
      "body": "Quote from: Orpichukwu on November 04, 2023, 06:37:14 PMI also make use of the Metamask wallet. I don't know if they are open source, but it's been part of the oldest wallet I have been making use of in the past, and there is no problem. It has both desktop and mobile compatibility, but the desktop version has more features built into it than the mobile version.Metamask is also open source wallet but it doesn't come in the form of an application but in an extension form that supports limited networks compared to other service wallets but its still one of the best for token storage but only due to the limited network and not having dedicated app even after all these year is a negative in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "November 04, 2023, 08:50:13 PM",
      "body": "Quote from: jrrsparkles on November 04, 2023, 07:31:39 PMMetamask is also open source wallet but it doesn't come in the form of an application but in an extension form that supports limited networks compared to other service wallets but its still one of the best for token storage but only due to the limited network and not having dedicated app even after all these year is a negative in my opinion.Imo, that's not the biggest issue with Metamask. It is the fact that there's almost no privacy when using metamask because I remember sometime this year when they put out a public announcement that they have to openly track user footprint using their RPC from sister company — Infura. That, and also the fact that metamask currently have one of the worse UX despite being the most popular EVM wallet available today. I was a fan but Rabby wallet won me over. With Rabby, Users can also see decoded output of the hex value/hash being signed which is a plus for Security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "November 04, 2023, 09:08:49 PM",
      "body": "I am not sure, but TrustWallet seems to claim to be an open-source, non-custodial wallet that supports multiple cryptocurrencies. I am not aware of these two wallets you mentioned in the post. Currently, I don't feel safe with wallet software when the question is storing large amounts. I think we have to practice using a hardware wallet to store our funds. Otherwise, keep using an existing trusted non-custodial wallet instead of choosing a new one that we are unaware of. Hardware wallets don't cost too much lately since a lot of companies have launched hardware wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 04, 2023, 09:51:52 PM",
      "body": "Quote from: The Cryptovator on November 04, 2023, 09:08:49 PMI am not sure, but TrustWallet seems to claim to be an open-source, non-custodial wallet that supports multiple cryptocurrencies. Trust wallet was open source but after Binance acquired it in 2018 they became closed source. You can even find the details on Github which never updated for very long time. So if you are not aware of it then please be cautious and google results says its open source which is kind of misleading information available in their site.Quote from: The Cryptovator on November 04, 2023, 09:08:49 PMI am not aware of these two wallets you mentioned in the post. Currently, I don't feel safe with wallet software when the question is storing large amounts. I think we have to practice using a hardware wallet to store our funds. Otherwise, keep using an existing trusted non-custodial wallet instead of choosing a new one that we are unaware of.Unstoppable wallet is even recommended by theymos Quote from: theymos on November 15, 2022, 02:36:52 AMIf you have a large variety of different crypto assets that you need to store, there's Unstoppable walletand crypto.com is also not really new which is here for years and being an open source you no need to trust them. HW are good for storing big amounts but for an average joe it may not be really necessary and instead of trusting a closed source app with your money its good to prefer an open sourced.Quote from: The Cryptovator on November 04, 2023, 09:08:49 PMHardware wallets don't cost too much lately since a lot of companies have launched hardware wallets.Another issue with HW wallets in recent days is the privacy of users is in question especially Ledger gave false information about being open source and their ledger live application has the capability of extracting recovery seeds of users which isn't looking good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "November 05, 2023, 03:17:44 AM",
      "body": "Quote from: jrrsparkles on November 04, 2023, 05:56:00 PM anyone looking for alternatives for Trust wallet, Mycelium and Coinomi which al are closed sourceMycelium is open source wallet.https://github.com/mycelium-comhttps://walletscrutiny.com/?platform=allPlatforms&page=0&query-string=MyceliumQuote from: jrrsparkles on November 04, 2023, 09:51:52 PMQuote from: The Cryptovator on November 04, 2023, 09:08:49 PMI am not sure, but TrustWallet seems to claim to be an open-source, non-custodial wallet that supports multiple cryptocurrencies. Trust wallet was open source but after Binance acquired it in 2018 they became closed source. You can even find the details on Github which never updated for very long time. So if you are not aware of it then please be cautious and google results says its open source which is kind of misleading information available in their site.IIRC, they were also use some misleading wording in their website which make regular user thought it is an open source application.In regarding the reason why they move to closed source is becaesu they claim, their app is cloned for nefarious purpose.https://trustwallet.medium.com/why-open-sourcing-android-app-could-be-a-harm-to-the-crypto-community-fb3ae1707dc6Quote from: jrrsparkles on November 04, 2023, 09:51:52 PMand crypto.com is also not really new which is here for years and being an open source you no need to trust them. HW are good for storing big amounts but for an average joe it may not be really necessary and instead of trusting a closed source app with your money its good to prefer an open sourced.Worth to note that wallets being open source doesn’t automatically imply it safe, trustable, and secure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 05, 2023, 03:59:41 AM",
      "body": "Being open source does not necessarily mean that you are safe, as you must ensure that the code that you install on your device is the same as the open source code and that there are enough reviews to say that this open source code is safe.You can verify that you are installing the same code by verifying the signature, but there must be enough reviews, otherwise there is no difference between closed source and open source code.A while ago, there was a scammer who put open source code for a wallet, but when you installed the wallet, the code was completely different and he stole the money.I have never heard of https://github.com/crypto-com/chain-desktop-wallet and I don't want to know if it is safe, but I created a topic about user experiences regarding Unstoppable wallet and this is the link https://bitcointalk.org/index.php?topic=5436273.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 05, 2023, 05:24:37 AM",
      "body": "Quote from: jrrsparkles on November 04, 2023, 07:31:39 PMQuote from: Orpichukwu on November 04, 2023, 06:37:14 PMI also make use of the Metamask wallet. I don't know if they are open source, but it's been part of the oldest wallet I have been making use of in the past, and there is no problem. It has both desktop and mobile compatibility, but the desktop version has more features built into it than the mobile version.Metamask is also open source wallet but it doesn't come in the form of an application but in an extension form that supports limited networks compared to other service wallets but its still one of the best for token storage but only due to the limited network and not having dedicated app even after all these year is a negative in my opinion.Metamask allows custom networks, so you can add any network available even if it's not there by default, easiest way to do this is with chainlist [1]. Recently, they have also added snaps feature to allow user to interact with different non-evm networks which are not supported natively (solana, cosmos, tezos, polkadot, etc), this feature is somewhat like add-on as far as I understand. There is metamask android app too. [1] https://chainlist.org/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 05, 2023, 07:48:28 AM",
      "body": "Quote from: Husires on November 05, 2023, 03:59:41 AMI have never heard of https://github.com/crypto-com/chain-desktop-wallet and I don't want to know if it is safe, but I created a topic about user experiences regarding Unstoppable wallet and this is the link https://bitcointalk.org/index.php?topic=5436273.0I posted those two wallets simply because I saw some of the veterans who are active in the technical discussion board suggested to the users so I think it is safe but as I said this thread can serve us to find all the available options and choose the best for the users according to their requirements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "November 05, 2023, 09:46:59 PM",
      "body": "Quote from: jrrsparkles on November 04, 2023, 05:56:00 PMDesktop = crypto-com/chain-desktop-walletMy first time hearing about this wallet. it might be worth checking out.Quote from: jrrsparkles on November 04, 2023, 05:56:00 PMBoth these wallets support multi-crypto and open sourced so anyone looking for alternatives for Trust wallet, Mycelium and Coinomi which al are closed source then let's give it a try to the apps mentioned aboveMycelium is open source, though its developers started using it to advertise scams, so I don't like it.Quote from: Orpichukwu on November 04, 2023, 06:37:14 PMIt has both desktop and mobile compatibility, but the desktop version has more features built into it than the mobile version.Metamask has a standalone desktop wallet software? I only know of the browser extensions and mobile apps",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "November 06, 2023, 03:04:28 PM",
      "body": "This needed to be updated from time to time or have a regular discussion to bring this topic to the top. Unstoppable wallet should be at the top of any search engine but for some reason it's the trash and centralized app called f***wallet that noobs tend to end up using.Quote from: JeromeTash on November 05, 2023, 09:46:59 PM[....]Mycelium is open source, though its developers started using it to advertise scams, so I don't like it.Those ads are the reason I uninstalled this wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Publictalk792",
      "created_time": "November 06, 2023, 03:59:43 PM",
      "body": "There are many wallets in the market and many of them are open source wallet like MetaMask. I will try to use this wallet and will share my experience after using. At this time this is new and no one knows how much it is reliable. By thew way thanks for sharing this wallet. I have installed it and will try to use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "November 08, 2023, 04:58:18 PM",
      "body": "Quote from: Husires on November 05, 2023, 03:59:41 AMBeing open source does not necessarily mean that you are safe, as you must ensure that the code that you install on your device is the same as the open source code and that there are enough reviews to say that this open source code is safe.You can verify that you are installing the same code by verifying the signature, but there must be enough reviews, otherwise there is no difference between closed source and open source code.That is also a valid concern about open-source projects. Regular users can't make a judgment on their own. They cannot understand the code. So the whole idea of open source must mean it is safe is a misconception.The last point for the end user besides ensuring the reproducibility of the program is also the project must be massively used by the users, and that might come from consistent development with a good ecosystem. So the project gathers and attracts technical people to work toward the developments. More eyes should be able to detect in case if there is something shady or wrong within the code. So the trust within the community itself is already built.Quote from: JeromeTash on November 05, 2023, 09:46:59 PMQuote from: Orpichukwu on November 04, 2023, 06:37:14 PMIt has both desktop and mobile compatibility, but the desktop version has more features built into it than the mobile version.Metamask has a standalone desktop wallet software? I only know of the browser extensions and mobile appsI'm pretty sure he means the browser extension instead of an installed desktop software.Quote from: Yogee on November 06, 2023, 03:04:28 PMQuote from: JeromeTash on November 05, 2023, 09:46:59 PMMycelium is open source, though its developers started using it to advertise scams, so I don't like it.Those ads are the reason I uninstalled this wallet.I forgot that they do advertise a scam. This should also be noted that some open-source project teams might be prone to such bad ethics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 10, 2023, 07:56:03 AM",
      "body": "Quote from: Publictalk792 on November 06, 2023, 03:59:43 PMThere are many wallets in the market and many of them are open source wallet like MetaMask. I will try to use this wallet and will share my experience after using. At this time this is new and no one knows how much it is reliable. By thew way thanks for sharing this wallet. I have installed it and will try to use it. It's not entirely new, they have been here for a while also if you have participated or read the discussions related to those wallets,s especially the Unstoppable wallet is the best alternative available to trust wallet and other multi-crypto wallets and has many users who also expressed their feedbacks about the wallet in the wallets section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "November 12, 2023, 11:05:27 AM",
      "body": "Quote from: jrrsparkles on November 04, 2023, 05:56:00 PMWe have lot of choices for bitcoin in the crypto industry but there are very limited choices when it comes to open source, non-custodial, multi-crypto wallet so let's hear your apps and it may be useful for the altcoin holders to choose the right wallets for long term storage.Android/IOS = Unstoppable walletDesktop = crypto-com/chain-desktop-walletBoth these wallets support multi-crypto and open sourced so anyone looking for alternatives for Trust wallet, Mycelium and Coinomi which al are closed source then let's give it a try to the apps mentioned above.Open source, non-custodial wallets are great. But they're still considered \"software wallets\". You know how risky it is to store large amounts of crypto in such a wallet. If these apps had hardware wallet support, then it would've been another story. I'd prefer to use an open source hardware wallet with an open source software wallet for complete peace of mind. I don't think such thing exists for mobile OSes such as Android or iOS, but nothing's stopping developers from making it happen in the future. If you're storing small amounts of crypto, then a software wallet would be more than enough to fulfill your needs. Lets hope we get more choices for true financial freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sophokles",
      "created_time": "November 12, 2023, 11:36:35 AM",
      "body": "Open source wallets are better in terms of security and there are few open source wallets that support most of the devices and OS. They are good for regular uses like if someone has to use his wallet more frequently to use any dapps then these wallets are the best choices but hardware wallets can provide the best security for your funds. If you are a long term holder then one of the hardware wallets can be your best friend to keep your funds secure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "November 12, 2023, 12:37:58 PM",
      "body": "Quote from: jrrsparkles on November 04, 2023, 05:56:00 PMAndroid/IOS = Unstoppable walletI would like to give my opinion regarding this wallet, which I have used for several months since the beginning of this year, and I still keep it on my device for quick uses when I am away from the office, since I only have the Electrum Bitcoin wallet on my phone.I can say that my experience with it was not bad and is quite satisfactory, since using the wallet is very easy and any user, whether a beginner or an experienced one, can use it without facing complications of any kind. The only important thing is to be able to distinguish between different networks because this is what makes it a bit difficult for multi-currency wallets.The only criticism is that I was not able to set the fee when I wanted to send. The fees are determined automatically from the wallet, and I do not know the source of those settings, that is, how the amount of those fees is determined according to any data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "November 12, 2023, 12:47:51 PM",
      "body": "I have used unstoppable wallet a couple of times on my mobile device. I was previously using Electrum wallet and after the last update I have now completely stopped using it. I generally  prefer using its desktop version as it is far better than the mobile version. Unstoppable is not completely a Bitcoin wallet you can add other cryptocurrency to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 13, 2023, 12:50:59 PM",
      "body": "Quote from: Orpichukwu on November 04, 2023, 06:37:14 PMI also make use of the Metamask wallet. I don't know if they are open source, but it's been part of the oldest wallet I have been making use of in the past, and there is no problem. It has both desktop and mobile compatibility, but the desktop version has more features built into it than the mobile version.You can use kiwi/lemur/mises browsers to use metamask extension on android or if you are on iOS you can orion browser (I don't have iOS so idk how well it works there), on android at least it works good as desktop, just pop-ups happen on new tab instead of same screen pop-up as on desktop. Alternative option is Alpha wallet, available on both android/ios, open source, repos can be found on website [1]. Evm chains only. [1] https://alphawallet.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}