{
  "id": "topic_5452387",
  "title": "BF-Fi",
  "author": "BF-Fi",
  "created_time": "May 11, 2023, 02:24:04 PMLast edit: May 12, 2023, 06:25:09 AM by BF-Fi",
  "content": "This thread moved to the following Ann thread :- https://bitcointalk.org/index.php?topic=5450576.msg62231631#msg62231631",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452387",
  "comments": [
    {
      "author": "Eternad",
      "created_time": "May 11, 2023, 02:50:51 PM",
      "body": "This kind of discussion should be posted on your ANN thread https://bitcointalk.org/index.php?topic=5450576.msg62165818#msg6216581. because the topic is just circulating on your casino use case. Creating a separate thead to promote your casino is not allowed because this can be considered as duplicate topic. You should be cautious on doing this kind of thread or else the moderator might punish you for violating the rules.If you want to create a discussion on a particular topic. Make sure that it didn't mention your services such as promoting it because doing this will just advertise your casino instead of a discussion. You free to do all of this on your own ANNthread. Your project is nice btw. Lock this thread or edit your content if you want to continue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 11, 2023, 03:35:22 PM",
      "body": "Quote from: Eternad on May 11, 2023, 02:50:51 PMThis kind of discussion should be posted on your ANN thread https://bitcointalk.org/index.php?topic=5450576.msg62165818#msg6216581. because the topic is just circulating on your casino use case. Creating a separate thead to promote your casino is not allowed because this can be considered as duplicate topic. You should be cautious on doing this kind of thread or else the moderator might punish you for violating the rules.If you want to create a discussion on a particular topic. Make sure that it didn't mention your services such as promoting it because doing this will just advertise your casino instead of a discussion. You free to do all of this on your own ANNthread. Your project is nice btw. Lock this thread or edit your content if you want to continue.He could edit this to make sure it won't look like it's another ANN thread in the gambling forum.  In the Ann thread also there is another user there who is probably a rep as well of this casino named Ubetsports01 replying to inquiries.Looks very interesting platform actually,  decentralized platform with no centralized bookie is something new. There are just a few sports on the websites though. Most of them seem Coming Soon yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "May 11, 2023, 03:52:55 PM",
      "body": "Welcome to bitcointalk platform. I see you offer two Services on one thread and you already have an announcement thread for your services. Why not take this post to your announcement thread to continue with instead of creating another thread as you stand a risk of being flagged as a spammer if a moderator should look into it possibly a more bigger offense here. Why not save yourself the stress of having issues at this early stages with forum policies and guidelines. Do the needful and oblige to the forum policies to avoid having issues here which might affect you and your casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "May 11, 2023, 03:58:10 PM",
      "body": "Hello and welcome to the Bitcointalk forum! Hopefully you can achieve being the first real decentralized sports betting service. Although I am not sure how you will go about doing it.Do you have a whitepaper or something which explains the technical parts a bit more in detail? As I understand it, current betting services which claim to be \"decentralized\" are actually pseudo-centralized in nature and there are still centralized entities that can withhold or block winnings or funds in one way or another. The reason being that mostly regulation laws but also the fact that gambling is too complex to fully decentralize as a web3 service. How are you planning to move around this problem?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "May 12, 2023, 03:49:43 AM",
      "body": "There are Web3 casinos and if they can build it for slot games, gambling, they can do it for sports betting.So far I have yet seen good adoption for Web3-betting even technically it is possible to build such platform. If they can use Web3 for GameFi, NFT, Metaverse, slot games, they can deploy it for sports and virtual sports.The challenge is how they will deal with cheaters, abusers for bonus, promtion and arbitraging sports betting. It is big challenge as with sports betting, arbitraging betting is a most common compromising type that causes many scam accusations against casino. Those accusations can be invalid but dealing with them will cost resources.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "May 12, 2023, 04:12:28 AM",
      "body": "Is it just me that has no images loaded? Anyway,  I'd probably appreciate this more if there was a more in-depth explanation of what the site does? Since there's a lot of so called \"DEX\" platforms that never really pushed through afaik. Plus, a test site as well or something similar.It's also a wonder how you're going to circumvent the laws since creating a DEX casino would mean completely removing your site from said laws I reckon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ubetsports01",
      "created_time": "May 15, 2023, 08:54:12 PM",
      "body": "Quote from: goldkingcoiner on May 11, 2023, 03:58:10 PMHello and welcome to the Bitcointalk forum! Hopefully you can achieve being the first real decentralized sports betting service. Although I am not sure how you will go about doing it.Do you have a whitepaper or something which explains the technical parts a bit more in detail? As I understand it, current betting services which claim to be \"decentralized\" are actually pseudo-centralized in nature and there are still centralized entities that can withhold or block winnings or funds in one way or another. The reason being that mostly regulation laws but also the fact that gambling is too complex to fully decentralize as a web3 service. How are you planning to move around this problem?Thank you for your warm welcome! Here is where we started our whitepaper: https://ubet-sports.gitbook.io/about-ubet/get-started/get-startedBut more details are coming in the next two months.We also talk about what ideal decentralized sports betting looks like: https://medium.com/p/2dc990332cb7Also, how basic AMM works and why Uniswap has a big limitation: https://medium.com/p/af5205dd8815We will discuss more details on how our AMM works and why it is suitable for sports betting, options, derivatives, and other financial instruments that are beyond the spot market!This is a very good question! “centralize entities that can withhold or block winnings or funding in one way or another.There are two parts to it!Settlements happen in smart contracts, where the smart contracts have the terms that if your bet is correct, you will receive the rewards directly in your wallet. More formally, our platform uses \"conditional tokens\" that users get when they place a bet. The way conditional tokens are minted, there is always enough money in the system to pay out everyone's bets, no matter the outcome. The \"losing side\" of each bet could be held by other bettors or liquidity providers. An approved \"oracle\" writes the result for the conditional token and users can redeem the winning token for money. The users own the conditional token and there is no middleman to hold back payouts at this stage. Once an outcome is decided, redemption for money is entirely driven by the user.The second part is who decides the winning outcome - who is this \"oracle\". In a fully decentralized system, this would be a some aggregated result over a few data providers - so there is no central authority that can impose the wrong result and reap the benefits. At the start UBET will aggregate the results of a few providers off-chain and write the results to blockchain as the oracle. This will be centralized with a plan to eventually decentralize this with incentives for data providers.We recently wrote about where UBET stands about decentralization andwhat is on our todo list. Please take a look and see if this clarifies your Concerns:   https://medium.com/ubet-sports/tiers-of-decentralization-where-does-ubet-sports-stand-9c87e30a3182Quote from: dzungmobile on May 12, 2023, 03:49:43 AMThere are Web3 casinos and if they can build it for slot games, gambling, they can do it for sports betting.So far I have yet seen good adoption for Web3-betting even technically it is possible to build such platform. If they can use Web3 for GameFi, NFT, Metaverse, slot games, they can deploy it for sports and virtual sports.The challenge is how they will deal with cheaters, abusers for bonus, promtion and arbitraging sports betting. It is big challenge as with sports betting, arbitraging betting is a most common compromising type that causes many scam accusations against casino. Those accusations can be invalid but dealing with them will cost resources.I agree with your comments, especially for virtual sports. It is very worrisome that we can reverse engineer the score function for virtual sports, and cheat. Indeed, this may be possible using machine learning algorithms. So we are not big advocates of virtual sports.Another concern you have regarding cheaters for a bonus makes sense. Sybil attacks are a serious issue in the blockchain industry, where it takes no effort to make multiple wallets to abuse the bonuses. We would like to add product values that go beyond bonuses. Indeed, the survey among our community shows that everyone cares more about trust, security, and odds than bonuses. This is because bonuses are hard to get due to difficult conditions that you have to satisfy. Therefore, we are really pushing for trust, security, and better odds.Please let me know if this answers some of your questions, and please ask for more. Thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ubetsports01",
      "created_time": "May 17, 2023, 08:50:46 PMLast edit: May 17, 2023, 09:13:17 PM by Ubetsports01",
      "body": "Tiers of Decentralization: Where does UBET Sports stand?We often hear about the buzzword \"decentralization,\" especially from crypto and blockchain projects. Indeed, a “decentralized project” or “dApp” transforms into a “web3 project” at some point, and as I recall, it might have been the time when NFTs were popular. I wonder whether this was because NFT projects were less decentralized and weighed more towards exclusivity and community.This thread moved to the following Ann thread : https://bitcointalk.org/index.php?topic=5450576.msg62231631#msg62231631",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}