{
  "id": "topic_5411685",
  "title": "voodox",
  "author": "voodox",
  "created_time": "August 30, 2022, 08:07:49 AMLast edit: December 05, 2023, 07:35:42 PM by voodox",
  "content": "أهلاً بكم!سأشارك مجموعة BTC OTC مغلقة ، على أمل توسيع دائرة المستخدمين وبالتالي العثور على مشتري / بائع للتبادل الخاص بك.يقع الجزء الرئيسي من مستخدمي هذه المجموعة في ألمانيا وسويسرا والنمسا.إذا كنت تشتري / تبيع العملات المشفرة في أوروبا نقدًا ، فنحن نرحب بك.https://t.me/FiatToBTC",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411685",
  "comments": [
    {
      "author": "Kavelj22",
      "created_time": "September 03, 2022, 08:02:26 PM",
      "body": "Quote from: voodox on August 30, 2022, 08:07:49 AMيقع الجزء الرئيسي من مستخدمي هذه المجموعة في ألمانيا وسويسرا والنمسا.إذا كنت تشتري / تبيع العملات المشفرة في أوروبا نقدًا ، فنحن نرحب بك.https://t.me/+fo8KPDT7eAw5NzEyقناة التلغرام لا تحوي سوى 129 عضوا. هل يحصل التبادل فيما بين هذا العدد الصغير فقط؟ ثم ان القناة تتحدث بلغة مجهولة (النمساوية ربما او السوسرية) لقد ظننت ان اعضاءها عرب. ان لم يكونوا كذلك فما الذي دفعك الى النشر في القسم العربي. لقد زرت القناة و حاولت فهم ما يحصل هناك، يبدو ان هناك نشاط يومي بها لكن لا استطيع التأكد من صحة شيء.المستخدمون في تلك الدول لديهم خيارات عديدة للتحويل من و الى العملات المشفرة. التحويل باستخدام النقد الكاش لا يعتبر وسيلة امنة الا بالنسبة للمبالغ الصغيرة. لقد شاهدت ارقاما كبيرة في المحادثة على القناة من قبيل 18k، هل هناك فعلا من يستطيع تحويل هذا المبالغ بالكريبتو في دول مثل سويسرا او المانيا؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "voodox",
      "created_time": "December 05, 2023, 07:36:04 PM",
      "body": "تمت إعادة تسمية المجموعة إلى https://t.me/FiatToBTCلقد قمت بتحرير هذا في المنشور أعلاه.لا يمكن الدخول إلى المجموعة إلا بعد إجراء مكالمة فيديو مع المسؤولين. يريد المسؤولون رؤية وجهك لفترة وجيزة فقط، لا أكثر. مرشح صغير للتخلص من المحتالين. حتى الآن لم يكن لدي سوى تجارب إيجابية في المجموعة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rifmax",
      "created_time": "January 01, 2024, 03:25:01 AM",
      "body": "Quote from: voodox on December 05, 2023, 07:36:04 PMتمت إعادة تسمية المجموعة إلى https://t.me/FiatToBTCلقد قمت بتحرير هذا في المنشور أعلاه.لا يمكن الدخول إلى المجموعة إلا بعد إجراء مكالمة فيديو مع المسؤولين. يريد المسؤولون رؤية وجهك لفترة وجيزة فقط، لا أكثر. مرشح صغير للتخلص من المحتالين. حتى الآن لم يكن لدي سوى تجارب إيجابية في المجموعة.هل تعتقد أن إجراء مكالمة فيديو لا يشكل أي خطر مثلا سرقة بصمة الوجه يجب عليك أن تعرف  أنك في المكان الصح قبل أن تكون ضحية و خسارة المال بسهولة. كما أشار العضو فوق منشورك بأن هناك طرق أخرى أفضل بكثير مما قلته بخصوص التحويل من الكاش إلى كريبتو أو العكس. ما قولك حول هذا.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "January 04, 2024, 11:17:21 PM",
      "body": "اتفق مع ما ذكر في التعليق في الأعلى. لا أعتقد أن التحقق من هوية المشاركين في القناة من خلال محادثة فيديو امر جيد او حتى فعال.لا أعرف كيف سيساهم ذلك من الحد من عمليات التحيل. هناك طرق أخرى افضل و انجع من ذلك و الأهم انها تحافظ على خصوصية المستخدمين. افضل و ابسط طريقة برأيي هي القيام بعمليات التبادل عن طريق وسيط او وسطاء موثوقين. بهذا الشكل يضمن كل طرف ان لا يتم خداعه و يحافظ في نفس الوقت على خصوصيته.من الجيد أن نرى ان القناة لازالت نشطة إلى الآن بعد الاعلان عنها هنا منذ أكثر من سنة!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}