{
  "id": "topic_5447777",
  "title": "coinremitter",
  "author": "coinremitter",
  "created_time": "April 06, 2023, 09:17:24 AM",
  "content": "We all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447777",
  "comments": [
    {
      "author": "HedgeFx",
      "created_time": "April 06, 2023, 09:43:34 AM",
      "body": "Ok, I have to admit that bitcoin is my first love, but in terms of speed for my transaction I prefer litecoin also because it still has a certain liquidity, it is accepted where bitcoins are accepted and has very low fees..It would be nice to have Bitcoin LN available for larger amounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 06, 2023, 09:58:14 AM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWhat you think about other cryptocurrencies?Other cryptocurrencies are centralized, and they cannot be compared to Bitcoin. Should there be some challenges with the project CEO or the project itself, the altcoins will suffer a serious downturn or may just crash. Other crypto currencies are just shitcoins, and most people will not realize it until they have reason to do so. Example: With Ethereum, there was a time around 2021 to 2022 when Ethereum's gas fee shot up like crazy, and then a lot of altcoins lounched their projects under BSC and some under Polygon only a few projects with Ethereum. It took a very long time before the Ethereum project could fix that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "April 06, 2023, 10:14:42 AM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?Didn't this post already exist and my feelings have already been answered and a post is missing. It turns out that this topic with the same title has been deleted by OP, then OP has created a new one.Yes. The answer remains the same, Bitcoin is the first choice because Bitcoin has advantages and disadvantages among crypto in general.There are quite a number of other cryptos in circulation, Ethereum and Binance Coins can be considered even though the ultimate goal of every investment will be Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "April 06, 2023, 10:19:44 AM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?Majority will surely point bitcoin as their favorite since this is the top coin where we can trade it anywhere we want. Maybe the right question to drop on this is what is your second best crypto aside from bitcoin since for sure you can get a lot of answer with good explanation coming from many people on this forum.  Two of my favorites for now is Xrp is for cheap fee's and fast also BNB for its utility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "April 06, 2023, 02:11:08 PM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?Other Cryptocurrencies are altcoins which means alternative altcoins and they will remain alternative coins something we add to our portfolio for additional profit but when it comes to usage and massive adoption they all fall short of what Bitcoin can give, so they will remain alternate coins that we can hold and dump anytime and move to the next altcoin with good potential.It's preferable to hold only Bitcoin than 20 altcoins because anytime altcoins will lose their value because of the decentralization feature something we are not comfortable with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 06, 2023, 02:35:31 PM",
      "body": "My preference of Bitcoin is purely because of its decentralization, Altcoins are easily manipulated while it takes multiple nodes to varify a transaction. Bitcoin is also the most widely use payment gate currently due to its ease of use, fast transaction and global acceptance, it can easily be used as an investment tool because of its store of value.The most important thing that makes Bitcoin to edge over other alternative cryptocurrency is the limited value (21 million total supply) this makes it a great store of value like other assets like gold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaterialMouse69",
      "created_time": "April 08, 2023, 02:42:48 PM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?To be honest, before I enter to cryptocurrency my first ideal cryptocurrency is bitcoin because my friend says that this bitcoin is called \"digital gold\" so I'm amazed and I start learning about crypto trading and how they work. Some cryptocurrency is called altcoins \"alternative digital currency to bitcoin\" like ETHEREUM, SOLANA, SOLANA ETC. My favourite in altcoins is ETH(Ethereum) because you don't have to pay high transaction fees, and it has no centralized authority that can manage how this \"digital gold\" works. Ethereum has a lot of platforms, it enables peer-to-peer transaction and also its a long term like bitcoin. Other cryptocurrencies is connected to bitcoin so if ever bitcoins drop, the whole market will be drop also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "April 08, 2023, 03:52:30 PM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMEveryone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer. What does immediate settlement mean to you? is it when someone sends you bitcoin or you send it to another person and the balance changes immediately? Is that immediate settlement? Or are you talking about exchanges to fiat, where a payment processor converts a received amount according to current market rates? If it is, how is it different from other cryptocurrencies? Bitcoin has an average block time of 10 mins, so the balance update you see immediately isn't confirmed yet in the blockchain. The generally accepted transaction finality is 6 blocks. You mentioned international transactions. I haven't experimented with too many altcoins, but those I did try don't have issues with international transactions either. Crypto, not just bitcoin, doesn't know and need geographical restrictions. It's the same thing with direct transfers. They all move from Wallet A to wallet B if you want them to.  Quote from: Dr.Bitcoin_Strange on April 06, 2023, 09:58:14 AMWith Ethereum, there was a time around 2021 to 2022 when Ethereum's gas fee shot up like crazy Bitcoin's mining fees have gone up significantly following the introduction of Ordinals. But that doesn't change the quality of what Bitcoin is. Ethereum's problems lie elsewhere. For example, centralization and the fact that transactions can be reversed if Vitalik and the Ethereum Foundation believe it's in their best interest to do that. Quote from: Saisher on April 06, 2023, 02:11:08 PMOther Cryptocurrencies are altcoins which means alternative altcoins 'Altcoin' is already a compound word made up of the words 'alternative' and 'coin'. Because of that, we don't say that an altcoin is an 'alternative altcoin'. 'Altcoin' is self-explanatory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "April 08, 2023, 03:57:29 PM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?All the feature that you mention is the general characteristics of cryptocurrency aside from greater liquidity which Bitcoin is currently the best. I believe most of the user here was Bitcoin is their favorite coin because this is the only crypto that offers real decentralized blockchain among all the existing blockchain out there. A few side chain is now my additional investment because I believe that scalability is the most common issue of Blockchain and side chain will be in demand when we are already populated due to mass adoption. Polygon Matic and Optimism are the tokens that is next to Bitcoin on my crypto basket.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 10, 2023, 12:22:06 AM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?Of course! My best cryptocurrency is the king of all cryptocurrencies - Bitcoin. No other coin can ever dethrone Bitcoin from its position because it is the most widely accepted coin. It is completely  decentralized, and no other cryptocurrency can compete with it in that regard.It is a game-changer that influences the whole crypto market. As a trader, I favor Bitcoin the most because its movement determines the market's condition. When it goes up, the entire market follows it and when it goes down the whole market falls with it.Bitcoin is the only cryptocurrency that is adopted by millions of users. I know that its transaction fees are little higher than others, but its transactions are fast and highly secure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "octobuzz",
      "created_time": "April 10, 2023, 01:27:26 AM",
      "body": "Bitcoin in my opinion is the ideal cryptocurrency to invest and trade in. I mean, it's the first and the largest crypto for many reasons but I choose it mainly because of it's versatile usability and acceptance. The liquidity is also great compared to some other cryptocurrency. Asides Bitcoin, Ethereum and BNB would be great crypto choices to trade with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "April 10, 2023, 04:55:53 AM",
      "body": "Quote from: HedgeFx on April 06, 2023, 09:43:34 AMOk, I have to admit that Bitcoin is my first love, but in terms of speed for my transaction I prefer litecoin also because it still has certain liquidity, it is accepted where bitcoins are accepted, and has very low fees.It would be nice to have Bitcoin LN available for larger amounts.Both Bitcoin and Litecoin have slower transaction speeds, there are more than dozens of new projects that have faster transaction speeds, this is the only thing I don't like about Bitcoin, I have to wait for minutes before the other Bitcoin wallet receives my payment, imagine if I am using Bitcoin to pay in a store and if a transaction is not confirmed it can bounce back, but we have lightening too.The slow transaction speed of Bitcoin is not enough to say that an alternative cryptocurrency can defeat Bitcoin, the benefit of Bitcoin as a real decentralized digital asset is what makes Bitcoin special and so far no other has been this reliable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "April 10, 2023, 05:08:56 AM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?For sure majority here goes into crypto because of bitcoin so yeah, same case with me, I' also into BTC.But if there is one altcoin for me, it will be Ethereum, of course it is also a prime mover as far as that market goes. I used LTC as well, not just a investment, but during the height of my gambling addiction because it's fast to deposit and withdraw. Same with XRP years ago, it was also very quick. And maybe this is one drawback of bitcoin though, it's speed and confirmation but nevertheless, there are alternatives to us. However, bitcoin will remain dominant in the market and I doubt that there will be new crypto that will come close to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "April 10, 2023, 06:31:17 AM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?Bitcoin is the first priority for me and i love it. Bitcoin can never be compared to any other crypto coin.  Because Bitcoin is fully decentralized and is the first crypto coin that works for a peer-to-peer cash system.  And it is the most popular and Bitcoin has a bright future. And other good coins include Ethereum, BNB can't be fully trusted because they are centralized coins so they won't be crashed at some stage like LUNA, FTX there is no guarantee. But there is no such fear for Bitcoin.  Because no one controls it and no one can release its total supply in the market at once.  As the core team of other coins can do if they want. So there is no fear of Bitcoin suddenly becoming crash. that's why Bitcoin is my first priority and i mean Bitcoin should be everyone's first choice",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "April 10, 2023, 07:45:05 AM",
      "body": "If we speak of an ideal cryptocurrency, I guess there is none, or perhaps current ones are yet to develop into our ideal cryptocurrency. The best among the existing ones, of course, is Bitcoin. But even Bitcoin is far from ideal. With Bitcoin, affordable and instant transactions, for example, can only happen off-chain. In which case, Dogecoin is more convenient to use than Bitcoin especially involving small amounts. Or Monero and ZCash are better than Bitcoin in terms of privacy. So I guess an ideal cryptocurrency is the combination of all the best features of all cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "April 10, 2023, 07:56:26 AM",
      "body": "Quote from: Taskford on April 06, 2023, 10:19:44 AMQuote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?Majority will surely point bitcoin as their favorite since this is the top coin where we can trade it anywhere we want. Maybe the right question to drop on this is what is your second best crypto aside from bitcoin since for sure you can get a lot of answer with good explanation coming from many people on this forum.  Two of my favorites for now is Xrp is for cheap fee's and fast also BNB for its utility.There is no doubt that bitcoin is definitely the best option but will also be my only choice. I mean it is an option for long term investment, use as an asset, currency... it is the only cryptocurrency that I trust to serve my daily needs. As for altcoins, I only use them for the sole purpose of speculation, I don't believe there are any altcoins that can compare and keep up with bitcoin. Since they are all created for the purpose of selling tokens, at some point they will disappear. Altcoins should only be used for speculation and nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Seinlocko",
      "created_time": "April 10, 2023, 07:59:11 AM",
      "body": "Quote from: coinremitter on April 06, 2023, 09:17:24 AMWe all know about cryptocurrencies and how they work. Everyone has their favorite crypto like I preferred bitcoin because there are lots of benefits of bitcoin, immediate settlement, greater liquidity, international transactions, security and direct transfer.What you think about other cryptocurrencies?I'm still new, so I don't know much about cryptocurrencies other than bitcoin, I haven't dared to start investing in other cryptos, so I'm going to really learn it from the basics first, so it's safer and more focused.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "April 10, 2023, 08:18:06 AM",
      "body": "If a poll is made, most of the users who join this forum choose Bitcoin as their favorite Cryptocurrency. Some others still try to gamble on Altcoins and even they put their money on Shitcoins which are still gray, this kind of gambling always offers big risk and big profit. For Newbies who want to find a safe point in investing Cryptocurrency, Bitcoin is the most appropriate choice. Apart from that, you need to look at several other assets that have strong fundamentals or the top coins on CMC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 10, 2023, 08:46:37 AM",
      "body": "An ideal cryptocurrency for me is obviously bitcoin but I did searched other altcoins to see other utility of it. If you are someone whose focus is on expanding your finance then there are other coins that make you earn from it over staking which is quite impressive on altcoins. Cause bitcoin cant do that due to its structure. Most probably if therr is really a pure decentralized altcoin that will be created that would really be an amazing one combining most L1 features.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}