{
  "id": "topic_5408650",
  "title": "ncentrepreneur.investor",
  "author": "ncentrepreneur.investor",
  "created_time": "August 04, 2022, 03:15:45 AM",
  "content": "You will see why I said not financial advice in a moment. This is a \"what would you do question.\" I have been a several year bitcoin purchaser, but I have a sister that I gently tried to orange peel in the past. She was interested and amazed at BTC, but feels that she cant afford to put even $5 a week aside. I had an extra hardware wallet and put $100 worth of BTC on the wallet and considered it hers. I have this idea planted in my head to gift her .01 BTC which makes her a satoshi millionaire and then leave the rest to her to add to it if she wants to. lol. She is a single mom with 2 children and a live in boyfriend. On one hand, my thinking is that if I gave her all of the necessary materials to get to know bitcoin (I have) and we talked about it and she cant even put $5 a week aside for herself, why should I? Most that think they cant save that much really can if they try. Somewhere along a 7 day period, $5 get wasted on SOMETHING. I am definitely not hurting ($). On the other hand, I dont want the next bitcoin decade to go by and she gets left out or if she does start to buy, her little dollars dont get her as much BTC. Either way as a side note, I would be keeping custody of the hardware wallet and giving it to her after years of appreciation and BTC education. If it was your sister would you buy it now and gift it down the road out of love or would you take the hard stance? I could buy it now when its low and she only needs .008 more. Ive been on the fence about this for awhile. Just looking for opinions guys/gals. Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408650",
  "comments": [
    {
      "author": "un_rank",
      "created_time": "August 04, 2022, 10:21:15 AM",
      "body": "Being fascinated and interested in something, might not be enough motivation to go for it. I have a relative similar to yours who I have been talking to about bitcoin for a month now, he like yours, is interested in it, but not enough to want to own it. Too much risk, fiat does the job, what if i lose it etc are the common excuses I get. I have decided to let everyone come around on their accord, I will try to educate them as much as i learn, but it is their decision to make.I have not considered buying him any bitcoins, and I can not call it a bad idea. Worst case scenario, the price would drop and your sister calls it a sham. Best case, they see the potential that it has to grow and want to know more. Or she could just sell it immediately to get $100.Gifting her down the road is a good idea too, but I wish she does not get too fixated on the price.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "August 04, 2022, 10:41:13 AM",
      "body": "Quote from: ncentrepreneur.investor on August 04, 2022, 03:15:45 AMShe was interested and amazed at BTC, but feels that she cant afford to put even $5 a week aside. First I don't really know how much her income and how much her household expenses, but if she can't afford to put $5 a week, that's seems she didn't have good money management or plan to invest. But I know it's costly to grow her two children, especially when it's still toddler that need to buy toys and other stuffs to make them happy.I think it's not correct to give her a hardware wallet and put $100 in Bitcoin, I'm more expecting she should buy her first Bitcoin and how she manage her emotion on bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 04, 2022, 11:00:16 AM",
      "body": "she has kids. the hard stance would be to not gift her the coins in a few years but to give it to her kids as a highschool graduation gift when they reach age, so that they can self fund college without having to take (any/some/large) loan outthat way she cant go spending and wasting your efforts on the lifestyle things she seems attached to. but also it helps her kids aspire to be better people and indirectly still helps her by her not having to be guarantor on a loan for her kids educationthe soft stance is the hope to try to convince her to buy coin. . but. be careful. if she starts buying in when the next speculative bubble round begins (the silly/stupid/naive 'buy high sell on crash' FOMO trend) she would blame you for the loss. even if you were trying hard to get her to buy while it was cheap(right now)thats the issue with introducing relatives to bitcoin. they see you as the contact point of 'bitcoin'. where they ignore you at good times and point fingers at you at bad times",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 04, 2022, 11:56:45 AM",
      "body": "Quote from: ncentrepreneur.investor on August 04, 2022, 03:15:45 AMIf it was your sister would you buy it now and gift it down the road out of love or would you take the hard stance?It depends greatly on the relation with the sister. Even more, that relation can change over time. So I will not give a direct answer.However, as stated, she has kids, she is clearly not doing great, and you know that the main rule is to invest only you afford to lose.I will add that even if you award her bitcoin and you teach her everything, she may try to sell when she gets into deeper hardship or she sees the price falling and gets scared.Maybe you make a plan and give her the access to those bitcoins when the kids get to a certain age when she needs/they need more money for their education. So you'll make a present not for her, but for your nephews. It can sort out your dilemma.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "August 04, 2022, 12:05:39 PM",
      "body": "Its interesting how she has not earned any interest in the bitcoin yet after you have given her so much. May be you should talk to her one to one regarding this whether she is really interested in bitcoin or not? It could happen that she might be just keeping your excitement in the crypto space by agreeing to all the yes’s of yours. Sometimes that happens in the good relationship. She might be a keeper for you mate. There is no harm if she doesn’t want to save money at all if she is spending it on the wanted stuff. All she might be thinking about is her child and boyfriend so that she can get on to track one more time.  So advice is to talk through this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "August 04, 2022, 12:09:29 PM",
      "body": "Honestly, I'm not sure if he could manage to hold and risk more. It was to think that investing in Bitcoin is good advice but for some reason, this isn't suitable for everyone. Imagine that your sister is even hard to keep $5 a week, I could assume that after you give some sats to her, she gonna sell them all. Let us accept that investing in Bitcoin isn't for everyone, neither urge your sister, your brother, or any of your family members, we also have to consider their capacity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 04, 2022, 12:11:21 PM",
      "body": "It seems to me that your sister would benefit from financial help now in the form of $, judging by the fact that even $5 is a problem for her on a weekly basis. To me, that would seem more logical than persuading someone to invest in something they clearly do not understand and show no interest in.If one day you want to give your sister a certain amount of Bitcoin and if it is not a problem for you, I don't see why you are in such a doubt - you can simply do it, or decide not to do it. My opinion is that it is completely wrong to convince someone to invest in anything risky, and Bitcoin is definitely in that category.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ncentrepreneur.investor",
      "created_time": "August 04, 2022, 12:59:07 PM",
      "body": "Quote from: Lucius on August 04, 2022, 12:11:21 PMIt seems to me that your sister would benefit from financial help now in the form of $, judging by the fact that even $5 is a problem for her on a weekly basis. To me, that would seem more logical than persuading someone to invest in something they clearly do not understand and show no interest in.If one day you want to give your sister a certain amount of Bitcoin and if it is not a problem for you, I don't see why you are in such a doubt - you can simply do it, or decide not to do it. My opinion is that it is completely wrong to convince someone to invest in anything risky, and Bitcoin is definitely in that category.The thing is is that she is not poor, but broke. She can afford to put something small aside. I only know this because she has saved several hundred in cash before. But overall is financially undisciplined IMO. But she does not make enough to never need help from me. She works as a Jr. software coder and understands Bitcoin to a point. I don’t think she her lightbulb went off about how it’s price is irrelevant and deep down what it is. I may just set it aside for her or her children and give it to them in 20years and then turn my head so I can’t see what they do with it (after I give them more education). I don’t know how much 1 million satoshis will be worth in 20 years but…….",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 04, 2022, 01:05:38 PM",
      "body": "You have money, but your sister does not. Your phrase \"why should I\" speaks volumes. Why are you posting here? What would you like? For us to tell you that you are such a nice, cool dude?Just help your sister; it's scary when people save five bucks. Give her a gift, tell her about bitcoins, and don't think about why you should. If such questions arise, then do nothing; let everything be OK with you because you don’t owe anything to anyone, right?You know, there is such a sign-when you give, you receive. Today you help your nephews, and tomorrow someone will help you. The rule is working.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "August 04, 2022, 01:37:51 PM",
      "body": "Seeking for bitcoin advice it's very important for someone who want to learn when is the proper time to invest in cryptocurrency or to purchase Bitcoin. The best time to buy cryptocurrency especially directly to Bitcoin is when the price of Bitcoin is low and when you buy you will hold for some years or long-term investment so that you can make a connection. And doing so, it's good to someone that have money. Because if you lack money everything possibly how to make your investments target not achieve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ncentrepreneur.investor",
      "created_time": "August 04, 2022, 02:08:36 PM",
      "body": "Quote from: lovesmayfamilis on August 04, 2022, 01:05:38 PMYou have money, but your sister does not. Your phrase \"why should I\" speaks volumes. Why are you posting here? What would you like? For us to tell you that you are such a nice, cool dude?Just help your sister; it's scary when people save five bucks. Give her a gift, tell her about bitcoins, and don't think about why you should. If such questions arise, then do nothing; let everything be OK with you because you don’t owe anything to anyone, right?You know, there is such a sign-when you give, you receive. Today you help your nephews, and tomorrow someone will help you. The rule is working.Even though I love this post and you are right. There is also the saying, “help those that help themselves” What I meant when I said that is if someone is not going to put in the effort to learn, understand, and then “do” then why should I do it for them. Why is it scary when you save $5? You put aside what you can. And I know she can. Just doesn’t. $5 was just a low example. I have helped her on many occasions when she first moved here, before the good job and before the boyfriend. And I did it because I love her and wanted her to make it. And now that she has the means, even if not a lot, I feel she can invest in herself for the long run. That’s all I’m sayin. I’m not special or better than her, don’t misunderstand. With all that said, you still have an excellent point. That makes me think about the bitcoiners who blessed others with sats and taught us. In the name of freedom, I should do the same. (First paragraph, last sentence kinda hit home for me. Thanks)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "August 04, 2022, 02:48:46 PM",
      "body": "Quote from: ncentrepreneur.investor on August 04, 2022, 03:15:45 AMYou will see why I said not financial advice in a moment. This is a \"what would you do question.\" I have been a several year bitcoin purchaser, but I have a sister that I gently tried to orange peel in the past. She was interested and amazed at BTC, but feels that she cant afford to put even $5 a week aside. I had an extra hardware wallet and put $100 worth of BTC on the wallet and considered it hers. I have this idea planted in my head to gift her .01 BTC which makes her a satoshi millionaire and then leave the rest to her to add to it if she wants to. lol. She is a single mom with 2 children and a live in boyfriend. Don't force people to buy bitcoin, she understands what bitcoin is all about but she is afraid, if she doesn't feel comfortable living her $5 in bitcoin, you shouldn't go to any length to make her do it by force. The fact that she is a single mother and not financially stable and lives with her boyfriend doesn't mean bitcoin will elevate her from that position either.If you genuinely want to gift her a bitcoin, then do it for the purpose you have intended, gifts are surprises. I'm sure that she will be stunned when you handed her that hardware wallet that contains bitcoin, who knows this will give her more encouragement to start buying and add more sats to the one you wanted to gift her. Try it, it might be worth all your effort trying to convince her.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ncentrepreneur.investor",
      "created_time": "August 04, 2022, 02:54:00 PM",
      "body": "Quote from: Cookdata on August 04, 2022, 02:48:46 PMQuote from: ncentrepreneur.investor on August 04, 2022, 03:15:45 AMYou will see why I said not financial advice in a moment. This is a \"what would you do question.\" I have been a several year bitcoin purchaser, but I have a sister that I gently tried to orange peel in the past. She was interested and amazed at BTC, but feels that she cant afford to put even $5 a week aside. I had an extra hardware wallet and put $100 worth of BTC on the wallet and considered it hers. I have this idea planted in my head to gift her .01 BTC which makes her a satoshi millionaire and then leave the rest to her to add to it if she wants to. lol. She is a single mom with 2 children and a live in boyfriend. Don't force people to buy bitcoin, she understands what bitcoin is all about but she is afraid, if she doesn't feel comfortable living her $5 in bitcoin, you shouldn't go to any length to make her do it by force. The fact that she is a single mother and not financially stable and lives with her boyfriend doesn't mean bitcoin will elevate her from that position either.If you genuinely want to gift her a bitcoin, then do it for the purpose you have intended, gifts are surprises. I'm sure that she will be stunned when you handed her that hardware wallet that contains bitcoin, who knows this will give her more encouragement to start buying and add more sats to the one you wanted to gift her. Try it, it might be worth all your effort trying to convince her.😀. Will do. Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 05, 2022, 09:12:32 AM",
      "body": "Quote from: ncentrepreneur.investor on August 04, 2022, 12:59:07 PMI don’t know how much 1 million satoshis will be worth in 20 years but……. Today it is worth a little more than $200, in 20 years it may be worth 20 times more, or even 40 times more, but what will you be able to buy for $4000 or $8000 in 20 years, given that money loses value? I think that the amount in BTC you are talking about is something that for me personally would not create any problem in my life in the sense that I would ask myself whether I should do it or not - but on the other hand, I long ago gave up on convincing others that Bitcoin is good or bad - it should be a matter of personal choice.Maybe your sister understands Bitcoin, maybe she has money to invest in it, but she simply doesn't want to - like 95% of people in the world who didn't do it for these or similar reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "August 06, 2022, 11:24:50 AM",
      "body": "Quote from: ncentrepreneur.investor on August 04, 2022, 03:15:45 AMShe is a single mom with 2 children Single moms may not have much time or energy to devote to crypto. But her two kids might.  There are blockchain based games similar to pokemon go like coinhuntworld that kids can play to collect crypto prizes.https://coinhunt.world/My 8 year old nephew somehow knew what dogecoin was, even though I never told him about it. Crypto has become enough of an internet meme that kids apparently learn about it simply by browsing the internet.There must be other games and fun activities kids can do to earn crypto on the internet. Imagine being a kid. Playing games to earn crypto. Which can be exchanged for cool stuff. It can't be that bad of a thing, I would guess.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "August 06, 2022, 05:43:15 PM",
      "body": "I think this story lacks some context. Firstly, financial context. Are you significantly more well-off than your sister, especially considering that she has to provide for 2 children? If you are (and from other posts it looks like you are), then I think you should buy up and gift the .01 BTC to her on a special occasion (birthday?) or when you can see she's in a hard place and needs a win. If you aren't and she can't set money aside on Bitcoin because she doesn't believe in Bitcoin anymore, then I don't think it matters much, and you can just give her the current hardware wallet. Also, I don't like the whole \"I would be keeping custody\" thing and giving it years later. It's very patronizing, and also anti-Bitcoin because one should always store one's own keys and rely on nobody else. I'd be mad if someone told me that someone has money for me but would keep control of it and not let me get it for years to come. If she doesn't know and it's a secret, then it's a different story and hodling it for now, so that you can give her much more later when the value grows makes sense.In any case, you shouldn't push anyone to investing money. Like others pointed out, if she has two kids and can't afford to save up to invest in BTC, she's doing the right and responsible thing by not investing what she can't afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "August 06, 2022, 06:38:16 PM",
      "body": "My opinion here is for you to do what you feel like doing rather than thinking if she would be able to add more funds on the Bitcoin account or wallet. Even though she can't add more funds to the wallet it will be better for her to know that she owns a Bitcoin than thinking of not doing that for her. The $100 worth of Bitcoin could go a long way for her if the market commence the bull movement. I think you just need to do it for her and allow her to leave the fund there for a long time so the money can grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "August 06, 2022, 06:55:09 PM",
      "body": "In my opinion you should give her he hardware wallet instantly and teach her ho to use it. The teaching can be done in one day, and then she can decide if she spends the bitcoin (unlikely from what you say) or even put more in there. If you keep the wallet for her, that would be enough of an issue for me that I would not save more bitcoin. Because as it was said million times, not your keys, not your coins. And relations change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "August 06, 2022, 07:29:11 PM",
      "body": "Actually buying bitcoin will be the good and best option for your future.We know the price of bitcoin will change at every half.So as you said,keep buy of bitcoin with 5$ each week.When the year completed,you will save 260$.And if you save 100$ a month,you will have 1200$ in a year.In both manner,you will had good amount of money in terms of bitcoin.As the new halves came,you will double the dollars from the holding bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}