{
  "id": "topic_5426814",
  "title": "ecdsa123",
  "author": "ecdsa123",
  "created_time": "December 08, 2022, 08:20:49 AMLast edit: August 31, 2024, 02:51:47 PM by ecdsa123",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426814",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "December 08, 2022, 08:35:56 AM",
      "body": "Quote from: ecdsa123 on December 08, 2022, 08:20:49 AMso : someone has cracked it :Question 1: How and why it has been happen?This is a very old puzzle where someone created a brainwallet using the phrase \"bitcoin is awesome\" and the private key of this address has been known for the past 10 years. If by \"cracked it\" you mean solved the brainwallet puzzle, then yes. As for the Question, in later years others may have tried to have some fun with the existing puzzle by sending coins there and/or spend the coins in this known address with weird nonce values.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 08, 2022, 10:32:01 AM",
      "body": "Quote from: ecdsa123 on December 08, 2022, 08:38:49 AMyes, but I'm asking about not private key, but nonce used in transaction.this is weird.that nonce k is the same as message hash in first 16 bytesIt could be a lot of things, as I said it could be someone just having fun trolling others watching this puzzle key or it could be a broken code that someone was testing using this key maybe someone watching the key to steal the coins sent to it.When generating k deterministically using RFC6979 you use the message digest (z) too. A broken implementation could have messed up and after computing the final HMAC copied the result in the second half of an output that had the original digest in its first half.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 08, 2022, 12:34:13 PM",
      "body": "The only way to check it is to find out who sent these and ask them how or why they did it like that. Everything else is just guesswork.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 08, 2022, 05:57:42 PM",
      "body": "Quote from: ecdsa123 on December 08, 2022, 12:16:52 PMis any way for check that:\"When generating k deterministically using RFC6979 you use the message digest (z) too. A broken implementation could have messed up and after computing the final HMAC copied the result in the second half of an output that had the original digest in its first half\"?Depends heavily on the wallet software, so if you know which one sent the transaction, you can just go through the source code, or assembly if it's proprietary, and study the nonce implementation used there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ymgve2",
      "created_time": "December 09, 2022, 04:50:41 PM",
      "body": "This is someone's broken deterministic nonce generation.Small hint: What's the SHA256 hash of \"bitcoin is awesome\" which is the private key of the transaction?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ymgve2",
      "created_time": "December 09, 2022, 05:04:32 PM",
      "body": "You didn't understand.Where do you think the last 16 bytes of the nonce comes from?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ymgve2",
      "created_time": "December 09, 2022, 05:21:13 PM",
      "body": "privkey is 23d4a09295be678b21a5f1dceae1f634a69c1b41775f680ebf8165266471401bsecond part of nonce is 23d4a09295be678b21a5f1dceae1f634",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ymgve2",
      "created_time": "December 09, 2022, 05:30:49 PM",
      "body": "It seems like some homebrew way of creating a (bad) deterministic nonce. It's too simple and clean to be just a coding mistake.And it's bad because reusing part of the unhashed private keys and z means the nonce can now be expressed purely as a linear function of other parts of the signing process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}