{
  "id": "topic_5410777",
  "title": "Ultegra134",
  "author": "Ultegra134",
  "created_time": "August 22, 2022, 11:38:50 AM",
  "content": "This is not the typical type of thread I'd make. Honestly, I'm not one of those people who always moan and think about money, with it being all that matters to them, while trying to cut corners on everything. Don't get me wrong, I'm not against saving/investing while being resourceful and frugal.Approximately since March, inflation has started taking a toll on me, first financially and then psychologically. At first, I wasn't really bothered; it wasn't that extreme and wasn't too worried. I was still making ends meet without too many issues and still managed to save a little, without taking into account my cryptocurrency investments. However, as time passes by, it gets worse and worse. I believed that the tourism sector could slow down the recession in Greece, but that didn't happen. Prices of goods are increasing every week, while electricity bills have soared.As you can see from the following chart, inflation in Greece keeps increasing every month, with July only showing tiny and unimportant signs of improvement. The situation in Europe isn't great either, especially in the Balkans and Baltic countries.No matter how you look at it, it's terrible. Although, I believe that Balkan countries are in a worse position due to the low wages in most of them. For instance, the minimum wage in Greece is €713 before taxes, approximately €620-€650 after taxes, while the average rent for a single bedroom apartment exceeds €300-€350. Don't get me started on electricity and fuel.Every end of the month, energy suppliers announce the prices for the following month, with kw/h increasing every month. The Public Power Corporation in Greece announced an increase from €0.486/kWh to €0.788/kWh, while in other suppliers it might cost up to €1/kWh. It's astonishing. In the meantime, the government is funding oil and electric suppliers, who are soaring millions in profits in the past few months.This situation is only worsening; living is constantly becoming more expensive and has started to have psychological effects too. As I've said earlier, I'm not used to moaning about money, because I still have cryptocurrency investments and so on, and there are plenty of people who are struggling way worse than I am, however, working two jobs, over 10 hours a day and I still see my bank's balance being slowly drained every month. I'm not anxious about today, but for the future, since the situation only seems to worsen day by day, making me sick to my stomach from anxiety.How are you currently coping? Do you believe that we'll see any kind of improvement in the next few months/years? What coping mechanisms have you developed?Sources: https://ec.europa.eu/https://www.keeptalkinggreece.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410777",
  "comments": [
    {
      "author": "Hydrogen",
      "created_time": "August 22, 2022, 04:47:04 PM",
      "body": "Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMHow are you currently coping? Do you believe that we'll see any kind of improvement in the next few months/years? What coping mechanisms have you developed?I expected our current era of inflation and doom and gloom for the last 20+ years. Everything people are depressed and anxious about now. Are things I was depressed and anxious about more than a decade ago. Thankfully, I've had time to think and rationalize everything. Eventually got over most of the negative thoughts and sentiments surrounding it. Like the stereotypical memes say, things do get better over time. People can adapt. Learning more about the problems we face definitely helped in my case. Feelings of powerlessness stem from not knowing or understanding the motives, history and fundamental forces behind things. This is a dual edged sword as defining the problem can also exacerbate negative feelings, in terms of recognizing the enormity of the issues faced. Which can result in greater demoralization.The worst is still yet to come. I hope the crisis brings out the best in people and teaches us the importance of things which many of us take for granted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "August 22, 2022, 05:20:06 PM",
      "body": "I think when it comes to living expenses, it's always going to be a factor with the effects of dealing with where you will get your next meal and how. That's always going to be a factor in the mental aspect and would affect you if you are having a hard time with it. So this becomes a domino effect. Everyone wants to survive, so every business and effort to live would increasingly become difficult because everyone wants and needs more, so there's more to it. With my coping with what's happening in the economy, I had to resort to different incomes so that I could manage to live my daily life with the current setup that I have now. I hope that everyone is as well. It's just really tiring sometimes, and I need a break sometimes too. I recently had an anxiety attack on having doubts about myself. All I did was resort to my partner, who helped me remember my \"why's,\" It came back to me, and I felt better because of it. Maybe you can try that as well. Have deep breaths too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "August 22, 2022, 05:22:26 PM",
      "body": "Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMHow are you currently coping? Do you believe that we'll see any kind of improvement in the next few months/years? What coping mechanisms have you developed?Improvement in next few months I don't expect it but in next few years it is possible and during that year if we can buy some coins to invest now, we can achieve personal improvement in finance . Now the government need to reduce tax so savings can grow.Quote from: Hydrogen on August 22, 2022, 04:47:04 PMI expected our current era of inflation and doom and gloom for the last 20+ years. Everything people are depressed and anxious about now. Are things I was depressed and anxious about more than a decade ago.Like I get tempted asking how old are you now    joking Quote from: Hydrogen on August 22, 2022, 04:47:04 PMLike the stereotypical memes say, things do get better over time. People can adapt. Not anymore. Things not getting better over time. They getting worse over time. We are feeling it getting from bad to worse. Individual life can get better but country economy getting bad to worse. The world need help inflation getting worse.Quote from: Hydrogen on August 22, 2022, 04:47:04 PMThe worst is still yet to come. I hope the crisis brings out the best in people and teaches us the importance of things which many of us take for granted. The people learn in hard way, life teach us to be strong and in hard times to stand up for ourselves. Never lose hope to keep struggling for survival. If you try today and it fails, keep trying to succeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "August 22, 2022, 06:54:29 PM",
      "body": "Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMThis is not the typical type of thread I'd make. Honestly, I'm not one of those people who always moan and think about money, with it being all that matters to them, while trying to cut corners on everything. Don't get me wrong, I'm not against saving/investing while being resourceful and frugal.Approximately since March, inflation has started taking a toll on me, first financially and then psychologically. At first, I wasn't really bothered; it wasn't that extreme and wasn't too worried. I was still making ends meet without too many issues and still managed to save a little, without taking into account my cryptocurrency investments. However, as time passes by, it gets worse and worse. I believed that the tourism sector could slow down the recession in Greece, but that didn't happen. Prices of goods are increasing every week, while electricity bills have soared.As you can see from the following chart, inflation in Greece keeps increasing every month, with July only showing tiny and unimportant signs of improvement. The situation in Europe isn't great either, especially in the Balkans and Baltic countries.No matter how you look at it, it's terrible. Although, I believe that Balkan countries are in a worse position due to the low wages in most of them. For instance, the minimum wage in Greece is €713 before taxes, approximately €620-€650 after taxes, while the average rent for a single bedroom apartment exceeds €300-€350. Don't get me started on electricity and fuel.Every end of the month, energy suppliers announce the prices for the following month, with kw/h increasing every month. The Public Power Corporation in Greece announced an increase from €0.486/kWh to €0.788/kWh, while in other suppliers it might cost up to €1/kWh. It's astonishing. In the meantime, the government is funding oil and electric suppliers, who are soaring millions in profits in the past few months.This situation is only worsening; living is constantly becoming more expensive and has started to have psychological effects too. As I've said earlier, I'm not used to moaning about money, because I still have cryptocurrency investments and so on, and there are plenty of people who are struggling way worse than I am, however, working two jobs, over 10 hours a day and I still see my bank's balance being slowly drained every month. I'm not anxious about today, but for the future, since the situation only seems to worsen day by day, making me sick to my stomach from anxiety.How are you currently coping? Do you believe that we'll see any kind of improvement in the next few months/years? What coping mechanisms have you developed?What many people seem to be overlooking is you're thinking this is the peak, the worst part of this economic cycle - in most places it is still business as usual and only at the beginning of the recession ahead. It's predicted to be slow and unfortunately it will lead to a downward cycle that compounds itself. People as for more money as inflation eats away at the value of what they've got, then companies have to charge more to pay the extra costs to staff, which increases inflation even further. We have not even started the bad scenario yet, many people are still running on fumes left over from saving during Covid (at least the lucky ones who could) and the next few months into winter especially will create much harder times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "August 22, 2022, 08:28:47 PM",
      "body": "Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMHow are you currently coping? Do you believe that we'll see any kind of improvement in the next few months/years? What coping mechanisms have you developed?Except one is a producer, or running a business where you can easily push inflation costs on to the customers, we are all hard hit by the rising inflation and cost of living. It's like the elephant in the room that keeps growing.I'm from Nigeria, and I'll say we have had lots of experience with coping in similar situations, as series of bad governments has resulted in rising inflation and cost of living long before covid or oil crisis hit. The general struggle is keeping your income able your expenses, and finding a way to salvage some of it for savings or investments. This is not always easy, as jobs are not readily available or well paying.Finding ways to cut down expenses to a minimum also helps leave out more for savings/investments.I don't expect any improvement in the next couple of months or years globally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "August 22, 2022, 09:01:26 PM",
      "body": "Quote from: Fortify on August 22, 2022, 06:54:29 PMQuote from: Ultegra134 on August 22, 2022, 11:38:50 AM~Snipped~What many people seem to be overlooking is you're thinking this is the peak, the worst part of this economic cycle - in most places it is still business as usual and only at the beginning of the recession ahead. It's predicted to be slow and unfortunately it will lead to a downward cycle that compounds itself. People as for more money as inflation eats away at the value of what they've got, then companies have to charge more to pay the extra costs to staff, which increases inflation even further. We have not even started the bad scenario yet, many people are still running on fumes left over from saving during Covid (at least the lucky ones who could) and the next few months into winter especially will create much harder times.I acknowledge that this is simply the beginning. That's the main reason why I mentioned that I'm not too frustrated today, but in the future, the worst is yet to come. As someone who is already seeing his balance slowly drain, while renting a relatively cheaper than average house (which has several issues, but you're unlikely to find one that doesn't for €250), it's disheartening to see that after all these long working hours, you're still going slowly in debt, or just barely enough to cover your expenses.Quote from: Upgrade00 on August 22, 2022, 08:28:47 PMQuote from: Ultegra134 on August 22, 2022, 11:38:50 AMHow are you currently coping? Do you believe that we'll see any kind of improvement in the next few months/years? What coping mechanisms have you developed?Except one is a producer, or running a business where you can easily push inflation costs on to the customers, we are all hard hit by the rising inflation and cost of living. It's like the elephant in the room that keeps growing.I'm from Nigeria, and I'll say we have had lots of experience with coping in similar situations, as series of bad governments has resulted in rising inflation and cost of living long before covid or oil crisis hit. The general struggle is keeping your income able your expenses, and finding a way to salvage some of it for savings or investments. This is not always easy, as jobs are not readily available or well paying.Finding ways to cut down expenses to a minimum also helps leave out more for savings/investments.I don't expect any improvement in the next couple of months or years globally.I've come to the conclusion that inflation is a vicious cycle. Electricity and fueling becomes more expensive, producers struggle making ends meet and are forced to increase the prices, burdening the consumers. This pattern goes on and on, breaking it sounds impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "August 22, 2022, 09:06:59 PM",
      "body": "Quote from: Ultegra134 on August 22, 2022, 09:01:26 PMI've come to the conclusion that inflation is a vicious cycle. Electricity and fueling becomes more expensive, producers struggle making ends meet and are forced to increase the prices, burdening the consumers. This pattern goes on and on, breaking it sounds impossible.Hyper inflation, when rolling, is a difficult Stone to stop, but not impossible. The circle of increasing prices of goods, due to increase in value of other goods, can make it difficult for regular people to cope with overtime as the prices of goods and services gets ridiculously high. But it can definitely be stopped or reversed, if a favourable economic condition sets in or due to effective fiscal policies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 22, 2022, 09:25:50 PM",
      "body": "Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMHow are you currently coping? Do you believe that we'll see any kind of improvement in the next few months/years? What coping mechanisms have you developed?I think the scenario is the same everywhere, it is really hard nowadays due to basic needs getting expensive.  But no matter how hard life is we need to think positively in order to at least minimize the psychological impact of inflation.  To at least combat this kind of inflation we need to find sideline jobs in order to have another source of income, be thrifty, and don't waste food.  A small adjustment to expenses is a huge relief when accumulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "August 22, 2022, 09:31:57 PM",
      "body": "Well, obviously the efects of inflation are felt both financialy and mentaly, depending on ones financial position that is. But what needs to be looked at here is the long term effect it has on people and what issues it brings down the line because not everything can be felt imediatelly. If inflation causes further economic turmoil that lead to more sever conseqences like unemplyment, that that effects a whole lot more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "countryfree",
      "created_time": "August 22, 2022, 10:32:22 PM",
      "body": "Lots of pessimists here!The biggest problem I see around me is a shortage of qualified and experienced workers.If you're a professional with a good qualification, you don't have a single reason to worry. Salaries are on the rise, too.If you don't have a good qualification, get one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 22, 2022, 10:35:37 PM",
      "body": "Quote from: Ultegra134 on August 22, 2022, 11:38:50 AM Prices of goods are increasing every weekThe cost of everything is on the increase and increased inflation rate is not just peculiar to Greece or the Europe, but also Africa even Nigeria. As inflation rate is said to have been recorded by the by the National Bureau of Statistics (NBS) as 19.64% in July 2022, the highest rate it has been in over a decade. In June 2022, it was 18.6%. You can see that it is on the rise and it prompts me to think what the figures will be in like two months more if the situations continue to progress in this path and manner.Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMThis situation is only worsening; living is constantly becoming more expensive and has started to have psychological effects too. The thought of if things will ever get better is on its own very stressful. Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMHow are you currently coping? The price today is not the price in a couple of days, so to avoid being shocked, if it is within your means, buy commodities and things you need in bulk to store if possible, that is what I do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "August 22, 2022, 11:38:30 PM",
      "body": "It is difficult to say how long this current period of inflation will last. However, it is important to remember that there are always ups and downs in economies and this too shall pass. In the meantime, it is important to find ways to cope with the current situation. One way to do this is to cut back on unnecessary expenses and focus on essential needs. Another way to cope is to find ways to increase your income. Like finding ways to make extra money through side hustles(you could try trading your crypto investments on a p2p platform, there's a good margin of around 3~4% at some sites or provide your services at platform like upwork & give a couple of hours daily) .Anyways, it is important to remember that this is not the end of the world and that things will eventually improve  Tough times make tough people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasisog",
      "created_time": "August 23, 2022, 04:14:11 PM",
      "body": "We've been through this kind of inflation crisis before but this one is quite harder. It will be a big challenge for the government as well as the ordinary citizens especially those who are just trying to survive life. Everything striked up including the prices of the primary goods and other necessities which is really challenging for our daily living. It's stressful and challenging each day but we'll only be dragged into worse situations if we'll just stay negative about this crisis. We can't control the increasing inflation but we can do everything to survive. Continuous grinding and hassling is the best thing that we can do and hope to see things get better in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "August 23, 2022, 04:46:44 PM",
      "body": "It's mostly connected to the sanctions against Russia. If Russia's Special Op was wrong the inflation wouldn't have happened despite the sanctions. I advised against the sanctions earlier, warning that it will result to problems to those imposing it but the warning was ignored.I think the problem should be resolved once the sanctions are reversed and more mistakes are not made. Russia should be supported to do what is right. It's wrong to embarrass and shame her infront of her younger siblings/neighbors who should show her some respect ... the worse is encouraging the siblings/neighbors to fight the senior. *The sanctions should be reversed & the right thing done, for the sake of Europe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "August 23, 2022, 06:11:38 PM",
      "body": "Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMHow are you currently coping? Do you believe that we'll see any kind of improvement in the next few months/years? What coping mechanisms have you developed?Here in our country we are living an electoral year, what means politicians try to make economy looks best as possible in order to be re-elected by the population. This is the time they raise welfare programs payrates, print more money to afford the obligations, subsidize the prices of fuel, electricity in a unsustainable manner and the worse part of it is that we are always under the rule of the same thieves, doesn't matter which party wins the competition, because the strongest political group in the country doesn't have an ideological flag, so they always stay at the winner's side, in exchange of personal benefits that involve increasing public expenses considerably for that purpose, besides overpricing tactics in public projects and constructions, what is possible because they occupy strategical leading spots inside the government.And even though they are trying their \"best\" to manipulate the economical scenario it's still pretty bad. Each new week the prices of basic goods are more expensive at supermarkets. That is what concerns me, because I know from next year on, or as soon as this clownery they call elections end, it's going to get much worse...I was thinking yesterday and realized in 3 years the minimum wage has been raised in almost 30%! Now imagine how much the price of products have been raised on the same period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "August 23, 2022, 07:37:45 PM",
      "body": "Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMHow are you currently coping?I am the same as you before that I don't think about inflation and I'm careless since I'm earning a living and still living comfortably. But when these high rates of inflation came out, I started to notice that the prices have increased and my groceries weren't that much anymore with the budget that I allocate weekly. Honestly, I'm trying to cope and save as much as I can and I'm also teaching my immediate family to understand what this inflation is doing to us and it's certainly bad and worrying unlike before. We don't have that type of extravagant living so, living frugally is helping us since we've been accustomed to this type of living. But as the main person who's responsible for most expenses in my family and as a breadwinner, it seems that I'm the one that has to deal with it, alone. So far, I can say that I'm still coping through having side hustles and my passive income is sort of having problems because of the delay of payments of my tenants so, it's affecting my finances as well. Although it is still able to pay our bills monthly, that's already good for me/us and I'm grateful with that.Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMDo you believe that we'll see any kind of improvement in the next few months/years? I'm hoping that it will and most countries or the entire world recovers from all of these factors that are giving us that hard inflation. Nevertheless, we're still the ones to look for ways how to deal with it and survive as much as we can. The rich are getting richer in this situation and hoping that we'd be the same as their situation that no worries even though there are too many economic problems for so many of us.Quote from: Ultegra134 on August 22, 2022, 11:38:50 AMWhat coping mechanisms have you developed?Budgeting, I'm the one who budgets our expenses, and having that said, it results in lesser to no savings at all but I've got my investment reserved in bitcoin and I know someday that all of these enduring moments will be worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "August 23, 2022, 08:51:18 PM",
      "body": "I believe the situation is the same almost all over the world, nearly every country is battling high inflation, the cost of living is getting high on a daily basis and governments are not able to curb it at the moment.In this current situation, those who have less dependent will have less impact from inflation as they will still be able to maintain a healthy standard of living and save at the same time. for those with lots of families depending on them, the situation is different, the burden to provide for more people will weigh you down and no doubt the situation will take a toll on you, mentally and financially.There is no other solution than to cut expenses to the bearest minimum, at least till when the economy is able to recover a bit, even though no one knows when that will happen (if it will).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ivartheragnarson",
      "created_time": "August 24, 2022, 05:33:51 AM",
      "body": "i would not mention my country what is. but need to mentioned what we bought for $100 , now more than $250 in a one year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "August 24, 2022, 09:04:10 AM",
      "body": "Quote from: countryfree on August 22, 2022, 10:32:22 PMLots of pessimists here!The biggest problem I see around me is a shortage of qualified and experienced workers.If you're a professional with a good qualification, you don't have a single reason to worry. Salaries are on the rise, too.If you don't have a good qualification, get one.Not always the case, I have a degree in Economics and a Master's in progress, I didn't find much in my town and those available weren't paying more than I'm earning now.Quote from: Ucy on August 23, 2022, 04:46:44 PMIt's mostly connected to the sanctions against Russia. If Russia's Special Op was wrong the inflation wouldn't have happened despite the sanctions. I advised against the sanctions earlier, warning that it will result to problems to those imposing it but the warning was ignored.I think the problem should be resolved once the sanctions are reversed and more mistakes are not made. Russia should be supported to do what is right. It's wrong to embarrass and shame her infront of her younger siblings/neighbors who should show her some respect ... the worse is encouraging the siblings/neighbors to fight the senior. *The sanctions should be reversed & the right thing done, for the sake of Europe That's partly true, however, the energy and fuel crisis was already starting from September 2021, certainly, it wasn't as awful as now, but it didn't magically happen due to the war. You're right, though, the sanctions totally backfired, and it was expected. I don't understand what they were thinking when imposing them.Quote from: royalfestus on August 23, 2022, 05:07:07 PMI was more interested in the parameters on the psychological effect of inflation but it seem it only personal and no parameters. Are you from Greece? The effect might be different for countries struggling with their economy already. There is also relief in the psychological effect when Government show concern by responding to the agony of the citizens with regular and showing awareness at all platforms.All countries are suffering from inflation, however, some are experiencing it worse than others. I'm from Greece, the situation is worsening day by day due to the elected party of Mitsotakis New Democracy, we've been featuring headlines for some of the worst corruption scandals in the world, while Mitsotakis instead of taking measures to tackle inflation, he's boosting rich corporations by subsidizing them, achieving billions in profits per month.Things were getting better when Tsipras with Syriza was elected, for sure, he wasn't the best, but wages had increased while V.A.T was reduced in food items. On top of that, it was the first in years that the economy (in terms of GDP) was improving. It was going downhill with other political parties and during Tsipras election, the fall was halted and started recovering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}