{
  "id": "topic_5446586",
  "title": "Fiatless",
  "author": "Fiatless",
  "created_time": "March 28, 2023, 05:56:00 AM",
  "content": "I have been in this forum for some time now and becoming a bitcoin trader didn't interest me. I have been attracted to the idea of keeping my coins for a long time and selling it when it reaches my target. I have decided not to sell any of my coins until the bull run season no matter the pressure from any corner. But recently, I was just reasoning about my bitcoin holding because where a man's treasure is where his mind will be when a question dropped into my mind; What can make you sell your bitcoin? I thought about it and I came up with these few points.Health Issues: Health is wealth, which means without health a man is not wealthy. If there is any sickness that needs money for me or any member of the family to seek medical help, I might decide to sell some of my bitcoin holding to cover the bills. It is only the living that can enjoy the benefit of any investment.Loss of source of income: A loss of a job or business might force me to sell some of my holdings if I exhaust all my savings. I and my family needs to be alive to enjoy our investment, so we need food and other basic needs to survive. it will be painful but it will be better than begging or taking loans.     Business opportunity: Many people in my country are migrating to developed to seek better employment opportunities. Many of them are cheaply selling their properties and businesses. If I have the opportunity to buy a cheap house or business, I might decide to sell some of my bitcoin because the profit from the business will help me to buy more bitcoin in the future. House rent is expensive in my country and it is really taking a large chunk of my income. If I own a house, my house rent can be used to buy more bitcoin.Unfavorable government policies: If the government of my country decides to ban the holding or use of bitcoin, I might be forced to dispose of them. I will not want to be hiding from law enforcement agencies or risk being arrested. I don't wish this to happen but if it does, I will have to take that hard and painful decision.Migration: My earnings only permit me to save a little amount that I use to invest in Bitcoin. If I have an opportunity to secure a higher-paying job in another country ad I have to finance the travel with part of my bitcoin holding, I might sell some. I higher paying job means more investment in bitcoin.Higher Education or Skills: If there is an opening for promotion in my organization and it requires getting a higher degree or specialized skills, I might consider selling part of my holdings. This is because such a promotion or job bring higher financial reward which can enable me to buy more coins. In summary, there are just two broad reasons that will make me sell my coins, first emergencies such as sickness and loss of a source of income, and better opportunities that will give me more financial backup to buy more bitcoin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446586",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "March 28, 2023, 07:29:25 AM",
      "body": "Well said, Bitcoin is an asset, one could liquidate some of it like any other asset if there is a need for it. But we must be sure that the needs are worth it and I agree with some of the points you iterated above. God will not allow us to face health and financial challenges, they are such that might tie the hands of anyone to selling their assets if there is no other choice.However, I can't sell my Bitcoin because of the following:Business opportunities because it's an investment for me itselfUnfavourable government policies because it's decentralized, so I can still stay off the radarMigration and Higher Education or Skills because my earnings from it could take care of that for me and I will hustle the rest as most education abroad is not paid at onceThese are my personal view and status and could be different from anyone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "March 28, 2023, 07:39:39 AM",
      "body": "I believe we should only invest amounts of Bitcoin that we would not need to liquidate in other to finance a real life need, more like spare money, which makes up only a small percentage of your total savings.If you do this, you would not need to sell for health emergencies or any other financial requirement.That's the textbook advice, but it's likely that many holders risk a little bit more than they can afford to lose with Bitcoin as their trust in it grows and when faced with a financial need, one might need to sell off.All the reasons you outlined are valid and would compel pretty much anyone to sell, but for me that would only be a percentage of my holdings, I plan to always hold some amount of Bitcoin for years to come and never fully \"cash out\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kizlod",
      "created_time": "March 28, 2023, 07:43:24 AM",
      "body": "True, I was thinking the same way. Waiting for $100K BTC or more is great and all, but if there is an emergency it's better to sell it, it's one of the reasons to have investments in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "March 28, 2023, 07:54:03 AM",
      "body": "Quote from: Fiatless on March 28, 2023, 05:56:00 AMUnfavorable government policies: If the government of my country decides to ban the holding or use of bitcoin, I might be forced to dispose of them. I will not want to be hiding from law enforcement agencies or risk being arrested. I don't wish this to happen but if it does, I will have to take that hard and painful decision.I agree with the rest except this oneThere are many countries which have completely ban Bitcoin, but after Bitcoin is widely accepted many countries, they're consider to unban Bitcoin. When the government announce to completely ban Bitcoin, it would create a panic and I think the P2P platform on your country don't mind to sell Bitcoin at discount rate. I will not do this, I will choose to hold Bitcoin in private or move to other country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "March 28, 2023, 08:00:32 AM",
      "body": "we all have reasons when to sell our coins. if you sell because you need funds, that's really for a good cause.but one good reason why some do it every time is when there is bull run. traders would sell their coins before the bear market start or even before the bull run ends they already sold their coins because they wouldn't wait for it to hit the peakest during the bull season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "March 28, 2023, 08:13:16 AM",
      "body": "Quote from: Fiatless on March 28, 2023, 05:56:00 AM In summary, there are just two broad reasons that will make me sell my coins, first emergencies such as sickness and loss of a source of income, and better opportunities that will give me more financial backup to buy more bitcoin.     That's a good summary of why people are selling their coins and I agree with point to sell our coins if we need the money for something important. For me health is also the number one thing to focus one. Hopefully you are okay and not selling your coins because of it. What kind of other opportunities are you going for, will you come back to bitcoins? In my opinion financial opportunities change quickly and I would only sell my coins for emergencies. If there is a short term opportunity to invest in I would rather try and raise additional funds than sell my bitcoins. When it comes to investing I strongly believe that we shouldn't put all our eggs in one basket, diversification is important. That's why I will try to always keep some bitcoins and sell rather other assets first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "March 28, 2023, 08:34:44 AM",
      "body": "I like your first point about health, you can't become successful if you are not in good shape yourself, you need to pray for better health in the future to enjoy your investment when the reaping time is right, a healthy man is indeed a wealthy man. As for the business opportunity, I have sold some valuable things I have to buy Bitcoin, and I do not see anything worth trying out except Bitcoin, maybe it's just how I think, but I do have my own business and most of my money goes straight into Bitcoin investments. In my opinion, Bitcoin remains a golden business opportunity, because whatever business you pursue is still all about making more money. Isn't it? The government has banned crypto for years in my country, since I was not accepting Bitcoin payment, there was no need to panic, I kept buying Bitcoin using my bank account, thanks to Peer 2 Peer on the Binance exchange, you can only get yourself in trouble if there is any word related to crypto when sending money from your bank account to someone else. I have seen a lot of hardship in my life, there is nothing left that can shake my faith in holding my Bitcoin, if Bitcoin have no future the government wouldn't be trying all they can to kill it, definitely this digital currency is working.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 28, 2023, 10:58:23 AM",
      "body": "By investing their money in bitcoin, for sure, each person will have their own reasons and goals. Someone insures their money by investing in Bitcoin, and someone is waiting for a certain price to sell. In the same way, it can be said that some people still use bitcoin as digital money to acquire or buy goods. Waiting for a large value of bitcoin is normal for those who have another financial cushion that allows them not to turn to their investments for a long time. In addition, it is normal to expect a profit if it is significant, but for this, the investment itself must be a large amount. I will not deprive myself of the charms of life by saving on everything in order to get a little more money in the future. If I suddenly have an idea to buy something, and for this, I need to open a \"safe\" with bitcoin, I will spend it without hesitation. Our time is so uncertain that it is necessary to live in the now and not wait for tomorrow, which for some does not happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "March 28, 2023, 11:03:46 AM",
      "body": "Quote from: Fiatless on March 28, 2023, 05:56:00 AMWhat can make you sell your bitcoin?tl;drYour post is too long but skimming it, I got your opinion and my point is if you use all your money to invest in Bitcoin, sooner or later you will fall into one of those situations you mentioned, and have to sell your bitcoins at times you never want to sell such in bottom of bear market.In short, make sure you reserve a bit of money in either fiat currency or stable coin to use in emergency. Because it is for emergency, fiat currency is better. Risk of de-peg from stable coin is another risk factor why you should choose fiat currency.It is easily to say I have diamond hands and will hold my bitcoins especially in bull market. Assume you spend $10,0 00 in last bull market, buy bitcoin at $60,000 and months later you need money when bitcoin was about $20,000 and you have to sell it.A simple calculation, you will have to sell your bitcoin at /3 price. Rather than selling a fraction of bitcoin with initial capital at $1000, you will have to sell three-fold of that amount just to get $1,000. Is it a good way to invest and hold your bitcoins? NO",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "March 28, 2023, 11:21:45 AM",
      "body": "Your reasons are legit to sell your holdings but to live a financially free life you need more than holding like new investment opportunities which could make you more money. I know BTC has its benefits due to volatility and could give huge profits in long run but that's not enough. Like what will happen if the market goes into a bear trend and remain there for like 1 whole year or maybe 2? And in that period, you needed that money like in an emergency.You will be forced to sell your holdings like I was forced, the point is, if you have the mind of an entrepreneur then you tend to invest in different businesses (diversify) so that if one goes down then the other can back you up. I have seen many people becoming rich overnight with their BTC like they do future trades and make huge profits but some lost all of it. Why? Taking these huge risks while you can play it safe.You should remain optimistic and should encourage your mentality to not depend on your holdings while you should encourage it to open new gateways of earning so that whenever you face those conditions or reasons to sell your holdings then that money (generated from other Businesses) could help you out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "March 28, 2023, 11:26:10 AM",
      "body": "Above all, if you know little bit of technical analysis and are aware of all the fundamental things happening globally, you can sell at the best possible price even before you are in emergency. Never ever do forced selling. I know in some situations like health issues we got no other choice but for rest all the things I'd not sell my bitcoins at any rate. Btw, thats just my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "March 28, 2023, 11:33:25 AM",
      "body": "What about spending it for a cup of coffee at your local restaurant I know you are talking about your long term BTC investments that is probably stored in a hardware wallet or in an airgapped device, and not BTC for regular spending that's stored in a hot wallet, but for members who do not do this, if you have local merchants with whom you can spend your BTC, it is good to have a small amount in a hot wallet that you can spend at your convenience, BTC should not only be spent if there is an emergency.But OP all your reasons are sensible, if income from your job and your other investments in real life cannot solve the problem you have, then if your BTC's are all you have left, then you have to sell it to solve the problem you have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "March 28, 2023, 11:37:53 AM",
      "body": "There are plenty of reasons that can make an investor sell their bitcoins, and it varies from one individual to another. In my opinion, what matters most is being happy and healthy, rather than just making a lot of money and being rich, especially if your life is a mess. Sometimes, having a lot of bitcoins may not make a person happy unless they use them for things that improve their lives. Personally, I would like to use my bitcoins to invest in big projects or to cash out when I am in urgent need of funds for family or health issues, and not just for the sake of accumulating wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "March 28, 2023, 12:10:49 PM",
      "body": "Quote from: Fiatless on March 28, 2023, 05:56:00 AMLoss of source of income: A loss of a job or business might force me to sell some of my holdings if I exhaust all my savings. I and my family needs to be alive to enjoy our investment, so we need food and other basic needs to survive. it will be painful but it will be better than begging or taking loans.         I will concede to this part of your reasons. Before I made the decision to invest in Bitcoin, I probably should have had other sources of income; that is to say, my investment in Bitcoin will not in any way affect my way of life, expenses, or matters arising from my job. Me investing on Bitcoin I take it as a buried funds which it's only when I actually budget to pull of the funds that's when I will do that.  Unless as @Edwardard have mentioned if I see great trading opportunity which can add up more funds to my holdings I will sell off and buy again when the price will at my favour. But it will be hard to make such decisions though because the price of Bitcoin can sometimes be very surprising, when you sell might be when the bull market will began and buying back can't give you what you actually sold out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "March 28, 2023, 12:21:02 PM",
      "body": "I understand that the reasons that will force someone to sell is different for everyone. Some will sell even for the slightest reasons, for others, there is usually a good reason for selling.Quote from: Fiatless on March 28, 2023, 05:56:00 AMHealth Issues:Before health challenges or issues be the reason to make you sell, go get a health insurance, or have money that you keep for health and every other emergencies.Quote from: Fiatless on March 28, 2023, 05:56:00 AMLoss of source of income:         If you take money from your investment to support yourself and family during a difficult time like a period where you just experienced loss of source of income, try not to finish it all, also as you take make sure it is not just only to eat but also to try to settle down again.Quote from: Fiatless on March 28, 2023, 05:56:00 AM Business opportunity: Many people in my country are migrating to developed to seek better employment opportunities. Many of them are cheaply selling their properties and businesses. If I have the opportunity to buy a cheap house or business, I might decide to sell some of my bitcoin because the profit from the business will help me to buy more bitcoin in the future.Property investment can be good if you get a good offer and good place, but if you sell your bitcoin to buy a property that is not good, or not in a good environment or land, you will regret.Quote from: Fiatless on March 28, 2023, 05:56:00 AMUnfavorable government policies: If the government of my country decides to ban the holding or use of bitcoin, I might be forced to dispose of them. I will not want to be hiding from law enforcement agencies or risk being arrested.The government who you know are obsessed with holding on to their control over you should not be feared. There are many countries where bitcoins are still illegal to have, but it has not stopped people completely from having some bitcoins in secret. Do not let the government of your country spoil your decision to hold bitcoins.Meeting the target one has set for themselves is also another reason to sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SOKO-DEKE",
      "created_time": "March 28, 2023, 12:53:07 PM",
      "body": "Seriously, op you have given a reasonable points that can actually make person sell his/her Bitcoin investment. But let know that there are a lot of reasons that can make individual to sell him/her Bitcoin investment but that will depend on how does reasons may serve to an individual despite it may not sound reasonable to others. As for me, I can sell a portion of my Bitcoin if I need cash to accompany whatever I know it will be reasonable to my life, but it must be something reasonable in my eyes, such as food and clothing.therefore have not really eager  to make it through Bitcoin investment but also consider it to be a privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "March 28, 2023, 01:18:31 PM",
      "body": "In this case, when you still have some source of income, you should be careful about where to spend it and one good thing is to buy some bitcoins instead of spending your money on some bad habits like cigarettes and alcohol because it will only add you in misery because those things don't benefit you at all. so instead, buy some bitcoins and it will grow and will secure your funds whenever there will be an emergency you won't regret that decision because it has been tried before, and as we can see, there are lots of successful stories when doing that method of investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "March 28, 2023, 09:12:38 PM",
      "body": "There are two many reasons to sell our bitcoins and that depends on how satisfied we are with that decision. Unforeseen circumstances is the summary of those reasons.We just have to embrace the reality that we can't hold forever unless you're all set for life and you're not worrying about anything. You can hold as long as you can and you've got all of those businesses and other source of income to help you with finances from those potential situations that you may encounter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "March 28, 2023, 09:32:00 PM",
      "body": "It is difficult to restrict our requirements, which makes it challenging to pinpoint the motive behind selling my Bitcoin. However, I concur with the OP that certain fundamental factors may prompt us to sell our Bitcoin. Typically, I sell my Bitcoin when there are no other alternatives available to meet my needs and when I have earned substantial profits. When I profit from my holdings, I sell them and repurchase them during dips. This allows me to generate additional funds to utilize in my personal life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}