{
  "id": "topic_5428881",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "December 15, 2022, 11:27:13 AM",
  "content": "Here is his testimony under oathhttps://twitter.com/Benzinga/status/1603076399593844736Do you agree with him ? I feel this can cause legal issues for him for lying in front of senate.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428881",
  "comments": [
    {
      "author": "malcovi2",
      "created_time": "December 15, 2022, 11:36:56 AM",
      "body": "Quote from: krishnaverma on December 15, 2022, 11:27:13 AMHere is his testimony under oathhttps://twitter.com/Benzinga/status/1603076399593844736Do you agree with him ? I feel this can cause legal issues for him for lying in front of senate. It should be the FTX management who put FTX out of business if they were really not using their customers funds they won't be insolvent. I don't get why people are still pointing CZ when people should giving attention for Coindesk for revealing how FTX is insolvent.CZ did them dirty but he was just protecting his funds and business. Kevin can whine all about it because he is invested in FTX he will probably do any investors would do, recoup any losses that he can do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 15, 2022, 01:35:52 PM",
      "body": "whistleblowers get blowback. but thats the cost of calling out on a scam..so i can understand why cry babies blame other victims and call out on a whistleblower as the bad guybinance seen some bad deeds and asked for a refund/withdrawal of value..this is not theft or sabotage. this is \"fuck this im getting out of this risk\"alot of idiots think if binance stayed quiet then users could have magically suddenly had the lightbulb moment to get out before FTX sunk naturally..but if binance did not out FTX and disclose the bad deeds of FTX people would have stupidly continued to invest in ftx in blissful ignorance until they drowned with FTX at a later datein short all binance done was bring to light something that would have hurt investors eventually anyway. it just happened sooner rather than later",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 16, 2022, 01:58:31 AM",
      "body": "What specifically was the lie? I guess it wasn't strictly a testimony. Kevin didn't give a single fact. Well, he admitted it himself. It was an opinion. He could have immediately been cut off right after his admission that what he had was \"an opinion. I don't have the records.\" I don't even understand why this man is invited. What does he know really? What relevant knowledge or information could he contribute to the hearing?Anyway, my opinion is that CZ opened the Pandora's box. It was full of shit, of course. FTX might fall at a certain point, but it was CZ who pushed it. And down it fell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 16, 2022, 01:40:52 PM",
      "body": "Quote from: krishnaverma on December 15, 2022, 11:27:13 AMDo you agree with him ? I feel this can cause legal issues for him for lying in front of senate. You might wanna watch that video in the tweet you shared once again. That senator asked him to give his opinion on why FTX failed, and he gave one. While his opinion is pure bullshit, it is just an opinion after all so I don't see him getting into any legal issues. Well, at least not for that (who knows, maybe he is involved in FTX downfall in some other way so that's why he puts blame on Binance).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "December 16, 2022, 05:51:58 PM",
      "body": "Quote from: krishnaverma on December 15, 2022, 11:27:13 AMDo you agree with him ? I feel this can cause legal issues for him for lying in front of senate. It seems to me that FTX exchange was always government sponsored honeypot, that was clear after public fact that their CEO is one of the biggest donator to democratic party and they have other political ties.It's not like I am defending Binance or CZ that are probably doing similar thing for China, but I don't think that Binance put FTX out of business, they did it themselves.My theory is that this crash was intentional plan to crash FTX, than claim how crypto is wild west, blame Bitcoin for everything, and add new strict restrictions and regulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "December 16, 2022, 06:05:56 PM",
      "body": "Quote from: malcovi2 on December 15, 2022, 11:36:56 AMCZ did them dirty but he was just protecting his funds and business. Kevin can whine all about it because he is invested in FTX he will probably do any investors would do, recoup any losses that he can do.I thought the same thing initially, but what I've come to realize is that SBF was doing a whole bunch of things wrong with FTX customers' funds, and he deserves to be prosecuted for that.  If anything, CZ simply hastened what was eventually going to happen anyway--who knows how long SBF would have gotten away with using customer funds for his own trading endeavors, but it could have been a long time.  Bernie Madoff got away with his Ponzi scheme for decades, and it was all based on trust.Regarding Kevin O'Leary and him getting his money back, I just watched a vid on Youtube in which CZ calls him out as a liar and also stating that he had a much closer relationship with SBF than an average FTX customer ever would (obviously true).  I just think O'Leary is a scummy individual based on what I've seen, including his testimony in front of Congress (or senate, I always confuse the two).  He wants revenge against CZ and Binance and has a loud enough voice that he might do crypto more harm than good.Edit:  O'Leary called Binance a \"massive global unregulated monopoly\".  That's absolutely not true if you look at how many crypto exchanges there are.  That statement is idiotic, damaging to crypto, and completely self-serving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "December 17, 2022, 04:11:41 AM",
      "body": "Quote from: Darker45 on December 16, 2022, 01:58:31 AMWhat specifically was the lie? I guess it wasn't strictly a testimony. Kevin didn't give a single fact. Well, he admitted it himself. It was an opinion. He could have immediately been cut off right after his admission that what he had was \"an opinion. I don't have the records.\" I don't even understand why this man is invited. What does he know really? What relevant knowledge or information could he contribute to the hearing?Anyway, my opinion is that CZ opened the Pandora's box. It was full of shit, of course. FTX might fall at a certain point, but it was CZ who pushed it. And down it fell.Agreed. There was a story about CZ and Sam. It was said that they met in a conference and CZ asked Sam to stop the market manipulation and the liquidation on their own institutional customers like 3 Arrows Capital. The side story is it was rumored that Alameda Research liquidated 3 Arrows and also Alameda triggered the fud that caused a run on Anchor protocol where billions of Luna UST were stored for yields.In any case, when Sam appeared not to listen to CZ, it was said that CZ made the decision to liquidate the remaining FTT they were holding and caused a cascade of dumping within FTX which killed the exchange.What presently might be happening his Sam's backers and his connections in politics might be making their own response by starting their own attack against CZ and Binance.According to crypto analytics portal Delphi Digital, more than $5 billion were withdrawn from major cryptocurrency exchange Binance in a two-day period between Dec. 13 and 14. The outflow was triggered by rumors that U.S. prosecutors were considering charging Binance and executives with money laundering and sanctions violations.Source https://u.today/5-billion-withdrawn-from-binance-bnb-following-recent-turmoil",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}