{
  "id": "topic_5465147",
  "title": "arwin100",
  "author": "arwin100",
  "created_time": "August 31, 2023, 04:22:42 AM",
  "content": "Maganda ang planong ito kung sinagawa nila ang planong ito nung sobrang sikat pa ng mga NFT's. Pero sa ngayon questionable na kung mag success paba sila since marami nadin ang reputable companies pero nag fail since medyo marami narin ang nakapansin na wala nang hype ang NFT sa ngayon. Local Telcos ventures to NFT.Source: BitpinasSa tingin nyo maganda kayang planong to ng giant telcos na sumali sa mundo ng NFT? o sadyang huli na ang pag adopt nila since marami nang tao umaayaw sa NFT's dahil sa dami ng scams na naganap dito?.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465147",
  "comments": [
    {
      "author": "dothebeats",
      "created_time": "August 31, 2023, 07:15:22 AM",
      "body": "Well, hindi rin ako sigurado sa development na ito. According sa article na ito ng Crypto Adventure nitong June 2023, may potensya pa rin na mag grow at develop ang NFT since tumaas ng tenfold ang number ng NFT holders ng past years, exactly 12.62%, o around 4.3 million ng April. Ang NFT lending market din ay nagkaroon ng magandang pagbabago o increase ng first quarter ng taon (January to March) na umabot ng halos $25 million. At isa pa sigurado rin naman na nagkaroon ng study muna ang Globe at Smart bago gawin ang desisyon na ito at mukhang may mas malawak na plano pa sila regarding dito. I guess we'll just see in the next few months, at sana maging maganda ang mga pagbabago na ito at resulta. https://cryptoadventure.com/community/articles/nfts-in-2023-are-still-a-thing/#:~:text=NFTs%20are%20certainly%20still%20a,platforms%20and%20investment%20methods%20evolving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhadz",
      "created_time": "August 31, 2023, 08:07:19 AM",
      "body": "Bumili pa ako ng NFT na yan worth 5 or 10 pesos gamit ang points. Wala lang para masabi na may NFT pero parang wala naman akong natanggap.Quote from: arwin100 on August 31, 2023, 04:22:42 AMSa tingin nyo maganda kayang planong to ng giant telcos na sumali sa mundo ng NFT? o sadyang huli na ang pag adopt nila since marami nang tao umaayaw sa NFT's dahil sa dami ng scams na naganap dito?.Huli na sila sa tingin ko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "August 31, 2023, 09:23:25 AM",
      "body": "Sa simula pa lang naman talaga ay wala naman basis ang NFTs as an investment so sobrang risky talaga ito dahil ang pagtaas ng presyo neto ay nakabasi lang talaga sa HYPE kaya hindi talaga siya sustainable pagdating sa long term, hindi ko din naman maisip kung paano nila ipapasok itong mga NFTs sa kanilang mga platform, if sa Globe or Smart sa tingin ko magiging promotion lang nila ito pero in the end wala namang pinakagoal para lang siguro masabi na nagaadopt sila sa NFTs/cryptocurrency.Bago lang din naman noong pumutok ang mga NFTs siguro makikita naten sa susunod na Bullrun if babalik din ba ang mga dating matataas na NFTs pero para saken kase pure hype lang naman talaga ito dahil nga mga arts ang nandidito mahirap siyang presyohan dahil ang basis ay subjective lang sa mga gustong humawak. Hindi rin naman maikakaila dahil maaari ka rin talagang kumita pero dahil hype lang ang basis nila dito ay parang sugal lang ang kinakalabasan, makikita natin if babalik ang NFTs era sa susunod na Bullrun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "August 31, 2023, 10:29:13 AM",
      "body": "Quote from: arwin100 on August 31, 2023, 04:22:42 AM<snip>Yep, mas maganda nga kung noong hype moments pa ng NFT. Pero hindi naman tayo ganon kabilis mag-adapt sa ngayon, panigurado ay marami muna silang ikinonsider bago nila ifinlize yang crypto involvement nila. sa tingin ko hindi naman nila masyadong kailangang sumabay nung hype, tingin ko ay kahit papaano ay magging successful itong mga 'to. At the first place, yung art naman talaga ang mahalaga sa NFT, at it seems naman na iyon yung front ng mga companies na nabanggit sa article, hindi for monetizxation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "August 31, 2023, 04:18:24 PM",
      "body": "I think mahirap sabihin na wala na ito considering marami parin namang mga platforms na nag pro-promote ng mga NFTs nila. Recently, Base Chain was open to the public and if titingnan mo yung mga company na recently launching their NFTs like Coca-Cola, Atari, etc., talagang masasabi mong hindi pa ito laos. Well, let's say bumaba yung demand, pero I think NFT as an investment or if tingnan lang natin yung riskiness nito ay wala talaga itong katuturan pero hindi lang naman diyan may pakinabang yung NFT. What if magkaroon la ito ng new innovations sa crypto? I've been with an NFT project at developing parin sila hanggang ngayon pero tinatap nila yung ibang industriya na pwedeng may silbi sa NFT.Sa tingin ko, experimental lang 'tong ginagawa ng mga telcos natin considering may mga advisors naman sila diyan for sure kung gaano ka-risky yung crypto or NFT market. Maybe, nag venture lang sila na kung saan pwede nilang magamit yung NFT feature, malay natin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 31, 2023, 11:28:09 PM",
      "body": "Sa tingin ko it is early pa rin for NFT.  Although nagkaroon ng bitter taste ang mga naunang NFT due to scams and rugpulls, maasyon naman iyan pagdating ng panahon kapag nagkaroon na ng mga legit company na magrerelease ng mga NFT like Starbucks, Globe at Smart.  Positive pa rin ako sa future ng NFT pero iyon nga lang hindi na siguro siya magfafunction tulad ng nauna nitong ginawa na naging trending  sa trades na kahit napakapangint an art ay nagkakahalaga ng milyong dollar.Magiging collectibles itong mga NFT na ito at kung magtuloy tuloy maaring magkaroon ito ng magandang value sa hinaharap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "September 02, 2023, 07:37:39 AM",
      "body": "Globe at Smart ginulat ang mundo? LOL, Kai Sotto at YouTuber content reference lang mga kabayan.Quote from: arwin100 on August 31, 2023, 04:22:42 AMSa tingin nyo maganda kayang planong to ng giant telcos na sumali sa mundo ng NFT? o sadyang huli na ang pag adopt nila since marami nang tao umaayaw sa NFT's dahil sa dami ng scams na naganap dito?.Magandang ideya yan pero hindi ba parang late na sila? Kung ako sa kanila ang gawin nila ay mag accept ng payments sa bills nila gamit ang Bitcoin at iba pang mga referred nilang cryptocurrencies. Kasi baka sakali doon pa mas maraming matuwang mga Pilipino. Pero kung NFT lang naman, tapos na tayong karamihan diyan. At bakit parang delay ang pag adopt nila? Dapat noong mga panahong sobrang lakas pa ng mga NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 02, 2023, 11:43:05 PM",
      "body": "Quote from: arwin100 on August 31, 2023, 04:22:42 AMSa tingin nyo maganda kayang planong to ng giant telcos na sumali sa mundo ng NFT? o sadyang huli na ang pag adopt nila since marami nang tao umaayaw sa NFT's dahil sa dami ng scams na naganap dito?.Nakakapagtaka talaga na ngayun pa sila pumasok sa mundo ng NFT two years ago todo hype ang NFT kahit nga yun maliliit na company ay nasa NFT, kung pumasok silang dalawa noon malamang sila ang mga lider at mapopromote nila ng husto ang NFT sa ating ga kababayan,kasi highly reputable sila at anuman ang i roll out nila na platform o project siguradong susuportahan ng kanilang mga subscribers.Hindi naman sila siguro papasok kung hindi sila nagkaroon ng feasibility study dito, malamang meron yan at meron sia nakita sa hinaharap kugn saan ang NFT ay muling puputok sa bansa natin.Iba pa rin kasi pag malalaking company na may proven track record at subscribers ang pumasok may resources sila at well funded kaya sa hinaharap tingnan natin kung puputok uli ang NFT sa bansa natin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "September 03, 2023, 12:58:48 PM",
      "body": "Quote from: serjent05 on August 31, 2023, 11:28:09 PMSa tingin ko it is early pa rin for NFT.  Although nagkaroon ng bitter taste ang mga naunang NFT due to scams and rugpulls, maasyon naman iyan pagdating ng panahon kapag nagkaroon na ng mga legit company na magrerelease ng mga NFT like Starbucks, Globe at Smart.  Positive pa rin ako sa future ng NFT pero iyon nga lang hindi na siguro siya magfafunction tulad ng nauna nitong ginawa na naging trending  sa trades na kahit napakapangint an art ay nagkakahalaga ng milyong dollar.Magiging collectibles itong mga NFT na ito at kung magtuloy tuloy maaring magkaroon ito ng magandang value sa hinaharap.Tingin ko nasa mid kaya ngalang magtitiwala paba ang mga investors sa NFT's? Given na napakalaki nilang kompanya ang tanong ano kaya ang benefits ng mga mag aavail ng NFT's nila? If maging successful ang pagpasok nila siguro maglilikha ito ng napakalaking ingay sa mundo ng crypto at siguro may short term hype ito na madadala.Quote from: robelneo on September 02, 2023, 11:43:05 PMQuote from: arwin100 on August 31, 2023, 04:22:42 AMSa tingin nyo maganda kayang planong to ng giant telcos na sumali sa mundo ng NFT? o sadyang huli na ang pag adopt nila since marami nang tao umaayaw sa NFT's dahil sa dami ng scams na naganap dito?.Nakakapagtaka talaga na ngayun pa sila pumasok sa mundo ng NFT two years ago todo hype ang NFT kahit nga yun maliliit na company ay nasa NFT, kung pumasok silang dalawa noon malamang sila ang mga lider at mapopromote nila ng husto ang NFT sa ating ga kababayan,kasi highly reputable sila at anuman ang i roll out nila na platform o project siguradong susuportahan ng kanilang mga subscribers.Siguro ngayon lang din natapos ang study nila at tingin nila may hype parin ang NFT kaya antabayanan natin to at tingnan kung may maganda bang magaganap sa pag anunsyo at pag lunsad nito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "November 22, 2023, 05:02:04 AM",
      "body": "Quote from: blockman on September 02, 2023, 07:37:39 AMGlobe at Smart ginulat ang mundo? LOL, Kai Sotto at YouTuber content reference lang mga kabayan.Quote from: arwin100 on August 31, 2023, 04:22:42 AMSa tingin nyo maganda kayang planong to ng giant telcos na sumali sa mundo ng NFT? o sadyang huli na ang pag adopt nila since marami nang tao umaayaw sa NFT's dahil sa dami ng scams na naganap dito?.Magandang ideya yan pero hindi ba parang late na sila? Kung ako sa kanila ang gawin nila ay mag accept ng payments sa bills nila gamit ang Bitcoin at iba pang mga referred nilang cryptocurrencies. Kasi baka sakali doon pa mas maraming matuwang mga Pilipino. Pero kung NFT lang naman, tapos na tayong karamihan diyan. At bakit parang delay ang pag adopt nila? Dapat noong mga panahong sobrang lakas pa ng mga NFTs.Correct mate , kung sanay nung pandemic nila nilabas to eh baka madami pang pinoy na sumakay pero sa ngayon? parang alanganin na ang pagsabak nila dahil mga investors mismo eh dumidistansya na sa mga NFT projects so I'm afraid na magiging malaki ang impact nito sa atin.tsaka ganon na din ang sanay gawin nila ang mag adopt ng cryptocurrency sa payment system nila kasi tulad nating maraming gumagamit ng serbisyo nila , halos lahat ng pinoy kahit isa man ay user nila , mapa smart or Globe kaya adopting crypto as payment will be their best action to be in crypto .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "November 24, 2023, 12:02:03 PM",
      "body": "sana nung nakaraang taon pa nila to naisip at gawin baka  sakaling nakinabang pa sila ng maayos pero ngayong taon? eh halos ampaw na ang NFT world? parang mahirapan na sila makapag venture ng magandang kitaan nito kasi mismong mga Pinoy eh dumidistansya na din sa NFT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}