{
  "id": "topic_5469794",
  "title": "Fatunad",
  "author": "Fatunad",
  "created_time": "October 09, 2023, 07:40:51 PM",
  "content": "Dota2 players/fan out there.What can you say about the current Prize pool of The international 12?Why its too damn low compared into previous years on which it supposed to be that much bigger?Whats Gaben plan behind in all of this?TI12 would be starting on;Group Stage - October 12 - October 15, 2023Main Event - October 20 - October 22 (Playoffs Weekend) & October 27 - October 29 (Finals Weekend), 2023LinkCurrent prize pool.Base Prize Pool   $1,600,000Contributed Prize Pool$1,309,865Total Prize Pool$2,909,865These numbers are really that low. If they had just released those Skins,Immortals,Arcanas instead of Compedium.Then we might be seeing huge numbers on here. So sad to see this current year of The international.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469794",
  "comments": [
    {
      "author": "passwordnow",
      "created_time": "October 10, 2023, 05:30:59 AM",
      "body": "Quote from: Fatunad on October 09, 2023, 07:40:51 PMDota2 players/fan out there.What can you say about the current Prize pool of The international 12?Why its too damn low compared into previous years on which it supposed to be that much bigger?Whats Gaben plan behind in all of this?Too low compared to the past The Internationals that we've seen but there's nothing players and participants can do right now with that as Valve is the one that's setting the prize based on the release that they do. Compendium didn't sold a lot and that's 25% sales will be taken and allocation to the TI12's prize pool and that only means that only a few people supported it compared to the past TIs with battle pass. I think that BP is more sellable than the compendium but the mistake Valve is doing is that they're going to release it after TI. I haven't followed the other esports but maybe there's something to do with the bump and relay to the counter strike 2. Although we all love both of these esports and we're playing all of it but maybe they just did a wrong decision this time and the community didn't like the response Gaben and Valve did. Who knows maybe if they'll have some surprise on the actual TI day? I'm just waiting for the release of the group stages as maybe tomorrow, list will be there.Quote from: Fatunad on October 09, 2023, 07:40:51 PMTI12 would be starting on;Group Stage - October 12 - October 15, 2023Main Event - October 20 - October 22 (Playoffs Weekend) & October 27 - October 29 (Finals Weekend), 2023LinkCurrent prize pool.Base Prize Pool   $1,600,000Contributed Prize Pool$1,309,865Total Prize Pool$2,909,865These numbers are really that low. If they had just released those Skins,Immortals,Arcanas instead of Compedium.Then we might be seeing huge numbers on here. So sad to see this current year of The international.$85,000 more for it to make it to the $3M prize pool. Very low and this is like the prize pool since TI3 which was $2.8M. But we're going to see the match happens within the next 2 days. I'll just leave it there and forget about the prize pool as the most actions are still going to be serious for this tournament for the pride of getting this year's AEGIS. That's for sure and teams are still going to push harder on this one as it's like an achievement that everyone is knocking to get despite the prize pool is low this time. Anyway mate, there are already two esports threads that has discussions about Dota 2/TI.1. ESports betting -CS:GO, DOTA 2, LOL, Valorant 2. Esports Prediction & Discussion Thread",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fatunad",
      "created_time": "October 10, 2023, 05:45:24 PM",
      "body": "Quote from: passwordnow on October 10, 2023, 05:30:59 AMQuote from: Fatunad on October 09, 2023, 07:40:51 PM=====$85,000 more for it to make it to the $3M prize pool. Very low and this is like the prize pool since TI3 which was $2.8M. But we're going to see the match happens within the next 2 days. I'll just leave it there and forget about the prize pool as the most actions are still going to be serious for this tournament for the pride of getting this year's AEGIS. That's for sure and teams are still going to push harder on this one as it's like an achievement that everyone is knocking to get despite the prize pool is low this time. Anyway mate, there are already two esports threads that has discussions about Dota 2/TI.1. ESports betting -CS:GO, DOTA 2, LOL, Valorant 2. Esports Prediction & Discussion ThreadYou cant really say that it is something that should really be forgotten because knowing TI which is the biggest event or yearly thing on Dota 2 on which every team on this esport would really be thriving and doing their very best for them to get qualified of this competition because we know that prize pool is really that something life changing comparing into the current pool which it isnt really that worth to fight for but still not that a bad amount but not really something that could really motivate you on playing your best. It is really just that like rather on being that a typical regional major event of it which Riyadh masters is really have that much bigger prize pool.We cant really be that able to avoid on pointing out our fingers on the current numbers knowing that its never been that the same comparing into those previous TI. This is really that a huge step down and i could say that players are really that disappointed too because prize pool isnt really that high to compete on which it isnt the same or i had been anticipating that it would really be that similar on year 2021where pool is really that huge and something that worth to be that fighting for and not something like this which we are accumulating just that very low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vennali",
      "created_time": "October 10, 2023, 06:31:27 PM",
      "body": "Hey! I've created a thread regarding the upcoming TI. Feel free to post there and not make multiple threads related to the same event. We'll discuss about the prizepool there as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}