{
  "id": "topic_5449756",
  "title": "Kryptowerk",
  "author": "Kryptowerk",
  "created_time": "April 22, 2023, 04:08:37 AM",
  "content": "https://www.heise.de/news/Regeln-fuer-Bitcoin-Co-EU-Parlament-besiegelt-Aus-fuer-anonyme-Kryptozahlungen-8974491.htmlIm Kern nichts Neues, nur dass jetzt die Abstimmung dafür durch ist.\"Zu dem beschlossenen Paket gehört eine Verordnung zur Übermittlung von Angaben bei Geldtransfers und Kryptowährungen, die mit 529 zu 29 Stimmen bei 14 Enthaltungen das Abgeordnetenhaus passierte. \"Das Paket beinhaltet Forderungen, die an der Realität von Crypto meilenweit (kilometerweit - ist ja EU) vorbei gehen: \"Demnach müssen alle Überweisungen von Krypto-Vermögenswerten Informationen über deren Quelle und Empfänger enthalten. Diese sind den zuständigen Behörden zur Verfügung zu stellen.\"Desweiteren tauchen Forderungen wie diese hier auf: \"Herausgeber von neuen Coins müssten künftig auch relevante Informationen zum Energieverbrauch und zu den Umweltauswirkungen vorlegen. Dies schaffe Transparenz für Verbraucher.\"Wie sich das mit dem erschaffen dezentraler Systeme in Einklang bringen soll, steht in den Sternen (und selbst die blicken ratlos).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449756",
  "comments": [
    {
      "author": "1miau",
      "created_time": "April 22, 2023, 02:15:16 PM",
      "body": "Wieder ein Grund mehr, die immer öfter schlecht recherchierte Schundseite Heise.de nicht mehr zu lesen. Wenn man zu einem Thema einen Artikel schreibt, sollte man doch zumindest die aufgestellten Kernthesen auf ihre Richtigkeit prüfen. Quote from: Kryptowerk on April 22, 2023, 04:08:37 AMDesweiteren tauchen Forderungen wie diese hier auf: \"Herausgeber von neuen Coins müssten künftig auch relevante Informationen zum Energieverbrauch und zu den Umweltauswirkungen vorlegen. Dies schaffe Transparenz für Verbraucher.\"Wie sich das mit dem erschaffen dezentraler Systeme in Einklang bringen soll, steht in den Sternen (und selbst die blicken ratlos).Nun, hätte der Autor sich die Mühe gemacht, seine Aussage vor Publikation einmal zu prüfen, hätte er herausgefunden, dass siene Aussage komplett falsch ist. Denn in der Richtlinie heißt es: Vielleicht ist der minderbemittelte Verfasser nicht in der Lage, den englischsprachigen Text zu verstehen? Auf Deutsch heißt das nämlich: QuoteDiese Verordnung gilt für natürliche, juristische Personen und andere Unternehmen sowie für die Tätigkeiten und Dienstleistungen, die direkt oder indirekt von ihnen erbracht, erbracht oder kontrolliert werden, auch wenn Ein Teil dieser Tätigkeit oder Dienstleistungen wird dezentral ausgeführt. Wo Krypto-Asset-Dienstleistungen im Sinne dieser Verordnung vollständig dezentral erbracht werden, fallen sie nicht in den Anwendungsbereich dieser Verordnung. Diese Verordnung gilt für die Rechte und Pflichten von Emittenten, Anbietern und Personen, die die Zulassung zu Handel mit Kryptowerten und an Anbieter von Krypto-Dienstleistungen. Wo Krypto-Assets keine identifizierbarer Emittent, sie fallen nicht unter die Titel II, III oder IV dieser Verordnung. Krypto-Asset Diensteanbieter, die Dienstleistungen für solche Kryptowerte erbringen, fallen jedoch in vollem Umfang unter diese Richtlinie Regulierunghttp://www.europarl.europa.eu/RegData/commissions/econ/inag/2022/10-05/ECON_AG(2022)737216_EN.pdfHeißt, echte dezentrale Kryptowährungen, wie Bitcoin, unterliegen nicht der Whitepaperpflicht. Damit ist das sogar zum Vorteil von echten, dezentralen Kryptowährungen und nichts \"steht in den Sternen, wie das mit dezentralen Systemen in Einklang\" gebracht werden soll. Hätte sich der Autor mit dem Papier beschäftigt, hätte er gemerkt, was er da für einen Unsinn schreibt. Vielleicht merkt er es noch, vielleicht aber auch nicht und er schreibselt bereits den nächsten schlecht recherchierten Schundartikel. Die Fähigkeit, das zu recherchieren, sollte man schon erwarten, wenn man den Text auf Heise.de publiziert. Aber mit Falschinformationen hetzt es sich bekanntlich besser. Das ist dann schon extrem peinlich für Heise.de. Zudem besiegelt diese Verordnung nichts das Aus von anonymen Kryptotransaktionen. Der Autor glänzt mit Unkenntnis, was \"Limit von 1000$ für Transaktionen von und zu zentralen Börsen\" bedeutet. Private Transaktionen (P2P) sind zudem gar nicht betroffen und das würde P2P ja auch überhaut nicht möglich sein, zu dokumentieren. Bei Heise scheint wohl die Bild-Strategie Einzug erhalten zu haben, die nach dem Motto abläuft: \"wen interessiert schon gut recherchierter Inhalt, wenn er keine Klicks generiert\". Insofern sollte sich Heise die Frage stellen, ob sie lieber akkurat recherchieren wollen oder ob sie lieber billig mit Falschinformationen gegen Regierung, EU etc. hetzen, wie das Klatschbatt Bild. Traurig sowas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "April 23, 2023, 04:55:15 PM",
      "body": "Oha. Traurig zu sehen, zu was heise verkommen ist.Auf jeden Fall danke für die ausführliche Zerpflückung und Richtigstellung des „Artikels“. Wurde heise.de nicht vor Jahren übernommen und hat seitdem an Qualität stark verloren? Oder verwechsle ich da was mit golem.de?Geringfügig ot, aber welche newsseite ist denn im Bereich crypto kompetent und vertrauenswürdig? Deutsch oder englisch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "April 23, 2023, 06:36:45 PM",
      "body": "Quote from: Kryptowerk on April 23, 2023, 04:55:15 PMGeringfügig ot, aber welche newsseite ist denn im Bereich crypto kompetent und vertrauenswürdig? Deutsch oder englisch.Gute aber auch schwierig zu beantwortende Frage. Je nach Krypto-Thema ist es denke ich sehr stark von jeweiligen Autor abhängig, welche Kenntnisse dieser über das jeweilige Thema besitzt, da viele Sachverhalte doch sehr komplex sind. Dann kommt es noch darauf an, wie viel Wert der Autor darauf legt, die Sachen wirklich zu Ende zu recherchieren und nicht die erstebeste, plausible Vermutung als endgültiges Ergebnis präsentiert.  Vielleicht sind bei Heise.de einige fachlich versierte Autoren nicht mehr tätig aber die genauen Details kenne ich nicht. Ich versuche immer, verschiedene Quellen miteinander abzugleichen (was natürlich auch nicht immer hilft, vor allem wenn jede seite gegenseitig die Texte kopiert). Oftmals sind einige englischsprachige Seiten da genauer aber auch nicht immer. Je nach Thema ist das natürlich auch immer verschieden. Am besten ist es immer noch, die Originalquelle zu finden oder dieser \"so nah wie möglich\" zu kommen, wenn diese irgendwo zitiert ist. Z.B. in diesem Fall der Gesetzestext, welcher bei meiner Recherche dann am akkuratesten auf einer einschlägigen Anwaltsseite (Mayer / Brown Lawyers) zitiert und analysiert wurde. Das werden auch Quellen verlinkt, was man leider bei diversen Klatschseiten sehr vermisst. Die anderen Klatschseiten waren da leider alle ziemlich wenig akkurat und in besonders üblen Fällen hauptsächlich auf Klicks aus. Das hilft natürlich niemandem.  Pauschal eine Seite empfehlen ist also schwierig und kommt immer auf den Sachverhalt an.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "May 16, 2023, 03:51:26 PMLast edit: May 17, 2023, 01:50:12 PM by mv1986",
      "body": "Nun haben wir also die finale Zustimmung der EU zu dem neuen Gesetzespaket, das ab 2024 Stück für Stück ausgerollt werden soll. Natürlich wurde auch der FTX Kollaps nochmal aufgegriffen als Grund für eine zügige Umsetzung und in Zukunft muss also, wie auch hier im Thread schon ausgeführt, der Name jedes Senders und Empfängers jeder Transaktion betragsunabhängig festgehalten werden. Was mich hier aber wundert, ist das Datum des Inkrafttretens dieser Regelung, nämlich Januar 2026. Warum so spät? Das wirft irgendwie Fragen auf, aber ich kann nicht irgendwie sinnvolle Schlüsse draus ziehen. Diese Regelung ließe sich doch nahezu im Handumdrehen umsetzen, meinetwegen ab 2024, oder übersehe ich etwas? Was mich immer wieder innerlich wütend macht, sind solche Dinge hier: \"There was also agreement on amending rules on how member countries cooperate with each other in taxation to cover transactions in crypto-assets, and on exchanging information on advance tax rulings for the wealthiest individuals.\" Quelle s.o.Ich habe versucht etwas zu finden bzgl. der Definition von \"wealthiest individuals\", konnte aber nichts finden. Das ist wieder so ein Begriff, der sich sehr dehnen lässt, ohne dass man dem etwas entgegensetzen könnte. Wenn ich also nun alles richtig verstehe, bedeutet das, dass man bspw. bei der Nutzung einer zentralen Börse auch sämtliche Wallets KYC Prozeduren unterziehen muss, von denen man etwas dorthin sendet. Das ist schon ziemlich ärgerlich und vor allem frage ich mich, wie weit das möglicherweise ausgeweitet wird in Bezug auf Kaskaden-Transaktionen. Wird es immer bei dem Wallet bleiben, das zuletzt an die Börse sendet oder werden sie irgendwann sagen, dass ich auch die Herkunft der Coins darlegen können muss, von wo aus die Coins auf mein \"End-Wallet\" gesendet wurden? Ich weiß nicht, ich kann mir da ganz viele tolle Schikanen einfallen lassen als Gesetzgeber. Aber nachdem nun also mal wieder die üblichen Gründe angeführt wurden wie Geldwäsche, Steuerhinterziehung und Terrorismusfinanzierung, sind wir doch wieder einmal bestätigt worden, dass es hier um den Schutz der Too-Big-Too-Fail Industrie geht, wie ich in meinem Post hier schon schrieb. Ich selbst habe mich auch im Rahmen mit wissenschaftlichen Arbeiten mit dem Thema Steuerhinterziehung und Verstecken von Vermögen beschäftigt. Deshalb platzt mir bei einer Sache immer ein bisschen der Kragen:  So weit so gut. Kryptowährungen können also verwendet werden, um Steuerhinterziehung zu begehen und dem Staat ach so wichtige Einnahmen vorzuenthalten. Deshalb werden nun alle Hebel in Bewegung gesetzt. Verständlich! Gabriel Zucman betreibt seit sehr langer Zeit interessante Forschung in diesem Bereich und wenn man schon die Not verspürt, jetzt sehr hart gegen Kryptowährungen vorzugehen (denn das erwarte ich ebenfalls über die kommenden Jahre), warum fängt man dann nicht eigentlich mit aller Härte hier an: Man achte auf die Relationen und Feinheiten. Bzgl. der Feinheiten habe ich das in hellblau markiert. Wir reden hier nur von Cash (oder Cash equivalents)! Also die Problematik, das Cash versteckt wird, genau das was man den Kryptowährungen bzw. den Nutzern vorwirft. Kunst, Immobilien, alles was man sich sonst noch so Wertvolles vorstellen kann, ist noch nicht einmal in diesen Zahlen enthalten. In der folgenden Grafik nochmal die Schätzungen der Summen in % vom globalen GDP, die in Steueroasen versteckt werden:Um das einfach nochmal in Zahlen zu fassen, bei einem globalen GDP von rund 100,000 Milliarden! werden über 10%, also 10,000 Milliarden = 10 Billionen USD in Cash/Cash equivalents in Steueroasen versteckt und die Zahlen sind steigend sowohl vom Global GDP als auch der Anteil in %, der versteckt wird. Man wirft also nun den Bitcoinern vor, mithilfe der Kryptowährung Gelder zu verstecken, zu waschen, schlimme Dinge zu finanzieren, unzugänglich für den Staat zu machen (Finanzämter) usw. und will deshalb alle Daten für jegliche Transaktionsgröße erheben. Also Manfred von nebenan mit einer Transaktion von 30 Euro wird genauso in die Mangel genommen wie irgendein europäischer Millionär/Milliardär und man hofft, dass das ganze jetzt auch auf Großbritannien und die USA ausgeweitet werden kann. Warum verdammt nochmal stopft man nicht zuallererst das Loch namens \"Steuerparadies\"? Ich habe kein Problem mit Regulierung per se. Aber meine objektive Meinung ist, dass Bitcoin nicht im geringsten an die Steuerparadiese rankommt, die von Grund auf für den Betrug designed und von staatlicher Seite geschützt werden. Das ist bei Bitcoin nicht der Fall und mal eben so was hinterziehen mit Bitcoin, das ist auch weit von der Realität. Bei kleinen Beträgen lohnt es sich nicht und bei großen Beträgen wird's sicherheitstechnisch kritisch. Mal so einen Austausch mit 10 BTC p2p mit Bargeld durchziehen, joa, da braucht man schon Nerven, und dann ist immer noch nichts gewaschen. Diese ganze Geschichte, die da von staatlicher Seite aufgezogen wird rund um Bitcoin ist nicht kohärent und sie steht schon gar nicht im geringsten im Verhältnis zu dem eigentlichen Problem: Fiat-Währungen in Steueroasen, die staatlich geschützt sind (Großbritannien ist einer der Vorreiter).  Wie im zweiten Bild market \"As a result, member states are deprived of important tax revenues\", kann man einfach nur den Kopf schütteln und sagen: ja dann legt los und schafft die Steuerparadiese ab. Bitcoin gehört sicherlich nicht dazu. Zuletzt möchte ich noch anmerken, dass auch der zeitliche Ablauf wie in den Grafiken ersichtlich doch so deutlich zeigt, dass diese gigantischen Vermögen verschoben wurden, bevor es Bitcoin überhaupt gab oder relevant war. Die Elite braucht Bitcoin überhaupt nicht, um Steuern zu hinterziehen. Aber nennen wir Steuerhinterziehung mal ein Privileg der Reichen und Mächtigen, dann geht es hier genau um die Aufrechterhaltung eines Privilegs, einer Option qua Macht, die nur wenigen zusteht. Denn wenn alle Zugang zu diesem Privileg hätten, dann gäbe es bald keine Renten mehr für die Reichen abzuschöpfen, weil die Ärmeren nun nicht mehr nur nach den gleichen Spielregeln spielen müssten, sondern auch dieselben Tools hätten, um die Regeln auszuhebeln. Das Ergebnis wäre Chaos und Einbuße in der globalen Produktivität. Wie ich schon in meinem anderen Post erwähnt habe, erwarte ich da doch erheblichen Widerstand gegen die Ausweitung des \"Privilegs\" auf die breite Bevölkerung von der elitären Gruppe, die sich rein über politische und finanzielle Macht definiert. Denn da hat die EU schon riesige Probleme, überhaupt das Thema Zypern als Steueroase in den Griff zu kriegen, weil die Lobby innerhalb des Europäischen Parlaments plötzlich aus ihrem Loch gekrabbelt kam, welch Wunder. Schauen wir also mal, inwieweit die EU in den kommenden Jahren die Fungibilität und Anonymität von Bitcoin untergraben wird.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "May 17, 2023, 11:06:08 AM",
      "body": "Auf Heise auch zu lesenhttps://www.heise.de/news/Bitcoin-Co-EU-Rat-stoppt-anonyme-Kryptozahlungen-und-Steuerschlupfloecher-9057677.htmlBin ja mal gespannt wie man das umsetzen will. Wie man zb. Daten aus Ami Land zb. Kraken an die EU bringt, ob das die Amis freiwillig machen werden?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "June 03, 2023, 10:47:55 AM",
      "body": "Quote from: mv1986 on May 16, 2023, 03:51:26 PM[...]Man wirft also nun den Bitcoinern vor, mithilfe der Kryptowährung Gelder zu verstecken, zu waschen, schlimme Dinge zu finanzieren, unzugänglich für den Staat zu machen (Finanzämter) usw. und will deshalb alle Daten für jegliche Transaktionsgröße erheben. Also Manfred von nebenan mit einer Transaktion von 30 Euro wird genauso in die Mangel genommen wie irgendein europäischer Millionär/Milliardär und man hofft, dass das ganze jetzt auch auf Großbritannien und die USA ausgeweitet werden kann.Warum verdammt nochmal stopft man nicht zuallererst das Loch namens \"Steuerparadies\"? Ich habe kein Problem mit Regulierung per se. Aber meine objektive Meinung ist, dass Bitcoin nicht im geringsten an die Steuerparadiese rankommt, die von Grund auf für den Betrug designed und von staatlicher Seite geschützt werden. Das ist bei Bitcoin nicht der Fall und mal eben so was hinterziehen mit Bitcoin, das ist auch weit von der Realität. Bei kleinen Beträgen lohnt es sich nicht und bei großen Beträgen wird's sicherheitstechnisch kritisch. Mal so einen Austausch mit 10 BTC p2p mit Bargeld durchziehen, joa, da braucht man schon Nerven, und dann ist immer noch nichts gewaschen. Diese ganze Geschichte, die da von staatlicher Seite aufgezogen wird rund um Bitcoin ist nicht kohärent und sie steht schon gar nicht im geringsten im Verhältnis zu dem eigentlichen Problem: Fiat-Währungen in Steueroasen, die staatlich geschützt sind (Großbritannien ist einer der Vorreiter).  [...]Das hast Du gut auf den Punkt gebracht. Ich wundere mich auch woher diese Unverhältnissmäßigkeit kommt, vielleicht nur ein geschicktes Ablenkungsmanöver der fetten Fische mit ihren dicken Offshore-Konten.Generell denke ich aber trotzdem, dass Monero u.ä. auf lange Sicht wirklich nochmal einen Schritt grusliger sind für Behörden als Cash/Fiat.Spannend wird es dann, wenn sich hier, ähnlich wie in Bezug auf Steuer, einige Staaten ein Crypto-To-Fiat Modell ohne großen KYC und ohne hohe Gebühren aufbauen. Dann haben wir das gleiche wie mit Fiat nur in Grün.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "June 04, 2023, 05:09:25 PM",
      "body": "Quote from: Kryptowerk on June 03, 2023, 10:47:55 AMQuote from: mv1986 on May 16, 2023, 03:51:26 PM~Das hast Du gut auf den Punkt gebracht. Ich wundere mich auch woher diese Unverhältnissmäßigkeit kommt, vielleicht nur ein geschicktes Ablenkungsmanöver der fetten Fische mit ihren dicken Offshore-Konten.Generell denke ich aber trotzdem, dass Monero u.ä. auf lange Sicht wirklich nochmal einen Schritt grusliger sind für Behörden als Cash/Fiat.Spannend wird es dann, wenn sich hier, ähnlich wie in Bezug auf Steuer, einige Staaten ein Crypto-To-Fiat Modell ohne großen KYC und ohne hohe Gebühren aufbauen. Dann haben wir das gleiche wie mit Fiat nur in Grün.Naja ich würde sagen vor allem in Bezug auf die unteren 90-95% der Menschen wird es in Bezug auf Monero und co (oder auch mit Bitcoin z. T.) gruseliger, weil die sich die ausgefeilten Strukturen nicht leisten können. Ansonsten muss man sagen, dass diese Konstrukte zum Verstecken von Vermögen und Hinterziehen von Steuern doch sehr ausgefeilt sind und nah an Monero rankommen. Ohne die Panama Papers oder andere Leaks hätte man doch kaum eine Ahnung und da sind Geschäftsbanken involviert, die dann einfach mal Zahlen aus dem System löschen und fertig. Da bleibt keine Spur mehr. Zudem verstecken alle ihr Vermögen an den selben Orten, was heißt, dass die Wahrscheinlichkeit sinkt für Leaks, weil sich alle einig sind. Und selbst nach nem Leak passiert doch gar nichts, weil sich die Ströme immer noch nicht nachvollziehen lassen, da X Briefkastenfirmen zwischengeschaltet sind und die Behörden keine Auskunft geben. Dann haben die Beteiligten alle Zeit der Welt Dinge verjähren zu lassen oder Geldern mit extrem guten Plänen zu waschen.Das alles trifft doch auf den normalen Bürger, der irgendwie mit Bitcoin angeblich sein Geld verstecken will, gar nicht in dem Umfang zu. Entweder braucht die Person einen offiziellen Exit, also eine anständige Börse mit KYC, oder man geht irgendwelche p2p Wege, die unendlich viel gefährlicher sind als eine Briefkastenfirma auf den Cayman Islands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "June 04, 2023, 08:44:25 PM",
      "body": "Quote from: 1miau on April 22, 2023, 02:15:16 PMWieder ein Grund mehr, die immer öfter schlecht recherchierte Schundseite Heise.de nicht mehr zu lesen. Da hast du wohl recht und gott sei dank lese ich dort schon lange nichts mehr was Artikel bezüglich Krypto betrifft.Ob das beschloßene wirklich das aus für bestimmte Krypto Coins und projekte ist das steht noch in den sternen.Was anderes wäre es wenn es Weltweit beschloßen würde dann könnte man sagen das gewisse Coins am Ende sind.Wie und wann es weiter geht und was noch kommt ist ab zu warten , unsere und die EU Politik braucht immer etwas länger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}