{
  "id": "topic_5416371",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "October 08, 2022, 06:09:40 AM",
  "content": "Can free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416371",
  "comments": [
    {
      "author": "malcovi2",
      "created_time": "October 08, 2022, 06:17:14 AM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? The hype is already gone if it was the beginning of the NFT craze probably most of those free nfts will jump in value. Even the NFT that has a minting cost is a huge gamble it can tank once it will be listed in the NFT marketplace.If the NFT has a good usecase/utility maybe its a good to claim since its free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "October 08, 2022, 07:20:23 AM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? I can but it will give you only pennies. Free NFTs were garbage NFTs have no value unlike gaming NFT that may give you a few bucks. Free NFTs were only a way for developers to attract the demand for free. Remember that when you are getting free NFTs and then you shall mint it and that means if you must pay the fees to get your NFTs. Free NFTs are not even worthy these days to be collected. Free NFTs were only wasting your money and time. I just curious why people are still collecting garbage free NFTs. they were betting with their luck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "October 08, 2022, 07:22:58 AM",
      "body": "NFTs is just like a normal shitcoin when ever you are given a free airdrop tokens and have not listed in any exchange it can be considered worthless till they listed in an exchange then you can trade for valuable asset. I could remembered then early 2018, there were some free airdrop token given to me but no value till date, so most of the NFTs can be seen such way, no doubt there are some that can be found valuable though if the projects furthers their development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "October 08, 2022, 07:25:03 AM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? \"If you don't pay for the product, then you are the product.\"Of course they are a waste of time. Buy getting them free NFT's you are promoting them for free. Creating trading volume, talking about your free pixels, creating all kinds of activity. When some other fool sees that fake/free activity on that token, he will spend his money on it and that will hopefully trigger a chain reaction. At least that's what the owner of the project hopes. Obviously he holds majority of the tokens and givng away maybe 1-2% of the total supply. Which means you are working for free to make the owner rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "October 08, 2022, 08:02:40 AM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? NFT Hype is over, so it is obvious that free NFT are of no worth. Also, those who are buying NFTs are just wasting time as it will be difficult for them to sell them expensively. However, if you have free time, then you may claim free NFT and hope one day they will gain good value. I think in the next bull market, NFT hype will again prevail, so it's not bad if you collect some free NFTs, but make sure you do this in your free time, so in case those NFTs don't have value, you do not regret it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 08, 2022, 08:39:11 AM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? No, these are just like airdrops of ICO coins before, they are never worth the effort. You may be right, it's a waste of time. There may be those who got lucky when it was all in the hype a year ago but right now it's difficult to find value in giveaway NFTs. I'd rather grind my way to create a valuable NFT like in MMORPG games where you have the luck to get a rare item that are sellable to the market where gamers would really buy it in just a short amount of time after you put it on sale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "October 08, 2022, 08:44:44 AM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? Yes, the free mint NFT trend is becoming very hot, those who regularly use Twitter can see that the keyword free mint is being searched a lot. Can say that there are very valuable things that can be profitable and there are NFTs that are just trash, one of the NFTs that I've made a profit on recently is reddit's NFT collection, it's not very profitable but 3x profit during bear season is pretty good. I don't think NFT is dead just because we're in bear season so the hype has cooled somewhat but going forward NFT will still have a small niche to grow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptobadshah",
      "created_time": "October 08, 2022, 09:43:21 AM",
      "body": "I agree i think free NFTs waste a time, but some time gain good profit Free NFTs make obtaining non fungilbe tokens easy being cautious is a plus free Nfts are tricky most projects fail to deliver on their promises digital objects require some attention cash in your free Nfts especially game-based ones. Nonfungible tokens are risky because of scammers verify the Nft project's legitimacy to safeguard your safety learn about their team if the project seems shady their free nfts may be tainted therefore never share your seed phrase etc never open unfamiliar files once you're sure about the project you can start the giveaway or airdrop false Free Nfts have been legit and fraudulent Many projects merely use nfts to raise awareness and involement the market has scams and risks also free nfts If you ensure the project's safety you won't have to worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 08, 2022, 09:50:21 AM",
      "body": "I think everyone know about Mona Lisa painting right? why this painting is worth for huge money? this because only Leonardo da Vinci can create that's painting. Now can you imagine if everyone can paint Mona Lisa and the results all of them are same? it will become worthless since everyone already have it on their home.Free NFT is similar like those worthless paint since it's doesn't unique at all. Even the pricey NFT aren't actually a good NFT and we should buy it in order to sell it more higher since there's a possibility if you get tricked by a whale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 08, 2022, 10:02:17 AM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? I have never claimed any of the free NFTs even on its height. But if you think that there's a good value from those that distributes it freely then it's your time that you'll use so, claim it if you want to. But if you have the same thought as me and the others that it's a total waste of time, you better allocate your time for something else that's more worth it than of those free/airdrop NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "October 08, 2022, 10:18:03 AM",
      "body": "Quote from: livingfree on October 08, 2022, 10:02:17 AMQuote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? I have never claimed any of the free NFTs even on its height. But if you think that there's a good value from those that distributes it freely then it's your time that you'll use so, claim it if you want to. But if you have the same thought as me and the others that it's a total waste of time, you better allocate your time for something else that's more worth it than of those free/airdrop NFTs.Based on what I read before there are many user here in forum that participating in free NFT or Let say Airdrop. But not all they earn some money because not all projects or site that they participated is legit because other projects are scam projects that will leave you in the end of the projects. But the positive is that some are earn an enough money that they feel happy in the end of the projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "October 08, 2022, 11:13:38 AM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? Free NFT? I guess I haven't been able to get it because it's often too late to claim that free NFT.But I wonder what is the use and value of the NFT because I see the price of NFT is unreasonable.But indeed, the NFT trend can attract people to try to get it even though they have to compete with others.And it's also possible that the NFT trend will return to better shape in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 08, 2022, 12:28:24 PM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? If the NFTs have interesting real use cases and fundamentals rather than just a simple JPEG or collectible, then it’s worth having it. In some NFT groups that I belong where some have availed the free mint, they did sell it successfully with a decent floor price or so. But I would rather mint a free NFT that is unique, out of the box and attractive in the eyes of the collectors aside from its real use cases and fundamentals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "October 08, 2022, 12:40:00 PM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? If you are referring to NFT token giveaways, never think it has a market value but rather think it was another shitcoin token arriving in your wallet. Please keep in mind that it was hard to believe those giveaways and free tokens now. I discourage you from participating in this for this is just a waste of your time and worthless. For many years that I have been here in crypto, I've seen how the market changed. We can see bounties, giveaways, and airdrops are good before but for now, you can no longer expect them anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "October 08, 2022, 12:50:58 PM",
      "body": "Quote from: fzkto on October 08, 2022, 07:04:28 AMQuote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? There are probably some NFTs that can make a profit in the future, but if it's a free hand, you should have a 1 in 1000 chance of getting lucky. I also think that picking up free NFTs is a waste of time, just like free airdrops back in the day. It's either the lucky ones or those who are good at it that get lucky.Compare to those with airdrop token is somewhat different since sometimes we can really see some actual value which we can really earn from airdrops compare to free mint NFT's since from this we need to seek for buyerd before we can possibly earn on our free minted NFT's but we cannot expect to get any value because most of the free can only be sold for $1 or even no value at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 08, 2022, 01:25:02 PM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? I think it's the thing of the past but for now those can be rarely discovered unless it came from best team in the market, I mean a known personality or known project itself. Probably you have been into the not so good projects and not that active, that's why you're that salty on those NFTs you got, if it's free then there's nothing to worry about since you haven't invest in it. I wouldn't mind if it's free as long as I know I haven't invest in it aside from the time. We will never know, some things are meant to comeback though and NFTs are here to stay if I were to be asked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaliLinux",
      "created_time": "October 08, 2022, 01:37:49 PM",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day? Even if they do make a comeback as you claim, I don't see those free NFTs as such that will be very profitable. Most people believe that even the NFTs market was even over-hyped when it trended considering the amount some of them cost. You can create and price any picture or art however you wish as an NFT and only if you actually have someone with an interest in it along with its price can you really make something from it, so I kinda doubt how much all those free NFTs can bring.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ararbermas",
      "created_time": "October 08, 2022, 01:53:02 PMLast edit: October 08, 2022, 03:12:14 PM by Ararbermas",
      "body": "Quote from: Crypt0Gore on October 08, 2022, 06:09:40 AMCan free NFTs still make you money? I don't bother to claim free NFTs anymore because I have many that has no good use and value, also NFTs is tanking right now than shit coins, do you still claim free NFTs and are they worth anything? Maybe NFTs will make a comeback some day?  if it's effortless mate and free so why not if there are some sites or projects that giving NFT's  because what if in the future they grows and surge like what happened to some popular NFT's projects nowadays.? You will be profitable without knowing...Lol so i will be greatful always if i found some sites giving their NFT's for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "October 08, 2022, 02:02:26 PM",
      "body": "The developers will be so dumb if they will be giving valuable NFT for free. The main aim to give free NFT just to get mass attention from the crypto users. Remember when a project was doing airdrop and this will attract so many hunters that will be starting to spam any place with such airdrop. The developers were also giving requirements to be eligible to receive the airdrop which was always following and retweeting their tweets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}