{
  "id": "topic_5419865",
  "title": "Merit.s",
  "author": "Merit.s",
  "created_time": "November 07, 2022, 07:49:19 PM",
  "content": "I guess this is a strategy for someone who wants to invest on Bitcoin for a long term but is scared of waiting  for too long.So many persons will want to invest on Bitcoin for a long term  but they end up find it difficult to have the patience on their investment and wants an instant shoot up of Bitcoin price,in other for them to sell and make profit,they end up been disappointed when it doesn't go as they wanted it since they don't understand the cyclic movement of Bitcoin. They end up procrastinating they will invest and some that have already invested will get fustrated when Bitcoin is in it bear market by selling their bitcoin.  My suggestion to these set of people is that we should invest on Bitcoin for our children from infantry to teenage. In my country people starts planing for the future of their children from the moment the child is put to bed. Family and well wishers gives money to the child when they come to visit the new born baby to express their happiness for what God has done. Some parents the moment they give birth to a child they open a bank account for the child so that every month from their income they put some fraction of money to the child's account. Some money been given to the child during his birthday celebrations and other ceremonies or visit they always put it into the child's account in other to secure the child's future.  When this child becomes a teen in high school this money must have accumulated to a reasonable amount which is used to support the child to either further his education,start up a trade or learn a skill. Fiat currency is fast depreciating because of inflation, why don't you buy Bitcoin Holdings for your child from infant and do all his savings in Bitcoin so that by the time the child becomes a teenager,  Bitcoin price might have hit $500k and above. This way you can have a long term holdings in Bitcoin.What is your opinion on my suggestion, is it a guarantee for the child's future and will  enable you to benefit from Bitcoin ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419865",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "November 07, 2022, 08:00:18 PM",
      "body": "Someone who is struggling with patience needed to wait on an investment to mature, would struggle to hold onto an asset for their children over a number of years.Bitcoin should ideally be non custodian, so they would just be buying a hardware wallet, funding that with a certain amount of Bitcoin and storing it securely, also backing up the seedphrase. This means they (the parents) always has access to the bitcoins and can spend it at any time, which they would do, if they don't have the mental fortitude to let an asset grow.If one cannot effectively wait out an investment to grow, then maybe they should not be investing at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "November 07, 2022, 08:18:21 PM",
      "body": "Quote from: Merit.s on November 07, 2022, 07:49:19 PM<snip>This way you can have a long term holdings in Bitcoin.What is your opinion on my suggestion, is it a guarantee for the child's future and will  enable you to benefit from Bitcoin ?  This is the perfect idea for a long time bitcoin savings but there is some problems in your idea one of which is discipline. For your idea to be actualized, there must be high level of discipline in the aspect of the parents. Even people doing that kind of scheme with banks are always disciplined and will not withdraw the money because of circumstances. Again, the deposit must be consistent in order to build the account for a long period of time.Hoeever,  the future cannot be predicted. Who knows that before the child could grow there will be nothing like bitcoin anymore, or there could be another version of cryptocurrency that will displace Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "November 07, 2022, 08:28:44 PM",
      "body": "The idea isn't bad lol. Due to our greed and panic, we can't hold Bitcoin properly. But if you store Bitcoin for your child and don't touch it until becoming a teen then would be a good way to hold it. But for ourselves, we can take advantage of the volatility. For example, those who hadn't sold in ATH regret it now. If they sold then they can accumulate double the Bitcoin right now. And of course, some people become Panic those who are selling now. So yea, the idea is good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "November 07, 2022, 08:33:08 PM",
      "body": "Quote from: KingsDen on November 07, 2022, 08:18:21 PMQuote from: Merit.s on November 07, 2022, 07:49:19 PM<snip>This way you can have a long term holdings in Bitcoin.What is your opinion on my suggestion, is it a guarantee for the child's future and will  enable you to benefit from Bitcoin ?  This is the perfect idea for a long time bitcoin savings but there is some problems in your idea one of which is discipline. For your idea to be actualized, there must be high level of discipline in the aspect of the parents. Even people doing that kind of scheme with banks are always disciplined and will not withdraw the money because of circumstances. Again, the deposit must be consistent in order to build the account for a long period of time.Hoeever,  the future cannot be predicted. Who knows that before the child could grow there will be nothing like bitcoin anymore, or there could be another version of cryptocurrency that will displace Bitcoin. There's always a risk no matter what or which side you would really be focusing into.This is why it would really be more ideal if you both do things which you had allocated up some savings or investment with Bitcoinor some crypto and at the same time you do save up some fiat on your bank or having other physical business.Diversify as much as you could because as just been said that future is uncertain which means thateverything could happen along the way and it would really be just right that you would be finding up lots of alternatives which you could really make yourself something that able to survive when it comes to inflation and other related things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "November 07, 2022, 08:59:27 PM",
      "body": "The same degree of risk remains for those who keep the seed words, whether it is the key to their savings or the savings of their children. From an investment point of view, there is no problem in preserving the savings for the children in the form of investment assets, but the most important question remains, how do we ensure that our children will get what we saved for them in the event we die before handing them over their private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "November 07, 2022, 09:02:56 PM",
      "body": "Quote from: carlfebz2 on November 07, 2022, 08:33:08 PMQuote from: KingsDen on November 07, 2022, 08:18:21 PMQuote from: Merit.s on November 07, 2022, 07:49:19 PM<snip>This way you can have a long term holdings in Bitcoin.What is your opinion on my suggestion, is it a guarantee for the child's future and will  enable you to benefit from Bitcoin ?  However,  the future cannot be predicted. Who knows that before the child could grow there will be nothing like bitcoin anymore, or there could be another version of cryptocurrency that will displace Bitcoin. There's always a risk no matter what or which side you would really be focusing into.This is why it would really be more ideal if you both do things which you had allocated up some savings or investment with Bitcoin...everything could happen along the way and it would really be just right that you would be finding up lots of alternatives which you could really make yourself something that able to survive when it comes to inflation and other related things.There's always a risk according to you, but the level of risk differs and there is a clear cut difference between a calculated risk and an uncalculated one. That is why I really support his idea. It seems something genuine and worthy to be tried. Then it is good to invest what one is able to lose on the long run, or what someone would not what to tamper with in the future. If things work right, one could have a millionaire child at the age of 10 or 15.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 07, 2022, 09:13:14 PM",
      "body": "This is certainly a great idea to HODL for long. But my issue is security. Since seed phrases or private keys are to be kept save then only trusted people could have access to it. Now what if an unplanned circumstance happens like death to the seed holders and  no one was given the phrases before they passed on how can this be rectify? What will also happen if the investors country made strong hold against bitcoin before the child comes off age. What will happen to the coin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "November 07, 2022, 09:53:45 PM",
      "body": "OP's idea is not bad at all especially in the long term bitcoin investment is one of the most recommended. I don't really have a plan like this yet, but maybe I will be willing to do it when I have enough funds in the next 2 years or when my child is born.Even if you or others don't have children yet, then investing in bitcoin in the long term is the best thing. We know the price history, we know the prices are heavily discounted so I think it's good to try long term investment ideas like these.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bhooscream",
      "created_time": "November 07, 2022, 10:31:34 PM",
      "body": "Quote from: Merit.s on November 07, 2022, 07:49:19 PMI guess this is a strategy for someone who wants to invest on Bitcoin for a long term but is scared of waiting  for too long.When investing in Bitcoin, why should be scared of waiting for a too long period? Actually, we ourselves can make our own time management of our investment period. Commonly, the investment will start when the price is lower enough in the bearish era and then hold them for at least until the next bullish era, so we can meet the ATH. From several ears, we can exactly get profits from holding Bitcoin. Whatsmore, if we are investing for a longer time period, this may also rise up the profits to higher, but of course, the key is patience. If we are not patient enough and we get panic so easily, long-term investment will not work properly for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "November 07, 2022, 10:46:35 PM",
      "body": "Parents know what's best for their children and having that thinking to keep up bitcoin until they grow up is I'm sure what many have been thinking. And while others are thinking about it, there are others that have already applied this technique and principle because they're believers and at the same time good parents that are thinking of the future of their children. For those that are scared as you've said, bitcoin or any other investments that are for the long term aren't for them. They still have a choice to short bitcoin if they want to and if this isn't their appetite to hold for such a long time. This is the beauty of investing in bitcoin, if you're long, you're in. And if you're not for that, you can short and you're still in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "November 07, 2022, 11:06:41 PM",
      "body": "This is a best thing a parent can do for his child. I did this, but when I was in need I wasn't able to hold it longer. When we save for the kids, it should be left for their future needs. I'm sure this will benefit the kids, but it needs the right way of holding as well as the kids need to be taught about it rather than just saving for them.Investing in bitcoin is always the best choice considering the inflation and the return it can provide in the long term. There is risk associated with it, to the risk we take it gives the return that other investments can't provide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 08, 2022, 02:36:21 AM",
      "body": "Quote from: Merit.s on November 07, 2022, 07:49:19 PMI guess this is a strategy for someone who wants to invest on Bitcoin for a long term but is scared of waiting  for too long.-snip-My suggestion to these set of people is that we should invest on Bitcoin for our children from infantry to teenage.If they are real investors, they should have enough patience to wait for the completion of their investment plan. To have such patience, they must have solid plans for their capital beyond the capital part is used for Bitcoin investment and for their expenses in life without the need to touch their bitcoins.Most of people don't have such plans and they are not actual investors but really are speculators. No plans, no patience and worse no solid belief that is based on knowledge, they will sell when they are panic or need money for expenses in life.If they can not not invest for themselves, they can not invest for their child.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 08, 2022, 03:34:02 AM",
      "body": "It's important to tell your child where you hide your seed phrase when he's get older. Anyway you should teach him about Bitcoin and let see what his reaction, if he's not interested with Bitcoin, of course this will make you in trouble. Usually most people don't care with privacy and when they got a huge money, they will spend to buy anything that they want including the luxury stuff. Your investment can make your child happy, but your child doesn't use it properly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "November 08, 2022, 04:03:45 AM",
      "body": "Quote from: romero121 on November 07, 2022, 11:06:41 PMThis is a best thing a parent can do for his child. I did this, but when I was in need I wasn't able to hold it longer. When we save for the kids, it should be left for their future needs. I'm sure this will benefit the kids, but it needs the right way of holding as well as the kids need to be taught about it rather than just saving for them.Investing in bitcoin is always the best choice considering the inflation and the return it can provide in the long term. There is risk associated with it, to the risk we take it gives the return that other investments can't provide.Investing for the long term future of your kids is a good idea, but just as you discovered it is very difficult to actually be able to hold your coins for such a long time because there is always something which could happen which could force you to sell your coins.So it is important to keep a balance between the amount you save for the future of your kids in the form of bitcoin and your expenses, as it can be very demoralizing to sell something which you know is so important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "November 08, 2022, 04:27:51 AMLast edit: November 08, 2022, 06:15:20 PM by Marvell1",
      "body": "My son's 4th birthday is a week away and I've been thinking about this idea as well. Actually, I opened a savings account for him when he was 2 years old but the current savings I have for him is gold, not fiat or Bitcoin. Although they are not much since I don't save often, I just save them for him whenever I have a little extra in my pocket. And I came up with the idea of saving in Bitcoins when he and I were making Bitcoin pumpkins, I discussed with my wife a few days ago, I decided to save more for him but this time it's Bitcoin. I am a Bitcoin investor but I like both gold and Bitcoin and I want to diversify his savings because if I just save gold everything will be fine but wont be able to give him a decent amount of money when he grows up so I will add one more option which is Bitcoin. I'm asking a friend of mine to buy a hardware wallet to start saving but it probably won't make it in time for his birthday, as it takes up to 30 days to ship to my area.He seems very interested in my physical Bitcoins. I don't know if he grew up as passionate about Bitcoin as I was but now I want to do something that ties him to Bitcoin.He takes it out to play every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "November 08, 2022, 05:20:12 AM",
      "body": "Quote from: Zaguru12 on November 07, 2022, 09:13:14 PMThis is certainly a great idea to HODL for long. But my issue is security. Since seed phrases or private keys are to be kept save then only trusted people could have access to it. Now what if an unplanned circumstance happens like death to the seed holders and  no one was given the phrases before they passed on how can this be rectify? What will also happen if the investors country made strong hold against bitcoin before the child comes off age. What will happen to the coin?If you have planned for your future safety then bitcoin investment is best in the name of your children as you can put investment with DCA investment also but if you say about security of seed phrase then you need to safely backup them up because once you loose it all your funds will be gone in a while.But there are ways like seed washers or engraving them on metal plates which can survive extreme conditions and keeping your seed phrase safe as many have done because you need to responsibly make sure it's safe until you have those funds in your wallets and child don't use it.This is main concern but if you take precautions you can safely keep your funds in your wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rodskee",
      "created_time": "November 08, 2022, 05:46:33 AM",
      "body": "Not totally the same . but some of us has this nowadays , Like me ? i am holding small amount of Bitcoin for my Son college studies , since he is still 6 years from turning into colleges so i still have plenty of years to keep it for Him.I am buying small amount each week to keep in His wallet(that My wife keeps on hold) so in time of Him? there will be enough funds to cover His expenses .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "November 08, 2022, 07:53:08 AM",
      "body": "Quote from: Merit.s on November 07, 2022, 07:49:19 PMWhat is your opinion on my suggestion, is it a guarantee for the child's future and will  enable you to benefit from Bitcoin ?Why not, this is a good idea to build some portfolio for your kids at a very young age. If you are buying bitcoins for yourself, why not do so for you kids as well? At the moment banks are offering a lot of new savings schemes that are designed for young parents and grand parents. My parents where offered multiple savings accounts that lock you in for 18 years and then will be paid out to the child when it becomes of age. These schemes are designed to be able to pay for a new car, or university later. The big problem I have with them is that they cost a lot of commission today and offer almost no good interest rate in the long run. So why do you need the bank in the first place? To me it seems much better that you take care of the saving yourself and don't pay the bank for it. This gives us a lot of flexibility and we are not limited to save in only one account. When it comes to long periods of time I would recommend to invest in more risky assets. Putting some of the money in crypto currencies is a great idea, same goes for investment and real estate funds. Over 18 years all these products are going to offer better returns than a savings account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "November 08, 2022, 08:04:00 AM",
      "body": "The OP's mentioned plan has been on my mind for a long time when my son was born and is not yet a year old, and mine isn't until I reach my teens because that would take a very long time. And I also don't know if I can last that long because the temptation will be a lot.and I plan for 4 or 5 years when he starts studying or kindergarten for me to use during school and other needs, and that doesn't mean I don't keep buying and investing because I will continue to do so and only separate for the needs of my child 4 or In the next 5 years, because I see the needs of children are very large, what else in the future and also requires large capital and I have thought about this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}