{
  "id": "topic_5439403",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "February 10, 2023, 11:47:42 PMLast edit: December 24, 2024, 11:01:44 AM by pawel7777",
  "content": "Just came across this and thought I'd share. Apparently those bad boys are now going for ~£100 each as collectibles. I knew this will happen eventually I remember paying £10 (incl. postage) for mine in 2014, so that's an impressive return of over 25% p.a.But I'm not selling. Ever.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439403",
  "comments": [
    {
      "author": "kano",
      "created_time": "February 11, 2023, 01:59:32 AM",
      "body": "I have one of the first ones, they sent me in a box with a ribbon on it  (that I still have)Not gonna sell it thought.Funny that they'd prolly make less than 1c a year but people will buy them and try to mine with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "February 11, 2023, 06:59:57 AM",
      "body": "It's great that bitcoin mining devices such as USB Asic become items for collectors, this is the same thing that happened for example with the first copies of Nintendo, but it seems to me that the time has not yet come for Asic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "February 11, 2023, 11:40:25 AM",
      "body": "Quote from: pawel7777 on February 10, 2023, 11:47:42 PMApparently those bad boys are now going for ~£100 each as collectibles. I knew this will happen eventually Anyone can attempt to sell old ASIC at high price, but i have doubt there are any buyer for it. There are too many variant of USB miner out there and Bitcoin mining isn't very popular even among Bitcoiner, while casual hobbyist would prefer newer USB miner such as Compac F.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "February 13, 2023, 02:09:42 AM",
      "body": "I just hope there is bitcoin mining hardware museum   and be part of history. I remember I had USB miner called USB Dragon it from china and have 1 Mh/s bulky looking and very hot and comes with 8gb of storage",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "February 13, 2023, 11:13:24 PM",
      "body": "Quote from: ETFbitcoin on February 11, 2023, 11:40:25 AMAnyone can attempt to sell old ASIC at high price, but i have doubt there are any buyer for it. There are too many variant of USB miner out there and Bitcoin mining isn't very popular even among Bitcoiner, while casual hobbyist would prefer newer USB miner such as Compac F.That's true that anyone can set any price they want, but all listings for this type of miners were broadly in a similar range, while newer generations (but still obsolete) were notably cheaper. Some of them had some sales iirc (I haven't done any proper research on it though, just a quick check). That could be a sign that the collectors' market could be slowly shaping in. Of course, there's no chance for any massive demand, probably just sentiment buyers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "February 14, 2023, 12:07:33 AM",
      "body": "Quote from: ETFbitcoin on February 13, 2023, 10:12:34 AMSuch museum is exist, see https://bitcoinminingmuseum.com/. There are 2 topics on this forum which discuss this museum,Meet the world's first Bitcoin Mining MuseumRe: Is it worth collecting old ASIC miners?Dude you are really bring back my memories I just saw the gallery and found back the old times miner like gridseed, Zeus, and SpoondoliesQuote from: ETFbitcoin on February 13, 2023, 10:12:34 AMI think you wanted to say 1 GH/s (not 1MH/s).My bad it is actually only 144Khs and has Scrypt Algorithm Maybe you never seen in one  Here the picture",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maxre",
      "created_time": "March 18, 2023, 11:52:09 AM",
      "body": "My Friend  had Antminer S9 pro and at that time it was super good and He was making A lot of money from this. And also at that time I do not have enough resources to buy this. I tried my best to get loan from banks and they didn't give because I was Student and have had no any backup and I regret this till now. And It brothers me sometimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "March 18, 2023, 12:16:16 PM",
      "body": "Quote from: Maxre on March 18, 2023, 11:52:09 AMMy Friend  had Antminer S9 pro and at that time it was super good and He was making A lot of money from this. And also at that time I do not have enough resources to buy this. I tried my best to get loan from banks and they didn't give because I was Student and have had no any backup and I regret this till now. And It brothers me sometimes. Yeah, you had no chance of getting a loan from a bank without an income and if you told them it was for the purpose of bitcoin mining - you would make it even worse.At least you tried.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boakse",
      "created_time": "March 18, 2023, 01:49:41 PMLast edit: March 18, 2023, 05:06:44 PM by Boakse",
      "body": "Yep, but only the first ones made...I have one bnib Asicminer block erupter (never used, only tested once) andone bnib BFL jalapeno miner (tested twice-three times, by me) = brand new, with box etc.update; because of reading this post, I just took my old BFL Jalapeno of the shelve to give it a good dust of...Whew, it was dusty, just from standing around and looking in the chamber.Good to know, the original box was there to comfort him I have these for my collection, so to hodl, but I see no reason ever selling them, because I don't think these will be worth SO MUCH to make it tempting to sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boakse",
      "created_time": "March 18, 2023, 05:28:12 PMLast edit: March 18, 2023, 05:48:29 PM by Boakse",
      "body": "And I also found my old 60GH Avalon Mini TP-Link TL-WR703N controller.The miner itself (back then) was complete broken, I could only \"rescue\" the controller, for spare parts.And strange thing is; This Avalon miner had the same GUI interface, as the future coming Antminer S1 tm S9...  So WHO was first using this \"Antminer\" GUI interface??  Was it Avalon or Bitmain??Old cool stuff, maybe not a \"real\" USB miner, but old it is...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 18, 2023, 06:14:56 PM",
      "body": "Quote from: pawel7777 on February 10, 2023, 11:47:42 PMJust came across this and thought I'd share. Apparently those bad boys are now going for ~£100 each as collectibles. I knew this will happen eventually -snip-Wow, the prices are really amazing. Didn't think that so much money would be asked for these old usb block erupters. But it reminds me of the good old days. I still have 10 of these miners that I bought here in the forum back then. For me these block erupters are a nice memory and I will never sell them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ANSEL_2.0",
      "created_time": "March 22, 2023, 07:01:00 PM",
      "body": "Quote from: CoinEraser on March 18, 2023, 06:14:56 PMQuote from: pawel7777 on February 10, 2023, 11:47:42 PMJust came across this and thought I'd share. Apparently those bad boys are now going for ~£100 each as collectibles. I knew this will happen eventually -snip-Wow, the prices are really amazing. Didn't think that so much money would be asked for these old usb block erupters. But it reminds me of the good old days. I still have 10 of these miners that I bought here in the forum back then. For me these block erupters are a nice memory and I will never sell them.  Is there anything these USB miners are still good for? Can someone run SOLo mining with them? Assuming one have up to good numbers of the USB miners will it make any sense running them for possible luck solving a block or two one day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "March 22, 2023, 08:34:50 PM",
      "body": "Quote from: CoinEraser on March 18, 2023, 06:14:56 PMBut it reminds me of the good old days. I still have 10 of these miners that I bought here in the forum back then. For me these block erupters are a nice memory and I will never sell them.  Same, I don't plan on selling mine ever. It's a part of history and it has a big sentimental value. I don't think anyone who has never mined any bitcoins would be as passionate about it as people who have.Quote from: ANSEL_2.0 on March 22, 2023, 07:01:00 PMIs there anything these USB miners are still good for? Can someone run SOLo mining with them? Assuming one have up to good numbers of the USB miners will it make any sense running them for possible luck solving a block or two one day.I don't think they're too good for solo mining. Not sure if there's even any software available that would support that. Plus, there are many newer generations USB miners (also obsolete) that would give you much higher chances of finding a block than these first-generation ones. And the first-gen seem to be more expensive than the newer, more efficient ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "March 23, 2023, 07:33:49 AM",
      "body": "I was planning to buy some USB miners in 2018 and they go obsolete very fast, as expected, how powerful can USB miners be compare to a Asic miner? The difference is like night and day, we will never see anything like this again because the Bitcoin mining difficulty is now huge, even latest Asic miners are trying to keep up, maybe there is hope once new technology get released that brings lower power consumption, like the new 4nm microchip.The harder it is to mine bitcoin the more the value will grow, and now that we are close to the 21 million max supply Bitcoin will be nailed the real digital gold sooner or later by those who badmouthed the currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "March 23, 2023, 10:54:16 AM",
      "body": "These prices are crazy and honestly this is the real bitcoin bubble. Doesn't make sense to buy such stuff as collectible if you can get current miners for similar prices. You can then use them and in a few years they are also \"collectible\". But people are stupid enough it seems to spend money on anything.Quote from: kano on February 11, 2023, 01:59:32 AMFunny that they'd prolly make less than 1c a year but people will buy them and try to mine with them.Yes and they will 100% get at solo block with them (at least if they think hard enough they will)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 23, 2023, 01:54:52 PM",
      "body": "Quote from: ANSEL_2.0 on March 22, 2023, 07:01:00 PMQuote from: CoinEraser on March 18, 2023, 06:14:56 PM-snip-Is there anything these USB miners are still good for? Can someone run SOLo mining with them? Assuming one have up to good numbers of the USB miners will it make any sense running them for possible luck solving a block or two one day.No, definitely not these usb miners. They are just really too slow and it makes no sense. Even with the current usb miners, the chances of finding a block are very slim. It's certainly possible, but as I said, the chances are slim. Therefore, I cannot recommend anyone to buy such usb block erupters miners.  Quote from: pawel7777 on March 22, 2023, 08:34:50 PMQuote from: CoinEraser on March 18, 2023, 06:14:56 PM-snip-Same, I don't plan on selling mine ever. It's a part of history and it has a big sentimental value. I don't think anyone who has never mined any bitcoins would be as passionate about it as people who have.Yes, I think so, too. You have to have been there, then you understand the sentimental value.  Quote from: hZti on March 23, 2023, 10:54:16 AMThese prices are crazy and honestly this is the real bitcoin bubble. Doesn't make sense to buy such stuff as collectible if you can get current miners for similar prices. You can then use them and in a few years they are also \"collectible\". But people are stupid enough it seems to spend money on anything.If I remember correctly, these usb block erupters were the first asic miners for bitcoin. That makes them something special, but either way the prices are not justified.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "March 23, 2023, 02:07:32 PMLast edit: March 23, 2023, 05:07:40 PM by NotFuzzyWarm",
      "body": "Quotef I remember correctly, these usb block erupters were the first asic miners for bitcoin.No, they were the 1st USB stick miners for BTC. They were put together by Friedcat using ASIC's made by Canaan who created the 1st BTC ASIC chips in 2013. Those 1st chips were used in much larger miners like today's are.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 23, 2023, 03:33:37 PM",
      "body": "Quote from: NotFuzzyWarm on March 23, 2023, 02:07:32 PMNo, they were the 1st USB stick miners for BTC. The were put together by Friedcat using ASIC's made by Canaan who created the 1st BTC ASIC chips in 2013. Those 1st chips were used in much larger miners like today's are.Ah okay. So that's how it was. I wasn't sure anymore because it was quite a long time ago. In any case, thanks for the correction. They were first in something, I just wasn't sure in what.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dockin",
      "created_time": "July 02, 2024, 02:54:23 PM",
      "body": "Quote from: NotFuzzyWarm on March 23, 2023, 02:07:32 PMQuotef I remember correctly, these usb block erupters were the first asic miners for bitcoin.No, they were the 1st USB stick miners for BTC. They were put together by Friedcat using ASIC's made by Canaan who created the 1st BTC ASIC chips in 2013. Those 1st chips were used in much larger miners like today's are.That's correct, they were the the first 1st USB stick miners for BTC created by a company called ASICMiner (friedcat) in May of 2013. This used the first generation ASICminer chip, the BE100. It was a 130nm ASIC designed by the company, which was mostly just friedcat.Friedcat did not use ASIC chips created by Avalon Canaan. The Avalon1 was the worlds first ASIC miner that was released in January 2013. Although Avalon did sell 110nm ASIC chips and open sourced the software and hardware for their Avalon1 product, the two products were completely independent of each other. ASICMiner created the BE100 ASIC chips and used them on their Block Erupter Blade, Block Erupter USB stick, and Block Erupter Cube before moving on to their next generation of ASIC chip, the BE200. Their first product (Blades) were released in April of 2013.I work with @TheCoinDad and I am one of the individuals that helped develop the Bitcoin Mining Museum website. I've been mining bitcoin for a while and have participated in setting up and presenting the museum in person at the most recent Mining Disrupt event in Miami. This is the reason I am so quickly able to recall certain details from the early ASIC mining days  We have lots of plans for the website coming up. We are working on building out a historic timeline of events when it comes to milestones, ASIC miner release dates, and some of the most controversial events surrounding ASIC miners and companies!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}