{
  "id": "topic_5420832",
  "title": "pastpens",
  "author": "pastpens",
  "created_time": "November 13, 2022, 09:50:19 AM",
  "content": "Parker Duofold fountain pen– English Parker Duofold– Streamlined– Rare Golden Hatched candy striped marble pattern– Senior Long Bold Pen of Overall Length 5 inches– Comes with a Parker paper gift-box– Button-filling systemUp here is a vintage English Parker Duofold Streamlined Button Filler fountain pen, which was manufactured in England circa 1940s.The pen comes with a Parker paper gift box.This Parker Duofold is a fine example, in stunning rare golden hatched candy striped marble.It is also SENIOR version, largest size of the series, of overall length 5 inches.The pen is in nice condition, without any crack only some wears due to age.The imprint on the barrel is weak; yet still showing ‘GEO.S.PARKER   PARKER DUOFOLD   REG.T.M.’.It bears a large Parker 14ct solid gold nib, non-flexible, writing fine to medium line.The Parker Duofold has a button filling system, which is particularly simple and elegant filling method – the end of the pen unscrews revealing a button which is depressed while the nib is immersed in ink.The pen has been serviced and tested for full functionality. This pen is rare and very much sought after, of such a vintage pen in good condition. Ownership of pen with the history and prestige of the Parker Duofold, will provide the owner with a feeling of satisfaction and a sense of ceremony each time that they write.The Parker Pen Company was founded in 1888 by George S. Parker, whose mission was to manufacture a better pen. The Parker Pen Company’s tradition epitomizes the highest standards of craftsmanship, technology, and aesthetics. In 1921, the company introduced the iconic Parker Duofold pen. Yet by the early 1930s, Parker launched replacement for Duofold, the Vacumatic. In 1941, the company developed the most widely used model of fountain pen in history (over $400 million worth of sales in its 30-year history), the Parker 51. It is also referred as ‘the most wanted pen’. From the 1920s to the 1960s, Parker was No.1 in worldwide writing instrument sales.You can also view our item on Trumblr.; and see our other vintage Parker Duofold collections.https://pastpens.com/shop/parker-duofold-fountain-pen-golden-hatch-senior/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420832",
  "comments": []
}