{
  "id": "topic_5445849",
  "title": "l3pox",
  "author": "l3pox",
  "created_time": "March 21, 2023, 08:38:17 PM",
  "content": "Estão sabendo?semana que vem acontecerá o Ethereum Rio, novamenteno rio de janeirodizem que é um bom evento para conhecer programadores e a galera tech da ethereumesse é o site oficialhttps://www.ethereumbrasil.com/ethereumrioQuoteA convergence of creators,builders & thinkersaqui tem as informações dos ticketshttps://ethereumbrasil.ticketh.xyz/são um pouco caros pro público Brasileiro, 315 usd, mas tem um desconto para LATAMs que trabalham em projetos web3, mesmo que voluntariamente(bitcointalk conta como projeto web 3?)com o desconto para LATAM sai 120 usdalguém daqui pensando em ir?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445849",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "March 21, 2023, 09:00:51 PM",
      "body": "Muito caro! Só com esse desconto de 80% que dá para arriscar participar. Já moro longe do RJ, com esse preço nem passa pela minha cabeça a possibilidade de pensar em ir, rsrsrs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 21, 2023, 09:09:35 PM",
      "body": "Sinceramente eu questiono-me se esse tipo de eventos, compensam esses 300$ dos bilhetes.Fico sempre com a sensação que não, mas talvez porque nunca participei num. Eu até posso entender o motivo desses valores, mas fico com a sensação que é mais a organização a tentar obter um bom lucro, do que outra coisa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 22, 2023, 01:19:38 PM",
      "body": "Vim contar fofocas! Devido ao preço do evento e vários outros fatores, o evento sofreu um fork! Além desse evento, estão organizando o ETH Samba https://twitter.com/ethsamba, que como o nome diz, busca ser algo mais acessível para o pessoal. O samba vai iniciar no dia 31. O fork está sendo organizado inclusive pela Solange Gueiros, que pra quem não conhece é uma desenvolvedora brasileira muuuito foda, que ganha infinitos hackathons no mundo todo, dá aula de dança pra cego e faz parte de vários projetos junto as maiores blockchains. O evento também está sendo organizado por um carioca que acho que tu conheceu, o Tiago Catarino.Acho que você vai gostar mais",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "March 22, 2023, 03:10:26 PM",
      "body": "que legal sobre o ETH Samba @disruptivasadoro esse tipo de coisa hahahaha forks de eventos físicosA Solange é boladona mesmo, não sabia que ela dava aula de danças, legal!sobre valer a pena ou nãoestive uma vez num evento sobre NFTs e o que digo é que: em geral não vale a penao evento físico pode ser útil para conhecer pessoas e formar parcerias com gente legal que está trabalhando com web3mas no fim das contas mesmo a mágica acontece na frente da tela mesmo, não no meatspace",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 23, 2023, 11:48:34 AM",
      "body": "Quote from: Lucasgabd on March 22, 2023, 03:10:26 PMsobre valer a pena ou nãoestive uma vez num evento sobre NFTs e o que digo é que: em geral não vale a penao evento físico pode ser útil para conhecer pessoas e formar parcerias com gente legal que está trabalhando com web3mas no fim das contas mesmo a mágica acontece na frente da tela mesmo, não no meatspaceAté gostaria de saber o que os outros pensam sobre isso. Pra mim, a mágica também acontece na frente da tela. E mesmo adorando encontrar pessoas ao vivo, eu não acho ''produtivo'' quando eu penso nas questões de trabalho. Mas acho que isso é uma questão de cultura.  Acho que os nativos cripto, pessoas que trabalham/se aventuram na área porque gostam muito, tem muito forte e com mais facilidade, essa questão de se sentirem confortáveis com as telas. Sinto que quem está na área mas não é ''nativo'', não tem coração degen, talvez sinta mais dificuldade com essas interações.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 23, 2023, 02:14:02 PM",
      "body": "Quote from: Disruptivas on March 23, 2023, 11:48:34 AMQuote from: Lucasgabd on March 22, 2023, 03:10:26 PMsobre valer a pena ou nãoestive uma vez num evento sobre NFTs e o que digo é que: em geral não vale a penao evento físico pode ser útil para conhecer pessoas e formar parcerias com gente legal que está trabalhando com web3mas no fim das contas mesmo a mágica acontece na frente da tela mesmo, não no meatspaceAté gostaria de saber o que os outros pensam sobre isso. Pra mim, a mágica também acontece na frente da tela. E mesmo adorando encontrar pessoas ao vivo, eu não acho ''produtivo'' quando eu penso nas questões de trabalho. Mas acho que isso é uma questão de cultura.  Acho que os nativos cripto, pessoas que trabalham/se aventuram na área porque gostam muito, tem muito forte e com mais facilidade, essa questão de se sentirem confortáveis com as telas. Sinto que quem está na área mas não é ''nativo'', não tem coração degen, talvez sinta mais dificuldade com essas interações. Na minha opinião essa \"mágica\" acontece, porque muitos que são nativos e geeks, durante anos ficaram \"confinados\" a sua casa em frente ao PC, sem muito pouca interação social. Então, agora como que ficam super fascinados com o convívio social com outras pessoas com os mesmos interesses. É verdade que até alguns anos atras, por haver poucas pessoas ligadas as IT, era difícil muitos encontrar outras pessoas com o mesmo tipo de interesse nessa área, mas agora é muito diferente.Concordo que esse tipo de eventos podem ser um elemento que permite conhecer mais pessoas no ramo e até abrir algumas portas. Mas, mesmo assim não acho que seja algo assim tão fascinante, para ter esse nível custo dos bilhetes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "March 23, 2023, 05:52:54 PM",
      "body": "acho que varia um pouco com o tamanho da empresa/projeto e a área tambémtalvez faria mais sentido para alguém de marketing e vendas estar nesses eventos do que para devstalvez não também... hahhaah",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "March 23, 2023, 07:37:43 PM",
      "body": "Quote from: Disruptivas on March 23, 2023, 11:48:34 AMAté gostaria de saber o que os outros pensam sobre isso. Pra mim, a mágica também acontece na frente da tela. E mesmo adorando encontrar pessoas ao vivo, eu não acho ''produtivo'' quando eu penso nas questões de trabalho. Mas acho que isso é uma questão de cultura.  Acho que os nativos cripto, pessoas que trabalham/se aventuram na área porque gostam muito, tem muito forte e com mais facilidade, essa questão de se sentirem confortáveis com as telas. Sinto que quem está na área mas não é ''nativo'', não tem coração degen, talvez sinta mais dificuldade com essas interações. Achei legal quando falou que o evento vai ter um fork hahahaha, muito bom  O evento é muito caro mesmo, pagar 300 dólares e mais estacionamentos / viagem / alimentação, tem que ser alguém com boas condições para participar, dá pra ver que não é voltado para o público, e pode ser que dê pouca gente heim.Sobre eventos, apesar de eu ser um pouco anti social, já participei há anos atrás de eventos voltado para games (aliás, fui no primeiro evento que existiu aqui no BR, em SP), e o que é bom disso tudo é conhecer gente que gosta das mesmas coisas, fazer amizades, network como dizem, trocar contatos, informações, talvez conhecer algum figurão da área e se inspirar. Até mesmo dá pra se divertir  Caso eu fosse eu me inscreveria para o desconto, dizendo que sou postador e divulgador das criptmoedas no local de legado do próprio Satoshi Nakamoto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crossholder",
      "created_time": "March 25, 2023, 10:41:39 AM",
      "body": "É caro mesmo pessoal, mas uma coisa legal desses eventos da ETH é que nao é difícil de entrar como voluntário.Em 2022 conheci algumas pessoas que fizeram isso e tinham acesso a tudo do evento, a questão é que tem que se organizar pra nao querer se inscrever em cima da hora.Mete a cara, manda DM, pergunta se o evento precisa de ajuda...o nao é garantido, e caso consiga, seria uma economia de 300 USD, nada mal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "March 25, 2023, 02:01:38 PM",
      "body": "Existem duas boas formas de aproveitar os eventos em si, quando voce vai dedicado a montar equipes pra participar dos hackathons, onde sempre tem premios bons até. E quando voce ja tem algum parceiro de negócio em mente e ai vai la pra finalizar/dar uma animada na parceria. Mas grande parte das coisas mais legais ocorrem até no pós-evento. Muito dos projetos são criados ali fora, depois que todos tem tempo de digerir as coisas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "March 25, 2023, 02:21:51 PM",
      "body": "Quote from: Disruptivas on March 25, 2023, 02:01:38 PMExistem duas boas formas de aproveitar os eventos em si, quando voce vai dedicado a montar equipes pra participar dos hackathons, onde sempre tem premios bons até.Por falar em aproveitar o evento, você chegou a ir a WebSummit em Lisboa o ano passado?Ou só vai mesmo participar na versão no Brasil que irão fazer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}