{
  "id": "topic_5456447",
  "title": "Why2why",
  "author": "Why2why",
  "created_time": "June 15, 2023, 02:03:43 PM",
  "content": "Hello everyone, i just want to share my thought here as a newbie, i bought my first bitcoin two weeks back, after spending the first month studying and reading everything as relate to Bitcoin, the time spent on learning and gathering knowledge have started to pay off for me during this period were the price of bitcoin have nosedive greatly.Let me explain what i mean in details.First before i bought my first bitcoin, i first of all build a good understand of the market and how bitcoin volatility works, and also learned about the effect of external forces in determining the price of Bitcoin  such as exchange crisis and other governmental policies that can have short time effect on bitcoin.Secondly i have learned never to panic during any crisis time or when the bitcoin price drop significantly because in the near future it will increase in value again, and also to hold an amount i can afford to look away from for a long time.This and many more is the reason behind my current confidence in Bitcoin's ability never to let me lose if I hold for a long time.Indeed knowledge is power, because knowledge can save you when money failed, because knowledge failure is a lifetime problem but money failure in terms of investment is temporally and if I wait I will soon be in profit again very soon, that is what past records have shown and proven.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456447",
  "comments": [
    {
      "author": "Rikafip",
      "created_time": "June 15, 2023, 02:09:11 PM",
      "body": "First of all, welcome to forum and I have to say that you chose a very good time to buy your first bitcoin.Quote from: Why2why on June 15, 2023, 02:03:43 PMIndeed knowledge is power, because knowledge can save you when money failed, because knowledge failure is a lifetime problem but money failure in terms of investment is temporally and if I wait I will soon be in profit again very soon, that is what past records have shown and proven.Regarding this \"I will be in the profit very soon\" part, that doesn't have to necesasarily be true as it may be even years before bitcoin goes back to the levels where you bought it so you should be be prepared for that scenario as well. Having said that, since you bought your first bitcoin much cheaper than ATH price was, chances are that you won't have to wait for years to be in profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "June 15, 2023, 02:32:04 PM",
      "body": "Quote from: Why2why on June 15, 2023, 02:03:43 PMFirst before i bought my first bitcoin, i first of all build a good understand of the market and how bitcoin volatility works, and also learned about the effect of external forces in determining the price of Bitcoin  such as exchange crisis and other governmental policies that can have short time effect on bitcoin.You did good learning but it is not enough. Purely reading and learning can not help you understand it entirely. You must be in the market to digest such knowledge and feel about it. With your experience, you will know such knowledge is right or wrong.QuoteSecondly i have learned never to panic during any crisis time or when the bitcoin price drop significantly because in the near future it will increase in value again, and also to hold an amount i can afford to look away from for a long time.Practicing to control your emotion, psychology and avoid being panic with news is good practice. If you experience the market enough, you will be able to exit when market starts to fall and can buy it later to increase your coin.If you can not do it, holding is best.Remind that it is useful strategy for Bitcoin, not for altcoins that have more sensitivity with news and uncertainty of their survival.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 15, 2023, 02:57:42 PM",
      "body": "You are indeed learning some good stuff, and I hope you put all you have said in the op into practice, it all shouldn't just end as written words here maybe for the sole purpose of growing in this forum, i promise you that, if indeed you can put everything you have learnt so far into practice, you will do well as a bitcoin investor.And another good strategy to grow you bitcoin bag i would like you to learn again is the DCA strategy DCA means - dollar cost average - this in details means buying the same amount of the coins you bought before, or even more of the coins, when the price is down and going down..For example, let's assume you previous bought 0.001 bitcoin for $50 when the price of higher, now that the price is cheaper, you can buy again, same amount of bitcoin or even more, and this time, 0.001 bitcoin might cost $40, at the end of it all, if you check your overall average buying price, you will discover it is lower compared to what the price of bitcoin was when you bought your first bitcoin, and this means more profit for you when the price of bitcoin starts going up..All in all, always remember, never invest money you can't afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 15, 2023, 03:09:04 PM",
      "body": "OP, it is nice you took out time to learn more about bitcoin before taking any steps. Learning keeps you knowledgeable and therefore would guide you through knowing more about any thing you deem fit of knowing based o your interest. I must commend you for the task you have yourself because not everyone would want to do such when it is very accessible to them irrespective of the fact that they do not have idea of the system as it works but are eager to get it without prior knowledge.I must remind you of this. Do not keep your assets in decentralized exchange as they are a third party to your assets and as such, you do not have access to the private keys so therefore it is very risky to do so. You should have a self custodial wallet where you can transfer your funds to for your safety.Remember this \"not your keys, not your coin\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "June 15, 2023, 03:13:48 PM",
      "body": "Weak hands usually have a problem in the network, they sell at any event that causes panic and they don't buy until the price starts to rise, it is great that you don't intend to use BTC the way weak hands do. From your post you have learnt things about BTC investment, but take note that BTC is also a currency, a permissionless and censorship resistant one, so you should also have confidence that BTC is a currency that cannot be controlled, hacked or shut down by any government and one you can use without anybody's permission, this is the most important thing about the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dwminer1",
      "created_time": "June 15, 2023, 03:20:35 PM",
      "body": "Personally, I respect and approve of your approach and believe that if more people acted like you, the cryptocurrency market would be much safer. A conscious investment is very important, of course it does not mean that it will always be profitable, but it shows a mature approach to investment and I believe that in the long run it will guarantee you profit. Do not give up further learning economics and technical analysis, and it will certainly pay off in the future. I wish you every success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "June 15, 2023, 03:31:02 PM",
      "body": "You've done the right thing as a beginner. And it's true that as a Bitcoin investor, the first thing we have to manage is not to panic because panic will only make us unable to think clearly.If you know that knowledge is the power that can save you from panic, you will be fine and able to hold on to Bitcoins and instead will use the downturn to accumulate more Bitcoins. While other people will panic, you can use the moment well.It takes patience and it's not easy to deal with panic but you've proven you can. I hope you can continue to buy more Bitcoins with the DCA method so that you can have more Bitcoins and can earn big profits in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 15, 2023, 03:36:26 PM",
      "body": "Quote from: Z-tight on June 15, 2023, 03:13:48 PMWeak hands usually have a problem in the network, they sell at any event that causes panic and they don't buy until the price starts to rise, it is great that you don't intend to use BTC the way weak hands do. From your post you have learnt things about BTC investment, but take note that BTC is also a currency, a permissionless and censorship resistant one, so you should also have confidence that BTC is a currency that cannot be controlled, hacked or shut down by any government and one you can use without anybody's permission, this is the most important thing about the network.These weak hands are more of newbies that are inexperienced about Bitcoin. They panic sell at any slightest fud or fomo to getting back investment or possibly a little profit gained which causes a big price crash giving room for more whales to accumulate more bitcoin and wanting to control the market.I just assume they are not knowledgeable enough to have studied about Bitcoin before getting involved in it. They are even worst than daily traders because traders too do not panic sell the way some newbies do and that has been the problem of price fluctuations in the system coupled with other factors too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "June 15, 2023, 03:42:05 PM",
      "body": "I was shocked that you did not have the same perspectives as other newcomers. Most newcomers lack patience, so they make decisions based on their emotions, which is extremely risky in terms of investment and trading. An investor who is quickly frightened usually has little expertise about Bitcoin. Certain individuals believe that volatility has no advantages, however volatility is the reason that certain people become wealthy quickly. If you know enough about Bitcoin, you will believe that the price will skyrocket in the near future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 15, 2023, 03:58:31 PM",
      "body": "Quote from: Why2why on June 15, 2023, 02:03:43 PMSecondly i have learned never to panic during any crisis time or when the bitcoin price drop significantly because in the near future it will increase in value again, and also to hold an amount i can afford to look away from for a long time.This and many more is the reason behind my current confidence in Bitcoin's ability never to let me lose if I hold for a long time.Yes, this is Hold's summary, people who panic at the first drop they see in Bitcoin or who can't part with investment money for a long time are definitely going to fail with the Hold strategy.Because they will simply sell when afraid, or they will sell their bitcoins at the first financial problem they encounter, so whoever wants to hold should stay away from monitoring indicators on the screen as well as stay away from negative news because all this means nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 15, 2023, 03:58:59 PM",
      "body": "You have taken a good step by starting your Bitcoin journey with learning, which is the basic need for anyone willing to succeed in any investment, not only Bitcoin.By now, I am sure you understand how the market moves and some factors that affect the market movement, which is a great achievement as you did not panic to sell as the Bitcoin price kept going down.Quote from: Why2why on June 15, 2023, 02:03:43 PMIndeed knowledge is power, because knowledge can save you when money failed, because knowledge failure is a lifetime problem but money failure in terms of investment is temporally and if I wait I will soon be in profit again very soon, that is what past records have shown and proven.The word soon you use here might take more time than you expected because we can't predict the market; we are only hoping that the market will soon be good and the Bitcoin price will rise again.Depending on the profit is not advisable now, which is why we are advised to invest the amount we can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "June 15, 2023, 04:23:02 PM",
      "body": "Quote from: Why2why on June 15, 2023, 02:03:43 PMFirst before i bought my first bitcoin, i first of all build a good understand of the market and how bitcoin volatility works, and also learned about the effect of external forces in determining the price of Bitcoin  such as exchange crisis and other governmental policies that can have short time effect on bitcoin.You did a good thing before starting, with a basic understanding at least it makes you at least understand all the aspects needed because if you learn more then you will have the knowledge and judgment that you think is good to do it on the other hand some the effects of other news also often affect the price of bitcoin including from government policies and other famous people.Quote from: Why2why on June 15, 2023, 02:03:43 PMSecondly i have learned never to panic during any crisis time or when the bitcoin price drop significantly because in the near future it will increase in value again, and also to hold an amount i can afford to look away from for a long time.This and many more is the reason behind my current confidence in Bitcoin's ability never to let me lose if I hold for a long time.Bitcoin always has a good cycle if you are only investing for the long term then don't panic all the negative news that leads to bitcoin will quickly pass, and with your faith I think you can do that especially you already know when bitcoin goes down then it will up again someday, I with us holding on longer then we ourselves will be the winners.At first, it was difficult to overcome panic, but believe me, if you understand everything related to bitcoin, then you will understand how not to panic, let alone sell your bitcoins in the middle of the road.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "June 15, 2023, 04:27:00 PM",
      "body": "Quote from: Why2why on June 15, 2023, 02:03:43 PMHello everyone, i just want to share my thought here as a newbie, i bought my first bitcoin two weeks back, after spending the first month studying and reading everything as relate to Bitcoin, the time spent on learning and gathering knowledge have started to pay off for me during this period were the price of bitcoin have nosedive greatly.Let me explain what i mean in details.First before i bought my first bitcoin, i first of all build a good understand of the market and how bitcoin volatility works, and also learned about the effect of external forces in determining the price of Bitcoin  such as exchange crisis and other governmental policies that can have short time effect on bitcoin.Secondly i have learned never to panic during any crisis time or when the bitcoin price drop significantly because in the near future it will increase in value again, and also to hold an amount i can afford to look away from for a long time.This and many more is the reason behind my current confidence in Bitcoin's ability never to let me lose if I hold for a long time.Indeed knowledge is power, because knowledge can save you when money failed, because knowledge failure is a lifetime problem but money failure in terms of investment is temporally and if I wait I will soon be in profit again very soon, that is what past records have shown and proven.You say that you have learned not to panic during any crisis or when the price of bitcoin falls heavily. But in those 2 weeks that you bought and own bitcoin, nothing like this happened. I'd like to see how you control the panic of a significant drop in bitcoin, say 80% after you buy this and what thoughts you will voice at that moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "June 15, 2023, 04:30:16 PM",
      "body": "Well, I would've agreed if this is hinge on something that will never fail us but it's not at all. There is absolutely no guarantee that price will keep going up unless the prediction is based on something that guarantees that.Anyway, I'm basing mine on the Only Thing that can never fail which is the CREATOR of the Universe. I believe strongly HE will reverse the price and keep it going up. No past price action, \"rich\" person, government agency can prevent that or make things go his/its way. I have seen non who succeeded. They are cloud without water, making empty promises and weak threats and they probably think it's working when price reacts to how it's \"programmed\" to react to factors they probably knew about after reading about them on Bitcoin Master comments. It's like having an idea when it will rain due to the behavior of the clouds then you tell your juju men to scatter ashes in the air and announce to millions of your decieved slaves that it will rain today or tomorrow. When it does rain they give credit to you instead of the CREATOR who caused it to rain. To avoid any embarrassment, they get more juju men to say it won't rain, so that if the former fails the latter will bring them the credit. That's how incredibly deceitful they are. This is why we choose to be very precised with our predictions. Credit must always go to the precised Predictions. Well, it's clear the current sentiment is very pessimistic, both on social media, and this forum. This is when Bitcoin Master typically steps in. It's just abit unfortunate that some gods are already giving baseless assurance of a coming dominance, at a time Bitcoin Master hopes to pray to the CREATOR for price increase and then move it up.  These are clogs in the wheel of progress that should be checked. Nevertheless, for the sake of being consistent with our method, we will move the price up and this will be based on something everyone in cryptospace can use as proof of consistency. For example, \"he was the first to say this or that and the market is reacting accordingly\", the credit automatically goes to the ONE who deserves or did it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "June 15, 2023, 04:31:36 PM",
      "body": "Quote from: Why2why on June 15, 2023, 02:03:43 PMHello everyone, i just want to share my thought here as a newbie, i bought my first bitcoin two weeks back, after spending the first month studying and reading everything as relate to Bitcoin, the time spent on learning and gathering knowledge have started to pay off for me during this period were the price of bitcoin have nosedive greatly.Let me explain what i mean in details.First before i bought my first bitcoin, i first of all build a good understand of the market and how bitcoin volatility works, and also learned about the effect of external forces in determining the price of Bitcoin  such as exchange crisis and other governmental policies that can have short time effect on bitcoin.Secondly i have learned never to panic during any crisis time or when the bitcoin price drop significantly because in the near future it will increase in value again, and also to hold an amount i can afford to look away from for a long time.This and many more is the reason behind my current confidence in Bitcoin's ability never to let me lose if I hold for a long time.Indeed knowledge is power, because knowledge can save you when money failed, because knowledge failure is a lifetime problem but money failure in terms of investment is temporally and if I wait I will soon be in profit again very soon, that is what past records have shown and proven.First off, I would like to welcome you to our Bitcointalk forum! I hope you like it here and that you continue your Bitcoin journey with us fellow holders. You will find that there are many such moments of immense volatility, which tempt even the most veteran of Bitcoiners into selling their coins. But as long as you believe in Bitcoin and keep holding your stash, you will be completely comfortable.Hope to see you around the forum! Have a great time!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "June 15, 2023, 04:33:28 PM",
      "body": "Quote from: Why2why on June 15, 2023, 02:03:43 PMHello everyone, i just want to share my thought here as a newbie, i bought my first bitcoin two weeks back, after spending the first month studying and reading everything as relate to Bitcoin, the time spent on learning and gathering knowledge have started to pay off for me during this period were the price of bitcoin have nosedive greatly.Let me explain what i mean in details.First before i bought my first bitcoin, i first of all build a good understand of the market and how bitcoin volatility works, and also learned about the effect of external forces in determining the price of Bitcoin  such as exchange crisis and other governmental policies that can have short time effect on bitcoin.Secondly i have learned never to panic during any crisis time or when the bitcoin price drop significantly because in the near future it will increase in value again, and also to hold an amount i can afford to look away from for a long time.This and many more is the reason behind my current confidence in Bitcoin's ability never to let me lose if I hold for a long time.Indeed knowledge is power, because knowledge can save you when money failed, because knowledge failure is a lifetime problem but money failure in terms of investment is temporally and if I wait I will soon be in profit again very soon, that is what past records have shown and proven.There are not many people like you who first actually go through the harder process of learning all the elements required to buy and hold bitcoin.It seems you already have a better understanding of the market and how it behaves in different trends.You just have to stay strong now and keep holding it through its cycle. Learn how to take profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 15, 2023, 04:35:38 PM",
      "body": "Holders somehow don't panic when they don't have plans to make their 1BTC become 2BTC. The idea why some would panic is because they know what could happen in the next 2 to 3 weeks like BTC price could ge dip to $20K. Given this information, one holder would mind holding still for they know that BTC will always rise even after years of holding but to some holders, they see this an opportunity to simply sell at $25K and then buy back at $20K. Call it panic but I see it that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "June 15, 2023, 04:51:16 PM",
      "body": "Quote from: Why2why on June 15, 2023, 02:03:43 PMHello everyone, i just want to share my thought here as a newbie, i bought my first bitcoin two weeks back, after spending the first month studying and reading everything as relate to Bitcoin, the time spent on learning and gathering knowledge have started to pay off for me during this period were the price of bitcoin have nosedive greatly.Let me explain what i mean in details.First before i bought my first bitcoin, i first of all build a good understand of the market and how bitcoin volatility works, and also learned about the effect of external forces in determining the price of Bitcoin  such as exchange crisis and other governmental policies that can have short time effect on bitcoin.Secondly i have learned never to panic during any crisis time or when the bitcoin price drop significantly because in the near future it will increase in value again, and also to hold an amount i can afford to look away from for a long time.This and many more is the reason behind my current confidence in Bitcoin's ability never to let me lose if I hold for a long time.Indeed knowledge is power, because knowledge can save you when money failed, because knowledge failure is a lifetime problem but money failure in terms of investment is temporally and if I wait I will soon be in profit again very soon, that is what past records have shown and proven.Knowledge is power,you have done well to acquire the little knowledge about bitcoin in terms of holding and not to panic when the prices surges. I hope that you also learn about the types of wallet,so that you don't keep your bitcoin in a centralized platform or exchange. Noncustodial wallet is the best for your to keep your coins,as you are the only one that will have access to your bitcoin. Practice makes one perfect and I am happy that you have already purchased your first bitcoin. You should practice on how to hodli for long and maybe you can also increase your bitcoin portfolio using any of this three methods. Buying at dip,buying in lump or using DCA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "June 15, 2023, 05:15:45 PM",
      "body": "Quote from: jeraldskie11 on June 15, 2023, 03:42:05 PMI was shocked that you did not have the same perspectives as other newcomers. Most newcomers lack patience, so they make decisions based on their emotions, which is extremely risky in terms of investment and trading. An investor who is quickly frightened usually has little expertise about Bitcoin. Certain individuals believe that volatility has no advantages, however volatility is the reason that certain people become wealthy quickly. If you know enough about Bitcoin, you will believe that the price will skyrocket in the near future.I believe sometimes it is the get rich quick mentality that makes most newbies not really take out time to do the needful by  doing their research properly in knowing more about bitcoin. Sometimes, it all points towards the way and manner whomever onboarded them had explained it to them on how bitcoin works. Newbies understanding hovers around making profits without putting other factors into considerations. This has caused them their funds as most fall easily for scam, some get hacked and some end up loosing their funds in the course of trading when they have no idea and know not the basic fundamentals in what they have engaged themselves into.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}