{
  "id": "topic_5412660",
  "title": "Ultegra134",
  "author": "Ultegra134",
  "created_time": "September 06, 2022, 11:13:39 PM",
  "content": "We've all stumbled upon predictions for all kinds of coins, including Bitcoin, of course. Some may sound like they may happen in the future, such as Bitcoin, Ethereum, Solana, or Polkadot, coins with actual potential. However, some are so exaggerated that they have no foundation to back up their claims. I recently got my hands on some BTTC (BitTorrent Coin). It has so many zeros after the decimal that I've lost count, and they are literally worth almost nothing. I was curious to see, though, what the community believed about its future.The first website I stumbled upon claimed that BTTC had the potential to reach $30 by 2050. Firstly, how can a coin worth $0.000000866 as we speak rise so much in value? It currently has a market cap of over $800.000.000. If the price were to double, it'd have a market cap of $1.6 billion. That's already extravagant and it'd still be worth close to nothing, nonsense.Secondly, how and why is someone making predictions 30 years from now? The world might have ended by then. On what data is someone making such a prediction? Fortunately, other websites I found didn't have such extreme forecasts, but some still did, over the moon. For most coins out there, plenty of similar examples can also be found. Do you believe that they're based on any actual statistics and/or considering the coin's potential, are they purely fictional?P.S I'm not implying that BTT could possibly reach $30; I'd be a multibillionaire if that were the case. It's just a simple example of how many exaggerated forecasts are out there.Website n.1: https://telegaon.com/bittorrent-coin-price-prediction-2021-2022-2025-2030/Website n.2: https://www.cryptonewsz.com/forecast/bittorrent-price-prediction/ A more plausible prediction",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412660",
  "comments": [
    {
      "author": "TimeTeller",
      "created_time": "September 06, 2022, 11:22:08 PM",
      "body": "The fact is, basically anyone can make their predictions in this market.But it is up to how solid is their basis of such speculation. If you will listen and follow the prediction of those sites, you may end up bankrupt in the end.Filter what they are saying, do they have tangible reasons why they are thinking that price level?Most of the time, these people are just spreading FUD or FOMO to the public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 06, 2022, 11:26:27 PM",
      "body": "They have just pulled the numbers out of nowhere. As for why the prediction is so far in the future, I could image it being so they can get paid to list other predictions/make other shit coins themselves and predict those for far in the future too as they're less likely to be disproven (I guess).If you're buying a coin worth 866 nano dollars now that's going to be worth $20 in the future, most people will probably buy as many as they can rather than working out that $1 is probably a reasonable amount to waste on such a thing (at most - though the chain or liquidity pool will likely die/dry up before 2050 too).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AjithBtc",
      "created_time": "September 06, 2022, 11:29:08 PM",
      "body": "Market is open to speculation and people are trying to make use of it. To me these predictions doesn't look wrong, every project in the market makes a comparison against bitcoin. In reality that doesn't match, but it is kinda tactics to market their project. What we see is the same, these are prediction forecasts that are being circulated to grab attention of the investors. They'll also think what we invest will give good return in the long term, atleast our children could enjoy. In that note surely many people will invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "September 07, 2022, 01:20:55 AM",
      "body": "They say:QuoteThis BitTorrent price forecast is based on a deep technical analysis and past performance of the BTTC Coin.However, nothing is explained about their deep technical analysys method. It leads readers to conclude the website and the self-proclaimed specialists behind it are simply shilling for the altcoin.In fact there isn't any reason or fact that could back their predictions. It's really hard to foresee the future of the most popular crypto that is bitcoin, now imagine how hard it must be to predict the future of an unknown altcoin pricing $0.0008451.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "September 07, 2022, 02:01:37 AM",
      "body": "Quote from: Ultegra134 on September 06, 2022, 11:13:39 PMP.S I'm not implying that BTT could possibly reach $30; I'd be a multibillionaire if that were the case. It's just a simple example of how many exaggerated forecasts are out there.Website n.1: https://telegaon.com/bittorrent-coin-price-prediction-2021-2022-2025-2030/Website n.2: https://www.cryptonewsz.com/forecast/bittorrent-price-prediction/ A more plausible predictionBut admit it that this predictions gives me something positive about this since you are holding this coin?   but yeah this is an exaggerated in prediction area because how could a coin that almost have no value will increase that huge when there are so many project with great potential ahead of this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "September 07, 2022, 02:22:59 AM",
      "body": "To be fair there were exaggerated forecasts that proved to be right in the end. I used to have a number of altcoins which have exaggerated price predictions that eventually happened. I had XRP back when it was ridiculous to predict $1 for it. Time came when an XRP rose to as high as $3. I had DOGE during those days when $0.1 can only be interpreted as wishful thinking. But it rose to $0.7. Shiba Inu had also a similar story. And some more. But just be warned that this is a handful compared to the thousand other exaggerated predictions that didn't come true. And these predictions are merely based on hype. They're mostly unfounded. So I don't think it is worth the risk to bet on them with the hope that one would fly to the moon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 07, 2022, 02:50:03 AM",
      "body": "I do not believe such analyzes or predictions, it is just an advertisement for a project so that people can buy, no one can predict what will happen after days or months, so how after 30 years? In general, even professional analysts who have a lot of experience in analysis make mistakes often, there are a lot of changes and emergency conditions that occur in the future and completely change the result of the analysis.For a coin that has several zeros, never believe that it can reach these numbers!! The furthest thing you can imagine is to get rid of just one zero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "September 07, 2022, 02:50:50 AM",
      "body": "Quote from: uneng on September 07, 2022, 01:20:55 AMThey say:QuoteThis BitTorrent price forecast is based on a deep technical analysis and past performance of the BTTC Coin.However, nothing is explained about their deep technical analysys method. It leads readers to conclude the website and the self-proclaimed specialists behind it are simply shilling for the altcoin.In fact there isn't any reason or fact that could back their predictions. It's really hard to foresee the future of the most popular crypto that is bitcoin, now imagine how hard it must be to predict the future of an unknown altcoin pricing $0.0008451.In fact, there are also no intelligent tools or machines that can help them make those predictions. Price prediction is very difficult in my opinion, it can be emphasized that bitcoin price cannot be predicted. It is difficult to predict what will happen tomorrow because we never know what is going to happen tomorrow and what will happen today, let alone that they can make predictions for the next 10 years. The people who make those claims, either have mental problems or get paid to say those myths.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "September 07, 2022, 02:51:08 AM",
      "body": "Quote from: jackg on September 06, 2022, 11:26:27 PMThey have just pulled the numbers out of nowhere. As for why the prediction is so far in the future, I could image it being so they can get paid to list other predictions/make other shit coins themselves and predict those for far in the future too as they're less likely to be disproven (I guess).If you're buying a coin worth 866 nano dollars now that's going to be worth $20 in the future, most people will probably buy as many as they can rather than working out that $1 is probably a reasonable amount to waste on such a thing (at most - though the chain or liquidity pool will likely die/dry up before 2050 too). Honestly, my expectations are way too low, I'm not expecting it to skyrocket, it'll always have plenty of zeros after the decimal. My coins are worth $2, in the best case scenario, I'll have $10 in a few years. I'm mostly using BTT as an example.Quote from: peter0425 on September 07, 2022, 02:01:37 AMBut admit it that this predictions gives me something positive about this since you are holding this coin?   but yeah this is an exaggerated in prediction area because how could a coin that almost have no value will increase that huge when there are so many project with great potential ahead of this?Personally, it sounds too exaggerated and I highly doubt it that it'll ever be worth 1/100th of a cent, and that's already too much. I've got a little over 2.000.000 coins, which were distributed by Binance. I'm not going to benefit by selling them, they're worth close to nothing. Chances are, I'll keep them in my wallet for many years to come.Quote from: Fundamentals Of on September 07, 2022, 02:22:59 AMTo be fair there were exaggerated forecasts that proved to be right in the end. I used to have a number of altcoins which have exaggerated price predictions that eventually happened. I had XRP back when it was ridiculous to predict $1 for it. Time came when an XRP rose to as high as $3. I had DOGE during those days when $0.1 can only be interpreted as wishful thinking. But it rose to $0.7. Shiba Inu had also a similar story. And some more. But just be warned that this is a handful compared to the thousand other exaggerated predictions that didn't come true. And these predictions are merely based on hype. They're mostly unfounded. So I don't think it is worth the risk to bet on them with the hope that one would fly to the moon.That's true. I also never expected Doge to reach a value of a few cents. I had thousands of them back in 2014, and they weren't even worth $5. If I'd still had them, I'd have a couple of thousand dollars now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "September 07, 2022, 03:00:41 AM",
      "body": "Quote from: Ultegra134 on September 07, 2022, 02:51:08 AMQuote from: peter0425 on September 07, 2022, 02:01:37 AMBut admit it that this predictions gives me something positive about this since you are holding this coin?   but yeah this is an exaggerated in prediction area because how could a coin that almost have no value will increase that huge when there are so many project with great potential ahead of this?Personally, it sounds too exaggerated and I highly doubt it that it'll ever be worth 1/100th of a cent, and that's already too much. I've got a little over 2.000.000 coins, which were distributed by Binance. I'm not going to benefit by selling them, they're worth close to nothing. Chances are, I'll keep them in my wallet for many years to come.actually that is the practical thing to do mate because like what you said it is almost worthless so why need to sell it when you can just let it sit in your wallet for even how long and also it looks like a free coin so yeah you have nothing to lose by any chance so keep it mate, I have several coins in my wallet like yours though mine are total shitcoin that i have been keeping for years now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "September 07, 2022, 11:55:02 AM",
      "body": "Not only on those non mainstream coins but insane predictions like that do also occur on top coins. I remember someone claims that bitcoin can reach 1 million dollars. Not that I don't believe in the potential of btc but I think predictions like this are too much already that it starts to become nonsense.What surprises me is that predictions like this can sometimes came from an expert that has a long term experience in the financial and investment field. While for those non mainstream coins like bittorent I think the one that makes a crazy predictions are their developers or the people on their community. They are only trying to hype the coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "September 07, 2022, 01:00:06 PM",
      "body": "When you make outrageous predictions, bag holders retweet them and echo chamber makes it seems like everyone believes it. People will hype any moon talk if that might get their bags mooned. And since some people don't understand how valuation estimates work, they believe anything. And they are the exit liquidity. And then there are people who think that those predictions are delusional, but after those price targets, high price targets don't seem that ridiculous in comparison.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "September 07, 2022, 02:51:32 PM",
      "body": "You can also do these kind of prediction. The main thing is that why some one predict any coin. If there are Solid reason behind this then it may work 20% but many time market condition break all prediction. When BTC was trading ATh many was predict that it will touch 1 million and now saying it will down to 10k. It's better to look for best coin and hold it for long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "September 07, 2022, 07:37:27 PM",
      "body": "The entirety of cryptocurrency market is running on speculations thus, called a speculative market. Those who are giving their predictions in the future are no doubt holding that asset and they're probably holding a huge bag of it. They might have the data for what they're predicting but most likely, it's all about what they feel about it. Like if you've invested heavily on those, you've got that feeling that they might grow in the future whether you back it with analysis or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "September 07, 2022, 07:38:58 PM",
      "body": "Quote from: Ultegra134 on September 06, 2022, 11:13:39 PMWe've all stumbled upon predictions for all kinds of coins, including Bitcoin, of course. Some may sound like they may happen in the future, such as Bitcoin, Ethereum, Solana, or Polkadot, coins with actual potential. However, some are so exaggerated that they have no foundation to back up their claims. I recently got my hands on some BTTC (BitTorrent Coin). It has so many zeros after the decimal that I've lost count, and they are literally worth almost nothing. I was curious to see, though, what the community believed about its future.The first website I stumbled upon claimed that BTTC had the potential to reach $30 by 2050. Firstly, how can a coin worth $0.000000866 as we speak rise so much in value? It currently has a market cap of over $800.000.000. If the price were to double, it'd have a market cap of $1.6 billion. That's already extravagant and it'd still be worth close to nothing, nonsense.Secondly, how and why is someone making predictions 30 years from now? The world might have ended by then. On what data is someone making such a prediction? Fortunately, other websites I found didn't have such extreme forecasts, but some still did, over the moon. For most coins out there, plenty of similar examples can also be found. Do you believe that they're based on any actual statistics and/or considering the coin's potential, are they purely fictional?P.S I'm not implying that BTT could possibly reach $30; I'd be a multibillionaire if that were the case. It's just a simple example of how many exaggerated forecasts are out there.Website n.1: https://telegaon.com/bittorrent-coin-price-prediction-2021-2022-2025-2030/Website n.2: https://www.cryptonewsz.com/forecast/bittorrent-price-prediction/ A more plausible predictionThere are several reasons which can explain something like this, the first is the most simple one as this could be a case in which ignorance is simply that prominent in the person making that kind of prediction, however there are many more reasons, the person may be looking to get clicks to his website, to create a storm and get people to argue with each other, he could be joking or he is so invested in the coin that he is doing this to promote it, if you really stop to think about it you will find too many motives for something like this so I suggest that you do not give it any attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlfebz2",
      "created_time": "September 07, 2022, 08:11:30 PM",
      "body": "Quote from: batang_bitcoin on September 07, 2022, 07:37:27 PMThe entirety of cryptocurrency market is running on speculations thus, called a speculative market. Those who are giving their predictions in the future are no doubt holding that asset and they're probably holding a huge bag of it. They might have the data for what they're predicting but most likely, it's all about what they feel about it. Like if you've invested heavily on those, you've got that feeling that they might grow in the future whether you back it with analysis or not.When you do have the right experience and awareness of this market then you would really be treating these words as \"shills\" and it would really be that pretty obvious on some point but there are ones who arejust sharing up simply with their own opinions and sentiment and this is where you should really make yourself that be aware on whether you would really be tying up yourself on believing with those words or wouldjust simply ignore and stick into your own analysis and prediction.This market is indeed speculative which it would be no surprise that lots of speculations and words floating around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "batang_bitcoin",
      "created_time": "September 07, 2022, 09:47:30 PM",
      "body": "Quote from: carlfebz2 on September 07, 2022, 08:11:30 PMQuote from: batang_bitcoin on September 07, 2022, 07:37:27 PMThe entirety of cryptocurrency market is running on speculations thus, called a speculative market. Those who are giving their predictions in the future are no doubt holding that asset and they're probably holding a huge bag of it. They might have the data for what they're predicting but most likely, it's all about what they feel about it. Like if you've invested heavily on those, you've got that feeling that they might grow in the future whether you back it with analysis or not.When you do have the right experience and awareness of this market then you would really be treating these words as \"shills\" and it would really be that pretty obvious on some point but there are ones who arejust sharing up simply with their own opinions and sentiment and this is where you should really make yourself that be aware on whether you would really be tying up yourself on believing with those words or wouldjust simply ignore and stick into your own analysis and prediction.This market is indeed speculative which it would be no surprise that lots of speculations and words floating around.Yes, that's the right term for those predictions, shills. While on the other side, when we predict good prices for bitcoin in the future, these max-altcoiners will tell the same thing for us. But it's hard for them to swallow that there's more and a brighter future for bitcoin since they've skipped investing on it. While for some situations, those predictions by high prices, targets and for the next years could just be a bunch of trolls that wants to play the emotions of the supporters of the coin they're predicting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "September 07, 2022, 11:28:10 PM",
      "body": "Quote from: AnonBitCoiner on September 07, 2022, 02:51:32 PMYou can also do these kind of prediction. The main thing is that why some one predict any coin. If there are Solid reason behind this then it may work 20% but many time market condition break all prediction. When BTC was trading ATh many was predict that it will touch 1 million and now saying it will down to 10k. It's better to look for best coin and hold it for long term.Many of them would do this since that's what they all could do while struggling to know whether their prediction would hit the right way. But if you found this as a hassle then you have a choice though you can either learn to do some TA and FA so that you'll be the one making a reliable prediction.This market is running with many speculators while some of them are just hyping/shilling a coin. It's your choice to know what they were talking since that's how the market works and through TA and FA it's easy to spot what they were talking. The longer you stay at the market the longer you will know that most of their prediction are irrelevant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "September 07, 2022, 11:59:14 PM",
      "body": "That's why it is called predictions in the first place. They can put any numbers, or figures and even state what year it will happen. Sometimes, to create hype, to make an attempt to lure people to their service, or just a product of their own analysis. Speculations and predictions are already part of the crypto-community stuff since the beginning.For me, just let it go and don't make it a big deal. We have our own way of understanding if a certain prediction is crap or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}