{
  "id": "topic_5437509",
  "title": "tread93",
  "author": "tread93",
  "created_time": "January 31, 2023, 04:23:30 PM",
  "content": "Its all in the name really \"Simple Machines\" you see it every time you login. I know that this would never happen, but could you imagine if BTalk had an application on your phone? Now, would that throw a good wrench into the current ad rev or a bad one? Simply for the notifications and keeping track of responses to your comments/posts would be much easier IMO. Would it help the forum to grow? Or would it be a very useless add on to something that already works pretty dang good just in and of itself. Probably the latter, but I'd be interested to see/know more about what has been done to make any changes, what's been done but hasn't worked, what is currently being worked on from a developmental standpoint. Is anyone aware of any significant changes that may be taking place in the near future? Just curious. I'm going to guess what's not broken won't be fixed, but again, what is there to really fix?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437509",
  "comments": [
    {
      "author": "jackg",
      "created_time": "January 31, 2023, 05:21:43 PM",
      "body": "Aside from the notifications standpoint, I'm not sure it even needs an app.Just someone who's good at writing mobile friendly CSS and someone who can use simple machines and knows how it functions. This might just be a simple machines issue too that it's taken so long to get a \"mobile friendly\" stylesheet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "January 31, 2023, 05:41:53 PM",
      "body": "Quote from: tread93 on January 31, 2023, 04:23:30 PMI'd be interested to see/know more about what has been done to make any changes, what's been done but hasn't worked, what is currently being worked on from a developmental standpoint. Not that I ever really kept track of its progress or could have contributed anything, that new forum software has been in development for years now and who knows what's in Theymos's brain as far as mobile devices and the forum go?  I don't think a bitcointalk app has been discussed before (that I can remember), but there have been tons of threads complaining about the site not being mobile-friendly.When I used to try to tap out posts with my fat fingers on my tiny little Android, I had the forum bookmarked.  That's how I accessed all the sites I normally visited on my phone; do people actually use separate apps for websites nowadays?  That seems like it's an unnecessary use of smartphone resources to me--but correct me if that statement sounds ignorant.  The fact is that I'm fairly tech-ignorant.  Not to go too far off-topic, but what's the state of the new forum software development?  Is that still a thing or what?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ibminer",
      "created_time": "January 31, 2023, 06:09:17 PM",
      "body": "Quote from: jackg on January 31, 2023, 05:21:43 PMAside from the notifications standpoint, I'm not sure it even needs an app.Just someone who's good at writing mobile friendly CSS and someone who can use simple machines and knows how it functions. This might just be a simple machines issue too that it's taken so long to get a \"mobile friendly\" stylesheet. I looked into doing this once a while back, it seemed like something people wanted, but with a responsive epochtalk always looming on the horizon, it never seemed worth putting time into since it would just get replaced. There are ways to convert the tables down to something similar to index cards using CSS & media queries, similar to what I did with the longer report tables on BPIP (basically this), which I think would help convert the majority of the site down to at least fit on a mobile device, probably with minimal changes to the code itself. I've just never dove into it and tried, it wasn't too difficult to apply to BPIP's tables but this site is probably more problematic, and I'm sure there would be some hiccups along the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "January 31, 2023, 06:25:29 PM",
      "body": "Knowing what I know about Apple after working with them on issues with their App Store, I fell pretty confident in saying that a simple mobile app for this website would likely be rejected anyway.  I've made mobile apps for websites in the past and one thing that Apple is a stickler for is new functionality over using the site on their browser.  Even if it has a new interface, Apple will likely reject it without additional functionality.  So my question is, what additional functionality would a mobile app bring to the website?  It could be as simple as a button to forward a post to a friend via SMS, or other similar useless functionality, but it would have to have something to even be approved once development has been completed, at least for iPhones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "January 31, 2023, 06:29:44 PM",
      "body": "Quote from: OgNasty on January 31, 2023, 06:25:29 PMI fell pretty confident in saying that a simple mobile app for this website would likely be rejected anyway.  If the forum wanted to make an official application for the forum, which I do doubt as it has been disucssed several times now. However, Epochtalk did have a focus on being mobile friendly I believe. Anyway, back to the point; we could distribute the .apk here on the forum along with a way of verifying the download, which in my opinion is infinitely better than hosting it via a third party site like Google Play. However, I'm not sure if this would be possible with Apple devices? I'm not too familiar with them as I tend to avoid them like the plague, can you sideload applications without their store?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "January 31, 2023, 06:51:27 PM",
      "body": "You can try the latest/new forum update here https://github.com/epochtalk and discussion here https://bitcointalk.org/index.php?board=167.0Some hosted sites https://coinbistro.com/boards which is based on that code.The site is responsive, so you can browse easily over the phone, with some features that can be added and built upon (such as adding pictures without the need for external sources).The forum is mainly focused on writing, so a similar site/app should be near to Medium",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ibminer",
      "created_time": "January 31, 2023, 07:03:00 PM",
      "body": "Quote from: Welsh on January 31, 2023, 06:29:44 PMI'm not too familiar with them as I tend to avoid them like the plague, can you sideload applications without their store? Without being on the app store, iOS devices would need to be jailbroken first, which most people don't do. MacOS can install anything mac compatible (sometimes with security settings to allow them).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "January 31, 2023, 09:19:07 PM",
      "body": "Quote from: Welsh on January 31, 2023, 06:29:44 PMAnyway, back to the point; we could distribute the .apk here on the forum along with a way of verifying the download, which in my opinion is infinitely better than hosting it via a third party site like Google Play. Or we could just host source code and .apk files on github, that is if app would be open source.Than we could add it to alternative platforms that host only open source android apps, like Fdroid, NeoStore, IzzyOnDroid, etc.It would be a different story if app would be released as closed source.Much simpler solution is mobile friendly responsive design for forum website.Quote from: Welsh on January 31, 2023, 06:29:44 PMHowever, I'm not sure if this would be possible with Apple devices? I'm not too familiar with them as I tend to avoid them like the plague, can you sideload applications without their store? I don't think it's hard for any developer who would create bitcointalk android app to convert it for iOS app that works on apple devices.Problem is that we would have to wait much longer for app to be investigated, approved and released on their store.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "February 01, 2023, 12:14:16 PM",
      "body": "Quote from: tread93 on January 31, 2023, 04:23:30 PM|~snip~|Simply for the notifications and keeping track of responses to your comments/posts would be much easier IMO. Would it help the forum to grow? Or would it be a very useless add on to something that already works pretty dang good just in and of itself. Probably the latter, but I'd be interested to see/know more about what has been done to make any changes, what's been done but hasn't worked, what is currently being worked on from a developmental standpoint. Is anyone aware of any significant changes that may be taking place in the near future? Just curious. I'm going to guess what's not broken won't be fixed, but again, what is there to really fix? It won't help the forum grow. This forum can't grow this way, it has drained its resources but it doesn't mean that it's left without potentials but definitely that potential doesn't lie behind the forum app. The app can only make things comfortable for some users but there isn't that much demand on this forum to make it worthy to invest in the app development right now. Responsive design and day/night mode is still a necessary addition to make this forum look at least a little modern.I don't wanna sound like I hate this forum, no, it's in my heart, sadly, it's a digital silicon valley for me that is slowly falling apart.This forum can grow but not by just being a forum but it has to do more. I think that one good way will be if it follows the path of XDA Developers. I mean being news website with side forum at the same time. There are other better but very costly options that doesn't even worth to talk about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "February 01, 2023, 12:20:44 PM",
      "body": "We don't even have bitcointalk website optimized for the mobiles yet we are talking about launching an app something similar to reddit, Instagram and other shits lol.It won't be much effective because here we don't see anyone dancing or doing stupid challenge to get some discussion so launching apo won't get kuch traffic as social media but the only good thing is it will be good for readers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "February 01, 2023, 12:32:08 PM",
      "body": "I personally wouldn't use the application, but I understand that a lot of users login with their phones, and the SMF software isn't exactly the most user friendly when it comes to mobiles. Probably, because it was around before most users converted to mobiles. Quote from: dkbit98 on January 31, 2023, 09:19:07 PMOr we could just host source code and .apk files on github, that is if app would be open source.Than we could add it to alternative platforms that host only open source android apps, like Fdroid, NeoStore, IzzyOnDroid, etc.It would be a different story if app would be released as closed source.Much simpler solution is mobile friendly responsive design for forum website.Those work. The only issue it seems in terms of distributing it would be IOS, since they have tighter restrictions. As long as there's a way of verifying it rather than just blindly installing it from the app stores. I'm familiar with Fdroid, so know how the process is with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "February 01, 2023, 03:35:58 PM",
      "body": "Quote from: tread93 on January 31, 2023, 04:23:30 PMI know that this would never happen, but could you imagine if BTalk had an application on your phone? I do not use my smartphone to log into the forum, so such an app would not be of any use to me, although I am aware that many people visit the forum precisely on their smartphones. For them, such an app would certainly be of great help, but at the same time, we should not forget about the risk of hacking BTT accounts, which would certainly increase due to fake apps that would appear everywhere. In case such an app appears one day, I think it should have e-mail 2FA to reduce the risk of hacking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}