{
  "id": "topic_5465330",
  "title": "spectre71",
  "author": "spectre71",
  "created_time": "September 01, 2023, 07:06:01 PM",
  "content": "Ol Bitboy went down in flames a few days ago. It's really not that shocking given the way he carry's himself.I really don't care either way but I do wander through the Youtube/Reddit blow hards. So I hedge against what the collectively say because they are mostly wrong most of the time. There are some REALLY big names that seem to foster a pump and dump cabal. I chuckle when predictions are cast, it mostly hope not real data.Be careful who you listen too",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465330",
  "comments": [
    {
      "author": "mich",
      "created_time": "September 02, 2023, 07:33:31 AM",
      "body": "Yes I agree with you, we need to be careful what we believe from these 'crypto influencers'. There is so many cases right now where they are being sued for advertising scam projects and rub pulls.  In your example Bitboy he made a apology video. And he says he is very sorry but I do not know to believe him or not. https://www.youtube.com/watch?v=-QLRCirF8YY",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "September 02, 2023, 01:40:31 PM",
      "body": "My take away his Mea Culpa doesn't seem genuine. It will play out.Even though it's negative he is getting attention right here right now. He is just one of many making \"predictions\". If anyone is that good at predictions they would be in Manhattan, not making pictures of falling wedges and head and shoulders pattern in moms basement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sysoe",
      "created_time": "September 04, 2023, 08:27:20 AM",
      "body": "That's why it's always a good idea to do your own research and not rely solely on the predictions of these dumb f's. Be patient and don't expect to get rich quick in crypto!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "September 06, 2023, 07:30:26 AM",
      "body": "Well this did not take such a long time. Ben Armstong was once known to us as Bitboy is back on twitter but with a new identity. https://www.youtube.com/watch?v=mlkdT4qNDo8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}