{
  "id": "topic_5477002",
  "title": "jerry0",
  "author": "jerry0",
  "created_time": "December 08, 2023, 05:14:42 AM",
  "content": "Only one I claimed was bitcoin cash and this was a while back.  I haven't claimed bitcoin gold or sv.  I also found out there is ecash and bitcoin diamond that one can claim?Assuming you didn't leave your bitcoin when the forks happened back then in exchanges like coinbase.... you would have to claim those forks yourself.  What percentage of people claimed their bitcoin cash and gold?  What about SV?  Got to assume very few if any claimed SV?  Bitcoin cash had the most then gold?  Then I read there is ecash as well and bitcoin diamond?  I heard back then there were like 30 or more bitcoin forks but they weren't real?How many bitcoin forks did you claim?  Also why would anyone not claim it?  What would be the reason?  I know you suppose to move the btc from the wallet where you kept the btc to a different wallet first before you claim the forks as many would require you to enter the seed phrase of it to claim the forks.  But if you did that, is there a reason why many people didn't claim it?  For me, it's because it is very confusing with many of the forks.  Bitcoin cash was simple though.  Bitcoin gold seems simple but didn't do it.  Bitcoin SV seems a bit complicated but doesn't seem that hard but people mention about no protection replay which makes me not want to do it and not sure what that means.  Ecash seems very confusing and bitcoin diamond seems like something completely different.  Do people even know about ecash or bitcoin diamond?Who here has claimed most or all of them and was it for you?Did anyone here just kept their btc in exchanges and if so which exchanges and then just got their bitcoin forks through exchange and didn't bother with any of this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477002",
  "comments": [
    {
      "author": "jerry0",
      "created_time": "March 05, 2024, 10:41:24 AM",
      "body": "Anyone else claimed the forks?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shishir99",
      "created_time": "March 05, 2024, 12:10:11 PM",
      "body": "I don't know if exchanges paid the forked coins to their users. I guess not. A lot of average users didn't even know that there is something called a Bitcoin fork, and those Bitcoin users will be able to claim those forked coins. If I am not wrong, one of the forum members helped others to claim their forked coins if their wallet was eligible for the fork coins. But he works only if it is your non-custodial wallet. I was not an active Bitcoin user at that time, and I did not have any hefty amount. So, I was unable to get the forked coins. I don't think people think about those shitty coins anymore unless they had a big amount of BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}