{
  "id": "topic_5399656",
  "title": "badluckalways",
  "author": "badluckalways",
  "created_time": "May 21, 2022, 09:01:38 PM",
  "content": "stay away from bitslerLike I told you, this is a scam site onlyI will explain to youMany players lost nitro more platinumus and diamond and black diamonds  now without nitrojust when u reach plat , bitsler will hate you bcz they dont want to ggive you any bonusesso u will lose every Advantages soonIf you do not believe me, go to the site and ask the players, you will deny that the majority of them have lost all the advantagesAll gambling sites always provide gifts and bonusesExcept for this scam siteAlways reduces the prizesbefore lottey was 0.04 btc and every hourthey reduce to 0.02 btc and 8 hours only daily , scam admin say that bcz prevent bot , if he honest He should have make it atleast 16 times daily but he lie now reduce to 100 usdevery players wil lleave this scam site  in this bad site your wager without advantageif you make more million wager in this scam site u will not get anythingbut if u make this wager on stake u will get more and morein this occasion , i want to  that stake increase wekly and monthly 50% in the same time that bitsler scame site reduce all prizes and delete someDon't be stupid like meIf you are a new player, I do not recommend this sitenow im black diamond but It's worth nothingJust a stupid and disrespectful adminDirty site, rubbish and scamDon't let them deceive youIf you see responses in favor of this scam site, know very well that they work within this siteThey are, of course, swindlersJust fuck themfuck bitslerfuck all admins in this scam sitego to hell",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399656",
  "comments": [
    {
      "author": "badluckalways",
      "created_time": "May 21, 2022, 09:27:05 PM",
      "body": "admin in stake love u already love u and if u have problem u can open appeal but in bitsler if u have problem u must call support and wait reply from bad admin that will not replystake is  best site and bitsler is worse sitejust say fuck bitsler Failed and scam site",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "May 21, 2022, 09:48:47 PM",
      "body": "Wait, is this a scam accusation? if so, then you can move your post here - https://bitcointalk.org/index.php?board=83.0, or if we are talking about their reputation, then you can post it here https://bitcointalk.org/index.php?board=129.0...My concern is that you hate Bitsler while you love Stake. Honestly, I love both sites but I'm not actively using Bitsler now so I'm not aware of the bonus issues you are raising here, but to call a site a scam, you should provide some evidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "badluckalways",
      "created_time": "May 21, 2022, 09:50:24 PM",
      "body": "Quote from: Maslate on May 21, 2022, 09:48:47 PMWait, is this a scam accusation? if so, then you can move your post here - https://bitcointalk.org/index.php?board=83.0, or if we are talking about their reputation, then you can post it here https://bitcointalk.org/index.php?board=129.0...My concern is that you hate Bitsler while you love Stake. Honestly, I love both sites but I'm not actively using Bitsler now so I'm not aware of the bonus issues you are raising here, but to call a site a scam, you should provide some evidence. yes  thanks i will",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 21, 2022, 09:56:31 PM",
      "body": "This sounds like a high roller that's disappointed with the changes in bonuses and perks of high level accounts. There is no real case here. You can't just impose what you want and call them a scam when it's not given to you. Promotions vary from one casino to another and it's within their right to change it from time to time. Just leave that casino if you're not satisfied and just play again when they offer more attractive campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "badluckalways",
      "created_time": "May 21, 2022, 09:59:11 PM",
      "body": "Quote from: Yogee on May 21, 2022, 09:56:31 PMThis sounds like a high roller that's disappointed with the changes in bonuses and perks of high level accounts. There is no real case here. You can't just impose what you want and call them a scam when it's not given to you. Promotions vary from one casino to another and it's within their right to change it from time to time. Just leave that casino if you're not satisfied and just play again when they offer more attractive campaigns. Leave and also advise everyoneAlso, all new playersUnderstand the nature of the work of this quorum siteAnd to understand how they treat playersAnd that their admin is very bad and disrespectfulEveryone must understand this, especially new players. I advise them to stay away from this bad site",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "May 21, 2022, 10:00:29 PM",
      "body": "You cannot call it a scam of the rewards is only reduced maybe they cannot take to give huge rewards or advantage because they are not earning good revenues on their casino. Much better to stay away on Bitsler if your not satisfied because there are so many casino exist which can possibly satisfy what you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "badluckalways",
      "created_time": "May 21, 2022, 10:05:35 PM",
      "body": "Quote from: ultrloa on May 21, 2022, 10:00:29 PMYou cannot call it a scam of the rewards is only reduced maybe they cannot take to give huge rewards or advantage because they are not earning good revenues on their casino. Much better to stay away on Bitsler if your not satisfied because there are so many casino exist which can possibly satisfy what you want.Much better to stay away on Bitsler it is true im here to To warn new playersthey must know that it is bad site and have bad teambad admins",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 21, 2022, 10:13:28 PM",
      "body": "Quote from: badluckalways on May 21, 2022, 09:59:11 PM...... Leave and also advise everyoneAlso, all new playersThis bad accusation may actually work in Bitsler's favor. QuoteUnderstand the nature of the work of this quorum siteAnd to understand how they treat playersAnd that their admin is very bad and disrespectfulYou keep saying that but you have not really provided valid evidence. I have read other accusations of bad treatment before but it turns out it's the player's fault.QuoteEveryone must understand this, especially new players. I advise them to stay away from this bad siteGoodluck with your \"crusade\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "badluckalways",
      "created_time": "May 21, 2022, 10:27:14 PM",
      "body": "Quote from: Yogee on May 21, 2022, 10:13:28 PMQuote from: badluckalways on May 21, 2022, 09:59:11 PM...... Leave and also advise everyoneAlso, all new playersThis bad accusation may actually work in Bitsler's favor. QuoteUnderstand the nature of the work of this quorum siteAnd to understand how they treat playersAnd that their admin is very bad and disrespectfulYou keep saying that but you have not really provided valid evidence. I have read other accusations of bad treatment before but it turns out it's the player's fault.QuoteEveryone must understand this, especially new players. I advise them to stay away from this bad siteGoodluck with your \"crusade\". i think that u are work with bitslerI don't care about your wordsI just explained to everyone that it is a very bad siteAnd I say again to all the new players, stay awayIf you want to play, go to stakeStay away from bitsler this bad siteYou will meet the worst admin I will always warn everyoneBecause of their dirty politics",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "badluckalways",
      "created_time": "May 21, 2022, 10:33:28 PM",
      "body": "I repeat, especially for new playersDon't trust anyone who replies, supports and defends bitsler that he is a liarIf you enter and play on this site, you will regret u will meet dirty admin and dirty site they will hate u",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 21, 2022, 10:51:04 PM",
      "body": "Quote from: badluckalways on May 21, 2022, 10:27:14 PM.... i think that u are work with bitslerI don't care about your wordsAre you for real? Someone ask for proofs and you accuse them of working for Bitsler?QuoteI just explained to everyone that it is a very bad siteAnd I say again to all the new players, stay awayIf you want to play, go to stakeStay away from bitsler this bad siteYou will meet the worst admin Yes we all see your explanation but the problem is that these are just your words. Where are your actual evidence of their scam and wrongdoings? Why don't you start providing screenshots or video of you conversations with their admins? Nobody would take your warnings or accusations seriously without those.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "May 21, 2022, 10:56:53 PM",
      "body": "I understand that you are angry and unhappy because something you don't like what the site may have done, but you need to show evidence when you make an accusation or even when you want to warn people, example in this case if you could show a screenshot of that what is happening to you and more people would be of great help and make people believe in you. but you haven't posted anything other than your words and it's hard to believe you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "May 21, 2022, 11:12:36 PM",
      "body": "If you don't like how they manage their casino, then there are plenty of other casinos that you can play your post only backfires on you because of your character of trying to ruin their reputation because of this issue of lowering bonuses giveaways and lottery. Every casino has its own rules and ways to manage their casinos, you cannot decide for other players because the issue is not on withdrawal and deposits or your account, they may have a reason why they do this, you can stop playing for now and maybe in the future they will return or add more bonuses, giveaways and add more prize in their lottery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "May 22, 2022, 04:20:06 AM",
      "body": "Quote from: badluckalways on May 21, 2022, 09:01:38 PMbefore lottey was 0.04 btc and every hourthey reduce to 0.02 btc and 8 hours only daily , scam admin say that bcz prevent bot , if he honest He should have make it atleast 16 times daily but he lienow reduce to 100 usdI could not understand what is the meaning of scam base of your post. Because scam stands for when anyone/site steal money from anyone. Regarding bitsler they have not scam you or someone who claims. Offer might be vary time to time. The time you are mentioning about the prize of lottery the price of btc is not the same of now. And it is the decision of any  website which promotional offer/bonus they will give and which they will pause/stop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "May 22, 2022, 06:18:50 AM",
      "body": "Quote from: badluckalways on May 21, 2022, 10:33:28 PM-snipjust curious, why should we trust you? you have not given us any evidence or any kind of reason for why we should believe what you say. other members are asking for evidence so they can decide whether to trust you or not. you, saying that they are working with bitsler just because they are asking for evidence does not help you in any way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitinity",
      "created_time": "May 22, 2022, 07:20:34 AM",
      "body": "Quote from: badluckalways on May 21, 2022, 09:27:05 PMadmin in stake love u already love u and if u have problem u can open appeal but in bitsler if u have problem u must call support and wait reply from bad admin that will not replystake is  best site and bitsler is worse sitejust say fuck bitsler Failed and scam siteNow you say like this because you are disappointed to some changes made by Bitsler and it is very possible that you will say the same against Stake in the future if Stake make some changes that disappoint you. What you need to understand is that any site reserves the right to change/modify their promotions for a reason. Stake has done it few times as well related to their VIP benefits and there are also many users who disappointed like what you feel in Bitsler but they did not use it to call Stake as scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "badluckalways",
      "created_time": "May 22, 2022, 09:37:36 AM",
      "body": "I understand all of your responsesButWhat I said is that the wager in bitsler are uselessWhy do we play on this site?If you try to attack them in stake , they will accept itThey accept that you are different from themthey apologize and you will find immediate and quick responses so that they understand your problemThey are humble and kind to the playersbut in bitslerHe treats you with arrogance and arroganceIn a rude and dirty mannerIf you don't believe, try to disagree with themYou will find a very harsh responseI do not distort the image of the siteBut it is actually distortedThey are the ones who have slandered him with their insolent actionsTo all the new playersStay away from this site",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "badluckalways",
      "created_time": "May 22, 2022, 03:19:51 PM",
      "body": "stay away from bitsler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "May 22, 2022, 03:53:48 PM",
      "body": "Casinos usually start lowering rewards that they offer due to many reasons. Price of coins drop significantly, players aren't gambling as much, or they were just bleeding too much free money and they feel like they needed to change things up. There's nothing that says they aren't allowed to change things up. If you think you can run a casino better, then open 1 and see if you can sustain giving away thousands in free money daily/weekly. Just because you don't get a ton of free shit, doesn't mean a casino is a scam. Yes another casino may be able to offer more in free stuff, but they have changed terms in their free stuff too i'm sure.Get over it and play where you think you get the most, no need to cry and make a thread trying to damage a casino because you don't agree with their policies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}