{
  "id": "topic_5444441",
  "title": "Godlovesyou",
  "author": "Godlovesyou",
  "created_time": "March 11, 2023, 07:35:40 AM",
  "content": "Folks, my village is too poor and local, no beauty, no good living. Each time I remember them, I shed tears because nothing enticing about us. Our father's need help, our mother's sold leafs and fruits for survival, children are unhealthy, youths are uneducated and jobless, there is no good communication network in my communities, government never cares about us, is been ages of living like the bushmen and massacre.I've being thinking about what to do, am not a politician, I don't access to money and power to change anything. So we came up with an ideas about a year now, me and some old graduates doing nothing. That before we vote any politician into power again, there must be a network communication system in our communities, by God we achieved that last year on our effortlessly ideas. One particular network was initiated.But since we have network, the standard of living is still the same. Though villagers start buying cell phones, android and all. I thought it wise to go and introduce bitcoin trading system to them, we were given the permission by village elders, we pay town cryer to go round the village and beats bell drum and passed the message for everyone to gather at the village square and the turn up was amazing, unexpected crowd because we invited some city friends who into crypto as gurus and villagers love to see people from city how they look like.We commence teaching with practical steps with those who have android phones, interpreting it in our dialect for everyone's understanding. From the pictures you can see mother's, father's, children and youths came there but our target is for the youths to understand digital trading system that requires no formal education and it's was greats. We want the parents to encourage them and support them with the little money them make from farm product sales.I promised the communities to do this with them as many times as we can to enabled everyone learns something outside education. Believe me folks, anybody can touch lives with your gifts, skills and talents. Everybody was following and celebrating as a new light of the village. God is awesome.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444441",
  "comments": [
    {
      "author": "lovesmayfamilis",
      "created_time": "March 11, 2023, 08:03:41 AM",
      "body": "Quote from: Godlovesyou on March 11, 2023, 07:35:40 AMOP, no offense, I'm in no way judging you, but you, as I understand it, are a beginner yourself. And talking about trade without relevant experience and education is extremely imprudent.In the market, it is more important not to lose than to earn. But without knowledge, only disappointment awaits you. Start small and get regular coverage of bitcoin in your community, but don't force people to invest in it. These are very risky assets, and in order to invest something, people must have funds that they are willing to risk, without which people will not end up on the poverty line.Friendly advice, dealing with knowledge first on your own, achieving something, and only then attracting people",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesBorn",
      "created_time": "March 11, 2023, 08:30:32 AM",
      "body": "You've done noble, the government this days hardly care about it citizens not withstanding you did the best thing trying to share knowledge with your community to see how it can be of help but bitcoin or cryptosystem is not emotional thing though, you're still a newbie here I guess your knowledge of bitcoin is not wide but you make it clearly that you invites friends who know who understand how crypto works. Let's says those people pass a good knowledge including the risk aspect of it to their understanding because cryptosystem is wide. But sincerely you guys have done well, is not easy. I love seeing people who wants to extends something of talents, skills, and knowledge to others, not to talk of community and that must have cost you a lot.  Good job for your efforts, expect rewards in future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "March 11, 2023, 08:53:55 AM",
      "body": "Why do you teach or introduce them to trading, trading is a very difficult choice for those who are very new to bitcoin or crypto. Trading, like any other business, is impossible to learn in a week or a few months because it takes years to master it and become a profitable trader, and even then getting through the hurdles and losses first.but i appreciate your initiative but its better if you introduce bitcoin with basics only and gradually, functionally and also the benefits and risks they will accept and face while involved and always suggest to use money they can afford to lose and small capital.and if you're suggesting trading for their income, I don't think that's a good suggestion. And the easiest way they can do is to buy it when the price drops with a small and gradual capital, I think that's the right choice, and just wait for the price to rise patiently to sell it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "March 11, 2023, 03:32:23 PM",
      "body": "Quote from: bitzizzix on March 11, 2023, 08:53:55 AMWhy do you teach or introduce them to trading, trading is a very difficult choice for those who are very new to bitcoin or crypto. Trading, like any other business, is impossible to learn in a week or a few months because it takes years to master it and become a profitable trader, and even then getting through the hurdles and losses first.Investing is difficult but trading is more challenging.I don't think a newbie who does not have any experience in cryptocurrency market will be able to gain profit from trading after a few months. Gaining profit in a day is easy but if it is a long time like a half of year, one year likely you will end with loss.Investment and trading require patience. With investment, patience is needed to hold your coins long enough to take profit. With trading, patience is vital to keep you out of a market and wait for good times to entry with your position and gain profit.If don't have patience, loss is a common result for either investment or trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "March 11, 2023, 03:38:17 PM",
      "body": "It's good that you like your community to be knowledgeable in crypto,but it is too risky to start investing even trading if you don't have stable source of income or job. It is better to establish job first that can hire the people in the community and teach them the value of budgeting and saving. Once their earning it is the time for them to learn how to invest and to trade knowing that even if the market isn't in good contion they will still have money to spend for their needs since they have job and savings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "March 11, 2023, 03:50:41 PM",
      "body": "I think that what you did is just a waste of effort because it is not easy to understand trading in a crowded place when the surrounding climate is still hot.   Do you think their attention is focused on you 100% when there are so many people around them? What you should have done there is to ask what is bitcoin, how can it help our daily people right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "March 11, 2023, 03:51:07 PM",
      "body": "I don't think poor villagers should be learning about Bitcoin trading as it needs investment. I get the whole idea to associate Bitcoin with a way to grow wealth, but its major usecase is as a store or value, which means the holder already has some money to invest in it and hedge against inflation.Those locals should be learning skills they can use to earn a living without much capital. OP you can try partnering with some NGO to bring such training there and with time some can earn enough to be able to buy a few days and start building their stash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "March 11, 2023, 04:14:07 PM",
      "body": "Have read topics of the same interest.But I'm actually curious about something, will they really be interested? Let us be honest, a capital would be needed to engage in this industry as well as other resources. Not to discriminate but I think most of the local communities won't be willing to provide such thing for an investment which is too risky. So question is, would it really work and what for? Bitcoin and this technology in general is not yet acknowledged by many countries at the present. In what sense will they be engaging to cryptocurrencies then? Profit? People on third world countries are needing more of an assured money and this will be generated through saving and working. Investment would work well more with those who has resources and determination to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "March 11, 2023, 05:56:01 PM",
      "body": "Wow, this is a nice innovation but my problem with telling people about Bitcoin is that many of them do not phone or internet services to access the internet and search for Bitcoin. Op had really done a good job and I like it but he need to them tell to invest in Bitcoin and the risk that is involved in the investment. Bitcoin is very volatile do we need to inform people so they will know what they are investing in. With this kind of technique telling people about Bitcoin, it will help to increase the adoption of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "March 11, 2023, 06:04:46 PM",
      "body": "You would need a visual aid for these people to really understand just the basics of BTC. But trading might just be too complicated already. Do these people even have access to the internet? By the looks of the photos, it looks like they live in a rural area. If this is however in the outskirts of Nigeria, it would make sense still as BTC is widely spread. Kudos to your initiative though. Maybe it will work if you start first with the basics of BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "March 11, 2023, 06:18:40 PM",
      "body": "I hope you are ready to take full responsibility for all villages that will be enticed by your btc idea. Since they are poor and mostly uneducated the burden will fall on you to manage their investment for them and as you know in this space nothing is 100% guaranteed and there are several risks involved. Villagers are already poor as it is, and losing the little money they don't have will be devastating for them. Your trying to find ways to alleviate the suffering of your people is outstanding but the idea of btc that is highly volatile is very risky. Hope this turned out well for all of you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "March 11, 2023, 06:25:09 PM",
      "body": "I see Everyone is trying so hard to take this bitcoin adoption to there various communities and it is a great thing for bitcoin mass adoption but sometimes we fail to look at certain things or conditions of those we are spreading the message to. Some of these people usually feed from hand to mouth and bearly have little to invest or save. And bitcoin isn’t for daily transactions because especially for beginners because it only runs them into risk. Personal I think bitcoin trading is not yet a viable option for this kind of people. But regardless it is a great initiative trying to make them aware of the new technology around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 11, 2023, 06:27:07 PM",
      "body": "Op, kudos to you for you to even think of something like this, this is a really interesting initiative, but I do have somethings to say concerning it. According to the pictures present in Op I believe the training you did was just in a single day and I doubt if they got anything from your presentation. You mentioned that most of them just got their android phone recently, meaning they haven't been up to date with trending news and, I even doubt if they even know what Bitcoin is before you mentioned it to them, so if you want to make your teaching effective you need to do it continuously, not just once. And again we are dealing with investment here, telling the parents of the youths to give their children money to invest in Bitcoin trading is a very risking thing to do. Buying and holding Bitcoin is different from trading with Bitcoin, and so is the amount of risks involved. There's no guarantee that they will be a able to trade successfully and we don't even know if you that's teaching them even know how to trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uche6215",
      "created_time": "March 11, 2023, 06:28:19 PM",
      "body": "With all due respect ops, I am not judging 🧑‍⚖️ you. But please compatriots permits me to say this, I don't think \"ops' can handle the situation he' into right now because he hasn't know much about bitcoin investment and his rank can tell that. If ops don't have much ideas about Bitcoin investment and he managed to introduce bitcoin to his local villagers that will definitely generate no time for him to learn more. I don't know if am right or wrong. If you look at the photos 🌌 carefully you will see that the villagers are aged and they can't afford the risk behind investments, we all know how such unknown and risky investment will sound in the ears of the aged ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "March 11, 2023, 07:52:00 PM",
      "body": "I commend your efforts. It will not go unrewarded . This is a brilliant job you have done trying to transmit the knowledge of Bitcoin to your community. I can imagine how difficult it was for you to have gotten the attention of your villagers. This is the good step, if eventually, 1% of the community's population invest in Bitcoin, then it is a big win for you. In your community, is there electricity? If No, then i will suggest you seek for help of electricity from the government and also laptop computer as to enable the people understand bitcoin introduction well. There is a big different in using a laptop computer and mobile phone to teach about bitcoin. It is more easier to use laptop computer than mobile phones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 11, 2023, 08:03:33 PM",
      "body": "Taking a Bitcoin class to educate others is a good thing to do out of having passion for others to have a means to learn about Bitcoin especially those in the rural setting but from what I can see on the pictures displayed by OP, am not convinced enough that this actually had to be a Bitcoin class because nothing here is showing or speaking about Bitcoin than the traditional dance held during on local community gathering, moreso much of this kind is getting too common from newbies these days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "March 11, 2023, 08:09:55 PM",
      "body": "Quote from: Aanuoluwatofunmi on March 11, 2023, 08:03:33 PMTaking a Bitcoin class to educate others is a good thing to do out of having passion for others to have a means to learn about Bitcoin especially those in the rural setting but from what I can see on the pictures displayed by OP, am not convinced enough that this actually had to be a Bitcoin class because nothing here is showing or speaking about Bitcoin than the traditional dance held during on local community gathering, moreso much of this kind is getting too common from newbies these days.Maybe, they have some extra fun during the class. We can't judge what truly happened in that session.However, I am with the side of lovesmayfamilis, the OP is also a beginner himself. So he might give a different impression about the market.Should be upfront that this market needs good understanding before they can start to trade. This may give them false hope of earning tons of money.The OP should advice them to start small if they want to test the market. There's a lot to learn before they can truly earn something.But let's say, this is a good start. Only few of them will push thru the actual trading. I hope the OP didn't give them the hope that this is their way out to poverty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "March 11, 2023, 08:13:23 PM",
      "body": "I do not believe you, and I am sure that many other forum members are not buying this story, but are just taking it easy on you. Anything can be going on there in that gathering. It is not enough to come tell us that you introduced bitcoins to your community without any substantial proof to back it, just to gather applause. There is no even one place in those pictures where there is any material pointing that some kind of teaching about bitcoin is going on, it looks entirely like another activity that you just took pictures of and fabricated a story around. If it is true and I am wrong, you need to do better next time, the surrounding is too rowdy, and people cannot learn under such situations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "March 11, 2023, 08:14:04 PM",
      "body": "Did you teach Bitcoin TRADING or Bitcoin TRANSACTING?  Big, big difference.  Before trading, how Bitcoin works and how to transact with Bitcoin is so much more important than risking the little you have with little to zero experience.I know.  It is so much more appealing to the masses if Bitcoin gets them money.  How many truly care that Bitcoin makes them independent and banked in areas where people are unbanked?But after all, the most important aspect of Bitcoin is that it gives free banking to the unbanked.  It can give you Privacy levels no Bank can.  It never censors any body unless they try to cheat the system.  Of course.  Not every body cares about all of that.  But Bitcoin is not for every body anyway.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}