{
  "id": "topic_5409974",
  "title": "Sumarokov",
  "author": "Sumarokov",
  "created_time": "August 15, 2022, 06:02:37 PM",
  "content": "Hello. I have downloaded Electrum software to my laptop (Windows 10) and I keep my Bitcoin in my wallet on the laptop.I have now bought a new laptop with Windows 11. I would like to have my Electrum wallet on this computer now, as I fear the old laptop is going to give up the ghost very soon. I am not very tech-savvy, but I do know all about verifying the signature, etc., which I always do when I download a new version.Can anyone provide a link to a handy step by step guide to \"migrating your Electrum wallet to a new PC\"? What happens if I download Electrum onto my new laptop? Will my Bitcoin now be visible on both computers or do I make this one my \"single wallet\" as it were..?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409974",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "August 15, 2022, 06:04:41 PMLast edit: August 15, 2022, 06:23:08 PM by OmegaStarScream",
      "body": "It's pretty simple and straightforward if you have your seed phrase. After installing the software, you can follow this video: https://www.youtube.com/watch?v=pz5Bia_h3RU* Ignore the comments on the above video, there are a lot of scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "August 15, 2022, 06:08:14 PM",
      "body": "You can import your seed phrase into your new laptop. In this way, you can have access to your bitcoin in both laptops. If you worry about the security of your old laptop, you should create a new wallet in the new laptop and make a transaction and move all the fund to your new wallet. In this way, your bitcoin will be no longer accessible in the old laptop.  Note that with having the same wallet in two computers, you double the risk of getting hacked, being robbed, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "August 15, 2022, 06:33:32 PM",
      "body": "When your old laptop does give up, you might want to look at taking out your old hard drive and keeping it safe if you have  a lot of crypto on it if you don't migrate your funds to a new electrum wallet (your hard drive will be smaller than a 3 inch square but it may be problematic if it ends up in the hands of someone who wants to steal from it).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sumarokov",
      "created_time": "August 15, 2022, 06:38:22 PM",
      "body": "Thanks for all the suggestions. I have one further question.When I first set up an Electrum wallet, I see that I went through Kleopatra, GPA, etc., as I still have these on my old laptop screen.The thing is that I cannot remember the whole process, especially because I am not tech-savvy.Is it enough for me just to download the latest Electrum software to my new PV and verify the signature?This requires Kleopatra, if I recall, correct? Is there any link to a step by step process?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "August 15, 2022, 06:57:29 PM",
      "body": "Quote from: Sumarokov on August 15, 2022, 06:38:22 PMIs it enough for me just to download the latest Electrum software to my new PV and verify the signature?With verifying the signature, you only make sure that you haven't downloaded a fake version of electrum. That doesn't mean you are 100% secure. There's still the chance that your computer is infected with a malware.  Quote from: Sumarokov on August 15, 2022, 06:38:22 PMThis requires Kleopatra, if I recall, correct? Is there any link to a step by step process?Follow the guide provided by DireWolfM14. [GUIDE] How to Safely Download and Verify Electrum [Guide]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 15, 2022, 08:41:54 PM",
      "body": "Quote from: Sumarokov on August 15, 2022, 06:02:37 PMCan anyone provide a link to a handy step by step guide to \"migrating your Electrum wallet to a new PC\"?You restore the wallet using the seed phrase. Basically that should be it.Quote from: Sumarokov on August 15, 2022, 06:02:37 PMWhat happens if I download Electrum onto my new laptop? Will my Bitcoin now be visible on both computers or do I make this one my \"single wallet\" as it were..?Since the coins are not in the wallet, they're \"on the blockchain\" or \"on the network\" (overly simplified explanation), yes, both wallets should see (and work with) the same funds.After you can see properly the funds on the new wallet, you can remove the old one if you want to. Or not. As you prefer.I will add that Electrum on Windows is just as safe as your Windows system (so malware is a real threat). So if you have meaningful funds in your wallet you may consider getting a hardware wallet and move your funds there.Also, with the wallet on 2 PCs, there are 2 places that can get malware/hack (also you have to be overly careful if you ever want to sell/give away the older PC, some people do know how to recover even removed wallets).So another worthy \"path\" could also be to make a new wallet on the new PC and send the funds there (but, again, I prefer the path of hardware wallet, which in my case can be used with Electrum).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 15, 2022, 11:28:15 PM",
      "body": "Quote from: Sumarokov on August 15, 2022, 06:38:22 PMThis requires Kleopatra, if I recall, correct? Is there any link to a step by step process?The step by step guide posted by hosseinimr93 above works before but in my case with windows 10 the latest version of Electrum some other process do not work you need to do this below to be able to verify the latest version of Electrum. Quote from: BitMaxz on July 19, 2022, 12:19:30 PMIf you have a problem with the lookup server when trying to search the fingerprint from the link above you can try this guide below- Open Command prompt as administrator- then send this commandCode:gpg --keyserver keys.gnupg.net --recv-keys 6694D8DE7BE8EE5631BED9502BD5824B7F9470E6- Open Kleopatra and paste this below on the notepad- https://raw.githubusercontent.com/spesmilo/electrum/master/pubkeys/ThomasV.asc- Then you can now start verifying the downloaded electrum 4.3.0If this still does not work read more from this below for other alternatives - https://bitcointalk.org/index.php?topic=5405015.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 16, 2022, 11:04:26 AM",
      "body": "Quote from: Sumarokov on August 15, 2022, 06:02:37 PMCan anyone provide a link to a handy step by step guide to \"migrating your Electrum wallet to a new PC\"? What happens if I download Electrum onto my new laptop? Will my Bitcoin now be visible on both computers or do I make this one my \"single wallet\" as it were..?Importing seed phrase would recover your wallet in any other device but that way you won't get any notes and labels you made for pervious transactions and addresses.Easiest way would be to copy entire Electrum folder, but you can also Export manually everything you need from Wallet tab, including labels, history, contacts, invoices, etc.After backing up this file you can Import them in wallet you install on new laptop with imported seed words.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "August 16, 2022, 06:01:50 PM",
      "body": "Why don't you just copy the Electrum wallet file from the wallets folder when it is available. Restauring from mnemonic seed words would be last resort for me as you'd loose any meta data of your Electrum wallet (transaction description, address labels).Location of the Electrum folder where the wallets folder usually resides is well documented in the Electrum help documentation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "August 16, 2022, 07:33:52 PM",
      "body": "As stated above already, you can use seed phrase import, or wallet file if you do not want to lose informations not pertaining to bitcoin and its blcockchain, like the transaction description and adddress labels that were mentioned by Cricktor.Quote from: Sumarokov on August 15, 2022, 06:02:37 PMWill my Bitcoin now be visible on both computers or do I make this one my \"single wallet\" as it were..?If you import the seed phrase to the Electrum wallet on your new computer, you will see your coins there too. If you are having internet connection and both wallet synchronized with the blockchain, definitely the both wallets are the same, if you spend coin on one, it would appear on the other as it synchronizes with the blockchain. But there should not be need of having two online wallets for the same purpose to track and spend the same UTXOs, being online wallets makes it more prone to attack, I will advice you to delete the wallet from the old laptop after you import your seed phrase on the new wallet.Do not forget to always have offline backup of your seed phrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sumarokov",
      "created_time": "August 16, 2022, 07:50:18 PM",
      "body": "The above guide is good, but it is not very clear and unambiguous. It is not a step by step guide.Can someone explain some things:1. It says \"Download ThomasV's PGP Key\" and nothing else. There is no step by step guide to how this is actually done. But surely it is important to give as much information as possible on a subject where security is supposed to be so very, very, very important?Does this mean Download ThomasV's signature from the Electrum website? Or are they separate things?2. The guide has Redundant links to ThomasV's public key. But why have links if they are redundant? Or is there another meaning of the word \"redundant\"? Redundant normally means \"no longer in use\".3. The guide does not cover some important points. For example, after installing GNU Privacy Guide, I found some important points on this video suggesting that you ask \"show more details\" rather than just click on Yes. https://www.youtube.com/watch?v=lCG3c8a7HZIBut this is not included in the above guide. If you are doing such things for the first time, how are you supposed to know? But then, if you suffer a problem, everyone will say: Why did you not do this/that? But how are you supposed to know if such things are not included in the guide and you are doing this for the first time?Is there maybe another guide that is really step by step and takes you through every single step and does not leave anything out? On a website or maybe online video?Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "August 17, 2022, 05:54:46 AM",
      "body": "Quote from: Sumarokov on August 16, 2022, 07:50:18 PM1. It says \"Download ThomasV's PGP Key\" and nothing else. There is no step by step guide to how this is actually done. But surely it is important to give as much information as possible on a subject where security is supposed to be so very, very, very important?Does this mean Download ThomasV's signature from the Electrum website? Or are they separate things?First, you download and import ThomasV's key on GPG4Win.Then, you verify if the Electrum signature (which you downloaded on the official website) was signed with his key (which you imported before).Quote from: Sumarokov on August 16, 2022, 07:50:18 PM2. The guide has Redundant links to ThomasV's public key. But why have links if they are redundant? Or is there another meaning of the word \"redundant\"? Redundant normally means \"no longer in use\".Redundant means that you can find his key on many places, so it is always available at least somewhere. It also means that you can check multiple sources in case one of them is compromised.Have you actually tried following his guide?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 17, 2022, 08:13:50 AM",
      "body": "Quote from: Sumarokov on August 16, 2022, 07:50:18 PM1. It says \"Download ThomasV's PGP Key\" and nothing else. There is no step by step guide to how this is actually done. But surely it is important to give as much information as possible on a subject where security is supposed to be so very, very, very important?Does this mean Download ThomasV's signature from the Electrum website? Or are they separate things?You need ThomasV (and most probably others' too) keys, you can find them on Electrum download page, just before \"Sources and Binaries\".Quote from: Sumarokov on August 16, 2022, 07:50:18 PM2. The guide has Redundant links to ThomasV's public key. But why have links if they are redundant? Or is there another meaning of the word \"redundant\"? Redundant normally means \"no longer in use\".You must have been confusing \"redundant\" with \"obsolete\". Redundant means duplicates are available in more places which, in this case, is very good (in case that hackers may replace one website, let's say).Quote from: Sumarokov on August 16, 2022, 07:50:18 PM3. The guide does not cover some important points.Make sure you downloaded Electrum and the signature asc file from the same row.* Search for kleopatra pgp, download, install* import ThomasV and others' public keys you downloaded (double click on asc and wait for a window show up)* optionally make yourself a key and certify those imported keys* double click electrum's asc file (make sure the downloaded exe is in the same folder), see what the result window tell (if you did the optional step, the window will be green).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sumarokov",
      "created_time": "August 17, 2022, 10:06:35 AM",
      "body": "Quote from: TryNinja on August 17, 2022, 05:54:46 AMFirst, you download and import ThomasV's key on GPG4Win.Can you explain in very simple terms how this is done?What I mean is a step by step guide through every single step of the process, i.e. where you go, what you click on?I am just a starter and such general phrases are actually terribly confusing to me. Even the English. For example:download and import ThomasV's key on GPG4WinDoes this mean on the platform which is GPG4Win? Or does it mean download to GPG4Win?I would be very grateful if someone could point me to a guide which takes me through every single step of the process in as much detail as possible, preferably with pictures or in an online video. Also, one which includes everything, so I cannot be told: why did you not do that??? Answer: because I didn't know!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "August 17, 2022, 02:23:56 PM",
      "body": "Quote from: Sumarokov on August 17, 2022, 10:06:35 AMCan you explain in very simple terms how this is done?What I mean is a step by step guide through every single step of the process, i.e. where you go, what you click on?I am just a starter and such general phrases are actually terribly confusing to me. Even the English.Have you seen this step-by-step guide: [GUIDE] How to Safely Download and Verify Electrum [Guide]? In my reception this is quite step-by-step enough, but YMMV. The language barrier is everybody's problem who is not a native English speaker (I'm not, so I learned English long ago and practise daily; for other languages that I have no clue of, translators exist and usually aren't bad either). If you need more knowledge to use a computer, take courses, it's no rocket science.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 17, 2022, 11:15:35 PM",
      "body": "Quote from: Sumarokov on August 17, 2022, 10:06:35 AMCan you explain in very simple terms how this is done?What I mean is a step by step guide through every single step of the process, i.e. where you go, what you click on?If you are a bit confused from the suggestions above why not follow some guides that are already on youtube?I found one video which is easy to follow when verifying Electrum and its signature.Check this one https://www.youtube.com/watch?v=TzOHLL_dKCMJust make sure to change the version when typing the command you don't need to open Kleopatra according to the guide above it is pure command prompt in Windows. Or if you want to verify GPG of the Electrum installer through Kleopatra why not try this one https://www.youtube.com/watch?v=Y0zgZ4M1Bro",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 21, 2022, 08:50:06 AM",
      "body": "@Sumarokov The guide mentioned to you by DireWolfM14 should be enough to verify your Electrum client. The only difference is that the executables are now signed by 3 developers and not just one like it was in the past. But even that is mentioned. It explains how you can Import ThomasV's PGP Key, so you can just follow the same procedure to import the keys from SomberNight and Emzy (the other two signers of the files).It's not mandatory to do that. Even if you don't certify all the keys by all 3 developers, you will still be able to verify the application. The only difference is the verification results you will see. DireWolfM14 shows you 3 screenshots. One is when only ThomasV's PGP Key has been certified, the other is when all three developer keys were certified, and the 3rd image shows a text in red when the verification fails.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}