{
  "id": "topic_5412472",
  "title": "Question:",
  "author": "tokeweed",
  "created_time": "September 05, 2022, 01:47:58 PMLast edit: October 01, 2022, 12:26:34 PM by tokeweed",
  "content": "Let's do something different for September's poll instead of the usual yes or no votes.  Anyway..  Looking at the chart below, it seems like BTC at 19k - 20k is being defended pretty well for the last couple of months.  But how long will it last?  Is the bottom finally in for BTC as some of you guys are already saying or does it have one more leg down to go?Remember, it's all for fun.  Vote what's in your heart of hearts.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412472",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 05, 2022, 01:54:56 PM",
      "body": "What that matters is that the best time to hold is now, bitcoin plummeted from $69000 to $20000, that is a significant bear market. And you know what? The best time to hold is when others are panicking. Remember that 1 BTC equals 1BTC, nothing like liquidation, only what will happen would be unrealized loss if the price of bitcoin decreases further, but it would be happy ending when bitcoin reach all-time-high.But if it would be fun to predict what the highest and the lowest bitcoin price would be in this month, I presume that bitcoin is not going down below $17000. I may be wrong, but that does not make my statement of holding bitcoin now to be invalid, it is still very valid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jhanzo",
      "created_time": "September 05, 2022, 01:59:09 PM",
      "body": "Me thinks this should be the bottom unless shit happens with certain alts that make people lose a little more faith in crypto again.Things a bit uncertain right now with certain alt \"upgrade\" which can go either way really quick.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 05, 2022, 02:24:20 PM",
      "body": "You ask a difficult question, because both options are possible considering the moment we are in - and these are special economic circumstances that have not been seen at least in the past 40-50 years. Therefore, this is not only a test for Bitcoin, but also for the stock market and for all related markets that face great challenges.I'm not pessimistic, but at the moment it seems to me that we are closer to $15k, although I don't think it will happen that the price will drop that low (at least not this month). Maybe we will see another attempt to get closer to $25k, but like the first time, it is hard to expect that many will not try to profit and thus bring down the price again. When you are in a bear market, every opportunity for profit is good, no matter how modest it may seem (at least for small investors).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 05, 2022, 02:47:42 PM",
      "body": "Quote from: Jhanzo on September 05, 2022, 01:59:09 PMThings a bit uncertain right now with certain alt \"upgrade\" which can go either way really quick.Looks like there are a few alts that have coincided their major forks too to around the same time so it might be something that becomes increasingly more interesting (/problematic) to watch. Based on luna's unlocking though, what if we're already priced in for a movement like that (with the lack of upward move on btc beyond $70k)? Quote from: Charles-Tim on September 05, 2022, 01:54:56 PMWhat that matters is that the best time to hold is now, bitcoin plummeted from $69000 to $20000, that is a significant bear market. And you know what? The best time to hold is when others are panicking. Remember that 1 BTC equals 1BTC, nothing like liquidation, only what will happen would be unrealized loss if the price of bitcoin decreases further, but it would be happy ending when bitcoin reach all-time-high.But if it would be fun to predict what the highest and the lowest bitcoin price would be in this month, I presume that bitcoin is not going down below $17000. I may be wrong, but that does not make my statement of holding bitcoin now to be invalid, it is still very valid.$17k is not too far away and it wouldn't be too problematic for us to go that low imo, even the $14k that has been predicted before wouldn't be much of a problem to most that have held so far.No one's really actually called for the price to halve too which might be an even more positive thing (the lowest I've seen suggested is $10k - which I could imagine would be huge support).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "September 05, 2022, 04:10:12 PM",
      "body": "This month I return to neutral stance. August failed to break the $20K lows and confirm bearish continuation, as well as failing to confirm bullish follow through above $24K after July's bullish close. On the monthly scale, price remains within a range these past two months, so until this range is broken, there isn't much confirmation for capitulation or a rebound to the upside, despite speculators strong convictions.I otherwise think the first half of the month could end up being quite bearish, with fears of MtGox coins being redistributed. But once retailers recognise that these repayments won't all be at once, and will likely take until the end of the year, then price can start to recover. Not that 10% extra selling pressure in a day would change much, but clearly the fear factor will always be of further capitulation until proven otherwise.So in summary, I think first half down, second half up, probably ending up back in the neutral zone between $20K and $24K. Ideally above $21K to $22K though",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "September 05, 2022, 04:27:23 PM",
      "body": "I think we’ll trend sideways, perhaps slightly down. We’re in a bit of a crab market atm, lots of indecision. To answer the question in the OP, we will be closer to $15,000 but not by much. I don't think we’ll make a new low but we could touch high 18k.I think the bottom of this cycle will come before Xmas but I don’t expect it to be in September.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "September 05, 2022, 04:43:05 PM",
      "body": "just giving a poll for $25k, if the price continues to hold on and rises by the middle of this month I think we will be above $20k again because I'm not sure the price will hit $15k, inh just my opinion it all comes back to market demand",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurilham",
      "created_time": "September 05, 2022, 08:31:28 PM",
      "body": "Voted $15k. But I don't think BTC will hit $15k, the gap is quite big from the current price ($19k). Since Bitcoin didn't drop very significantly in the last two months, I think the possible lowest price for this month is around $17k - $18k.Well, lately, we rarely heard good news related to Bitcoin. In this matter, I don't see a sign for Bitcoin to rise closer to $25k. Although we don't know what's happening in the next few days, I think there will be no big move in Bitcoin price this month. however, it seems to be more inclined to go down than to go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "September 05, 2022, 09:14:19 PM",
      "body": "25k is more likely as its a prior price we've seen recently.  We can revisit more easily that price then break back to 2019 kind of pricing.    I wont answer absolutely just yet as Im waiting for price action to break something of a triangle.  Im mildly optimistic as I see we outran a downtrend true since mid August.  If we pass beyond a negative trend, doesnt it go to say we can then rise more easily and recover some of those losses, not sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 05, 2022, 09:51:14 PM",
      "body": "I also think BTC will go sideways this September.  There is neither news that can FUD the market nor news that can trigger hype or a FOMO.  This article from Cointelegraph somehow summarizes the current event in BTC market.  So for now there isn't much of activity around BTC that is why I think it will go sideways along the range of $19k - $21k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "September 05, 2022, 09:54:56 PM",
      "body": "Lol, at the time I voted, I was the fifth vote for 25k, it was 5-5 equal to each other. I can't believe that its really that close for people. I am not saying that it will not be possible for 15k to be closer, but it would be quite difficult for the world to see the current situation as \"bad\" and thats why I am not expecting it to be that bad. What we had just a month ago was around 24k and I am guessing that instead of dropping even further, we will probably reach to a 24k level once again which would be closer to 25k levels. But the fact that it is so tied, means that we are talking about something that is quite good for the crypto because if \"known\" then its usually a false idea, but when unknown, thats good because you do not have any false ideas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AjithBtc",
      "created_time": "September 05, 2022, 10:39:47 PM",
      "body": "During the last two years of bitcoin price, there is no big changes over the month. The price of bitcoin during Sep 2020 is around $10k to $10500. During the year 2021, month of September the price was around the range $40k to $49k. Based on the movement over the last two years we're on an average growth. Maybe this will set the market to be stable around $20k through this month.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "September 05, 2022, 11:59:12 PM",
      "body": "When someone wants to know the price of Bitcoin ahead of time, I always say,  \"oh, that's a difficult question\" which is the fact. I voted $15k, but that's not exactly the price that I have in my mind, it might be the price that will play at the $20k range but it will not resist over that within this month.  I guess possible, that the Bitcoin price will bounce back after this correction in the first month of the 4th quarter of this year which is we expect that the Bitcoin price will usually be in a bullish trend during the month of December, IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 06, 2022, 06:21:59 AM",
      "body": "I foresee a lot of boredom, and looking at the poll results, so far 50% for each option, and the responses, I think that's the general trend. We do not know if an unpredictable event this September can give us a great joy or lead the price to pierce lows, but the most likely scenario is that we will stay in a range between the two options in the poll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 06, 2022, 08:04:14 AM",
      "body": "I wanna vote both but it is not possible That's the \"prediction\" anyways, it can go both ways but obviously the reality is not changing and it is best summarized by this picture:Source: https://www.reddit.com/r/Bitcoin/comments/x6pae2/inflation_relief_packages/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "September 06, 2022, 08:36:46 AM",
      "body": "My thought is that we've seen the bottom already and we're on the support. $19k is likely the strong support and if it breaks down to $18k then we might see the lower of it like lower than $17k.But whatever it will result at this month, one exciting part is what makes me think that there's more to go up to the end of this year which is always what everyone to see. And if it pass, we're now 1 year away to the halving but since this is just for September, I've voted for $25k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 06, 2022, 09:34:07 AM",
      "body": "Quote from: dragonvslinux on September 05, 2022, 04:10:12 PM~snip~I otherwise think the first half of the month could end up being quite bearish, with fears of MtGox coins being redistributed. But once retailers recognise that these repayments won't all be at once, and will likely take until the end of the year, then price can start to recover. Not that 10% extra selling pressure in a day would change much, but clearly the fear factor will always be of further capitulation until proven otherwise.According to all relevant information, this distribution will not begin in the next 3-6 months, which means that it will not happen until the end of this year. Personally, I think that this information is something that the majority interpreted completely wrongly, because the fear of some 140 000 BTC that will be dumped at some point is complete nonsense. People needed a reason to explain the bear market and they found it, and the fact that their reason is completely meaningless doesn't worry anyone too much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "September 06, 2022, 10:01:09 AM",
      "body": "Quote from: tokeweed on September 05, 2022, 01:47:58 PMLet's do something different for September's poll instead of the usual yes or no votes.  Anyway..  Looking at the chart below, it seems like BTC at 19k - 20k is being defended pretty well for the last couple of months.  But how long will it last?  Is the bottom finally in for BTC as some of you guys are already saying or does it have one more leg down to go?Remember, it's all for fun.  Vote what's in your heart of hearts.there is a divided votes , looks like this is the real sentiment of the community and the market as well because there are even fair votes in the poll.I wanted to see bitcoin going back to 25k but it does not look it will happen this month , instead it will come in the 4th quarter and will go even high.but actually this does not bother me because I am now ready to keep holding till the end of year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitterguy28",
      "created_time": "September 06, 2022, 10:40:55 AM",
      "body": "Looking at the vote counts , there are others that much believing in bitcoin to be falling than increasing this month of September and yeah we cannot blame them as we are now entering the area of 3rd quarter ending out.so basically the next speculative is the last quarter in which will be starting in the next couple of years.I also voted for 15k bottoming and also this is what i wanted to happen now , there are extra funds that i wanted to Add to my bitcoin holding so if this to happen then i will be very thankful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}