{
  "id": "topic_5400115",
  "title": "Streamixio",
  "author": "Streamixio",
  "created_time": "May 25, 2022, 07:41:38 AM",
  "content": "Cryptocurrency Prediction: Bitcoin Could Plunge to $25,000Fears of a recession, supply chain issues, a China lockdown, and tightening monetary conditions led investors to trim exposure to risky assets last week.The Dow Jones Industrial Average recorded its first-ever eighth-straight weekly loss since 1923. Identically,Bitcoin also made history by closing in the red for the eighth consecutive week.#Bitcoin #TerraUsd #Luna #CNBC #CCI #Cryptomarkets #Crypto #Cryptocurrency #CryptonaireWeekly #platinumcryptoacademy",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400115",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 25, 2022, 07:54:27 AM",
      "body": "While it's totally possible — yea, the last time I've heard of a 20k+ prediction was like what? 4 minutes ago? Some original content right here!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virtualdn",
      "created_time": "May 25, 2022, 08:01:56 AM",
      "body": "So what. The prices are not set in stone. One day it will go back to $65,000 and beyond. People are making such a drama out of this. Relax and enjoy the ride. The world we live in is so dramatic lately. 1 BTC = 1 BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "May 25, 2022, 08:14:49 AM",
      "body": "I hate reading about Bitcoin predictions. At the same time when people are predicting $25k or even $19k, we have other people saying that Bitcoin is in the perfect buy zone for accumulation. The price has reversed from areas of $29-30k several times in the past and it's apparently time for one more run. And whatever happens there will be someone to say: I told you so!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Honnet43",
      "created_time": "May 25, 2022, 10:30:00 AM",
      "body": "Bitcoin was good even when it was worth $100. I see no reason to panic when it costs tens of thousands of dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 25, 2022, 11:05:59 AM",
      "body": "bitcoins hashrate is holding good ground above 200exahash.meaning the value support of the most efficient mining cost is giving good support where no one wants to sell for less than a certain level because they cant mine it any cheaper and thus no one wants to sell below certain rate and more are happy to buy it at certain levels above that. although this month there are next gen asics being delivered out at mining costs of the most efficient mining below the $30k/btc rate, these asics are not mining at super low costs in comparison to this topics suggestions. so i dont see a massive price fall. although i am already a BTC hoarder from early years. even i seen the price of bitcoin at £24.500($30,600) and threw in £5k($6.25k) to buy some more btc as play money to just use as a temporary 'punt'/investment.. and i am not crying. yes no one can predict the exact moment of the exact bottom of this years low but im happy with buying at the rate i did as its close enough to what i see as being near this years potential bottom(pending low for the year).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "May 25, 2022, 11:10:44 AM",
      "body": "Quote from: franky1 on May 25, 2022, 11:05:59 AMyes no one can predict the exact moment of the exact bottom of this years low but im happy with buying at the rate i did as its close enough to what i see as being near this years potential bottom(pending low for the year).A few weeks ago they were up to $26.7k. If it breaks then I think it could be that they're going to go to $22k, maybe even up to $15k. But as long as I go through the halving cycle 2 times this becomes like a normal thing. Cycles like this are expected to keep repeating themselves. So that after the halving period will appear a new High Price, at this time we are just patient and hope that nothing damages that trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}