{
  "id": "topic_5499714",
  "title": "Chiomaobi",
  "author": "Chiomaobi",
  "created_time": "June 12, 2024, 05:43:17 PMLast edit: July 09, 2024, 10:28:43 AM by Chiomaobi",
  "content": "There are several advantages of taking Bitcoin as payment. Depending on who you are the different advantages I am about to list could mean everything or nothing at all.Non-refundable.Someone can’t just call the Bitcoin company and make up a lie that they never received their product. Once you have the Bitcoin it’s yours.International. Provided you have internet and some sort of computer device you can download a Bitcoin wallet and take payments. You don’t have to worry about the customer coming from a country with poor currency. It’s also much faster than Western Union Wire Transfers. You can also make payments with it anywhere in the world that a merchant accepts it.Non-Institutional.Bitcoin is not tied to any government, corporation, religion, or institution. If you live in a country with a failing government or failing currency you can still do business and not worry about losing all your hard earned money.Lower Fees.As mentioned before the fees are much cheaper than Western Unions.Security.The Bitcoin network has never been hacked. Provided you properly store your private keys your Bitcoin is safe.Non-banked. Bitcoin does not require a bank to use. This means that you can take online payments from people who do not have bank accounts. You also won’t have all those pesky bank fees. You also don’t have to worry about your Bitcoin being frozen arbitrarily by a bank.New Customers. Make an announcement that you are accepting Bitcoin and it will draw attention from the cryptocurrency crowd. Believe it or not there are more of them then you think.Source.https://www.quora.com/What-are-the-benefits-of-accepting-Bitcoin-as-a-method-of-payment",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5499714",
  "comments": [
    {
      "author": "Davidvictorson",
      "created_time": "June 12, 2024, 07:25:23 PM",
      "body": "So what is your experience ? We know to benefits of accepting Bitcoin as a payment method do you want to share your experience of using bitcoin as a payment method for an item or commodity because? I love great customer service and I would choose a Fiat only business over a business where Bitcoin is accepted if their customer service is bad. Therefore the benefits of Bitcoin as a payment method which one of it is new customers depends on the service delivery. A shop or business that puts customers first will have new customers while one that doesn't won't have even if they announce having Bitcoin as a payment method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "June 12, 2024, 07:38:58 PM",
      "body": "The most important benefit of accepting Bitcoin i could think of at the moment is the fact it's like an payment with possibility of more profits. Let's say if I have received $10000 as a payment and in a week the akue f Bitcoin increases by 10% then I would have $1100 if I hodl it. But I strongly object to your point saying it's cheaper than western union, I think you should check the transaction fee during bull run or when Bitcoin's value is higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "June 12, 2024, 08:03:06 PM",
      "body": "Quote from: Chiomaobi on June 12, 2024, 05:43:17 PMNon-refundable.Someone can’t just call the Bitcoin company and make up a lie that they never received their product. Once you have the Bitcoin it’s yours.Though the points you've highlighted here are correct, I still can't understand your first point mind explaining? Bitcoin can do a lot !ore, providing a wide range of payments and economical possibilities in the crypto market. With Bitcoin, you can make cross boarder transactions with less fees and faster compared to the local country across boarder payments. Having Bitcoin makes you your own bank and literally, you cannot be controlled by the government or any institutional body except you use centralized bodies that a payment system. Though we can say that Bitcoin adoption is gradually increasing, but not every county is yet to permit it as a payment system for their citizens making your last point not totally agreeable. As in some countries, making such announcement would or might get you into trouble with the authorities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "June 12, 2024, 08:14:35 PM",
      "body": "Quote from: kentrolla on June 12, 2024, 07:38:58 PMThe most important benefit of accepting Bitcoin i could think of at the moment is the fact it's like an payment with possibility of more profits. Let's say if I have received $10000 as a payment and in a week the akue f Bitcoin increases by 10% then I would have $1100 if I hodl it. But I strongly object to your point saying it's cheaper than western union, I think you should check the transaction fee during bull run or when Bitcoin's value is higher.It's not an advantage for a business owner who needs to pay bills and operates on small margin. You may not know this, but most resellers get less than 5% in profit. This is especially visible in the cost of gasoline, but also new cars, apartments, and many other goods and services. Let's say you have a car dealership and the cars sell for $50k and you get 5%, so 2,5k in profit for every car you sell, but you have to pay staff, electricity bills. When you subtract all of that you end up with maybe 1k in your pocket. By the time you're done bitcoin goes down 10% and you have $250 less. It can go up, but you can't wait, you have bills to pay, so you sell at a loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GideonGono",
      "created_time": "June 12, 2024, 08:28:11 PM",
      "body": "For me accepting crypto as a payment method has its advantages and disadvantage.Some might see it as expensive due to the transaction fee, and also they would need to wait till it has been confirmed.We should also consider the price, we all know that crypto is volatile so the price could move up or down which could give the receiver more profit or lose in their business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "June 12, 2024, 08:29:58 PM",
      "body": "As i've said over and over again, and I will forever stand by this statement, bitcoin will never reach it's full potential without being an elite payment system.  I know most are shifting to the \"digital real estate/store of value\" take, which I'm not disagreeing with, but why can't it be all three is what I don't understand.  I mean..why not?  The devs are continuing to implement things such as segwit, taproot (thanks to our own Gmaxwell) and other upgrades to help with transaction speeds (I imagine transaction costs as well, but not smart enough to know if that's a big focus for them or not, or if they go hand in hand).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 12, 2024, 08:33:55 PM",
      "body": "Op if you accept bitcoin as a payment method in your business then it is refundable. I have seen people refund bitcoins back to the sender because of a mistake made by the sender. So if you send bitcoin give seller and you decided to leave the good and not to buy again the. The seller would refund the coins back to you. And that is where the transaction fee will come, and the buyer of the goods will bear the two transaction fee and that is where bitcoin p2p was generated. And at the beginning when Alice and Bob did their first transaction the fee was very small. The other factors might true and not the second option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "June 12, 2024, 10:10:27 PM",
      "body": "Quote from: GideonGono on June 12, 2024, 08:28:11 PMFor me accepting crypto as a payment method has its advantages and disadvantage.Some might see it as expensive due to the transaction fee, and also they would need to wait till it has been confirmed.We should also consider the price, we all know that crypto is volatile so the price could move up or down which could give the receiver more profit or lose in their business.Well, of course, there's always a disadvantage. There are no perfect things in this world, and I agree with the disadvantage you have mentioned. The most common problem they might encounter if they accept bitcoin payments is the high transaction fees, and sometimes the network is too congested, so expect a slot or delayed receiving and sending of bitcoin assets. Well, it can't be helped. All technology has its own down side, and it can't be helped. There are always limitations in a technology, and that's why implementing bitcoin as a payment method should be thought through and planned well because it's not going to be easy, especially for those small businesses that want to add bitcoin as their payment method. But the most important thing is that no matter what the downside of bitcoin is, it has more advantages and benefits, and I think we mostly know what it is and how bitcoin has become a great opportunity for us and a good source of income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr_Brilliant$",
      "created_time": "June 12, 2024, 10:19:39 PM",
      "body": "Quote from: kentrolla on June 12, 2024, 07:38:58 PMThe most important benefit of accepting Bitcoin i could think of at the moment is the fact it's like an payment with possibility of more profits. Let's say if I have received $10000 as a payment and in a week the akue f Bitcoin increases by 10% then I would have $1100 if I hodl it. But I strongly object to your point saying it's cheaper than western union, I think you should check the transaction fee during bull run or when Bitcoin's value is higher.Aside focusing on one direction you need to also note that, Bitcoin can be in sideways or dump movement within some few hours, so it can cause loss to its trader after receiving Bitcoin as a tender for payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "June 12, 2024, 10:22:00 PM",
      "body": "Quote from: Davidvictorson on June 12, 2024, 07:25:23 PMI love great customer service and I would choose a Fiat only business over a business where Bitcoin is accepted if their customer service is bad. A lot of businesses use bitcoin to basically allure and lead customers into their business. Some people specifically seek out bitcoin payment only and it can be beneficial if a business started accepting bitcoin.But of course just like any businesses, a business that has bad quality of goods and services will not be saved by bitcoin alone.Personally I’d only use bitcoin for one big purchases rather than daily expense because of the high transaction fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 12, 2024, 10:39:15 PM",
      "body": "Quote from: Mr_Brilliant$ on June 12, 2024, 10:19:39 PMQuote from: kentrolla on June 12, 2024, 07:38:58 PMThe most important benefit of accepting Bitcoin i could think of at the moment is the fact it's like an payment with possibility of more profits. Let's say if I have received $10000 as a payment and in a week the akue f Bitcoin increases by 10% then I would have $1100 if I hodl it. But I strongly object to your point saying it's cheaper than western union, I think you should check the transaction fee during bull run or when Bitcoin's value is higher.Aside focusing on one direction you need to also note that, Bitcoin can be in sideways or dump movement within some few hours, so it can cause loss to its trader after receiving Bitcoin as a tender for payment. In such cases, don't convert your btc to USD or other currencies. You will only lose if you are in a hurry and have urgent needs. But if not, you can always wait for the btc market to increase its value. For now, the major benefit that I am seeing is that the possibility to earn profits is high because of its volatile nature. But you need to understand that it depends on when will you cash out this currency.Other benefits that you can derive from this currency -> cross-border payments with very low transaction fees> anonymous payments, no need to get the credentials of your clients > you can transact at the comfort of your home",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "June 12, 2024, 10:41:44 PM",
      "body": "Quote from: Chiomaobi on June 12, 2024, 05:43:17 PMNew Customers. Make an announcement that you are accepting Bitcoin and it will draw attention from the cryptocurrency crowd. Believe it or not there are more of them then you think.If you offer poor business services, or sell bad products, or even that you sell good products and offer good services but have poor marketing, deciding to add bitcoin as a method of payment to your business will not automatically increase your customer base. There will be people who will hear that you have added bitcoin as a method of payment in your business, but hearing about it is not equal to action and many people will hear about it but will never still visit your business to make a transaction in bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HelliumZ",
      "created_time": "June 12, 2024, 10:55:34 PM",
      "body": "OP, You may have thought that using Bitcoin as a payment method for businesses has many advantages, but it also has several disadvantages. Maybe the payment system of the business can be done through Bitcoin to attract customers but in this case if you talk about Bitcoin transaction fees there are definitely problems. Assuming you have sold a product worth ten dollars, if an additional fee of 10 dollars is added to the price of your product, then the total cost will be 10 dollars plus ten dollars, i.e. 20 dollars. In this case, a buyer will never bear such an additional fee. Again if for some reason the buyer wants to refund the money from you and in that case you have to bear additional fees again, there will be a huge change of capital in your business and you are guaranteed to have a huge loss in your business. Considering all these problems, you would never want to approve Bitcoin as a payment system for any business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "June 12, 2024, 11:01:04 PM",
      "body": "Bitcoin has got several advantages when compared with our traditional system of making payments. Some of those are what you have mentioned in the OP but even that still depends on what angle your looking at it or making this comparison. Mind you, am very much in for Bitcoin, I root for it but to understand it more better, we don’t have to share what could count towards the negative as well.Quote from: Chiomaobi on June 12, 2024, 05:43:17 PMNon-refundable.Someone can’t just call the Bitcoin company and make up a lie that they never received their product. Once you have the Bitcoin it’s yours.Bitcoin been non refundable counts towards the positive as well as the negative. This is so in the sense that,Merits: Once you’ve made payments and it’s got at least one confirmation on it, it’s impossible to reverse.Demerits: As a merchant, your customer have to wait until the network starts to confirm transaction before the deal could be closed. We all know how this confirmation can take some time based on fee and network congestion which isn’t encouraging for swift business.Also, you can’t afford to make any mistakes with the address and not notice it quick enough to initiate a double spending before confirmation else, your money is just gone.Quote from: Chiomaobi on June 12, 2024, 05:43:17 PMLower Fees.As mentioned before the fees are much cheaper than Western Unions.Well, that’s depends.I usually don’t find it funny when the network is congested, like it was just over a week ago although, it’s much improved right now but, Fred aren’t cool here and it doesn’t matter if your transacting across boarder or your doing it locally. The fee is just the same, irrespective of the amount involved of course, number of confirmations too.Quote from: Chiomaobi on June 12, 2024, 05:43:17 PMSecurity.The Bitcoin network has never been hacked. Provided you properly store your private keys your Bitcoin is safe.Although, it’s highly discouraged, when you happen to be holding your funds on an exchange, you could be hacked. When it’s about the network, of course not. That isn’t going to be the case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "June 12, 2024, 11:41:11 PM",
      "body": "Quote from: Chiomaobi on June 12, 2024, 05:43:17 PMLower Fees.As mentioned before the fees are much cheaper than Western Unions.The transaction fee varies, there factors that are used to calculate the transaction fee of bitcoin, one is the size which is the number of input and output too, the most important factor again is the network congestion, if the network gets congested bitcoin transaction fees goes up as many people will want to get their transactions confirmed faster and that will make it difficult for low fee transactions to be picked. So ideally this days bitcoin isn’t suitable for low amount transactions. Quote from: Mr.right85 on June 12, 2024, 11:01:04 PMMerits: Once you’ve made payments and it’s got at least one confirmation on it, it’s impossible to reverse.This is can be reversed when there is a chain reorg and the transaction gets dropped back to the mempool and the sender actually double spends it to a different address, that’s why the minimum requirement for most exchanges are either 3 or 6 confirmations to avoid a chain re org",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "frnandoh",
      "created_time": "June 13, 2024, 12:39:37 AM",
      "body": "Because its volatility, for that purpose, I think USDT or USDC are better than BTC. You wouldn't like to sell a car and lost an important part of your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "June 13, 2024, 01:34:20 AM",
      "body": "Quote from: frnandoh on June 13, 2024, 12:39:37 AMBecause its volatility, for that purpose, I think USDT or USDC are better than BTC. You wouldn't like to sell a car and lost an important part of your money.Do you think stable coins are better than Bitcoin?From centralization to decentralization differences, risk of transaction reverse, risk of fund freeze even in your wallets. You can have risk of loss for your fund with stable coin but you won't have it with Bitcoin and if you use a non custodial wallet.PSA: Most Stablecoins Can Be Frozen, Even in Your Own WalletsStable coin and black listUse Bitcoin blockchain, non custodial open source wallet to store bitcoin if you want a safe tool to store your wealth for a long time. You will have your own bank with Bitcoin blockchain and Bitcoin open source non custodial wallet.Reminder: do not keep your money in online accounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "June 13, 2024, 02:10:34 AM",
      "body": "Quote from: kentrolla on June 12, 2024, 07:38:58 PMThe most important benefit of accepting Bitcoin i could think of at the moment is the fact it's like an payment with possibility of more profits. Let's say if I have received $10000 as a payment and in a week the akue f Bitcoin increases by 10% then I would have $1100 if I hodl it. The counterpart of this advantage is if you do not monitor your coins properly, you might catch them at a wrong time. The earnings of a business is I would assume used for daily expenses and other operating costs of the business so you can't just hold your profit in there forever considering you also need the money to operate the business.Another thing to consider is tax. I am not an expert (do correct me if I am wrong) in terms of taxation but I would have to assume that you will get taxed twice. The profit off of your business then the profit in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverCryptoBullet",
      "created_time": "June 13, 2024, 02:33:47 AM",
      "body": "Quote from: Chiomaobi on June 12, 2024, 05:43:17 PMThere are several advantages of taking Bitcoin as payment. Depending on who you are the different advantages I am about to list could mean everything or nothing at all.You did not have a business and did not accept payment to your business, because you don't have one, so this copied advice is not from your experience. It is more interesting if advice, benefit are from your business management experience and you share it here.Quote from: Reatim on June 13, 2024, 02:10:34 AMAnother thing to consider is tax. I am not an expert (do correct me if I am wrong) in terms of taxation but I would have to assume that you will get taxed twice. The profit off of your business then the profit in crypto.You have to do tax report for your business and might have to pay business tax if your business is profitable.You have to pay tax if you sell your bitcoins and get profit from selling.If your business or your bitcoin sale is not profitable, you will not have to pay tax to government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}