{
  "id": "topic_5473620",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "November 10, 2023, 03:01:23 PMLast edit: November 10, 2023, 08:43:10 PM by Alik Bahshi",
  "content": "Alik Bakhshi   Armenia, obligations must be fulfilled      As you know, having been defeated in the 44-day war, in 2020 Armenia signed a document during a trilateral meeting in Moscow, according to which it was supposed to fulfill a number of obligations. The document bears the signatures of three presidents Aliyev, Pashinyan and Putin. However, after this, Armenia did not even think about starting to fulfill most of these obligations and such main ones as the demarcation and delegitimation of borders, the disarmament of all Armenian military formations remaining on the territory of Karabakh, the unblocking of roads, the transfer to Azerbaijan of a reliable map of minefields, and not the false one. which still brings death to civilians. For three years, Armenia came up with all sorts of tricks and claims, while Pashinyan rushed around America and Europe, looking for a replacement for the former patron of Armenia, thanks to whom it generally emerged as a state on Azerbaijani soil, seized by Russia at the beginning of the 20th century. It should be noted that Azerbaijan stopped hostilities, hoping for a peaceful solution to all problems after the 30-year occupation of Karabakh and adjacent territories, and as it turned out, it was in vain. After three years, it was necessary to resume the war in order to decide to finally drive out the Armenian invaders from Karabakh. Within one day, the Azerbaijani army did what it should have done back in 2020. After which Armenia finally recognized that Karabakh is the land of Azerbaijan. I would like to note that if the war had lasted more than 44 days, before Azerbaijan could have regained itself and Zangezur, which was transferred to Armenia in 1920 by a strong-willed decision of Moscow, and today the issue of the Zangezur corridor would no longer be relevant.       The Zangezur corridor is important not only to Azerbaijan as a road to Nakhichevan and fraternal Turkey, but it is also an integral part of the revived Silk Road connecting China with Europe.(1) It is also interesting to Russia as a North-South transport route to the countries of the Middle East and Iran, which is its strategic ally. Therefore, Moscow threateningly called on Armenia to implement the trilateral agreement signed by Pashinyan. Moreover, against the background of Pashinyan’s policy, reminiscent of Buridan’s donkey (2), Russia was reminded that, according to the 1955 treaty, Russian armed forces will remain in Armenia until 2044.      Taking into account the above, Armenia, whether it wants it or not, will have to fulfill all the points of the Moscow Treaty of 2020 that it signed.  1. Revival of the “Great Silk Road”. https://alikbahshi.livejournal.com/36842.html  2. Armenia in the role of Buridan’s donkey. https://alikbahshi.livejournal.com/58251.html  10.11.2023",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473620",
  "comments": []
}