{
  "id": "topic_5417271",
  "title": "BitcoinBarrel",
  "author": "BitcoinBarrel",
  "created_time": "October 16, 2022, 04:12:08 AM",
  "content": "That's just my thoughts. Maybe by 2024, unless all hell breaks loose. As long as internet keeps chugging along though, BTC will prevail.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417271",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "October 16, 2022, 04:51:13 AM",
      "body": "I think it's too much to speculate Bitcoin will hit $300K in coming years, Bitcoin need to hit $100K first as many people are predict it last year. If Bitcoin is still following the 4 years cycle, the next Bitcoin ATH will be on 2025. We still don't know what will happen with Bitcoin price in this year and the next year due to economy recession, I think it's either Bitcoin price would stay around $20K or lower and might hit $15K. I don't see any sign if bull run will happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maidak",
      "created_time": "October 16, 2022, 05:48:02 AM",
      "body": "Is $300k too high a target for the next bull season? The reality is that everyone is just trying to talk about the $100k goal before we hit the higher one, the fact that bitcoin is going to rise again is certain, but when exactly it will happen we do not know. With inflation still at its current high, I think bitcoin will fall further and $15k is possible but it will happen next year when the Fed raises interest rates to the highest they have planned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 16, 2022, 07:47:17 AM",
      "body": "I believe it is more of a wish for me to see Bitcoin at the exact price in a few years. No one knows what 2024 would look like for the Bitcoin price, if hell doesn't break loose as you mentioned. But if it could reach $15k, it would still be a good opportunity for investors to purchase more and also HODL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "October 16, 2022, 07:50:48 AM",
      "body": "$100K a realistic target because the ATH that Bitcoin has ever achieved is $69,044.77.I don't think $15K is the lowest Bitcoin price this year although it could happen later in the year-end journey.Yes. I agree. As long as the internet exists, Bitcoin could reach over $300K in the future, even more even if sales are still very high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 16, 2022, 08:36:06 AM",
      "body": "Having your own thoughts and opinions concerning bitcoin's price is totally fine, but I guess at least tell us how you came to that conclusion so we actually have something to talk about lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LittleBitFunny",
      "created_time": "October 16, 2022, 08:43:38 AM",
      "body": "Quote from: BitcoinBarrel on October 16, 2022, 04:12:08 AMThat's just my thoughts. Maybe by 2024, unless all hell breaks loose. As long as internet keeps chugging along though, BTC will prevail. I won't predict what will be the all-time low this bear season and what will be the all-time high next bull season, because predictions are just predictions, let them happen naturally. But I will agree with you that bitcoin will rise again is a certainty and bitcoin will continue to stay with us over time, as long as our need remains, bitcoin will always be there. The price increase will be meaningless if you don't own any bitcoins, so the first priority right now is to hold bitcoins, have you filled your bitcoin wallet yet? if not, buy now and don't stop if it continues to fall, the more bitcoin falls after that, the stronger the upside momentum. Don't miss this golden moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bestcoins1",
      "created_time": "October 16, 2022, 11:58:44 AM",
      "body": "Quote from: BitcoinBarrel on October 16, 2022, 04:12:08 AMThat's just my thoughts. Maybe by 2024, unless all hell breaks loose. As long as internet keeps chugging along though, BTC will prevail. It does make a lot of sense, because when everyone can still access the internet and also view Bitcoin and make purchases on Bitcoin, there will always be a potential increase in the price for Bitcoin. The analogy is very simple, because when Bitcoin continues to be mined and owned by many people with very little release at a low price, then people who have not bought Bitcoin will definitely be forced to buy at a high price. So there is little chance for Bitcoin to get a gradual increase in each year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "October 16, 2022, 01:26:56 PM",
      "body": "Quote from: BitcoinBarrel on October 16, 2022, 04:12:08 AMThat's just my thoughts. Maybe by 2024, unless all hell breaks loose. It's okay if it will drop to $15k, we're near to that and it's possible. As for the $300k in the future, it's also possible, we'll be hitting the next halving by 2024 and we've got an idea what happens next after it occurs.Quote from: BitcoinBarrel on October 16, 2022, 04:12:08 AMAs long as internet keeps chugging along though, BTC will prevail. We all know that internet won't be gone and it's going to stay just like bitcoin, it's here to stay just as the internet thrives. While most projects might be forgotten but bitcoin will continue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 16, 2022, 02:19:39 PM",
      "body": "Not bad of a speculation I guess, others already hit the ceiling by that timeframe though. Like, $1M in n years, $500k in n years and so on and so forth. For me, I just want my money works for me, so longer term is really I am eyeing, we will gonna get there when all is right in this world economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "October 16, 2022, 02:29:29 PM",
      "body": "Quote from: BitcoinBarrel on October 16, 2022, 04:12:08 AMThat's just my thoughts. Maybe by 2024, unless all hell breaks loose. 2024 is only time for one halving so I don't think $300k for a bitcoin is coming then but you have made a wish and speculation.Quote from: BitcoinBarrel on October 16, 2022, 04:12:08 AMAs long as internet keeps chugging along though, BTC will prevail. Yes bitcoin will prevail at it all because of the reason you gave on the internet. Since the internet activities keep growing and more companies are establishing their presence on the internet so they need to introduce bitcoin as to facilitate easy and fast payment for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "October 16, 2022, 03:02:28 PM",
      "body": "We've associated halving with bull markets. While this has occurred in the past halvings, it's not necessary that it's going to happen in the upcoming one. Other factors, such as the economic situation or other indexes and stocks, such as the S&P 500, must also be considered. There are actually a lot of investors and analysts who also claim that Bitcoin will skyrocket in the upcoming years, and don't get me wrong, I also believe that it will see a major increase in price somewhere between 2024 and 2026.If you ask me, $300.000 sounds way too exaggerated; $100.000-$150.000 seems more realistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "October 16, 2022, 04:38:31 PM",
      "body": "Talk about unbridled optimism haha. We're no longer in 2017, OP, when 500k was probably the minimum of estimates, never mind all the million-dollar estimates by 2020.$15k bottom would be Bitcoin pulling off something short of amazing given all the dire predictions coming, yet to come, and yet expected. $100k's still the benchmark though 2024? We haven't seen a high in the same calendar year as halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bocyaj",
      "created_time": "October 16, 2022, 05:31:21 PM",
      "body": "The next halves will be the 2024,their is no doubt on that.So now crypto currency market was at the dull face of prices and dump is more relevant one now.But how you claim the way of 15k dollars.Because the price of bitcoin was stand with the barrier of 17k dollars.After the 2017,the price of bitcoin back to the 19k mark.But still it not crossed the barrier of the 17k dollars.Once the price of bitcoin crossed the value of 17k break down,their will be chance of 15k dollars as you said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "October 16, 2022, 08:52:36 PM",
      "body": "Let's say we put a conservative prediction at $100k++ that's it. We don't want to hear exorbitant prediction that is not going to be hit, just saying.We have learn our lessons from the one of the famous prediction model that didn't happen. So I guess for us, we will have to see what the future will bring and for sure it will be in our favor. As for $15k, it's possible, our lowest is $17,500 and we still have 2023 to see this bear market and endure it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "October 16, 2022, 09:07:58 PM",
      "body": "Quote from: BitcoinBarrel on October 16, 2022, 04:12:08 AMThat's just my thoughts. Maybe by 2024, unless all hell breaks loose. As long as internet keeps chugging along though, BTC will prevail. I love the idea of seeing the price going down to $15,000, at least gonna be another opportunity to stack up before everything blows up in 2024-2025.However, I'm a bit skeptical of the $300,000 prediction mate. My prediction is around $150,000-$180,000 at least in the next bull run. But then again, when people thought that $20,000 is not achievable back in 2017 then suddenly we almost hit it, means that we can't really see what the future will hold for us here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "October 16, 2022, 09:54:08 PM",
      "body": "Quote from: BitcoinBarrel on October 16, 2022, 04:12:08 AMThat's just my thoughts. Maybe by 2024, unless all hell breaks loose. As long as internet keeps chugging along though, BTC will prevail.  Of course $300k will always be possible for bitcoin but I don’t see it happening soon like 2024 or 2025, it will but most likely 5-10 years from now. And to think that the bear market may still continue the following year, so most likely bitcoin price will only show slight price increase or it maybe it will take a huge sudden price increase but expect that there are also sudden price decline as it could be another bull trap that we may encounter. But all in all, bitcoin will always grow and will never fail to reach its new all time high when the right time comes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "October 17, 2022, 01:31:16 AM",
      "body": "Lol, the OP is hyping everyone here.A dropped to $15k this bear market? possibleBut a spike to a new all time high in the $300k'ish? so it will be like x5 of our last all time high of more than $60k in 2021? well your guess is as good as mind. But to be honest, isn't it too high for a prediction in the next bull run? $100k might be a good prediction but $200k-$300k might be out of the equation, just saying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "October 17, 2022, 03:15:44 AM",
      "body": "Quote from: BitcoinBarrel on October 16, 2022, 04:12:08 AMThat's just my thoughts. Maybe by 2024, unless all hell breaks loose. As long as internet keeps chugging along though, BTC will prevail. actually what I only care now is where to take funds to use in investing more in bitcoin as the years quickly passing and surely that 5 digits for this coin is coming very soon.Either 100k to 300k? it doesn't matter to me because the price by now is truly cheaper than what it can be in the next coming years.But I support if this going to happen because with all the coins I have in hand now? literally i will be at least almost a million dollar man.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 17, 2022, 03:25:48 AM",
      "body": "I don't know about $300K but I know that ill break ATH or come close to $50K or so. Take stocks for example. Stocks like Apple, Facebook, Google, etc have been trading way over valued for years. They have crashed hard and are still over-valued. Does it mean it'll ever be true valued ? No.Because people are addicted to trading. After this bear market is over. There will be FOMO once again for new retail money. And it'll be the same cycle over and over again. Just need to be patient and wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}