{
  "id": "topic_5454982",
  "title": "Winderl",
  "author": "Winderl",
  "created_time": "June 03, 2023, 02:08:10 PM",
  "content": "Would you brethren be willing to fill out a short survey for me to help me establish if there would be a market for my idea of creating a crypto course online for the next crypto bull cycle which I expect to peak in 2025, in the link below?  I will not personally be investing in any altcoins like SOL, or APT, or PEPE, that carry an unacceptable amount of risk to help people meet their goals.  Thank you.https://api.leadconnectorhq.com/widget/form/CeEJJjxCmgjoLUmA0R5s",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454982",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "June 03, 2023, 09:39:51 PMLast edit: June 04, 2023, 09:38:41 PM by JeromeTash",
      "body": "So I checked out the survey link and I have a question.Why do you need the Full name, phone number/Country and Email address of the person taking the survey? I think this is not necessaryI was going to try out the survey but I can't share out my personal information randomly just like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Winderl",
      "created_time": "June 03, 2023, 10:16:17 PM",
      "body": "Thank you Jerome,    That's kind of you buddy.  I don't have any way to change the format of the way the surveys are submitted.  I completely understand your concern.  If you want to leave your answers in a reply, I would still highly value your answers.  If you would rather not don't worry about it.  I'm not trying to sell you anything, and thanks for your consideration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SyndicateLabs",
      "created_time": "June 03, 2023, 11:08:40 PM",
      "body": "Do you want to survey or get information from people?Simplify everything through the problem and you can ask any questions here, with the assessment and judgment in the future to 2025, I just want to share about a few streams of information related to the trends. Potential trends are active and likely to accelerate sharply in the future, and most of it is related to areas such as WEB3, AI, social, e-commerce,...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "June 04, 2023, 06:40:28 AM",
      "body": "Quote from: Winderl on June 03, 2023, 10:16:17 PMThank you Jerome,    That's kind of you buddy.  I don't have any way to change the format of the way the surveys are submitted.  And what procedures did you take when storing this data. A full name combined with a phone number and e-mail is already data that has value on the darknet. This is data that can be used for scams. This is data that should be properly taken care of or not collected. The mere fact that its not mandatory to fill them does not change the fact that you should not even be able to obtain them, because maybe someone is not aware and will share them. So if your survey allows others to provide sensitive data, you should automatically have appropriate procedures to handle them safely. I recommend google surveys that don't have a fixed format (for me it's doubtful if you actually couldn't edit the format of your poll)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Winderl",
      "created_time": "June 04, 2023, 07:23:08 AM",
      "body": "Thank you for expressing your concern Tytanowy.  I don't have anyway to change the surveys.  I am paying just to be able to make the surveys.  I am not a technical person at all, and the service for which I am paying is all connected.  The marketing team will help me bring my idea to market if they are convinced there is a market for it based on my surveys.  The personal information comes directly to me and I am solely responsible for it.  And I have no desire to exploit it.  But I understand it is a barrier to people I don't know.  I even have some friends who are not comfortable filling it out for the same reasons.  And I make no judgement about that.  Do what your conscience tells you that you are comfortable with or not comfortable with.  Just ponder the questions in the survey for your own benefit if you don't want to fill it out.  Thank you my friend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 04, 2023, 09:18:57 AM",
      "body": "It does not need a questionnaire as no one can give you an accurate answer. The reason for this is that the altcoins market is changing and is rarely itself within two years or at least the current estimates will not be correct during the next two years.The best advice will be to close this topic now and open it after 6 months of halving, specifically in the month of 10/2024, then it will be the possibility that the bitcoin will reach the highest summit during the coming year high and therefore it is easy to choose the appropriate alternative currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "June 04, 2023, 09:55:16 AM",
      "body": "Quote from: JeromeTash on June 03, 2023, 09:39:51 PMSo I checked out the survey link and I have a question.Why do you need the Full name, phone number/Country and Email address of the person taking the survey? I think this is not necessaryI was going to try out the survey but I can share out my personal information randomly just like that.Thanks man, this saved me time before clicking the survey form. @OP if you want to gather data of people around this forum, just tell it outrightly and you don't have to ask it in a survey form. And if you have no technical knowledge about the form and you just paid for it, I think you can alter that by contacting the provider since you've paid for it.Everyone here is concern about our data being sold or being used by someone but those that have provided it freely, can't do much from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "June 04, 2023, 05:16:05 PM",
      "body": "Quote from: Winderl on June 03, 2023, 02:08:10 PMWould you brethren be willing to fill out a short survey for me to help me establish if there would be a market for my idea of creating a crypto course online for the next crypto bull cycle which I expect to peak in 2025, in the link below?  I will not personally be investing in any altcoins like SOL, or APT, or PEPE, that carry an unacceptable amount of risk to help people meet their goals.  Thank you.https://api.leadconnectorhq.com/widget/form/CeEJJjxCmgjoLUmA0R5sYeah, right that's why you need my full name, email and freaking phone number! People if you haven't heard about sim swapping attack, do yourselves a favor and read about it. And anything you do, do not give OP your number, name, mail or mail. There's no reason OP would need to know those for a survey that btw you are giving OP for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "June 05, 2023, 11:16:19 AM",
      "body": "Quote from: hugeblack on June 04, 2023, 09:18:57 AMIt does not need a questionnaire as no one can give you an accurate answer. The reason for this is that the altcoins market is changing and is rarely itself within two years or at least the current estimates will not be correct during the next two years.The best advice will be to close this topic now and open it after 6 months of halving, specifically in the month of 10/2024, then it will be the possibility that the bitcoin will reach the highest summit during the coming year high and therefore it is easy to choose the appropriate alternative currency.It's just a survey anyway so it's fine and they already expect that the answers won't always be accurate. The whole crypto market is changing not just the alt, not only in terms of price (obviously because they are volatile) but also change because there are now new breed/specie available.There is also cryptos who are not with us anymore but that's fine. They're gone for a reason. Predicting is hard because unexpected things can happen like for example; a coin can perform better but we don't know the teams plan. They might be really a scam and will exit later on. Waiting for BTC to pump before investing in altcoin seems a bad idea. We could miss a lot of things this way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "July 02, 2023, 02:54:00 PM",
      "body": "Today I want to fill out your survey, but I find that there you are still asking for personal information such as email, cellphone number and occupation. You also give (*) the choice so I have to fill in the data so I can provide your survey data.Maybe I will try to provide fake data to you but that would be unethical and impolite right? It would be better for you to change your survey fields as soon as possible",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barhavsky",
      "created_time": "July 13, 2023, 08:59:33 PM",
      "body": "Quote from: JeromeTash on June 03, 2023, 09:39:51 PMSo I checked out the survey link and I have a question.Why do you need the Full name, phone number/Country and Email address of the person taking the survey? I think this is not necessaryI was going to try out the survey but I can't share out my personal information randomly just like that.absolutely true, because in my opinion if we fill out a survey, then we don't need to fill in our personal data (because it's confidential), therefore in my opinion the input of data in the survey must be changed, maybe just enter the name, because this doesn't look like a survey but wants to find or retrieve our personal data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 13, 2023, 09:28:31 PM",
      "body": "Quote from: barhavsky on July 13, 2023, 08:59:33 PMQuote from: JeromeTash on June 03, 2023, 09:39:51 PMSo I checked out the survey link and I have a question.Why do you need the Full name, phone number/Country and Email address of the person taking the survey? I think this is not necessaryI was going to try out the survey but I can't share out my personal information randomly just like that.absolutely true, because in my opinion if we fill out a survey, then we don't need to fill in our personal data (because it's confidential), therefore in my opinion the input of data in the survey must be changed, maybe just enter the name, because this doesn't look like a survey but wants to find or retrieve our personal data.If this is a legitimate survey, there is no need to ask for name and other personal details, you can just leave it blank and focus on your goal to collect the data and not the other things, be careful with this kind of survey because this could be their way to scam or hack you. Survey should be done in proper way, but if you’re not serious then I believe you cannot fool many here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}