{
  "id": "topic_5463638",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "August 17, 2023, 09:44:04 PM",
  "content": "What do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463638",
  "comments": [
    {
      "author": "Fatunad",
      "created_time": "August 17, 2023, 09:57:04 PM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.For sure lots of traders did experience this but it would really be just that a little bit exaggerated if we are experiencing this for a whole month. For several days then i might consider or something realistic but for a month then its impossible but who knows but it is really that normal that you would really be making out some adjustments on the time that you are experiencing it for a row on having win or loss trades in specific period.If it would really be alternating then you would really be still saying to yourself that you are really that doing fine unless if those trades are all loses then there's something wrong with your trading.How to handle out such situation? Then of course you would really be needing to have adjustments on whats wrong with those losing trades. The thing you should bare in mind that the market is that unpredictableand there's no assurance that on whatever kind of technical indicators your are using, it doesnt really give out an assurance that you would really be able to get a positive result.It would always vary since market could easily fucked up your analysis which its something inevitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "August 17, 2023, 10:13:26 PM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.The experience trader will had experience in both loss and profit.So they know how to react for the bear and bull market.It's most essential one by the traders to hold the valuable coins at the bear market.The less experienced traders will do panic selling at the bear market is the worst part of the newbie.The trading should be followed based on the long term,it won't followed on the short term.The bear market will some losses and you will face the loss only if you sell at the bear market.Or else it won't affect you,even the price of brought coin reduced huge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorokan",
      "created_time": "August 17, 2023, 10:54:27 PM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.Situations as this would mean that the trader method of approach to the crypto currency trade is inconsistent; so to fix issues as this; the trader needs to figure out the reasons for inconsistenciesis it down to patience or greed or rushing the decision making process?is it down to avoidable errors when drawing trading charts?is it down to adding values outside what the charts preach? for example; if you read that the best exit is 19.05$ but you choose 19.10$ etcIf you are able to find answers to why there are inconsistencies; then you are almost closer to perfection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "August 17, 2023, 11:10:08 PM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.Well, it really happens to all traders including profitable traders. The main reason why we experience loses in trading is because there are no strategies that has 100% win rate. We have to accept that sometimes we experience lose streak in our trading journey. We can't really control the market and can't predict the swing point. There's nothing wrong if you follow your trading plan but still encounter losses because it's normal. We just have to master in trading is how we can survive our funds in the long run, and this is the risk management. If you're emotional in trading you really have to take a break because you can just make bad decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "August 18, 2023, 12:33:15 AMLast edit: August 18, 2023, 10:26:10 AM by Dzwaafu11",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades..It is normal in trading to lose and gain profit as well, but the way you said it now makes me think that there must be something wrong; if not, it will not be like that, and a trader who is losing repetitively may even give up and leave trading. However, what I think may happen is that if the trader is not using one method of trading and is unable to fish out the one that is favourable for him, you can see that using multiple methods in trading can also affect him.Maybe the method he used to gain profit today he did not use the same method tomorrow and he switched to another one. So I think if a trader is having this type of issue, he should calm down, not be greedy, have control over his emotions, and learn one or two trading strategies that he thinks he can master well to avoid too many losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 18, 2023, 12:59:34 AM",
      "body": "\"Don't trade the next day after winning\". Just kidding, but can be taken seriously.It needs to look at trading habits, at some point it needs to be fixed. There are some typical traders who double the order level after profit which means increasing the risk, and it actually affects their emotions to trade uncontrollably and outside the plan. Or analytical skills and instincts increase when chasing losses. After all, it's just a random repetition that rarely happens for traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "August 18, 2023, 01:05:40 AM",
      "body": "A common reason for me is not following your trading plan. Because if you have plans for every trade, you must be strict, like waiting for your entry which you already plan ahead of time, so you can have good entry and price target/stop loss.Another thing for me is volatility because sometimes we really don't expect the market, sometimes there is a wicked candle and our stop loss is getting hunted, which for me it's not really a nature problem, we must expect that always.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "August 18, 2023, 01:13:21 AM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.Yeah, definitely, it can happen to all traders, because as we all know, trading and reading graphs and technical analysis is not a exact science (or math for that matter). And so you can make a lot of mistakes in a day and then have a losing pattern.I guess one way to get out of it, but it doesn't mean it could stop or resolved is to get out and stop trading for some times. At least get it out of your mind and maybe you can comeback refresh and compose again. Or look very carefully, maybe you have missed something in your analysis that causes you to lose successive. There must be something wrong in your trading plan that you need to fix.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 18, 2023, 01:40:41 AM",
      "body": "Isn't that the definition of trading. You can make a profit one day and lose the next day, but the outcome after a month or two is the growth of your investment portfolio by a certain percentage, whatever the market situation, otherwise you should review your investment plan or just long-term investment.The fact that you achieve a loss is a natural thing in trading, and you must accept that loss, but the outcome of the trading must be positive, otherwise you will not be able to bear that loss for a long time.I do not see a problem, and with experience, the days in which you lose and the percentage of loss will decrease, but until that time, avoiding excessive thinking in trading is the safest solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "August 18, 2023, 02:35:25 AM",
      "body": "Quote from: GreatArkansas on August 18, 2023, 01:05:40 AMA common reason for me is not following your trading plan. Because if you have plans for every trade, you must be strict, like waiting for your entry which you already plan ahead of time, so you can have good entry and price target/stop loss.Could be the reason but as OP have said, it's a rollercoaster of wins and losses so I don't think it's entirely due to not following a trading plan, if that was the sole case then OP would probably be losing more often. I might be on OP's side that this might be a psychological condition, that OP might be suffering on something that makes him/her overconfident when OP gets a win which ends up with the next trades get careless, of course this is still a hunch but if OP were to look back and see what he/she did wrong and if it's a repeated pattern then we know what could be wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "August 18, 2023, 04:34:41 AM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMHas anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.Small losses are important to a trader success but consistent small losses is a red flag that should not be ignored. You may be doing one of these three things wrong. They include your position sizing is too large and you keep adding to a losing trade, you do not close the loss at your initial stop loss, and you let the price keep running against you. To solve these problems if it one of the causes of what you are experiencing, you need to have proper position sizing, you set yourself a position sizing rule of 0. 5 percent one percent or maybe even two percent per trade and then you stick to it no loss should ever exceed this limit.As with the issue with the stop loss, when the price hits their initial stop loss you should be out you do not. Never revenge trade and do not jump back into trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "August 18, 2023, 08:14:16 AM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.Win or lose, profit or loss, in trading this is normal, and that is also included in crypto trading. So actually this kind of thing is commonplace in crypto trading. Because in the crypto market, we are trading and in trading there must be intense competition. In addition, crypto market conditions are also very volatile and sometimes we cannot predict.Then besides that, what most dominates an investor in crypto can experience profits and then losses, is the lack of knowledge and the lack of knowledge about trading in crypto.Perhaps it is because of these factors that many investors in the crypto market experience trading that sometimes wins and sometimes loses or sometimes wins and sometimes loses.QuoteHas anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.I personally, if I experience profits and losses, of course I have also experienced. But if profits are followed by losses over a long period of time, as far as I remember, I did too, when I first tried trading in crypto/altcoins, and even so, I experienced this not too often. But now I have realized my mistake. As far as I remember, when I experienced successive profits and losses, it was because I bought a pumping altcoin. The first purchase actually made me profit, but when I made the second purchase, the price of the altcoin dropped dramatically and at that time I suffered quite a loss.And now I have realized my mistake, at that time I was too greedy, because according to my thoughts, at that time the altcoin that was pumping would continue to rise, even though my thinking seemed so clearly wrong. The second time was that I was very lacking in knowledge and very lacking in knowledge in the field of crypto trading, because at that time I was still a complete beginner in the crypto world.So in conclusion, to overcome the problem of profits followed by losses in crypto trading, it is knowledge and knowledge that must be mature in the field of crypto trading. Then Psychologically, avoid being greedy and hasty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "August 18, 2023, 09:10:56 AM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.The trader that has been experiencing such wins and losses is someone who doesn't have a proper trading strategy and is doing trading only based on his/her own instincts. The trader needs to make a proper strategy and a proper plan before placing any trade orders because if that trader continues trading in that way then he/she won't be able to have any profits whatsoever. I also recommend such trader to have some proper controls over his/her emotions because if a trader falls under the influence of emotions then there is always a chance that the trader will end up loosing everything that he/she has earned from winning trades. Trading is a skill that requires a proper strategy and control over one's emotions without those a trader won't be able to get high winning rates during trading.If you really want to have a cure for such issues and you don't want to have repetitive win and loss situations then I recommend you to develop a good trading strategy and improve it over time. Your strategy should include trading indicators and you should also try to modify the settings of those indicators according to your trading strategy. After a trading strategy you'll also have to make a proper trading plan to execute your strategy. Once everything is good then you'll see that you'll gradually start having winning trades only and there will be very rare occurrences when you'll have to go through a losing trades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "August 18, 2023, 11:07:58 AM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMHas anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.It is not psychological. If a trader is making profit and then lose it the next time and he is getting worried that something is wrong with the market, no nothing is wrong with the market but the only thing which is wrong is the trader. So you are the one who is not getting things right consistently. Focus on those trade that you have made profit and perfect on them because when you make mistake you go back losing. It is easier to trace and correct yourself with that. Put a writing material and check your winning trade and lose then you teach yourself more on what mistake you are doing that is causing you to throw in back your profit.So it could be anxiety, it could be emotion/fear, it could be your risk interest, maybe you increase your profit margin etc but it depends on your mistake. It is easier to correct a mistake in trade if you are making profit but if you are not, it is difficult because you don't know where to start from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "August 18, 2023, 11:28:57 AM",
      "body": "What was experienced was not like that, but continued to get profits for months so I finally thought that trading was very easy and fun because I could get money continuously but everything changed because alertness decreased, when the market entered a bearish period it became difficult to get profits even slowly all just filled with defeat after defeat.If you experience big losses, it's better to stop because trading may not suit you and it's better to turn it into a long-term holder for Bitcoin which provides more certainty of profits than daily trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HONDACD125",
      "created_time": "August 18, 2023, 12:37:55 PM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.In my opinion, whenever an experienced trader trades, he does not trade on luck alone, but trades based on his experience, analysis and knowledge. The cryptocurrency market is always volatile and we always have to go with the trend to make a profit. We always trade based on our experience, information and chart analysis but the market does not necessarily follow our analysis. I think when we have profit in trading one day then next day we trade on emotion where there is no opportunity to take trade, because we are in profit then next day we trade very thoughtfully, because loss Due to which our profit is lost. I often make a good trade one week and make a good profit, but the next week I lose the same profit by taking the wrong trade. So I think we should do every trade wisely and consistently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "August 18, 2023, 12:51:44 PM",
      "body": "Quote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.For sure, a lot of traders experience this, and not only you, but to answer your question about how it can be solved,  you can answer this because, first, it is your own strategy, and for sure, it is not that polished; you have loopholes in your strategy. What you will do is list down your losses, track them back, see why you lost, compare them to your strategy, check if you missed a step or not, and really find out why your entry is opposite. But again, it doesn't mean that you'll be winning all the time right now, but it would be lessened because in trading there is no 100% winning strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "August 18, 2023, 01:16:14 PM",
      "body": "Its always happen to traders as long as you made a really good execution of your trading plans, there's nothing to worry about it at the end you will count the profit even there are an up and downs with your trades if the profit is positive feedback its a win-win situation but if the outcome is not the same way on what we expecting to try to make an analysis again what are your mistakes and possible, try to back track your positions and trading plots if there's something wrong and what are your expectations and outcomes after the analysis you can make a try again and check if it works now if still not try to change your strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "August 18, 2023, 02:18:31 PM",
      "body": "Quote from: Lorokan on August 17, 2023, 10:54:27 PMQuote from: letteredhub on August 17, 2023, 09:44:04 PMWhat do we think could be the cause for a trader that has been experiencing a win and lose repetitive occurrences in his trades.  Like he places a trade today he makes profit and the next day when he places another trade he would lose it, whereas the next day he then makes another profit and lose it the next. And this happen been repeating for more than a month.Has anyone had such experience? If yes! Then how was or could it be solved or stopped? The situation is getting psychological.Situations as this would mean that the trader method of approach to the crypto currency trade is inconsistent; so to fix issues as this; the trader needs to figure out the reasons for inconsistenciesis it down to patience or greed or rushing the decision making process?is it down to avoidable errors when drawing trading charts?Same method of approach is what it's been used in all the different times so from my end I kind of doubt of those interval inconsistencies are bond to impatience, greed or errors arising from trade chart since same measures is what it's been applied in in them all but still resulting in same ways.Quoteis it down to adding values outside what the charts preach? for example; if you read that the best exit is 19.05$ but you choose 19.10$ etcAlthough this point does makes much sense and could be something to look into in positioning the stop loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}