{
  "id": "topic_5477725",
  "title": "Question:",
  "author": "Fullbear2222",
  "created_time": "December 13, 2023, 02:37:28 PMLast edit: December 13, 2023, 03:00:46 PM by Fullbear2222",
  "content": "We have cryptocurrency you still use Banks ? The bank online many times not working slow Also i want to transfer fast to Canada to russia i cant do that or india to USA i cant do that i need instantly.Also i asked money my bank dont give so If the bank don't help me to get rich then i dont need them.Do you still use Banks ? Im using only cryptocurrency debit cards and they always work better than bank.So Im still surprised If anyone still use Banks they are old Do you use more crypto or banks for your daily or average transactions ? Do you have had problems with hackers or someone steal money from your cryptocurrency or bank Do you think banks not working reliable any more ? I teach all my family to use cryptocurrency becouse i dont trust Banks and i think If you can tell your bank mind your business you are scam i told my bank If you not give me loans or credit i dont need you and i close it",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477725",
  "comments": [
    {
      "author": "_act_",
      "created_time": "December 13, 2023, 02:47:51 PM",
      "body": "I hold bitcoin and few shitcoins. But that is for investment and store if value. Store of value for Bitcoin. Gambling for altcoins. So I convert altcoins to bitcoin or stable coin when it is time.I still use fiat because people in my country are buying and selling with fiat. You will find it hard and frustrating to buy with bitcoin or other crypto. I prefer to use crypto, but the way my country is do not let me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "December 13, 2023, 02:53:30 PM",
      "body": "Bank is still needed in our life or day to day activities why because whenever you want to make local transfer another person within same entity you will use card to do that or going to bank directly to transfer. The main purpose of bitcoin or cryptocurrency is not to compete with bank rather as an assistant to bank to scale up where there seems to be a barrier in the network just as you said of trying to transfer money to next country but finding it difficult if such person knows how to use cryptocurrency you don't mind making that payment through bitcoin or any other cryptocurrency. I myself still use bank and I have my debit card with me, what I does most at times is to send some little amount or the exact I wished and want to spend for the week/month maybe after I might have exhausted it then I will have to send another because saving money in bank always leads to service charges the worst part of it is whether you save money in bank or initiate any transaction you would still be charged at the month ending.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0t3p0t",
      "created_time": "December 13, 2023, 02:54:22 PM",
      "body": "Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMWe have cryptocurrency you still use Banks ? The bank online many times not working slow Also i want to transfer fast to Canada to russia i cant do that or india to USA i cant do that i need instantly.Also i asked money my bank dont give so If the bank don't help me to get rich then i dont need them.Do you still use Banks ? Im using only cryptocurrency debit cards and they always work better than bank.So Im still surprised If anyone still use Banks they are old Well yeah, I personally use banks up until now. My debit cards and e-wallets were from banks and they are way more convenient when it comes to purchases online or offline. The amount of fee is far more terrible when we use cryptocurrency in a smaller transactions so why bother using it when you have fiat? I would be happy to have a cryptocurrency debit card myself but unfortunately I have none. I don't know where to get one here in my country. How about the fee? Though having one could be cool but I am wondering about it's convenience here in my country as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "December 13, 2023, 03:52:06 PM",
      "body": "Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMWe have cryptocurrency you still use Banks ? The bank online many times not working slow Also i want to transfer fast to Canada to russia i cant do that or india to USA i cant do that i need instantly.Also i asked money my bank dont give so If the bank don't help me to get rich then i dont need them.Do you still use Banks ? Im using only cryptocurrency debit cards and they always work better than bank.So Im still surprised If anyone still use Banks they are old Do you use more crypto or banks for your daily or average transactions ? Do you have had problems with hackers or someone steal money from your cryptocurrency or bank Do you think banks not working reliable any more ? I teach all my family to use cryptocurrency becouse i dont trust Banks and i think If you can tell your bank mind your business you are scam i told my bank If you not give me loans or credit i dont need you and i close it You open so many threads with silly questions every day, it's rather painful. The vast majority of the world uses banks every day and it is cryptocurrency holders that are in the tiny majority. If your bank is slow loading online, then get a better bank - there are plenty of options to switch to in every country, you're not tied to a single bank for a lifetime and there is no excuse for a poorly performing website in the current age. There's a legitimate reason no bank in the Americas or vicinity of Europe will allow transactions to Russia, because they are under sanctions by any country with a conscious for invading their neighbour in a horrific war, get a clue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 13, 2023, 04:05:41 PM",
      "body": "Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMWe have cryptocurrency you still use Banks ? I think it is naive and even childish to think that banks are useless today.Bitcoin and other cryptocurrencies can do a lot of things, but there are many things  cryptocurrencies can't do yet.QuoteThe bank online many times not working slow Also i want to transfer fast to Canada to russia i cant do that or india to USA i cant do that i need instantly.Also i asked money my bank dont give so If the bank don't help me to get rich then i dont need them.It may be easier to get rich investing in altcoins in the past years, but you can get rich in the traditional financial market can. A lot of people get rich there every year... there are a lot of opportunities in stock exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "December 13, 2023, 04:07:04 PM",
      "body": "I get why people are ditching traditional banks these days.  They can be slow, pricey, and don't always have your best interests in mind and  cryptocurrency seems like a way better option for folks who want more control over their money.  I mainly use cryptocurrency now for daily purchases and stuff.  It's quicker, cheaper and more secure than banking with some giant corporation.  I haven't had any real issues with hackers or getting ripped off either.   Banks still have some usefulness when it comes to things like payroll or securing a loan.  But for most everyday transactions, I think cryptocurrency is the way of the future.  Its just a more streamlined, locked-down, and transparent system.  And the technology is only getting better as time passes.  I honestly believe cryptocurrency will revolutionize finance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "December 13, 2023, 04:07:46 PM",
      "body": "Yes, I still use banks and banks still play a role for those who have Bitcoin or other crypto, because they cannot be used for daily transactions in making direct purchases using fiat or debit cards and so on. And if I want to use Bitcoin or other crypto, I have to convert it into fiat so it can be used for transactions or buying and selling.And the reason is because in the country where I live, Bitcoin cannot be used as a transaction tool but is allowed as an asset or investment.And maybe Bitcoin or other crypto can only be used for transactions with those who use Bitcoin or cryptocurrency too and that too personally or individually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "December 13, 2023, 04:12:55 PM",
      "body": "Not having a bank account is insane, for most people throughout the world.  Now as a financial advisor, and someone who knows the inner workings of banks very well, I can also say for the most part I absolutely don't trust them.  Now for smaller \"mom and pop\" type banks, or credit unions, that's a different story.  However the big behemoth types banks such as JP Morgan, Wells Fargo, Bank of America etc, I agree they are most certainly corrupt, and not worth using.  However to totally rid of banks is mostly nonsensical in most part of the earth.  How are you going to get paid by work?  How are you going to make payments to most outlets (most do not accept cryptocurrency)  Where are you going to store your traditional fiat money?  Etc etc..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "December 13, 2023, 04:15:17 PM",
      "body": "Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMWe have cryptocurrency you still use Banks ? The bank online many times not working slow Also i want to transfer fast to Canada to russia i cant do that or india to USA i cant do that i need instantly.Also i asked money my bank dont give so If the bank don't help me to get rich then i dont need them.Do you still use Banks ? Im using only cryptocurrency debit cards and they always work better than bank.So Im still surprised If anyone still use Banks they are old Do you use more crypto or banks for your daily or average transactions ? Do you have had problems with hackers or someone steal money from your cryptocurrency or bank Do you think banks not working reliable any more ? I teach all my family to use cryptocurrency becouse i dont trust Banks and i think If you can tell your bank mind your business you are scam i told my bank If you not give me loans or credit i dont need you and i close it does the use of Bitcoin or any other cryptocurrency stop one from using banks? Who have you the impression that banks are not functional and should be done away with?Maybe you should understand that their are things that will come to your mind and it's just best to leave it there and never spill it out.Bitcoin is bitcoin and it has it own advantages and disadvantages and their area of use and application varies in their unique way.In my country for example, what is common and popular for people is the bank and they are rendering the needed service to the best of their ability, the youth and educated adults knows about cryptocurrency and are the ones currently using it. If you tell an average market woman to invest her money into bitcoin, she won't even understand what you are saying but saving her money in the bank won't be a big deal because she knows a lot of people doing it and might have been saving her money in the bank already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bounceback",
      "created_time": "December 13, 2023, 04:22:39 PM",
      "body": "Are you kidding your question? Bank is most important part in our life and I don't sure you can purchase or investing in bitcoin without Bank helped, Bank is most important part of bitcoin and I sure although near in the future Bitcoin become legal transaction we still need bank for purchasing bitcoin or withdrawing assets trough to be fiat trough Bank. Bitcoin still not supported as legal payment transaction exactly in my country bitcoin available for assets commodity only and not allowed use bitcoin for transaction payment. I need Bank as third place for withdrawing my bitcoin to be fiat assets and get Bank service for cash out my paper money. Many traditional market and some of them not popular with bitcoin, Bank can't delist from our transaction kinds however bitcoin have advantage but bank still use for many kinds of transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 13, 2023, 04:53:42 PM",
      "body": "Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMAlso i asked money my bank dont give so If the bank don't help me to get rich then i dont need them.Bitcoin can serve two main purposes, it could be used as a currency used to pay for goods and services and it could be an investment platform. People mainly use banks for financial transactions and you don't expect them to make you rich. if you also use Bitcoin as a means of payment, it will not bring any profit except if you use it for investment. Banks will not give you money except if invest in services like fixed deposits which could give interest. But keeping money in fixed deposit is a waste of time because inflation will gradually make it worthless.   QuoteDo you still use Banks ? Im using only cryptocurrency debit cards and they always work better than bank.So Im still surprised If anyone still use Banks they are oldFiat is the most popular means of payment in my country. Many people don't know about cryptocurrencies and will not accept them as a currency, so you cannot live on cryptocurrencies alone. I still rely on banks to carry out my financial transactions. The government is not also helping matters because they have been hostile to cryptos.  QuoteDo you have had problems with hackers or someone steal money from your cryptocurrency or bank Do you think banks not working reliable any more ? I have experienced loss of funds because of a hack on my bank account. And the bank couldn't trace the hacker or where the funds were sent to. I don't have confidence in banks because they have proved to be unreliable. Many people in my country have lost so much money because of internal fraud.  QuoteI teach all my family to use cryptocurrency becouse i dont trust Banks and i think If you can tell your bank mind your business you are scam i told my bank If you not give me loans or credit i dont need you and i close it It is important to teach your close family members about cryptocurrencies especially if you have plans to keep some inheritance in cryptos. The need to know how to access and use wallets. They are also meant to learn how to protect wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "December 13, 2023, 05:15:26 PM",
      "body": "Same way you don't trust banks, is the same way most people who use it don't trust crypto currency and not interested in how it works.Fiat banks will continue to exist because it is the modern precipise of what led to the idea of cryptocurrency and the decentralized system. Still, it is the legal tender of a country that is kept, or processed right in the banking halls of each country and will be used as long as cash exist. If you like told here use cryptocurrencies more and your family too, it is because your country accepts it and am sure you had to change some BTC or cryptocurrency asset to cash inorder to sort yourself at one point or the other .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "December 13, 2023, 05:42:56 PM",
      "body": "As long as fiat money is still a legal tender and generally accepted for buying and selling, banks are going no where and would continue to be popular with anything relating to peoples finances. As to poking people and terming anyone who uses banks as old, it’s only stupid to ditch the formal and most used method of financial transactions around the earth. Banks are still reliable as they’re still needed and widely used today.Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMi told my bank If you not give me loans or credit i dont need you and i close it This seems to be your grievance with the bank. You’re probably not eligible and I’m pretty sure the bank probably won’t notice and likely won’t care to see you leave either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "December 13, 2023, 05:49:06 PM",
      "body": "No doubt even a blind man knows that the banking system is not working well, those that have opportunity to spend bitcoin freely why won't  they choose bitcoin to use bitcoin when it is very easy for them to have access to their money wherever they want. You should understand that it is not in every country where bitcoin is spent for exchange of goods and services. If some people still use bank card to spend money I don't think they should be blame for that maybe they are restricted in their country  of using bitcoin.  Some people would even prefer to hodl their bitcoin than to spend it on everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 13, 2023, 05:50:30 PM",
      "body": "Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMWe have cryptocurrency you still use Banks ? Yes and why not? There is no good reason to shift to Bitcoin completely. Bitcoin transactions are slow and expensive compared to banks. Bitcoin does not provide me access to traditional stock markets. Bitcoin does not provide me access to precious metals. Bitcoin cannot bring the banks down. Not sure why people always want to start a war between Bitcoin and Bank. But Bitcoin was not created to make banks look out dated. Especially the current scenario makes Bitcoin Look outdated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MFahad",
      "created_time": "December 13, 2023, 05:57:54 PM",
      "body": "Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMWe have cryptocurrency you still use Banks ? The bank online many times not working slow Also i want to transfer fast to Canada to russia i cant do that or india to USA i cant do that i need instantly.Also i asked money my bank dont give so If the bank don't help me to get rich then i dont need them.Do you still use Banks ? Im using only cryptocurrency debit cards and they always work better than bank.So Im still surprised If anyone still use Banks they are old Do you use more crypto or banks for your daily or average transactions ? Do you have had problems with hackers or someone steal money from your cryptocurrency or bank Do you think banks not working reliable any more ? I teach all my family to use cryptocurrency becouse i dont trust Banks and i think If you can tell your bank mind your business you are scam i told my bank If you not give me loans or credit i dont need you and i close it Crypto currency and bank are two separate things. We invest in crypto currency, while the money we have is saved in the bank. The bank does not help anyone to be rich, but it protects your assets, however, the bank can lend to any business that you can increase, and get rich. Your bitcoin crypto currency debit card can work well, but it is not intended to ignore the bank. The bank has its own importance that can never end.Anyone who deals with the bank is never old, but it is a basic need for all.I think you think about your limit and your surroundings. You do not know the rest of the world, because there are still many countries where very few people know the crypto currency, and here this transaction is not in crypto currency. Most people, including myself, use a bank for daily transactions. Banks are more reliable than crypto currency, and hackers attack is much lower than crypto currency. So many banks are still working well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "December 13, 2023, 06:00:54 PM",
      "body": "Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMWe have cryptocurrency you still use Banks ? The bank online many times not working slow Also i want to transfer fast to Canada to russia i cant do that or india to USA i cant do that i need instantly.Also i asked money my bank dont give so If the bank don't help me to get rich then i dont need them.Do you still use Banks ? Im using only cryptocurrency debit cards and they always work better than bank.So Im still surprised If anyone still use Banks they are old Do you use more crypto or banks for your daily or average transactions ? Do you have had problems with hackers or someone steal money from your cryptocurrency or bank Do you think banks not working reliable any more ? I teach all my family to use cryptocurrency becouse i dont trust Banks and i think If you can tell your bank mind your business you are scam i told my bank If you not give me loans or credit i dont need you and i close it Yes, I use banks because it's convenient and profitable. Mutually beneficial, of course, because banks are certainly not altruistic companies 1. Transfers from card to card, at least in Ukraine - it is no more than 15-30 seconds. In the U.S. sent using PayPal associated with the card - also quickly. Hackers, break-ins - no. There are many additional levels of protection of access to card accounts, which do not allow it, if I have not lost the card or phone, glued to it all the passwords and codes 1.1. Transfer from the EU to my account (within business) - yes takes up to 72 hours, but this is a feature of the European banks.2. Cryptocurrency transfers can certainly win, at least due to the relatively high speed and commission (and then not everywhere). But ... Until cryptocurrency has not become an official means of payment, your recipient, having received for example bitcoin, and wishing to dine in a restaurant, will be forced - yes yes yes yes, sells on the exchange, to withdraw to the card, because the restaurant accepts money ... The circle is closed...2.1 The customer company in the EU has no legal grounds to pay me in cryptocurrency. And I do not want to use \"gray schemes\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "December 13, 2023, 06:09:45 PM",
      "body": "Quote from: Fullbear2222 on December 13, 2023, 02:37:28 PMDo you still use Banks ? Yes, i still make use of banks because i needed to make some certain payments to other people who don't use bitcoin yet, but am not having my entire finance with banks, instead, i make use of the banks each time i exchange my bitcoin to fiat and only do that for the little amount of money i needed to use at the moment, but i believe a time is coming soon where using banks will not be condole by many again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "December 13, 2023, 06:14:48 PM",
      "body": "Quote from: DrBeer on December 13, 2023, 06:00:54 PM2. Cryptocurrency transfers can certainly win, at least due to the relatively high speed and commission (and then not everywhere). But ... Until cryptocurrency has not become an official means of payment, your recipient, having received for example bitcoin, and wishing to dine in a restaurant, will be forced - yes yes yes yes, sells on the exchange, to withdraw to the card, because the restaurant accepts money ... The circle is closed...2.1 The customer company in the EU has no legal grounds to pay me in cryptocurrency. And I do not want to use \"gray schemes\".Still true to this day that we still have to sell to have cash to pay but I'd be more cautious to put more into banks than in stablecoins. There are still times that I have to send more to banks but will tend to withdraw them that day or the next because the reason to withdraw is to buy the stuff I need. Like storing food before the prices go up again.True that banks are still useful, online services they provide are still reliable. But most of all, I prefer to keep my money in BTC for it's safer and more profitable to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}