{
  "id": "topic_5448762",
  "title": "JamesBorn",
  "author": "JamesBorn",
  "created_time": "April 14, 2023, 03:24:03 AM",
  "content": "Some days looks like a curse day, I wanted to keep it to myself but I felt it more reasonable to share. I involved in some business investment which initially the promise was really good after week of deal, I just back from work, I saw a call from my colleague we did the business together and I call back to hear him crying on phone. That the business we involved into is fake and the office is close, the MD has disappeared, for two minutes I was shivering with sweat because that's the highest amount I have involved business so far. Am regretting to have used in bitcoin by now I would have be on advantage with bullish price.I have not gotten myself this days. Do you feel down when such sudden hits happens to you?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448762",
  "comments": [
    {
      "author": "Die_empty",
      "created_time": "April 14, 2023, 03:42:47 AM",
      "body": "Quote from: JamesBorn on April 14, 2023, 03:24:03 AMSome days looks like a curse day, I wanted to keep it to myself but I felt it more reasonable to share. I involved in some business investment which initially the promise was really good after week of deal, I just back from work, I saw a call from my colleague we did the business together and I call back to hear him crying on phone. That the business we involved into is fake and the office is close, the MD has disappeared, for two minutes I was shivering with sweat because that's the highest amount I have involved business so far. Am regretting to have used in bitcoin by now I would have be on advantage with bullish price.I have not gotten myself this days. Do you feel down when such sudden hits happens to you?The returns from Ponzi or fake investments will always be attractive. So the first sign you must check out before investing is the promised profit because scammers will keep it high to make the business look extraordinary. I think your loss is a sign that you are not really reading and applying the information from this forum. Or maybe the profit (greed) overshadowed your sense of reasoning. I am pleased that you have learned a lesson but sorry because you learned it the hard way. You and your friend should accept the loss in good faith. It's painful to lose your hard-earned money but you must stay healthy and alive to make money. My advice is don't think too much because it could affect your emotion, health, and almost everything around you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "April 14, 2023, 04:21:56 AM",
      "body": "I have never lost large amounts as you seem to have done. I try to apply Warren Buffet's two rules of investing:QuoteThe first rule of an investment is don't lose [money]. And the second rule of an investment is don't forget the first rule. And that's all the rules there are.Another thing to bear in mind is that if something is too good to be true, it probably is.  I hope that at least this case will help you so that something similar never happens to you again in the future. Quote from: JamesBorn on April 14, 2023, 03:24:03 AMI have not gotten myself this days. Do you feel down when such sudden hits happens to you?It is normal to feel like that but try to look at a bright future and start working for it as soon as possible. The lower the low, the higher the high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "April 14, 2023, 04:49:25 AM",
      "body": "People say that grieving the loss of money is like grieving the loss of a child. And I believe that just as a child is nurtured with care, money has to be worked hard for and after hard work when the desired money comes in hand but with that money we fulfill many hopes or needs of our daily life. And the remaining money is deposited in their locker very carefully so that there is no loss of that money. But when that money is lost in a moment, the grief is understandable. The only thing you can understand is the grief you feel after losing money.Quote from: JamesBorn on April 14, 2023, 03:24:03 AMI have not gotten myself this days. Do you feel down when such sudden hits happens to you?Like you I was a victim of such a situation. And the last few days I have been different from the time I was subjected to such a situation. I was pretty devastated to say the least.  This happened when I invested in Luna Coin. Within a day, my hard-earned huge amount of investment was wiped out. I could not control myself. However, I came out of that time with much difficulty. And then I could understand what it would be like to grieve the loss of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "April 14, 2023, 05:06:05 AM",
      "body": "I will certainly feel down also if this happens to me. It's a normal reaction. Money is hard to earn and if it's easily burned like that, it will really be painful. It would also make me angry.It is good that you share it here. Let it out. Talking to somebody about it will surely be of help. At the end of the day, however, we have no choice but to move on. But it doesn't mean you won't have to fight for your money. By all means, report it to the authorities. Collect all the evidences and file a case in court. Not only do you need to get your money back, the scammers should also be caught, prosecuted, and jailed for their crimes. And also so that they cannot victimize other people anymore.Of course, you will learn your lessons as well. Next time, enough due diligence should be made especially because it involves risking your hard-earned money. It's all right to doubt. As a matter of fact, always doubt!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "April 14, 2023, 09:40:55 AM",
      "body": "Its natural for someone to lose money in a business he didn't make appropriate searched on, maybe it could be that the gain which was promised to you were much making you not focusing on the risk aspect. You know as man or investor never you channel your thinking on the profits side of it rather look deeper than that otherwise, whenever you raise a huge amount of money to invest in that business it happens to sink down, if not with the grace of God it would amount you getting collapse without any reason. That is why before venture into business also look at the advantage and the disadvantages that involves in the business before getting your funds into it.This was a reason i ever rely on bitcoin investment than any other investment out there because whenever you invested in bitcoin you may not lost all the bitcoin but rather the dollar equivalent might depreciate leaving you only the btc value in your address or wallet. So anytime the price of bitcoin gets to the usual price then you get back your equivalent in dollars.Anyway, i feels so sorry for you because i know this is a very hard time for everyone but take heart. So its to me when i also made huge lost out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaPk",
      "created_time": "April 14, 2023, 10:00:05 AM",
      "body": "We hear about such scams every now and then. Recently there is a scam in my country where people lost millions of rupees because they invested in an app that recently turned out to be ponzi, Pakistanis lose millions to IDA app that turns out to be crypto Ponzi scam. That ponzi platform hire services of digital content creators, who advertised the platform to people who later were the victims. Quote from: JamesBorn on April 14, 2023, 03:24:03 AMI have not gotten myself this days. Do you feel down when such sudden hits happens to you?Its useless to cry over spilled milk. Just get over that incident and never invest in ponzi schemes. Why investing anywhere when we have Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tazmantasik",
      "created_time": "April 14, 2023, 10:21:06 AM",
      "body": "Depending on which kinds losing money, from investment like hype or ponzi its not matter because I know bigger risk waiting for when investing in ponzi project, but some time most disappointed when losing money trough my wallet hacked. I can't talk any words ever in this position losing much money in my wallet after hacking but keep wake up and take another opportunity getting much money more than have loss.Losing money in Ponzi have risk because we know about Ponzi is not exist for longer time, entry or investing in the early will get return and earn profit but not applicable when investing in Ponzi after late. I don't think get return back when investing in Ponzi and have prepare my self for losing money with Ponzi investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "April 14, 2023, 10:26:53 AM",
      "body": "I have nothing much to say to you in this regard as you didn't let us know the magnitude of the money in question to know how painful it could be. But still, I'm sorry for your loss, but you have to take heart and know it is part of life. No one will lose money and will not feel hurt unless the person is a vandal. It's you that would have to be more careful next time as money is not easy to come by these days.Investing money in what you don't really understand or verify to be true is absolutely your fault.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "April 14, 2023, 10:59:21 AM",
      "body": "Nobody is happy to lose money, money is not easy to make some when one looses money it hurt a lot, everyone one there own experience of what it feel when we do lose money, unless that peeson didn't work for that money, if you work for your money and you losses it in one way or another then u will know how it feels, I have a friend who using his life saving  to invest, he didn't ask question and did everything without even talking to me his friend, then he lost the money, he almost died, it took a very long time before he could get his self. So all am saying it that nobody is happy to lose money",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "April 14, 2023, 12:18:27 PM",
      "body": "Quote from: JamesBorn on April 14, 2023, 03:24:03 AMSome days looks like a curse day, I wanted to keep it to myself but I felt it more reasonable to share. I involved in some business investment which initially the promise was really good after week of deal, I just back from work, I saw a call from my colleague we did the business together and I call back to hear him crying on phone. That the business we involved into is fake and the office is close, the MD has disappeared, for two minutes I was shivering with sweat because that's the highest amount I have involved business so far. Am regretting to have used in bitcoin by now I would have be on advantage with bullish price.I have not gotten myself this days. Do you feel down when such sudden hits happens to you?Do you want to hear about a different perception in such unpleasant situations? That doesn't happen. Any person will be depressed by what happened, because an unsuccessful investment can only upset. This is the normal state. Almost everyone lost money: some more, some less, some in investments, some in a different way. I don't think that anyone exulted with joy at such moments. So, be patient for a while and forget about the lost. Accept what happened as a given and don't allow it to happen again. Leave the past in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "April 14, 2023, 01:03:50 PM",
      "body": "Quote from: Darker45 on April 14, 2023, 05:06:05 AMI will certainly feel down also if this happens to me. It's a normal reaction. Money is hard to earn and if it's easily burned like that, it will really be painful. It would also make me angry.It is good that you share it here. Let it out. Talking to somebody about it will surely be of help. At the end of the day, however, we have no choice but to move on. But it doesn't mean you won't have to fight for your money. By all means, report it to the authorities. Collect all the evidences and file a case in court. Not only do you need to get your money back, the scammers should also be caught, prosecuted, and jailed for their crimes. And also so that they cannot victimize other people anymore.Of course, you will learn your lessons as well. Next time, enough due diligence should be made especially because it involves risking your hard-earned money. It's all right to doubt. As a matter of fact, always doubt!I see it from a different angle. A person who has lost a significant amount will understand for some time why this happened and what to do in order not to receive such mistakes in the future, and his depressed state will be visible to others. You don't have to be a psychologist.But pay attention to the enthusiasm with which the OP creates new topics on the forum, and most importantly, with what interval, and the topics of the new topics are completely different. Where is regret or despondency lost here? I do not see.Fishing, fishing, and more fishing. Today, the emphasis is on pity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "April 14, 2023, 01:21:30 PM",
      "body": "Quote from: JamesBorn on April 14, 2023, 03:24:03 AMSome days looks like a curse day, I wanted to keep it to myself but I felt it more reasonable to share. I involved in some business investment which initially the promise was really good after week of deal, I just back from work, I saw a call from my colleague we did the business together and I call back to hear him crying on phone. That the business we involved into is fake and the office is close, the MD has disappeared, for two minutes I was shivering with sweat because that's the highest amount I have involved business so far. Am regretting to have used in bitcoin by now I would have be on advantage with bullish price.I have not gotten myself this days. Do you feel down when such sudden hits happens to you?That's sad to hear OP, hope we learn from out mistakes and always double check to where we invest since it's still money that you're risking. You could do some research first about the business background if its legit and registered because we can't always trust a recommendation especially if they introduced it to you without important information. That's also one of the common mistakes, if you don't afford to risk your money in someone calls then be independent on doing your own calls since its your money you can't blame others since you insist on taking the risk. It's part of the experience to get scammed actually I got scammed multiple times with different scenarios due to some of them looks literally legit and also have papers that seems real. I handled this situations by taking it as a lesson and look forward as I can't change the past, but of course report those scammers for other people to be aware.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "April 14, 2023, 01:37:08 PM",
      "body": "Quote from: JamesBorn on April 14, 2023, 03:24:03 AMSome days looks like a curse day, I wanted to keep it to myself but I felt it more reasonable to share. I involved in some business investment which initially the promise was really good after week of deal, I just back from work, I saw a call from my colleague we did the business together and I call back to hear him crying on phone. That the business we involved into is fake and the office is close, the MD has disappeared, for two minutes I was shivering with sweat because that's the highest amount I have involved business so far. Am regretting to have used in bitcoin by now I would have be on advantage with bullish price.I have not gotten myself this days. Do you feel down when such sudden hits happens to you?That will be going to happen from trusting an investment that promises huge ROI in just a few days. I understand what you feel but can't blame any person other than yourself. Because if you and your friend are keen enough about investment, it is certainly you'll never fall into such a scheme but want it happens is that you have been influenced by your greediness and thinking I'll become rich...People are not learning yet, too unfortunate that we need to lose our hard-earned money before we realized that we're beaten by scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "April 14, 2023, 01:38:16 PM",
      "body": "It's a shame because there are still many people who are still tempted by investments that promise big things that end up being fraudulent. In fact, there is a lot of news like this everywhere and it is advised to be more careful, don't believe easily and do very thorough research before getting involved.Currently there are many forms of investment because at this time everyone invests to develop and secure their assets so that in the long term they can generate profits, and this moment will be exploited by fake investments that will end up in fraud. And they form a team with their respective duties to find investors who are easily tempted to invest and are promised big profits in the near future, and this problem in my opinion is the fault of consumers or customers because they do not have knowledge and experience and are also not updated on news that there is and what is more important is that they did not do any research or research beforehand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "April 14, 2023, 01:44:59 PM",
      "body": "Absolutely. What else would you feel when you lost a lot of money? Stress, Down, Regrets, and mostly negative thoughts. Just please don't think about something worse than that. This should be a good learning point. One mistake it's their fault, blame them, but next mistake it's your own. It's called being stupid. Remember, if a promise is so good to be true, don't believe them. That is how they will market their business here in the crypto industry then try to hoard as much victims as they can before they rug pull.Next time, DYOR. The lesser trust you give them the better choices you will make.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AicecreaME",
      "created_time": "April 14, 2023, 01:49:01 PM",
      "body": "Background research first is very important if you're gonna invest your money on someone or something. You never learn until something happened, so I hope you do better the next time. The best choice is to accept it and move on, you can file a case about it but it'll cost you even more and will take much of your time, but it depends on what legal actions you guys wanted to do about it. It's normal to feel down after such bad investment, or should I say ponzi investment, that are too good to be true, that's why don't ever trust your money to someone you don't even know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 14, 2023, 02:30:40 PM",
      "body": "It always baffles me the amount of both uneducated and educated people who get involved with those scams. I kind of makes me feel my faith in humanity a little bit, to be honest.OP, just try to heal mentally and realize what your mistake was and never get involved with the so-called \"high-risk\" investments, they are all a scam designed to empty the pocket of as much people as possible taking advantage of the fact Bitcoin and altcoins transactions cannot be reversed.This has never happened to me, but I would feel very bad.Fortunately, I took my time to study what the most common scams are within our community. I hope you can recover from this and never get involved again with criminals.Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "misterrtwisterr",
      "created_time": "April 14, 2023, 02:32:04 PM",
      "body": "You'll often hear \"don't gamble more than you're willing to lose\". Same applies to investments. Or borrowing money to people. If you lost more than you can afford, then you'll feel even worse than if you lost a smaller sum. I think you got a valuable lesson in life. Now embrace it and learn something from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "April 14, 2023, 02:38:24 PM",
      "body": "It sounds like you and your friend invested in a Ponzi project rather than a real business. Whatever the reason, losing money is always a very unpleasant feeling, but in this case, you can't blame anyone because it's your own fault. It seems that you have been blinded by your greed when investing in scam projects that promise high returns.It was an expensive lesson for you, and it happened anyway. Instead of continuing to be depressed, you should think about how to make back your lost money, I mean work hard, and find reputable investment sources like bitcoin or real estate. Don't just run after projects that promise high profits, they are all scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}