{
  "id": "topic_5400906",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "May 31, 2022, 07:15:08 PM",
  "content": "QuoteApril 25 (Reuters) - Craig Fuller monitors millions of transactions between U.S. truckers and their customers as chief executive of transportation data company FreightWaves - and he does not like what he is seeing.There has been an unexpectedly sharp downturn in demand to truck everything from food to furniture since the beginning of March and rates in the overheated segment that deals in on-demand trucking jobs - known as the spot market - are skidding.\"It basically just dropped off a cliff,\" said Fuller, who is concerned that the United States is at the start of a trucking recession that could decimate truckers' ability to dictate prices and push some small trucking firms into bankruptcy.Meanwhile, investors and financial analysts worry what will happen if the trucking slump deepens and spreads.History has proven trucking to be a possible indicator for the U.S. economy. That is because when people buy less, companies ship less - and business activity slows. Economic recessions followed six of the 12 trucking recessions since 1972, according to an analysis by trucking data company Convoy.Experts predicted trucking would soften a bit as pandemic-weary consumers shifted some spending from goods to services in response to the United States lifting COVID prevention measures. But they did not foresee Russia's invasion of Ukraine, which sent fuel prices to record highs, jolted already volatile stock markets, and forced shoppers to hit pause.And now, trucking's most demand-sensitive sector - the spot market - is in correction territory.\"It is the proverbial 'canary in the mineshaft',\" said Joseph Rajkovacz, director of governmental affairs for the Western States Trucking Association. The group represents small trucking companies that dominate the spot market, which handled as much as 30% of freight during the height of the pandemic.The spot rate deterioration hit when diesel prices were roughly doubling, battering the take-home pay of truckers like Marco Padilla, 63.A few years ago, California-based Padilla spent 25-30 cents per mile to run his truck. \"So for every dollar (of pay), I was pocketing 70 cents. Now it costs $1 a mile,\" said Padilla.Average first-quarter spot rates, excluding fuel, dove 55 cents from $2.78 per mile in mid-January to $2.23 on April 14. Spot rates normally drop about 22 cents per mile during that period, said Dean Croke, freight market analyst at DAT Freight & Analytics.While spot rates remained 37 cents per mile above what they were during the last bull market for trucking in April 2018, they fell 6 cents year-over-year earlier this month - marking the first such reversal of the current cycle.\"That's where the fear is. Is that the floor? Does this keep going?\" Croke said of the demand-led decline.BOOM TO BUST?The share of freight handled by the U.S. spot trucking market roughly doubled after consumer spending on durable goods surged some 20% during the pandemic. In their rush to keep up, retailers and other shippers focused on speed over efficiency - using more trucks and exacerbating demand for them.At one point, the truckload spot market was handling more than 1 million loads per day, versus its historical average of about 400,000, said Brent Hutto, chief relationship officer at TruckStop.com, which - like DAT - matches truckers with spot market loads.But demand tumbled in March, when retail sales excluding purchases of gasoline fell 0.3%. Online sales, which surged during the pandemic, declined for the second month in a row. read moreSkyrocketing diesel prices convinced shippers to wait to fill truck trailers, rather than rushing them out partially loaded - further moderating demand, analysts said.Big trucking firms like JB Hunt Transport Services (JBHT.O) and Knight-Swift Transportation Holdings (KNX.N) are somewhat insulated by their one-year, fixed-price contracts with companies ranging from Walmart (WMT.N) and Home Depot (HD.N) to Procter & Gamble (PG.N). Walmart and many other companies have in-house trucking while also employing outside firms.Stifel transportation analyst Bert Subin said in a research note that he expects soft truckload demand in the second and third quarters, followed by a holiday season-fueled fourth-quarter rebound. Deutsche Bank earlier this month predicted interest rate hikes will tip the United States into recession next year.Meanwhile, some shippers are asking for shorter trucking contracts, \"given their belief that rates may tick lower,\" Cowen transportation analysts said in a recent note.Indeed, some executives like Fraser Townley, CEO of video gaming controller seller T2M, are celebrating the declining trucking prices as a relief to their profit margins.\"They're about one-third down. There's still a long way to go,\" Townley said.https://www.reuters.com/business/us-trucking-downturn-foreshadows-possible-economic-gloom-2022-04-25/....Electric and hydrogen powered 18 wheelers can't arrive quickly enough.Years ago there was a buzz around biodiesel processed from waste vegetable oil collected from restaurants. Normally restaurants pay to have their waste oil disposed of, which made it feasible for biodiesel advocates to collect it for free. I wonder what happened to that movement? It seems like something that could be useful at the moment.Another interesting angle is many diesel engines being flex fuel and being able to combust vegetable oil (as illustrated on myth busters):https://www.youtube.com/watch?v=QEX1YFXYTdIAt a certain tipping point, vegetable oil could become a more affordable fuel than diesel. Thankfully we have not yet reached that point. If circumstances became desperate perhaps it would be feasible to increase production of vegetables used to create vegetable oil in an effort to reduce prices of alternative fuels?.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400906",
  "comments": [
    {
      "author": "AndyGryffindor",
      "created_time": "January 01, 2023, 02:56:51 AM",
      "body": "The Bitcoin Blockchain Fuel saver could save truckers billions per year, if only they would try it out? I see it as one of the greatest inventions of the century. The problem is that very few people know about it. The economy, air pollution reduction and engine longevity could be improved by a free device that a grade school kid could build. The directions are found in my other post in the off topic section around pages 17 to 18 currently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "January 01, 2023, 04:55:51 AM",
      "body": "I followed this old trucker guy on YouTube and he has a lot of knowledge of the trucking industry. He basically said that there was so many new truckers that started a year ago that he is not surprised many are suffering.However he says it’s similar to a Bitcoin cycle. It basically cycles up and down. And most likely will keep repeating for a very long time. Many started trucking just like many started with cryptos for the easy money, then the trend changed and many are out of the trucking business now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "January 01, 2023, 01:02:59 PM",
      "body": "Will trucking be as standard as it was in the past? Transportation methods have evolved from drones, to robots, self-driving trucks, and a lot of things that did not exist in the last century.I think that the dependence of land freight on diesel will decrease during the next 30 years, which means that we may not need the worker and we may not need the fuel, and thus cheaper and more efficient transportation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 01, 2023, 02:17:46 PM",
      "body": "covid 2020 caused alot of issues for truckers, many stayed homealso many people moved homes to different area's(less covid restricted area's) so needed more removal trucks... so more truckers were recruited and trained2021 saw more truckers, but a lessening of demand as the older truckers came out from covid stimulus pay offs to stay home and were met with the extra new recruit truckers2022 saw fuel prices go up do goods were transported by rail instead of trucksinflation saw truckers try to  demand more wage.less people buying homes/moving homes net result less truckers/trucks on the roads, more air/rail goods deliveriesmeaning too many truckers and not enough delivery demand..in a few years we will see trucks doing static routes(one depot to another depot on a straight highway journey A-B) go driverless, but until then the rail system will take most of the shipping container deliveries between counties/states",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "January 03, 2023, 08:29:33 AM",
      "body": "Quote from: Hydrogen on May 31, 2022, 07:15:08 PMElectric and hydrogen powered 18 wheelers can't arrive quickly enough.Years ago there was a buzz around biodiesel processed from waste vegetable oil collected from restaurants. Normally restaurants pay to have their waste oil disposed of, which made it feasible for biodiesel advocates to collect it for free. I wonder what happened to that movement? It seems like something that could be useful at the moment.Another interesting angle is many diesel engines being flex fuel and being able to combust vegetable oil (as illustrated on myth busters):https://www.youtube.com/watch?v=QEX1YFXYTdIAt a certain tipping point, vegetable oil could become a more affordable fuel than diesel. Thankfully we have not yet reached that point. If circumstances became desperate perhaps it would be feasible to increase production of vegetables used to create vegetable oil in an effort to reduce prices of alternative fuels?Converting vegetable waste to biodiesel would be a good innovation because this waste is in abundance in almost all the nations of the world. But I don't think that this method can produce diesel in large quantities that can meet the needs of these truckers. Nevertheless, it is a good invention. Another problem is that the price of vegetable oil can skyrocket if this product is now been used as fuel. The world economy would stabilize and recover only when the war in Ukraine ends and if there is a potent vaccine or effective drugs for the prevention and cure of Covid 19. At first, I underestimated the effect of this war on my local economy until a local supplier of palm oil told me that the war is one of the reasons for the high price of palm oil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barbara44",
      "created_time": "January 04, 2023, 01:25:24 PM",
      "body": "Truckers always forget that there are unemployed people who would love to take their job. And this happens every single time, at least in Europe it does, no idea if it is the same in the USA as well. When truckers get together and demand more and more, companies just buy the trucks themselves, and hire unemployed people and send them as their new truckers, if they want more they will fire the new ones and get more.So, truckers are just unqualified workers that are bit different than McDonalds cook, just a bit, and should be paid a bit more, but they are expecting wages rivalling doctors, that ain't gonna happen, we are going to see them get back to reality after a while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 04, 2023, 04:14:25 PM",
      "body": "here in the UK we had covid, making some OLDER truck drivers stay home. creating a demand for some younger people to train as truckers. we had brexit stopping euro truckers coming in causing more demand for young people to train up as import/export truckers..then we now have the old truckers coming out of covid and finding the new recruits took their jobs and less older truckers needed. and everyone wants to blame lack of demand of produce as the reason older truckers cant get any workwhy would any distributor that financed a young persons training and gave them a job for £20k.. want to instead tell the young chap to F-off (meaning cant repay loan also)just to re-employ an old grouchy driver that wanted £43k+ a year",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}