{
  "id": "topic_5473754",
  "title": "PepeLapiu",
  "author": "PepeLapiu",
  "created_time": "November 11, 2023, 08:05:02 PM",
  "content": "Guys.Here is my last transaction with 50sat/byte miner fee:dc75034724813aac27dcce42a79bd71e06399be45577fa8795c509db0cafbe58It confirmed in a single block. As expected after I manually estimated the miner fees based on this graph:https://jochen-hoenicke.de/queue/#BTC,2h,count,40But somehow my Electrum wallet (on both Windoze and Android) estimates 3x more miner fee at 150sat/byte for 2 blocks ETA.And I looked on the net for other miner fee estimators. They all are claiming an estimated miner fee of 100sat/byte for two blocks ETA. See for yourself here:This one claims 220sat/byte for two blocks confirmation:https://btc.network/estimateSame with this one:buybitcoinworldwide.com/fee-calculatorAnd this one overshoots by 3x with 163sat/byte:https://bitcoinfees.netWhat is going on here? Why is everyone overestimating miner fees?And where would I be able to find a reliable fee estimator?I run software that trades on p2p exchange HodlHodl. I need a way to get reliable fee estimation for 2 blocks ETA. Any suggestions?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473754",
  "comments": [
    {
      "author": "jrrsparkles",
      "created_time": "November 11, 2023, 08:10:27 PM",
      "body": "Quote from: PepeLapiu on November 11, 2023, 08:05:02 PMBut somehow my Electrum wallet (on both Windoze and Android) estimates 3x more miner fee at 150sat/byte for 2 blocks ETA.The fee required for transactions is dynamic and it changes every second especially when the network is highly congested so estimators may choose the higher fee to avoid getting stuck in such times.Personally, I noticed that in Electrum the fee will be overkill if it's in ETA, and the actual closest fee can be found in the Mempool from tip option.Also, this thread explains the same : Minimize your transaction fee with Electrum walletQuote from: PepeLapiu on November 11, 2023, 08:05:02 PMAnd where would I be able to find a reliable fee estimator?https://mempool.space/ offers real-time data and it's one of the tools I use to calculate the fee required at the time of boradcasting a TX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "November 11, 2023, 08:12:16 PM",
      "body": "Quote from: PepeLapiu on November 11, 2023, 08:05:02 PMGuys.Here is my last transaction with 50sat/byte miner fee:dc75034724813aac27dcce42a79bd71e06399be45577fa8795c509db0cafbe58It confirmed in a single block. As expected after I manually estimated the miner fees based on this graph:https://jochen-hoenicke.de/queue/#BTC,2h,count,40But somehow my Electrum wallet (on both Windoze and Android) estimates 3x more miner fee at 150sat/byte for 2 blocks ETA.And I looked on the net for other miner fee estimators. They all are claiming an estimated miner fee of 100sat/byte for two blocks ETA. See for yourself here:This one claims 220sat/byte for two blocks confirmation:https://btc.network/estimateSame with this one:buybitcoinworldwide.com/fee-calculatorAnd this one overshoots by 3x with 163sat/byte:https://bitcoinfees.netWhat is going on here? Why is everyone overestimating miner fees?And where would I be able to find a reliable fee estimator?I run software that trades on p2p exchange HodlHodl. I need a way to get reliable fee estimation for 2 blocks ETA. Any suggestions?Mempool.space has the most accurate bitcoin transaction fee estimator, so, use them the next time.Electrum and many other wallets can't calculate transaction fees accurately, so, never rely on them or you'll either pay very high fee and waste money for nothing or pay very low fee and will have to wait for days to get your transaction confirmed but problem can easily be solved anytime if you have enabled RBF which I strongly recommend.Also, keep in mind that there are times when fee fluctuates and if you see that mempool.space recommends, for example, 40 sat/vByte, the next minute it can grow up to 70 sat/vByte and you may have to increase it via RBF.To sum up: Stick with mempool.space and enable RBF in your Electrum. You'll never have a problem of fee estimation or delayed confirmations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 11, 2023, 08:35:58 PM",
      "body": "Quote from: PepeLapiu on November 11, 2023, 08:05:02 PMWhat is going on here? Why is everyone overestimating miner fees?Because some (not bitcoinfees as that is broken by design) don't estimate the minimum reqyuired, they estimate a fee that will guaratee you you will get a spot in the next block, so on top of the previous block fees they throw other variables there, inflating the fee sometimes twice to the minimum of the last 60 blocks, as the crappier ones do.And if you do that you encounter avergaes like 110sat/vb like in block 816330 for example, thus the misleading calculations.Some are even broken the other way as bitcoin fees tell you you will get a confirmation of 11.92 sat/vB in 24 hours, yeah...try that!Also, be careful, some use sat/b some sat/vb, this is really bad when you try to use Viabtc accelerator, which uses 10sat/b as minimum.Quote from: PepeLapiu on November 11, 2023, 08:05:02 PMI need a way to get reliable fee estimation for 2 blocks ETA. Mempool.space is as good as it can get.But it too has flaws as nobody can predict when the next block will be mined, for example, the last block, 816348 took 30 minutes instead of 10, so from the previous minimum of 30sat/vb you're up to 60, the fee that was good 40 minutes ago for next block is not good even for two now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 11, 2023, 08:36:19 PM",
      "body": "Quote from: PepeLapiu on November 11, 2023, 08:05:02 PMGuys.Here is my last transaction with 50sat/byte miner fee:dc75034724813aac27dcce42a79bd71e06399be45577fa8795c509db0cafbe58It confirmed in a single block. As expected after I manually estimated the miner fees based on this graph:https://jochen-hoenicke.de/queue/#BTC,2h,count,40But somehow my Electrum wallet (on both Windoze and Android) estimates 3x more miner fee at 150sat/byte for 2 blocks ETA.It is simple you used the ETA fee estimator in the electrum and it usually gives a much higher fee rate than mempool method, this two options are both estimators on electrum with ETA using the average 10 minutes to get the number of blocks that will be mined most at times it varies while that of the mempool is base on the size of unconfirmed transactions in MB and the latter is the more precise and usually has lower fees. Both are in electrumThe best is to calculate yours using that estimator used above or check memepool.space but be rest assured that none are 100% accurate so the best thing is to use an RBF wallet set the fee and if it need bumping you can do that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 12, 2023, 01:46:04 AM",
      "body": "Quote from: stompix on November 11, 2023, 08:35:58 PMMempool.space is as good as it can get.But it too has flaws as nobody can predict when the next block will be mined, for example, the last block, 816348 took 30 minutes instead of 10, so from the previous minimum of 30sat/vb you're up to 60, the fee that was good 40 minutes ago for next block is not good even for two now.This is basically the problem with fee estimation.Nobody knows if the next block will be mined in the next second or it will take more 30 minutes.I have seen blocks taking too long to be mined and then mempool.space feee estimation just got much higher in very few minutes. If you need to get into the next block , always use a higher fee than the minimum,  and using RBF is very good to, as you can change your fees if the transaction fee rate gets much higher",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "November 12, 2023, 01:55:20 AM",
      "body": "Quote from: jrrsparkles on November 11, 2023, 08:10:27 PMPersonally, I noticed that in Electrum the fee will be overkill if it's in ETA, and the actual closest fee can be found in the Mempool from tip option.Also, this thread explains the same : Minimize your transaction fee with Electrum walletThank you for quoting my thread. ETA is Estimate Time of Arrival and Estimate can be inaccurate (overestimate or underestimate). With Bitcoin transaction fee estimators, I only see overestimate and I see a need to check mempool by myself before broadcasting a transaction with a proper fee rate.I don't run my own node so I use two third party websites to double check mempools and pick a feasible fee rate to use.Quotehttps://mempool.space/ offers real-time data and it's one of the tools I use to calculate the fee required at the time of boradcasting a TX.There is another good mempool observer.https://jochen-hoenicke.de/queue/#BTC%20(default%20mempool),24h,weighthttps://bitcoindata.science/bitcointalk-api#bitcoin-fees (I recall this tool uses data from mempool.space)QuoteThis one claims 220sat/byte for two blocks confirmation:https://btc.network/estimateSame with this one:buybitcoinworldwide.com/fee-calculatorAnd this one overshoots by 3x with 163sat/byte:https://bitcoinfees.netThey have histories of overestimate fee rates so let's avoid them in future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 12, 2023, 03:11:59 AM",
      "body": "Quote from: dzungmobile on November 12, 2023, 01:55:20 AMQuote from: jrrsparkles on November 11, 2023, 08:10:27 PMPersonally, I noticed that in Electrum the fee will be overkill if it's in ETA, and the actual closest fee can be found in the Mempool from tip option.Also, this thread explains the same : Minimize your transaction fee with Electrum walletThank you for quoting my thread. ETA is Estimate Time of Arrival and Estimate can be inaccurate (overestimate or underestimate). With Bitcoin transaction fee estimators, I only see overestimate and I see a need to check mempool by myself before broadcasting a transaction with a proper fee rate.I don't run my own node so I use two third party websites to double check mempools and pick a feasible fee rate to use.Quotehttps://mempool.space/ offers real-time data and it's one of the tools I use to calculate the fee required at the time of boradcasting a TX.There is another good mempool observer.https://jochen-hoenicke.de/queue/#BTC%20(default%20mempool),24h,weighthttps://bitcoindata.science/bitcointalk-api#bitcoin-fees (I recall this tool uses data from mempool.space)QuoteThis one claims 220sat/byte for two blocks confirmation:https://btc.network/estimateSame with this one:buybitcoinworldwide.com/fee-calculatorAnd this one overshoots by 3x with 163sat/byte:https://bitcoinfees.netThey have histories of overestimate fee rates so let's avoid them in future.I use my trezor to pay I compare it to jochen I bolded above.I try to consolidate one wallet in my trezor so that on absolute needed fast confirms.I can send a small byte amount and use 11 sats. i then rush to viabtc and use the free acceleration tool.mostly used for buying 3000 usd or more gear from bitmain.if i do a send that is not important i may do 3 or  6 or 8 sats. I then use rbf on the trezor if I have to.I also hold ltc and doge to make payments cheap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 13, 2023, 11:36:56 PM",
      "body": "well there is random times of blocks.in an hour we should do 10 blocksbut if we make 1 block in an hour fees back up like mad.Also as some have said tx's can be a lot in 1 hour or even 3 straight hours.Combine these two and the backups get very big.To think you can do 2 block waits with perfect fee amounts is not realistic.Change that standard or over pay to be sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cricktor",
      "created_time": "November 15, 2023, 10:17:43 PM",
      "body": "As others have already suggested, mempool.space has a quite decent fee estimator. You can give https://whatthefee.io/ a try, in my opinion it's quite close to mempool.space. Needs maybe a few brain cells more to understand and interpret properly...I compare both regularly and so far I didn't spot noteworthy differences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "November 16, 2023, 03:42:33 AM",
      "body": "Quote from: Cricktor on November 15, 2023, 10:17:43 PMYou can give https://whatthefee.io/ a try, in my opinion it's quite close to mempool.space. Needs maybe a few brain cells more to understand and interpret properly...There is no documentation at all? I can do some guesswork but it would be better if the owner gave some documentation to avoid misinterpretation. I guess we can give suggestions if the owner has a thread here (or Twitter, if anyone still uses it). Personally, I wouldn't recommend this to newbies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timbulance",
      "created_time": "November 22, 2023, 06:39:38 AM",
      "body": "What ever happened to mempool.space having the feature to help with stuck transactions ? They spoke about updates at BTC conference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 22, 2023, 06:58:48 PM",
      "body": "Quote from: ETFbitcoin on November 22, 2023, 10:23:09 AMQuote from: Timbulance on November 22, 2023, 06:39:38 AMWhat ever happened to mempool.space having the feature to help with stuck transactions ? They spoke about updates at BTC conference. Actually it's called \"Transaction Acceleration Marketplace\" where you rely on mining pool to include your TX by paying them other ways. In practice, it's not really different from using ViaBTC paid acceleration service. But with more node and pool support full-RBF, you could just perform full-RBF rather than using one of these acceleration service.It was on paper at least a bit different, as in being way cheaper than paying for accelerators as you would pay just as much as needed.So you had a tx of 10sat/b, Foundry would include it in the next block and then they would check what tx they had to kick out to include yours and if that one was at 60sat/b you would only pay the difference, so it would be a bit superior to RBF as you would pay the minimum necessary to get in the block and the mining pool won't lose a penny either compared to ViaBTC free.But that was how it would have worked, IF!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "November 23, 2023, 09:19:25 PM",
      "body": "Quote from: ETFbitcoin on November 22, 2023, 10:23:09 AMBut with more node and pool support full-RBF, you could just perform full-RBF rather than using one of these acceleration service.Look at the Viabtc transaction accelerator fee structure to push a TX and it doesn't make sense at all now with the full RBF implementations on nodes.Binance Pool BTC Transaction Accelerator is relatively cheaper compared to ViaBtc but it's way more expensive than paying the actual fee even at the highly congested network status.Also, I came across Turn non-RBF transaction to RBF enabled? thread and how to do it step by step which may be useful in case if someone used a wallet that doesn't have an RBF-enabled wallet and now can import it on Electrum and rebroadcast it with a higher fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}