{
  "id": "topic_5436811",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "January 26, 2023, 01:22:20 AM",
  "content": "This is what we get without an accounting of where all that money we sent to Ukraine really went. Have any Bitcointalk members been on the rtake from this scandalous operation?Ukraine Rocked By Corruption Scandal, Wave Of Top Officials Resign: Sports Cars, Mansions & Luxury Vacations As People Sufferedhttps://www.zerohedge.com/geopolitical/ukraine-rocked-corruption-scandal-wave-top-official-resignations-sports-cars-mansionsThe Ukrainian government on Tuesday confirmed the resignation of multiple high ranking officials amid large-scale corruption allegations, in what's being called the biggest mass resignation and graft scandal since the Russian invasion began.Some dozen officials have quit their posts after a huge political shake-up over allegations and probes into cases ranging from bribery, to mismanagement of aid funds for purchasing food, to embezzlement, to driving expensive cars while common people suffer under wartime conditions.A top presidential adviser and four deputy ministers - among these two defense officials, along with five regional governors were forced out of their posts. And among the regional governors to step down included officials overseeing regions which have seen intense fighting, including the Zaporizhzhia and Kherson regions, where Russian forces have lately reported gains....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436811",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "January 26, 2023, 01:55:38 PM",
      "body": "^^^ For once I totally agree with you. However, it might be that Zelensky is in far deeper than these guys. They might only be taking the fall for him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "January 27, 2023, 06:48:09 PM",
      "body": "Quote from: af_newbie on January 26, 2023, 03:09:07 AMThey all should be arrested and charged.  Not just fired. That is unacceptable.Zelensky must show some balls and arrest the corrupted officials.They should not be tried for just corruption but economic sabotage and treason. These official are aware that Ukraine solely depends on aid from other nations to survive, yet they had the impetus to steal from a bleeding nation. These official inflated contracts and collected bribes thereby sabotaging the struggling economy of Ukraine. They have also betrayed the country because Ukraine trusted them and entrusted the destiny of this suffering citizens to them, but they betrayed the people. My only fear is that the citizens and the military might start loosing confidence in the government of Volodymyr Oleksandrovych Zelenskyy which would have a negative effect in the battlefield. If soldiers no longer trust thier leaders, they will not fight like patriots. I also pray Zelenskyy's hands are clean because if it is discovered that he is also involved in this criminal activity, it might be the beginning of the end of Ukraine resistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}