{
  "id": "topic_5407186",
  "title": "Accardo",
  "author": "Accardo",
  "created_time": "July 21, 2022, 08:01:08 PM",
  "content": "People take things naturally that they forget so fast about the importance of learning. Most people in the cryptocurrency market get rekt because of the inborn feeling of being too good in trading and investing that they end up sinking instead of rising in the market. Successful traders removed such beliefs and craved more knowledge, with this mindset that \"to earn big you must learn a big deal\". In this thread, I got some headings from a post found on medium, and the explanations are mine, it's not financial advice. Why is nobody a financial adviser in this market? a question that may interest me to see a proper answer!However, let us continue with the content of this thread, the goal is to share my insight on those sub-topics mentioned by the author in his medium post. Expect to see two different writers in one article, one for the author on medium, the other, my view and explanation of his points. The future of every newbie in the market can be affected positively if they carefully go through the points and explanations that follow;Invest in projects you understand: This particular point is everywhere in the forum but it is not stressed in a conducive manner for users and newbies to understand. Impact is the first impression that should be in the mind of any newbie or pro that wants to invest in any given project. Ask yourself what will be my benefit if I invest in this project? How good is this project? Start studying articles about the project. Form a clear and vivid picture in your mind as to why you are reading the materials about the project. Cross-check if the write-ups about the project answer the questions you asked yourself.Then consider taking the risk by asking one last question about the project in the forum and reading the reviews thoroughly before investing. Completely understanding a project gives you confidence about the project. FUD news will not affect your emotions about the project. One good advantage of understanding the project is that you can discuss with a prospect about the project with an exceptional explanation. With this knowledge, you can take the next step!Long Position (3 to 5 years): Excellent knowledge of bitcoin made Franky1 never to sell his bitcoin till date, I have read his testimony on that in different threads but cannot trace them now, would have shared a link. The long-term investment is so good a method that most traders often recommend it to newbies. The fear of holding will disappear if you understand the project. The first step is crucial to the second stepMost coins will go to zero: Have in mind that the market is volatile and anything can happen. Indeed some coins will go to zero, and the project backing the asset may live. I don't know any better word for it than Use case E.g the Terra project still exists though luna went to zero. It's Okay to take Profits. : Thinking long term has nothing to do with taking profits, the initial investment left on the project or asset still keeps you on track. If the coin or project yields some profits, it's okay to chill out with what you got as profit. Most Traders Lose Money : the most common advice all over the forum and other cryptocurrency communities is \"invest what you can be able to lose\", here I would say, trade what you can be able to lose. Don't trade what you cannot withstand the shock if things go west. Before trading pat yourself on the back and say If I lose this money I won't cry   but, I'll laugh if I gain profits. It's not possible to get rich quickly : This as we know is a general quote not only meant for the cryptocurrency market. Time is the only requirement coupled with knowledge. If you are wondering what to do next, please check step 2 again. If you are checking the coin market cap every day then you have a problem : A newbie that read step 1 will have no reason to have such a problem. Instead, keep reading and following new information on the project, and get too busy that you won't have to worry about checking the market cap every second. As you may get disappointed and fail to maintain the long-term promise if you get too worried. Crypto moves fast, very fast, continue to educate yourself : The big traders reinforce their skills to keep up with the fastest-growing digital asset \"cryptocurrency\". Don't relent, stay up, and read as many materials available as possible. It's a better way to stay relevant in the market and, also helps to make good decisions on projects, new networks, and ecosystems. The next step to take is self-explanatory but, deep. If you can’t emotionally handle market cycles (down or up), then crypto is not for you or you’re over-leveraging yourselfTake Free and paid blockchain courses: If you have an interest in blockchain development please take some paid blockchain courses while the free courses are not well detailed like the paid courses, it's still a good leg of assistance to people with a lesser interest in blockchain development but, wish to know what the blockchain is about how it works, how transactions are validated, cryptography, etc. Gen-Z “crypto investor” YouTubers and Tiktokers are a curse to society: This is true as most of them are a tool for promoting shit coins and enforcing tricks that help market makers to manipulate the market and do what suits them right. Though some YouTubers share great videos on market analysis, please stay clear of most projects they promote if you don't understand them. Bitcoin and USD are backed by the same thing — confidence: Before you start asking the same question that has been asked many times in the discussion forum, what backs bitcoin? luckily the answer is here confidence backs not only bitcoin, USD is pegged to it too. You must understand bitcoin to be able to back it up with your confidence. Ask Google before asking your “crypto friend”: If you are not satisfied with the answers on google please don't hesitate to ask your friends here in the forum on any topic, project, network, person, or website that confuse your thoughts about how cryptocurrency works. Go to in-person crypto meetups and events: Cryptocurrency is here to stay and this phrase should keep you moving about the new course you are learning in your life. Utilize the meetups and events that often come up, if you can't meet up, get the podcast of that particular event, listen to it while you drive, or do other tasks. In a nutshell, these explanations are as dynamic as culture and are not meant to be seen or taken as very correct. Read through the comments of other reputable members of the forum, they have more to chime in, which will help your learning process. Have a nice day and Don't forget step 1. Go through the medium post for more points or sub topics.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407186",
  "comments": [
    {
      "author": "Darker45",
      "created_time": "July 22, 2022, 03:00:32 AM",
      "body": "That's too long an explanation for not getting rekt. It's as if getting rekt is a complex thing that needs a complex solution. I guess it is not. One, getting rekt is something that happens to you if you sell at a loss. Two, getting rekt is something that could happen to you if you invest in shitcoins. How to avoid? One, stick to Bitcoin. Two, don't sell at a loss. I guess that's it. Is there a need for a complex formula to do that? I don't think so. So that must be enough for anybody to survive through the best of bulls and the worst of bears.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "July 22, 2022, 05:40:06 AM",
      "body": "If we talk about some projects, and here it does not mean bitcoin, then for a beginner to hope for a long-term investment, I think this is the road to the abyss.I would change the starting numbers. Learn. First, understand what a blockchain is. Will it be useful for a new project and then risk investing? But again, there should be a full assessment of all possible red flags.And if it is bitcoin, then of course you can make long-term investments with it and stop checking prices on the market for a while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 22, 2022, 07:27:19 AM",
      "body": "Quote from: PowerGlove on July 21, 2022, 11:29:45 PM Step 2. Wait at least 5 years before considering selling it. Don't get spooked by news and opinion pieces, just be patient.Unfortunately, most people want unrealistic gains on unrealistic timescales.If you are doing investing. In trading like day trade, they should or trying to make a profit in a short span of time which likely explain how noobs are getting rekt due to the fact that they trading even without analyzing as much as they can how to deal with such market volatility. Its not easy to win every trade since the market has a volatile feature which rekt both sides of the coins. Well eventually a loss can be overcome through series of experience and application of knowledge you learn from that. Dont evet sell at a loss if you trust and the project has potential. Im pertaining to such project such as bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 22, 2022, 11:22:21 PM",
      "body": "Quote from: Accardo on July 21, 2022, 08:01:08 PMMost coins will go to zero: Have in mind that the market is volatile and anything can happen. Indeed some coins will go to zero, and the project backing the asset may live. I don't know any better word for it than Use case E.g the Terra project still exists though luna went to zero. People ignore this point all the time. They believe that they have a special gift for determining which coins go to the moon and which coins go to zero. They think they are investing in one of the mythical \"good projects\". They think that if the coin is popular, its not a shitcoin and can't crash. They think that if some \"expert\" shilled for a coin, then it's not going to zero. If people started looking at coins based on their current utility and adoption, the situation would look drastically different. Don't invest in a promise, invest in a reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "July 23, 2022, 09:23:03 AM",
      "body": "Quote from: lovesmayfamilis on July 22, 2022, 05:40:06 AMI would change the starting numbers. Learn. First, understand what a blockchain is. Will it be useful for a new project and then risk investing? But again, there should be a full assessment of all possible red flags.Right you need to understand some basics of the market and dive into deep thought process why the project will grow and serve your profits but the thing is most of the time these projects have full detailed out lucrative plans offer for the community just to fool them and once they raise money they turn out to be scam which is risky investment to make for them.But having knowledge will help them a lot about how to avoid them.Quote from: lovesmayfamilis on July 22, 2022, 05:40:06 AMAnd if it is bitcoin, then of course you can make long-term investments with it and stop checking prices on the market for a while.For sure the newbies who want to start their crypto journey can do it with bitcoin by holding their position in the market for long term and getting panicked with each dip they see in the market due to FUD as the prices tend to rise in the long term.But the problem with them is they see it expensive and have the excuse they can buy lot of other altcoins with the same amount but that's where they make a mistake.For example if they have $1000 for investment let's assume they will see that they can have :0.04412BTC at $226620.641 ETH at $15603.7 BNB at $270They will ignore that stacking sats is also possible and goes on with other coins and they are some top altcoins on CMC but people invest in some shit projects in getting more profits and eventually loose their money just because of this mindset.The bitcoin adoption is growing, network is secured,you can use LN for fast transaction settlement and price appreciation in long term and if you still stick to some fake blockchain projects you tend to loose your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "July 23, 2022, 01:05:29 PM",
      "body": "Get rekted by smart contract and let your fund stolen is one rekt type. You can use that website to revoke risky addresses that can steal your money.https://app.unrekt.net/Get rekted by investing relates to your risk management. To avoid or reduce it, you should decentralize your capital to a few top altcoins. Don't use more than 5% or 10% of your capital for new projects. If you unfortunately get rekted by them, you will still be safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "July 25, 2022, 02:15:03 AM",
      "body": "Quote from: Accardo on July 21, 2022, 08:01:08 PMIt's not possible to get rich quickly This is what most newbies forget. They think that investing into cryptocurrencies is a get-rich-quick scheme that makes them take big risk in their finances just to buy crypto. They are too much focused on the potential profit that they forget to study more about the project they're investing. When the price of that crypto goes down because of bear market or the hype is gone and developers are not active anymore, it leaves them a bad impression about the whole crypto space and think these are scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 25, 2022, 03:53:29 AM",
      "body": "Quote from: Accardo on July 21, 2022, 08:01:08 PMAsk Google before asking your “crypto friend”: If you are not satisfied with the answers on google please don't hesitate to ask your friends here in the forum on any topic, project, network, person, or website that confuse your thoughts about how cryptocurrency works.That's a bad idea. I wouldn't recommend it right away.Don't ask Google about altcoin because there are a lot of fake shitcoin out there that could plunge you into a black hole.Ask about bitcoin in these forum and communities, they will give you the right understanding. When it comes to long-term investing, you have to believe that bitcoin is a very useful asset option compared to thousands of altcoin, so you shouldn't doubt the information from the people on this forum.You are free to invest anywhere if you really like asset diversification, but don't ignore bitcoin from your portfolio. 50% of bitcoin should be in your portfolio long term, and don't sell at a loss to avoid a rekt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alisha-k",
      "created_time": "July 25, 2022, 05:10:17 AM",
      "body": "Sometimes investors needs to get rekt so they understand the importance of doing their research and learning. Most people learn by experience and no matter how much of advice given to them they will only learn by experience. I have seen so many advice on the forum warning newbies to stick to Bitcoin investment but yet many still chose to embrace altcoins not minding the risk and funny enough they invest without any prior research and come back complaining. To me let them get rekt learn from it that way they will be eager to embrace learning",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}