{
  "id": "topic_5466400",
  "title": "Lavafreez",
  "author": "Lavafreez",
  "created_time": "September 11, 2023, 10:45:26 AM",
  "content": "Hello, I deposited 50k on my account did an all-in in the roulette, won and when i tried to withdraw they locked and shut down my account. They refused to let me withdraw and locked down my account. After contacting support, they said i had broken their \"TOS\" and had multiple accounts. This turned out to be completly wrong, after a few weeks of investigatio, they admited that they where wrong and that i only had 1 account but still refused to let me withdrawn 🤯They basicly robbed me 100k. This is Shameless behavior, worthy of a low-class casino. Stake Username : Lavafreez",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466400",
  "comments": [
    {
      "author": "bitbollo",
      "created_time": "September 11, 2023, 12:14:25 PM",
      "body": "did you have screenshots that support your claim? I mean, as always in this section, it seems that some missin pice of puzzle here. So you opened an account and just played 50k all in or maybe some others bet? What term of service you have violated? what motivation they provide?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "September 11, 2023, 12:40:35 PM",
      "body": "This is a big accusation, $100k is not a small amount of money, Please provide all evidence(screenshots of your deposit, bet, conversation with their support, etc.) backing up all your claims, It's not that I think you are lying it's just that providing evidence could help your case and garner support from other members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lavafreez",
      "created_time": "September 11, 2023, 12:56:23 PM",
      "body": "Hello, Since i'am very new new here, i only found this way to show you and proove what i have advanced. Here is my twitter account and you will see all the evidences. https://twitter.com/Dylaan86/status/1694536346864349683About the conversations with the support, and the \"reason\" for stealing my money is about their policie of \"opposite Betting\". They claim that another account bet the opposit that i had bet.  I told them multiple times that this was a coincidence. They do not even reply to me, the support has been ignoring myy emails for more than 1Month Also i have played only 2 games Dice and Roulette If you have any doubts or need any more evidence please let me know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "September 11, 2023, 01:54:56 PM",
      "body": "I hope someone from stake comes here to give an explanation on the subject, although I understand that they are more careful with large amounts like this than if it were $50. In any case it seems fishy that they first accused you of multi-accounting, then said no, and now they come out with the opposite betting. I don't see what's wrong with it, I guess it's against the rules, but if I bet $50K and meet a friend or something who bets $50K, in the end what we're going to lose is the commission, no matter how much one of us wins. If I were the master of the casino I would want them to repeat the bet many times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "September 11, 2023, 02:03:19 PM",
      "body": "Before anyone believe on this story. Who will bet all in on a roulette game at first bet? Of there are some users then they are rare. Some user are doing multiple account and avail promotion such as cashback while betting both side using 2 accounts. This way, the user can claim the cashback while 100% still holds his original bankroll that go to the winning bet account. His only danger on this method is when the ball goes to zero which is very low chance to occur. A french roulette game gives 50% refund when ball goes to zero. I believe this is what he use. This kind of bonus abuse is very popular which the live casino provider usually detect multiple account that oppose bet even on 2 different casino involved that play same live game.Quote from: Lavafreez on September 11, 2023, 12:56:23 PMAbout the conversations with the support, and the \"reason\" for stealing my money is about their policie of \"opposite Betting\". They claim that another account bet the opposit that i had bet.  I told them multiple times that this was a coincidence. They do not even reply to me, the support has been ignoring myy emails for more than 1Month Do you have active promotion when you place your bet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lavafreez",
      "created_time": "September 11, 2023, 02:08:01 PM",
      "body": "YES EXACTLY i have tried to explain them many times that this had no sens. Why would i wan't to bet against my self i am only going to loose money doing so !!!! They perfectly know that. I truely think they are trying to steal my money and i have no clue on what i can do. I strongly advice you to stay away from this casino if you plan on betting big, i have seen multiple people over twitter complaining about similar issues with similars amount of money. Stay Safe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lavafreez",
      "created_time": "September 11, 2023, 02:30:17 PM",
      "body": "@BeparanfHello, I understand your point of view and i respect your position. However this is not my case. Saying \"What kind of user does an all-in on his first bet\" First it's not true i had been playing dice before. Second, \"A french roulette game gives 50% refund when ball goes to zero. I believe this is what he use.\" False i didn't used the french roulette i used the VIP Roulette will prove it showing you the bet \"Do you have active promotion when you place your bet?\" No i didn't had any promotions active. The only promotions on stake are Weekly and Monthly. The weekly is a promotion done every Saturday, your bonus is calculated depending on your week gameplay. So if Stakes belive that my bonus could be illegitimate they can and have time to decrease it significantly. It's exactly the same for the Monthly, Their is also the reckback that is indeed an instant bonus however the bonus is so low that it has no sens to even talk about it. Exemple: for 50k bet on the roulette i only earned 30$ of reckback... I hope i have answered all your questions let me know if any doubt or wan't additional evidence",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 11, 2023, 04:10:39 PM",
      "body": "Quote from: Lavafreez on September 11, 2023, 10:45:26 AMAfter contacting support, they said i had broken their \"TOS\" and had multiple accounts. This turned out to be completly wrong, after a few weeks of investigatio, they admited that they where wrong and that i only had 1 account but still refused to let me withdrawn 🤯I didn't see this on the images you uploaded to your XTwitter account all I see are balances, this is a piece of strong evidence if you have a screenshot of that.Can you please compile all your pieces of evidence and post them here using Bitcointalk's official image uploader https://www.talkimg.com.Don't worry if it does not show up when you post it here, one of us will quote it for everyone to see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lavafreez",
      "created_time": "September 11, 2023, 04:41:52 PM",
      "body": "Hello, Robelo Every single one of the emails that i have received from Stake their is this message https://www.talkimg.com/images/2023/09/11/6apvc.pngI don't think i'am allowed to share any information that has been sent to me. I don't wan't to give them any excuse to retain my funds. The only thing i can share to you about talking to the support is this : https://www.talkimg.com/images/2023/09/11/6aeNj.pngHere you see that they allowed me to connect into my account, so i could do the KYC. Right after i had done it, they removed the funds from my wallet. Recap of all the proofs : -https://www.talkimg.com/images/2023/09/11/6aeNj.png-https://www.talkimg.com/images/2023/09/11/6aq4G.jpeg-https://www.talkimg.com/images/2023/09/11/6a0xD.jpeg-https://www.talkimg.com/images/2023/09/11/6axPf.jpeg",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 11, 2023, 09:15:31 PM",
      "body": "Quote from: Lavafreez on September 11, 2023, 04:41:52 PMEvery single one of the emails that i have received from Stake their is this message I don't think i'am allowed to share any information that has been sent to me. I don't wan't to give them any excuse to retain my funds. The only thing i can share to you about talking to the support is this : Here you see that they allowed me to connect into my account, so i could do the KYC. Right after i had done it, they removed the funds from my wallet. Recap of all the proofs : ----Thank you for uploading, and I'm quoting this for everyone to see. There are communications that are not allowed to be seen for now maybe later on when circumstances force you to show it.  I'm sure they are now aware of the existence of this thread you may send them a notification that you created a thread for your issue here in Bitcointalk.Hopefully this will be addressed by the team the sum is not small to be ignored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 11, 2023, 11:45:08 PM",
      "body": "Hello and welcome to the forum Lavafreez. I think that this case of yours should be taken with care not just by them but also you. Since it involves a huge money on your end and you probably can't wait any further with it moving on, so you have to take action and take the community's attention through this thread. First, they have a announcement thread and basically you can ask them through that thread as well for handling this case of yours.Quote from: Lavafreez on September 11, 2023, 04:41:52 PMI don't think i'am allowed to share any information that has been sent to me. I don't wan't to give them any excuse to retain my funds. Much better to keep those details confidential as it's written on the disclaimer of the email. But I guess that's it, you have already shared it and everyone has already seen it. I have no idea if this is going to affect the withdrawal since you already were having problems taking it but hope so, this is going to get their attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Symphonized",
      "created_time": "September 12, 2023, 01:31:42 AM",
      "body": "Quote from: tabas on September 11, 2023, 11:45:08 PM(...)First, they have a announcement thread and basically you can ask them through that thread as well for handling this case of yours.(...)No you should not ask there, as that topic isn't for scam accusations, you can leave at this section and someone will address it if they have to.I'm always forwarding Scam accusations from this section to Staff so they can be handled.PS: I'm the one in charge of forwarding them, in case Staff misses these topics, therefore every Stake.com Scam accusation will be viewed / analysed very soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lavafreez",
      "created_time": "September 12, 2023, 05:14:28 AM",
      "body": "Hello, First of all thank you ! This community is amazing, you have all been very reactive and took my case seriously and for that i'am very greatful. I hope my case get solved and that i manage to recover my money. They claim i have broken multiple times their \"tos\" and that they have \"evidences\" that suggest it. Since i played from a restricted juridisction, i have no legal recourses and they abuse it.I have been sending them proofs and they only seem to accept what suits them best while ignoring the rest of it. Now, every time I send them consistent evidence that strongly contradicts their conclusions, they ignore it and don't even reply...Again Thank you all",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "September 12, 2023, 11:36:27 AM",
      "body": "Quote from: Lavafreez on September 12, 2023, 05:14:28 AMI have been sending them proofs and they only seem to accept what suits them best while ignoring the rest of it. Now, every time I send them consistent evidence that strongly contradicts their conclusions, they ignore it and don't even reply...Again Thank you all You did the right thing by creating an accusation here. They have an active campaign here and an active representative here and on many occasions they have shown their dedication to resolving the case, their representative here assured you and the community that they will address this accusation soon. Quote from: Symphonized on September 12, 2023, 01:31:42 AMPS: I'm the one in charge of forwarding them, in case Staff misses these topics, therefore every Stake.com Scam accusation will be viewed / analysed very soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "September 12, 2023, 12:10:38 PM",
      "body": "Quote from: Symphonized on September 12, 2023, 01:31:42 AMQuote from: tabas on September 11, 2023, 11:45:08 PM(...)First, they have a announcement thread and basically you can ask them through that thread as well for handling this case of yours.(...)No you should not ask there, as that topic isn't for scam accusations, you can leave at this section and someone will address it if they have to.I'm always forwarding Scam accusations from this section to Staff so they can be handled.PS: I'm the one in charge of forwarding them, in case Staff misses these topics, therefore every Stake.com Scam accusation will be viewed / analysed very soon.Hello Symphonized. Thanks for that clarification, I'll take note of this whenever I see someone that has an accusation or complain about their accounts, I won't redirect them to your thread unless it's not really a concern of an accusation and it's more about your service. It's actually great that you've said this and replied on what I have said to clarify things that you guys are also active checking out these threads here.Quote from: Lavafreez on September 12, 2023, 05:14:28 AMHello, First of all thank you ! This community is amazing, you have all been very reactive and took my case seriously and for that i'am very greatful. I hope my case get solved and that i manage to recover my money. They claim i have broken multiple times their \"tos\" and that they have \"evidences\" that suggest it. Since i played from a restricted juridisction, i have no legal recourses and they abuse it.I have been sending them proofs and they only seem to accept what suits them best while ignoring the rest of it. Now, every time I send them consistent evidence that strongly contradicts their conclusions, they ignore it and don't even reply...Again Thank you all A rep have noticed your thread and has already forwarded this to the team, you're able to get their attention and for now you have to wait for their response. Hopefully, they'll get back to you and able to address and solve your problem with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 12, 2023, 11:14:24 PM",
      "body": "Quote from: Lavafreez on September 12, 2023, 05:14:28 AMHello, First of all thank you ! This community is amazing, you have all been very reactive and took my case seriously and for that i'am very greatful. The community deals with fairness, transparency, and the value of reputation, community upholds itQuoteI hope my case get solved and that i manage to recover my money. They claim i have broken multiple times their \"tos\" and that they have \"evidences\" that suggest it. Since i played from a restricted juridisction, i have no legal recourses and they abuse it.I would like to remind you that casinos always uphold their TOS and rules if they see that there's a violation they will uphold it no matter what, it applies to all their players small and VIP bettors QuoteI have been sending them proofs and they only seem to accept what suits them best while ignoring the rest of it. Now, every time I send them consistent evidence that strongly contradicts their conclusions, they ignore it and don't even reply...If in case one of the parties is not satisfied with the result most probably the user, he/they can ask a third-party mediator like Askgambler, Askgambler if agree to mediate will ask for all the pieces of evidence and their decision is final as agreed by both parties.Hopefully, this case will be resolved here I know Stake has a good history when it comes to resolving cases so we'll see",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 12, 2023, 11:33:26 PM",
      "body": "A very strange situation.Can any of the players who use Stake.com casino confirm which types of transactions are marked as \"refunded\" and which as \"bonus received\"? Why would the winning bet be called a bonus?Are Stake representatives from this forum invited to this discussion?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lavafreez",
      "created_time": "September 13, 2023, 04:46:45 AM",
      "body": "Hello, robelneoI understand, however, i have the feeling that in my case, they use this as an excuse to withdhold my funds no matter what. Their is also a part of is the casino legit or not.I understand that they have \"tos\" and that they have to make people respect it but,  i belive they should try to be more fair about their decisions. In my case for exemple i believe the sanction is completly disproportionate.  First of all thank you, i will check on \"Askgambler\" if my case doesn't get solved here. I also hope my case get solved, since we are talking about a lot of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingbj21",
      "created_time": "September 13, 2023, 08:35:01 AM",
      "body": "Quote from: Lavafreez on September 13, 2023, 04:46:45 AMHello, robelneoI understand, however, i have the feeling that in my case, they use this as an excuse to withdhold my funds no matter what. Their is also a part of is the casino legit or not.I understand that they have \"tos\" and that they have to make people respect it but,  i belive they should try to be more fair about their decisions. In my case for exemple i believe the sanction is completly disproportionate.  First of all thank you, i will check on \"Askgambler\" if my case doesn't get solved here. I also hope my case get solved, since we are talking about a lot of money. Sorry to hear about your loss.I would say don't waste your time here. Head over to Askgambler or Casinoguru and lodge a complaint asap.Good luck, update us on how it went.Cheers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}