{
  "id": "topic_5405502",
  "title": "crypto discussion",
  "author": "crypto discussion",
  "created_time": "July 07, 2022, 11:41:17 AM",
  "content": "With two successive taxes ready to eat away at their holdings in the midst of a ruthless bear market, it appears that the majority of Indian investors have made the decision to hibernate.An example of what anti-crypto policies might do to a growing economy is India. In response to the implementation of India's second crypto law, which imposes a 1 percent tax deduction at source (TDS) on every cryptocurrency transaction, WazirX research shows a change in investor sentiment, which is consistent with the sharp decline in trading volumes across all Indian crypto exchanges.Trading volumes on Indian cryptocurrency exchanges have eventually decreased by 90% since the country introduced a rule that would tax investors 30% on unrealized gains. With two successive taxes ready to eat away at their holdings in the midst of a ruthless bear market, it appears that the majority of Indian investors have made the decision to hibernate.Popular Indian cryptocurrency exchanges WazirX and Zebpay surveyed nearly 9,000 active traders in the region to better understand investor sentiment. Unsurprisingly, the survey revealed that 83% of traders had to reduce their trading frequency as a result of TDS deductions.Another way for investors in India to avoid paying TDS was to sell their interests before the tax became a legal requirement. Before April 1st, more than 25% of investors, the majority of whom were millennials, sold 50% or less of their holdings, as opposed to the 55% who sold less than 10%. Rajagopal Menon, vice president of WazirX, made the following comment regarding the survey's findings: \"The results indicated the need to change a few things in order to encourage the rise of cryptocurrency investors in the country, which will lead to economic prosperity.\" The tax structure must be fair if trading volumes are to increase and participation is to be encouraged.Indian investors are turning to international exchanges as a safety net due to the risks of trading on exchanges without KYC requirements and with little to no regulation.While India's crypto tax policy is a positive step, some aspects need to be reexamined to improve the regulatory environment for all industry participants and, ultimately, strengthen the country's economy.Bollywood star Salman Khan launched the GARI token, whose value gone down 83 percent in a matter of hours on Monday. Despite the fact that GARI Network dismissed the price decline as a \"market event,\" investors suspected a rug pull incident.Around 2,300 investors, or 24 percent of the total, said they were considering using foreign cryptocurrency exchanges to test out their services in order to avoid paying TDS during trade cycles, and 29% admitted that they had significantly reduced their trading activity.source:- coingabbar . com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405502",
  "comments": []
}