{
  "id": "topic_5407090",
  "title": "famososMuertos",
  "author": "famososMuertos",
  "created_time": "July 21, 2022, 04:29:35 AMLast edit: July 21, 2022, 05:06:24 AM by famososMuertos",
  "content": "Tesla: la empresa de Elon Musk vende la mayoría de sus bitcoinQuoteTesla, que causó un torbellino el año pasado cuando reveló una gran inversión en bitcoin, ha vendido casi todas sus posesiones de la criptomoneda.El fabricante de automóviles eléctricos dijo que se ha deshecho del 75% de sus bitcoin, que tenían un valor de unos US$2.000 millones a finales de 2021.Se retira así de la criptomoneda en un momento en que su valor se ha desplomado, con una caída de más del 50% este año.Tesla dijo que compró divisas tradicionales con los US$936 millones que obtuvo de la venta de bitcoin.Fuente:https://www.bbc.com/mundo/noticias-62232505Tanto que decirle a El-Off... y en momentos que empezamos a ver luces positivas, veremos como se comporta en las próximas horas, dìas.edit,titular ; )",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407090",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "July 21, 2022, 04:48:10 AM",
      "body": "Quote from: famososMuertos on July 21, 2022, 04:29:35 AMTanto que decirle a El-Off... y en momentos que empezamos a ver luces positivas, veremos como se comporta en las próximas horas, dìas.De momento ha habido una pequeña bajada en el precio pero del 2% aproximadamente y es imposible dilucidar si tiene algo que ver con esto. En todo caso, y suponiendo que tuviera algo que ver, el impacto a corto plazo habría sido mínimo. Yo lo que me pregunto es si no habrá habido más empresas no tan famosas que hayan vendido recientemente. Se supone que hubo unas cuantas comprando bitcoin para sus reservas y visto esto, no sería sorprendente averiguar que algunas de ellas también han vendido bitcoins para obtener liquidez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 21, 2022, 05:00:59 AM",
      "body": "Quote from: Don Pedro Dinero on July 21, 2022, 04:48:10 AMQuote from: famososMuertos on July 21, 2022, 04:29:35 AMTanto que decirle a El-Off... y en momentos que empezamos a ver luces positivas, veremos como se comporta en las próximas horas, dìas....//...,,,Yo lo que me pregunto es si no habrá habido más empresas no tan famosas que hayan vendido recientemente. Se supone que hubo unas cuantas comprando bitcoin para sus reservas y visto esto, no sería sorprendente averiguar que algunas de ellas también han vendido bitcoins para obtener liquidez.Sin duda, pero es mediático en el efecto de la noticia y en lo viral de los próximos días, como ninguna otra empresa, creo que por ahora mantiene titulares y en cada \"desacierto\" en relaciòn al bitcoin con lo dicho o promesas rotas, es lo mejor para el entorno cripto en general, pues cada vez pierde credibilidad en mantener pensamientos, ideas que lanza para bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 21, 2022, 05:24:15 PM",
      "body": "Según parece, las ventas se efectuaron durante el segundo trimestre de este año, y me imagino que se habrá dado a conocer la noticia al presentar el cierre de dicho trimestre. Lo bueno es que ya es un hecho que ha sucedido (con el 75% de sus BTCs), y no un anuncio de que va a suceder aún pendiente de ejecutarse. Es decir, ha pasado y no nos hemos enterado, por lo que el efecto, de haberlo, es más que nada una suerte de fundamental reputacional, que por ahora se ha dado a conocer sin aparentes consecuencias. Creo que ya la gente del mundo bitcoin está bastante cansada con Musk y todo su ecosistema. Otro cantar sería Saylor haciendo lo mismo …Ver: https://www.reuters.com/markets/us/bitcoin-falls-after-tesla-says-it-converted-75-bitcoin-purchases-into-fiat-2022-07-20/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 21, 2022, 07:13:13 PM",
      "body": "No me cuadra la noticia, por que vendería nada más el 75% y no todo? y por qué ahora que el bitcoin anda tan bajo. Lo único que se me viene a la mente es que necesita capital para alguno de sus grandes proyectos. Pero aún así los Bitcoins era de la empresa Tesla. Así que lo mas probable es que veamos este capital inyectado en dicha empresa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 21, 2022, 07:54:10 PM",
      "body": "Quote from: seoincorporation on July 21, 2022, 07:13:13 PM<...>Según cita en el artículo de Reuters, en efecto se trata de una necesidad de cash, diría que auspiciado por los malos no tan buenos resultados recientes y la falta de liquidez, añadiendo de esta manera 936M $ líquidos tras la venta de ese 75% de su cartera de BTCs.Supongo que de los elementos liquidables de una manera rápida, bitcoin le resultaría de lo menos complicado por vender a muy corto plazo (pasó del Dodge, aunque no sé qué montante tiene Tesla).Ver: https://www.theverge.com/2022/7/20/23271834/tesla-q2-2022-earnings-elon-musk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 21, 2022, 11:43:46 PM",
      "body": "Bueno, mejor así: una ballena menos. Espero que la mayoría de esos Bitcoins estén bajo el poder de los minoristas y de autenticos Bitcoiners o de Traders que estén aprovechando este rango de precios.  También he leído por allí que este movimiento pudo darse para no comprometer las relaciones de Tesla con el Partido Comunista Chino (recordemos que no están muy a favor de Bitcoin como herramienta de decentralización) y no me cabe duda de que China es un mercado enorme para la locomoción en general, incluida la eléctrica. Pero bueno, ya sabíamos desde el comienzo que esto no se trataba de un movimiento en pro de la ideología de Bitcoin y su ideal, solo negocios.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 22, 2022, 05:21:35 AM",
      "body": "Luego encontramos algún titular que da una orientación poniendo el foco en bitcoin y no en la propia Tesla: Ni Tesla se fía ya de bitcoin: la empresa vende el 75% de sus criptos para minimizar pérdidas.Vamos, que apela a indicar que la compañía ha optado por soltar lastre y al no fiarse de bitcoin, para luego, dentro del propio artículo, reflejar las razones aducidas por Musk relativas a los flujos de caja y que esto no es un veredicto sobre bitcoin. Es decir, la primera parte del artículo es especulación, y la segunda basada en declaraciones, sin distinguir qué es qué claramente en el mismo …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "July 23, 2022, 07:00:47 PM",
      "body": "De lo malo parece que el precio sigue sin resentirse demasiado desde el anuncio. Crucemos dedos, aunque a 15.000$ el coste de minar 1 BTC, probablemente estemos cerca de tocar fondo. Me imagino que los típicos indicadores anunciarán \"oversold\".El artículo que comentas, pues en la línea del periodismo moderno al que nos tienen acostumbrado: el titular es de traca, y el contenido no está estructurado como debería si se quisiera hacer honor a la verdad. Lo que comentamos siempre de apelar a las emociones en lugar de dar información objetiva. Luego te meten un vídeo en medio del artículo que te explica cómo comprar Bitcoin... powerful knight Mr. Money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 24, 2022, 04:10:08 PM",
      "body": "En todo caso, según el artículo (de opinión) abajo referenciado, Tesla no ha perdido dinero con la venta del 75% de sus BTCs. Replica la frase del video de Tesla donde describe los datos económicos, y donde cita que:Quote\"Additionally, we converted a majority of our bitcoin holdings to fiat for a realized gain offset by impairment charges on the remainder of our holdings, netting a $106 million cost to the [income statement].\"Es decir, la venta ha sido a ganancia (en contraposición a pérdidas). Se ve que encontraron una ventana decente para efectuar la venta de manera silenciosa.Tal y como cita el artículo, y estoy de acuerdo en la apreciación, el negocio de Tesla no es el de bitcoin, y por tanto, es habitual que la tesorería corporativa compre o liquide activos a medida que lo precise, añadiría que de la misma manera que podría hacerlo con cualquier otro tipo de activo en el cual invirtiese su exceso de capital.Nota: Hay un segundo aspecto citado en el artículo sobre la valoración de activos como bitcoin que es interesante, aunque no estructural del tema tratado: bitcoin es tratado como un activo intangible de vida indefinida. Esto hace que las reglas contables de la FASB requieran anotar en el balance si pierde valor, pero no se anotan las ganancias de valor contablemente (... será que ya lo hacemos los demás ...).Ver: https://www.coindesk.com/business/2022/07/24/accounting-rules-make-the-outcome-of-teslas-bitcoin-sale-unclear/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "July 25, 2022, 03:43:05 PM",
      "body": "Desde que Musk salio con el FUD del ambiente y ordenó rechazar los pagos en Bitcoin, ya se sabía que en cualquier momento iba a vender. Es mejor que venda y se acaba la especulación del \"cuando venderá Elon Musk\". Pues si ya vendió, mejor. Bitcoin seguirá adelante, quien no lo valore se lo pierde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dominguero",
      "created_time": "July 29, 2022, 12:51:36 PM",
      "body": "El sabe perfectamente la influencia que genera en los mercados criptos, y juega con eso.Si ahora dice que ha vendido, es que lo hico hace meses (cuando tocaba), y que ahora lo que realmente está haciendo es comprar.Y cuando anuncie que ha comprado, y de bombo al BTC, es que estará volviendo a vender.Puede sonar muy burdo, pero es así.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "July 29, 2022, 06:41:54 PM",
      "body": "Litio, esta en la lista de \"tendencias\" inversiones desde hace bastante tiempo, pero llego El-On:QuoteMusk, que es dueño de la empresa de coches Tesla, considera que esta puede ser una buena oportunidad para crear una gran fortuna. \"Es una licencia para imprimir dinero. Me gustaría alentar, una vez más, a los empresarios a ingresar en este negocio. No se puede perder\", señalan desde Business Insider.Fuente:https://www.lainformacion.com/management/nuevo-negocio-elon-musk-invertir-dinero/2871538/Otra noticia del El-On hagamos por aquì campo, con esta tardía noticia de hace unos dìas, aunque esta fuente la reflota con fecha 28, en todo caso parece que enfila sus comentarios con el Litio, que se mantenga ocupado le hace muy bien al bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}