{
  "id": "topic_5418556",
  "title": "bybit_2022",
  "author": "bybit_2022",
  "created_time": "October 27, 2022, 09:41:59 PM",
  "content": "Olá, boa noite Estou iniciando na compra/venda do bitcoin, e estou com algumas dúvidas para ordens de venda. Estou operando na FTX, E acabei saindo do mercado, devido a não ter encontrado a solução para esta minha dúvida.  Exemplo: Comprei o BTC hoje a R$ 108500,00 e logo em seguida criei uma ordem limite de Venda no valor de R$ 11200,00. Minha dúvida é o seguinte, como faço para inserir outra ordem de Venda para proteger o meu valor investido? Pois percebi, que quando utilizamos o saldo total disponível em carteira (saldo em btc), ele não dá a opção de criar outra ordem, pois informar que não há saldo disponível, e pergunta se eu quero utilizar a margem do saldo de empréstimo disponível, só que não opero em alavancagem. Quero apenas inserir uma Nova \"ordem stop limite\" no valor de R$ 108500,00 gatilho e junto com ordem limite de R$ 108450, pra caso o BTC cair abaixo do valor da ordem, ele execute a ordem e venda, para proteger meu investimento.Sair do mercado, porque depois da última compra/venda do BTC, sempre ficava pensando, e se ele cair abaixo do que eu comprei, vou perder parcialmente o valor e terei que esperar ele subir novamente para poder assim vender o btc. Existe alguma operação que possa fazer conforme mencionei no exemple acima? Espero que tenha entendido a minha dúvida... Grato pela atenção e ajuda dos que irão compartilhar seus conhecimentos. Forte abraço. Diego",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418556",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "October 27, 2022, 11:19:55 PM",
      "body": "Seria um ordem do tipo stop limit. Você define um trigger price (i.e 107k) e um limit price (i.e 106k). Assim que bater o preço do trigger price, ele cria uma ordem com o limit price. BTC cai para 107k -> uma ordem de venda em 106k é criada.Até onde eu sei, não tem como criar uma ordem bidirecional que compartilha o mesmo valor. Na Binance essa seria uma ordem do tipo \"OCO\": https://academy.binance.com/en/articles/what-is-an-oco-orderTalvez seja possível abrir o segundo lado da trade com qualquer margem extra que você tenha na exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bybit_2022",
      "created_time": "October 28, 2022, 12:27:58 AMLast edit: October 28, 2022, 01:04:08 AM by bybit_2022",
      "body": "Obrigado pelo retorno meu caro TryNinja, Apos inserido esta ordem de venda \"stop limit\" de 107k gatilho e 106k venda limite, posso também inserir uma ordem de venda para quando o BTC subir? Ex: Criar uma prdem venda \"stop limite\" no valor de 112k? Fiz esta ordem de teste, será que fiz certo agora? https://i.imgur.com/fGo2EFb.jpegGratidão...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "October 28, 2022, 01:32:09 AMLast edit: May 14, 2023, 02:16:10 AM by TryNinja",
      "body": "Quote from: bybit_2022 on October 28, 2022, 12:27:58 AMFiz esta ordem de teste, será que fiz certo agora? Fez isso utilizando a margem da sua conta? Ou conseguiu usar os mesmos X reais em BTC para criar 2 ordens de X reais?Pela sua screenshot parece estar certo, mas tem que ver que uma provavelmente não cancela a outra (igual no OCO).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bybit_2022",
      "created_time": "October 28, 2022, 11:24:09 AM",
      "body": "Conseguir realizar com o saldo total de BTC que deixei disponivel para fazer este teste(2,00 dolares).Realizei a primeira ordem de venda \"Take Profit Limit\" e depois ativei outra ordem \"Stop limit\". E ativou de boa...Quando fui ver hoje pela manhã, ele acabou vendendo a ordem de baixo, devido a queda que teve o btc. A ordem de venda acima contiuou ativa....Acho que agora acertei.....  Obrigado meu caro, faz tempo que tenho esta duvida....Agora vou poder realizar as compras e fazer minhas proteções.Gratidão pelo apoio....Abraços....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 31, 2022, 11:22:35 AM",
      "body": "Quote from: bybit_2022 on October 27, 2022, 09:41:59 PMSair do mercado, porque depois da última compra/venda do BTC, sempre ficava pensando, e se ele cair abaixo do que eu comprei, vou perder parcialmente o valor e terei que esperar ele subir novamente para poder assim vender o btc. Olá Diego, bem vindo.Que bom que já te ajudaram.Vou te dar uma sugestão diferente. Você está pensando em operar no ruído de curto prazo com essas travas.Historicamente , a absoluta maioria das pessoas que ganharam bastante dinheiro com bitcoin foi pensando no longo prazo, no hold.Assim, eu sugiro pra você uma estratégia diferente. Selecione uma pequena quantidade que você se sinta confortável de deixar parado por uns anos. Tira essa quantidade da ftx e coloque numa carteira como a electrum.org Vc vai aprender bastante sobre o bitcoin no processo de baixar a Wallet  e fazer a transação. Só isso já vale.Abs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bybit_2022",
      "created_time": "November 02, 2022, 03:51:38 PM",
      "body": "Oi @bitmover, gratidão pela sua sugestão.A priori, não pensei investir a longo prazo, estou fazendo Trader diários, e colhendo pequenos lucros. Mas gostei da sua sugestão, não tinha pensado a longo prazo. Quando você fala a longo prazo, você estipula no mínimo quantos anos com o BTC parado na carteira externa?Essa carteira que você sugere \"electrum,\" é uma carteira externa online ou carteira física? Como procede o processo de transferência e se paga taxas? Não entendi quando você menciona que irei apreender no processo da baixa a wallet, poderia explicar melhor, ainda sou leigo com carteiras externas.  Obrigado meu amigo. Abraços",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 02, 2022, 09:12:53 PM",
      "body": "Quote from: bybit_2022 on November 02, 2022, 03:51:38 PMQuando você fala a longo prazo, você estipula no mínimo quantos anos com o BTC parado na carteira externa?O próximo halving  é em 2024, quando a mineração irá gerar metade dos bitcoin que gera hoje por dia.Eu diria que no mínimo até lá vale segurar....Mas longo prazo pra mim são mais de 5 anos QuoteEssa carteira que você sugere \"electrum,\" é uma carteira externa online ou carteira física? Como procede o processo de transferência e se paga taxas? Não entendi quando você menciona que irei apreender no processo da baixa a wallet, poderia explicar melhor, ainda sou leigo com carteiras externas.  Obrigado meu amigo. Abraços E um software, nao é uma carteira online. Baixa a carteira electrum.org,  clica em receber e vc irá gerar um endereço.Manda da ftx pra lá, apertando no botão withdrawal  ou saque, e cole seu endereço. Sobre a carteira física, vale a pena pesquisa ledger ou trezor.Só nessa resposta  já te dei uns 5 termos pra você pesquisar. Rsrs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}