{
  "id": "topic_5417428",
  "title": "Mbidox",
  "author": "Mbidox",
  "created_time": "October 17, 2022, 01:55:07 PMLast edit: October 17, 2022, 07:49:33 PM by Mbidox",
  "content": "Hello,Is it technically possible to stake USDC (from Ethereum) or can we only stake ETH?Or in general: Can we also stake coin tokens on \"Proof of Stake\" blockchains or only the basic coin from the chain?(Pleas note: I am talking about staking, not lending.)Would appreciate some answer. Thank you.Edit: correction: stalk -> stake",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417428",
  "comments": [
    {
      "author": "Marvelman",
      "created_time": "October 17, 2022, 02:58:10 PMLast edit: October 17, 2022, 06:27:33 PM by Marvelman",
      "body": "Quote from: Mbidox on October 17, 2022, 01:55:07 PMIs it technically possible to stalk USDC (from Ethereum) or can we only stalk ETH?You can \"stalk\" any token you wish. Don't be shocked if the token does not like it, though.  -edit-I see you edited your post, but you still made a mistake. It should be \"stake\" not \"stak\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "October 17, 2022, 09:57:38 PM",
      "body": "Its not possible to stake any other coins/tokens in a POS model because most of the time they prefer the native token/coin to be locked up. You'll probably have to look for defi or cefi that offers staking services if you want to stake your USDC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mbidox",
      "created_time": "October 20, 2022, 05:02:27 PM",
      "body": "Thank you.Quote from: malcovi2 on October 17, 2022, 09:57:38 PMIts not possible to stake any other coins/tokens in a POS model because most of the time they prefer the native token/coin to be locked up. Does this mean, that there are the designers of the blockchain, that decide if only the native coin is available for staking and no tokens. So can you say any blockchain, that allows also to stake any token?(Please note: I am not talking about \"Yield Farming\" \"lending\" or \"Liquidity Mining\". I am talking about staking as validator or in a pool.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "October 21, 2022, 04:25:40 AM",
      "body": "Quote from: Mbidox on October 20, 2022, 05:02:27 PMI am talking about staking as validator or in a poolYou cannot stake any tokens. To be a validator in the proof of stake chain, you must use the \"base\" coin that the cryptocurrency has.Staking Ethereum requires its own coin, ETH. So does with BSC. USDC, USDT, DAI, etc are categorized as a token on some particular network(ETH/BSC). So, the token can't be included to participate in the network node/consensus requirements. You can learn more about the basic information at https://ethereum.org/en/eth/.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mbidox",
      "created_time": "October 21, 2022, 11:58:57 AM",
      "body": "Thank you. This is what I suspected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 21, 2022, 09:21:38 PM",
      "body": "In centralized platforms like Abra, you can stake stable coins and that includes USDC. But, they've just made it look like you really are staking but the mere fact is that it's like a savings account that earns you interest. And for Abra, staking USDC will earn you 7% APY and the same goes for other stablecoins except for Tether. For Tether, they're giving 10% APY. You can check the whole details of it on their website and think of it if you're convinced about their \"staking\" earn feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 22, 2022, 04:00:04 PM",
      "body": "No, you cannot, and to simplify it for you, the profits that you get from staking come from two ways:POS crypto: in POS blockchain based you (or any group) must have a min limit to confirm transaction (create block) when you confirm a transaction, the transaction fees within that block return to you, and so on.Centralized or decentralized platforms that provide liquidity through pools or provide lending services, but they are all centralized at one point or other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "October 30, 2022, 08:38:32 PM",
      "body": "Quote from: Mbidox on October 20, 2022, 05:02:27 PMThank you.Quote from: malcovi2 on October 17, 2022, 09:57:38 PMIts not possible to stake any other coins/tokens in a POS model because most of the time they prefer the native token/coin to be locked up. Does this mean, that there are the designers of the blockchain, that decide if only the native coin is available for staking and no tokens. So can you say any blockchain, that allows also to stake any token?To simplify your answer. Let's go back in time, when Ethereum was still POW. Ethereum was the blockchain network and ETH was the native coin of the network. In the same network there were thousands of ERC20 tokens built on it but all those coins and network depended on the native coin Ether for deployment of smart contracts, transaction fees etc.The only coin that could be mined was ETH and the mining rewards we also in ETH not USDT, USDC, BAT or any other token. The same applies to the current POS Algorithm. On the Ethereum network, you only stake ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mbidox",
      "created_time": "November 04, 2022, 09:03:33 PM",
      "body": "Thank you JeromeTash .So my assumption was right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "November 04, 2022, 10:35:43 PM",
      "body": "The short answer is no and as previous other memebers explained to you that's not possible to stake USDC and get any profits, but you need to be so careful from many scams where they give you very attempting offers to stake your coins and fool you into a scam process. I have been moderating a community of a new memecoin where we don't offer any staking. But many scammers do it in order to steal people's money and they successfully did because people are greedy and not well informed too or they don't like to search before doing things",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DudeAtWork420",
      "created_time": "November 05, 2022, 05:10:47 AM",
      "body": "You can not stake in that POS chain but there are many centralized exchange that offers good APY for staking USDT, USDC, DAI like stable coin. Exchange will pay the rewards so it will not come from the network validation. Though centralized exchange offers a small amount of rewards but it's more profitable than sitting your stablecoin like a duck in your wallet doing nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}