{
  "id": "topic_5441225",
  "title": "Miktoken*",
  "author": "Miktoken*",
  "created_time": "February 25, 2023, 02:59:02 PM",
  "content": "Hello,I have tried to flash brainOs in several ways on s17 pro but it is impossible. When I leave the sd card in the asic, I have access to the brainOs interface but the miner does not launch. When I remove the card, the asic launches but on the old Os. There is no more brainOsmessage : tar : invalid magic tar : short read cannot find signatureThanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441225",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "February 25, 2023, 10:29:28 PM",
      "body": "There are two types of ways to run Braiins OS one is \"Run from SD Card\" and the 2nd is Auto-Install to NAND.The one that I think you use is the \"Run from SD Card\".If you want to flash your unit you need to download the auto-install to nand you can follow the guide from their documentation below.- https://docs.braiins.com/os/20.03/open-source-en/Setup/1_install.html#sd-card-method",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miktoken*",
      "created_time": "February 26, 2023, 07:18:47 AM",
      "body": "Thanks for the feedback, I had seen this page but I don't know everything. I'll look into it.Thank you very much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "February 27, 2023, 05:39:01 PMLast edit: February 27, 2023, 06:27:51 PM by Artemis3",
      "body": "You can't install to nand with the latest version, you need the older version and then upgrade. Or just always run it from SD. Check the first post in this thread to get the right version (x17).PS: The miner MUST have factory firmware. Beware that running others may permanently cause damage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miktoken*",
      "created_time": "March 03, 2023, 07:09:27 AM",
      "body": "great, thanks for the clarification. So that's why Brain doesn't want to settle.Thanks again for the clarification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 03, 2023, 12:24:40 PM",
      "body": "Quote from: Miktoken* on March 03, 2023, 07:09:27 AMgreat, thanks for the clarification. So that's why Brain doesn't want to settle.Thanks again for the clarification.If your miner has the latest version of firmware then Braiins does not support it yet but would you mind trying to flash the unit with asic.to firmware?What I think is maybe their firmware support the latest firmware where you can flash the unit through an SD card to nand and then if it's successfully flashed you can then flash it again with Braiins OS or just stay using asic.to firmware. Here's the firmware https://asic.to/antminer-s17-t17-optimized-firmware/They also have a guide to disable or remove signature and unlock SSH you can just remove the signature using their tool then start flashing the unit with Braiins OS through SD card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "March 03, 2023, 02:37:42 PM",
      "body": "DO NOT do what BitMaxz said, Stay away from ANY vnish poison.Please go to my thread were we can continue in peace without being insulted or harassed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 03, 2023, 04:44:38 PM",
      "body": "Quote from: Artemis3 on March 03, 2023, 02:37:42 PMDO NOT do what BitMaxz said, Stay away from ANY vnish poison.Please go to my thread were we can continue in peace without being insulted or harassed.How did it become poison?I know both taserz and you promoting different firmware but it looks like you are forcing people to use Braiins OS like you said above you can't install Braiins on the latest version I'm just suggesting a different way if he wants to bypass the signature check. Vnish firmware is legit not a poison unless you can tell us why it is poisoned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "March 05, 2023, 02:14:11 PMLast edit: March 05, 2023, 02:34:31 PM by Artemis3",
      "body": "I am not forcing anyone anything. Vnish himself directed a personal threat against my person before i blocked them on telegram, with taserz joining the bullying, insults and threats some of which can be seen in this forum. This is why they are now permanently ignored as thankfully this forum has that function and they are also blocked from my telegram as well.Vnish told me he was banned from this forum in 2017, and now i know why. This is why they resort to make fake accounts. It seems its not the first time they threat people and insult and ridicule others. So yes, they made it personal. They are poison. You can clearly see how taserz has insulted Kano for years when he demands they stop using cgminer (which they won't since they feel immune under the Russian sphere of influence).This is a thread about Braiins OS. instead you are here promoting vnish. So who is forcing what?, you are outright shilling here. This is why i'm telling the OP to move to my own self-moderated thread, where i will NOT allow you to shill others, specially when said others abuse.I don't care if you are their agent, best buddys or whatever. I didn't ask them to issue personal threats, and i never went to their group/thread to troll and insult, so they earned their reputation on their own. \"We are no longer 3 guys in a basement\" said taserz, but his attitude speaks for himself. If you are related to vnish, please do tell so i can add you as well to my ignore list. I don't need to take the vnish harassment anymore. I said enough is enough.PS: Yes you can install Braiins OS from the SD card if the miner has the latest version of FACTORY firmware. You just need the older SD image.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 05, 2023, 03:00:21 PM",
      "body": "I just want to let you know that I don't promote anything I just suggesting removing the signature check by using vnish firmware and then flash it again to braiins OS. Since you said this miner with the latest firmware can't able to flash via SD card that is why I suggested Vnish to bypass the signature issue but I don't promote them and I want to be honest with you we're not friends and I don't think we're related either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "March 05, 2023, 06:41:02 PMLast edit: March 05, 2023, 07:03:01 PM by Artemis3",
      "body": "All right please no more mention of this. It is your opinion, i absolutely refute touching anything made by them, and absolutely refuse to talk about them as this is an indirect promotion they absolutely don't deserve. You are simply telling people to use their fw and thats a big no.If you use the sd install method with the older version, it can install to nand. Or you can leave the sd card always inserted. The rest does not exist, its an unnecessary risk and worse, it promotes their behavior as it acknowledges their existence and attitude. So even if you are saying you are not, you are in practice becoming their agent. You just linked their site, that is directly giving them google search results. I will remind you that they take a cut so its not something \"free\", and this by exploiting the works of others like Kano and ck.This is not a vnish thread. And vnish is never the answer, quite the opposite. But i will not discuss this here anymore. Vnish is in my boycott list, both the person(s) and whatever they say they make or support. You can make a vnish thread stating how wonderful it is, and you will not see me there saying anything about it. But this is a thread with the word Braiins OS in it. He did the same provocation before, because that's what they do.If you insist, just like i told vnish, you will leave me no choice but to add you to the ignore list. Yes; just after vnish himself went to troll and insult in one of our groups, he was given a chance and he did behave for a few months, then he did it again plus the threats via dm, and that was the last time.If you think someone with this attitude could not do something wrong with firmware, that is your opinion, not mine, and like i said, this is not a vnish thread. No more vnish talk, you are essentially thread hijacking by bringing this here.The owner of the miner can do and risk whatever they want, but i do not agree that it is a viable way to install Braiins OS and nobody from Braiins will ever tell anyone to use vnish to install Braiins OS, that's ridiculous.The only supported install of Braiins OS is with the miner running FACTORY firmware and NOTHING else. When you uninstall Braiins OS it puts factory fw and you are free to do whatever after that. Because Braiins OS is not related to any other firmware, it is not a mod, you cannot use the same methods used to remove other fw. So the easiest and simplest way is just run it from the sd card. If you DO install to nand, to remove later, you need to use bos-toolbox uninstall.Therefore my recommendation, especially to those using x17, is to run it directly from the SD card and only install it if they are absolutely sure they want it in the nand, it makes no difference to run it from SD or NAND except saving the micro sd card for something else.PS: The reason the latest version is not installing to NAND is unrelated to signature checks. If you want to discuss more, come to my thread. We have derailed the OP question long enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "March 05, 2023, 11:03:35 PM",
      "body": "Artemis3, there is no need for all the drama and the accusation against BitMaxz, he is a long-standing community member who has nothing to do with Vnish, he was just trying to help OP with bypassing the firmware signature thing thinking it was the issue, it's not like he told him \"ditch BO+ and use Vnish\", him posting a link to Vnish is probably because of how badly you worded your first response, honestly, it was rude at best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "March 05, 2023, 11:10:30 PM",
      "body": "Now I'm the rude one... I see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}