{
  "id": "topic_5436495",
  "title": "tireless2012",
  "author": "tireless2012",
  "created_time": "January 23, 2023, 04:57:07 PM",
  "content": "Hello dear friends,I have just found this incredible new gambling defi system:In the presentation video they comment that Endblock is the pioneering collective reverse betting system that marks the inception of gambling.Using EB is incredibly straightforward - simply, connect your wallet, hit the Reset Blocks button and if the block counter reaches zero, the last person to reset it wins the entire jackpot.If no one has won the jackpot, when the block counter reaches zero the jackpot is distributed through a lottery and throught staking*.Every time you reset the blocks, you also receive a participation in the lottery and the EB token END.Accumulate END to participate in the Mega Jackpots, the largest lotteries and to recoup your investment through staking.The END token that you use to participate in Mega Jackpots is burned drastically reducing its supply and increasing the benefits of staking*.EB operates entirely on smart contracts and its blockchain system ensuring 100% transparency and automation, as it should be.Dont miss out on the chance to experience the transformative power of EB.By simply clicking on the Reset Blocks button, you can expect a significant change in your life.Furthermore, you can invite your friends to join EB by visiting the affiliate papel, inputting their wallet address, and confirming the transaction.Once your friend connects their wallet to EB and confirms the transaction you will earn 5% of all their Reset Blocks.Maximize your earning potential by carefully strategizing and inviting the right friends to join EB.*With the registration in EB you can participate in the jackpots but in order to win in the stake (this is the REAL DEAL) you must be referred. If you want me to refer you, you can send me a message.Good luck!!! https://endblock.io/how-it-works",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436495",
  "comments": [
    {
      "author": "BenCodie",
      "created_time": "January 23, 2023, 05:06:21 PM",
      "body": "I have just reviewed the game and I must say it does look quite interesting and unique to everything else here in the board. I am not sure if the \"last person to reset\" concept will be popular or about the invitation system/staking, but I am interested to see how it plays out. It's not the same, but it reminds me a bit of coinballer...though even that seems like it faded quite quickly from the board. It would be good to see the game creator around too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tireless2012",
      "created_time": "January 23, 2023, 05:42:39 PM",
      "body": "Its very very easy to play, you only new to connect your Metamask Wallet with BSC network (for the moment I only see this network) with some BNB to play. There are tickets of 0.01, 0.1,.. BNBs...Its realy amazing and The REAL DEAL its the staking with END token. Now the return per 1 END in 7 days is 0.4086 BNB.Every time you play with BNB you get the same quantity of END.And, I dont know the creator.More clear now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "January 23, 2023, 08:17:31 PM",
      "body": "Quote from: tireless2012 on January 23, 2023, 05:42:39 PMIts very very easy to play, you only new to connect your Metamask Wallet with BSC network (for the moment I only see this network) with some BNB to play. There are tickets of 0.01, 0.1,.. BNBs...Its realy amazing and The REAL DEAL its the staking with END token. Now the return per 1 END in 7 days is 0.4086 BNB.Every time you play with BNB you get the same quantity of END.And, I dont know the creator.More clear now?I would also like to see more of this game since it's a defi and using a more confident coin which I am okay with. The game looks quite interesting to me since it looks fair enough to go for and I would like if the team is at least unveiled to the public. Why is the link not loading? I have tried it several times or is it regional selective?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "January 23, 2023, 08:40:38 PM",
      "body": "Quote from: tireless2012 on January 23, 2023, 05:42:39 PMIts very very easy to play, you only new to connect your Metamask Wallet with BSC network (for the moment I only see this network) with some BNB to play. There are tickets of 0.01, 0.1,.. BNBs...Its realy amazing and The REAL DEAL its the staking with END token. Now the return per 1 END in 7 days is 0.4086 BNB.Every time you play with BNB you get the same quantity of END.And, I dont know the creator.More clear now?since it is a defi ecosystem and not accepting btc, this should not be here in this board. maybe move to service announcements (altcoins) section. in any case, a player should dig more about this END token. it may be giving good returns for now to attract new users, but later on, it won't give anymore just like many abandoned platforms. what i am wondering is why need to be referred to win in the stake? it seems dubious for me though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "January 23, 2023, 09:06:03 PM",
      "body": "Quote from: AmoreJaz on January 23, 2023, 08:40:38 PMQuote from: tireless2012 on January 23, 2023, 05:42:39 PMIts very very easy to play, you only new to connect your Metamask Wallet with BSC network (for the moment I only see this network) with some BNB to play. There are tickets of 0.01, 0.1,.. BNBs...Its realy amazing and The REAL DEAL its the staking with END token. Now the return per 1 END in 7 days is 0.4086 BNB.Every time you play with BNB you get the same quantity of END.And, I dont know the creator.More clear now?since it is a defi ecosystem and not accepting btc, this should not be here in this board. maybe move to service announcements (altcoins) section. in any case, a player should dig more about this END token. it may be giving good returns for now to attract new users, but later on, it won't give anymore just like many abandoned platforms. what i am wondering is why need to be referred to win in the stake? it seems dubious for me though.The video introduction is a very clear and straightforward, a good introduction to a new kind of game, the end token of this game is not yet in any exchange they should put a link to a decentralized exchange where it can be purchased, I agree that this kind of announcement that is not Bitcoin related should be in the altcoin service, they have a good potential in the DeFi gambling industry if they launch a marketing campaign for this token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "January 23, 2023, 10:26:18 PM",
      "body": "as some members have already mentioned this does not belong in this section, it should go to the altcoins section, I think of the following: people like to place sports bets, people like to play slots, and so many other casino games so if that person who created this site does not follow this same standard of games that are offered by most casinos so the person who created this site will failthis person will not have customers, in the beginning this person may even have some customers, but it will only be in the beginning and then there will be no more customers, because as I mentioned people tend to go to play in the casino that has a lot of games",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ebede",
      "created_time": "January 23, 2023, 11:00:50 PM",
      "body": "Quote from: Desmong on January 23, 2023, 08:17:31 PMQuote from: tireless2012 on January 23, 2023, 05:42:39 PMIts very very easy to play, you only new to connect your Metamask Wallet with BSC network (for the moment I only see this network) with some BNB to play. There are tickets of 0.01, 0.1,.. BNBs...Its realy amazing and The REAL DEAL its the staking with END token. Now the return per 1 END in 7 days is 0.4086 BNB.Every time you play with BNB you get the same quantity of END.And, I dont know the creator.More clear now?I would also like to see more of this game since it's a defi and using a more confident coin which I am okay with. The game looks quite interesting to me since it looks fair enough to go for and I would like if the team is at least unveiled to the public. Why is the link not loading? I have tried it several times or is it regional selective? Is why it is incredible and that the possible for someone to access or make a very big refers to a platform before as in making a bet with them or playing any game with them so if the sides and they are kind of game they play is okay with you you can at least put nice then I work with them but if it is not good with you because of your research you will leave the platform so that is what I have to say towards your comment and they are confident in writing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tireless2012",
      "created_time": "January 24, 2023, 12:31:31 PM",
      "body": "Quote from: Desmong on January 23, 2023, 08:17:31 PMQuote from: tireless2012 on January 23, 2023, 05:42:39 PMIts very very easy to play, you only new to connect your Metamask Wallet with BSC network (for the moment I only see this network) with some BNB to play. There are tickets of 0.01, 0.1,.. BNBs...Its realy amazing and The REAL DEAL its the staking with END token. Now the return per 1 END in 7 days is 0.4086 BNB.Every time you play with BNB you get the same quantity of END.And, I dont know the creator.More clear now?I would also like to see more of this game since it's a defi and using a more confident coin which I am okay with. The game looks quite interesting to me since it looks fair enough to go for and I would like if the team is at least unveiled to the public. Why is the link not loading? I have tried it several times or is it regional selective? Dear Desmong, you were finally able to enter the web?. I think it's a global project, you should be able to get in with no problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tireless2012",
      "created_time": "January 24, 2023, 12:44:38 PM",
      "body": "Quote from: coin-investor on January 23, 2023, 09:06:03 PMQuote from: AmoreJaz on January 23, 2023, 08:40:38 PMQuote from: tireless2012 on January 23, 2023, 05:42:39 PMIts very very easy to play, you only new to connect your Metamask Wallet with BSC network (for the moment I only see this network) with some BNB to play. There are tickets of 0.01, 0.1,.. BNBs...Its realy amazing and The REAL DEAL its the staking with END token. Now the return per 1 END in 7 days is 0.4086 BNB.Every time you play with BNB you get the same quantity of END.And, I dont know the creator.More clear now?since it is a defi ecosystem and not accepting btc, this should not be here in this board. maybe move to service announcements (altcoins) section. in any case, a player should dig more about this END token. it may be giving good returns for now to attract new users, but later on, it won't give anymore just like many abandoned platforms. what i am wondering is why need to be referred to win in the stake? it seems dubious for me though.The video introduction is a very clear and straightforward, a good introduction to a new kind of game, the end token of this game is not yet in any exchange they should put a link to a decentralized exchange where it can be purchased, I agree that this kind of announcement that is not Bitcoin related should be in the altcoin service, they have a good potential in the DeFi gambling industry if they launch a marketing campaign for this token.Dear coin-investor, according to what my affiliator told me, the platform is in the process of listing the END token and starting the corresponding marketing. Thank you for you interest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tireless2012",
      "created_time": "January 24, 2023, 12:52:20 PM",
      "body": "Quote from: AmoreJaz on January 23, 2023, 08:40:38 PMQuote from: tireless2012 on January 23, 2023, 05:42:39 PMIts very very easy to play, you only new to connect your Metamask Wallet with BSC network (for the moment I only see this network) with some BNB to play. There are tickets of 0.01, 0.1,.. BNBs...Its realy amazing and The REAL DEAL its the staking with END token. Now the return per 1 END in 7 days is 0.4086 BNB.Every time you play with BNB you get the same quantity of END.And, I dont know the creator.More clear now?since it is a defi ecosystem and not accepting btc, this should not be here in this board. maybe move to service announcements (altcoins) section. in any case, a player should dig more about this END token. it may be giving good returns for now to attract new users, but later on, it won't give anymore just like many abandoned platforms. what i am wondering is why need to be referred to win in the stake? it seems dubious for me though.Dear amorejaz, I understand that as the number of users grows, the percentage of profit will balance depending on what is collected and the number of END tokens that are staked. Also, I think it is a growth strategy for the company to force a referral to be able to stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tireless2012",
      "created_time": "January 24, 2023, 01:02:56 PM",
      "body": "Quote from: Slow death on January 23, 2023, 10:26:18 PMas some members have already mentioned this does not belong in this section, it should go to the altcoins section, I think of the following: people like to place sports bets, people like to play slots, and so many other casino games so if that person who created this site does not follow this same standard of games that are offered by most casinos so the person who created this site will failthis person will not have customers, in the beginning this person may even have some customers, but it will only be in the beginning and then there will be no more customers, because as I mentioned people tend to go to play in the casino that has a lot of gamesDear Slow death, I think the opposite, I think that because it is a new game concept, this project is going to be very successful. I'm playing several days, and it's the most addictive game I've ever played.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "January 24, 2023, 01:47:24 PM",
      "body": "I don't need to go more further about this site but I am sensing something phishy about it, any platform that will requires participants to connect their wallet is at a very high risk. Btw, what are the trust level to ask users to connect their wallet to the platform, is there no other methods for someone to join if I may ask?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peblaton",
      "created_time": "January 24, 2023, 04:04:52 PM",
      "body": "I already reviewed the site and although it seems interesting I see a huge problem. After winning END there is no way to exchange them for BNB, which raises many doubts as it may be a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 24, 2023, 04:33:14 PM",
      "body": "Quote from: Cryptomiles1 on January 24, 2023, 01:47:24 PMI don't need to go more further about this site but I am sensing something phishy about it, any platform that will requires participants to connect their wallet is at a very high risk. Btw, what are the trust level to ask users to connect their wallet to the platform, is there no other methods for someone to join if I may ask?I am quite sure that once you click wallet connect, your wallet extension will tell you what permissions the gaming provider would like. You can also limit it to one address that does not hold any other currency than what you want to play with as a security measure.Quote from: peblaton on January 24, 2023, 04:04:52 PMI already reviewed the site and although it seems interesting I see a huge problem. After winning END there is no way to exchange them for BNB, which raises many doubts as it may be a scam.I agree that the token should be established if they want to be taken seriously. It would also be a good sign if the token was listed on a decentralized exchange and had sufficient liquidity  before they enabled the game that is using the token. In the beginning they should have just started with small BNB games to let people try it and to build their reputation. This might be the downfall for them, which is actually a shame as it does look like a new and unique game. The only thing I do not like about it is that there could be hundreds of players but there will only be one winner in each round. I think that this was the problem with coinballer too. Small players are bound to lose and there is no point in them playing.Quote from: Slow death on January 23, 2023, 10:26:18 PMas some members have already mentioned this does not belong in this section, it should go to the altcoins section, I think of the following: people like to place sports bets, people like to play slots, and so many other casino games so if that person who created this site does not follow this same standard of games that are offered by most casinos so the person who created this site will failthis person will not have customers, in the beginning this person may even have some customers, but it will only be in the beginning and then there will be no more customers, because as I mentioned people tend to go to play in the casino that has a lot of gamesI think that it is wrong to shun new game concepts and to keep people within the \"standard\" games. At least with this game and coinballer, you are playing against other players, not against a house. Again the issue with both of these is it is \"one winner takes all\" and the rest lose. I think that is both of their problems.I do not think anyone can be the of judge whether or not a game will have customers at such an early stage or not either, at least not from face value. Everyone has different tastes. Some people will like some games that others do not. Only time can be the judge of that.Quote from: tireless2012 on January 24, 2023, 12:44:38 PMQuote from: coin-investor on January 23, 2023, 09:06:03 PMThe video introduction is a very clear and straightforward, a good introduction to a new kind of game, the end token of this game is not yet in any exchange they should put a link to a decentralized exchange where it can be purchased, I agree that this kind of announcement that is not Bitcoin related should be in the altcoin service, they have a good potential in the DeFi gambling industry if they launch a marketing campaign for this token.Dear coin-investor, according to what my affiliator told me, the platform is in the process of listing the END token and starting the corresponding marketing. Thank you for you interest Who is the \"affiliator\"? Does this mean the owner of the platform? In my opinion, it would be good for you to recommend them to come here and talk to the community if they would like to establish trust here. It is much better than an affiliate/player to be promoting on their behalf.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "January 24, 2023, 04:49:17 PM",
      "body": "A strange gaming platform claiming in paragraph #23 of its TaC that they are regulated in accordance with the laws of Curacao, but there is no Curacao license, it seems to me that this is just a set of non-binding terms.Quote from: https://endblock.io/terms23. Governing law: These terms and conditions will be governed and interpreted in accordance with the laws of Curaçao.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danadc",
      "created_time": "January 24, 2023, 06:45:09 PM",
      "body": "I like the variety it has in terms of casino games, but I didn't know that Defi didn't accept bitcoin, but can't they add it? or is it only for pure tokens, it would be great if it could have that option that is diversified to be able to have the full fun, I like the option that you have to acquire the tokens and if it is to play in a real way, how much is each token worth is he in the casino? and in which exchanges can they be found? It would be good if they could explain all that to be able to accept the conditions and play and thus get more people to the casino, it is what I can think of to do so that they can be more successful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "January 24, 2023, 06:52:36 PM",
      "body": "Quote from: danadc on January 24, 2023, 06:45:09 PMI like the variety it has in terms of casino games, but I didn't know that Defi didn't accept bitcoin, but can't they add it? or is it only for pure tokens, it would be great if it could have that option that is diversified to be able to have the full fun, I like the option that you have to acquire the tokens and if it is to play in a real way, how much is each token worth is he in the casino? and in which exchanges can they be found? It would be good if they could explain all that to be able to accept the conditions and play and thus get more people to the casino, it is what I can think of to do so that they can be more successful.The Bitcoin whitepaper does state that smart contracts will be a part of Bitcoin. To my understanding this is possible currently though it is much easier for developers to integrate things like wallet connect with blockchains on the Ethereum Virtual Machine. If it was as simple as Ethereum, I am sure a lot of projects would have implemented it by now. Not many have. I do not think any casinos/gambling games or even defi have yet either to my knowledge.If you read the rest of the thread, the token is not yet listed anywhere and the OP has stated this about it:Quote from: tireless2012 on January 24, 2023, 12:44:38 PMQuote from: coin-investor on January 23, 2023, 09:06:03 PMQuote from: AmoreJaz on January 23, 2023, 08:40:38 PMQuote from: tireless2012 on January 23, 2023, 05:42:39 PMIts very very easy to play, you only new to connect your Metamask Wallet with BSC network (for the moment I only see this network) with some BNB to play. There are tickets of 0.01, 0.1,.. BNBs...Its realy amazing and The REAL DEAL its the staking with END token. Now the return per 1 END in 7 days is 0.4086 BNB.Every time you play with BNB you get the same quantity of END.And, I dont know the creator.More clear now?since it is a defi ecosystem and not accepting btc, this should not be here in this board. maybe move to service announcements (altcoins) section. in any case, a player should dig more about this END token. it may be giving good returns for now to attract new users, but later on, it won't give anymore just like many abandoned platforms. what i am wondering is why need to be referred to win in the stake? it seems dubious for me though.The video introduction is a very clear and straightforward, a good introduction to a new kind of game, the end token of this game is not yet in any exchange they should put a link to a decentralized exchange where it can be purchased, I agree that this kind of announcement that is not Bitcoin related should be in the altcoin service, they have a good potential in the DeFi gambling industry if they launch a marketing campaign for this token.Dear coin-investor, according to what my affiliator told me, the platform is in the process of listing the END token and starting the corresponding marketing. Thank you for you interest",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "January 24, 2023, 06:58:03 PM",
      "body": "Quote from: danadc on January 24, 2023, 06:45:09 PMI like the variety it has in terms of casino games, but I didn't know that Defi didn't accept bitcoin, but can't they add it? or is it only for pure tokens, it would be great if it could have that option that is diversified to be able to have the full fun, I like the option that you have to acquire the tokens and if it is to play in a real way, how much is each token worth is he in the casino? and in which exchanges can they be found? It would be good if they could explain all that to be able to accept the conditions and play and thus get more people to the casino, it is what I can think of to do so that they can be more successful.I've not checked though, but if the game is one that runs on BSC or any other blockchains, then it will be a bit difficult for them to accept bitcoin on the casino, except the bitcoin they are going to be accepting is a wrapped version of the real bitcoin which runs on the same blockchain the game it self runs on..Adding bitcoin deposit and withdrawer on centralized online casinos is way easier to do than it is with decentralized casino.So just incase this casino does not start accepting bitcoin soon, I hope the above tell you the reason why it is so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "January 24, 2023, 07:09:03 PM",
      "body": "Quote from: Slow death on January 23, 2023, 10:26:18 PMas some members have already mentioned this does not belong in this section, it should go to the altcoins section, I think of the following: people like to place sports bets, people like to play slots, and so many other casino games so if that person who created this site does not follow this same standard of games that are offered by most casinos so the person who created this site will failthis person will not have customers, in the beginning this person may even have some customers, but it will only be in the beginning and then there will be no more customers, because as I mentioned people tend to go to play in the casino that has a lot of gamesI dont think the ops mentioned that there is limited games on their site and if their can mentain even a few players and building a food reputation and trust between the casino and the players, in no time there community base will greatly increase and of everything being equal it should be better to buold a good reputation rather than to have multiple games and without any reputation .We have some casinos that have multiole games and yet with low players and even their regular players easily give up when their is nothin like bonus or other promotion, so multiple games is not a guarantee for good reputation that can retain players' loyalty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}