{
  "id": "topic_5473553",
  "title": "ElDalmatino",
  "author": "ElDalmatino",
  "created_time": "November 09, 2023, 11:59:18 PM",
  "content": "I was thinking about the keyspace when i look last days at the puzzles.What are you think, is it possible that someone hold \"a\" whole keyspace, not all, and scan all time for active addresses ?I mean not the Private Key Range (Bits) the small ones 1 to 20 or so, i mean the bigger ones.Because when i think about how many hunters or ppl that are try to solve puzzle 66, in all together random generators bitcrack, keyhunt, vanbitcracken, kangaroo ... have found nothing, What is the chance for it, that a company like xyz i mean the big players in data, have databases with existing private keys.And on the other way, i think we all less or more, have the problem that we search the same keyspace, on and on.Wanna hear what you think about, maybe some are smile about this topic, but maybe some are also interested in other opinions.If we would not be afraid that somebody other is get the btc, we could have a database of scanned ranges (Keyspaces) ... i know it will be, its more than sand on a trillion planets, but in mass we scan also together, sand, corn by corn in trillions of planets (but i think we scan every sandcorn a million time).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473553",
  "comments": [
    {
      "author": "ymgve2",
      "created_time": "November 10, 2023, 02:48:07 AM",
      "body": "The puzzle hunters are easy to explain - their software is optimized to search for a single address, and therefore can't find anything other than that single address.It is easy to find short private keys that have been used - you just need to visit https://privatekeys.pw/keys/bitcoin/1 and browse through the first pages to see lots of empty used addresses. There are absolutely people monitoring short private keys, you can just pick a random key in a 32 bit range, send some satoshis and see it disappear instantly, possible even multiple transactions trying to grab the same coins.You also assume that if someone found coins on a non-puzzle key, they would publically announce it, while in reality they would very likely not tell anyone, since they would be admitting to theft.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "November 10, 2023, 11:53:56 AM",
      "body": "Quote from: ElDalmatino on November 09, 2023, 11:59:18 PMBecause when i think about how many hunters or ppl that are try to solve puzzle 66, in all together random generators bitcrack, keyhunt, vanbitcracken, kangaroo ... have found nothing,What is the chance for it, that a company like xyz i mean the big players in data, have databases with existing private keys.Only if the required storage is accessible and affordable.For example, the whole 2^65 range would require about 1.2Billion Terabytes of storage to create a database of all the scanned private keys from puzzle1.If we would include the already-scanned ranges to 2^66, it'll add about a quarter to half Billion or more Terabytes. (depending on their progress)If there's a company that's able to procure that amount of storage capacity and willing to use it for that sole purpose, then there's a chance.Note: It's a very rough computation based from the size of raw private key (32Bytes) the amount of keys in the said range (2^65).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ElDalmatino",
      "created_time": "November 10, 2023, 05:04:11 PM",
      "body": "I think we all think to small, in the space of storage, lets say a international bank, it stores more than btc private keys exist ... never forget btc in his smallest form, is just a base58 number because it's smaller to store than a hex, and the calculated corresponding address, when it's one time done (the calculation),we look at our Home equipment and think, can never be done, but think in a dimension like, let's take the int. bank i told you, with millions of customers and data about the customers ...will not talk about big data companies like google ... For an example take the puzzles what give me the brainstorm start ... https://privatekeys.pw/puzzles/bitcoin-puzzle-txwe need for puzzle 65 less than 3 Minutes to generate, the pk with the knowledge of today, that's why so much are found, in the upper puzzles, every 5. public key was exposed. Calculating is a Joke in this case. Be shure if tomorrow, puzzle 66 the public key would show up in a tx, same day it would be emptied. By a Home User ... maybe if he is fast enough.Thats my major point, all depends on the, wanna do it, from the big players. But don't tell me it's \"big data storage\" in 2023.Maybe it's really what some say, on the puzzle the XYZ see how far the tech. is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "November 10, 2023, 05:50:45 PM",
      "body": "Not only google, but the entire planet earth couldn't even store 2^65 addresses, or private keys if they wanted to. You are misinformed about a few things but yes if someone finds #66, it would be best to talk with a miner and spend all the balance as miner fee, because no one would try to double spend something like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}