{
  "id": "topic_5418912",
  "title": "a298b112",
  "author": "a298b112",
  "created_time": "October 31, 2022, 08:54:58 AM",
  "content": "I am quite new to the crypto, investing, economy and all that...so far really got interested in about a year ago. So far what I see is lots of lack of similarities in opinions of youtubers, blogers and mass media. Some sources are shouting like creasy that a great recession is coming and it will hurt everyone so bad like never did. More moderate youtubers are doing some analysis and basically what they saying is, well there could be recession, and that is ok, this is how you get markets cleaned up. And there is third part that says, no everything is ok... unemployment is high, GDP is rising so technically we are not in a recession. So the question is, what is going on there, are we really heading to recession? (or this is how markets work, so that people always speculate? )",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418912",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "October 31, 2022, 10:16:22 AM",
      "body": "Looking at it in general economical aspect This speculations regarding recession is not surprising if we look at how inflation has drastically risen since the covid pandemic. This has also prompted the rise in interest and causing rise in eventually almost every commodity making it difficult to businesses and to even save. Economic experts have said if the inflation doesn't reduces then it is most likely for recession to hit.Another area which may push in recession is the war between Ukraine and Russia. Since the start of the war the supply of energy to other countries by Russia has reduced, this could also drive in recession.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "October 31, 2022, 10:37:02 AM",
      "body": "It's not coming, recession has actually came, and it's actually happening right now depending on what region/part of the world you're located. The United States is in an actual recession after going through two quarters of negative GDP, BUT they changed the definition of what a is considered a \"recession\". Why? Because it's an election year. The government needs to manipulate economic data and gaslight people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 31, 2022, 11:06:14 AM",
      "body": "Quote from: a298b112 on October 31, 2022, 08:54:58 AMI am quite new to the crypto, investing, economy and all that...so far really got interested in about a year ago. So far what I see is lots of lack of similarities in opinions of youtubers, blogers and mass media. Some sources are shouting like creasy that a great recession is coming and it will hurt everyone so bad like never did. More moderate youtubers are doing some analysis and basically what they saying is, well there could be recession, and that is ok, this is how you get markets cleaned up. And there is third part that says, no everything is ok... unemployment is high, GDP is rising so technically we are not in a recession. So the question is, what is going on there, are we really heading to recession? (or this is how markets work, so that people always speculate? )Well, we've been in recession already. Have you seen the problems that have raised like shortage of food, oil price hikes, lesser supply for oil, increased rate by the FED, and many more? It might be late for those influencers that you've been following but we're actually experiencing it already. You see that many countries have been struggling against the inflation and with the value of USD going up but the actual country of US have also been struggling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "October 31, 2022, 11:43:05 AM",
      "body": "Quote from: a298b112 on October 31, 2022, 08:54:58 AMI am quite new to the crypto, investing, economy and all that...so far really got interested in about a year ago. So far what I see is lots of lack of similarities in opinions of youtubers, blogers and mass media. Some sources are shouting like creasy that a great recession is coming and it will hurt everyone so bad like never did. More moderate youtubers are doing some analysis and basically what they saying is, well there could be recession, and that is ok, this is how you get markets cleaned up. And there is third part that says, no everything is ok... unemployment is high, GDP is rising so technically we are not in a recession. So the question is, what is going on there, are we really heading to recession? (or this is how markets work, so that people always speculate? )Yes, the recession in the global economy should have come a long time ago.  Oddly enough, the onset of the recession was delayed by the Covid-19 coronavirus pandemic.  All assets in the world are highly overvalued.  State institutions are very imperfect.  Global supply chains are broken.  Technological progress has slowed down.  The world is short of new ideas.  We need a leader who will be able to unite all earthlings and set global goals for them.  For example, to populate Mars or achieve immortality through the development of medical technology.  Perhaps the next President of the United States will be Elon Musk and he will be able to bring the world economy out of recession.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "October 31, 2022, 11:46:05 AM",
      "body": "The global economy will be facing difficulties for sure, but don't trust the \"doom & gloom prophets of the Apocalypse\".Some people simply like to spread panic and FUD(fear, uncertainty and doubt). Maybe they get some sort of benefits from spreading fears and panic, I just don't know what kind of benefits. There are Congress/Senate elections coming in the US and maybe the republicans want to spread more fears about the \"disastrous\" Biden administration and how everything is going downhill, unless the GOP comes and saves the day.We can't get rid of political propaganda. Putin's propagandists keep repeating that Europe is going to be a facing a \"cold winter\" unless we the Europeans start begging Putin for mercy. Again, this is pure propaganda and nothing else.The global economy will have to change and adapt and some people will lose their current jobs before their find new jobs.The inflation will be high because the western world won't have access to cheap Russian gas (and maybe cheap Chinese goods).The recession is a part of the business cycle. The economy can't keep growing forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 31, 2022, 12:18:22 PM",
      "body": "Depending on how you measure recessions, some parts of the world and even some developed economies might already be in one. There are quite a few reasons the term \"recession\" gets used and they normally coincide (one was 2 consecutively quarterly losses of the stock market in the US and others were 20% drops in the market or 20%.drops in gdp - the last is the one normally used). If recession happens around the time of highest business (now - January) then you'll probably see it having a more profound affect than if it happened in the summer or spring but you still might not even notice it.A lot of economies are still slowly growing based off the last statistics iirc so I don't think there's definitely a recession coming, deflation might be coming sooner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 31, 2022, 02:25:38 PM",
      "body": "I believe yes! We are heading towards a recession. Looking at the extremely high inflation in all major economies and with rising energy prices, recession is probably knocking on the door. So unless this inflation is controlled, recession is inevitable.But this recession is likely to impact the major economies like US, UK, Germany etc. But for other markets where cheap labour is available, might become a blessing for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "October 31, 2022, 03:04:27 PM",
      "body": "we are hearing those warning from reputable people like chamath palihapitiya and his cohorts. i don't think those guys are lying to us. some of them are prediction recession is coming in the next 6-12 months but some already said we are in recession already. the prices of commodities and supplies getting low because of lock downs. its likely that we are already in recession giving that there are already protests happening in European countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "October 31, 2022, 03:20:16 PM",
      "body": "In my country recession is not coming soon but recession is already with us. We are living with recession so whether badly or worst, we are already with it. We are facing depression and recession at the same time so there is nothing to afraid about anything such of that magnitude. And one thing I understand in the recession period is that, the cause of this economic downturn is caused by the government. There is nothing someone will tell me that I would/will not blame the government of such things. There are some questions we have to ask. What is the cause of this recession? Is it the population that is over power the commodities? Or there is a fault in the supply chain against the demand. If there is any there government can make things easier for the citizens from top to the bottom. The governments in the world are to be blame because they allow the capitalists to over power the system so the capitalists do what they want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "October 31, 2022, 03:47:34 PM",
      "body": "We all live in different parts of the world and across different continents, even without the analysis and predictions, you can make up your mind on what's upon us based on what you see and experience on a daily basis in your country. Quite a lot of things have happened in recent years, especially from the pandemic time leading up to now, and governments have somewhat made terrible decisions like printing more and more money to temporarily solve the problem whilst creating a lasting one that will show up soon enough, there are crisis in major parts of the economy and it is felt especially in prices of commodities and devaluation of fiat. Some countries may well already be in a recession, but we all come from different countries, so the situation is slightly different from place to place.Having said that, people should have to prepare for a time when worst comes to worst, if you need a hedge to devaluation of fiat, there is Bitcoin to help with that, your funds will obviously be in your control that way, rather than in the control of some oligarchs that make really bad decisions more often than not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 31, 2022, 04:21:03 PM",
      "body": "With energy crisis and inflation is uncontrolled by FED, we're sure going there if recession isn't what we are experiencing right now. While we have prices keep rising and winter is here, we sure are going to find it hard to make it if there ain't a lot of savings we have in our pockets to spend.Yes. Recession can't be avoided if government policies will not be changed. Somehow though only the EU are suffering a lot which is also because of the Ukraine-Russia war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 01, 2022, 02:01:13 AM",
      "body": "Quote from: a298b112 on October 31, 2022, 08:54:58 AMSo the question is, what is going on there, are we really heading to recession? (or this is how markets work, so that people always speculate? )Recession is when a country experiences a fall in Gross Domestic Product for two quarters consistently. But the recent recession is affecting almost all the economies of the world because many countries have even experienced more than two quarters of fall in GDP. In my country we are not on recession but the effect of the recession experienced by other nations have increase the prices or goods and services. The high cost of gas and crude has affected my nation's economy that we might be heading to recession in few quarters. The main triggers of the recent recession most nations are facing is the negative impact of Covid-19 lock-downs and the Russian invasion of Ukraine. I am not really blaming the government of my nation for the economic hardship because the causes of it are uncontrollable external economic factors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "November 01, 2022, 02:28:23 AM",
      "body": "It depends, if most governments can take care of their expenditure, fix their high inflation rate, take care of unemployment and make them get a job etc, it will boost their economy, so recession wouldn't happen. But the question is, does they can did that in short time? obviously not because this is a macro economy problem and the problem is caused by one problem to another. This make the problem is hard to resolve and recession is high likely will come in the next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "November 01, 2022, 03:02:52 AM",
      "body": "Quote from: a298b112 on October 31, 2022, 08:54:58 AMI am quite new to the crypto, investing, economy and all that...so far really got interested in about a year ago. So far what I see is lots of lack of similarities in opinions of youtubers, blogers and mass media. Some sources are shouting like creasy that a great recession is coming and it will hurt everyone so bad like never did. More moderate youtubers are doing some analysis and basically what they saying is, well there could be recession, and that is ok, this is how you get markets cleaned up. And there is third part that says, no everything is ok... unemployment is high, GDP is rising so technically we are not in a recession. So the question is, what is going on there, are we really heading to recession? (or this is how markets work, so that people always speculate? )Contradiction between the predictions that you listen is simply inevitable as two different people could read the same data and one of them will be bullish while the other will be bearish.So what is it? Are we in a recession already or we are heading there? I think we are headed there, and while governments will probably try to do their best for their economy to avoid the label of being in recession this is something inevitable if you ask me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "November 01, 2022, 03:08:28 AM",
      "body": "Quote from: Zlantann on November 01, 2022, 02:01:13 AMQuote from: a298b112 on October 31, 2022, 08:54:58 AMSo the question is, what is going on there, are we really heading to recession? (or this is how markets work, so that people always speculate? )Recession is when a country experiences a fall in Gross Domestic Product for two quarters consistently. But the recent recession is affecting almost all the economies of the world because many countries have even experienced more than two quarters of fall in GDP. In my country we are not on recession but the effect of the recession experienced by other nations have increase the prices or goods and services. The high cost of gas and crude has affected my nation's economy that we might be heading to recession in few quarters. The main triggers of the recent recession most nations are facing is the negative impact of Covid-19 lock-downs and the Russian invasion of Ukraine. I am not really blaming the government of my nation for the economic hardship because the causes of it are uncontrollable external economic factors.    In theory, I think that many countries have fallen into recession, including the US, they have had 2 consecutive quarters of negative growth but they still claim that they have not entered a recession. In my opinion, it's all man-made so it's subject to change, so recession or not will depend on how each country measures recession. You're the first person I've seen who takes a different look at the current crisis. Most people are trying to blame their government for not taking action to prevent inflation and crisis but they don't know that all countries in the world are interconnected, once a crisis occurs in one region or a few countries, it affects other countries. The crisis is happening globally so no country can avoid it, the government is also trying its best, we should also sympathize with them, don't just blame them while the world situation is not getting better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "November 01, 2022, 03:24:47 AM",
      "body": "Are you waiting for one branch of government to tell it? Or you could decide by yourself. Because as how I see it, as a consumer, I can feel that we are in recession already. Wages are not enough for an individual to survive, you will need another job to make it through. But that's the other problem, there's also fewer jobs at this economic situation and instead of hiring, they are actually kicking some employees out because they cannot pay anymore. If everyone will focus on saving and investing, there will be a problem in consumption rates which means less workers needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 02, 2022, 11:24:08 AM",
      "body": "Quote from: Wind_FURY on October 31, 2022, 10:37:02 AMThe United States is in an actual recession after going through two quarters of negative GDP, BUT they changed the definition of what a is considered a \"recession\". Why? Because it's an election year. The government needs to manipulate economic data and gaslight people.United states GDP has grown by 2.6% in Q3https://www.cnbc.com/2022/10/27/us-gdp-accelerated-at-2point6percent-pace-in-q3-better-than-expected-as-growth-turns-positive.htmlSo even if it was in a technical recession for the first half of the year it's out of it!Quote from: electronicash on October 31, 2022, 03:04:27 PMwe are hearing those warning from reputable people like chamath palihapitiya and his cohorts. i don't think those guys are lying to us. Oh yeah, reputable people :The SPAC King Goes Silent With His Empire ShrivelingThe guy that news the recession a coming told everyone so and yet somehow miraculously didn't do a thing abouthttps://www.marketwatch.com/story/the-spacsplosion-is-about-to-become-a-liquidation-frenzy-and-that-may-be-for-the-best-11657884798QuoteChamath Palihapitiya, for example, is best known for buying Virgin Galactic Holdings SPCE, +3.68% with the first of his nine SPACs, and was dubbed the “Pied Piper of SPACs” by the New Yorker. The shares in his three de-SPACs, however, have since fallen, even though Palihapitiya has managed huge personal gains from the deals. In a recent report by Massachusetts Sen. Elizabeth Warren’s office, Palihaptitiya is listed as an example of the misaligned incentives in SPACs and how the sponsors are rewarded, especially “serial SPAC sponsors,” while leaving retail investors “at risk from SPACs’ convoluted structure and incentives for dilution, fraud and abuse.”In the end, it is these sponsors, like Palihapitiya and Virgin Galactic’s Richard Branson, as well as Wall Street investment banks for the initial SPAC IPO, that walk away with the big gains. The remaining original IPO investors who are still in these stocks, for the most part, will be lucky to get out with their initial investment. But for the most part, the original IPO investors are long gone.Oh, another Kiyosaki, telling others how to do their business while running their own into the ground and bankrupting every investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Punakawan",
      "created_time": "November 02, 2022, 01:13:25 PM",
      "body": "It's hard to say whether at this time the recession has occurred, I am still in school and get the full fee from my parents so I do not know the economic conditions, but the thing I feel is the price of food and the needs that I bought more expensive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "November 02, 2022, 02:28:03 PM",
      "body": "I’m paying more for milk, oil, vegetables. I am pretty sure we are into recession already. I am sure everyone is going through the same unless and until they are not richest around. By the way you stated that it’s high unemployment which means that’s actually very problematic mate. Recession plus unemployment is the worst formula for disturbed economic. This is growing all the time considering war situation, ever growing sanctions from powerful countries and everything crippling around that bad circle. It’s gonna make it worst just wait and watch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}