{
  "id": "topic_5436943",
  "title": "BossTrack",
  "author": "BossTrack",
  "created_time": "January 26, 2023, 11:29:42 PM",
  "content": "The financial group Goldman Sachs is known in the cryptocurrency community for historically taking anti-Bitcoin stances, however according to their year-to-date asset return report by the company, Bitcoin so far is the best performing asset of the year.Furthermore the Bitcoin asset was compared to their other assets like S&P 500, real estate and so on which not only outperformed these asset classes, but by a huge margin of reaching 27% in returns compared to the second highest of \"MSCI Emerging Markets\" at 8%.Source: https://blog.bosstrack.com/goldman-sachs-described-bitcoin-as-best-performing-asset-of-2023/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436943",
  "comments": [
    {
      "author": "SFR10",
      "created_time": "January 27, 2023, 04:37:50 PM",
      "body": "Quote from: BossTrack on January 26, 2023, 11:29:42 PMThe financial group Goldman Sachs is known in the cryptocurrency community for historically taking anti-Bitcoin stances, however according to their year-to-date asset return report by the company, Bitcoin so far is the best performing asset of the year.Honestly, I don't think they deserve to have any kind of spotlight on them, especially since we're talking about YTD returns [less than 4 weeks]... As soon as it goes south [and it stays there for some time], they'll go back to their previous statements!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "January 27, 2023, 06:53:16 PM",
      "body": "Goldman Sachs will always say things that benefit them. So if the said all the years that bitcoin is bad, they did it because they were not involved in it. Now after they have financial products regarding bitcoin that make them money if they sell them, they start to advertise bitcoin.If they however can make somehow money again with low prices, they will again say the opposite. Long story short, dont trust banks. Dont do what they say, do what they do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 28, 2023, 03:10:52 PM",
      "body": "Quote from: https://markets.businessinsider.com/currencies/news/bitcoin-price-never-coming-back-goldman-sachs-says-2018-8-1027429844?op=1\"We expect further declines in the future given our view that these cryptocurrencies do not fulfill any of the three traditional roles of a currency: they are neither a medium of exchange, nor a unit of measurement, nor a store of value.\"We can't say they were completely wrong when it comes to cryptocurrencies in general, but when it comes to Bitcoin it's hard to find any significant bank or financial institution that thought differently 4+ years ago. Banks should therefore never be a benchmark or an indicator of someone's decision to invest or not in something - they just want to appear smart from time to time, as if no one in the world knows elementary mathematics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "January 30, 2023, 02:12:48 AM",
      "body": "Quote from: Lucius on January 28, 2023, 03:10:52 PMQuote from: https://markets.businessinsider.com/currencies/news/bitcoin-price-never-coming-back-goldman-sachs-says-2018-8-1027429844?op=1\"We expect further declines in the future given our view that these cryptocurrencies do not fulfill any of the three traditional roles of a currency: they are neither a medium of exchange, nor a unit of measurement, nor a store of value.\"We can't say they were completely wrong when it comes to cryptocurrencies in general, but when it comes to Bitcoin it's hard to find any significant bank or financial institution that thought differently 4+ years ago. Banks should therefore never be a benchmark or an indicator of someone's decision to invest or not in something - they just want to appear smart from time to time, as if no one in the world knows elementary mathematics.They might have learned their mistakes from 2018 and presently they have made the decision to buy everything they can for their institutional investor friends during the low prices of 2022 hehehehehee.Also, agreed! We should not trust what announcements the banks have their friends in mainstream media publish. They are much of the time very similar to forum cave trolls. They hype when they are holding the coin or fud when they are not holding the coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "January 30, 2023, 11:09:28 AM",
      "body": "@bbc.reporter, we always remember our \"friend\" Jamie Dimon who was very harsh and negative about Bitcoin, then he changed his mind and literally apologized saying that he was wrong, only to recently take his original position again. For me, this is not very logical behavior, because Bitcoin today is the same as it was in 2018, nothing has changed in the way it works, but obviously the interests of someone or something have changed.It is to be assumed that a lot of unbelievers will begin to slowly convert this or the next year, because it is difficult (and unprofitable) to swim against the current - but unfortunately for all of them, the internet remembers everything, you just have to look a little into the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Carlton Banks",
      "created_time": "January 30, 2023, 02:22:47 PM",
      "body": "Quote from: Lucius on January 28, 2023, 03:10:52 PMBanks should therefore never be a benchmark or an indicator of someone's decision to invest or not in somethingif you had good investment advice, would you: 1. start shouting about it, to everyone, all the time2. keep quiet and buy/sell the maximum you can while no-one else noticesthis financial news stuff is comprehensive market manipulation, but also quite subtle. Number 1 subtle message in financial news stories is: \"and that's why you need to read the financial news, you needed to know this story, right?\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 30, 2023, 07:43:26 PM",
      "body": "Quote from: Carlton Banks on January 30, 2023, 02:22:47 PMthis financial news stuff is comprehensive market manipulation, but also quite subtle. Number 1 subtle message in financial news stories is: \"and that's why you need to read the financial news, you needed to know this story, right?\"Yup, well said.And since the trading world goes by \"buy the rumor, sell the news\", I would not be surprised if this news is means to (desperately?) drag the price down.However, we know how \"reliable\" are Goldman Sachs \"news\", \"findings\" and \"opinions\" on Bitcoin...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "January 30, 2023, 08:44:20 PMLast edit: January 31, 2023, 11:46:38 AM by Mr. Big",
      "body": "Quote from: Lucius on January 28, 2023, 03:10:52 PMQuote from: https://markets.businessinsider.com/currencies/news/bitcoin-price-never-coming-back-goldman-sachs-says-2018-8-1027429844?op=1\"We expect further declines in the future given our view that these cryptocurrencies do not fulfill any of the three traditional roles of a currency: they are neither a medium of exchange, nor a unit of measurement, nor a store of value.\"We can't say they were completely wrong when it comes to cryptocurrencies in general, but when it comes to Bitcoin it's hard to find any significant bank or financial institution that thought differently 4+ years ago. Banks should therefore never be a benchmark or an indicator of someone's decision to invest or not in something - they just want to appear smart from time to time, as if no one in the world knows elementary mathematics.I'd have to disagree.  Crypto can easily be a \"a store of value\".  Over any reasonable timeframe so far, crypto has demonstrated that it is a good store of value.  Of course fiat is definitely not a \"a store of value\".As far as a medium of exchange, for proof it is a medium of exchange, just ask silk road and all the other places that have used bitcoin for transactions over the last 14 years.  There are plenty.Perhaps it is not a unit of measurement yet, but 2 out of three equals or beats most fiat.Quote from: Carlton Banks on January 30, 2023, 02:22:47 PMQuote from: Lucius on January 28, 2023, 03:10:52 PMBanks should therefore never be a benchmark or an indicator of someone's decision to invest or not in somethingif you had good investment advice, would you: 1. start shouting about it, to everyone, all the time2. keep quiet and buy/sell the maximum you can while no-one else noticesthis financial news stuff is comprehensive market manipulation, but also quite subtle. Number 1 subtle message in financial news stories is: \"and that's why you need to read the financial news, you needed to know this story, right?\"Precisely.  Many of the people at the investment banks are paid to do \"something\" even if that something is just writing articles to share with clients and those employees are never judged on the records that their calls have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Carlton Banks",
      "created_time": "January 31, 2023, 02:00:48 PM",
      "body": "Quote from: cr1776 on January 30, 2023, 08:44:20 PMMany of the people at the investment banks are paid to do \"something\" even if that something is just writing articles to share with clients and those employees are never judged on the records that their calls have.  which adds another dimension these days...newspaper editorials were often written without a by-line (i.e. attribution of the author), supposedly in order to make the author \"more objective\", but 95% of articles named the writerany news or opinion piece in the 2020s+ can now be written anonymously (by a human or an AI), connoting all manner of warped or disgusting principles or attitudes, then by way of apology the news outlet simply always blames the AI",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "February 07, 2023, 11:43:33 AM",
      "body": "You have to smell a rat when Goldman Sachs starts to hype Bitcoin's performance.... and that tells me one thing, they are invested in Bitcoin in some way. They either bought shares in a Bitcoin related business or they bought some bitcoins and they want to profit from it by boosting it's image.  In any way, why would you hype the competitors product, if you are not invested in it in some way? Knowing how Banks work, they will boost the price, so that they can sell and make a profit.... and then push those profits into their operations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}