{
  "id": "topic_5429432",
  "title": "BoyFromDubai",
  "author": "BoyFromDubai",
  "created_time": "December 16, 2022, 02:50:00 PM",
  "content": "I remember that I somewhere saw an article that not only files of blocks are stored, but also the information about vouts in these blocks. I mean file blk_n.dat and a file for blk_n.dat that stores all vouts for this block. It's used for situations when you got bigger chain, but your last block isn't in it and you have to restore your leveldb whic stores vouts with the help of this file. And I can't find any information for this topic and that article I said about before",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429432",
  "comments": [
    {
      "author": "achow101",
      "created_time": "December 16, 2022, 04:48:56 PM",
      "body": "The undo data is stored in rev*.dat files.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BoyFromDubai",
      "created_time": "December 16, 2022, 05:09:20 PM",
      "body": "But what kind of data is stored there? Vins, vouts or both?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "December 16, 2022, 09:03:06 PM",
      "body": "Quote from: BoyFromDubai on December 16, 2022, 05:09:20 PMBut what kind of data is stored there? Vins, vouts or both?A simple web search reveals your answer.Quote from: https://bitcoin.stackexchange.com/a/57981The rev*.dat files (the \"undo files\"), contain all UTXOs spent by the inputs of a block. It was introduced in Bitcoin Core 0.8, and contains a concatenation of records, one for each block. This mimicks the structure of the blk*.dat files which contain blocks.Each block record consists of: 4 bytes: network magic (0xf9,0xbe,0xb4,0xd9) 4 bytes: size of the CBlockUndo record (LE32) data_size bytes: CBlockUndo record 32 bytes: double-SHA256 of the serialized CBlockUndo record[...]The block structure is explained here, by the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}