{
  "id": "topic_5433351",
  "title": "yahoo62278",
  "author": "yahoo62278",
  "created_time": "January 07, 2023, 10:43:34 AM",
  "content": "I've been messing around with plinko on a couple sites. My normal strategies are 14 lines low payout and 16 lines low payout. There are times I am dropping 200-400 $ balls so I get to wager alot, but seems like everytime I drop a big ball I hits a loss spot. You play 16 lines, there is only 1 bad spot and that's directly down the center for .5x money lost. I've seen that slot hit 5x in a row. So what's a better strategy?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433351",
  "comments": [
    {
      "author": "jackg",
      "created_time": "January 07, 2023, 05:41:33 PM",
      "body": "Not sure on the exact probabilities for plinko but I remember it being the most probable to hit the first few slots near the centre and then either the next set of slots or the set after that. I'd guess for a single high bet the best chance are to set the middle fairly high and then half way on either side to also be quite high but you might also be better off dropping multiple marbles on one bet instead that equals the wager amount (though that's probably less fun).The third slot from the centre seemed a fairly likely hit too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "January 07, 2023, 06:19:19 PM",
      "body": "There's a higher chance of it landing on the middle rows. Normal curve-based probability. I would suggest you focus more of your bets within the center, and then deviate a little here and there to cover a wider range. If you are shooting for a single bet high wager, however, this could still work but will not guarantee a win every time. So I would really suggest you drop multiple marbles instead of going all out on different bets, like what Jackg said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "January 07, 2023, 08:57:48 PM",
      "body": "Quote from: Casdinyard on January 07, 2023, 06:19:19 PMThere's a higher chance of it landing on the middle rows. Normal curve-based probability. I would suggest you focus more of your bets within the center, and then deviate a little here and there to cover a wider range. If you are shooting for a single bet high wager, however, this could still work but will not guarantee a win every time. So I would really suggest you drop multiple marbles instead of going all out on different bets, like what Jackg said. I'm not shipping all in bets but rather decent to large bets but when I do I seem to find a middle streak losing 500-1000$ on the run. In the long run I'm losing my ass and the rakeback or bonus that I earn is far from covering the losses. Overall, just need a general strategy thats not a huge loser and can wager large amounts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "January 07, 2023, 09:31:22 PM",
      "body": "^Just wanted to know where usually you will drop the chips.Because my strategy is that drop the chips 3-4 places from the center or could be in one position in the center alone, and then my observation the chip will go to the right or left side which has landed into the higher multipliers. But I won't take a serious drop on this kind of game because I know that the large percentage of odds that you get is less because it is based on luck game. However, if you wanted to know if there is an existing thread that talks about strategy in Plinko's last 2 years, this will probably help you. https://bitcointalk.org/index.php?topic=5324771.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "January 07, 2023, 09:40:07 PM",
      "body": "Quote from: yahoo62278 on January 07, 2023, 10:43:34 AMSo what's a better strategy?Dont know since plinko is purely based on luck but this YT vid might give some idea.https://www.youtube.com/watch?v=iA5F9b3u-RQHe had made out some alterations on low 10 to high 16 and spamming hell out of those 5bucks per ball.  Did decide to low 10 and he is just testing out and leave for 300 bets auto and do get some few bucks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcampaign",
      "created_time": "January 07, 2023, 10:13:22 PM",
      "body": "there is no special strategy, just dropping and hoping that luck will come using 16 lines, even using a small capital, I often get a number of 0.5x, the more I try, the more I lose my money there, since then I haven't tried the game again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "January 07, 2023, 10:29:42 PM",
      "body": "If the goal is high wagering then the best way to roll is tons of small bets, as you mention the x0.4 spot hits really often and doesn't worth going with big bets. The chance to hit that spot is close to 30% and 5 consecutive hits aren't really hard to see.My strategy for the long-term roll is in the high-risk line, 5k bets, and double up until it hit x999. The odds on that multiplier are 0.0034% so, in theory, you need close to 30k bets to hit it, and since not all the other 30k bets represent a loss then sometimes works fine for the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "January 07, 2023, 10:47:45 PM",
      "body": "Plinko is an interesting one, I think it resembles normal distribution and probability theory.   Its probably the case there are books literally written all about the maths behind this problem or game because the outcomes should be quite linear.  Obviously the central outcomes are most probable of all and the very outliers should only rarely happen comparatively.  Its also a common fairground game, I can remember it being an old game decades ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 07, 2023, 10:55:40 PMLast edit: January 08, 2023, 12:33:49 AM by Saint-loup",
      "body": "Quote from: yahoo62278 on January 07, 2023, 10:43:34 AMI've been messing around with plinko on a couple sites. My normal strategies are 14 lines low payout and 16 lines low payout. There are times I am dropping 200-400 $ balls so I get to wager alot, but seems like everytime I drop a big ball I hits a loss spot. You play 16 lines, there is only 1 bad spot and that's directly down the center for .5x money lost. I've seen that slot hit 5x in a row. So what's a better strategy?Probabilities are not distributed equally among all spots. Spots on the far right and left are less likely to be reached than the ones of the middle. So I think the better strategy is to write down the result of each draw of the plinko you are playing in order to evaluate the real probability of each spot to be reached. After that you could calculate the Expected Value of each spot by multiplying its probability with its winning payout.The Pascal's triangle shows how many paths can be taken to reach each spot.Results from some simulations give an idea of the probabilities to reach each spot of a common plinko.You can find more datas there :https://pressbooks.howardcc.edu/jrip3/chapter/so-you-want-to-win-plinko/https://medium.com/bitcoin-news-today-gambling-news/how-plinko-probabilities-odds-are-determined-55d414c75564",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 07, 2023, 11:50:44 PM",
      "body": "Quote from: yahoo62278 on January 07, 2023, 10:43:34 AMI've been messing around with plinko on a couple sites. My normal strategies are 14 lines low payout and 16 lines low payout. There are times I am dropping 200-400 $ balls so I get to wager alot, but seems like everytime I drop a big ball I hits a loss spot. You play 16 lines, there is only 1 bad spot and that's directly down the center for .5x money lost. I've seen that slot hit 5x in a row. So what's a better strategy?Strategy? Isn't that based on pure luck? And no matter the setup, winnings and losses are calculated so that casino wins in the end? I think that best strategy is a cliche, and it's not to play more you can lose.I personally just trust my luck and play all my budget with one big bet. It's not as lasting fun but payoff could be huge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "January 07, 2023, 11:58:37 PM",
      "body": "Quote from: o48o on January 07, 2023, 11:50:44 PMQuote from: yahoo62278 on January 07, 2023, 10:43:34 AMI've been messing around with plinko on a couple sites. My normal strategies are 14 lines low payout and 16 lines low payout. There are times I am dropping 200-400 $ balls so I get to wager alot, but seems like everytime I drop a big ball I hits a loss spot. You play 16 lines, there is only 1 bad spot and that's directly down the center for .5x money lost. I've seen that slot hit 5x in a row. So what's a better strategy?Strategy? Isn't that based on pure luck? And no matter the setup, winnings and losses are calculated so that casino wins in the end? I think that best strategy is a cliche, and it's not to play more you can lose.I personally just trust my luck and play all my budget with one big bet. It's not as lasting fun but payoff could be huge.Rather than strategy it is the luck that brings win. Whether it is sports betting or casino games, we'll have better winning probability if luck is in favour. I wasn't used to plinko, but with dice what I used to do is go for roll above 80 and below 20 for few consecutive rolls. Surely this wins and the same will let us make a small recovery of the loss during the session.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "January 08, 2023, 03:26:57 AM",
      "body": "While you are clear that it is an EV-game and that you seem to play for entertainment, you don't seem to be very clear about the variance. Quote from: yahoo62278 on January 07, 2023, 10:43:34 AMThere are times I am dropping 200-400 $ balls so I get to wager alot, but seems like everytime I drop a big ball I hits a loss spot. This is probably due to pure and simple variance, regardless of the strategy you use. Quote from: seleme on January 07, 2023, 09:40:24 PMThe average hitting ratio for 1000x is on every 32k drops but there are seeds that can go over 100k nonce without single 1000x. Quote from: seoincorporation on January 07, 2023, 10:29:42 PMMy strategy for the long-term roll is in the high-risk line, 5k bets, and double up until it hit x999. The odds on that multiplier are 0.0034% so, in theory, you need close to 30k bets to hit it, and since not all the other 30k bets represent a loss then sometimes works fine for the long run.Quote from: Saint-loup on January 07, 2023, 10:55:40 PMProbabilities are not distributed equally among all spots. Spots on the far right and left are less likely to be reached than the ones of the middle. So I think the better strategy is to write down the result of each draw of the plinko you are playing in order to evaluate the real probability of each spot to be reached.Good comments and analysis. What I don't see the logic of is getting into complicated calculations to play EV-, i.e. calculating the EV of losing money. Gamble for entertainment, yes. Be aware that it is a long term losing game, too. Now, studying and doing complicated calculations for plinkoI don't see it, for that I would do that study and those calculations in something that gives me profit, like some investment or bets with potential profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klidex",
      "created_time": "January 08, 2023, 09:19:28 AM",
      "body": "Quote from: KennyR on January 07, 2023, 11:58:37 PMQuote from: o48o on January 07, 2023, 11:50:44 PMQuote from: yahoo62278 on January 07, 2023, 10:43:34 AMI've been messing around with plinko on a couple sites. My normal strategies are 14 lines low payout and 16 lines low payout. There are times I am dropping 200-400 $ balls so I get to wager alot, but seems like everytime I drop a big ball I hits a loss spot. You play 16 lines, there is only 1 bad spot and that's directly down the center for .5x money lost. I've seen that slot hit 5x in a row. So what's a better strategy?Strategy? Isn't that based on pure luck? And no matter the setup, winnings and losses are calculated so that casino wins in the end? I think that best strategy is a cliche, and it's not to play more you can lose.I personally just trust my luck and play all my budget with one big bet. It's not as lasting fun but payoff could be huge.Rather than strategy it is the luck that brings win. Whether it is sports betting or casino games, we'll have better winning probability if luck is in favour. I wasn't used to plinko, but with dice what I used to do is go for roll above 80 and below 20 for few consecutive rolls. Surely this wins and the same will let us make a small recovery of the loss during the session.Indeed getting a win is luck, but if we use a strategy it will be possible to get that luck.Luck cannot be obtained by people* who only rely on faith and self-confidence. However, we can get my own luck by trying to minimize the percentage of defeats by continuing to use deep strategies and accurate analytical calculations.If strategy is just a substitute for luck, why do people who can get continuous wins in a game like poker just luck, even though the basis of the game of poker is ingenuity and intelligence in dealing with cards, so it is very different from the game of dice, which really only relies on luck without having to think hard while playing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheGreatPython",
      "created_time": "January 08, 2023, 05:29:02 PM",
      "body": "Quote from: KennyR on January 07, 2023, 11:58:37 PMQuote from: o48o on January 07, 2023, 11:50:44 PMStrategy? Isn't that based on pure luck? And no matter the setup, winnings and losses are calculated so that casino wins in the end? I think that best strategy is a cliche, and it's not to play more you can lose.I personally just trust my luck and play all my budget with one big bet. It's not as lasting fun but payoff could be huge.Rather than strategy it is the luck that brings win. Whether it is sports betting or casino games, we'll have better winning probability if luck is in favour. I wasn't used to plinko, but with dice what I used to do is go for roll above 80 and below 20 for few consecutive rolls. Surely this wins and the same will let us make a small recovery of the loss during the session.I know that plinko is based on luck but according to my observation, my luck on this game improved after a 2nd or 3rd deposit. It wasn't a consecutive deposit but I take a few hours of rest. My first deposit is usually smaller amounts but the 2nd or 3rd one is slightly bigger. I play on 16 lines high risk and I can get 1kx multiplier easily by applying the strategy that I formulated.In sports betting, you will have a better winning probability if you have a good knowledge in the sport that you are following even though your luck level sucks but I will still prefer plinko over it and over any other casino games because this is the only game that makes me enjoy or thrilled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "January 08, 2023, 06:01:18 PM",
      "body": "Quote from: klidex on January 08, 2023, 09:19:28 AMIndeed getting a win is luck, but if we use a strategy it will be possible to get that luck.Luck cannot be obtained by people* who only rely on faith and self-confidence. However, we can get my own luck by trying to minimize the percentage of defeats by continuing to use deep strategies and accurate analytical calculations.If strategy is just a substitute for luck, why do people who can get continuous wins in a game like poker just luck, even though the basis of the game of poker is ingenuity and intelligence in dealing with cards, so it is very different from the game of dice, which really only relies on luck without having to think hard while playingStrategy is not a substitute for luck and poker isn't based purely on luck, it's a setup of various skills like counting probabilities, choosing what hands to play and in live games, getting inside of your opponent's head. I was talking about in-house games like plinko.What i meant by pure luck is that implying that there's a winning strategy means that casino would had a flaw in their calculations. Game wouldn't be profitable to the casino if probability of every setup wasn't constantly work slighly for them. There's no strategy that affects the pre-programmed constant probabilities of the game. There's only \"luck\".Light reading:https://en.wikipedia.org/wiki/Impossibility_of_a_gambling_system",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "January 08, 2023, 06:12:06 PM",
      "body": "No matter how I look at it, Plinko's result is random, I do not think that there is a strategy on this but rather depends on the risk type we choose.  Watching the video link given by @stomachgrowl, it is obvious that setting the risk low and rows smaller gives the player more chance of at least breaking even in a longer session which is beneficial if we are aiming for Rakeback and other bonuses related to the wagering amount.I find this reply from the thread link given by @DoublerHunter worth noting.Quote from: adzino on March 18, 2021, 09:18:26 PMDon't go for strategies. You will lose everything. Plinko is a game where the outcome is dependent purely on your luck. Applying strategies won't help you to win anything. You have options to change your difficulty as far as I know. If you want to win something big, go for the \"hard\" difficulty. If you want to play safe, go for \"low\". Maybe try to make small amount of profit through low difficulty and then use your profit to score something big on the \"hard\" difficulty? Nonetheless, as soon as you make your profit, quit. If you keep on playing, you will lose everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "January 08, 2023, 07:03:11 PM",
      "body": "I remember some years ago i used to have a plinko bet simulator, the backup should be somewhere if you want i can search for it and put it back online. With it, you can simulate millions of bets and try to look for a strategy for the long run with different seeds. If you are interested just send me a PM and it could be back online for this week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "January 08, 2023, 07:08:57 PM",
      "body": "Quote from: Don Pedro Dinero on January 08, 2023, 03:26:57 AM[...]Quote from: Saint-loup on January 07, 2023, 10:55:40 PMProbabilities are not distributed equally among all spots. Spots on the far right and left are less likely to be reached than the ones of the middle. So I think the better strategy is to write down the result of each draw of the plinko you are playing in order to evaluate the real probability of each spot to be reached.Good comments and analysis. What I don't see the logic of is getting into complicated calculations to play EV-, i.e. calculating the EV of losing money. Gamble for entertainment, yes. Be aware that it is a long term losing game, too. Now, studying and doing complicated calculations for plinkoI don't see it, for that I would do that study and those calculations in something that gives me profit, like some investment or bets with potential profit.If you are playing a game while participating to a tournament or a promotion, you need to care about the EV, a little bit at least. Because if you don't want to chase a reward from a promotion or a prize from a tournament for nothing, or even worse than that, for an unavoidable loss, you need to evaluate what losses you are likely to get from this game for reaching the requirement of the said promotion or the target you are aiming for the tournament.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klidex",
      "created_time": "January 08, 2023, 07:43:38 PM",
      "body": "Quote from: o48o on January 08, 2023, 06:01:18 PMQuote from: klidex on January 08, 2023, 09:19:28 AMIndeed getting a win is luck, but if we use a strategy it will be possible to get that luck.Luck cannot be obtained by people* who only rely on faith and self-confidence. However, we can get my own luck by trying to minimize the percentage of defeats by continuing to use deep strategies and accurate analytical calculations.If strategy is just a substitute for luck, why do people who can get continuous wins in a game like poker just luck, even though the basis of the game of poker is ingenuity and intelligence in dealing with cards, so it is very different from the game of dice, which really only relies on luck without having to think hard while playingStrategy is not a substitute for luck and poker isn't based purely on luck, it's a setup of various skills like counting probabilities, choosing what hands to play and in live games, getting inside of your opponent's head. I was talking about in-house games like plinko.What i meant by pure luck is that implying that there's a winning strategy means that casino would had a flaw in their calculations. Game wouldn't be profitable to the casino if probability of every setup wasn't constantly work slighly for them. There's no strategy that affects the pre-programmed constant probabilities of the game. There's only \"luck\".Light reading:https://en.wikipedia.org/wiki/Impossibility_of_a_gambling_systemIt is true that the games provided in the casino have been programmed and in the end only the casino wins and the gamblers lose. Winning in casino games is just luck and I confirm that.However, there is a strategy that can be used in betting on casino games, this strategy is that we can see and analyze and calculate for ourselves in several game settlements. If we have got the right position, then we can bet and it is possible to get a win.From my previous opinion, I just explained that luck is not a strategy and luck in betting can be obtained by using the right strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}