{
  "id": "topic_5467387",
  "title": "Mia Chloe",
  "author": "Mia Chloe",
  "created_time": "September 19, 2023, 10:09:50 PM",
  "content": "I did some research on Bitcoin transaction but I wasn't too clear on some things.Bitcoin transaction fees are the rewards miners get when they verify transactions therefore the bigger the transaction fees the more inclined miners would  be to verify the block.Does this mean that if two  Bitcoin transactions are carried out simultaneously, the transaction with larger block chargess would likely be validated before that of lower transaction fees?Also aside from network congestion which can be avoided by transacting when the network is less populated and transaction size , how does block space demand affect transaction fees?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467387",
  "comments": [
    {
      "author": "Z-tight",
      "created_time": "September 19, 2023, 11:19:16 PM",
      "body": "Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMI did some research on Bitcoin transaction but I wasn't too clear on some things.Bitcoin transaction fees are the rewards miners get when they verify transactions therefore the bigger the transaction fees the more inclined miners would  be to verify the block.Does this mean that if two  Bitcoin transactions are carried out simultaneously, the transaction with larger block chargess would likely be validated before that of lower transaction fees?Take note that validation is for nodes, while confirmation of tx's is for the miners. Miners can choose to include any tx in their block that they are trying to mine, but they are incentivized to first include tx's that pay the higher fees because it earns them more rewards should they find the block. That's why it is recommended to check https://mempool.space/ before making your tx, so you choose a suitable fee. I don't know if i've answered your question, so i'll like to add this; tx's aren't mined individually, but in blocks that can contain over 2000 tx's, and once a block is found, all tx's in it becomes comfirmed, now take note that all the tx's wouldn't have exactly the same fees attached to them, but fees that the miner considers suitable irrespective of when the tx was made.Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMAlso aside from network congestion which can be avoided by transacting when the network is less populated and transaction size , how does block space demand affect transaction fees?The address that you use affects the tx fees as well, SegWit transactions for example are cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "September 20, 2023, 12:39:03 AM",
      "body": "Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMBitcoin transactions are carried out simultaneously, the transaction with larger block chargess would likely be validated before that of lower transaction fees?Every time you make a transaction that isy correctly signed and broadcasted to the network, Bitcoin nodes will verify it and include it in the mempool. When it comes to getting your transaction confirmed, the ones with a higher fee per byte will catch the miners' attention and make it into the block before the ones with lower fees. Miners typically favor transactions with higher fees as it increases their mining profits.Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMAlso aside from network congestion which can be avoided by transacting when the network is less populated and transaction size , how does block space demand affect transaction fees?Block space is limited, so if, for example, there are thousands of transactions in the mempool that pay 20 sat/vB, you will have to offer a higher fee for your transaction to be included in the block ahead of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "September 20, 2023, 01:34:44 AM",
      "body": "Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMBitcoin transaction fees are the rewards miners get when they verify transactions therefore the bigger the transaction fees the more inclined miners would  be to verify the block.Miners confirm transactions, find Bitcoin blocks with their computational power from ASICs. Bitcoin nodes validate blocks, pass it to other nodes add them to the Bitcoin public ledger. Bitcoin nodes keep copies of transaction information, blocks and the blockchain.https://learnmeabitcoin.com/beginners/nodes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "September 20, 2023, 02:30:08 AM",
      "body": "Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMBitcoin transaction fees are the rewards miners get when they verify transactions therefore the bigger the transaction fees the more inclined miners would  be to verify the block.Does this mean that if two  Bitcoin transactions are carried out simultaneously, the transaction with larger block chargess would likely be validated before that of lower transaction fees?Also aside from network congestion which can be avoided by transacting when the network is less populated and transaction size , how does block space demand affect transaction fees? Op you have said it all, in your first paragraph. Mining is the solving of mathematical problem in the blockchain and the transaction with the highest fee is always mine first before the other ones. But if the two transactions fees are very close then after the first one the other will be mine but the fees have very big margin then you have to want for some minutes for the first highest fees to be mine. As others as said the input address can also cause the transaction fee that be high. And the congestion is caused by the surplus demand in the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 20, 2023, 03:55:40 AM",
      "body": "The validation is used for nodes, while the word confirmed is used for transactions. Miners will always add transactions with high fee in their block so as to get a higher profit, when it is confirmed. This is why it is important that you use a wallet that supports RBF and CPFP, like electrum wallet. Here is a guide by 1miau on how to go about with your transactions for a low fee.Make sure you avoid wasting BTC for too high fee",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 20, 2023, 04:20:30 AM",
      "body": "Even if the network is empty and there are no pending transaction, it’s hard to predict when your transaction will confirm.Sure the average is 10 minutes but sometimes it can take up to 40 minutes and other times it can take less than 5 minutes. This is where ETH is better because if you pay enough in fees you know it will confirm within 1 minute for sure. With bitcoin you never know. Could take even an hour if the variance is bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 20, 2023, 05:22:35 AM",
      "body": "Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMBitcoin transaction fees are the rewards miners get when they verify transactionsThis is the part you have misunderstood.The transaction fees are paid to purchase a portion of the finite space in a bitcoin block. So when your transaction size (meaning in bytes not in value) is bigger you need to purchase a bigger portion of the block size which means paying a higher fee.Similarly when there are more \"demand\" for that finite space than there is space, a competition is formed and people start \"outbidding\" each other hence the fees go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 20, 2023, 09:24:45 AM",
      "body": "Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMDoes this mean that if two  Bitcoin transactions are carried out simultaneously, the transaction with larger block chargess would likely be validated before that of lower transaction fees?The time a transaction has been broadcasted doesn't matter at all. All matters to mines in the fee rate, so that they maximize their profit. The transaction paying higher fee rate has bigger chance to be included in the blockchain even if the transaction paying lower fee rate has been made much earlier. Miners prioritize transactions based on their fee rate and don't pay any attention to the time they have entered the mempool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "September 20, 2023, 09:36:01 AM",
      "body": "Quote from: Sim_card on September 20, 2023, 03:55:40 AMThis is why it is important that you use a wallet that supports RBF and CPFP, like electrum wallet.You will probably only need Rbf and cpfp if you paid a low fee initially and you now need to bump the fee because your tx is stuck, if you broadcast your tx with any wallet, using a suitable fee, you can be sure it will be confirmed. But wallets that don't support features like Rbf are usually not recommended.Quote from: Agbe on September 20, 2023, 02:30:08 AMBut if the two transactions fees are very close then after the first one the other will be mine but the fees have very big margin then you have to want for some minutes for the first highest fees to be mine.Tx's are confirmed in blocks that usually contains thousands of tx's, and they are not mined based on the time they were made. Your tx can be purged out of the mempool or stuck for weeks and later dropped out of the mempool of most nodes if you use a very low tx fee, so there is no assurance that your tx will be confirmed if the fee attached is very low and you don't use rbf.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "September 20, 2023, 12:32:19 PM",
      "body": "Quote from: Z-tight on September 19, 2023, 11:19:16 PMQuote from: Mia Chloe on September 19, 2023, 10:09:50 PMI did some research on Bitcoin transaction but I wasn't too clear on some things.Bitcoin transaction fees are the rewards miners get when they verify transactions therefore the bigger the transaction fees the more inclined miners would  be to verify the block.Does this mean that if two  Bitcoin transactions are carried out simultaneously, the transaction with larger block chargess would likely be validated before that of lower transaction fees?Take note that validation is for nodes, while confirmation of tx's is for the miners. Miners can choose to include any tx in their block that they are trying to mine, but they are incentivized to first include tx's that pay the higher fees because it earns them more rewards should they find the block. That's why it is recommended to check https://mempool.space/ before making your tx, so you choose a suitable fee. I don't know if i've answered your question, so i'll like to add this; tx's aren't mined individually, but in blocks that can contain over 2000 tx's, and once a block is found, all tx's in it becomes comfirmed, now take note that all the tx's wouldn't have exactly the same fees attached to them, but fees that the miner considers suitable irrespective of when the tx was made.Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMAlso aside from network congestion which can be avoided by transacting when the network is less populated and transaction size , how does block space demand affect transaction fees?The address that you use affects the tx fees as well, SegWit transactions for example are cheaper.I will definitely do some research about memepool and I will also read on segwit transactions so I can understand this transaction process properly",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "September 20, 2023, 02:04:34 PM",
      "body": "Yes, miners receive compensation from Bitcoin transaction fees. The reason is quite obvious: miners are motivated by financial gain. They do not operate a nonprofit. If you're not willing to pay a higher fee, why should they prioritize your transaction? And YES, The transaction with the larger fee is picked up first if two transactions happen at the same time. Its just economics.Imagine a crowded parking lot to understand the need for block space. If theres only one spot left, wouldnt you pay a bit more to get it for yourself? Transaction fees rise in direct proportion to the increased demand for block space. People will pay extra to get their transactions through when there is competition for limited space.You want in? Pay up. You want clarity? Dive deeper",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 20, 2023, 04:09:10 PMLast edit: September 20, 2023, 04:43:40 PM by hosseinimr93",
      "body": "Quote from: Mia Chloe on September 20, 2023, 12:32:19 PMI will definitely do some research about memepool and I will also read on segwit transactions so I can understand this transaction process properly Take note that mempool is like a waiting room which nodes keep unconfirmed transactions there. Mempool.space which was suggested above is a service that you can use for fee estimation. Mempool.space is also a block explorer. Segwit refers to addresses starting with bc1 or 3*.With using segwit addresses, you can pay less fee. Addresses starting with bc1 are called native segwit and addresses starting with 3 are called nested segwit. It may worth mentioning that with using native segwit addresses and nested segwit addresses, you can decrease the transaction fee up to 53% and 38% respectively. *Not all addresses that start with 3 are segwit. Quote from: Blitzboy on September 20, 2023, 02:04:34 PMAnd YES, The transaction with the larger fee is picked up first if two transactions happen at the same time. Its just economics.To be more accurate:The transaction with higher fee rate will be confirmed faster, even if the the transaction with lower fee rate has been broadcasted earlier.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "September 20, 2023, 05:59:25 PM",
      "body": "Quote from: hosseinimr93 on September 20, 2023, 04:09:10 PMQuote from: Mia Chloe on September 20, 2023, 12:32:19 PMI will definitely do some research about memepool and I will also read on segwit transactions so I can understand this transaction process properly Take note that mempool is like a waiting room which nodes keep unconfirmed transactions there. Mempool.space which was suggested above is a service that you can use for fee estimation. Mempool.space is also a block explorer. Meme Pool is the waiting room, but sir I think here manipulation comes more handy as money talks, the transaction with the higher fees paid is processed faster haha it's weird   haha, even the Bitcoin network supports Richers (Just Kiding).Quote from: hosseinimr93 on September 20, 2023, 04:09:10 PM*Not all addresses that start with 3 are segwit. Hmm, so Sir I think the better approach is to verify the address type using the Blockchain Explorer, by decoding the address the results can be contained but some people find it difficult so better to go with the Blockchain Explorer where easily the address type can be verified.Most of the time we don't verify the address type as we used to refer to it with the initials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "September 20, 2023, 06:12:27 PM",
      "body": "Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMDoes this mean that if two  Bitcoin transactions are carried out simultaneously, the transaction with larger block chargess would likely be validated before that of lower transaction fees?Validation and confirmation are different, so what miners do is confirmation and that is what you are talking about as well so let's leave the validation part here.Miners can pick a transaction even with a lower fee over a higher fee transaction but rationally they are going to pick the TXs which will incentivize them more which means the higher the TX fee the TX will be confirmed sooner.But TXs are confirmed in blocks so it can contain TX with 200sat/vbyte as well as 20sat/vbyte still the TX will get confirmed at the same time. So it depends on which block the TX is included in and when they are mined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 20, 2023, 06:23:57 PM",
      "body": "Quote from: Hamza2424 on September 20, 2023, 05:59:25 PMHmm, so Sir I think the better approach is to verify the address type using the Blockchain Explorer, by decoding the address the results can be contained but some people find it difficult so better to go with the Blockchain Explorer where easily the address type can be verified.This doesn't always work. You can know the type of an address starting with 3 with decoding a transaction made from that. If there's no outgoing transaction from the address starting from 3, there is no way to know the address type and block explorers can't display such information about the address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "September 20, 2023, 06:51:03 PM",
      "body": "Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMI did some research on Bitcoin transaction but I wasn't too clear on some things.Bitcoin transaction fees are the rewards miners get when they verify transactions therefore the bigger the transaction fees the more inclined miners would  be to verify the block.Does this mean that if two  Bitcoin transactions are carried out simultaneously, the transaction with larger block chargess would likely be validated before that of lower transaction fees?Also aside from network congestion which can be avoided by transacting when the network is less populated and transaction size , how does block space demand affect transaction fees?A perfect example of miner tending to chose transaction with higher fee will be the time that the mempool was congested with lots of transaction due to the short hype of the pepe and meme coins that was included to the Bitcoin Blockchain and these transactions at that time tend to carry a huge significant amount of fee added which was what made the cost of any transaction to flip to a very high price and miner will definitely tend to mine transaction with such fees than that with lower fee and my one question also is why wasn't there any alternative to reduce the fee rate at that period apart from using the Bitcoin lightening network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 28, 2023, 08:25:01 PM",
      "body": "Quote from: Mia Chloe on September 19, 2023, 10:09:50 PMI did some research on Bitcoin transaction but I wasn't too clear on some things.Bitcoin transaction fees are the rewards miners get when they verify transactions therefore the bigger the transaction fees the more inclined miners would  be to verify the block.Does this mean that if two  Bitcoin transactions are carried out simultaneously, the transaction with larger block chargess would likely be validated before that of lower transaction fees?Also aside from network congestion which can be avoided by transacting when the network is less populated and transaction size , how does block space demand affect transaction fees?There are complex algorithms of transaction queuing, some transactions can  be verified faster than the others because of miners' preference... But in general the principle is \" the higher the fees the faster the tranaction\". Network congestion is a tough problem, since there are still not enough mining facilities in the world, and this makes adoption progress impossible, at least at this level of mining power...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}