{
  "id": "topic_5448426",
  "title": "sashapan",
  "author": "sashapan",
  "created_time": "April 11, 2023, 04:37:52 PM",
  "content": "Have you experienced tilt over the long game?  How have you dealt with it?  How do you think you can gamble with a cool head, and how do you make yourself a good brake inside)   And why do people in general like to gamble?   I never thought I would enjoy gambling) I remember playing cards for change with my cousin as a child, it was very funny when she lost, fell on the table and shouted that it was all mine)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448426",
  "comments": [
    {
      "author": "mu_enrico",
      "created_time": "April 11, 2023, 04:53:06 PM",
      "body": "I'd say \"tilting\" when you lose motivation, laying back, and only playing for the sake of emptying your balance is quite common, especially in slots, since you don't need to think when playing. It doesn't affect anything since it's purely luck-based games anyway, contrary to skill-involving games in which tilting can affect your performance. But still, this situation isn't good for gaming in general when the fun is a crucial part of the activity. So, when I lose the fun feeling while playing, it's an alarm to stop/pause and then resume after different activities. But even though we know the theory or the ideal way of playing, it's still extremely hard to stay discipline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "April 11, 2023, 05:00:53 PM",
      "body": "It sometimes happen to me when in dice and gotten the losing streaks where I would just want to stop playing and just hit the Max button next to 2x and leave when i lost it all.  They must have deliberately put that Max button beside the 2x for the impatient gamblers. After playing to clean out the funds in my account, I actually regret. And in the next few days, I came back again to play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "April 11, 2023, 05:13:23 PM",
      "body": "Tilt in gambling is a common thing. I reckon a couple of newbies and even a number of veteran gamblers in this forum fall victim to this type of mentality. I myself have been tilted a couple of times in the past leading me to keep chasing wins, which if I didn't realize a little early on, could've lead me to becoming addicted to gambling. So how do you avoid tilt? You can't. With videogames it's easy to avoid tilt, a proper mindset, a cheerful attitude, you're good to go. In gambling, that's not the case, money is involved so whether you're playing for entertainment or you're playing for money it doesn't matter, you'll find yourself getting tilted especially after consistent losses. But how do you stop it? I found that deep breaths when I feel that vein finally popping up my temple really helps with reorganizing my emotions and collecting my thoughts. You should give it a try too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sashapan",
      "created_time": "April 11, 2023, 05:25:39 PM",
      "body": "Quote from: Casdinyard on April 11, 2023, 05:13:23 PMTilt in gambling is a common thing. I reckon a couple of newbies and even a number of veteran gamblers in this forum fall victim to this type of mentality. I myself have been tilted a couple of times in the past leading me to keep chasing wins, which if I didn't realize a little early on, could've lead me to becoming addicted to gambling. So how do you avoid tilt? You can't. With videogames it's easy to avoid tilt, a proper mindset, a cheerful attitude, you're good to go. In gambling, that's not the case, money is involved so whether you're playing for entertainment or you're playing for money it doesn't matter, you'll find yourself getting tilted especially after consistent losses. But how do you stop it? I found that deep breaths when I feel that vein finally popping up my temple really helps with reorganizing my emotions and collecting my thoughts. You should give it a try too.  It's not enough to breathe in and out, you have to walk in the park for three hours in the fresh air I think that's better",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "April 11, 2023, 05:34:46 PM",
      "body": "Quote from: sashapan on April 11, 2023, 04:37:52 PMHave you experienced tilt over the long game?  How have you dealt with it?  How do you think you can gamble with a cool head, and how do you make yourself a good brake inside)   Tilting in gambling is a very common thing but the mental frustration and emotional confusion displayed varies amongst gamblers. Gambling with a cool head first starts with a gambler defining why the choose to gamble and what kind of benefit the choose to gain from gambling. If the gamble is for fun it will be more easier to keep a cool head. But if the money is the principal motive then aggressiveness is inevitable which will certainly result in more losses..QuoteAnd why do people in general like to gamble?   I never thought I would enjoy gambling) I remember playing cards for change with my cousin as a child, it was very funny when she lost, fell on the table and shouted that it was all mine)  Everyone is a gambler in one way or the other either consciously or unconsciously, the only difference is when it becomes pronounced. Every pronounced gambler got involved by different means. I can recall when i placed my first bet on my favourite team and lost it was all fun because i already counted the amount as lost token. That didn't stop me from going back",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "April 11, 2023, 05:42:45 PM",
      "body": "if you play consciously, taking into account the risks and opportunities, you cannot go tilt... in general, a tilt can happen but it is never a \"positive\" event because it is a sign of stress, of incorrect planning.. in short, it is a sort of \"alarm bell\" that must make us reflect on gambling activities",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "April 11, 2023, 05:45:13 PM",
      "body": "Quote from: sashapan on April 11, 2023, 04:37:52 PMHave you experienced tilt over the long game?  How have you dealt with it?  How do you think you can gamble with a cool head, and how do you make yourself a good brake inside)   And why do people in general like to gamble?   I never thought I would enjoy gambling) I remember playing cards for change with my cousin as a child, it was very funny when she lost, fell on the table and shouted that it was all mine)  It is difficult to behave cold headed when you are losing in slot machines for example as in sport betting is somewhat easy as you have time for an event to finish while you are thinking your next bet.In slots is different and the reason why people do gamble in general is simple,they want to make a big win,hit the jackpot or a huge payout.What they don't know is that they will almost never hit a jackpot or a maximum payout and that is why a lot of people start behaving not naturally and keep depositing more money to chase the loses which itself brings even more loses.I have dealt with it by stop playing slot machines and only playing on sport betting and this helps me keep a cool head,I never feel the same sadness when I lose at sport betting than the one which is really the worse feeling when you lose it all on slot machines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "April 11, 2023, 05:52:45 PM",
      "body": "Quote from: sashapan on April 11, 2023, 04:37:52 PMHave you experienced tilt over the long game?  How have you dealt with it?  That's pretty normal to be tilted when we do something that we're passionate about and the result isn't in our favor. Dealing with it is not easy for many because it's an attitude that you cannot control if you're not used to it. But when it does happen to me, I deep breath and drink some water and that's it.Quote from: sashapan on April 11, 2023, 04:37:52 PMHow do you think you can gamble with a cool head, and how do you make yourself a good brake inside)   Before gambling, you need to set yourself that you'll not be hot headed because it won't give you good luck. Quote from: sashapan on April 11, 2023, 04:37:52 PMAnd why do people in general like to gamble? ?Profit for everyone, entertainment, to enjoy and have fun but there goes those that have been staying in gambling as their bread and butter.Quote from: sashapan on April 11, 2023, 04:37:52 PMI never thought I would enjoy gambling) I remember playing cards for change with my cousin as a child, it was very funny when she lost, fell on the table and shouted that it was all mine)  Kids shouldn't gamble but how old were you guys during that time?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "April 11, 2023, 05:58:28 PM",
      "body": "I think every gambler has experienced this at one point, of course we always want to be in control of our emotions, but during long runs of playing, sooner or later you are going to tilt. The best way to deal with it is just to stop, and take a break easy as that.Not just in games like poker, but even if you do sports betting, you are also going to experienced it. You become reckless, out of control and out of the norm you bet on teams or look for great odds. But at the back of your mind, you know that is is the worst teams to bet. So again, if you have this sign, it's not good to continue gambling as you are obviously going to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "April 11, 2023, 06:16:41 PM",
      "body": "I always gamble using the right mindset as a brake for myself and gambling with a cool head, of course, will make us always be calm and responsible. Sometimes people like to gamble because they want to get a lot of money from the gambling table. but the fact is it's hard to get even almost impossible.We all know that there are many gamblers who chase big wins and in the end they continue to chase after losing a lot of money until they become addicts. They don't even really enjoy gambling, they are just obsessed with getting the lost money back, just like your cousin who whines asking for his money back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "April 11, 2023, 06:22:09 PM",
      "body": "Quote from: bitbollo on April 11, 2023, 05:42:45 PMif you play consciously, taking into account the risks and opportunities, you cannot go tilt... in general, a tilt can happen but it is never a \"positive\" event because it is a sign of stress, of incorrect planning.. in short, it is a sort of \"alarm bell\" that must make us reflect on gambling activitiesI think almost all gamers experience tilt because sometimes other external factors can contribute to this condition. One might have had a stressful day at work instead of resting he could decide to engage in gambling. The work stress might make him overreact if his loss is consistent. Family problems might also contribute to tilting. That's why it is important to be in a good frame of mind before gambling because it could have some negative consequences. Gamblers should always bear in mind that tomorrow might be a good day so we have to accept and bear today's losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "April 11, 2023, 06:30:37 PM",
      "body": "Quote from: sashapan on April 11, 2023, 04:37:52 PMHave you experienced tilt over the long game?  How have you dealt with it?  How do you think you can gamble with a cool head, and how do you make yourself a good brake inside)  This has happened to me many times while gambling, and it is not unusual for it to happen, and no one will feel good when their money is going in front of their eyes. But I think in order to control it, we should gamble with the mindset that the money I invest may not come back.QuoteAnd why do people in general like to gamble? I think it completely varies from person to person what they gamble for, maybe some people do it to get excitement, some people consider gambling as a game and there are also many people who do gambling from their greedyness to make some money++ , and It may also be that gambling is done to get away from loneliness and peace of mindQuoteI remember playing cards for change with my cousin as a child, it was very funny when she lost, fell on the table and shouted that it was all mine)  Lol , It was funny attitude, maybe it because of you are doing gamble when you were child. As a child it is better to stay away from these dangerous games where your pocket money will fly away",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 11, 2023, 06:41:02 PM",
      "body": "Only happened to me once while rolling dices on Stake, I had a small budget and decided administer the money carefully, so I could extend the session for at least 1 hour or so.I ended up having several consecutive losses and just felt a bit burned out and decided to end earlier in that occasion, I basically logged out after 10 mins because of that bad luck streak, not my luckiest day, considering the previous time I did better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "April 11, 2023, 07:04:42 PM",
      "body": "It seems to me that almost every gambler loses his temper from time to time during gambling. In my opinion only negative experiences (big losses) make you think about changing your behavior, and in fact we can say that only a small part of gamblers can learn to fully control their emotions and therefore stop tilt. Unfortunately I still have not learned how to fully control my emotions both in trading and gambling, but I have progress compared to a few years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "April 11, 2023, 07:08:32 PM",
      "body": "Quote from: sashapan on April 11, 2023, 04:37:52 PMHave you experienced tilt over the long game?  How have you dealt with it?  How do you think you can gamble with a cool head, and how do you make yourself a good brake inside)   And why do people in general like to gamble?   I never thought I would enjoy gambling) I remember playing cards for change with my cousin as a child, it was very funny when she lost, fell on the table and shouted that it was all mine)  I definitely experience tilt when playing poker because it requires such intense concentration over a long period of time, or at least in the way that I played it. Others have probably mastered a more peaceful strategy, but for me it felt inevitable - you want to keep scraping out a profit, but then you get bored after a few hours of no profit play, make a few bluffs or bad calls and suddenly lose a massive part of your bankroll. Online play is very difficult for me, because you have to be razor sharp all the time as pros and fish move around the tables. It's possible to master given enough time but you need to have more patience than people who might be earning good at $3 an hour in comparison to others in their country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "April 11, 2023, 07:27:38 PM",
      "body": "Quote from: sashapan on April 11, 2023, 05:25:39 PMQuote from: Casdinyard on April 11, 2023, 05:13:23 PMTilt in gambling is a common thing. I reckon a couple of newbies and even a number of veteran gamblers in this forum fall victim to this type of mentality. I myself have been tilted a couple of times in the past leading me to keep chasing wins, which if I didn't realize a little early on, could've lead me to becoming addicted to gambling. So how do you avoid tilt? You can't. With videogames it's easy to avoid tilt, a proper mindset, a cheerful attitude, you're good to go. In gambling, that's not the case, money is involved so whether you're playing for entertainment or you're playing for money it doesn't matter, you'll find yourself getting tilted especially after consistent losses. But how do you stop it? I found that deep breaths when I feel that vein finally popping up my temple really helps with reorganizing my emotions and collecting my thoughts. You should give it a try too.  It's not enough to breathe in and out, you have to walk in the park for three hours in the fresh air I think that's better Correct, that's what I will do, walk for hours, just try to clear my mind specially if I made a bad bet because I no longer have control of my emotions. So it's really hard for gamblers to control our thoughts, our decision are clouded when we have experienced this phenomena of tilting. Hard to overcome, even if you are experienced gambler and you thought that you know what you are doing, there will be times that you lost control.So just take a stroll, breathe and don't come back in gambling. You need to clear your mind first before you make another bet. Or better, just stay away from it for several days and see how it goes for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "April 11, 2023, 07:38:40 PM",
      "body": "If you are a very competitive person who can't accept taunts from other people it can be really hard to keep calm in gambling, especially in PvP games, but you have to train your mental skills to cool down your emotions when you feel enraged by a loss or provocation, otherwise I fear that is not the kind of activity you can get involved with, for your own good. When we are younger, more exactly during the childhood, it's more common to face such \"tilting\" issues, but normally we tend to evolve on this aspect within time, as we grow older, wiser and more experient.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "April 11, 2023, 07:47:21 PM",
      "body": "Quote from: uneng on April 11, 2023, 07:38:40 PM^Yes, if only wisdom could protect against gambling addiction. Most gamblers who cannot control their emotions have a gambling addiction of one degree or another and as real life shows even a gray-haired sage can lose all his money in a casino and then come back to win back his past losses and lose again. So I wouldn't get my hopes up too much for age, wisdom and experience. It's all very individual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "April 11, 2023, 08:37:27 PM",
      "body": "I have become a victim to tilt way back,it is when you are impatient and start chasing your lost,before you know it your account is bankrupt. Self-control is all it takes to avoid been trapped, when you are losing straight ten games or more,it a sign that you should take a break from gambling at that moment and try again later.Setting a budget for your gambling activities can also help you to stay safe from this. Addiction can make a gambler empty his account, that is why as a gambler,I prevent any gambling practice that will lead me to addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}