{
  "id": "topic_5465532",
  "title": "TomekBTCPolska",
  "author": "TomekBTCPolska",
  "created_time": "September 03, 2023, 05:32:21 PM",
  "content": "Hello, my name is Tomek, and I'm from Poland.Since 2016, I've been deeply involved in the cryptocurrency industry. It's time for a significant change and the pursuit of a long-term endeavor. Over the past years, I've worked with exchanges, influencers (YouTube), ICO projects, and a massive startup, sorare.com. This period has allowed me to accumulate substantial experience in marketing, brand building, negotiations, and advisory roles in critical development aspects. I have an in-depth understanding of the cryptocurrency market, knowing what to avoid, which mistakes to steer clear of, and which services not to use, ensuring that your project doesn't waste funds and time.I am currently on the lookout for a project where I can fully commit, utilizing my knowledge and connections. I aim to assist in breaking through to influential individuals, building a high-quality community, attracting investors, and ultimately securing favorable listings on noteworthy exchanges.I am open to discussions with individuals interested in collaboration. You can reach me on Telegram at @cryptomarketingPolandBest regards,TomekBTC",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465532",
  "comments": [
    {
      "author": "robelneo",
      "created_time": "September 03, 2023, 10:52:30 PMLast edit: September 03, 2023, 11:23:05 PM by robelneo",
      "body": "That's an awesome resume but we and your potential client want more proof to back up your claim, Telegram cannot provide anything it's just a means of communication.It is better to post your LinkedIn profile, X/Twitter handle, Facebook pages your own website to back up your claim if you have these,  you don't have to look for partners, they will come looking for you, based on your claim you are well qualified until you can't prove it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TomekBTCPolska",
      "created_time": "September 04, 2023, 09:55:53 AM",
      "body": "Quote from: robelneo on September 03, 2023, 10:52:30 PMThat's an awesome resume but we and your potential client want more proof to back up your claim, Telegram cannot provide anything it's just a means of communication.It is better to post your LinkedIn profile, X/Twitter handle, Facebook pages your own website to back up your claim if you have these,  you don't have to look for partners, they will come looking for you, based on your claim you are well qualified until you can't prove it.Of course I understand, I have LinkedIn and would be happy to share the link on Telegram with the person interested  It will be very easy for the interested person to verify this by contacting me on LinkedIn as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "September 04, 2023, 01:03:11 PM",
      "body": "If your target market is this forum, I suggest you create a resume by starting your own thread and including all the necessary information.You can list your desired job and the previous jobs you've held. This way, it will be easier for potential employers to check if your services align with what they're looking for. While it's good to provide your Telegram account, having information readily available for them to read can increase the likelihood of getting hired once they message you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TomekBTCPolska",
      "created_time": "September 04, 2023, 05:06:36 PM",
      "body": "Quote from: stadus on September 04, 2023, 01:03:11 PMIf your target market is this forum, I suggest you create a resume by starting your own thread and including all the necessary information.You can list your desired job and the previous jobs you've held. This way, it will be easier for potential employers to check if your services align with what they're looking for. While it's good to provide your Telegram account, having information readily available for them to read can increase the likelihood of getting hired once they message you.Such a forum is something new for me, that's why this post looks like this, I wanted to include the most important information so that the content would not be long and boring. Of course, I have no problem contacting interested people on LinkedIn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "September 04, 2023, 11:53:40 PM",
      "body": "You have mentioned the good types of skills and experience you have. But it is only by told by you. There is no proof whether you have done it or not and/or you can do it or not. So, it will be out of doubt if you can post a reference of your work I mean portfolio on the OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "September 05, 2023, 01:10:27 AM",
      "body": "OP, you got a good article here but to make it unique,you must or should know that this platform mostly prefer evidence and facts backing up your claims than all these write ups. Just as the other poster had said, if you feel you have achieved enough and would find it pleasant working here with projects In need of your services, I think it would be in your own interests to make available your details for easy assessments by your prospective clients because not everyone will contact you when they have no seen anything convincing to their eyes and mind. Something should speak for your experience and how far you have gone as claimed by you.Another thing I would like to call your attention to is the regular act of contacting through telegram. Most often, scammers use that pattern because telegram is a platform that can take lots of activities both the good and the bad and mostly records of nefarious act had been recorded on telegram platform so therefore do you not think it would be odd you telling your prospective clients to visit or chat you up via telegram?  As a matter of fact making your conversation here would call for transparency and credibility irrespective of how long you have stayed here. So I would advise you continue your conversations here.Your work profile should speak for you here why not just make it available here for all to see and confirm your true stand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 05, 2023, 07:26:25 AM",
      "body": "With the experiences you mentioned, you are good in marketing and you know that the most important step in marketing is to present yourself well. Some of the above suggested that you add links to LinkedIn profile, X/Twitter handle, Facebook pages in order to prove that you have previous experience and that you are involved in the field since 2016. They are good steps to share publicly. Reformatting this topic will be necessary to prove that you have experience as well as links to previous projects or influencers you have worked with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}