{
  "id": "topic_5401984",
  "title": "Michael63",
  "author": "Michael63",
  "created_time": "June 09, 2022, 06:30:42 PMLast edit: June 13, 2022, 03:31:05 PM by Michael63",
  "content": "I was added to a Telegram group that claims they're into Binance smart contract arbitrage. I realized that it is a scam from the way several accounts shill the project and the fact that the site isn't Binance's in fact, it was registered weeks ago according to Whois. However, I've not been able to figure out the details of the scam. What's obvious is that the smart contract address has nothing to do with Binance. Here is the pinned message. If you understand what these guys are doing, could you explain it? 💶💶💶",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401984",
  "comments": [
    {
      "author": "ScamViruS",
      "created_time": "June 09, 2022, 07:52:54 PM",
      "body": "They made the announcement in a way that would be very confusing for a new crypto user. They created a fake website, which they tried to show as a smart contract website. And added a bnb address to that website that promises to return a percentage profit if you send funds. So they are trying to scam it in a very different way.Website: Code:https://binance-smart-contracts.us/binance-launches-new-smart-contracts/QuoteDomain Name: binance-smart-contracts.usRegistry Domain ID: DA806912CCA7F4018806D18B93690B9EF-GDREGRegistrar WHOIS Server: whois.namesilo.comRegistrar URL: www.namesilo.comUpdated Date: 2022-06-01T08:51:11ZCreation Date: 2022-05-27T08:51:10ZRegistry Expiry Date: 2023-05-27T08:51:10ZRegistrar: NameSilo, LLCRegistrar IANA ID: 1479Registrar Abuse Contact Email: email@namesilo.comRegistrar Abuse Contact Phone: +1.4805240066",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "June 09, 2022, 09:40:43 PM",
      "body": "In simpler terms it's a phishing scam with an addition of the old fake investment/advance fee fraud where you're promised of high guaranteed returns magically appearing out of nowhere. There is no such thing as high profit with zero risk, money ain't that easy. This isn't arbitrage trading either, you're just buying crypto and sending it to the scammer's address. Scammers would often use buzzwords (smart contract, arbitrage, decentralized) to appear 'smart' and 'legit'.                                         In the future, I'd make use of this tool by binance to verify their official handles, see https://www.binance.com/en/official-verification",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 09, 2022, 10:40:48 PM",
      "body": "Quote from: Michael63 on June 09, 2022, 06:30:42 PMI was added to a Telegram groupThe first thing you have to do is to go to your Telegram account's privacy settings and change Groups & Channels from Everybody to My Contacts. This way you will prevent random people from adding you to such scam groups.It's not that hard to figure out how this scam works. As Potato Chips explained above, they are simply asking you to buy BTC or eth from binance then to send the coins you bought to their addresses (0x../3Lj).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "June 10, 2022, 12:57:53 AM",
      "body": "Quote from: khaled0111 on June 09, 2022, 10:40:48 PMThe first thing you have to do is to go to your Telegram account's privacy settings and change Groups & Channels from Everybody to My Contacts. This way you will prevent random people from adding you to such scam groups.It's not that hard to figure out how this scam works. As Potato Chips explained above, they are simply asking you to buy BTC or eth from binance then to send the coins you bought to their addresses (0x../3Lj). This is a big part of telegram scamming - Default settings are not enough. I found this which I thought was pretty good at covering most bases. https://www.nextpit.com/telegram-5-ways-to-be-remain-invisible-on-the-messaging-app",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "June 10, 2022, 03:39:22 PM",
      "body": "In other words they are telling you to Buy ETH or BTC from Binance, deposit it in your personal wallet (atomic wallet) and then send the assets you bought to one of their provided \"smart contract\" address (well all know they are not smart contracts) and then you will get back BNB with some profits in 30 minutes (Obviously you won't get any BNB back). Once you send them the BTC or ETH expecting to be sent back some profits in 30 minutes. It's game over for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "June 10, 2022, 03:54:58 PM",
      "body": "This is a scam that may have been well known before but might be a little more appealing to some greedy people to think there will be quick profits once they make a deposit to the wallet shown. Scammers are constantly modifying their traps because they really know the old game will be more recognizable, so be careful with anything that offers a quick profit for whatever your deposit is because that is a hallmark of scammer traps.OP, take some precautions suggested by the above user for your telegram. This will help you avoid the wrong groups or places you don't want to be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 10, 2022, 05:04:20 PM",
      "body": "Quote from: Michael63 on June 09, 2022, 06:30:42 PM~The scammers are trying to trick you into thinking they are the only ones who can sell you BNB.  They walk you through the steps of creating a Binance account, then tell you send the bitcoin or ethereum to you Atomic wallet, then from there to their addresses.  What a pedestrian scam attempt.  What they don't tell you is that you don't need to buy BTC or ETH at all, you just buy BNB directly from Binance,  and there it is, in your Binance account.Quote from: owlcatz on June 10, 2022, 12:57:53 AMhttps://www.nextpit.com/telegram-5-ways-to-be-remain-invisible-on-the-messaging-appThat's all good advice, but there's more to it than that.  Anytime you join a group you're exposing yourself as someone who's interested in the subject  of said group.  For example, I recently joined a group to get some technical support on a (legitimate) BTC service.  Normally I leave the group once I've done my business, but this time I stuck around to see what other issues people were discussing.  It didn't take too long before I was getting messages from unknown individuals playing chummy and asking very personal questions.  Much like cold-call telephone scammers.  You can easily put two and two together; scammers see you as a member of the group, and try out their scam attempt on you.Now, me being the rascal that I am, I try to string them along for as long as possible.  I figure the more of their time I waste the fewer people they can attempt to scam.  It's a public service I offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "June 10, 2022, 09:59:02 PM",
      "body": "Quote from: DireWolfM14 on June 10, 2022, 05:04:20 PMThat's all good advice, but there's more to it than that.  Anytime you join a group you're exposing yourself as someone who's interested in the subject  of said group.  For example, I recently joined a group to get some technical support on a (legitimate) BTC service.  Normally I leave the group once I've done my business, but this time I stuck around to see what other issues people were discussing.  It didn't take too long before I was getting messages from unknown individuals playing chummy and asking very personal questions.  Much like cold-call telephone scammers.  You can easily put two and two together; scammers see you as a member of the group, and try out their scam attempt on you.Telegram needs to step up their game. Discord seems to be doing a better job at handling scam DMs (at least from my experience). My most recent encounter were all automatically marked as 'likely spam' and had their content hidden. I am also able to join cryto groups without worrying about scam DMs as there's an option to block all messages coming from non-friends (whitelisting some servers is also possible). Telegram has a similar feature called \"archive and mute\" that automatically sends PMs from strangers to a chat folder but apparently, it will only show up if a user has received too many messages from unknown contacts....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "June 10, 2022, 10:53:40 PM",
      "body": "Quote from: Michael63 on June 09, 2022, 06:30:42 PMI was added to a Telegram group that claims they're into Binance smart contract arbitrage. I realized that it is a scam from the way several accounts shill the project and the fact that the site isn't Binance's in fact, it was registered weeks ago according to Whois. However, I've not been able to figure out the details of the scam. What's obvious is that the smart contract address has nothing to do with Binance. Be wary if you are added without your consent to a group, its one of the signs that a group is a scam, legit projects will not add without asking for your approval first, I have been added so many times in groups and these are mostly related to ICO, trading, and airdrops you can hit report spam and leave once they added you, don't communicate with these people they are good with words to compel you to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "June 10, 2022, 11:28:45 PM",
      "body": "Quote from: DireWolfM14 on June 10, 2022, 05:04:20 PMNow, me being the rascal that I am, I try to string them along for as long as possible.  I figure the more of their time I waste the fewer people they can attempt to scam.  It's a public service I offer.  I literally waste as much time on telephone scammers as I do with such things on Telegram myself, good points raised as well ofc... Others ask me why I waste my time to yell at scammers on the phone (sometimes they go on and on with profanity back at me LOL), and I always say, because the more time of theirs I waste, the less time they have to scam people, so I guess I also offer that free service as well!  Leading telephone or telegram scammers on for a bit of time with bullshit phony crap can be quite comical actually, I was always a fan of the Jerky Boys growing up as well.   Also, 419Eater was always a good stop for a laugh or two (and good ideas as well)! ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "June 11, 2022, 06:09:23 AM",
      "body": "Quote from: Saisher on June 10, 2022, 10:53:40 PMBe wary if you are added without your consent to a group, its one of the signs that a group is a scam, legit projects will not add without asking for your approval first, I have been added so many times in groups and these are mostly related to ICO, trading, and airdrops you can hit report spam and leave once they added you, don't communicate with these people they are good with words to compel you to invest.Why don't you disable that option to be invited in other groups without your consent in Telegram settings and change it to your contacts only?Quote from: owlcatz on June 10, 2022, 11:28:45 PMI literally waste as much time on telephone scammers as I do with such things on Telegram myself, good points raised as well ofc... I used to do that as well, thinking that I am saving someone by wasting scammer time, but the amount of scam messages I receive on Telegram is so big that eventually I stopped. I may still play that game if I see an interesting approach, but in 99% of the time I just use block&ignore. The big difference between phone scammer and Telegram scammer is that latter can chat with many people at the same time (and they probably do) so its questionable how effective that stalling technique actually is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "June 11, 2022, 11:53:37 AM",
      "body": "I totally discard Telegram after I become a participant in gambling campaigns telegram groups in bounty campaigns are messed up if you don't know how these scammers work and how they message people pretending to be the admin of one legit group you will likely get scammed, it's better to set your privacy setting that nobody can add you and just login to your telegram channel when it's urgent to message your contacts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alterra57",
      "created_time": "June 11, 2022, 02:00:33 PM",
      "body": "Their main selling point is crypto arbitrage. Basically buying ETH lower at one exchange and selling it higher to another. That's just an example. So they want you to send money for them to trade with your money and send you back profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "June 13, 2022, 03:05:04 PM",
      "body": "If you're not into bounty hunting don't use Telegram and if you are going to use telegram be sure to edit the privacy setting so you will not find yourself in a group that you don't remember joining, the telegram has become the best tool of scammers to scam people its easy to create an account and scammers can delete their account and conversation if you need to talk to someone verify their telegram handle be sure doing a conversation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "June 13, 2022, 09:24:02 PM",
      "body": "Quote from: robelneo on June 13, 2022, 03:05:04 PMIf you're not into bounty hunting don't use Telegram and if you are going to use telegram be sure to edit the privacy setting so you will not find yourself in a group that you don't remember joining, the telegram has become the best tool of scammers to scam people its easy to create an account and scammers can delete their account and conversation if you need to talk to someone verify their telegram handle be sure doing a conversation.Exactly. You know at a time during my early days in the cryptocurrency industry. It was always a mystery and a very disturbing one at tha as to how quick I was getting into unsolicited groups and getting lots of notifications not until I discovered the privacy settings and did the needful. It all stopped as, you get to determine who sees what and who can have access to what.Anyway, that goes for that but when it comes to telegram scams, especially those that deals on trading or even offer investment packages, I think they are pretty much after the same thing. Your funds, either in terms of fees or you actually trying out a multiplier on there offered packages. Your best can chance of safety is never going along with whatever is offered and always stay out of unsolicited group add up on telegram.When the domain and registration of a site seems to be just a few days or weeks or months old, that could be a flag up to be careful and you should call the pros to do a check on it and wait on others to test the site before diving in. Always play it safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "June 14, 2022, 02:27:01 PM",
      "body": "no matter how much all this seems like an obvious fraud, there is always someone who finds himself believing in the whole story and making a profit for scammers.I would say it is a great answer to the OP question and an explanation of one of the variations of this type of scam.Quote from: Awwal08 on June 14, 2022, 10:11:29 AMThere are several telegram channels/groups that act as arbitrage channels; when I first saw the advertisement, I assumed it was legitimate since I saw Binance exchange, which is well-known as a trustworthy exchange, and then there's Bnax exchange.Here's a link to how it looks with different group names.Code:https://i.imgur.com/HJXYabM.jpg\\shttps://i.imgur.com/jqfqpjM.jpg\\shttps://i.imgur.com/xNCLyye.jpg🔁Binance.com buy - 30061.12 🔁Bnax.nl sell - 32466.00 Profit per btc traded - 2404.88 Profit % - 8.00To profit, you will purchase from Binance and sell in bnax.Then I test it out with a small quantity to see whether it's genuine. I bought BTC from Binance, transferred it to Bnax, sold it for USDT, and then transferred it back to Binance. This was my first successful transaction, and I made a profit. I was so pleased with the return that I decided to invest all of my money in order to make a large profit, but I was unable to withdraw both my profit and my cash from the exchange this time. They require that I reach their institutional level, which requires a sum of $25,000. This is how I was scammed and lost my money.My recommendation to newbies is to not believe everything they see on Telegram, especially when it comes to free money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 16, 2022, 07:23:04 AM",
      "body": "Quote from: robelneo on June 13, 2022, 03:05:04 PMIf you're not into bounty hunting don't use Telegram... Hasn't Telegram become a requirement in the bounty scene already to the extent that you can't be involved with bounties unless you have a Telegram account? Seems like you are required to join one or more Telegram channels connected to the project. Besides that, there are things like like and follow us on Facebook, Twitter, and other nonsense. Telegram in itself isn't a bad service. It's the people who abuse what it has to offer that are malicious. Telegram's fault is having certain features like allowing anyone to add you or message you (unless you change your privacy settings), or the worst of it all is allowing one side to delete private conversations for the other party as well. That's absolutely ridiculous and it shouldn't be there at all. You should at least have an option not to allow anyone else to delete your PMs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dadan",
      "created_time": "June 16, 2022, 11:21:08 AM",
      "body": "There're many ways using like legit url that actually phishing. The scammer targeted newbie who rather greedy. Stay safe people",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "June 16, 2022, 05:30:28 PM",
      "body": "Quote from: coin-investor on June 11, 2022, 11:53:37 AMI totally discard Telegram after I become a participant in gambling campaigns telegram groups in bounty campaigns are messed up if you don't know how these scammers work and how they message people pretending to be the admin of one legit group you will likely get scammed, it's better to set your privacy setting that nobody can add you and just login to your telegram channel when it's urgent to message your contacts.Throw away the telegram? that's not the right thing, there's nothing wrong with telegram, you just need to get rid of the Spammer. Telegram has many benefits, behind the negative things that happen. If someone you don't know sends a message saying you got 1BTC, just block it and block the group with lots of spammers. Setting account privacy as you said is the right one.There are many types of fraud that occur on Telegram, so you need to be careful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}