{
  "id": "topic_5454798",
  "title": "barlo357",
  "author": "barlo357",
  "created_time": "June 01, 2023, 07:25:04 PM",
  "content": "Greetings, I was going to make a ban appeal post today, but I don't know if there is a proper template for making one. Are there specific template for a certain ban like for ban evasion, spamming, etc.I think having a proper template could make the mod can easily understand.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454798",
  "comments": [
    {
      "author": "un_rank",
      "created_time": "June 01, 2023, 07:52:39 PM",
      "body": "Quote from: https://bitcointalk.org/index.php?topic=5089777.msg48896084#msg48896084If you are bannedYour ban message may have an email address which you can email. If not, then appeals are unlikely to be accepted.You can send an email to that email with reasons you should be unbanned.For creating a ban appeal thread, ensure you maintain a single thread alone and do not make any posts outside meta. Any post outside of there would count as a ban evasion, for example, it is best you edit this thread to your appeal thread when you have gotten your response or create another one and not reply here again.Quote from: barlo357 on June 01, 2023, 07:25:04 PMAre there specific template for a certain ban like for ban evasion, spamming, etc.None AFAIK. You cannot even appeal a ban evasion, only the reason for the initial ban.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "June 01, 2023, 08:23:12 PM",
      "body": "So one of you account was banned, if so then you as the owner is prohibited to post outside meta, both the banned account and other alts. About your question, there's none, you could write nninformation and details for the admins to consider your appeal and uplift your ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "June 01, 2023, 08:37:29 PM",
      "body": "Since you cannot post from a banned account, it’s normal for banned users to create a new account (this account is not allowed to make posts outside the appeal thread) to make an appeal thread in Meta. There is little chance of getting the mods to unban an account, you will have prove that you have made significant contributions to the forum and that you deserve a second chance. If a account is caught for ban evasion, I don’t know how possible it is to get such account back because the community will not give you any support. Alts of a banned account will also be banned when caught.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "June 01, 2023, 08:50:51 PM",
      "body": "What would a standard template for a ban appeal look like?  Would there be a line for begging/excuses/lies?  That's what most of them devolve into, and there's not a lot of evidentiary input like there is with a scam accusation.  Besides, most appeals just get ignored for so long that the appellant either gives up and goes away or just comes back with another alt account.  I'm sure Theymos has thought of this already, big-brained brainiac that he is.Worst Best of luck with your appeal, OP.  Don't forget to heed everything that was told to you so far in this thread, lest you scuttle what little chance you have of getting your account reinstated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "June 01, 2023, 08:54:18 PM",
      "body": "I'm all for standardizing things when it makes sense, but in this case I feel this would just make ban appeals blend into each other, rather than seeing someone actually remorseful of being banned. Obviously, remorse doesn't mean you'll get unbanned, but depending on the circumstances I feel having something that they've constructed themselves rather than following some sort of template, helps.  At the end of the day, I don't think a lot of ban appeals get uplifted. I would think it's the minority were genuine mistakes were made or there was unknown mitigated circumstances that the moderator didn't know at the time. Obviously, this is an assumption on my end as I don't have any experience with how it's handled here on the forum. However, knowing the forum doesn't like hard rules, but rather guidelines to avoid loop holes, I feel like a lot of bans aren't overturned on an appeal, but I can definitely see where certain instances would be. A template doesn't really achieve much from that point of view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "June 02, 2023, 02:43:30 AM",
      "body": "Quote from: barlo357 on June 01, 2023, 07:25:04 PMGreetings, I was going to make a ban appeal post today, but I don't know if there is a proper template for making one. Are there specific template for a certain ban like for ban evasion, spamming, etc.To make a ban appeal, create your alt account and use it to make one (only one) topic for your ban appeal. Don't use that alt account to write anything outside Meta board, it breaks forum rules too.Quote from: mprep on July 21, 2014, 05:27:51 PM25. Ban evasion (using or creating accounts while one of your accounts is banned) is not allowed.[e]25. If you get banned (temporarily or permanently) and create a new account to continue posting / sending PMs, it's considered ban evasion. The only exception is creating a thread in Meta about your ban.QuoteI think having a proper template could make the mod can easily understand. No template but when you get a personal message from forum for your ban, you will have a guide to make your ban appeal to a given email address. Follow this and write enough information about your contribution for this community.Permanent ban only will be lifted and you will only be given a second chance of you did made positive net contribution for this community.Temporary ban will be expired after a while. You would be informed that how long your temporary ban is (7 days, 14 days, 30 days).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "June 02, 2023, 05:58:41 AM",
      "body": "No formal template so far, I think it should load : Links to banned account profiles. Your defense why the ban should be lifted. References to your great work or contributions that have been made.You can see examples of ban appeal threads here. https://ninjastic.space/search?board=24&title=Appeal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "June 06, 2023, 02:03:56 PM",
      "body": "Op if you are looking for a template for ban appeal, it is very simple for you to check other applications and do what they did for the application. In any application, there are three stage. The first stage is the introduction stage whereby you introduce yourself with the original account username. Total post, Total Merits Earn. Example:Original Username: barlo357 (Most be link to the user profile)Total Post: 500Total Merits Earned: 500Dear Moderators/theymos,The second stage is the body of the application and after the body then third stage is the conclusion. Just like a formal letter. Go and check others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 06, 2023, 03:29:47 PM",
      "body": "Quote from: barlo357 on June 01, 2023, 07:25:04 PMGreetings, I was going to make a ban appeal post today, but I don't know if there is a proper template for making one. It's not about the arrangements and organization of your appeal that matters here if not the reason why you're been banned, if you're on a temporary ban i dont see a need for you to make appeal since you will be unbanned after the stipulated time elapsed, getting unbanned is not to strict adherence to the ba appeal format and I don't think there's any format recommended by the forum to use, just make every required information provisioned for in your appeal and let the reason why you were banned also appears. Ban appeal is not a guarantee to being unbanned, you're only trying your luck to see if your value and contributions to the forum could be reqoned with to serves as part of the reasons a second chance should be considered for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "June 06, 2023, 04:49:22 PM",
      "body": "I feel like everyone is wasting their time responding to this guy. He is already evading a ban from what I understand when I read this THREAD and feels it's fine because many others are evading bans as well. Any mod should have a read in the thread I posted and go ahead and ban this account for him as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 06, 2023, 04:57:04 PM",
      "body": "Quote from: yahoo62278 on June 06, 2023, 04:49:22 PMI feel like everyone is wasting their time responding to this guy. He is already evading a ban from what I understand when I read this THREAD and feels it's fine because many others are evading bans as well. Any mod should have a read in the thread I posted and go ahead and ban this account for him as well. That's right! I'm not even a specialist in this area, and I'm not even hunting for these cases, I noticed that this user has already opened two or three posts on the same subject.By the way, it seems that all the rascals on the forum, regretted the mistakes they made now that they were caught.  I usually say, the \"bandit\" is only caught because he repeats the same \"crime\" many times. I say this without wanting to offend anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 06, 2023, 07:12:08 PM",
      "body": "Quote from: un_rank on June 01, 2023, 07:52:39 PMFor creating a ban appeal thread, ensure you maintain a single thread alone and do not make any posts outside meta. Any post outside of there would count as a ban evasion... More precisely, even the Meta board is off limits if one of your accounts is on an active ban. You are only allowed to create one ban appeal and post in that one thread. Other discussions and posts in other Meta topics are also ban evasion and will be deleted if the admins see them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "June 06, 2023, 08:01:24 PM",
      "body": "Quote from: Agbe on June 06, 2023, 02:03:56 PMOp if you are looking for a template for ban appeal, it is very simple for you to check other applications and do what they did for the application. In any application, there are three stage. The first stage is the introduction stage whereby you introduce yourself with the original account username. Total post, Total Merits Earn. Example:Original Username: barlo357 (Most be link to the user profile)Total Post: 500Total Merits Earned: 500Dear Moderators/theymos,The second stage is the body of the application and after the body then third stage is the conclusion. Just like a formal letter. Go and check others.I actually saw something of this nature on the reputation board where some one did apply with this format. I think this format is ok to go by if it is the approved standard here but I think another thing is to create a special ban appeal board  where members can appeal on behalf of their banned account without mixing up things. Once applied and under review of possible that account should be tagged so that they do not use it for anything so how serious the account holders are untill their banned account is restored to normal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "June 10, 2023, 01:39:49 PM",
      "body": "You need to open a thread in Meta board with explanation why your account was banned and request to remove it with solid claims and why should the ban be uplifted but if you are asking for any specified format then there's not any but you can see how others have done so.But as others have already said you are already evading ban by creating such threads if your account is banned then you should not ask but open a thread and discuss the matter there so some action can be taken upon it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "June 10, 2023, 08:47:15 PM",
      "body": "Quote from: PX-Z on June 01, 2023, 08:23:12 PMSo one of you account was banned, if so then you as the owner is prohibited to post outside meta, both the banned account and other alts. About your question, there's none, you could write nninformation and details for the admins to consider your appeal and uplift your ban.Do you know that I'm not getting op clear, because I don't the objective of op concerning lifting ban appeal, is it that op is soliciting for the alt that's already banned or op is seeking solution for another user, I'm getting confused for op numerous thread of appeal,  I think this thread is making it two consecutive time a thread has been established because of same account that have similar user with op, please I don't want forum user's to overlook these.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}