{
  "id": "topic_5444106",
  "title": "krogothmanhattan",
  "author": "krogothmanhattan",
  "created_time": "March 09, 2023, 09:47:49 AM",
  "content": "First of thanks to Smoothie for organizing this Charity auction for anyone who was YOGGED! and also to everyone who donated their precious collectable   to this event.   I wanted to create this thread so all affected parties can place their input and then we can decide what is the appropriate and fair way to give out the   proceeds.   SO the question now is, how are or should the proceeds  be distributed.   My thinking is as follows....    For anyone whose cards were swept and did not get reimbursed by CYGAN, then they should be made whole.    Once that is done, I feel CYGAN should be given back the BTC he doled out to cover guys like myself who did accept   his BTC as they only wanted it back from Dogg.    If there is any BTC leftover, then I say it should be given to the people who ordered cards and never received them.    Those are just my two satoshi....Please feel free to add your thoughts and ideas and I am sure a consensus will be     reached eventually that everyone is happy with.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444106",
  "comments": [
    {
      "author": "minerjones",
      "created_time": "March 09, 2023, 11:30:58 AM",
      "body": "Is it possible to get an itemized list of who falls into which category and the outcome/response ?This will help when funds are distributed and accounted forThank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JanEmil",
      "created_time": "March 09, 2023, 02:22:18 PM",
      "body": "Finance ninja beatings",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hookzup1",
      "created_time": "March 09, 2023, 02:30:41 PMLast edit: March 09, 2023, 03:08:09 PM by Hookzup1",
      "body": "Thank you krogothmanhattan for posting this as I didn't see us getting far without some sort of game plan.I never accepted funds from cygan as I saw it as taking from another innocent victim but the auction made much more sense to me about getting some reimbursement for holding the directly affected halving sets that got yogged. I know the auction funds would not cover all the yogged sets but I made a list of all the ones I could find so members could post which they hold and obviously cygan being repaid for all the ones he covered There may be more but these are the txids i could find from checking my affected halving setsJan 12 8:00 txid: c349e5c08ec76674f894886a4ab0207295109e0c15bf8e7719c16389fc0ca10ebc1qhalvedmnl7kepcw2pfr3cj838tjan6rl4ggaxc,bc1qhalvedte7dzhzqcpk6m62ngwzsghmqpsen8j82,bc1qhalvedfs7cj7qr7jxhcrt9kmz4axu7uvrkvmqm,  bc1qhalvedfdk0aap8a8ex04q2vjfqrk5qhmjt7dhc,  bc1qhalveduz9xkczgw87z0eja2a6yccemajjqmt9a,bc1qhalvedex22vk0hptzprd9hjy3fsqntwanf92sj,bc1qhalved7rxhck0ayukp22lk4ws55vy69v4fxlxf, bc1qhalvedn52vxv8gwjrr4zchwxc3qhsr0zu8ewmk, bc1qhalved3v3clur92m502r8gahgegupulgt0a2z9, bc1qhalvedy4v03xddvg5eq574y6vef4wx2yjka3g7, bc1qhalvedd6yzf2jlzxxl2tr8sfxqvaz7qavevhlz, bc1qhalvedlr525sjx0zlr09pzdtv8wtrqspa6lsdl, bc1qhalvedywht258dhnckmw8zux09u5z242dfl5ey, bc1qhalvedcj8fka3ytl7mg7wtz8m99ha23chg9jnl, bc1qhalved2d37rz5jnwkwx7p8p3s0msshc39d02h8, bc1qhalvedagxzw0jjshhaedgd89jw7gy3uhhazunzJan 12 9:32 txid: fad46a3df9f859dbdc56045c81f2fc557aafa04643753ba5aa15310ba41a9e04  bc1qhalvedzhz6vhr3ax44rmzx9hvlt0ym3tz07kvp, bc1qhalvedk57akyp67ljkyul8sd5lt48s2ls5nc57, bc1qhalvedm8mma8dfcpe42cuedrz9254q0cyspghx, bc1qhalved00m577ucget6gsy7zf7hwlr5kwc7m0gu, bc1qhalvedvkg88nx9mt0fj8gu3gyvlzja5pp5fn8g, bc1qhalvedlhvvsva40z7tmd0qccfcmzlgr6djl950, bc1qhalvedwprmfjkwwuyp5ymysnjcehhhe4yg9kud, bc1qhalvedldccefm22ayttzuf8eg8ayx62adgg0sn, bc1qhalvedp9jcrwddt5yyv9h840reyyxnau2ju3fa, bc1qhalvedx6dcs482uwpsclethd0nk03vp3sgrlvx, bc1qhalved6uxsffuzewprxdlz4wq6t9kjtljmrpse, bc1qhalvedx32fzrlevglamqnqu76jjl2av2379fqm, bc1qhalvedz4k2cnpveh93rp4ha097h4mgx67nylvyJan 12 10:04 txid:a1afdd4e5e667bad1c499038a3ef96d6f85f656b737c16e7addb783640b2dd31bc1qhalved9qxuzun55easq5yy3c3kznztg46g9veu, bc1qhalvedrvl4ydzshj2kxlddekmst5yv09ctywqk, bc1qhalvedp4uvx268n5zhff7hlh7v76ns9myvrjz4, bc1qhalvedvkfxm88ck4ggvkckl8ks2rfe7ypkpfxj, bc1qhalvedvdjhwtw0yjz739dq7tyq6562wqjqfufc, bc1qhalvedwuf8pa8wt03ueu7xzwg3n4ccqmpusz0r,bc1qhalved273026cw5tf6umxulh9wzr2stfasml3n, bc1qhalvedm00fvppz78k5jzeh4qf8748x7cafxvxm, bc1qhalved8v87rnk7vlfspjt8knchrkjne2yxwzq7, bc1qhalved7up2ycsexew74mvz5pd6wa9ny6sqluxf, bc1qhalvedwtrr56u5tg9vfdny5ev80k6ha68pzp7w, bc1qhalvedry7sykk6zvnujxjzk90xk99p9vgj9fch, bc1qhalveddpzgn0lt8z0nssmagh455vxvqt8ry499, bc1qhalvedfprksqe5cnd6a3rcljmh4acj36xx6xuy, bc1qhalved59fv4lvkzkdu5p3xsq35tdcvudfj8uac, bc1qhalved5fss8s42khvwnn5stm8aj6x985n4e3ea, bc1qhalved0wtvv64fl0zfdeq0luwyp25c2l7mct7t, bc1qhalvedva3dh5nllype4vzk2pvamwp2zve426ml, bc1qhalvedkpsc94kxyzp6fd5lk04hv0spc87lvrxw, bc1qhalvedzgg6vh5j4yzre8qe5jj5rlct4j0pj66z, bc1qhalvedwt3v8ztezp57uz30nzca5yk2tpw3wlyp, bc1qhalved69m40ypqr0lg8y2x3sjhevth3y5ale7l, bc1qhalvedhshu8u9dgn09vfek2wvc6tdmzt3rcner, bc1qhalved458fmnuuhdfv8lp0g27nsjjlg6csymwm, bc1qhalved25z688ahju83m79pxqeedlt5sf0g66pn, bc1qhalvedfm8sptr34gnx4hj8h6ph3py7qauvay2p, bc1qhalvedt87eeylms62g4dr52rwrwqxfhcgkc6h4,   bc1qhalvednz6fsckh72wlv96crt0q87msgxlyw8yeJan 12 3:22 txid: 23860be8c7bd7e1b05eb449d7e036c8cbd2dd7eeeac56590819df08a64ff4be7bc1qhalvedcd5qe5xfeeq5dsf7ctw5fhefdfv652cp,bc1qhalvede5ddnsq9uu2kvyfutpcydfzrpv5lsm7c,bc1qhalvedtm7vwyttqnemnzwuvqrc0yhmkxt7ee9g,bc1qhalveds5rskcvrlqapz6e2p6lgeyy6f9rk0p7p,  bc1qhalved06e4j5c9mnww5tl8wg8nhshtdajhgy42,  bc1qhalvedkz28f68cu3ejh6227gu0emrwekj0qf67,bc1qhalvedv6ckf87syrumh9gqw05d9pe745zww7pz,bc1qhalvedrn9fyhmyh4p8mv9z99hmfendzkzj2vse,bc1qhalvedjsn03fy6p2qm7kpd887rx0dnrzu723ql,bc1qhalvedlc9ndwzm5xx32g6x55n7felkq4g55esqFeb 10 txid: 55e372858ba521e1f23fd44ba97a541fcc154d35041ad1fe02adab64df37665d  bc1qhalved6j2fdckftlna4750hdnn0nhgyt73z9cq,  bc1qhalvedez9f4llrl7dq977uqdnaa58t7fga3qqx, bc1qhalvedmwqj2s8w8zwxyrk0skwf40tcg5ey5q9x, bc1qhalved049lyyf0xfz8s696ec8z0qwvtsutagap, bc1qhalved22x5wd4xrzlrjfpdtzejp8dk07ud8m2y, bc1qhalved844kesg9p8gc89wdp9kj8u0l0xusqkrn, bc1qhalvedhshtudcre7fndk0686vxm6gvpmz9amzg, bc1qhalved2dss6w2pmwhujte9su57ssgy5x4u37z4, bc1qhalvedkharzw2292r96gcv839jkfvu95dh6jw5, bc1qhalved44dlwqcfszgtunwfd8urxpujavh9u2rj,   bc1qhalvedsp6q2nn6ayzgn222cr0pxhv076p93r35,   bc1qhalvedjnleuwzx3xuncvku0knljhmys6q58e5x,   bc1qhalveder5a0y7mhq70r8y2u37ndkk4gvrad00q,   bc1qhalveddge9y40purlq5ctvfmng9200ze2evr0f, bc1qhalved7m6lrhf4d2f4lh0qq7sdw69d7pr5pljd, bc1qhalvedurt85g8nn4zvmuvmuclrtcv7ltq8c38l, bc1qhalved8whnwpxphem3rljczuyf6gs3twzvnvt6, bc1qhalvedeukvsm26a096pgx09rzsecraf8uemh7q, bc1qhalvedp07ancrf8dkfwj0laj4p9utyqrj4xz35, bc1qhalvedmfxrtj9f0g6jwwshupzmqke4lapemd2yI put a sad face next to my 12 that were swept by yogg and here is a picture of them all still assembledhttps://imgur.com/a/T5mC9i8Thanks a lot to smoothie, minerjones, cygan, krogothmanhattan, and everyone else that made this come together for the victims and have done what they can to help since the issue🙏Maybe they can be crossed off or deleted as repaid 🤔I also paid for and never recieved a set of the personal basorexia cards for 625 and 2 sets of crypto bonds, one for each of my daughter's future birthdays to be unlocked .001,.0025, and .005 funding and 100$ worth of btc for each set, all funding and fees paid up front but never recieved. There are other orders I never recieved but I don't care as these are the main 2 I was excited about If someone can copy my list and cross-reference the cygan paid for wallets that would be great it's not very easy to do this using my phone and my boss has me working more than full time these days",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cueneyt1986",
      "created_time": "March 09, 2023, 03:27:11 PM",
      "body": "I was yogged too...What should I do?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MoparMiningLLC",
      "created_time": "March 09, 2023, 03:34:25 PM",
      "body": "woohoo yet another thread about coldkey scam   there are too many - I am giving up reading them all its the same thing repeated over and over just in multiple places - like a dozen broken records.none of my cards were emptied by yoggI lost premium due to the high purchase prices I paid for cards - I lost the 25 cards paid for that were never sent and I lost the .05 I loaned yogg.But I am done with the thread after thread of repetitious postings of the same subject.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krogothmanhattan",
      "created_time": "March 09, 2023, 08:08:18 PM",
      "body": "Thanks guys for the feedback! I am sure more people will chime in.  I was made whole by Cygan when it came to the BTC never loaded or swept.  If there are any leftovers after every one is made whole, I ordered two cards that were never shipped.  @Cueneyt1986 I think you should post what cards were swept etc etc on this thread for all to see as proof of loss.  I am not the one distributing the BTC from the auction...how its done and to whom is yet to be determined, thats why I created this thread  to have it all organized in one place",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "March 09, 2023, 08:22:28 PM",
      "body": "Quote from: JanEmil on March 09, 2023, 02:22:18 PMFinance ninja beatingsLOL. I’m sure Yogg probably appreciates seeing comments like this. I think you’re kidding, but there are a lot of crazies on the internet so don’t fire them up too much. I’m a bit disappointed that Yogg didn’t stick around if this was just a bad gambling decision. I think those who call him a friend should talk him into joining a signature campaign and donating all of his proceeds to coldkey victims he stole from until they’re all paid back no matter how long it takes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YodasRedRocket",
      "created_time": "March 09, 2023, 10:23:41 PM",
      "body": "Quote from: OgNasty on March 09, 2023, 08:22:28 PMQuote from: JanEmil on March 09, 2023, 02:22:18 PMFinance ninja beatingsLOL. I’m sure Yogg probably appreciates seeing comments like this. I think you’re kidding, but there are a lot of crazies on the internet so don’t fire them up too much. I’m a bit disappointed that Yogg didn’t stick around if this was just a bad gambling decision. I think those who call him a friend should talk him into joining a signature campaign and donating all of his proceeds to coldkey victims he stole from until they’re all paid back no matter how long it takes. Yogg's bitch ass stole another round of halvings in February!  I'm all for do-it-yourself beatings!  If anyone calls him a \"friend\" still, they're a damn fool!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YodasRedRocket",
      "created_time": "March 09, 2023, 10:46:52 PM",
      "body": "I think we should use the funds to do a custom ballet card with some cool art.  If Lucho doesn't want to participate & one of our talented artists like KryptoWerk didn't want to contribute, there's an idea below.  All extra funds are distributed to the cards.Anyone who was swiped, peeled after warning, were due items from Yogg they never received & the charity auction donators all get one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PreciousMetapsICT",
      "created_time": "March 10, 2023, 12:05:46 AM",
      "body": "I have a strict rule of not being friends with scammers or crackheads…. So for all I care Yogg can get fucked. Ninja beatings seem too niceThat is all",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lebnor",
      "created_time": "March 10, 2023, 12:13:08 AM",
      "body": "Quote from: Cueneyt1986 on March 09, 2023, 03:27:11 PMI was yogged too...What should I do?I was too and wondered the same thing until I decided to chalk it up as a lesson learned and let it go. Perceiving myself as a victim wasn’t something I was willing to do after “doing my own research”. That wasn’t my first rodeo and probably not my last.. Best of luck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dozerz",
      "created_time": "March 10, 2023, 02:51:47 AM",
      "body": "cheeky fentanyl add in yoggs next order thanks or happy with the $10 wrench also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "March 10, 2023, 03:36:38 AM",
      "body": "Quote from: OgNasty on March 09, 2023, 08:22:28 PMLOL. I’m sure Yogg probably appreciates seeing comments like this. I think you’re kidding, but there are a lot of crazies on the internet so don’t fire them up too much. I’m a bit disappointed that Yogg didn’t stick around if this was just a bad gambling decision. I think those who call him a friend should talk him into joining a signature campaign and donating all of his proceeds to coldkey victims he stole from until they’re all paid back no matter how long it takes. You don't get it and you clearly don't read replies. Yogg is NOT looking or logging into this forum at all. How Do I know that? Because I've posted it 10 times already and you're just a lazy shitposter for your 1 BTC a month from Stake.com... Get a real job loser...  <end shit on Ognasty shitposts> For the record I was ONLY rugged of a silver set. Did I seek refund from cygan? No. Do I want him to refund me? Hell no. Do I care if I get refunded? Not really, I've suffered much greater losses TBH. Anyhow, yogg will shortly be living in the shitty parts of paris with probably a needle in his arma few times a day. Fuck that guy.I don't believe in dwelling on anger and negativity. I've already moved on. I suggest you all try to as well, as dwelling on this POS is not worth the time or typing energy. Not mention it's just a waste of Internet as well..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YodasRedRocket",
      "created_time": "March 10, 2023, 03:47:10 AM",
      "body": "Seriously though… KW’s design on a ballet with his permission & fund them for all affected!https://bitcointalk.org/index.php?topic=5434638.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krogothmanhattan",
      "created_time": "March 10, 2023, 08:10:35 AM",
      "body": "Quote from: YodasRedRocket on March 09, 2023, 10:46:52 PMI think we should use the funds to do a custom ballet card with some cool art.  If Lucho doesn't want to participate & one of our talented artists like KryptoWerk didn't want to contribute, there's an idea below.  All extra funds are distributed to the cards.Anyone who was swiped, peeled after warning, were due items from Yogg they never received & the charity auction donators all get one.  LOL that is a great design @Yodasredrocket ! That's also a good idea.  I like all the ideas being posted and will go along with what the majority of the victims want to do.  Eventually a decision has to be made especially now that the auctions are over.  So please anyone who was affected and wants a say on what happens, please post your opinions! Cheers!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raritycheck",
      "created_time": "March 10, 2023, 08:36:01 AM",
      "body": "What’s the final total BTC, please? And total how many community impacted users are there?These are some of our suggestions1. Create limited edition unload-able silver coins (we will do unique design proposals and people can chose). This design will never be reused. All work from our side will be for free as long as we are in budget. 2. Same option like 1 but loadable / buyer funded coins 3. Give the amount to chosen charity of impacted people. (Can be per person)4. As someone mentioned order custom ballet cards.5. Divide btc by total users and give to each user.6. Bulk buy of known silver crypto coins like Niue coins, etc and give to impacted users.Regards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krogothmanhattan",
      "created_time": "March 10, 2023, 09:12:03 AM",
      "body": "Quote from: raritycheck on March 10, 2023, 08:36:01 AMWhat’s the final total BTC, please? And total how many community impacted users are there?These are some of our suggestions1. Create limited edition unload-able silver coins (we will do unique design proposals and people can chose). This design will never be reused. All work from our side will be for free as long as we are in budget. 2. Same option like 1 but loadable / buyer funded coins 3. Give the amount to chosen charity of impacted people. (Can be per person)4. As someone mentioned order custom ballet cards.5. Divide btc by total users and give to each user.6. Bulk buy of known silver crypto coins like Niue coins, etc and give to impacted users.Regards  Great ideas to be considered....here is the BTC from the auctions as per MinerJones quote...   Quote from: minerjones on March 07, 2023, 11:32:03 PM 0.38875 Current balance-0.00065 postage-0.00190 postage-------- 0.3862 true/adjusted balance-0.4003 total bids---------0.0141 outstanding bidsThere are 2x bids for 0.013 and 0.0011 outstandingOnce we get those 2x payments, we will have our balance of 0.4003",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YodasRedRocket",
      "created_time": "March 10, 2023, 12:32:33 PM",
      "body": "Quote from: haloxon on March 10, 2023, 10:55:59 AMI would suggest:compensation of stolen loaded amounts (ppl not yet having received compensation)compensation of loans and of 'paid but never received' orderscygan for compensating scammed ppl... coz these are objective figures.I'm undecided when it comes to premiums as those are very subjective. likewise in a legal case you would seldom receive the sentimental/collector's add-on value (premium).(speaking of an European legal understanding (yogg/coldkey as European individual/legal entity); don't know about strange US case law regime)Secret personal loans should not be reimbursed in any scenario imo.For one, if these people who all know eachother had shared this info, the reality of Yogg being a dead best dick sucker would have surfaced long ago & a lot of people wouldn’t be in the spot they are today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krogothmanhattan",
      "created_time": "March 10, 2023, 01:00:01 PM",
      "body": "Quote from: YodasRedRocket on March 10, 2023, 12:32:33 PMQuote from: haloxon on March 10, 2023, 10:55:59 AMI would suggest:compensation of stolen loaded amounts (ppl not yet having received compensation)compensation of loans and of 'paid but never received' orderscygan for compensating scammed ppl... coz these are objective figures.I'm undecided when it comes to premiums as those are very subjective. likewise in a legal case you would seldom receive the sentimental/collector's add-on value (premium).(speaking of an European legal understanding (yogg/coldkey as European individual/legal entity); don't know about strange US case law regime)Secret personal loans should not be reimbursed in any scenario imo.For one, if these people who all know eachother had shared this info, the reality of Yogg being a dead best dick sucker would have surfaced long ago & a lot of people wouldn’t be in the spot they are today.  Sadly but true...if only we wouldve known of each others loans....All I have to say is I based it on my experience with him in the past...he always delayed his repayment but then came thru. SO I was very lenient when it came to repaying me back....figuring his depression had something to do with it. But hindsight is 20/20....lesson learned at my end and never again.   And I agree....personal loans should not be covered as it was personal and not business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}