{
  "id": "topic_5475703",
  "title": "Danydee72",
  "author": "Danydee72",
  "created_time": "November 27, 2023, 07:36:40 PMLast edit: November 27, 2023, 08:31:45 PM by Danydee72",
  "content": "Immer wieder lese ich von Menschen, die Kryptowährungen, ICO's, Aktien oder andere Anlagen suchen, die in kurzer Zeit x10, x100 oder gar x1000 abwerfen. Mittlerweile sogar im Dönerladen um die Ecke.  Die Investitionen in solche Produkte erweist sich meist als sehr risikobehaftet und wird begleitet von Gefahren wie eines möglichen Scams. Bei ICO's gibt es Statistiken zum ROI: Als Beispiel sei diese Quelle erwähnt: https://icodrops.com/ico-stats/. Es gibt sicher Leute, die diese Zahlen besser zu interpretieren wissen als ich. Was ich aber sagen kann: Mit ICO's gut Gewinn zu machen hat viel mit Glück und/oder dem Beitritt zu einem Pump/Dump Prinzip zu tun. Irgendwie scheint diese Zeit vorbei zu sein.Nun aber: Einstein  wusste es bereits: Das ist alles komplett unnötig. Das Prinzip, das alle diese Faktoren weit in den Schatten stellt ist der Zinseszins. Im Ernst, das Zitat ist aller Wahrscheinlichkeit nach nicht von Einstein, wurde ihm aber wohl untergeschoben.Quelle: https://falschzitate.blogspot.com/2017/07/der-zinseszins-war-die-grote-erfindung.htmlAuf die Frage nach der stärksten Kraft im Universum antwortete er (Albert Einstein) spontan: „Das ist der Zinseszins.”Lassen wir mal beiseite, ob das historisch so genau stimmt - ob er das wirklich so gesagt hat? - und rechnen ein bisschen und lassen das Zitat etwas wirken, bevor wir loslegen.Beispiel 1 - ein \"Daytrader\"Ein Promille Gewinn pro Tag. 0.001 oder 0.1%. Wenn man sieht, wie sehr der BTC schwankt, so erscheinen 0.1% realistisch als täglichen durchschnittlichen Gewinn - Verluste auch mit eingerechnet. Rechnet man damit, dass man dies ein Jahr durchhält, so ergibt das 1.44 oder 44%. Hält man das 20 Jahre durch, so ergibt das ~1475. 1000$ Startinvestition ergeben 1.4Mio. $. Gut genug, um sich selbständig zu machen. Oder?Beispiel 2 - ein \"Hodler\"Annahme Der Hodler hält sich an Zyklen vom Bitcoin. Sagen wir mal, er macht pro Zyklus ein 3x. Realistisch? Rechnet selber. Auch hier machen wir das 20 Jahre, also 5 Zyklen lang. Ergibt 243. 1000$ Startinvestition ergeben 243'000. Mit x4 wären es 1.024 Mio. $. Auch in DE steueroptimierbar  Vielleicht ist das für einige noch nicht \"prickelnd\" genug. Machen wir also noch eine Rechnung.Beispiel 3 - der \"Sparplaner\"Pro Jahr investiere ich 1000$ .Ich bin faul, möchte nicht daytraden, also folge ich den Zyklen wie in Beispiel 2. Die Rechnung auf 20 Jahre wird komplizierter. Nehmen wir an, wir sparen uns den Betrag auf und investieren erst jeweils auf den Beginn des Zyklus. Also 1x 4000$ alle 4 Jahre. Der Rechnung willen. Real können wir das besser.Das ergibt: 1000*3^5+4000*3^4+4000*3^3+4000*3^2+4000*3=243'000+324'000+108'000+36'000+12'000 = 723'000.Mit x4: 1000*4^5+4000*4^4+4000*4^3+4000*4^2+4000*4= 1'024'000+1'024'000+256'000+64'000+16'000= 2'384'000.Mehr als x1000. Natürlich habe ich nicht berücksichtigt, dass man wohl das eine oder andere Mal Gewinne rausziehen möchte und nicht alles reinvestiert. Das Herausnehmen von Gewinnen reduziert die Marge. Durch Aufstocken beim Bären, z.B. durch DCA kann man das wiederum ausgleichen. Ebenso sollte man beachten, dass diese Mechanismen ein gewisses Handelsvolumen voraussetzen. Deshalb habe ich es beim Bitcoin platziert. Bei kleineren Währungen kommt man mit dem Mechanismus je nach Volumen an Grenzen. Ich meinerseits habe dieses Prinzip nun genau 1 Jahr getestet und (mit einem Bot) jeden Tag 1.0016 oder 0.16% Gewinn erwirtschaften können. Randnotiz: In diesem Jahr nicht wirklich ein Wunder, der BTC-Preis hat sich ja verdoppelt. Aber immerhin: 0.16% ergibt fast ein x2 - mit etwas gutem Willen. Bei Aktien redet man von guten \"Compoundern\". Ich halte BTC für einen sehr guten \"Compounder\". Ich glaube sogar, es gibt keinen besseren, bin aber zu kurz im Geschäft, um das am eigenen Leibe verifizieren zu können. Ich bin sicher, einige im Forum haben diesen Mechanismus in der Vergangenheit ebenfalls ausgenutzt und dadurch letztlich Gewinne erwirtschaften können. Gibt es in der Praxis Dinge, die gegen dieses Prinzip sprechen? Bitte postet eure Erfahrungen, ich bin neugierig, ob das erwähnte Statement verifiziert oder allenfalls auch falsifiziert werden kann und ob es auf Kryptos wirklich so einfach anzuwenden ist. Also folgend: Hände weg von riskantem Zeugs wie ICO's - mit stabilen Werten ist mehr zu holen. Das einzige, was es braucht ist Zeit. qed.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475703",
  "comments": [
    {
      "author": "MaxMueller",
      "created_time": "November 28, 2023, 05:37:15 AM",
      "body": "Ich würde mal sagen, dass deine Berechnungen die Hoffnungen und Wünsche jedes Traders/Investors darstellen.Zwei Dinge die mir sofort auffallen sind die Idealisierung (Ausblendung?) der Risiken und der Psychologie:1. Risiken:Deine Berechnung fußt ja auf der Annahme, dass BTC im Schnitt alle 4 Jahre um 3x steigt. Würde man das mit Sicherheit wissen könnte man heute locker All-In gehen, Haus verpfänden, Kredite aufnehmen, 80h die Woche malochen, alles in BTC stecken und dann in 5 Jahren in Rente gehen. Das Problem ist, dass exponentielles Wachstum niemals unendlich sein kann und oftmals in einem Knall endet. Ich sage nicht, dass BTC eine Blase ist die irgendwann platzen muss, aber genauso wie es ja immer mal wieder Artikel zum Super- oder Mega-Zyklus gibt sollte man zumindest auch die Möglichkeit einer Super- oder Mega-Korrektur in Betracht ziehen.2. Psychologie:Normalerweise testet man neue Strategien ja erstmal eine Zeit lang in der Praxis und erhöht die Bestände sukzessive je \"sicherer\" man sich fühlt, d.h. je länger die positive Historie ist. Ich würde das intuitiv nennen. Daraus ergibt sich aber die Problematik, dass man quasi einen Progressiven DCA erhält was eigentlich eher nachteilig ist.Klassisches Beispiel sind Martingale Bots (quasi DCA mit Hebel) die als irgendein AI-Scheiß gehyped werden. Martingale bringt immer relativ konstante Gewinne die umso größer werden je näher man an die grenze zu margin call geht. Damit lassen sich auch \"problemlos\" 0,5-1% am Tag erreichen, wenn der Markt passt. Nun starten wir dazu mal folgendes Gedankenexperiment:Angenommen du startest einen solchen Bot mit 100€ \"Spielgeld\". Nach 3 Monaten hat sich der Bestand verdoppelt. Zwei Reaktionen sind aus meiner Sicht intuitiv:1. die Anfänglichen 100€ raus zu ziehen um \"keine Verluste\" mehr machen zu können 2. nochmal 500€ nachzulegen, um es mit größerer Summe nochmal zu probieren was soll schon schief gehen.Wieder 3 Monate später hat sich der Kurs nochmal verdoppelt.1. wieder werden 100€ + 500€ Gewinne Raus gezogen2. es werden nochmal 1.500€ nachgeschoben  Nun geht der Bot krachen und wird eingestellt. Dem sukzessive investierten Eigenkapital von 2.100€ Verlust stehen dann 700€ Gewinnmitnahmen gegenüber, keine gute Quote.Emotional ist das auch ne ganz schwierige Geschichte, weil man ja bereits die Erfahrung machen konnte, dass \"konstante\" Gewinne mit extrem hohen Renditen möglich sind. Meist wird dann irgendein \"Fehler\" gefunden und behoben und der Bot neu aufgesetzt.       Was ich damit sagen will: 1. zu jeder Strategie egal ob Hodl oder Trading gehört zwingend auch der Plan für den Ausstieg bzw. die Gewinnmitnahmen. Alles einfach mal laufen lassen und auf ewiges Wachstum zu spekulieren ist meiner Ansicht nach ein wenig naiv.  2. Um bei der Anlagestrategie (Investitionen die über 1x Weihnachtsgeld hinausgehen) auch katastrophale Risiken abzusichern braucht es aus meiner Sicht zwingen eine gewisse Streuung in möglichst unkorrelierte Assetklassen.  Oder um das anders zu sagen: wenn man sich auf dem Peak im Bullen rückblickend ärgert nicht noch mehr rein gesteckt zu haben, dann hat man vor dem Bullen in Unkenntnis der Zukunft vermutlich sehr besonnen agiert.   Ich persönlich würde BTC nicht länger als 1 Zyklus halten, sondern in jedem Zyklus Gewinne mitnehmen, ein Rebalancing mit anderen Assets durchführen und dann unter neuen Voraussetzungen in den nächsten Zyklus starten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwk",
      "created_time": "November 28, 2023, 07:16:22 AM",
      "body": "Quote from: Danydee72 on November 27, 2023, 07:36:40 PMBeispiel 1 - ein \"Daytrader\"Ein Promille Gewinn pro Tag. 0.001 oder 0.1%. Wenn man sieht, wie sehr der BTC schwankt, so erscheinen 0.1% realistisch als täglichen durchschnittlichen GewinnDu irrst. Statistisch gesehen ist der Gewinn beim Daytrading 0 abzüglich Gebühren, man macht also Tag für Tag Verlust.Quote from: Danydee72 on November 27, 2023, 07:36:40 PMBeispiel 2 - ein \"Hodler\"HODLN wirft keinen Zinseszins ab, da es nicht zu einer Reinvestition des \"Gewinns\" kommen kann.Quote from: Danydee72 on November 27, 2023, 07:36:40 PMBeispiel 3 - der \"Sparplaner\"Pro Jahr investiere ich 1000$Da auch hier die \"Gewinne\" nicht entnommen werden, um sie zu reinvestieren, gibt es auch hier keinen Zinseszins.Quote from: Danydee72 on November 27, 2023, 07:36:40 PMBei Aktien redet man von guten \"Compoundern\".Compounding Interest bedeutet, die Zinsen zu entnehmen und in das Produkt zu reinvestieren.Das tun Aktiengesellschaften selbst eher selten (das wären Aktienrückkäufe), und ist daher eher ein typisches Merkmal von Fonds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee72",
      "created_time": "November 28, 2023, 09:49:58 PMLast edit: November 28, 2023, 10:21:13 PM by Danydee72",
      "body": "@qwk: ... Ich präzisiere etwas:Den Zins nehme ich mir, den gibt mir niemand. Wenn ich z.B. beim Hodln den Zins - frei übersetzt nach \"Danydee\" - den Gewinn - reinvestiere, kann ich im nächsten Handels-Zyklus sowohl die Investition wie auch den Gewinn abrechnen im Falle, wenn ich erfolgreich bin. So ist das gemeint - eine Exponentialfunktion steht ja eigentlich genau dafür. Das ist der Effekt, den ich anspreche.So wirft sowohl Hodln wie auch Daytrading potentiell \"Zinseszins\" ab. Aus meiner Sicht ist das ein total unterschätzter Effekt, grade im Kryptobereich. Viele schreien nach x10, x100, anstatt zu gucken, wie weit man mit x3, x1.5 oder gar x1.001 kommen kann. Da ich diesen Effekt so bemerkenswert und vielseits unterschätzt wahrnehme, finde ich es auch angebracht, das Ganze etwas in den Fokus zu rücken. Die 1000$ und 4000$ zusätzlich sind \"nur\" als Aufstockung im Beispiel 3 gedacht. Für den Effekt selber sind sie irrelevant. Zu Risiken und auch zur Psychologie muss ich nicht viel sagen, das ist ausreichend erklärt. Gewinne rausziehen würde ich auch ab und zu. Ich will ja nicht einem Totalverlust ausgesetzt sein. Aber ist es denn so, dass man mit 100x ICO's diesbezüglich besser fährt?Mehr schreibe ich mal noch nicht, bin gespannt, ob noch weitere Punkte und Erfahrungen eingebracht werden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_solo_miner",
      "created_time": "November 28, 2023, 10:13:09 PM",
      "body": "QuoteSo wirft Hodln ... potentiell Zinseszins ab.Nein, 1 BTC bleibt genau 1 BTC beim Hodln, was sich ändert ist der Wechselkurs nach €/$/.. in ubekannter Größeordnung, auch negativ ist möglich.Kann also kein Zins und Zinseszins sein, sondern ist REINE Spekulation auf den Wechselkurs zum Zeitpunkt X.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Danydee72",
      "created_time": "November 28, 2023, 11:36:41 PMLast edit: November 29, 2023, 12:09:58 AM by Danydee72",
      "body": "Quote from: o_solo_miner on November 28, 2023, 10:13:09 PMNein, 1 BTC bleibt genau 1 BTC beim Hodln, was sich ändert ist der Wechselkurs nach €/$/.. in ubekannter Größeordnung, auch negativ ist möglich.Kann also kein Zins und Zinseszins sein, sondern ist REINE Spekulation auf den Wechselkurs zum Zeitpunkt X.Da bin ich anderer Ansicht. Nichts für ungut, aber da muss ich jetzt doch nochmal reingrätschen.  Manch ein Hodler wird investieren im Bären, genauso wie manche Gewinne realisieren während dem Bullen. Manchmal verpasst man die Gelegenheit vielleicht, manchmal nimmt man sie jedoch wahr. Jedenfalls ist dieses Verhalten in etwa das, was ich zumindest auch unter einem Hodler verstehen würde. Wenn er das vernünftig macht, wird sich der Wert  der Anlage mehren. Und wenn er mehr hat, kann er mehr investieren. Er muss dabei gar nicht neue Mittel einfliessen lassen, es genügt die Initialreserve (in Deinem Beispiel den einen BTC) zu verwenden. Irgendwann zu einem Zeitpunkt verkaufst Du ihn und die Mittel werden frei, die Du dann teilweise oder ganz im nächsten Bären - oder was auch immer Du dafür hältst - erneut in BTC oder was auch immer investieren kannst. Wartest ab und verkaufst irgendwann wieder. Und so weiter. Mit DCA oder all den Techniken, die einem belieben.In meinem Rechenbeispiel - zugegeben \"etwas\" durch meine Rosarote Brille besehen - investiert dieser Hodler alles und verkauft genauso wiederum alles mit einem hypothetischen Faktor von 3 - so in etwa alle 4 Jahre je 1x. Vielleicht geht das im nächsten Zyklus mit BTC nicht mehr so gut, also kann er eine andere Währung in Betracht ziehen. Oder auch beim BTC bleiben und einen Zyklus auslassen. So genau weiss man das ja nicht im Voraus. Fürs Rechenbeispiel ist die Währung egal. Sofern seine Trades gut laufen, und er also tiefer kauft als verkauft, so wird er über die Jahre vom Zinseszinseffekt profitieren und sowohl BTC als auch die Wechselwährung anhäufen. Je nachdem, ob er gerade BTC hält oder seine präferierte Wechselwährung. Es geht auch nicht per se um Zinsen, wie sie die Bank vergibt, sondern um den Effekt, der Investitionen potenziert  anstatt multipliziert. Obwohl auch bei Banken unter anderem darum Zinsen gegeben werden, weil die Bank genau dasselbe macht: Mit dem Geld kaufen, wenn Preise günstig sind und verkaufen, wenn sie steigen. Um vom Zinseszinseffekt zu profitieren braucht es aber weder eine Bank noch irgend sonst ein Institut. Ein Währungspaar und ein wenig Zeit reichen aus. Frage: Bin ich mit dieser These effektiv auf dem Holzweg?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "November 29, 2023, 12:44:21 AM",
      "body": "Quote from: Danydee72 on November 28, 2023, 11:36:41 PMFrage: Bin ich mit dieser These effektiv auf dem Holzweg?Holzweg würde ich nicht unbedingt sagen, denn ich weiß was du meinst. Ich hab schon Scalper gesehen (Bots mit Trades 1sek - 5min) die über den von dir beschriebenen Effekt extrem schnell skaliert sind. Und das einfach weil sich die vergleichsweise kleinen Gewinne sehr schnell exponentiert haben. Aber bissl an der eigentlichen Problemstellung ist es dennoch vorbei. Denn dass sich das unter den getroffenen Annahmen extrem gute Möglichkeiten böten ist ein No-Brainer. Die Frage wären eher wie deine Strategie im Detail aussehen soll und wie die Risiken abgedeckt werden, wenn es mal nicht kommt wie erwartet...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}