{
  "id": "topic_5468930",
  "title": "satscraper",
  "author": "satscraper",
  "created_time": "October 02, 2023, 05:48:52 PMLast edit: October 04, 2023, 07:34:25 PM by satscraper",
  "content": "Over the past months I have been observing a steadily increasing interest among forum users in topics related to multisig wallets. My search for  relevant forum guides on creating such wallets yielded almost no results, which surprised me to some extent. Therefore, I have decided to address this situation by contributing detailed instructions  on creating a 2-of-2 multisig wallet which relies on  two cosigners: Passport 2 HW and  Sparrow software wallet.Prerequisites: Passport 2/Passport Foundation HW  and installed Sparrow.1) Open Sparrow and click on the 'New Wallet' option in the 'File' menu. In the ensuing subwindow enter a name for this wallet. I chose 'Multisig Wallet,' but feel free to pick any name you prefer:Quote from: satscraperClick “Create wallet”.2)In the subsequent subwindow choose “Multi Signature” at  Policy Type (upper-left-corner-located) and use the upper-right slider to adjust the number of cosigners. In this example, the slider is set to the 2/2 position. Quote from: satscraper Choose”Keystore 1” and then click “New or Imported Software Wallet”.(This step instructs the Sparrow client to create the first cosigner, which will be Sparrow itself ) 3) In the following subwindow utilize the drop-down menu located at the upper-right corner to select the number of BIP 39 mnemonic words. For this example 12 words are chosen. Click 'Generate New,' which will provide you with a set of words relevant to a BIP 39 compliant wallet:Quote from: satscraper(Don’t use words shown on above picture. They are just for example)Write down those words, review your recorded list  once more, and then press 'Confirm Backup...'.\" and after the pop-up - “Re-enter words”.4)Re-enter the recorded words in the corresponding fields of the next subwindow:Quote from: satscraperEntering the correct information again and pressing “Create Keystore” will result in the creation of a valid keystore that can be imported into your multisig wallet using “Import Keystore” button on the next subwidow :Quote from: satscraper5) Now proceed to create a keystore for your Passport 2 device. Click on the 'Keystore 2' tab, and then select “Airgapped Hardware Wallet “.Quote from: satscraper In the new subwindow you will see a list of hardware wallets.Quote from: satscraper Locate 'Passport Multisig' in the list and click “Scan..” (I prefer QR codes, and from here on, I will refer exclusively to this method. However, if you prefer pairing via an SD card, click 'Import File..'). 6) Now it's time to proceed to  Passport device. Turn it on, enter the correct PIN (I will not use a password for the relevant account in these instructions, but you may use one), and locate “Manage Account.” Quote from: satscraperChoose  it by right button on device.The next screen will present a list of options. Choose “Connect Wallet”, then locate ”Sparrow” on the following screen and press it using the device's right button.  Quote from: satscraperOn the refreshed Passport screen, select “Multisig,” then on the next screen, click on “QR Code.” This prompts you to scan  into Sparrow the QR code displayed on the following screen.Quote from: satscraperJust do it (BTW, QR code is dynamic).After Sparrow's  scanning is completed  the relevant information will appear in the Passport tab:  Quote from: satscraperPress “Apply” button on this tab.7) Proceed to the next step on the Passport wallet. It will prompt you to import the multisig configuration from Sparrow via QR code:Quote from: satscraperTo do this, click on the “Passport” tab in Sparrow, then press the “Export” button. In the subsequent subwindow, click on the “Show...” button located next to the 'Passport Multisig' entry:  Quote from: satscraperScan the dynamic QR code into  Passport device. After scanning is complete, a message will appear on the Passport screen, asking for your permission to create a new multisig wallet: Quote from: satscraperConfirm creation.After confirming, Passport will prompt you to verify that the wallet is connected correctly:Quote from: satscraperTo do this you have to scan any receive address from your multisig wallet.8.) Double-click on any receive address and provide the corresponding QR code to the Passport scanner. After scanning is complete, that address will appear on the Passport screen. Approve it if it is correct.That's it! You now have a 2-of-2 multisig wallet in your arsenal. The above instructions can be easily adapted for different cosigner types and their numbers in an N-of-M multisig wallet. Here's a brief guide on how to send funds from a multisig wallet, demonstrated using the wallet created with the above instructions.To initiate a transaction, you need to sign it using two private keys belonging to different cosigners – Sparrow and Passport. After clicking 'Sign,' Sparrow will automatically handle the process, displaying a bar filled with blue to indicate that the first cosigner has successfully completed their part:Quote from: satscraper]Next, click \"Sign\" a second time. Sparrow will generate a dynamic QR code for the multisig transaction. You need to scan this code with the Passport device's scanner. After scanning is complete, Passport will display the signed QR code for the multisig transaction. Input this code back into Sparrow by clicking \"Scan QR\" in the transaction window (see above picture). After a successful scan, you should see the following : Quote from: satscraperFinally, click the 'Broadcast Transaction' button to complete the process.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468930",
  "comments": [
    {
      "author": "satscraper",
      "created_time": "October 02, 2023, 05:49:12 PM",
      "body": "reserved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "October 03, 2023, 04:42:53 PM",
      "body": "Very good tutorial, but shouldn't we encourage people to use better multisig set-ups?As such, I would argue that:1. 2-of-3 is better than 2-of-2 because it offers greater redundancy with the exact same security, since 2 cosigners are needed in both cases. It is also easier to back it up because it needs 3 backups (one cosigner needs one backup). In 2-of-2, you need 2 backups for each cosigner. Having one backup for each cosigner can be catastrophic. In general, I suggest multisig setups where the needed cosigners are less than the total amount of cosigners. The only exception I have seen working is for 2 friends of mine who are married and want to have a vault together where both need to sign. Each one of them is responsible for one cosigner only. So perhaps they have kept 2 backups of each cosigner or even more, I don't know. It depends on each one.2. Why not both cosigners offline? Much better security. In fact, having one cosigner as a hot wallet is a bad practice. I wouldn't do that personally. A properly set-up single signature wallet that is airgapped and properly backed-up with additional strong passphrase offers relatively equal security to a multisig with one cosigner as hot wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 03, 2023, 07:08:34 PMLast edit: October 04, 2023, 10:45:34 AM by satscraper",
      "body": "Quote from: apogio on October 03, 2023, 04:42:53 PMVery good tutorial, but shouldn't we encourage people to use better multisig set-ups?As such, I would argue that:1. 2-of-3 is better than 2-of-2 because it offers greater redundancy with the exact same security, since 2 cosigners are needed in both cases. It is also easier to back it up because it needs 3 backups (one cosigner needs one backup). In 2-of-2, you need 2 backups for each cosigner. Having one backup for each cosigner can be catastrophic. In general, I suggest multisig setups where the needed cosigners are less than the total amount of cosigners. The only exception I have seen working is for 2 friends of mine who are married and want to have a vault together where both need to sign. Each one of them is responsible for one cosigner only. So perhaps they have kept 2 backups of each cosigner or even more, I don't know. It depends on each one.Thanks for your response.Opting for a 2-of-3 multisig scheme undoubtedly enhances sustainability. Nevertheless, introducing the third co-signer into the tutorial to explain this arrangement would result in additional entries (the number varying based on the type of additional co-signer), potentially elongating the tutorial unnecessarily.In my view, the existing steps in the tutorial provide a comprehensive understanding of setting up a multisig wallet in any configuration. Therefore, if you lean towards a 2-of-3 multisig wallet, Sparrow offers an array of options across different wallet types to incorporate the third co-signer seamlessly.Quote from: apogio on October 03, 2023, 04:42:53 PMA properly set-up single signature wallet that is airgapped and properly backed-up with additional strong passphrase offers relatively equal security to a multisig with one cosigner as hot wallet.Nope, the next regular firmware update may potentially install a backdoor into “ properly set-up single signature wallet that is airgapped and properly backed-up with additional strong passphrase”.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 04, 2023, 09:29:54 AM",
      "body": "You can add the multisig script type available in Sparrow. I noticed that you used P2WSH, but is P2SH supported and is it also possible to have P2TR (as far as I know, there is no open source wallet that supports multisig)max co-signers are there? (N value)Night mode makes reading the screen difficult.Although Sparrow provides smoothness in adding more hardware wallets, Electrum offers a better multisig UI.I think the explanation is good and can be useful for beginners, especially since 2-of-3 provides better options for those who want to store seeds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 04, 2023, 10:43:46 AMLast edit: October 04, 2023, 03:16:03 PM by satscraper",
      "body": "Quote from: Yamane_Keto on October 04, 2023, 09:29:54 AMYou can add the multisig script type available in Sparrow. I noticed that you used P2WSH, but is P2SH supported and is it also possible to have P2TR (as far as I know, there is no open source wallet that supports multisig)max co-signers are there? (N value)Night mode makes reading the screen difficult.Although Sparrow provides smoothness in adding more hardware wallets, Electrum offers a better multisig UI.I think the explanation is good and can be useful for beginners, especially since 2-of-3 provides better options for those who want to store seeds.Sure you can select  any  script type that suites your needs better ,this is  an obvious thing which tutorial didn't  mention.  Tutorial  has the long-reading enough without adding this.Max N = 20I like night mode but one cannot account for tastes,  the same is  the case for Electrum  multisig UI. Electrum is not choice for me because of the lack  of pairing with the air-gapped wallets via QR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "October 05, 2023, 05:40:42 PM",
      "body": "Quote from: satscraper on October 03, 2023, 07:08:34 PMThanks for your response.Opting for a 2-of-3 multisig scheme undoubtedly enhances sustainability. Nevertheless, introducing the third co-signer into the tutorial to explain this arrangement would result in additional entries (the number varying based on the type of additional co-signer), potentially elongating the tutorial unnecessarily.In my view, the existing steps in the tutorial provide a comprehensive understanding of setting up a multisig wallet in any configuration. Therefore, if you lean towards a 2-of-3 multisig wallet, Sparrow offers an array of options across different wallet types to incorporate the third co-signer seamlessly.Ok, you are right. Thanks for the tutorial, as I said, it is very helpful and well written. In fact you include both the options to add a hot cosigner and a cold cosigner which is all someone needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}