{
  "id": "topic_5419267",
  "title": "kungen12321",
  "author": "kungen12321",
  "created_time": "November 03, 2022, 07:37:27 AM",
  "content": "Hi Guys!A quick question. Does it work to mix apw9 and apw9+ psu between s17 pro and t17+? I know that they look different in the chassi but Can I use both psu for each miner (S17PRO T17+) without risky to damage the miners.In that case, will be a quick solution before I order more ones.Thanks in advance!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419267",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "November 03, 2022, 02:26:50 PM",
      "body": "Based on the specs they are the same except for overcurrent protection so I think they will work.Check the specs comparison here belowApw9- https://support.bitmain.com/hc/en-us/articles/900000069686-APW9-14-5V-21V-SpecificationApw9+- https://support.bitmain.com/hc/en-us/articles/900000069726-APW9-14-5V-21V-SpecificationsWhy not buy a universal one instead? Zeusbtc has universal apw9/+ here https://www.zeusbtc.com/UsedMinerDetails.asp?ID=277So that the chasing shouldn't be a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "November 04, 2022, 08:19:44 AM",
      "body": "As far as I understand the explanation on the zeusbtc website, their power supply is made from the original Antminer supplier but just without branding. Since Antminer can basically use any computer power supply I would think it is compatible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kungen12321",
      "created_time": "November 04, 2022, 09:46:38 AM",
      "body": "Thank you guys for the tips, for sure I will check put zeusbtc website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thierry4wd",
      "created_time": "November 24, 2022, 09:12:39 PM",
      "body": "i'm sorry, but is not possible to swap APW9 and APW9+ ...The miner check the \"name\" of PSU by PIC ... If is not match , give power error ...Only one solution for swap, need reprog the PIC under PSU with PicKit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "December 05, 2022, 11:01:19 PM",
      "body": "Quote from: hZti on November 04, 2022, 08:19:44 AMSince Antminer can basically use any computer power supply I would think it is compatible.That is only valid for older miners, S9k / S9se being the last model that could run on any 12V PSU, doesn't matter if it's a computer PSU or any other PSU that has enough 6-pins and outputs 12V DC, but later on starting from S11 onwards, the design of the antminer changed from 6-pin connectors to a busbar with direct contact to the hashboards (the control board still run on the 12V DC).So aside from the program issue that thierry4wd mentioned, you are going to run into an issue with alignments, the design of those PSUs is slightly different, the output voltage is also different and it's no more the standard 12V DC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}