{
  "id": "topic_5463219",
  "title": "rybako",
  "author": "rybako",
  "created_time": "August 14, 2023, 11:04:50 AM",
  "content": "North Korean leader Kim Jong Un has replaced the country's top general and emphasized heightened preparations for potential conflict, an increase in weapons production, and the expansion of military exercises, as reported by state media KCNA - https://www.reuters.com/world/asia-pacific/north-koreans-kim-calls-better-war-preparations-kcna-2023-08-09/The changes were announced during a meeting of the Central Military Commission aimed at formulating deterrent measures against unnamed adversaries.Chief of the General Staff Pak Su Il was removed from his position after seven months and succeeded by General Ri Yong Gil, who had previously held roles as defense minister and top commander of conventional troops.Kim also outlined goals for expanding weapons production capacity and urged military drills with advanced equipment.Amidst ongoing tensions, North Korea is planning a militia parade, and the United States and South Korea have scheduled military exercises that the North perceives as a security threat.Will he pull the trigger this time? For your sake and mine, I hope he's still bullshitting.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463219",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "August 14, 2023, 05:01:52 PM",
      "body": "I have seen this happening before. Actually, I recall some years ago people on internet were actually expecting for Kim to actually push the nuclear button and start the apocalypse. It never happened.At this point I think that the North Korean regime is more interest on keeping Japan and South Korea scared of the consequences in case any western country or their allies dare to try to overthrow Kim or his dynasty. So I dont think Kim will dare to start a war this time or in the near future, they just want t be left alone enjoying their dictator life and making the life of thousands miserable.  It is mind-blowing how they were able/allowed to get a nuclear arsenal, by the way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "August 14, 2023, 11:57:15 PMLast edit: August 15, 2023, 12:15:08 AM by Zlantann",
      "body": "Quote from: rybako on August 14, 2023, 11:04:50 AMWill he pull the trigger this time? For your sake and mine, I hope he's still bullshitting.Kim Kong Un is an attention seeker that should not be taken seriously. Most of the military equipment of North Korea are overestimated in a bid to move the US and the West to reconsider economy crippling sanctions placed on the isolated nation. All the war threat is nothing but idle babbling that will not be backed with actions. North Korea cannot fund a war because Western sanctions have destroyed its economy. The only reason the US and its allies have not taken any military action against North Korea is not because of its military arsenal but because of its proximity to Japan and South Korea which are core allies of the West. Kim Kong Un will not shoot even a bullet across any country because he is aware of the economic and military weakness of his country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pilgrimazra",
      "created_time": "August 15, 2023, 06:19:57 AM",
      "body": "Quote from: Zlantann on August 14, 2023, 11:57:15 PMIf you will agree with me, Kim K. Is just an attention seeker indeed. 5years back I used to think he is stubborn and wouldn't want to listen to the world power. Donald Trump first speech directed to North Korea, in a bellicose first address to the United Nations general assembly 5 years ago got Kim K. Scared and everything about his pride was calm. I still haven't heard from him or his threats on social media or on cable as it used to be. He is still hiding and enjoying his dictatorship kind of rule in North Korea .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mijky",
      "created_time": "August 16, 2023, 09:24:09 AM",
      "body": "Wouldn't be too worried about Kim Jong Un doing any shit with military action at this time. Unless something extraordinary happens, it seems he is just exaggerating and flexing his military readiness more to get more attention than getting ready for war. I think the likelihood of some military action going on still is not gonna happen barring some unforeseen incident. For now from my perspective, it appears that Kim is just posturing rather than planning to \"make a war happen\" or pull a trigger on us Westerns 😀",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "August 16, 2023, 10:14:42 AM",
      "body": "The leader of North Korea has always seemed like a violent person to me who is always ready for war.Quote from: rybako on August 14, 2023, 11:04:50 AMWill he pull the trigger this time? For your sake and mine, I hope he's still bullshitting.I am not sure he will. from the news report, he is doing this as preparation for the future and maybe based on intelligence report that he has received. It is also strategy to publish and make this news very public so it can be intimidating to any country that hears it, and a bold statement to say that they are ready for any situation that will be thrown against them. This will make any country with plans of aggression towards them to rethink their actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "August 16, 2023, 10:38:52 PM",
      "body": "North Korea calling for war is how they request stimulus from the rest of the world. They flex their nukes and posture like they’re going to start a war, then China or the US sends them some foods and all is well again. As the global economy slows, you can expect North Korea to start making more noise until they get what they need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "August 22, 2023, 11:05:54 AM",
      "body": "Quote from: Hispo on August 14, 2023, 05:01:52 PMI have seen this happening before. Actually, I recall some years ago people on internet were actually expecting for Kim to actually push the nuclear button and start the apocalypse. It never happened.At this point I think that the North Korean regime is more interest on keeping Japan and South Korea scared of the consequences in case any western country or their allies dare to try to overthrow Kim or his dynasty. So I dont think Kim will dare to start a war this time or in the near future, they just want t be left alone enjoying their dictator life and making the life of thousands miserable.  It is mind-blowing how they were able/allowed to get a nuclear arsenal, by the way. This is it, they are obligated to keep the appereances up in order to be relevant to the world. Real reason why this pompous blustering is happening right now, is the fact that there are annual US-South Korea joint military exercises happening nearby, and NK doesn't want to seem weak at in eyes of their own citizens or the world. They are viewing this as practise for invasion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 22, 2023, 12:16:51 PM",
      "body": "I just hope that it will always be the \"call\" and will remain as is and there won't be any move at all. While they're practicing missiles near Japan and South Korea, that's really alarming when these top officials are being replaced and switched as its internal affairs have something to do with what they're about to do. I also hope that Kim won't press the button on this one, we don't know how big it will be and we don't wanna really know because we don't want that to happen. Whatever triggers them is probably if their allies try to call for them or if they're asked to join them in their war but for sure with economical, they won't have impact but it's a different talk if it's about collateral damages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 22, 2023, 08:38:41 PM",
      "body": "Quote from: o48o on August 22, 2023, 11:05:54 AMQuote from: Hispo on August 14, 2023, 05:01:52 PM-snip-... They are viewing this as practise for invasion.I don't think Kim and his generals actually believe an invasion could happen against North Korea. In this kind of scenario where the foe also has access to nuclear weapons a frontal invasion would only be translated to a nuclear conflict, which is the most feared scenario on the west.If the United States ever tries to take over North Korea it would be only if they managed to disable their nuclear arsenal or disassemble their political elite.Whether North Korea actually believes there is a possibility of invasion or not, I do hope they never dare to launch a nuclear weapon anywhere outside their territory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "August 22, 2023, 10:52:41 PM",
      "body": "Quote from: rybako on August 14, 2023, 11:04:50 AMNorth Korean leader Kim Jong Un has replaced the country's top general and emphasized heightened preparations for potential conflict, an increase in weapons production, and the expansion of military exercises, as reported by state media KCNA - https://www.reuters.com/world/asia-pacific/north-koreans-kim-calls-better-war-preparations-kcna-2023-08-09/The changes were announced during a meeting of the Central Military Commission aimed at formulating deterrent measures against unnamed adversaries.Chief of the General Staff Pak Su Il was removed from his position after seven months and succeeded by General Ri Yong Gil, who had previously held roles as defense minister and top commander of conventional troops.Kim also outlined goals for expanding weapons production capacity and urged military drills with advanced equipment.Amidst ongoing tensions, North Korea is planning a militia parade, and the United States and South Korea have scheduled military exercises that the North perceives as a security threat.Will he pull the trigger this time? For your sake and mine, I hope he's still bullshitting.He is bullshitting. The \"trigger\" gets NK destroyed. South Korea is not Ukraine, they are armed to their teeth and have thousands of modern artillery systems which are strictly designed for decades to fight this precise war.The nuclear option gets US involved and North Korea;s regime destroyed, likely along a number of innocent bystanders. The conventional option gets South Korea seriously harmed, but North Korea's regime obliterated 100%. They have to keep a whole population in check internally. He who has to make an effort to control himself, is unlikely to be ever able to control someone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "August 22, 2023, 10:55:28 PM",
      "body": "Like we used to use from his previous actions, this is not the first time he was ready to engage in warfare like this. He might think NATO is doing the wrong thing to flex muscle in his own region which I think it's never right. Kim had been holding is anger against the west and I still don't know why they want him to create a scene that had never happened before. I hope someone will calm him down because we all know that he is never scared of anyone even the world biggest economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "August 23, 2023, 10:31:08 AM",
      "body": "I wouldn’t pay too much attention to any rumours of Kim Jong Un posturing to start a war. There are always suggestions North Korea will mobilise & start an attack on another country but it’s always just rumours. There would be too much danger from ocher nations for North Korea to risk it. I don’t think we have anything to worry about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}