{
  "id": "topic_5445466",
  "title": "BVeyron",
  "author": "BVeyron",
  "created_time": "March 19, 2023, 06:50:25 AM",
  "content": "H O R I Z E NНе нашёл топик этой PoW монеты в нашем локале.Eсть заброшенная веткаhttps://bitcointalk.org/index.php?topic=5243231.0Но монету с тех пор успели переименовать.И думаю, будет полезно такой топик реанимировать.Эта монета (сейчас 187 позиция в рейтинге СМС, Капитализация -$145М, курс около $10} - третье поколение блокчейн-платформ, построенных для обеспечения приватности.Чисто технически Horizen это форк Zclassic, которая, в свою очередь, возникла в результате разделения блокчейна Zcash. Основателем проекта является компания Zen Blockchain Foundation (ZBF) созданная как некоммерческая организация в штате Делавэр, США.Платформа ZenCash была запущена в конце мая 2017 года без проведения ICO и предварительного майнинга. Не буду пересказывать, все про монету,  вот неплохой обзор:Обзор популярной криптовалюты HorizenВообще все PoW монеты, которых совсем немного, монеты с приличной капитализацией в десятки-сотни миллионов долларов заслуживают отдельных топиков здесь на нашем локале на форуме.Надеюсь вы согласны?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445466",
  "comments": [
    {
      "author": "delfastTions",
      "created_time": "March 19, 2023, 07:06:42 AM",
      "body": "Согласен, что ПоВ монеты с приличной капой должны иметь отдельные топики в ру локали. Особенно после того как отвалил Эфириум.Однако новый топик конкретно по этой пожалуй не стоит открывать.  В ссылке надо просто написать тому ОП  чтоб переименовал топик. Это будет правильнееUPS: И ПРАВДА ВАША.    тот ОП пропал из БТТ, два года уж как не появлялся",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "March 19, 2023, 10:49:12 AMLast edit: March 19, 2023, 12:55:53 PM by Xal0lex",
      "body": "Quote from: delfastTions on March 19, 2023, 07:06:42 AM.Однако новый топик конкретно по этой пожалуй не стоит открывать.  В ссылке надо просто написать тому ОП  чтоб переименовал топик. Это будет правильнееUPS: И ПРАВДА ВАША.    тот ОП пропал из БТТ, два года уж как не появлялсяПоэтому и открыл, монета все таки во второй сотне  Coinmarketcap.Все пулы майнинга, партнеры по обмену, операторы узлов и пользователи кошельков фул нод должны перейти на обновление безопасности программного обеспечения ZEN 3.3.0.Новая версия 3.3.0 доступна для загрузки на GitHub, хранилище APT и через Docker и устраняет уязвимости, перечисленные подробнее в блоге.С ZEN 3.3.0 предоставляется исправление безопасности для: P2P DoS OpenSSL Обратите внимание, что ZEN 3.3.0 не окажет какое-либо влияние на запланированное обесценивание ZEN 3.2.1 или на следующий цикл амортизации, заканчивающийся в апреле 2023 года.ZEN 3.3.0 обесценится 7 апреля 2023 года, около полудня UTC. Пожалуйста, убедитесь, что вы обновили ZEN 4.0.0 ( до выпуска ) до этого, если вы все еще используете ZEN 3.3.0.https://blog.horizen.io/zend-node-application-disclosure-and-fixes/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "May 17, 2023, 09:24:13 AM",
      "body": "Немного новостей:В Q1 2023  был запущен  совместимый с EVM сайдчейна EON на различных этапах тестовой сети, что привело к притоку активности разработчиков в Horizen;  повысили безопасность сети Horizen, исправив уязвимость в их приложении узла;  и утвержден важный ZenIP, который сделает Horizen более устойчивым и масштабируемым. В конце апреля devs объявили о Horizen EON, общедоступном сайдчейне смарт-контрактов, совместимой с Proof-of-Stake и Ethereum Virtual Machine (EVM), в постоянно доступной тестовой сети Gobi. Gobi Testnet поддерживает сеть продуктов, интеграций и инструментов, которые расширяют возможности и используют возможности для использования EON.  О Horizen EON и чем он отличается? В то время, как Ethereum отличается обширностью внедрения экосистемы DeFi и смарт-контрактов, Horizen определяет свою межсетевую связь и решение для горизонтального масштабирования Zendoo, потребности более широко внедрить в широком диапазоне частот с настройкой на уровне протокола. С добавлением EON, первого из многих сторонних смарт-контрактов на Horizen, Horizen открывает свою экосистему для более эффективных возможностей для широкой разработки и использования широкого спектра приложений dApp и сервисов, чем когда-либо прежде.  Разработчики Solidity развивали новую логику в обнаружении, чтобы возникали непрерывные инновации без изменений протокола. Сочетая смарт-контракты с регулируемой природной стихией Zendoo и экосистемой безопасного соединения внутри, Horizen теперь предлагает лидерство на рынке решений для продвижения отрасли вперед — не требующую разрешения, интероперабельную, регулируемую сайдчейн-сеть.Также  Horizen, исправив уязвимость в приложении узла;  и утвердил важный ZenIP, который сделает Horizen более устойчивым и масштабируемым.Блог",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "May 21, 2023, 03:21:06 PM",
      "body": "Команда девов монеты Horizen анонсировала новый хардфорк. Он запланирован на 7 июня, приблизительно на 13:00 UTC. Форкинг процветает!Подробности здесьНе знаю, сможет ли Horizen конкурировать с Zcash и Monero, но думаю девы к этому стремятся...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "May 28, 2023, 03:08:15 PM",
      "body": "Информация от кодеров:Zend 3.3.1 перестанет поддерживаться в блоке #1359120, что будет 31 мая 2023 года примерно в 12:00 UTC.  Пожалуйста, обновитесь до версии 4.0.0 до 31 мая.Zend 4.0.0 перестанет поддерживаться в блоке #1422426, который будет 19 сентября 2023 года примерно в 12:00 UTC. Хард-форк будет активирован в основной сети на блоке #1363115, что произойдет 7 июня 2023 года примерно в 13:00 UTC. Этот же хардфорк был  ранее активирован в тестовой сети на блоке #1228700  13 марта в 14:37:43 GMT+0000. Начиная с версии 4.0.0, бинарные файлы zend для Linux будут выпущены только в одной версии, которая включает в себя функции AddressIndexing, которые ранее были доступны только в версии с битовым ядром.  Это означает, что девы  не будут публиковать конкретные версии биткора. Примечания Zend 4.0.0 — последняя версия Zend, поддерживающая Ubuntu Bionic.  Будущие выпуски Zend будут поддерживать только Ubuntu Focal или новее, поскольку Ubuntu Bionic прекращает свое существование с 31 мая 2023.link",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "July 29, 2023, 09:52:41 AM",
      "body": "Кратко пересказ Отчёта за Q2  2023 Года.В апреле Horizen EON запустил  постоянный публичный тестнет GobiTestnet Gobi имеет много улучшений и новых функций со времен предыдущих тестовых сетей, это последний этап бета-тестирования перед активацией сети EON.Тонна работы была проделана и с инфраструктурой, благодаря улучшению шлюза узла ( нашего общедоступного RPC, (доступны в Chainlist ), а также путем создания и интеграции Secure Enclave для сертификаторов, которым не придется беспокоиться о своих ключах подписи, учитывая, что они хранятся в безопасной удаленной среде.Совместимость является одной из многих возможностей, на которые команда сосредоточилась во 2 квартале:Собственная  совместимость традиционных умных контрактовSidechain-to-sidechain  полный рабочий процесс с реальными цепями завершен, и схемы были успешно проверены. Этот важный протокол взаимодействия обеспечивает бесперебойную связь между разными сайдчейнами экосистемы Horizen.Инструменты и ресурсы разработчика EONИмеется обширная документация и учебные пособия для пользователей EON, (ссылки в оригинале отчета)Как запустить ERC-721 NFT на Horizen через ThirdwebКак создать токен ERC-20 на Horizen Horizen документацияРазвертывание dApp с использованием Remix IDECobalt Wallet пошаговое руководствоEON Партнерство и интеграцияHorizen интегрирует Covalent для EON, новой общедоступной EVM-совместимой сайдчейн на Horizen.В апреле мы объявили о партнерстве с Covalent, поставщик данных Web3, которому доверяют более 40 000 разработчиков. Партнерство обеспечит массовую доступность и прозрачность данных для интеллектуальной контрактной платформы Horizen, совместимой с EVM, EON, и предоставит своим разработчикам миллиарды точек данных и всестороннюю информацию о сетевых данных для эффективной сборки и развертывания dApps на Horizen EON. Horizen интегрирует Band протоколHorizen также интегрировала Band Protocol, межчейновую платформу для обработки данных, которая будет обеспечивать ценовые потоки в реальном времени и надежные данные для Horizen EON. Эта интеграция позволяет разработчикам расширять свои возможности интеллектуального контракта на EON Horizen. Партнерство с Ankr.  Eще в июне партнерство с  Auros для повышения ликвидности для EONВо втором квартале провели  первый хакатон на Horizen EON! В CryptScrow Codeathon приняли участие 90 участников, 47 проектов и 15 заявок, посвященных теме создания масштабируемых платформ условного депонирования, решения реальных проблем условного депонирования, интеграции с внешними службами, и оптимизация выплат вознаграждений с Ubiquity DAO. Предстоящая деградация экранированных бассейнов главной цепи Horizen Сообщество Horizen недавно одобрило ZenIP 42204 для обесценивания экранированных пулов основной цепи Horizen – удаление экранированных транзакций с прозрачными входами из основной цепи Horizen, что предотвратит экранированную транзакцию ( T-адреса для Z-адресов ) на уровне консенсуса. После обесценивания экранированных пулов магистральной цепи все функции конфиденциальности будут удалены из основного блокчейна Horizen на консенсусном уровне. Это также означает, что ZEN больше не будет монетой конфиденциальности после этого изменения.Целью этого является обеспечение того, чтобы Horizen делала технологию конфиденциальности правильным и устойчивым способом для стимулирования роста экосистем и минимизации рисков. Pешение  принимается для для устранения технических сложностей  и предотвращения регуляторных угроз, которые могут помешать большему сообществу Horizen в полной мере и свободно участвовать в нашей экосистеме.   Отказ от экранированных пулов основной цепи Horizen будет реализован в рамках предстоящего обязательного обновления программного обеспечения ZEN 4.1. Окна целевого выпуска следующие:Testnet – август 2023Mainnet – сентябрь 2023source",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "April 29, 2024, 03:36:14 PM",
      "body": "Давно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться Вот, например, немного новостейВ середине апреля стало известно, что можно загрузить новую версию ZEN 5.0.2. Выпущен релиз для Mainnet и Testnet.Новая версия ZEN 5.0.2 доступна для загрузки на GitHub и также Docker.Девы собщают, что обновить старые версии ZEN 5.0.0 and ZEN 5.0.1 надо до 7 мая 2024 г. примерно в 3:00 утра по UTC, то есть до  блока  #1554150.Узлы, работающие на Mainnet и Testnet следует обновить этой версией.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fantazy999",
      "created_time": "April 29, 2024, 08:57:19 PM",
      "body": "Quote from: BVeyron on April 29, 2024, 03:36:14 PMДавно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться Вот, например, немного новостейВ середине апреля стало известно, что можно загрузить новую версию ZEN 5.0.2. Выпущен релиз для Mainnet и Testnet.Новая версия ZEN 5.0.2 доступна для загрузки на GitHub и также Docker.Девы собщают, что обновить старые версии ZEN 5.0.0 and ZEN 5.0.1 надо до 7 мая 2024 г. примерно в 3:00 утра по UTC, то есть до  блока  #1554150.Узлы, работающие на Mainnet и Testnet следует обновить этой версией.Не парься она скоро полетит,в ближайшие дни её очередь пришла,я внук бабы Ванги если что)) обрадовал тебя надеюсь!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "April 30, 2024, 06:04:54 PM",
      "body": "Quote from: Fantazy999 on April 29, 2024, 08:57:19 PMQuote from: BVeyron on April 29, 2024, 03:36:14 PMДавно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться ......Не парься она скоро полетит,в ближайшие дни её очередь пришла,я внук бабы Ванги если что)) обрадовал тебя надеюсь!Точно обрадовал. Ну, что ж, все садимся в ракету затарившись Zen-oм и ту зе мун на туземун. Ванговать то вообще-то дело... так себе,  не особо надежное. Но денежное.Хотя внук, это конечно звучит, респект  !!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fantazy999",
      "created_time": "April 30, 2024, 08:09:20 PM",
      "body": "Quote from: BVeyron on April 30, 2024, 06:04:54 PMQuote from: Fantazy999 on April 29, 2024, 08:57:19 PMQuote from: BVeyron on April 29, 2024, 03:36:14 PMДавно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться ......Не парься она скоро полетит,в ближайшие дни её очередь пришла,я внук бабы Ванги если что)) обрадовал тебя надеюсь!Точно обрадовал. Ну, что ж, все садимся в ракету затарившись Zen-oм и ту зе мун на туземун. Ванговать то вообще-то дело... так себе,  не особо надежное. Но денежное.Хотя внук, это конечно звучит, респект  !!! Я не шутил... И насчёт затариться сейчас время на всю котлету! Скидки подошли! И не шучу! И да внук Ванги,потом скажешь,чуть чуть позже! Именно зен , Рен полетят!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fantazy999",
      "created_time": "May 01, 2024, 08:19:53 AM",
      "body": "Quote from: BVeyron on April 30, 2024, 06:04:54 PMQuote from: Fantazy999 on April 29, 2024, 08:57:19 PMQuote from: BVeyron on April 29, 2024, 03:36:14 PMДавно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться ......Не парься она скоро полетит,в ближайшие дни её очередь пришла,я внук бабы Ванги если что)) обрадовал тебя надеюсь!Точно обрадовал. Ну, что ж, все садимся в ракету затарившись Zen-oм и ту зе мун на туземун. Ванговать то вообще-то дело... так себе,  не особо надежное. Но денежное.Хотя внук, это конечно звучит, респект  !!! Ещё коррекция будет,поэтому скидки даже будут!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "May 03, 2024, 03:22:38 PM",
      "body": "Quote from: Fantazy999 on April 30, 2024, 08:09:20 PMQuote from: BVeyron on April 30, 2024, 06:04:54 PMQuote from: Fantazy999 on April 29, 2024, 08:57:19 PMQuote from: BVeyron on April 29, 2024, 03:36:14 PMДавно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться ......Не парься она скоро полетит,в ближайшие дни её очередь пришла,я внук бабы Ванги если что)) обрадовал тебя надеюсь!Точно обрадовал. Ну, что ж, все садимся в ракету затарившись Zen-oм и ту зе мун на туземун. Ванговать то вообще-то дело... так себе,  не особо надежное. Но денежное.Хотя внук, это конечно звучит, респект  !!! Я не шутил... И насчёт затариться сейчас время на всю котлету! Скидки подошли! И не шучу! И да внук Ванги,потом скажешь,чуть чуть позже! Именно зен , Рен полетят!Да я понимаю, и возможно, что и полетит. Теперь вот однако полеты это такое себе не особо понятное событие. Тут ведь надо бы прикинуть какие иксы считать теперь туземуном, а какие простенько, как бы  коррекцией. Вполне возможно, что тема приватности и востребованности таких монет и правда сыграет в плюс так как на Монеро что то в последнее время наезжают по полной, или  вот CoinJoin тоже обломился.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fantazy999",
      "created_time": "May 03, 2024, 03:33:31 PM",
      "body": "Quote from: BVeyron on May 03, 2024, 03:22:38 PMQuote from: Fantazy999 on April 30, 2024, 08:09:20 PMQuote from: BVeyron on April 30, 2024, 06:04:54 PMQuote from: Fantazy999 on April 29, 2024, 08:57:19 PMQuote from: BVeyron on April 29, 2024, 03:36:14 PMДавно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться ......Не парься она скоро полетит,в ближайшие дни её очередь пришла,я внук бабы Ванги если что)) обрадовал тебя надеюсь!Точно обрадовал. Ну, что ж, все садимся в ракету затарившись Zen-oм и ту зе мун на туземун. Ванговать то вообще-то дело... так себе,  не особо надежное. Но денежное.Хотя внук, это конечно звучит, респект  !!! Я не шутил... И насчёт затариться сейчас время на всю котлету! Скидки подошли! И не шучу! И да внук Ванги,потом скажешь,чуть чуть позже! Именно зен , Рен полетят!Да я понимаю, и возможно, что и полетит. Теперь вот однако полеты это такое себе не особо понятное событие. Тут ведь надо бы прикинуть какие иксы считать теперь туземуном, а какие простенько, как бы  коррекцией. Вполне возможно, что тема приватности и востребованности таких монет и правда сыграет в плюс так как на Монеро что то в последнее время наезжают по полной, или  вот CoinJoin тоже обломился.Когда монета торгуется на топ площадках или вышла в торговлю, можешь забыть за проект ,сто там пишут какое у него будущее и прочее,это всё фикция! Когда монета вышла на рынок,у неё стала своя жизнь и больше не какие новости о проекте нах не нужны уже это тебе ещё один подарок,который не кто тебе не скажет этого",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "May 03, 2024, 03:51:00 PM",
      "body": "Quote from: Fantazy999 on May 03, 2024, 03:33:31 PMQuote from: BVeyron on May 03, 2024, 03:22:38 PMQuote from: Fantazy999 on April 30, 2024, 08:09:20 PMQuote from: BVeyron on April 30, 2024, 06:04:54 PMQuote from: Fantazy999 on April 29, 2024, 08:57:19 PMQuote from: BVeyron on April 29, 2024, 03:36:14 PMДавно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться ......Не парься она скоро полетит,в ближайшие дни её очередь пришла,я внук бабы Ванги если что)) обрадовал тебя надеюсь!Точно обрадовал. Ну, что ж, все садимся в ракету затарившись Zen-oм и ту зе мун на туземун. Ванговать то вообще-то дело... так себе,  не особо надежное. Но денежное.Хотя внук, это конечно звучит, респект  !!! Я не шутил... И насчёт затариться сейчас время на всю котлету! Скидки подошли! И не шучу! И да внук Ванги,потом скажешь,чуть чуть позже! Именно зен , Рен полетят!Да я понимаю, и возможно, что и полетит. Теперь вот однако полеты это такое себе не особо понятное событие. Тут ведь надо бы прикинуть какие иксы считать теперь туземуном, а какие простенько, как бы  коррекцией. Вполне возможно, что тема приватности и востребованности таких монет и правда сыграет в плюс так как на Монеро что то в последнее время наезжают по полной, или  вот CoinJoin тоже обломился.Когда монета торгуется на топ площадках или вышла в торговлю, можешь забыть за проект ,сто там пишут какое у него будущее и прочее,это всё фикция! Когда монета вышла на рынок,у неё стала своя жизнь и больше не какие новости о проекте нах не нужны уже это тебе ещё один подарок,который не кто тебе не скажет этого Да, тут ты прав. Хотя немного новости всеж влияют, но наверное в пределах текущих коррекций.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fantazy999",
      "created_time": "May 03, 2024, 06:20:09 PM",
      "body": "Quote from: BVeyron on May 03, 2024, 03:51:00 PMQuote from: Fantazy999 on May 03, 2024, 03:33:31 PMQuote from: BVeyron on May 03, 2024, 03:22:38 PMQuote from: Fantazy999 on April 30, 2024, 08:09:20 PMQuote from: BVeyron on April 30, 2024, 06:04:54 PMQuote from: Fantazy999 on April 29, 2024, 08:57:19 PMQuote from: BVeyron on April 29, 2024, 03:36:14 PMДавно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться ......Не парься она скоро полетит,в ближайшие дни её очередь пришла,я внук бабы Ванги если что)) обрадовал тебя надеюсь!Точно обрадовал. Ну, что ж, все садимся в ракету затарившись Zen-oм и ту зе мун на туземун. Ванговать то вообще-то дело... так себе,  не особо надежное. Но денежное.Хотя внук, это конечно звучит, респект  !!! Я не шутил... И насчёт затариться сейчас время на всю котлету! Скидки подошли! И не шучу! И да внук Ванги,потом скажешь,чуть чуть позже! Именно зен , Рен полетят!Да я понимаю, и возможно, что и полетит. Теперь вот однако полеты это такое себе не особо понятное событие. Тут ведь надо бы прикинуть какие иксы считать теперь туземуном, а какие простенько, как бы  коррекцией. Вполне возможно, что тема приватности и востребованности таких монет и правда сыграет в плюс так как на Монеро что то в последнее время наезжают по полной, или  вот CoinJoin тоже обломился.Когда монета торгуется на топ площадках или вышла в торговлю, можешь забыть за проект ,сто там пишут какое у него будущее и прочее,это всё фикция! Когда монета вышла на рынок,у неё стала своя жизнь и больше не какие новости о проекте нах не нужны уже это тебе ещё один подарок,который не кто тебе не скажет этого Да, тут ты прав. Хотя немного новости всеж влияют, но наверное в пределах текущих коррекций.Новости под график подстраивают,а не наоборот....А все думают,что график под новости! Я тебе написал там ответь!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "May 03, 2024, 08:37:26 PM",
      "body": "Quote from: Fantazy999 on May 03, 2024, 06:20:09 PMQuote from: BVeyron on May 03, 2024, 03:51:00 PMQuote from: Fantazy999 on May 03, 2024, 03:33:31 PMQuote from: BVeyron on May 03, 2024, 03:22:38 PMQuote from: Fantazy999 on April 30, 2024, 08:09:20 PMQuote from: BVeyron on April 30, 2024, 06:04:54 PMQuote from: Fantazy999 on April 29, 2024, 08:57:19 PMQuote from: BVeyron on April 29, 2024, 03:36:14 PMДавно не вспоминал никто эту PoW монету у нас в альткоинах локала. А она тем не менее живет своей жизнью и продолжает развиваться ......Не парься она скоро полетит,в ближайшие дни её очередь пришла,я внук бабы Ванги если что)) обрадовал тебя надеюсь!Точно обрадовал. Ну, что ж, все садимся в ракету затарившись Zen-oм и ту зе мун на туземун. Ванговать то вообще-то дело... так себе,  не особо надежное. Но денежное.Хотя внук, это конечно звучит, респект  !!! Я не шутил... И насчёт затариться сейчас время на всю котлету! Скидки подошли! И не шучу! И да внук Ванги,потом скажешь,чуть чуть позже! Именно зен , Рен полетят!Да я понимаю, и возможно, что и полетит. Теперь вот однако полеты это такое себе не особо понятное событие. Тут ведь надо бы прикинуть какие иксы считать теперь туземуном, а какие простенько, как бы  коррекцией. Вполне возможно, что тема приватности и востребованности таких монет и правда сыграет в плюс так как на Монеро что то в последнее время наезжают по полной, или  вот CoinJoin тоже обломился.Когда монета торгуется на топ площадках или вышла в торговлю, можешь забыть за проект ,сто там пишут какое у него будущее и прочее,это всё фикция! Когда монета вышла на рынок,у неё стала своя жизнь и больше не какие новости о проекте нах не нужны уже это тебе ещё один подарок,который не кто тебе не скажет этого Да, тут ты прав. Хотя немного новости всеж влияют, но наверное в пределах текущих коррекций.Новости под график подстраивают,а не наоборот....А все думают,что график под новости! Я тебе написал там ответь!Пожалуй стоит проверить прогноз внука Ванги.Вот для эксперимента пожалуй зафиксю здесь курс ZEN   на прямо сейчас. Потом взглянем какие иксы получились",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fantazy999",
      "created_time": "May 03, 2024, 08:56:48 PMLast edit: May 03, 2024, 10:14:38 PM by Fantazy999",
      "body": "Quote from: BVeyron on May 03, 2024, 08:37:26 PMПожалуй стоит проверить прогноз внука Ванги.Вот для эксперимента пожалуй зафиксю здесь курс ZEN   на прямо сейчас. Потом взглянем какие иксы получились    Вообще-то я ещё писал когда он 7.9 былНо коррекция сейчас будет! Поэтому брать сейчас не стоит ещё скидки будут и там брать..я тебе в ЛС написал проверь",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}