{
  "id": "topic_5452300",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "May 10, 2023, 08:46:51 PM",
  "content": "https://www.binance.com/en/news/flash/7541996https://twitter.com/ArkhamIntelArkham tweeted that the U.S. government currently holds more than $6 billion worth of bitcoin on-chain. \"The bitcoins they held were seized from three incidents: 69,370 bitcoins were seized from Silk Road in 2020;94,640 bitcoins were seized from Bitfinex hackers in 2022, and Silk Road hacker James Zhong was seized in 2022. There are 51,326 bitcoins (9,861 have been sold and 41,500 are left). The U.S. government announced plans to sell these bitcoins in batches in 2023.\"__They picked the wrong time",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452300",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "May 10, 2023, 08:57:28 PM",
      "body": "The government has always sold on a schedule and everything else around it be damned.They were auctioning off property late 2008 during the banking implosion since that was when it was scheduled for.But, I didn't know they still had so much to do. I thought they had already sold a bunch.Does anyone have a list of all the larger amounts of BTC that governments have seized over the years?-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "May 10, 2023, 09:03:22 PM",
      "body": "Quote from: DaveF on May 10, 2023, 08:57:28 PMThe government has always sold on a schedule and everything else around it be damned.They were auctioning off property late 2008 during the banking implosion since that was when it was scheduled for.But, I didn't know they still had so much to do. I thought they had already sold a bunch.Does anyone have a list of all the larger amounts of BTC that governments have seized over the years?-DaveFrom the news on twitter. I do not guarantee authenticity.Arkham(C) analytics",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 11, 2023, 04:33:53 PM",
      "body": "Is the information published by the United States about the bitcoins it owns 100% accurate, or is there some exaggeration to create a state of fear in the market?For example, I read in some places conflicting information about the quantities seized from the Silk Road (much less than what was reported).Also I'm wondering why US sells bitcoin sources in batches? I mean, the US governments are not friends with Bitcoin and they don't care about the market crash if the quantities are sold all at once!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "May 11, 2023, 04:47:34 PM",
      "body": "Quote from: yhiaali3 on May 11, 2023, 04:33:53 PMIs the information published by the United States about the bitcoins it owns 100% accurateAsk them to sign a message QuoteAlso I'm wondering why US sells bitcoin sources in batches? I mean, the US governments are not friends with Bitcoin and they don't care about the market crash if the quantities are sold all at once!!They may not care about the Bitcoin market, but I'm pretty sure they care about the dollar amount they get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "May 11, 2023, 09:39:48 PM",
      "body": "Recent Datahttps://news.bitcoin.com/us-government-remains-a-top-bitcoin-holder-with-seized-stash-valued-at-5-6-billion/US Government Remains a Top Bitcoin Holder With Seized Stash Valued at $5.6 Billion\"As of March 25, 2023, the U.S. government held 205,515 bitcoins worth $5.6 billion, which is approximately 1.06% of the circulating supply, according to current statistics. The cache of bitcoins is a result of three forfeitures that began in 2020. Glassnode’s on-chain data reveals that on March 9, about 9,860 bitcoins worth roughly $269 million were sent to a Coinbase address.Uncle Sam’s Crypto Stash: How the U.S. Government Became a Top Bitcoin HolderThe U.S. government currently holds 205,515 bitcoins valued at $5.66 billion based on today’s exchange rates. The bitcoins were confiscated in three cases, including the Silk Road bitcoin seizure in November 2020, the 2022 Bitfinex hack confiscation, and the seizure of bitcoins from James Zhong last year. Of the total, 69,369 BTC was seized from “Individual X,” 94,643 BTC was taken from Ilya Lichtenstein and his wife Heather Morgan, and 51,326 BTC was seized from Zhong in November 2022.According to a report from Glassnode on March 9, 2023, some of these bitcoins have moved, reducing the total from 215,338 to 205,515 BTC. “Approximately [40,000 bitcoins] from wallets associated with U.S. Government law enforcement seizures are on the move,” Glassnode reported. “The majority of these appear to be internal transfers (so far). However, around 9,861 [bitcoin] seized from the Silk Road hacker have been sent to our Coinbase cluster.”\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "May 12, 2023, 04:11:37 AM",
      "body": "Quote from: zasad@ on May 10, 2023, 08:46:51 PM__They picked the wrong time I Don't think so! Seized assets are usually sold in batches and it depends on the litigation attached to it. If the court has given a verdict then the government will try to sell the assets to recover the money. They are not HODLers so they won't pick a time based on the market movements. Yes, it will bring an impact on us for sure who have been accumulating bitcoin to find a suitable time to sell. We may need to delay it further because the price is expected to drive downward due to this huge sell of. But that's it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "May 12, 2023, 04:17:32 AM",
      "body": "Quote from: zasad@ on May 10, 2023, 08:46:51 PMThere are 51,326 bitcoins (9,861 have been sold and 41,500 are left). The U.S. government announced plans to sell these bitcoins in batches in 2023.\"__They picked the wrong time They announced it but from announcement to actual dump on the market is different. They might do it in 2023 as announcement or they will postpone it till 2024 or 2025 bull market.I agree that if that they execute it in 2023, they will have a bad execution as if they hold the execution one or two more years, they will gain more money from their selling execution and possibly gain x2, x3, x4 or x5 than the value they can gain if selling in 2023.People were fearful of US. government dump weeks ago but they were over panic about that. 40k or 50k BTC from the US. government is not too big with Bitcoin trading volume in 2023. The market can absorb it very well but price dump will be seen because of panic selling in the crowd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 13, 2023, 04:33:12 AM",
      "body": "Quote from: zasad@ on May 10, 2023, 08:46:51 PMThe U.S. government announced plans to sell these bitcoins in batches in 2023.\"__They picked the wrong time It doesn't seem very smart to me, and not just because of the timing to sell them, but maybe being a member of this forum I am biased. For me in the near future having Bitcoins in reserve is going to be as common for states as gold reserves, which USA keeps mostly in Fort Knox. It would be a bit pathetic for them to sell Bitcoins now only to have to buy or mine them in the future. Although I suppose they could seize them from criminals in the future as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 13, 2023, 07:18:33 PM",
      "body": "Quote from: zasad@ on May 10, 2023, 08:46:51 PMThe U.S. government announced plans to sell these bitcoins in batches in 2023.\"They picked the wrong time The governments often announce their plans to create fear and speculate the situation. They will initially begin to sell some good amount of Bitcoin with an announcement to see if that will affect the price of Bitcoin and create fear in the minds of Holders. And, if they find no fear in the market they will continue selling and announcing.If on the other hand they somehow see the market crashing they might halt the selling process and wait for the market to recover and then resell the remaining bitcoins in same fashion. That way they will sell their bitcoin without even letting them losing their value.I know that they might have picked up the wrong time for those plans, but in crypto market no one really knows when times are right? Some people think that right times are the ones when the market is pumping crazily while others think that the right times are the ones when market is dumping. Everyone has different opinions in that regard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "May 15, 2023, 11:34:01 PM",
      "body": "Quote from: avikz on May 12, 2023, 04:11:37 AMQuote from: zasad@ on May 10, 2023, 08:46:51 PM__They picked the wrong time I Don't think so! Seized assets are usually sold in batches and it depends on the litigation attached to it. If the court has given a verdict then the government will try to sell the assets to recover the money. They are not HODLers so they won't pick a time based on the market movements. Yes, it will bring an impact on us for sure who have been accumulating bitcoin to find a suitable time to sell. We may need to delay it further because the price is expected to drive downward due to this huge sell of. But that's it! Right, they will not just simply dump it just because the litigation is down, not unless the court really gives them the order to sell it right away. Of course, it's better to sell those to recover some money from the seize Bitcoin, but they will have to find a suitable time to sell to at least get a good amount.Not sure about the impact though, we don't hear news until the transaction has been done. But there could be some individuals following those addresses and then report it to the public. Whether their intention is bad (create FUD), or just simply wanting to let us know that the Bitcoin seized has been sold already, OTC or some other ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "May 16, 2023, 03:58:09 AM",
      "body": "Quote from: Baofeng on May 15, 2023, 11:34:01 PMRight, they will not just simply dump it just because the litigation is down, not unless the court really gives them the order to sell it right away. Of course, it's better to sell those to recover some money from the seize Bitcoin, but they will have to find a suitable time to sell to at least get a good amount.Not sure about the impact though, we don't hear news until the transaction has been done. But there could be some individuals following those addresses and then report it to the public. Whether their intention is bad (create FUD), or just simply wanting to let us know that the Bitcoin seized has been sold already, OTC or some other ways.In any case, this will be just another bump in the road, like a wave that should not affect those of us who invest in Bitcoin in the long term. As I said in a previous comment, I would not be surprised if in the future they realize that they will do well to buy Bitcoin, or even mine it. With a little foresight they would hold these. Let them sell, I will continue to hold mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "May 16, 2023, 02:34:55 PM",
      "body": "Quote from: Poker Player on May 13, 2023, 04:33:12 AMIt doesn't seem very smart to me, and not just because of the timing to sell them, but maybe being a member of this forum I am biased. For me in the near future having Bitcoins in reserve is going to be as common for states as gold reserves, which USA keeps mostly in Fort Knox. If I'm not wrong, even people in the government have different stances toward crypto/BTC in general. I'd not be surprised if they will change their decisions if there is a change in power. We do see many decisions getting revised, I doubt they care about their image since they can just refer to the previous government being \"wrong\". CMIIW.Quote from: Poker Player on May 13, 2023, 04:33:12 AMIt would be a bit pathetic for them to sell Bitcoins now only to have to buy or mine them in the future. Although I suppose they could seize them from criminals in the future as well. They can also use exchanges or taxes to collect more Bitcoins imo, although the amount is probably not that much if you compare it to criminals' BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "May 16, 2023, 08:11:00 PM",
      "body": "Quote from: zasad@ on May 10, 2023, 08:46:51 PMhttps://www.binance.com/en/news/flash/7541996https://twitter.com/ArkhamIntelArkham tweeted that the U.S. government currently holds more than $6 billion worth of bitcoin on-chain. \"The bitcoins they held were seized from three incidents: 69,370 bitcoins were seized from Silk Road in 2020;94,640 bitcoins were seized from Bitfinex hackers in 2022, and Silk Road hacker James Zhong was seized in 2022. There are 51,326 bitcoins (9,861 have been sold and 41,500 are left). The U.S. government announced plans to sell these bitcoins in batches in 2023.\"__They picked the wrong time selling bitcoin that don't belong to them imo is an unethical act, and what are they going to do with the money from selling the bitcoins....to pay off debts?  to fund the next presidential campaign?  or something else?if they want to make FUD then the method is completely wrong, the news of the sale of large amounts of Bitcoin will only reduce the sympathy of many people for the US Government, and everyone will think badly of all the catches they managed to get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "May 16, 2023, 10:23:42 PM",
      "body": "Quote from: LoyceV on May 11, 2023, 04:47:34 PMQuoteAlso I'm wondering why US sells bitcoin sources in batches? I mean, the US governments are not friends with Bitcoin and they don't care about the market crash if the quantities are sold all at once!!They may not care about the Bitcoin market, but I'm pretty sure they care about the dollar amount they get.Not necessarily. Remember that the proceeds will go to public funds, so unless the officials responsible for the sale get some sort of commission (or other incentives for maxing up the income) they may simply not care at all about the price.But yes, they tend to sell in batches. As for James Zhong's stash, they sold the first batch in March and intend to sell another 4 (likely each of around BTC10k) during this calendar year, as reported by the Daily Mail:Quote(...) The only difference was size. The government's transaction was for 9,861 Bitcoin, sold for a total $215,738,155.'There remains approximately 41,490.72 BTC, which the Government understands is expected to be liquidated in four more batches over the course of this calendar year,' Felton wrote in a sentencing memo for Zhong filed on March 31.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "May 17, 2023, 08:22:34 PM",
      "body": "Quote from: macson on May 16, 2023, 08:11:00 PMQuote from: zasad@ on May 10, 2023, 08:46:51 PMhttps://www.binance.com/en/news/flash/7541996https://twitter.com/ArkhamIntelArkham tweeted that the U.S. government currently holds more than $6 billion worth of bitcoin on-chain. \"The bitcoins they held were seized from three incidents: 69,370 bitcoins were seized from Silk Road in 2020;94,640 bitcoins were seized from Bitfinex hackers in 2022, and Silk Road hacker James Zhong was seized in 2022. There are 51,326 bitcoins (9,861 have been sold and 41,500 are left). The U.S. government announced plans to sell these bitcoins in batches in 2023.\"__They picked the wrong time selling bitcoin that don't belong to them imo is an unethical act, and what are they going to do with the money from selling the bitcoins....to pay off debts?  to fund the next presidential campaign?  or something else?if they want to make FUD then the method is completely wrong, the news of the sale of large amounts of Bitcoin will only reduce the sympathy of many people for the US Government, and everyone will think badly of all the catches they managed to get.All money confiscated from criminals in the US will go to the country's budget, and I don't think it's unethical. This is the policy in all countries. For the American budget, this is a small amount, and for the bitcoin market, the sale of 200,000 coins can collapse prices in the market greatly. But if they sell in parts, then this does not seriously affect the prices in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "May 17, 2023, 09:08:42 PM",
      "body": "Quote from: zasad@ on May 17, 2023, 08:22:34 PMQuote from: macson on May 16, 2023, 08:11:00 PMQuote from: zasad@ on May 10, 2023, 08:46:51 PMsnip__They picked the wrong time selling bitcoin that don't belong to them imo is an unethical act, and what are they going to do with the money from selling the bitcoins....to pay off debts?  to fund the next presidential campaign?  or something else?if they want to make FUD then the method is completely wrong, the news of the sale of large amounts of Bitcoin will only reduce the sympathy of many people for the US Government, and everyone will think badly of all the catches they managed to get.All money confiscated from criminals in the US will go to the country's budget, and I don't think it's unethical. This is the policy in all countries. For the American budget, this is a small amount, and for the bitcoin market, the sale of 200,000 coins can collapse prices in the market greatly. But if they sell in parts, then this does not seriously affect the prices in the market.AFAIK every catch is stored or destroyed before the trial or returned to the party victim because i highlighted the catch of an exchange hacker, there were many victims who were harmed why not return it? cmiiwthe thing about them going to sell all the bitcoins they're catching slowly is also a concern to me, it's definitely looking like FUD, to make the market shake a little.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "May 18, 2023, 11:11:01 AM",
      "body": "Quote from: macson on May 17, 2023, 09:08:42 PMQuote from: zasad@ on May 17, 2023, 08:22:34 PMQuote from: macson on May 16, 2023, 08:11:00 PMQuote from: zasad@ on May 10, 2023, 08:46:51 PMsnip__They picked the wrong time selling bitcoin that don't belong to them imo is an unethical act, and what are they going to do with the money from selling the bitcoins....to pay off debts?  to fund the next presidential campaign?  or something else?if they want to make FUD then the method is completely wrong, the news of the sale of large amounts of Bitcoin will only reduce the sympathy of many people for the US Government, and everyone will think badly of all the catches they managed to get.All money confiscated from criminals in the US will go to the country's budget, and I don't think it's unethical. This is the policy in all countries. For the American budget, this is a small amount, and for the bitcoin market, the sale of 200,000 coins can collapse prices in the market greatly. But if they sell in parts, then this does not seriously affect the prices in the market.AFAIK every catch is stored or destroyed before the trial or returned to the party victim because i highlighted the catch of an exchange hacker, there were many victims who were harmed why not return it? cmiiwthe thing about them going to sell all the bitcoins they're catching slowly is also a concern to me, it's definitely looking like FUD, to make the market shake a little.Okay, but who should return the coins that were seized from the organizers of the Silk Road or exchangers who are engaged in illegal money laundering activities according to the US law enforcement agencies?Cases for the return of funds after theft from the exchange are long, see the story with Mt.Gox.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "May 19, 2023, 02:46:43 AM",
      "body": "Quote from: yhiaali3 on May 11, 2023, 04:33:53 PMIs the information published by the United States about the bitcoins it owns 100% accurate, or is there some exaggeration to create a state of fear in the market?For example, I read in some places conflicting information about the quantities seized from the Silk Road (much less than what was reported).Also I'm wondering why US sells bitcoin sources in batches? I mean, the US governments are not friends with Bitcoin and they don't care about the market crash if the quantities are sold all at once!!Even tho the source is not 100% accurate but we all know that the US has the bitcoin from silk road and etc and We all know about chipmixer maybe they added a little bit from chipmixer too. Im curious to why they sell in batches but the best guess is the US need a better price or there is no exchange that have liquidity of cash if they want to sell all of them. One thing for sure that big red candle stick on daily timeframe is coming. And Lastly what they are gonna do with the cash after they sell all of it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "May 19, 2023, 02:53:28 AM",
      "body": "Quote from: dansus021 on May 19, 2023, 02:46:43 AMAnd Lastly what they are gonna do with the cash after they sell all of it Well, if they were to receive the money that by selling all of it, it would probably go to the funds for these different things.Compensation to the victimsFunding to the different agencies that helped with the seized coinsGeneral funding for the governmentThe most important part IMO is the compensation to victims. Affected by those hacks etc. Imagine waiting for so long to get something back or something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}