{
  "id": "topic_5468731",
  "title": "Crypto4Eternity",
  "author": "Crypto4Eternity",
  "created_time": "October 01, 2023, 04:39:47 AMLast edit: October 06, 2023, 03:18:51 AM by Crypto4Eternity",
  "content": "Hello!I'm looking to sell a crypto website that I've been working on for just over a year now, which averages about 90k traffic requests per 30 days (month). Website link for sale: https://cryptohut.xyz/Current Price for sale (I'm also open to reasonable offers in PM or as a reply): 0.02BTCI spent about 200 USD on the plugins and themes but hosting only cost me around $35 USD. So for the buyer of the website it would only cost them the hosting cost.At the peak of this website, I made a profit of about $250 USD (after costs) (business partnerships, referral link revenue, ad revenue, exchange revenue and donations from the community).This website is ready to be scaled and all it needs is people who have the determination and time available (like what I had when I first made the website).The website comes with: - WordPress website ready for scaling - WordPress dashboard with paid plugins/theme- Website optimised for SEO with A+ SEO rating (+ very fast loading speed)- Built-in blog functions, working no KYC exchange, and 5 tools including a market cap tool.- Domain (Cryptohut.XYZ)- Working Google Analytics- Approved Google AdSense, Approved Bitmedia, and a-ads. - Cloudflare firewall + analytics and logs - Email address- Fully setup Google search console, Bing webmaster tools and Yandex- 300+ member Discord server + moreI'm offering my personal support to the buyer including the migration of all account details/files and after the sale, if they face any issues. *Please note that the buyer will need to have a WordPress hosting provider set up and a domain provider (these days a single provider has both) so that I can safely transfer the website ownership to them.I'm new to this forum so I'm happy to use any trusted bitcointalk escrows. If this post is in the wrong place please let me know or if there is another issue please let me know.Below are some images of the site, dashboard, Google Adsense and Cloudflare:https://i.ibb.co/VWqcpyQ/Screenshot-2023-10-01-at-12-27-02-pm.pnghttps://i.ibb.co/rHvzkFR/Screenshot-2023-10-01-at-12-27-20-pm.pnghttps://i.ibb.co/pjG6K7Y/Screenshot-2023-10-01-at-12-28-28-pm.pnghttps://i.ibb.co/L8MyjXw/Screenshot-2023-10-01-at-12-29-29-pm.pnghttps://i.ibb.co/nMqHpM2/Screenshot-2023-10-01-at-12-31-46-pm.pnghttps://i.ibb.co/s3Wk62M/1.png",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468731",
  "comments": [
    {
      "author": "Crypto4Eternity",
      "created_time": "October 04, 2023, 01:23:06 AM",
      "body": "Oh, that was staff members from a few Discord servers since at the time there were quite a bit of impersonation scams targeting those servers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto4Eternity",
      "created_time": "October 04, 2023, 12:47:30 PM",
      "body": "Hey Eclipse33,At the bottom of my original post, there are screenshots with one of them containing the WordPress dashboard of the site.Since the website is built using WordPress that is why I shared pictures of the dashboard. I could share screenshots to the files of the website but I did not see that as necessary.There were never any other staff members involved inside the website. I'm the sole founder and owner of the site. I designed the website to be able to try and compete with other crypto blog websites that had lots of staff members. I mentioned on the About page that the company is a global organization because we have partnered with many companies across the globe. Sorry for any confusion this may have caused.With regard to the price, I set the price since this was the price point that another website was selling with a similar design and traffic. I'm open to any reasonable offers. I choose not to list it on other website marketplaces since they ask for a local currency and since my website is crypto I thought it would be nice to have the new owner purchase the website with the same type of currency the website promotes.I hope this answers your questions. I'm happy to answer any more questions you may have!Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto4Eternity",
      "created_time": "October 05, 2023, 01:23:30 AM",
      "body": "I might try to sell somewhere else. Thanks guys!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 06, 2023, 12:09:40 AM",
      "body": "Quote from: Crypto4Eternity on October 05, 2023, 01:23:30 AMI might try to sell somewhere else. Thanks guys!Wherever you are trying to sell this site try to present accurate information, you will achieve nothing by falsely increasing numbers. You say that you have 90k monthly visits, which is not even close to true. You may have done it once with fake traffic, but it is very easy to check the real situation.Your claim:Quote from: Crypto4Eternity on October 01, 2023, 04:39:47 AMI'm looking to sell a crypto website that I've been working on for just over a year now, which averages about 90k traffic requests per 30 days (month). Reality:It's definitely not worth the price you're asking.Good luck with the sale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto4Eternity",
      "created_time": "October 06, 2023, 03:17:12 AM",
      "body": "Sorry for any confusion this caused. I mentioned traffic requests which from my understanding meant the amount of requests from traffic that my website received. The website that you use may not be too accurate since it does not account for the users who block or don't allow any tracking on my website. Below is the TOTAL REQUESTS TRAFFIC MADE from last month. https://i.ibb.co/XJK9pMz/Screenshot-2023-10-06-at-11-14-33-am.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}