{
  "id": "topic_5460244",
  "title": "Jayjones",
  "author": "Jayjones",
  "created_time": "July 18, 2023, 04:30:41 PM",
  "content": "Gostaria de saber a previsao de preco dos participantes aqui do forum para daqui 10 anos.Minha previsao: 300k USD = 1 BTC",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460244",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "July 18, 2023, 05:26:11 PMLast edit: July 18, 2023, 07:21:38 PM by bitmover",
      "body": "Previsões ou meros chutes, normalmente todo mundo é bullish pra bitcoin no longo prazoRecentemente eu mostrei a perspectiva de uma gestora de fundos conhecida, a ARK investment. Eles fizeram essa previsão no começo de 2023.A previsão deles é entre 250 mil  e 1,4 milhão de dólares.Quote from: bitmover on February 06, 2023, 04:47:49 PMA Ark investment é uma gestora de etf de alto risco, com foco em inovação em setores variados (farmácia,  tecnologia, blockchain,  impressão 3d, viagem espacial e por aí vai).Eles fizeram uns 2 anos atrás uma previsão de 1 milhão de usd pro bitcoin em 2030, e mantiveram a precisão esse anoRelatório completo muito bacana pode ser visto abaixo. Big ideas 2023, cheio de ideias interessantes https://ark-invest.com/big-ideas-2023/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 18, 2023, 05:29:33 PM",
      "body": "Bem difícil sua pergunta pois tem quase que infinitas possibilidades hahahaMas vamos lá, exercício de pensamento:Em 2033 o BTC já terá passado pelo 6º halving, e se o BTC estiver seguindo essa linha de investimentos, ETFs aprovados, reserva de valor, não sendo banido, eu acreditaria em um valor aproximado de 200 mil dólares mais ou menos, sendo que não teria mais bull runs, e a cada ano o BTC aumentaria um pouquinho de valor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 18, 2023, 09:06:22 PM",
      "body": "Cheguei num ponto em minha vida que já não faço mais previsões de nada. Para mim, é o aqui e agora. Como você é jovem, faz bem em fazer previsões, mas não me focalizaria apenas nisso. Hoje em dia tem muitas áreas para se dedicar, além das criptomoedas. Tende encarar criptomoedas como um \"plus\", um algo mais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "July 19, 2023, 06:35:27 AM",
      "body": "Quote from: Jayjones on July 18, 2023, 04:30:41 PM(...)Bom, acho que é o sonho de qualquer investidor saber o valor de um determinado ativo no futuro   Confesso que 10 anos é um tempo significativo, atéw la nao tenho duvidas de que diversas eventos podem causar muito \"ruido\" no preço do Bitcoin, como por exemplo, guerras, inflacao e etc.Ja no curto prazo, eu acredito que é mais \"previsivel\" de nós estipularmos um valor futuro para o Bitcoin.No curto prazo, eu estou um pouco \"bullish\", no ano que vem teremos o tão aguardado halving, e eu acredito que isso poderá tendenciar um aumento no valor do Bitcoin 9só não sei se será um aumento expressivo podendo ultrapassar o ATH que já tivemos do BTC.nwe=em ligo 190 anos, só quereo q mais pessoas usemSendo sincero, eu não estou MUITO preocupado com o valor do BTC daqui 10 anos, a unica coisa que eu gostaria de ver no futuro é, uma grande disseminação e adoção das pessoas na utilização do Bitcoin, seja ele como investimento ou como uma forma de pagamento.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 20, 2023, 06:53:54 AM",
      "body": "Quote from: Jayjones on July 18, 2023, 04:30:41 PMGostaria de saber a previsao de preco dos participantes aqui do forum para daqui 10 anos.Bem, será que daqui a 10 anos o Mundo ainda existe (tal como o conhecemos)?  Um tiro de 10 anos é bem longo mesmo, claro que palpite é só isso mesmo, mas não ficaria admirado se o valor estivesse na casa dos $200k.Agora uma pergunta mais interessante:  @Jayjones porque você perguntar por uma previsão daqui a 10 anos?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 20, 2023, 10:20:20 AM",
      "body": "Quote from: Paredao on July 18, 2023, 09:06:22 PMCheguei num ponto em minha vida que já não faço mais previsões de nada. Para mim, é o aqui e agora. Como você é jovem, faz bem em fazer previsões, mas não me focalizaria apenas nisso. Hoje em dia tem muitas áreas para se dedicar, além das criptomoedas. Tende encarar criptomoedas como um \"plus\", um algo mais.Tal e qual. Eu também não faço previsões nem tão pouco ando a ver o valor de Bitcoin todos os dias e nem todas as semanas. É ir fazendo DCA e deixar o tempo passar! O valor há-de vir com o tempo, com a adopção e com as circunstâncias políticas que vamos atravessando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "July 20, 2023, 12:55:45 PM",
      "body": "Ao contrário dos amigos, eu acho bem legal fazer previsões e ando fazendo bastante esse tipo de exercicio imaginativo.Como o mercado estará ano que vem? E em 5 anos? Como eu quero estar em 5 anos e em 10?Acho que não fazemos projeções e não vamos atrás dessas metas, as coisas não caminham tão bem. Acho que os chutes de $300-400k são bem razoáveis, ainda mais contando com a inflação das moedas. O Bitcoin pode chegar nesse patamar e não necessariamente significar um ganho em termos de valor real e poder de compra tão grande. A cada 7 anos consideram que acontece uma ''pequena'' crise de crédito e a cada 70, uma grande. Então considerando esses eventos, acho que $500k com um poder de compra marginal menor, é bem razoável. Então fico entre $300-$500k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 20, 2023, 08:38:12 PM",
      "body": "Quote from: darkv0rt3x on July 20, 2023, 10:20:20 AMTal e qual. Eu também não faço previsões nem tão pouco ando a ver o valor de Bitcoin todos os dias e nem todas as semanas. É ir fazendo DCA e deixar o tempo passar! O valor há-de vir com o tempo, com a adopção e com as circunstâncias políticas que vamos atravessando.No mundo atual, não tem como fazer previsões de nada. Veja o caso da Guerra na Ucrânia. Imagina se o louco do presidente russo resolve usar armas nucleares no conflito. Com certeza os Estados Unidos e o restante da OTAN irá reagir e contra-atacar também com armas nucleares. Daí o mundo já era. Aqui no Brasil estreia hoje nos cinemas, um filme contando a história de Robert Oppenheimer, o pai da bomba atômica. É bem interessante. Mostra ele no início como defensor do armamento nuclear e depois de ver os estragos proporcionados por tal evento virou pacifista e anti-nuclear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 20, 2023, 08:58:29 PM",
      "body": "Quote from: Paredao on July 20, 2023, 08:38:12 PMQuote from: darkv0rt3x on July 20, 2023, 10:20:20 AMTal e qual. Eu também não faço previsões nem tão pouco ando a ver o valor de Bitcoin todos os dias e nem todas as semanas. É ir fazendo DCA e deixar o tempo passar! O valor há-de vir com o tempo, com a adopção e com as circunstâncias políticas que vamos atravessando.No mundo atual, não tem como fazer previsões de nada. Veja o caso da Guerra na Ucrânia. Imagina se o louco do presidente russo resolve usar armas nucleares no conflito. Com certeza os Estados Unidos e o restante da OTAN irá reagir e contra-atacar também com armas nucleares. Daí o mundo já era. Aqui no Brasil estreia hoje nos cinemas, um filme contando a história de Robert Oppenheimer, o pai da bomba atômica. É bem interessante. Mostra ele no início como defensor do armamento nuclear e depois de ver os estragos proporcionados por tal evento virou pacifista e anti-nuclear.Sim, as coisas estão extremamente voláteis desde 2019 pelo menos, com o aparecimento da pandemia. E a cada ano se adensam mais as manifestações, as crises políticas, as crises económicas e toda a sociedade sofre com isso. E a economia reage de acordo. E eu até nem sei como é que isto não teve ainda consequências mais catastróficas que as que estamos a ver com a situação da dependência da Europa da energia russa! Pensei que ia ser bem pior em menos tempo e afinal a coisa até se aguentou mais ou menos!Não tivémos um corte total do fornecimento russo e conseguiram-se arranjar algumas alternativas!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 20, 2023, 11:53:16 PM",
      "body": "Quote from: darkv0rt3x on July 20, 2023, 08:58:29 PMSim, as coisas estão extremamente voláteis desde 2019 pelo menos, com o aparecimento da pandemia. E a cada ano se adensam mais as manifestações, as crises políticas, as crises económicas e toda a sociedade sofre com isso. E a economia reage de acordo. E eu até nem sei como é que isto não teve ainda consequências mais catastróficas que as que estamos a ver com a situação da dependência da Europa da energia russa! Pensei que ia ser bem pior em menos tempo e afinal a coisa até se aguentou mais ou menos!Não tivémos um corte total do fornecimento russo e conseguiram-se arranjar algumas alternativas!A coisa até não ficou pior, porque na realidade as sansões foram mais teóricas que outra coisa. Alemanha depende muito do gás russo, eles nunca iriam aceitar fechar a torneira de um dia para o outro. E a Rússia sabe disso, porque isso é que ainda existe guerra. Se realmente a torneira tivesse fechado, talvez a guerra já tinha acabado, mas a Europa Central, tinha de estar disposta a não ter ar condicionado ou aquecimento nas casas, durante uns bons meses. Para não falar das fabricas que teria de trabalhar a 50%. Mesmo assim, a inflação na Alemanha esta de doidos...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 21, 2023, 08:39:55 AM",
      "body": "Quote from: joker_josue on July 20, 2023, 11:53:16 PMQuote from: darkv0rt3x on July 20, 2023, 08:58:29 PMSim, as coisas estão extremamente voláteis desde 2019 pelo menos, com o aparecimento da pandemia. E a cada ano se adensam mais as manifestações, as crises políticas, as crises económicas e toda a sociedade sofre com isso. E a economia reage de acordo. E eu até nem sei como é que isto não teve ainda consequências mais catastróficas que as que estamos a ver com a situação da dependência da Europa da energia russa! Pensei que ia ser bem pior em menos tempo e afinal a coisa até se aguentou mais ou menos!Não tivémos um corte total do fornecimento russo e conseguiram-se arranjar algumas alternativas!A coisa até não ficou pior, porque na realidade as sansões foram mais teóricas que outra coisa. Alemanha depende muito do gás russo, eles nunca iriam aceitar fechar a torneira de um dia para o outro. E a Rússia sabe disso, porque isso é que ainda existe guerra. Se realmente a torneira tivesse fechado, talvez a guerra já tinha acabado, mas a Europa Central, tinha de estar disposta a não ter ar condicionado ou aquecimento nas casas, durante uns bons meses. Para não falar das fabricas que teria de trabalhar a 50%. Mesmo assim, a inflação na Alemanha esta de doidos...Claro que não. Se isso acontecesse, o fechar a torneira por completo, ia morrer imensa gente na Europa com frio. Nós em Portugal até que ainda não temos a infraestrutura de gás que alguns países desenvolvidos da Europa e consumimos mais energia de outras fontes, mas se fosse esse o caso, seria um desastre.Para além disso, a questão das sansões, acho que nem foi o terem sido teóricas, foi a questão de terem sido sansões pouco radicais e que deixaram ainda caminhos abertos para a Rússia continuar a receber dinheiro para continuar a pagar a guerra. Porque é que não baniram os SWIFTS dos bancos do sistema Russo? Isso é que seria um golpe mais fodido. Mas depois ia haver falhas de pagamentos de serviços aos Russos e esses serviços seriam simpelsmente cortados!Outra manobra foi que mesmo com a diminuição da compra directa de recursos naturais na área da energia, como petróleo, esse petróleo continuou a chegar à Europa mas por vias indirectas. Como foi o exemplo que veio a público de a Rússia fazer chegar o petróleo deles à Europa via Índia. E o dinheiro continuou a entrar!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "July 21, 2023, 11:29:17 AM",
      "body": "mais do que agora e performando melhor que qualquer outro ativoqualquer resposta com um valor exato não passa de um chutepor curiosidade fui pesquisar a inflação na Alemanhaquase 8% em 2022https://exame.com/economia/inflacao-bate-recorde-historico-na-alemanha-em-2022/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "July 21, 2023, 11:40:03 AM",
      "body": "Gente, mais o risco de uma bomba nuclear ou de qualquer outro evento absurdo sempre vai ter. Por haver a possibilidade de cisnes negros sempre não significa que não devemos nos organizar, planejar e fazer projeções. Existem inclusive algumas coisas que pode te ajudar em quase todas as situações. Por exemplo a autossuficiencia de recursos. E FAZER PROJEÇÕES e se planejar. A possibilidade da ocorrência de fenômenos inesperados é inclusive um ótimo motivo para que possamos fazer essas projeções e planejamentos e não o inverso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 21, 2023, 12:05:46 PM",
      "body": "Quote from: Disruptivas on July 20, 2023, 12:55:45 PMAo contrário dos amigos, eu acho bem legal fazer previsões e ando fazendo bastante esse tipo de exercicio imaginativo.Como o mercado estará ano que vem? E em 5 anos? Como eu quero estar em 5 anos e em 10?Eu também gosto de fazer esse exercício de pensamento e usar um pouco de criatividade e imaginação  Até porque é impossível se planejar sem pensar nos possíveis cenáriosE são perguntas como esse que nos fazem conversar, debater, expor os ponto de vista e aprendermos ainda maisQuando eu me planejo eu penso nos cenários:1 - se o BTC acabar e valer 02 - se o BTC ficar nessa média 20k a 100k3 - se o BTC disparar e valer mais de 100k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "July 21, 2023, 03:21:40 PM",
      "body": "Cara, hoje mesmo estava lendo a carta do Howard Marks, que é um analista que o próprio Buffet diz que gosta muito de ler. E em uma parte, ele diz o seguinte:'' O ponto principal do que foi dito acima é que simplesmente não sabíamos nada sobre o que o futuro reservava. Mas enquanto algumas pessoas pensam que a ignorância em relação ao futuro significa que não devem tomar nenhuma atividade, alguém que pensa no assunto de forma lógica e sem emoção deve reconhecer que a ignorância não significa que deve se manter na posição em que se está.''",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 21, 2023, 06:52:20 PM",
      "body": "Quote from: Disruptivas on July 21, 2023, 11:40:03 AMGente, mais o risco de uma bomba nuclear ou de qualquer outro evento absurdo sempre vai ter. Por haver a possibilidade de cisnes negros sempre não significa que não devemos nos organizar, planejar e fazer projeções. Existem inclusive algumas coisas que pode te ajudar em quase todas as situações. Por exemplo a autossuficiencia de recursos. E FAZER PROJEÇÕES e se planejar. A possibilidade da ocorrência de fenômenos inesperados é inclusive um ótimo motivo para que possamos fazer essas projeções e planejamentos e não o inverso. Por um lado, entendo o que voce quer dizer. Devemos nos planejar pensando em todos os cenários adversos possíveis no futuro.Por outro lado, fazer previsões é meio inútil. Estão todas erradas.Quem acompanha essas previsões de mercado já há alguns anos vê isso. Quem diria 2 anos atrás que iriamos ter juros acima de 5% nos EUA? Ou inflações maiores na Europa e EUA do que no Brasil?Então , fazer previsões de preço do Ibovespa, SP500, bitcoin, etc ,  dá mais errado do que certo. Ninguém acerta.Contudo, não é por isso que não devemos comprar os ativos e nos expor aos diversos riscos que existem. Ativos de risco que valham a pena correr.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 21, 2023, 07:02:25 PM",
      "body": "Quote from: Disruptivas on July 21, 2023, 11:40:03 AMGente, mais o risco de uma bomba nuclear ou de qualquer outro evento absurdo sempre vai ter. Por haver a possibilidade de cisnes negros sempre não significa que não devemos nos organizar, planejar e fazer projeções. Existem inclusive algumas coisas que pode te ajudar em quase todas as situações. Por exemplo a autossuficiencia de recursos. E FAZER PROJEÇÕES e se planejar. A possibilidade da ocorrência de fenômenos inesperados é inclusive um ótimo motivo para que possamos fazer essas projeções e planejamentos e não o inverso. É sempre bom a pessoa planear, e estar prevenida para qualquer situação mais dramática.Não por a pessoa ter um kit de emergência, prevendo uma catástrofe natural, que quer dizer que irá acontecer esse previsão. A pessoa apenas esta prevenida para algo do género ocorra. E pode passar a vida toda e nunca acontecer.Acho que o problema não esta nas previsões, mas sim a pessoa fazer girar a sua vida a volta de uma ou mais previsões.A pessoa prever o que pode acontecer, e preparar-se para esse tipo de situação, acho bem.A pessoa viver apenas com base nessa previsão, acabando por prejudicar outros aspetos da vida, acho mal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "July 21, 2023, 08:31:38 PM",
      "body": "Quote from: Disruptivas on July 21, 2023, 11:40:03 AMGente, mais o risco de uma bomba nuclear ou de qualquer outro evento absurdo sempre vai ter. Por haver a possibilidade de cisnes negros sempre não significa que não devemos nos organizar, planejar e fazer projeções. Existem inclusive algumas coisas que pode te ajudar em quase todas as situações. Por exemplo a autossuficiencia de recursos. E FAZER PROJEÇÕES e se planejar. A possibilidade da ocorrência de fenômenos inesperados é inclusive um ótimo motivo para que possamos fazer essas projeções e planejamentos e não o inverso. É que com a idade chegando, a maioria das pessoas começam a ficar \"down\" mesmo. Tem certos idosos que não são assim, mas a maioria é com toda a certeza. Principalmente quando chega o Inverno. Veja nos Estados Unidos, por exemplo, uma boa parte dos idosos mudam para Miami depois da aposentadoria. Certamente é por causa do clima quente da região. Hahaha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "July 21, 2023, 09:11:28 PM",
      "body": "Acho que sempre que nos posicionamos em algum investimento, trabalhamos em algo ou enfim gastamos a nossa energia em algum projeto é porque acreditamos no potencial e no meu caso sempre tento projetar alguns números e inevitavelmente fazer algumas previsões/projeções. Nunca vamos acertar 100% mas o importante é ter uma base fundamentalista sobre nossas atitudes.Quanto maior o prazo da projeção maior a possibilidade de errar, então BTC para daqui 10 anos é algo que realmente nem consigo pensar em algum valor. Mas para daqui 2 a 3 anos eu acredito muito em novo ATH e é por isso que estou posicionado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}