{
  "id": "topic_5447158",
  "title": "Huppercase",
  "author": "Huppercase",
  "created_time": "April 01, 2023, 01:54:29 PMLast edit: April 01, 2024, 11:28:12 AM by Huppercase",
  "content": "[This thread was started by sheenshane but abandoned without updates, this combine the previous thread and the upated events]April fool jokes are fun, and it has been a tradition on the forum on every first day of the month of April that Theymos(Administrator) usually played jokes with members on the forum, although people who have experienced one or two Aprils would be familiar with how much fun it used to be, the first time are the ones who mostly create most of the threads asking questions if something is wrong with their account or if the forum is experiencing a bug or glitch.The most fascinating aspect is that the old members do play along and appear as if they don't know what's going on, as we have today, many threads have been opened for questions, and some other members who offer signature service management have made jaw tantalizing rates threads to fool participants.However, the objective of this thread is to inform other people who were not here when it started and are interested in learning about earlier April fools that have been done by the administrator. This thread recognized the previous April fool that Theymos has played on every first of April since 2015.April fool dates|April fool Events|Brief description of what happened01/04/2015|Avatars-re-enabled in the forum|In the year 2013, the forum avatars were disabled for everyone not until 2015 when he re-enable it for everyone but it was restricted for Newbie, J. Member, and Member accounts. Not only that, something interesting happened that day: the avatars displayed on users accounts were meme avatars, not the actual ones they uploaded; when you log in to your account, your real avatar is displayed on your profile, but when you log out, it displays a meme avatar.01/04/2016|The up-side-down words or inverted the word \"bitcoin\"(uᴉoɔʇᴉq)|On this day, members of the forum noticed a change in the characters of bitcoin letters, it transformed from bitcoin to uᴉoɔʇᴉq, not just that, other users found that other popular coins then like litecoin changed to Lightcoin, DOGE changed to Catecoin, and Ethereum changed to Athereum. Although some members played along to capitalize(uppercase) the characters and they were able to avoid the trick.01/04/2017|Random badges on profile|On this day, some members in the forum had 1 to 4 coins on their profile randomly with random titles to members who never had interest but it turn out that members that got the badge outnumbered admin expectations.01/04/2018| [April fools] New new rank requirements|Theymos used a new rank requirement to joke with members with Activity, Merit, Politeness, fMerit, Imagination, Virtue, Coins, Karma, and Posts. The values they each carry depend on how active you have been on the forum, the impression, the posting style, and the character each user has been using on the forum and this new rank lasted within 24 hours.01/04/2019|KYC now required|To prevent fraud and multiple accounts, Theymos requested users do undergo a KYC for their account which was all jokes, and also to be extra verified, members were asked to upload a selfie. However, what was initially meant to be a joke was taken seriously by some users as 2541 members uploaded their pictures; Theymos knew some people would fall for the joke, and none of the pictures were captured by Bitcointalk.01/04/2020|April fools 2020 \"virus\"|This was the year that Coronavirus spread and fear was around everybody, so the administrator decided to raise the stakes by displaying digital virus codes on posts, comments, and profiles. This made profiles appear as if they had been compromised by a virus, which was somewhat frightful given how close social distances were at the time and how little movement there was. However, it was just a traditional April fool's joke.01/04/2021|Introducing NFTs for forum members|Crypto was having all attention shift to NFT in 2021 and as valuable digitals art was then, the Admin decided to introduce Fnfts for members and also a marketplace where everyone can put them for sale and you can be lucky to sell fnfts for a whoop of 50BTC, who doesn't like such amount of bitcoin? That was how some people fell for the Joke.01/04/2022|IQ testing now required before posting| Questions were embedded on before posts, replies or to edit posts in other to improve the forum experience, the answer each user got were used to determine their IQ and it was openly displayed on the profiles for other members to see, some people perform very well while some knew it was all joke.01/04/2023|New CAPTCHA now required before posting| This time, the admin wan to battle low-quality posts and introduced a Beta captcha that all the users must pass through as a requirement before posting and users who failed to pass the captcha will have ''This user is a suspected spammer!'' on their posts and after two weeks, they will ban but how do you pass a captcha that requests you to play DEFEAT FLAPPY BIRD, funny right, it is all joke.01/04/2024|Adjustments to Merit calculation|Theymos introduce a new system of merit in a way that for every 15 characters that you write, you get merit deduction. Also introduced a system to encourage members to have more merit when they stay online to read posts. However, the catch is that the merit you receive or loss does not affect your smerit, which means you will not receive any smerit to send out or lose the ones you have already. Don't worry, it's all part of the April Fools' joke.01/04/2025|TBA| TBAI believe that as the year goes on and the forum expands with more members, the more entertaining they will become. I expect to see more April 1st jokes every year, and what makes it even more entertaining is that some users have added their own jokes to keep the boards fun. Enjoy!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447158",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "April 01, 2023, 02:07:57 PM",
      "body": "It's great that you actually researched on any previous thread which has been made on the topic before making yours. That's one effort many thread posters do not put in and we have multiple repeat threads littered across the various boards.Nice compilation too, I think my favorite is the first one I experienced which talked about KYC being required on the forum, it had the surprise factor cause I was not looking forwards to it at all, which I was in subsequent pranks I have seen.I would like to see NFTs truly implemented on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "April 01, 2023, 02:12:23 PM",
      "body": "I remembered some took offense at the COVID one just because it was similar to the real thing and was deemed distasteful.Still, the spread was fun af.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snipie",
      "created_time": "April 01, 2023, 02:17:01 PM",
      "body": "I am getting old apparently! I still remember the 2018 April fools joke like it was yesterday. I had to check theymos post to be sure that it was 5 years ago!!fmerit, politeness and the other stuff lol. Almost got me in the first look and wondered whether it will be a permanent things",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "April 01, 2023, 02:27:49 PMLast edit: April 01, 2023, 02:39:06 PM by Nheer",
      "body": "Wow the Administrator sure is fun and entertaining. I didn't even know these pranks had been going on for so long. I believed it right away and even predicted that many accounts would be deleted after two weeks, but I had a doubt because it wouldn't be just if legendary and hero members lost their accounts as a result of a post.I enjoyed reading this post, will be waiting with anticipation for what Theymos has in store for us next April.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "April 01, 2023, 02:53:42 PM",
      "body": "I didn't know April Fool's jokes on the forum have existed for so long (since 2015). I have seen a couple or two of these events in recent years, and I think it's funny. Every time the administration comes up with something new that should be noted and thanked for it.Reading comments and discussions in the relevant topic give no less positive emotions: New CAPTCHA now required before postingCAPTCHA SOLVED!  - It happened for the first time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "speedy963",
      "created_time": "April 01, 2023, 02:58:46 PM",
      "body": "This is literally the meaning of \"your jokes are going too far\"  . Now what we have? The most annoying game that caused a lot of frustrations from all the users/downloaders way back 2013-2014? To be honest even if I am annoyed by the game it brings a lot of nostalgia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "April 01, 2023, 05:11:48 PM",
      "body": "Quote from: Huppercase on April 01, 2023, 01:54:29 PMThe most fascinating aspect is that the old members do play along and appear as if they don't know what's going on, as we have today, many threads have been opened for questions, and some other members who offer signature service management have made jaw tantalizing rates threads to fool participants.Theymos always appear serious about it with the support of some extremely reputable forum members, which makes the joke interesting. Most of the time, the jokes are always about something very difficult and the majority of forum users will not be happy if it is implemented.Kudos to OP for taking the time to compile all of these Theymos April Fool's Day events from 2015. However, this Captcha is challenging because the more difficult the next one is to solve, the easier the first one was.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "April 01, 2023, 06:17:38 PM",
      "body": "I find it extremely positive and appealing that Theymnos still strives to make the forum more entertaining after so many years in charge. I've been here since 2014, but I wasn't very active from the beginning, and I've only encountered the new rank requirements in 2018 and the NFTs in 2021. I was also one of the few who hadn't installed Flappy Bird back when it was introduced because the risk of smashing my phone was greater than the benefit it was offering. So far, the flappy bird captcha has been the most successful I've encountered.P.S. I didn't manage to collect the 10 coins this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "April 01, 2023, 06:20:28 PM",
      "body": "Many users with this red tag:This user is a suspected spammer!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "April 01, 2023, 08:04:33 PM",
      "body": "Quote from: Hyphen(-) on April 01, 2023, 05:11:48 PMQuote from: Huppercase on April 01, 2023, 01:54:29 PMThe most fascinating aspect is that the old members do play along and appear as if they don't know what's going on, as we have today, many threads have been opened for questions, and some other members who offer signature service management have made jaw tantalizing rates threads to fool participants.Theymos always appear serious about it with the support of some extremely reputable forum members, which makes the joke interesting. Most of the time, the jokes are always about something very difficult and the majority of forum users will not be happy if it is implemented.Kudos to OP for taking the time to compile all of these Theymos April Fool's Day events from 2015. However, this Captcha is challenging because the more difficult the next one is to solve, the easier the first one was.To be honest at first it really surprised me about the part that say users that failed the recaptcha will be banned from next week because I did actually play and try to solve the recaptcha but menhh the more I try the harder it felt and like you said power glove and some other users like Fillipone took it very serious and I won't lie I really had a bit of a scare hearing about banning of account because the game felt impossible on mobile but it was just an April fools day trick. Nice one though and I never knew the tradition has been on for this long @2015 till date.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "April 02, 2023, 07:23:32 PM",
      "body": "This recap makes me feel a bit embarrassed, because believe it or not I actually fell of the NFT thing back in 2021.I was new around here, the NFT were all around and I was not aware of the April's Fool tradition of the forum. So I thought it was all serious and I also thought the NFTs were being transacted for actual Bitcoins and makes me assume everyone around here were actual millionaires and add hundreds of Bitcoin each.I did not want to ask about any of that because I did not want to make a fool of myself. So, imagine my face when out of the sudden the NFT feature was gone...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "April 02, 2023, 07:47:49 PM",
      "body": "Quote from: Huppercase on April 01, 2023, 01:54:29 PM01/04/2021|Introducing NFTs for forum members|Crypto was having all attention shift to NFT in 2021 and as valuable digitals art was then, the Admin decided to introduce Fnfts for members and also a marketplace where everyone can put them for sale and you can be lucky to sell fnfts for a whoop of 50BTC, who doesn't like such amount of bitcoin? That was how some people fell for the Joke.I think this one was my favorite.  It showed how a large community can come together to build value so easily.  Can you imagine if an actual NFT or shitcoin was released by this forum?  It would probably quickly become insanely valued.  Not saying that should happen, but it would be extremely entertaining, which Elon Musk always says is the most likely outcome.  Maybe merits could morph into their own coin someday...I also appreciated the covid virus April fools joke.  It might have been viewed as political, but it showed that at least in the beginning at some level, there were a lot of us who thought covid was a nonsense fear tactic to use as an excuse to print trillions of dollars.  Not everyone is blind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "April 03, 2023, 12:39:02 PM",
      "body": "One of the most memorable for me is the virus era I just got woke up in my bed and check the happenings in the forum and upon checking there's some random strokes and symbols in my account upon checking its the April first so I conclude that this is another event, in this recent event of captcha gives me too much frustration like that i play flappy bird on my phone because i cant make over ten with the score.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "April 03, 2023, 01:17:56 PM",
      "body": "It's always fun to see the April Fool's jokes on the forum every year, and it's great to see that even the old members still play along. I remember the \"virus\" joke from 2020, and that was also my first April Fool's joke on the forum that I experienced. It definitely caught me off guard! It's cool to see that these jokes have been going on since 2015, and I think theymos and the administration team do a great job of keeping it fresh and interesting every year. I also appreciate the effort that went into compiling all the past events, it's always fun to look back and reminisce.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "April 03, 2023, 01:45:05 PMLast edit: April 03, 2023, 02:51:35 PM by nutildah",
      "body": "Quote from: OgNasty on April 02, 2023, 07:47:49 PMQuote from: Huppercase on April 01, 2023, 01:54:29 PM01/04/2021|Introducing NFTs for forum members|Crypto was having all attention shift to NFT in 2021 and as valuable digitals art was then, the Admin decided to introduce Fnfts for members and also a marketplace where everyone can put them for sale and you can be lucky to sell fnfts for a whoop of 50BTC, who doesn't like such amount of bitcoin? That was how some people fell for the Joke.I think this one was my favorite.  It showed how a large community can come together to build value so easily. This was also my favorite. Getting the random NFTs of other users and the varying \"levels\" of rareness was quite fun, as was trading them. Gmaxwell even made a floor sweeping bot that auto-purchased NFTs under a certain price. It was a race to see who could accrue the most fBTC before theymos brutally rugged all of us.  I ended up turning one of mine into a real NFT on Counterparty. I tried to give it to the dude who still wears it as his avatar but he didn't want it, lol.https://xchain.io/asset/NUTILDAH.III",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "April 03, 2023, 01:53:27 PM",
      "body": "April fool can be surprising and full of fun because you sometimes got lots of surprises and tricks as well, while at the other hand it can also be annoying because some people easily got pissed with expensive jokes they believed to be real and later turn out to be a prank, so in doing April fool, we should be guided as well as observing the category of people we take on this and also make sure that we know the kind of prank or joke to make in other not to make people scare and ranged in anger, but i like the ones on this forum because they are entertaining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "April 04, 2023, 04:12:07 PM",
      "body": "Quote from: SamReomo on April 02, 2023, 07:41:49 PMTheymos is truly amazing, and his jokes are not only funny but also entertaining. His sense of humor surpasses that of many stage comedians, and I admire him for it. Keep up the great work, Theymos! Additionally, I appreciate the effort of the poster who took the time to find those jokes from 2015 to 2023. Of course, he always has new ideas to make a different Joke every year. Although some forum users already suspected what Theymos was doing was an April Fools joke, he made it sound like it was real. April Fools this time apart from being entertaining as well as challenging, Forum users must solve Captcha to remove the tag This user is a suspected spammer! in the post he made.Curious what Theymos will do at April Fools 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "April 04, 2023, 07:38:05 PM",
      "body": "Thanks for making this topic. I remember almost all pranks like it was yesterday and I only missed first theymos prank in 2015, as I only signed up here later that year. It's very difficult for me to pick which one was best. I must admit that few times theymos really caught me. That moment when you visit forum in early morning, still didn't wake up fully -a bit WTF is going on, until you realise what date is today .That one with merit requirements was great one. Merit was very hot topic then, it was still fresh thing and there was lot of hate about it. Many people accepted this prank seriously.And KYC requirements - I just burst out laughing when some users seriously started posting their selfies with passports in their hands .theymos is very creative guy to prepare such pranks each year and turned it in tradition, which is awaited by many users here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BITCOIN4X",
      "created_time": "April 04, 2023, 08:08:09 PM",
      "body": "Quote from: Huppercase on April 01, 2023, 01:54:29 PMApril fool dates|April fool Events|Brief description of what happened01/04/2020|April fools 2020 \"virus\"|This was the year that Coronavirus spread and fear was around everybody, so the administrator decided to raise the stakes by displaying digital virus codes on posts, comments, and profiles. This made profiles appear as if they had been compromised by a virus, which was somewhat frightful given how close social distances were at the time and how little movement there was. However, it was just a traditional April fool's joke.Looks like the link for the April Mob virus isn't updating, so here it is in case you forgot it. Here is one of theymos posts for reference. But anyway, good job from you, man. I just want to say April Fools 2023 is fun, if we could collect bitcoin as easily as birds eat coins - that would be great. LOLQuote from: theymos on April 01, 2020, 07:05:43 PM If you choose to see-as-evil acts which were clearly done in the spirit of fun & good faith, then you're creating demons for your personal living hell...There is a rare worldwide shared cultural experience going on in the form of the pandemic and the resulting unprecedented social distancing policies. It's similar to a world war in terms of its widespread cultural significance. So this little game came to my mind to connect with it. As with several past bitcointalk.org April Fools things, it's more of a new/weird/fun way for people to interact with the forum and generate discussion, not a joke as such. Certainly it wasn't meant to somehow poke fun at the many real tragedies created by the coronavirus situation; it was meant to connect with the huge thing dominating the minds/lives of basically everyone on Earth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}