{
  "id": "topic_5477585",
  "title": "Fiatless",
  "author": "Fiatless",
  "created_time": "December 12, 2023, 03:02:13 PM",
  "content": "In anticipation of the approval of Bitcoin ETF, Google is adjusting its guidelines for crypto-related products. Before now Google had been very strict on crypto-related advertising on the platform because of concerns for fraud and misleading promotion. However, it seems they are gradually adjusting these policies to reflect the increased mainstream or institutional adoption of Bitcoin.From January 2024 Google will allow adverts on financial products that allow investors to trade shares in trusts holding large pools of digital currency known as \"Cryptocurrency Coin Trusts\". With this change in policy crypto coin trusts could run ads on Google provided they register with the SEC. This subtle adjustment of ads policy is an indication that they are preparing for Spot Bitcoin ETF.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477585",
  "comments": [
    {
      "author": "dzungmobile",
      "created_time": "December 12, 2023, 03:09:56 PM",
      "body": "Quote from: Fiatless on December 12, 2023, 03:02:13 PMIn anticipation of the approval of Bitcoin ETF, Google is adjusting its guidelines for crypto-related products. Before now Google had been very strict on crypto-related advertising on the platform because of concerns for fraud and misleading promotion. However, it seems they are gradually adjusting these policies to reflect the increased mainstream or institutional adoption of Bitcoin.Google is like commercial banks, they are not against Bitcoin or cryptocurrencies. They wait for opportunities with more regulations, clearer guides from governments and authorities to step in but don't get big risk for their business.Similarly audit companies will join cryptocurrency market when chances come and risk becomes smaller for their business.Google are not fearful of Bitcoin or cryptocurrencies because of scam or fraud as Google accepted many advertisements from bad business. They even are not good with their policies on customer data and more.Generally traditional businesses are waiting for a right time to join the potential Bitcoin and cryptocurrency market and they want to see a big trigger that seems to be Bitcoin Spot ETF in USA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tuclikk",
      "created_time": "December 12, 2023, 03:26:54 PM",
      "body": "Quote from: Fiatless on December 12, 2023, 03:02:13 PMIn anticipation of the approval of Bitcoin ETF, Google is adjusting its guidelines for crypto-related products. Before now Google had been very strict on crypto-related advertising on the platform because of concerns for fraud and misleading promotion. However, it seems they are gradually adjusting these policies to reflect the increased mainstream or institutional adoption of Bitcoin.From January 2024 Google will allow adverts on financial products that allow investors to trade shares in trusts holding large pools of digital currency known as \"Cryptocurrency Coin Trusts\". With this change in policy crypto coin trusts could run ads on Google provided they register with the SEC. This subtle adjustment of ads policy is an indication that they are preparing for Spot Bitcoin ETF. That's will be an achievement of the bitcoin and also for the Google itself. The Spot Bitcoin ETF exposure will be very useful because the Google will gain an access of guiding people through the system. By the help of the Advertisement so many people around the nation will also like to no more about it who have not yet known anything about Bitcoin, they will engage themselves to the digital currency. By the way Google has to be very strict by it new policy that will be invented for it security purpose to avoid fraud.Thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "December 12, 2023, 03:28:18 PM",
      "body": "Google is a big company, if they continue to persist with the old attitude towards Bitcoin, then in my opinion they are not worthy of being a big company because the progress of the crypto industry will continue to develop.Not only that, Google's change in attitude towards crypto-related ads subtly shows that the negative fears associated with Bitcoin are not fundamental.Bitcoin spot ETFs are desired by many large companies such as BlackRock and other large companies because there are benefits behind their application. Google is only now revising its advertising rules and considering a Bitcoin spot ETF.Bitcoin continues to rise.Other sources about Google revising advertising rules: bitcoinmagazine",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "December 12, 2023, 03:39:07 PM",
      "body": "It's good to see positive changes in this regard, and I'm also happy that they aren't just lifting all restrictions because there are enough scammers out there. I wonder if crypto trust ads are truly related to ETF approval anticipation, though. Even if that's the case, what happens if there's no approval before the start for the new policy, and if there are some approvals, are ETFs the only ones eligible? It says crypto trusts, so is Grayscale Bitcoin Trust eligible, regardless of ETF approvals, for example? If the answer is yes, is BlackRock eligible without an ETF? The statement by Google is vague enough to beg many similar questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "December 12, 2023, 03:44:13 PM",
      "body": "Probably the reason why they're going to do that is because they're planning to get into something big in the cryptocurrency industry so they try and make the sneaky approach by letting the crypto projects get into their advertising and then at the same time make sure and when the time comes, the project that they're in is going to be getting all of the ad space or maybe even the projects that they've invested in will have more ad space than the competition. That's the only thing that I can think of as to why they're gradually going towards this path with the nearing of the approval of the spot ETF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "December 12, 2023, 04:06:01 PM",
      "body": "Quote from: Fiatless on December 12, 2023, 03:02:13 PMIn anticipation of the approval of Bitcoin ETF, Google is adjusting its guidelines for crypto-related products. Before now Google had been very strict on crypto-related advertising on the platform because of concerns for fraud and misleading promotion. However, it seems they are gradually adjusting these policies to reflect the increased mainstream or institutional adoption of Bitcoin.We can remain neutral about some certain conditions untill we found ourselves involved in them before we take steos or decisions on our stand forbthem, seing that there's going to be massive increase on the cryptocurrencies coming next year, alot of people were seeing this opportunities already for making money out of them, this is part of what is leading to the increases in numbers of bitcoin spot ETF applications, the market is certain to pump and some were already planning towards being a partakers of such through spot ETF, next year is going to be a boom on the bitcoin market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "December 12, 2023, 04:10:24 PM",
      "body": "Quote from: Fiatless on December 12, 2023, 03:02:13 PMIn anticipation of the approval of Bitcoin ETF, Google is adjusting its guidelines for crypto-related products. Before now Google had been very strict on crypto-related advertising on the platform because of concerns for fraud and misleading promotion. However, it seems they are gradually adjusting these policies to reflect the increased mainstream or institutional adoption of Bitcoin.From January 2024 Google will allow adverts on financial products that allow investors to trade shares in trusts holding large pools of digital currency known as \"Cryptocurrency Coin Trusts\". With this change in policy crypto coin trusts could run ads on Google provided they register with the SEC. This subtle adjustment of ads policy is an indication that they are preparing for Spot Bitcoin ETF. Just more signs that the ETF approval is coming soon. I mean, if giants like google are starting to taking actions to secure their place in the Bitcoin ETF realm without fear that they might stumble upon regulations and be forced to pay heavy monetary fines for not following them, then that is a clear sign of something about to change. It is always the rich and powerful who get the news first from their other rich and powerful friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "December 12, 2023, 04:14:23 PM",
      "body": "They didn't announce the change of the terms though so it's just like they slipped those rules into the policy. They secretly did it. When they banned ICO advertising in 2017, they announced it like they had the purpose to destroy crypto.Nonetheless, this is a good change of their policy but are the ICOs going to come back again to promote the newly launched projects? I would hope so. The second wave of the 2017 altcoin season must be coming and indeed this is really a great opportunity both both old and new projects in crypto. What about Facebook?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Manny@11111",
      "created_time": "December 12, 2023, 04:29:46 PM",
      "body": "This will be a welcome development but it needed to be said that google are not afraid of scam related crypto promotions but its acceptability by policy regulated conservatives across decision making Countries but like any product making waves, google have no option than to tilt toward it's breakthrough.A welcome ideal and many others will follow suit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "December 12, 2023, 05:13:46 PM",
      "body": "Quote from: Fiatless on December 12, 2023, 03:02:13 PMIn anticipation of the approval of Bitcoin ETF, Google is adjusting its guidelines for crypto-related products. Before now Google had been very strict on crypto-related advertising on the platform because of concerns for fraud and misleading promotion. However, it seems they are gradually adjusting these policies to reflect the increased mainstream or institutional adoption of Bitcoin.From January 2024 Google will allow adverts on financial products that allow investors to trade shares in trusts holding large pools of digital currency known as \"Cryptocurrency Coin Trusts\". With this change in policy crypto coin trusts could run ads on Google provided they register with the SEC. This subtle adjustment of ads policy is an indication that they are preparing for Spot Bitcoin ETF. This is called embracing change. Every corporate repositions their stand from time to time. Google is no exception and the executives of Google very well understand the gravity of repositioning. Does the reason why Google is still the disputed leader of the internet ecosystem. Also if blackrock gets the approval to run a bitcoin ETF, Google would want to capture the advertisements that these fund managers are going to run. That is why they are revamping their policy. That's fine!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "December 12, 2023, 05:42:35 PM",
      "body": "Quote from: cabron on December 12, 2023, 04:14:23 PMWhat about Facebook?While on their ToS, advertising crypto-related products are not allowed on the platform, a lot of content creators in Facebook are actually advertising crypto-related services and products. Those guys have millions of followers and are not being reprimanded or apprehended with what they're doing. Honestly at this point, Facebook should reevaluate their stance with cryptocurrencies as other giants around them have shifted course and has become somewhat tame to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Steph.A",
      "created_time": "December 12, 2023, 05:55:32 PM",
      "body": "I'll hope other gafam follow suit, they have a lot to win in decentralization, traditional banking is basically the only counterweight to the tech world being king.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "December 12, 2023, 06:09:21 PM",
      "body": "I think we’re quickly transitioning from Bitcoin being the Wild West to it being a recognized and legitimate currency.  This no doubt will cause others to follow suit in relaxing some of their policies towards cryptocurrencies as they become legitimate products to be advertised instead of fly by night scams to enrich their founders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "December 12, 2023, 06:20:31 PM",
      "body": "It's really good news for all of us because this actually indicates that the chances for the approval of ETFs are even higher than before. Things seem to be more clear now, but it might be another strategy of Google to prepare for the upcoming bull run, where they also want to earn money. Even though, I will admit the step they had taken is a big one although I was not aware that companies can't put ads on the funds or trusts of their companies to gain traffic. And the term of registering with SEC is even more good.This means there this step will only benefit them if the SEC approves companies to put ads, which means companies will first given permission to launch their ETFs. This directly means things are streamlined for BTC and ETFs is near. Your title is a little confusing I thought Google applied for BTC ETF but they are just starting to allow people to advertise there company's fund where the funds are driven from cryptocurrency collection and by that means, BTC. But it could also means ETH, as BlockRock and some other companies also applied for ETH ETFs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "December 12, 2023, 06:48:02 PM",
      "body": "Google's clearly seeing dollar signs in those flashy cryptocurrency coin trusts everyone's yammering about lately.  Makes plenty of sense they've now opened up their big ad network to companies peddling trusts holding the hot digital assets.  After all, hypes simmering at a nice boil these days around cryptocurrency.  And where there's hype, there's eyeballs.  And where companies can grab eyeballs, hey there's profit to be scored for an outfit like Google brokering up those advertisements and  Id bet Google's bean-counters envision tons of curious folks firing up the search engine to wrap their heads around how trusts built around cryptocurrency work.  More searches means more chances for Google to serve up relevant advertisements and take a slice of the action.  So for them it's a no-brainer move to let cryptocurrency outfits place ads and potentially drive up the company's bottom line.  Whether or not average Joes really understand cryptocurrency coin trusts even after clicking one of those flashy ads, well, Google still makes bank.  So theyre happy to ride this wave and rake in the dough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "December 12, 2023, 06:54:01 PM",
      "body": "Good, excellent news but I'm curious why they want such a sneaky approach to explore the Crypto market, currently, the market is super Bullish and from January, we can see the actual potential of this Bull market wave. Some other tech giants may also explore Bitcoin and other aspects of this crypto market due to the hype of the top financial giants.I'm also curious how long we'll go for the new ATh will it be 5x from the current market valuation hehe, just being optimistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "December 12, 2023, 07:04:12 PM",
      "body": "This is no surprise to me at all, as the ETF application is getting close to being approved, so we are likely going to see more firms acknowledge and start supporting crypto in their own way; no one will ever want to miss out. ETF getting approved means a lot of great opportunities are going to come up for crypto, and adoption will also increase more than it has ever been. Many people are not accepting any promotion that concerns crypto or don't want to get involved in it as a result of either not understanding it or because they are so afraid of what will come next, but with ETF, there is so much confidence for them, and they can sense some legality now in crypto and will no longer have that fear of doing what the government is against and they might be penalised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "December 12, 2023, 07:09:53 PM",
      "body": "Quote from: AprilioMP on December 12, 2023, 03:28:18 PMGoogle is a big company, if they continue to persist with the old attitude towards Bitcoin, then in my opinion they are not worthy of being a big company because the progress of the crypto industry will continue to develop.Not only that, Google's change in attitude towards crypto-related ads subtly shows that the negative fears associated with Bitcoin are not fundamental.Bitcoin spot ETFs are desired by many large companies such as BlackRock and other large companies because there are benefits behind their application. Google is only now revising its advertising rules and considering a Bitcoin spot ETF.Bitcoin continues to rise.Other sources about Google revising advertising rules: bitcoinmagazineI do not actually understand google and some of their advertisement policies against cryptocurrency. I remember that I have downloaded some scam apps from play store and got scammed. Why won't google scrutinize such projects and determine that they are scam if they be such strict.Google knows it's time to readjust because bitcoin is no longer a new player in the industry. Perhaps, they were waiting for adoption and ETF is the perfect signal of mass adoption they have been waiting for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "December 12, 2023, 07:10:22 PM",
      "body": "Google is constantly revising, reviewing, adjusting and updating their crypto advertising policy. In 2018,they did it twice. In all of these the community should be happy because of the positive impact these new guidelines can have on bitcoin mass adoption. First more people would be exposed to it starting with Google searches as there is going to be increased visibility of bitcoin on its platforms. Secondly, scammers would be discouraged too due to strict monitoring on crypto ads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}