{
  "id": "topic_5436369",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "January 22, 2023, 03:52:02 PM",
  "content": "Using crypto exchanges for trading means you have agreed to their terms and conditions, the question is how many of you are even reading exchanges terms and conditions before using any crypto exchanges for trading?  I have a confession to make, I was one of those people in the past, I just sign up and deposit on exchange straight away, today I decided to  read OKX terms and conditions and the thing scared the hell out of me. Please take your time to read the following OKX terms and condition below..By accepting the Terms, you expressly agree to the pooling of your Digital Assets with the Digital assets of other users. Digital assets of users are not protected by deposit protection or deposit insurance scheme. In this case of an irreconcilable shortfall, you may not receive some or any of your deposited assets or funds.   It's like if things go very wrong for OKX and the law/court gets involved they will win over their users, just by saying ' every users on our platform agreed with the terms and conditions before using our exchange' , this is scary.I read others like Crypto.com and Binance but OKX is the most scary one for me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436369",
  "comments": [
    {
      "author": "Maus0728",
      "created_time": "January 22, 2023, 05:06:37 PM",
      "body": "FTX be like: Your cryptocurrency asset only belongs to you,  if and only if the $6 billion of asset that are missing isn't discovered by Binance[1].[1] https://notabird.site/Hyza87/status/1590484789517488128Kidding aside , I do not fully read it, I just skim that bloody paragraphs that contains important keywords such as privacy, security, countries, fees etc. It will take you years to read such text that are composed of repetitive words that sometimes isn't important for an average user.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "January 22, 2023, 05:28:33 PM",
      "body": "It is very likely that most people did not even bother to read the terms and conditions. Not specifically for cryptocurrency users, but also for many other popular services and platforms users. Where many websites are designed to let the user try/join the platform as simply as possible, a monstrous text of TnC/ToS and Privacy Policy almost certainly won't be bothered.There is a website called tosdr, which simplify and condense the terms of services of many popular platforms, like Google, Meta, etc. The web itself affirms the “I have read and agree to the Terms” as the biggest lie on the internet. It would be good if there is someone who also contribute to the platform specifically for cryptocurrency-related platforms/services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "January 22, 2023, 08:45:09 PM",
      "body": "I won't lie though I don't read the complete terms and conditions of an exchange all I do is to look through some parts of it like the part about privacy and how the information of its users are handled and some other information that I think are important to know at that moment before I click on \"accept\". But sometimes when I'm a haste I just click on the accept button and create an account for my self and this doesn't just apply to exchanges alone I still do it for some other websites also. Most times I go back and read through them while for some I never get to read them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 22, 2023, 09:18:21 PM",
      "body": "Honestly, I always skip this step. Almost everyone in this forum skips the steps to register on any exchange. Though now I try to read the terms and conditions of some websites while registering on other new websites. But it is important to read the terms before accepting and continuing, but when I must have to register on a site I just don't bother about the terms and conditions texts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "January 22, 2023, 09:22:22 PM",
      "body": "You should just assume that the Terms of Use of any centralized exchange allows that exchange to share and sell all your data with anyone they like, hand over your coins to anyone they like, and provides you with absolutely no guarantee whatsoever that you will ever get back a single satoshi of your deposits. Because pretty much all of them do exactly that, but just obfuscated in enough legal speak that most people wouldn't realize it even if they bothered to read the terms.I've been encouraging people to read Terms of Use of various exchanges for years. Here's a post I made two years ago, warning people about the Terms of Use of both BlockFi and Celsius: https://bitcointalk.org/index.php?topic=5315224.msg56289293#msg56289293. If people had actually read those terms, then maybe they would have been spared from losing everything when both exchanges went bankrupt from lending out users' deposits in exactly the way they said they would. Every time an exchange or platform goes bankrupt there are a flood of users complaining about how that platform was running a fractional reserve system, or was lending out their money, or was making risky trades/investments/gambles, etc., when all the time the Terms of Use said that the platform would do exactly those things. The users just didn't read it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lalabotax",
      "created_time": "January 22, 2023, 09:41:54 PM",
      "body": "I am  sure that most of us will only scroll down the Term & Conditions of an exchange or other platforms to get the button of this:Quote from: Crypt0Gore on January 22, 2023, 03:52:02 PMOr at least, we only read the first sentences   People, especially I myself will feel so lazy to read those many words that are very boring. Even I always think that this will waste my time. Actually, this is a wrong decision because sometimes, there is some very important hidden information that exchanges give to us. but, because of those so many words, the important hidden information seems not to be seen and we disregard this. We commonly will read again the T&C if we have any problems or we find some issues with the exchanges. this is a bad condition and habit, but who will spend time reading the sentence-by-sentence of the T&C fully? I will commonly prefer to read articles or reviews or watch for reviews including specific and essential information about the exchange from other people. I understand this is bad but this is what actually I am doing so far",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Keyreysek",
      "created_time": "January 22, 2023, 11:03:42 PM",
      "body": "It seems that at first almost everyone didn't read the terms and conditions, because everyone thought it was simple, and just made a deposit.let alone crypto regulations, Google's terms and conditions also register when many don't read it, maybe it's too complicated, even though it's something that must be read and must be paid attention to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "January 22, 2023, 11:09:40 PM",
      "body": "A few years ago I always skip reading TOS because it's a long text to read but right now it change because I have a few issues on the exchange I don't want to experience them again like a locked account or funds frozen that is very stressful and it ends up nothing all tokens are stuck forever on that exchange.Reading TOS is very important so that you know what you are going to do if you accept their terms then make sure you follow the terms to avoid future issues like what happened to most of the newbie traders out there that always skip reading TOS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "January 22, 2023, 11:43:12 PM",
      "body": "That's my attitude before, due to laziness I didn't read the terms and conditions, who wants to read a long paragraph of more than 2-3 pages to read?That's why I prefer to look first the FAQ before the TOS.  But that's still wrong, it should be encouraged to anyone to read the whole terms before using it.  But now, I already understand that all centralized exchange has almost the terms, they're not liable to hold your fund, and they surely ask for KYC, that's the common terms that they have and I didn't surprise.Quote from: BitMaxz on January 22, 2023, 11:09:40 PMReading TOS is very important so that you know what you are going to do if you accept their terms then make sure you follow the terms to avoid future issues like what happened to most of the newbie traders out there that always skip reading TOS.I tend to agree with this, it should be knowing the TOS first and OP was right. I even admit that I'm one of them before.  Take note, not only on the exchange, any platform must read first the terms, even in gambling, to avoid being violated in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "January 22, 2023, 11:52:20 PM",
      "body": "I, too, am one of those users who do not thoroughly read the terms and conditions of an exchange or other platforms before using them. Since I know many people use it without complaint, I won't have a problem if I use it as well. If I'm stuck somewhere and unable to proceed, those are the only times I read to find out what's holding me back. This is due to nothing more than laziness.It's about time we start reading platform terms and conditions because many will always put in their terms what will benefit them if anything goes wrong while using the platform in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "January 23, 2023, 03:07:01 AM",
      "body": "Thats one thing that everybody or should I say not all are very fond of reading the terms and agreements. Actually me too. Just signing up and mostly press OK. Well we all knew its gonna be a long read so we just simply skip all this and proceed right away. But you are rifht, we must do this to know which terms arent good for our position especially we are dealing with money here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "January 23, 2023, 03:30:48 AM",
      "body": "I really surprised to see no one pointed out if any centralized exchange or company has a right to update or change their terms of service in anytime they want!Those centralized exchange or company doesn't always giving you notice before or when they updated their terms of service and they're don't care if you're don't agree with their new rules, if you not agree with their rules, it's not their problem, but yours.I'm also a part who encourage everyone to read the whole TOS before using the service, but make sure you need to read it again before you want to use the service, especially if you haven't use it for a year or two years. There's a lot change that you wouldn't know, just like localbitcoins now ask user KYC when few years ago they're not ask any KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "January 23, 2023, 03:32:03 AM",
      "body": "This is not only true for crypto exchanges, but for almost all sites in general. Most people don't read T&C, and even if they do, they don't give up to sign up that site. So far, I haven't heard of anyone who read T&C and immediately stopped signing up. People don't change their mind easily once they decided to sign up. Of course exchanges and other sites often use this situation to their advantage. However, the end user only remembers these conditions when something negative happens to them.Think about all the negative situations and prepare yourself as if the worst will happen when you sign up of that crypto exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Razmirraz",
      "created_time": "January 23, 2023, 10:36:06 AM",
      "body": "Very few are willing to take the time to read the terms and conditions before signing up for an Exchange. I just found this Thread on the Bitcoin Discussion Board An Example of Not your Keys Not your coins. Exchange has attached terms and conditions before registering there. As long as you don't press the \"I agree\" button, you will never be registered with Exchange, if the terms and conditions are burdensome to Exchange users, you can choose another Exchange that is considered not too detrimental to the second party (their service users).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phyna4",
      "created_time": "January 23, 2023, 10:52:52 AM",
      "body": "This happens a lot and It's because some people don't have the zeal to read long write ups 😄 which is bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "January 23, 2023, 11:22:39 AM",
      "body": "Quote from: cryptoaddictchie on January 23, 2023, 03:07:01 AMThats one thing that everybody or should I say not all are very fond of reading the terms and agreements. Actually me too. Just signing up and mostly press OK. Well we all knew its gonna be a long read so we just simply skip all this and proceed right away. But you are rifht, we must do this to know which terms arent good for our position especially we are dealing with money here. In my own case it is not only crypto exchanges, I always press ok or agreed just to speed up whatsoever I wanted doing at that particular time not knowing that i am doing my self bad.Therefore incase anything happened letter in the future, they have all the right to be set free because they include them in their terms and condition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 23, 2023, 01:07:58 PM",
      "body": "To be fair terms and conditions are always too long and sometimes they use a certain language with legal terms and things like that which makes it difficult for most people to even fully understand what they are signing! In other words this is a general problem that is not specific to bitcoin or crypto exchanges. People don't read the ToS of applications they install, or websites they sign up with either.Besides when it comes to exchanges, even if you read the whole thing, you can be sure that they have placed some wiggle room for themselves so that they can never be sued when they \"scam you\"...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GigaBit",
      "created_time": "January 23, 2023, 02:18:03 PM",
      "body": "Such an option is available before joining any new exchange platform or others who especially very much careful to their rules and regulations. Most of the times users generally avoid these issues. Because it is often boring. Their terms and conditions are so long that is often a time-consuming affair. However, these issues should not be avoided in any way. They know that there are some common conditions that cannot be skipped to sign up unless they are excluded. As a result, they accept all their terms and conditions without reading or understanding. But when one is in trouble there is nothing else to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "January 23, 2023, 03:59:59 PM",
      "body": "at first I never read the terms and conditions of each crypto exchange. I just use it without knowing the risks that will occur. But from several exchange hacking incidents that occurred, I started reading the terms and conditions and written to understand some of the risks that are not borne by crypto exchanges.When the FTX case became the main focus, the centralized exchange became very vulnerable to losing our assets. then more and more people are aware of the written Terms and Conditions. when we ignore it we can't sue them for what happened when the warning was written and approved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}