{
  "id": "topic_5462031",
  "title": "Mr Reporter",
  "author": "Mr Reporter",
  "created_time": "August 04, 2023, 06:37:07 AM",
  "content": "Cost of Electricity is not there. Just a single miner. I guess this guy can earn with post paid electricity plan. PHCN may not even know about the miner. According to what is happening in my area, they do not check meter again, they only bring bill.https://www.legit.ng/people/1545746-man-buys-machines-earns-8-daily-installs-house/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462031",
  "comments": [
    {
      "author": "paid2",
      "created_time": "August 04, 2023, 08:33:45 AM",
      "body": "I watched the Tik Tok video linked in the article about this guy.In the video, we can see his Nicehash page showing \"8$ per day revenue\". Does-it mean that the guy is not paying electricity at all nor a possible solar installation ?His 8$ per day are not real until he has hit the ROI point. If he paid 2k for his S19, it will take some time.And about the comment saying \"if you had 10 antminers, you could earn 80 per day?\" and the guy answering \"Correct\", it is a little bit naive. His electrical installation should be able to handle 30 kw constantly first, and he should also hit ROI as I said before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "August 04, 2023, 08:51:19 AM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on August 04, 2023, 08:33:45 AMIn the video, we can see his Nicehash page showing \"8$ per day revenue\". Does-it mean that the guy is not paying electricity at all nor a possible solar installation ?His 8$ per day are not real until he has hit the ROI point. If he paid 2k for his S19, it will take some time.You are right. According the the news, the cost of electricity to run the miner in a day is not known because the miner did not disclose anything related to electricity. For the profit he makes daily to be accurate, the cost of electricity supposed to be calculated and deducted before concluding his profit. The daily profit would be lesser than $8. There is also no mention of how much he bought the miner and ASICs are very expensive. People that read about this or that found it on TikTok will all think that mining bitcoin is easy and not expensive until they do research on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}