{
  "id": "topic_5437439",
  "title": "romero121",
  "author": "romero121",
  "created_time": "January 31, 2023, 09:50:26 AM",
  "content": "Does anybody have this experience or this is happening with me. Most of my gambling losses have taken place when I feel lonely.Today one such incident have taken place. I've kept my last few weeks signature earning aside to meet some medical needs. Today my mother got hospitalised and I'm her attender. She is supposed to take a minor surgery as her vision isn't clear. She's been taken to the Operation Theatre and I was left alone in the room. If anything required the nursing staff would call me. By thos time my mind didn't think about anything. All of the sudden why don't you gamble? and I started and made 0.009BTC close to 0.01BTC and the greed didn't left me. Finally lost all my month's earning kept aside.Through this I would like to remind be careful when you are alone. If your mind wish to gamble, go for it. But don't consider it as a way to pass your time and keep on wagering. The outcome might hurt, because most of the time loneliness is felt when our mind is in a bad mood. Some enjoy being lonely, but the reality used to be different.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437439",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "January 31, 2023, 09:59:19 AM",
      "body": "As we usually say, gamble with the amount of money you can afford to lose. Assuming you collect $1000 monthly, you can just set less than 5% of $1000 for gambling $50, keeping the remaining $950 for something useful for your life. On gambling sites, you can gamble with just $1 each if you just want to have fun. If you spend more than your monthly limit, you will then just quite gambling. You can set $12.5 weekly for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "January 31, 2023, 10:08:03 AM",
      "body": "Gambling is not an escape. Gambling when you're in a happy mood often brings you luck. That has been my experience in gambling. In the past week, almost every day I was lucky in gambling. Although not every day I win a large amount, but it can be said that I win when I am in a happy mood.When loneliness hits the mind, it is better if we remember the moments where we get pleasure, whether it is a moment with family or with friends.In a lonely state of mind we play gambling, emotions cannot be controlled because there is no other thought in such a situation but anger.Again, this is just my experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "January 31, 2023, 10:19:38 AM",
      "body": "Quote from: romero121 on January 31, 2023, 09:50:26 AMDoes anybody have this experience or this is happening with me. Most of my gambling losses have taken place when I feel lonely.Today one such incident have taken place. I've kept my last few weeks signature earning aside to meet some medical needs. Today my mother got hospitalised and I'm her attender. She is supposed to take a minor surgery as her vision isn't clear. She's been taken to the Operation Theatre and I was left alone in the room. If anything required the nursing staff would call me. By thos time my mind didn't think about anything. All of the sudden why don't you gamble? and I started and made 0.009BTC close to 0.01BTC and the greed didn't left me. Finally lost all my month's earning kept aside.Through this I would like to remind be careful when you are alone. If your mind wish to gamble, go for it. But don't consider it as a way to pass your time and keep on wagering. The outcome might hurt, because most of the time loneliness is felt when our mind is in a bad mood. Some enjoy being lonely, but the reality used to be different.Bro, I think you need professional help. You also have this thread: Hard earned money - Busted in secondsYeah, thanks for reminding everyone including me but you also need to apply that reminder to yourself and make sure that you're securing fund for more other important matters before you gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "January 31, 2023, 10:33:30 AM",
      "body": "Emotions drive you to gamble? well, that's just how most people react when they are lonely and they have a history of gambling when they have access to it, they won't really consider to re-think twice because they thought it will gonna drive away their sadness but the result is always contrary because gambling is uncertain and most people lost their money because of it. You just need to know that in order to become happy again, don't add problems with problems but instead get yourself something good to do whether for yourself or for others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Erumo",
      "created_time": "January 31, 2023, 10:41:38 AM",
      "body": "But you wasnt lonely, nurse was all the time by you. Dont try to find excuse for your loss. Lonely or not, you would have lost those 0.009 BTC anyway. It is an addiction and greed. Or you think that if the ward was crowded with people, you would not feel bored and would not take out your device and gamble? I think you would do the same. Instead of chatting with strangers, bother them, you would stick in your phone or whatever you have. Combined with being lonely, you can blame affordable mobile internet data then. Your problem is nicely revealed in Too accessible of online casino grows addiction faster?  topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "January 31, 2023, 10:46:46 AM",
      "body": "This is where offline games will be a great help. Whenever I am in the state of being alone, bored, or whatever feeling will make me lonely if I don't do something, I play offline games that are saved on my smartphone. That way, you can keep your mind busy and not think about other things like gambling your saved money from the accumulated signature campaign payments. I hope your Mom gets well soon. This is a good lesson to stay away from any services with money involved. Other people are going online shopping when in this kind of emotional state which is also an expensive hobby.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "January 31, 2023, 10:53:47 AM",
      "body": "Quote from: romero121 on January 31, 2023, 09:50:26 AMDoes anybody have this experience or this is happening with me. Most of my gambling losses have taken place when I feel lonely.Today one such incident have taken place. I've kept my last few weeks signature earning aside to meet some medical needs. Today my mother got hospitalised and I'm her attender. She is supposed to take a minor surgery as her vision isn't clear. She's been taken to the Operation Theatre and I was left alone in the room. If anything required the nursing staff would call me. By thos time my mind didn't think about anything. All of the sudden why don't you gamble? and I started and made 0.009BTC close to 0.01BTC and the greed didn't left me. Finally lost all my month's earning kept aside.Through this I would like to remind be careful when you are alone. If your mind wish to gamble, go for it. But don't consider it as a way to pass your time and keep on wagering. The outcome might hurt, because most of the time loneliness is felt when our mind is in a bad mood. Some enjoy being lonely, but the reality used to be different.First, I'm sorry to hear about your mother and her medical needs, I know lot of us here goes through the same caring for our families with what we earn here, and hopefully your mom will feel better after the operation.Second, not sure why you think of gambling, maybe you really doesn't feel good because of what had happen to your mother but I guess gambling and being alone is not a good combination for some individuals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joeperry",
      "created_time": "January 31, 2023, 11:20:49 AM",
      "body": "Maybe that's because you were get used to it whenever you are not doing anything or couldn't keep yourself busy, that's actually a form of addiction if I am not mistaken as it is the one that came on your mind. That actually happened to me, whenever I feel bored not doing anything and my money isn't doing anything in my wallet.What comes to my mind is, why don't I gamble to at least have a profit rather than staying it on my wallet which leads in losing all my money on the wallet. I already found a solution in my case which I just play online games or keep myself busy doing task at home.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "January 31, 2023, 11:52:52 AM",
      "body": "Quote from: joeperry on January 31, 2023, 11:20:49 AMMaybe that's because you were get used to it whenever you are not doing anything or couldn't keep yourself busy, that's actually a form of addiction if I am not mistaken as it is the one that came on your mind. That actually happened to me, whenever I feel bored not doing anything and my money isn't doing anything in my wallet.This is what exactly I can say about this too, if I am not an addict, I can be lonely and not think of gambling, but if thinking of gambling, it could be the start or the continuation of my addiction. That aside, another thing is that he used all his monthly income money to gamble just at ones, that can also indicate the start or the continuation of an addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AverageGlabella",
      "created_time": "January 31, 2023, 12:02:46 PM",
      "body": "Being broke and lonely can drive you to gambling but I think not being lonely and having friends that gamble can cause you to gamble more then you want to because then it becomes a social habit instead of something that entertains you when you do not have many friends to be with. I think gambling is just something that appeals to most humans even if it is not with big money and only small money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "January 31, 2023, 12:08:24 PM",
      "body": "Your greed caused you to lose everything. There is nothing wrong with gambling when you are bored or have nothing to do, as long as you do it for fun and set a limit on how much you will gamble so that you do not lose it all. When the greed kicks in, that is the time we should stop, but again, if we have already enjoyed it like you are winning, you can't think of stopping. Emotions are also a big factor in gambling because you get easily affected per game and will try to make up for your losses or win more if you win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "January 31, 2023, 12:25:48 PM",
      "body": "Learn to schedule time for gambling, put some money aside for gambling in the morning, afternoon and evening. This way you won't only enjoy gambling, but save more time for the entertainment. It's not super interesting to gamble all the funds at a time. Added with the profits you made, it would have been wise to stake your profits and recover the initial monthly savings. It's too risky to continue making such mistakes, especially when you need the money for health issues. Health is happiness and don't gamble with it. Besides, my sympathy for your mom, stay strong and learn to manage time and money when gambling. Also, try to get a hobby, it'll help you battle with loneliness. It seems the pleasure to gamble better hijacks your self concept when you are alone. The best solution is applying self denial to a point. And soon you'll be on the drivers seat of your decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "January 31, 2023, 12:26:44 PM",
      "body": "There's no such best time to get better luck on gambling, it doesn't matter how you feeling or your condition, the result is random as long as the provider using provably fair system. Do you think in gambling you will make money in the long run? no, there's no slot offer higher than 100% RTP, all of them will less than 100%, some of them even only have 80% RTP. I see nothing wrong to gamble during lonely or to pass free time, because it's what's gambling purpose for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "January 31, 2023, 12:48:26 PM",
      "body": "Quote from: romero121 on January 31, 2023, 09:50:26 AMThrough this I would like to remind be careful when you are alone. If your mind wish to gamble, go for it. But don't consider it as a way to pass your time and keep on wagering. The outcome might hurt, because most of the time loneliness is felt when our mind is in a bad mood. Some enjoy being lonely, but the reality used to be different.It still depends on when you are thinking clearly and responsibly about all your decision whether you are lonely or happy, you cannot apply what you experience, others, have different moods and different approaches to gambling, some are gambling when they are happy, some when they are excited, you cannot generalize feeling in gambling the most important is you have control and you know your limit, you just can't depend on your gambling experience through your feeling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panjul07",
      "created_time": "January 31, 2023, 12:56:05 PM",
      "body": "QuoteBeing Lonely drives you towards Gambling....! You are responsible for yourself, your situation will not drive you to gambling if you can control yourself. So I do not agree with your statement that being lonely drives us towards gambling, as it is all about how we deal with our loneliness. You can find other activities, why did you choose gambling when you feel lonely? This simple question shows that you made a mistake and you did not aware about it until you lost your money then try to blame your loneliness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "January 31, 2023, 01:00:49 PM",
      "body": "Quote from: romero121 on January 31, 2023, 09:50:26 AMDoes anybody have this experience or this is happening with me. Most of my gambling losses have taken place when I feel lonely.Today one such incident have taken place. I've kept my last few weeks signature earning aside to meet some medical needs. Today my mother got hospitalised and I'm her attender. She is supposed to take a minor surgery as her vision isn't clear. She's been taken to the Operation Theatre and I was left alone in the room. If anything required the nursing staff would call me. By thos time my mind didn't think about anything. All of the sudden why don't you gamble? and I started and made 0.009BTC close to 0.01BTC and the greed didn't left me. Finally lost all my month's earning kept aside.You kept a month of your signature earnings to have some money to be used for your mother's bills and you choose to gamble that instead of just converting it and paying it to the hospital??What an insane mind you have. I'm a bit disappointed with the decision you made. I don't personally know you, but as a family-oriented man, I will prioritize my family over some hobbies or whatever you want to call to gambling. I will spend that amount to pay bills and not to gamble it. You know the risks of gambling right? If you may, where will you get the supposed funds that you could use to pay those bills of your family member? At least think of your decision next time before taking an action. My apologies to what I said too. As @livingfree said, you might wanna go to an expert because I think you need it.Quote from: romero121 on January 31, 2023, 09:50:26 AMThrough this I would like to remind be careful when you are alone. If your mind wish to gamble, go for it. But don't consider it as a way to pass your time and keep on wagering. The outcome might hurt, because most of the time loneliness is felt when our mind is in a bad mood. Some enjoy being lonely, but the reality used to be different.I will never ever gamble when I'm alone. I'm an introvert and most of the day, I'm alone in my small room and I didn't even think of gambling even a bit. There are many things that you might wanna do when you're alone. Read books, watch videos, play online games but not gambling particularly not gambling using your funds that supposedly be used to pay bills.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AverageGlabella",
      "created_time": "January 31, 2023, 01:09:08 PM",
      "body": "Quote from: Accardo on January 31, 2023, 12:25:48 PMLearn to schedule time for gambling, put some money aside for gambling in the morning, afternoon and evening. This way you won't only enjoy gambling, but save more time for the entertainment. It's not super interesting to gamble all the funds at a time. Added with the profits you made, it would have been wise to stake your profits and recover the initial monthly savings. It's too risky to continue making such mistakes, especially when you need the money for health issues. Health is happiness and don't gamble with it. Besides, my sympathy for your mom, stay strong and learn to manage time and money when gambling. Also, try to get a hobby, it'll help you battle with loneliness. It seems the pleasure to gamble better hijacks your self concept when you are alone. The best solution is applying self denial to a point. And soon you'll be on the drivers seat of your decisions. Good advice the biggest problem with a lot of people who gamble is they do it impulsively and do not think about how much they are spending. If you schedule times that you can gamble and only on certain events and make rules that you cannot bet when that bet fails you will start to bet safer and you will probably enjoy it more too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "January 31, 2023, 01:14:25 PM",
      "body": "It's actually amazing how you had the mindset to gamble inside the hospital while your mother was under an operation (I'm assuming this is what happened based on your story). If not, well, the core idea still remains, you gambled while under pressure. I reckon this happens if you were an impulsive decision-maker, not just in gambling but in everything else. I reckon it's time to practice some time off with decisions, as well as possibly removing gambling completely since impulsiveness isn't exactly something you can remove quickly enough. Gambling on the other hand can be if you replace it with a hobby instead. And take a break to get a check-up from your psychiatrist or something. You definitely need it. It may not seem helpful since advice can be given by others as well on the internet, but properly talking it out irl with someone else face to face can help you realize how much you're fucking up your decisions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "January 31, 2023, 01:15:15 PM",
      "body": "I think I've experienced that before. I was in a position of had no money and suddenly, I heard a voice telling me I could gamble to earn money. And I followed the sound but unfortunately, the result was different from what I wanted, which I lost at that time.And after that experience, I'm always careful, especially if I hear voices like that again. I don't want to go through an experience like before. And if I'm alone, even if those voices come and tell me to gamble, I won't be affected because I gamble only because I want to and not because of the voices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}