{
  "id": "topic_5450312",
  "title": "Ledway",
  "author": "Ledway",
  "created_time": "April 26, 2023, 11:33:04 PM",
  "content": "Have you ever wonder how lucrative or powerful Bitcoin is in the crypto world.And you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire? Now listen!The  creator of swiss key,kyle kemper created a formula that determines how much Bitcoin one has to own in relation to the value of the world's wealth and the rise of a Bitcoin over time.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450312",
  "comments": [
    {
      "author": "paid2",
      "created_time": "April 27, 2023, 07:22:08 AM",
      "body": "I think you are posting in the wrong section of the forum. Bitcoin discussion board seems more appropriate.I'm personally very skeptical, and not sure I understand 100% of your point.How could he predict the future price of bitcoin to determine the volume needed to become a millionaire? Do I miss something ?I have a rule: when someone predicts the price of Bitcoin, I ignore them and consider them a scammer, or at best someone briefly in need of attention on social networks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "April 27, 2023, 09:01:11 AM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.And you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire? Now listen!The  creator of swiss key,kyle kemper created a formula that determines how much Bitcoin one has to own in relation to the value of the world's wealth and the rise of a Bitcoin over time.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.Again, we don't need to be the creator of something or be a rocket scientist to understand the power or the potential of bitcoin. It might not be a 'guarantee' wealth to us because I believed that there's no such thing in our life. There are no guarantees, everyone has to work his ass off in order to become a million or in this market crypto millionaire.So be it 0.06 or greater or lower, depending on your capacity, it doesn't mean you will be worth $1 million. As long as you can invest the money that you can afford and accumulate and HODL for long term, I think that is enough for us to maybe someday all of us becoming a crypto millionaire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davian144",
      "created_time": "April 27, 2023, 09:59:35 AM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.And you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire? Now listen!The  creator of swiss key,kyle kemper created a formula that determines how much Bitcoin one has to own in relation to the value of the world's wealth and the rise of a Bitcoin over time.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.If you have to ask yourself a question like that, I don't think it really needs to be asked because 1 Bitcoin is enough to give 1 Unit of luxurious house with a minimalist impression in my place at hundreds of millions in my country's currency. Indeed, in general it is not enough to make someone rich, but if only to call him a millionaire, I think for just 1 Bitcoin someone can get that title from other people who are still poor. But I'm confused by the Kemper formula that you said because if only with a total of 0.06624605 BTC to guarantee the wealth you mentioned, I think at this point there are very many people who have that amount of Bitcoin but they are still not called a person. millionaire now. So can you explain again the meaning of the formulas and formulas here so that I don't fail to understand what you are saying?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "April 27, 2023, 10:42:19 AM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMAccording to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.I think these are very exaggerated calculations, do you think owning 0.06624605 BTC will make one really rich? Then most people would be more than just rich!!!Most predictions expect that Bitcoin will reach its highest peak of one million dollars, so if Bitcoin reaches this peak, then 0.066BTC = 66000$. Does this amount make you rich???!!!I don't know on what basis Kemper made his calculations but I think they are wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "April 27, 2023, 11:24:12 AM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.And you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire?Bitcoin has proven its strength from the year it was created until now it has a very solid foundation among other coins and you will find out how profitable Bitcoin is when you make Bitcoin a long-term investment.We will try to convey at a glance from the price point of view how profitable Bitcoin is because I understand the direction of your question there.1 Bitcoin purchased by someone at a price below $1K, now that person can enjoy big profits with multiplication of prices that have reached $60K - $69K.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "April 27, 2023, 12:16:56 PM",
      "body": "This depends on which part of the world you find yourself in, if you leave in the US then 1 unit of Bitcoin will not be enough to pay for your bills or rent you a decent apartment for two to three months. But in some other parts of the world where there is low-value currency such as in some African countries, 1BTC will run into several million and that could actually make you a. Millionaire with the right planning. Btw, you posted this on the wrong board so you need to move the thread to either Bitcoin discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "April 27, 2023, 12:56:21 PM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.And you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire? Now listen!The  creator of swiss key,kyle kemper created a formula that determines how much Bitcoin one has to own in relation to the value of the world's wealth and the rise of a Bitcoin over time.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.Why completely relying on future? And I don’t see any straight connection to the prediction made here. I mean how exactly did he get this number? In order to become millionaire, I have to work hard. This is clear and all should set up in mind. We also know that Bitcoins are limited in number and very valuable. So instead of assuming for the future, if we accumulate as many Bitcoins as we can, then a time will come when the demand of the coin will be increasing, hence the price of the accumulated Bitcoins in your wallet will increase in price. Now many can follow this actually to become millionaire with Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "April 27, 2023, 01:09:52 PM",
      "body": "Quote from: Nrcewker on April 27, 2023, 12:56:21 PMQuote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.And you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire? Now listen!The  creator of swiss key,kyle kemper created a formula that determines how much Bitcoin one has to own in relation to the value of the world's wealth and the rise of a Bitcoin over time.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.Why completely relying on future? And I don’t see any straight connection to the prediction made here. I mean how exactly did he get this number? In order to become millionaire, I have to work hard. This is clear and all should set up in mind. We also know that Bitcoins are limited in number and very valuable. So instead of assuming for the future, if we accumulate as many Bitcoins as we can, then a time will come when the demand of the coin will be increasing, hence the price of the accumulated Bitcoins in your wallet will increase in price. Now many can follow this actually to become millionaire with Bitcoins.And also the formulary is based on when bitcoin will make $1M. When will it be and which generation will witness it? How sure are we that something more than bitcoin will not happen to  the world and truncate the reign of bitcoin.There's no much difference between his formulary and calculations from that of Satoshi millionaire. All these things are tend to discourage people from doubling their efforts and rely on unrealistic future fortunes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 27, 2023, 01:16:48 PM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMAccording to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.There is no such guarantee and for sure it's not going to be a formula to do so.In case somebody is interested in the details of the formula, here is it, pretty old stuff (in bitcoin time)https://investory-video.com/blog/earn-bitcoin-crypto-millionaireIt basically estimates the whole coinmarketcap of Bitcoin is going to be the same as the global wealth and then divide it to find how much would a million be in BTC.Oh, and BTW, the estimate is no longer accurate, since the global wealth is not 317 trillion but 463.6 trillion the amount of BTC needed has also gone down to 0.045356.This is a bit stupid, because if the global wealth goes to 4600 trillion, you will be only needing 0.0045 BTC, so 140$ will make you a millioane.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "April 27, 2023, 01:30:56 PM",
      "body": "Quote from: stompix on April 27, 2023, 01:16:48 PMOh, and BTW, the estimate is no longer accurate, since the global wealth is not 317 trillion but 463.6 trillion the amount of BTC needed has also gone down to 0.045356.This is a bit stupid, because if the global wealth goes to 4600 trillion, you will be only needing 0.0045 BTC, so 140$ will make you a millioane.In the end, we have seen so many predictions of this style, which make a snapshot and miss many parts of the supply-demand and inflation equation. It's like predictions of when bitcoin will reach a million, which is hard enough to get right, but the most telling thing will be what you can buy with a million by then, which at the rate we're going will be much less than it is now.In the end, for me the 'power' of bitcoin comes down to the fact that if you accumulate as much as you can without obsessing about numbers or dates, you will be much better off in the future than if you don't accumulate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "April 27, 2023, 01:47:38 PM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.And you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire? Now listen!The  creator of swiss key,kyle kemper created a formula that determines how much Bitcoin one has to own in relation to the value of the world's wealth and the rise of a Bitcoin over time.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.If that is the total Bitcoin that you need in order to have $1 Million, then I wonder how much is the value of 1 BTC at that time, that can reach $15M - $20M per Bitcoin which I think is already unrealistic and BTC might took another decade just to reach that price or not possible at all. The power of Bitcoin is slowly growing as USD continues to lose its dominance in the market. In the next 5 years, I'm sure Bitcoin will be on a better place but reaching a $1 million value per Bitcoin is too good to be true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "April 27, 2023, 03:25:34 PM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.And you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire? Now listen!The  creator of swiss key,kyle kemper created a formula that determines how much Bitcoin one has to own in relation to the value of the world's wealth and the rise of a Bitcoin over time.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.please include his prediction link because I tried to find the prediction you wrote but couldn't find it anywhere even on his Twitter account. but everyone is entitled to make predictions about the price of Bitcoin regardless of whether they are ordinary person or someone who works in technology. as the half-brother of the prime minister of Canada, I doubt that the relationship between the two is fine, we know that Canada is not so friendly with Bitcoin and other cryptocurrencies even though they are planning to issue CBDC, I am curious what is the meaning of his prediction above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "April 27, 2023, 03:29:04 PM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.I think his hypothesis is not yet complete for someone to have interest to debate on it. I have no problem if he is speculating 0.06624605 btc to guarantee wealth worth of $1 million but my point is how many years will the hodl that value of bitcoin until it gets to a million dollar. Is the person hodling for eternity? Anyway, we know that he is merely speculating just like anyone can do. Hodling some fractions of bitcoin for a long time is sure to increase no doubt but no guarantee on how much value it can create.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "April 27, 2023, 08:32:24 PM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMAccording to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.Never heard of this formula, but I would say I doubt it though, I mean market is very volatile so maybe in the next coming years this could be true, but how about the future?  Definitely this is a chance that btc can we worth $1 million in the future and so I guess the goal still for us is to scope as much as we can and not just what this formula has suggested. There were even school of thoughts that at least having 1 BTC should objective, or what we call our holy grail.It's just so odd that everyone has his/her opinion on how much we should be saving. One thing that I agree though is that bitcoin could be a powerful thing in the future. And we don't need to look and see how it goes, just today, government are trying to control or even regulate it globally. But we know that it can't be stop at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "April 28, 2023, 09:20:37 AM",
      "body": "There is no guarantee that investing will make you a millionaire. There was an opportunity from 2009 to 2011 when Bitcoin took a new position in the market because the price of Bitcoin was very low. Later on Bitcoin prices skyrocketed and nowadays becoming a millionaire is not a phenomenon. 2021 If the price of Bitcoin could have been saved in the past, there would have been one of the richest people in the present.Investing a large amount of wealth in Bitcoin at present will definitely earn some wealth from it in the future. Because currently the price of Bitcoin is very low, the price of Bitcoin will increase in 2024. There is a halving according to the cycle. Now this opportunity is there so definitely use it to make use of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 28, 2023, 12:14:01 PM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMAccording to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.I cannot understand such relationships, but suppose that the amount of 0.06624605 BTC is enough to guarantee a fortune worth a million dollars, then a million dollars is an amount that does not equal the value of a million dollars today. In the past, it was impossible for an individual to reach a billion dollars, and now we are starting to hear people with wealth more than Trillion dollars.when the value of 0.06624605 BTC is equal to one million dollars, this means that the individual can generate that amount as income in less than a year.Summary of what I am trying to say, there is no specific limit for Bitcoin to be rich, just work hard and collect more, reduce your expenses, and you will enjoy a safe life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fesatmas",
      "created_time": "April 28, 2023, 01:49:07 PM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.And you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire? Now listen!The  creator of swiss key,kyle kemper created a formula that determines how much Bitcoin one has to own in relation to the value of the world's wealth and the rise of a Bitcoin over time.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.Yes of course Bitcoin is very much in the world of cryptocurrency it is the king of all coins available on the market today and forever.No, I don't think that having only 1 Bitcoin can become a millionaire considering the current price alone bitcoin is still at $ 29k, it still takes a lot to reach $ 1 million and it still takes quite a long time to get to that price.Yes, that might be termed as adoption has to increase crazily for bitcoin to increase its price to $1 million and to be a millionaire with only one bitcoin we have, I wish I was still alive at that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "April 28, 2023, 03:16:45 PM",
      "body": "Quote from: hugeblack on April 28, 2023, 12:14:01 PMI cannot understand such relationships, but suppose that the amount of 0.06624605 BTC is enough to guarantee a fortune worth a million dollars, then a million dollars is an amount that does not equal the value of a million dollars today. I agree.Quote from: hugeblack on April 28, 2023, 12:14:01 PMIn the past, it was impossible for an individual to reach a billion dollars, and now we are starting to hear people with wealth more than Trillion dollars.I don't know where you get that from, but it is incorrect. The first billionaire was Rockefeller 105 years ago and the richest person in the world today has $235B, so far from $1T.https://www.forbes.com/real-time-billionaires/#14005d293d78https://www.thecollector.com/how-john-d-rockefeller-became-first-billionaire/Quote from: hugeblack on April 28, 2023, 12:14:01 PMSummary of what I am trying to say, there is no specific limit for Bitcoin to be rich, just work hard and collect more, reduce your expenses, and you will enjoy a safe life.Despite what has been said above, I also agree with this. It is not so important that the absolute numbers expressed are incorrect as that the trend of fiat to devalue and bitcoin to revalue makes the amount of 0.06624605 BTC meaningless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "April 28, 2023, 05:56:32 PM",
      "body": "Quote from: Ledway on April 26, 2023, 11:33:04 PMHave you ever wonder how lucrative or powerful Bitcoin is in the crypto world.Yes and I've already seen how both powerful and lucrative it was because it's the main attraction in the entire crypto market.Quote from: Ledway on April 26, 2023, 11:33:04 PMAnd you ask yourself(especially as a beginner in cryptocurrency business) can 1 Bitcoin make you a millionaire? Now listen!If it reaches $1M per bitcoin and I own 1 bitcoin then that means it really is.  Quote from: Ledway on April 26, 2023, 11:33:04 PMThe  creator of swiss key,kyle kemper created a formula that determines how much Bitcoin one has to own in relation to the value of the world's wealth and the rise of a Bitcoin over time.According to Kemper's formula: A person need a total of 0.06624605 BTC in order to guarantee wealth worth $1 million.With this research or formula then bitcoin should be at least $15.1M by that time in order for someone who owns with that amount to become a millionaire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}