{
  "id": "topic_5490669",
  "title": "Qwertykk",
  "author": "Qwertykk",
  "created_time": "March 28, 2024, 02:00:21 PM",
  "content": "\"common man\", a common term for the average citizen.\"An average citizen\", one who strives daily To meet up in securing the basic necessities of life. Approached by Bitcoin , the common man sees hope!Hope of a bright future.Hope of achieving a longtime dream of primordial success.Hope of all sorts and to all kinds of menBitcoin was like the bright light at the end ot the tunnel.And it still is!But with all the challenges faced by the average man, many have given up hope in this light(Bitcoin) .Patience is one key factor to acquiring success through Bitcoin .If only the common man would have to be patient, then a guarantee of life long success can be attainable.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5490669",
  "comments": [
    {
      "author": "Plaguedeath",
      "created_time": "March 28, 2024, 02:08:51 PM",
      "body": "Average Joe which are people who have nine to five jobs, not earn a lot and can live comfortable without luxury, is definitely can become rich with Bitcoin.They just need to adopt frugal or minimalism living and they should use almost all of their money to invest in Bitcoin. They don't have to prepare emergency funds because Bitcoin itself is high liquidity currency which you can sell immediately for your needs.The problem is people who don't earn a lot are diversify their investment, when your capital is low, it's better for focus on one investment until it grow so much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "March 28, 2024, 02:11:06 PMLast edit: March 28, 2024, 02:23:33 PM by Amphenomenon",
      "body": "The common man fail to become successful with bitcoin investment because they continue listen to the media, believing influencers or top figures who knows nothing about bitcoin investment. Thinking they already missed out on bitcoin investment and opt for altcoinsFollowing the misconception that they will get the next Shiba by investing in meme/shit coins. Believing trading is more profitable and better than HODLing. Having little or no knowledge about how to properly HODL. their bitcoin save.Quote from: Plaguedeath on March 28, 2024, 02:08:51 PMAverage Joe which are people who have nine to five jobs, not earn a lot and can live comfortable without luxury, is definitely can become rich with Bitcoin.They just need to adopt frugal or minimalism living and they should use almost all of their money to invest in Bitcoin. They don't have to prepare emergency funds because Bitcoin itself is high liquidity currency which you can sell immediately for your needs.Investing in bitcoin with almost everything they have without preparing emergency funds is wrong even if one as little to invest in Bitcoin, it is better to consider a time were they may be in need of funds and will not be thinking of selling their bitcoin at a lost or little profit, Investment in Bitcoin is done to HODL to your own investment goal and continously since it's currently the best store of value. Emergency funds is important and living life as a minimalist is also important for a common man to be successful in bitcoin investment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "March 28, 2024, 02:24:37 PM",
      "body": "Quote from: Amphenomenon on March 28, 2024, 02:11:06 PMThe common man fail to become successful with bitcoin investment because they continue listen to the media, believing influencers or top figures who knows nothing about bitcoin investment. There is the problem right there.Stop treating bitcoin as just an \"investment\", it is a peer to peer digital currency implementation that you're supposed to buy and sell with. We literally would not get to this point if people weren't willing to pay what is now sizable amounts of bitcoin for everyday items.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "March 28, 2024, 02:34:44 PM",
      "body": "Quote from: NotATether on March 28, 2024, 02:24:37 PMQuote from: Amphenomenon on March 28, 2024, 02:11:06 PMThe common man fail to become successful with bitcoin investment because they continue listen to the media, believing influencers or top figures who knows nothing about bitcoin investment. There is the problem right there.Stop treating bitcoin as just an \"investment\", it is a peer to peer digital currency implementation that you're supposed to buy and sell with. We literally would not get to this point if people weren't willing to pay what is now sizable amounts of bitcoin for everyday items. Yes truly this is what was stated in the whitepaper  and I believe on it but there have been different views of Bitcoin now and bitcoiners have been able to back it up why they have that view for Bitcoin and base on Op post,It's view as a store of value like digital code. While currently Argentinians view it as an hedge of inflation  https://bitcointalk.org/index.php?topic=5490389.msg63860277#msg63860277But in the end this does not stop Bitcoin for being a peer to peer electronic cash as stated in the whitepaper",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "March 28, 2024, 03:05:12 PM",
      "body": "I don't like using the word \"man\" when referring to humans in general, but I'll comment a bit more on the main ideas. To an average person, Bitcoin is still probably not well-known, considering that less than 5% of humans actually have any experience with Bitcoin. So it's just a name of something associated with hype, high price, probably also with scams and other illegal activities. If people turn to it because of the potential profit, it can be a symbol of hope for a better future, but that is also a risky attitude because Bitcoin is volatile and largely unpredictable. There's no guarantee of success, and that's why people should manage their expectations and be ready for unfortunate events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "March 28, 2024, 03:27:13 PM",
      "body": "Quote from: Qwertykk on March 28, 2024, 02:00:21 PMIf only the common man would have to be patient, then a guarantee of life long success can be attainable.Patience is a virtue but you got to understand that not everyone can afford to buy large quantities of bitcoin anymore, even the respectable satoshi amount is too expensive for the common man so even if the common man has a bitcoin or starts investing now or maybe even at the last lowest price of bitcoin, they wouldn't still be able to afford to buy a decent amount that wouldn't hurt their wallet, it's a really difficult thing to say anymore to be patient about bitcoin especially if you've only started to invest in it now, you got to be as patient as possible or else you'd be getting nothing. Bitcoin isn't for your average income common man anymore, even if you can do a slowly but surely consistent DCA, you'll have a hard time doing the hodling and saving, it's full of frustration that you don't have enough bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "March 28, 2024, 03:27:23 PM",
      "body": "Quote from: Amphenomenon on March 28, 2024, 02:11:06 PMThe common man fail to become successful with bitcoin investment because they continue listen to the media, believing influencers or top figures who knows nothing about bitcoin investment. bitcoin is not and will never be an investment. An investment is something that you hope will increase in value, there is no way to guarantee that with bitcoin... if someone treats bitcoin as some kind of stake in a company that generates wealth and consumer goods, bitcoin will be a disappointment.Bitcoin is software... its value is its utility... What other system allows you to send wealth through communication systems without intermediaries? Send any amount of money to anyone on the planet at any time and free from censorship? Bitcoin is an alternative to all the corruption and dirt of the traditional monetary system, a clean, honest and fair alternative.bitcoin is freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 28, 2024, 03:35:59 PM",
      "body": "Quote from: Qwertykk on March 28, 2024, 02:00:21 PMIf only the common man would have to be patient, then a guarantee of life long success can be attainable.First Bitcoin is a currency that should be used for the payment of goods and services. But due to its volatility and its constant price increase most people now see it as an investment.  But I am not comfortable when people see Bitcoin as the hope of the poor or the common man. Many investors have made a fortune from Bitcoin because they acquired it cheaply and were able to hodl it for a very long time. Currently, the price of Bitcoin is high and one has to invest heavily to make a fortune from it.  I will say that a low-income earner will be able to accumulate a large amount of Bitcoin over a long period using the DCA strategy. The common man would have to work hard for him to provide for his needs, save, and invest part of it in Bitcoin. I agree that patience is important for anyone who wants to make some profit from Bitcoin because it is not a get-rich-quick scheme.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "March 28, 2024, 04:21:21 PM",
      "body": "Quote from: Qwertykk on March 28, 2024, 02:00:21 PMIf only the common man would have to be patient, then a guarantee of life long success can be attainable.Can a common man as used by you in your sentence afford Bitcoin with the current price and what will be the plan of someone who is barely getting money to survive investing in Bitcoin that is not a guarantee for being worthy overnight, I believe this is the area that one needs to look upon before choosing to invest in Bitcoin because a lot of people have misunderstood the main concept why bitcoin was created I think it's high time people stop referring to Bitcoin as the hope of a an average man because Bitcoin doesn't change the financial status of people overnight but it can give you a good profit if you are able to make a good investment plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AVE5",
      "created_time": "March 28, 2024, 04:25:48 PM",
      "body": "Bitcoin is a developed Crypto coins technology alternatively to make anyone rich or richer. Which every mean financial status of individuals are entitled to step on. Although the potentiality to make one rich doesn't happen so dramatically or magically but most based on time factors such as acquiring your bitcoin and hold patiently for a long time but the individual such as the common or average individuals as Op made mentioned are duly expected to have alternative source of income so that they could give their holdings time to grow and there then profit can be made account about depending on the investors aim and target of achievement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 28, 2024, 04:29:17 PM",
      "body": "Quote from: Qwertykk on March 28, 2024, 02:00:21 PMBut with all the challenges faced by the average man, many have given up hope in this light(Bitcoin) .Patience is one key factor to acquiring success through Bitcoin .If only the common man would have to be patient, then a guarantee of life long success can be attainable.Its not only lack of patience that affects them from investing in bitcoin, Some of them don't really understand this digital currency and don't have the zeal of paying attention to its learning details, while those that give a trial end us not doing the right thing expected and loose their investment asset on it, we should not be moved by what others are saying concerning bitcoin, some of them are doing that out of ignorance, we have to be focused on what we want and we are chasing after under a decentralized network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Muchiratsky",
      "created_time": "March 28, 2024, 04:30:28 PM",
      "body": "Quote from: Zlantann on March 28, 2024, 03:35:59 PMQuote from: Qwertykk on March 28, 2024, 02:00:21 PMIf only the common man would have to be patient, then a guarantee of life long success can be attainable.First Bitcoin is a currency that should be used for the payment of goods and services. But due to its volatility and its constant price increase most people now see it as an investment.  But I am not comfortable when people see Bitcoin as the hope of the poor or the common man. Many investors have made a fortune from Bitcoin because they acquired it cheaply and were able to hodl it for a very long time. Currently, the price of Bitcoin is high and one has to invest heavily to make a fortune from it.  I will say that a low-income earner will be able to accumulate a large amount of Bitcoin over a long period using the DCA strategy. The common man would have to work hard for him to provide for his needs, save, and invest part of it in Bitcoin. I agree that patience is important for anyone who wants to make some profit from Bitcoin because it is not a get-rich-quick scheme. I'd say we're already past the time to seriously think about Bitcoin as something that can make you wealthy. The average man wouldn't be able to purchase one full Bitcoin. Yeah, you can buy at small amounts but then you still would have to deal with BTC's volatility. It took a few years for Bitcoin to be where it is now from a coin that was worth just a couple of dollars before. It needed people who believed it could go up in value to move up in dollar equivalent and get most people hyped. Or it could just be me since I know I can't own an actual full Bitcoin at 67k each. It's tempting to think that buying BTC is a common man's way to being rich, but Bitcoin isn't made to be that in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "March 28, 2024, 04:33:21 PM",
      "body": "Bitcoin can be the light as well as Bitcoin can become the darkest wildest nightmare. For an average Joe Bitcoin will definitely look like must have but they should be prepared about everything before buying their Bitcoin and only people who did that can withstand the bear season as well as the scammers and hackers who always waiting for the opportunity to steal money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "March 28, 2024, 04:54:12 PM",
      "body": "Quote from: NotATether on March 28, 2024, 02:24:37 PMQuote from: Amphenomenon on March 28, 2024, 02:11:06 PMThe common man fail to become successful with bitcoin investment because they continue listen to the media, believing influencers or top figures who knows nothing about bitcoin investment. There is the problem right there.Stop treating bitcoin as just an \"investment\", it is a peer to peer digital currency implementation that you're supposed to buy and sell with. We literally would not get to this point if people weren't willing to pay what is now sizable amounts of bitcoin for everyday items.If Bitcoin needs to be treated like a currency system, it's going to be the most pathetic currency system I have ever used in my life! It's costly and slow. We are living in an era where money can be transferred from mobile phone by scanning a QR code. It's instant and free. Bitcoin doesn't stand a chance here. Bitcoin is thriving because it's the best investment option this humanity has ever come accross. If Bitcoin's price stabilizes, half of the crowd will be gone!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Negotiation",
      "created_time": "March 28, 2024, 04:58:44 PM",
      "body": "Not just investing in bitcoin but all jobs need to be sustainable success is not possible without persistence. Success will come if you understand the correct position of bitcoin in the crypto market which is a very strong currency market. In the case of ordinary people long term planning should be done based on financial capability and there should be alternative means of income besides bitcoin investment. Alternative means of income for one's lifestyle will meet the basic needs and the life of the common man will become better if it can be sustained for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "March 28, 2024, 05:12:26 PM",
      "body": "In my opinion Bitcoin is the easiest investment a common man can make with you having full control and no third party involved. However overtime I have come to realize that the reason why some people run from Bitcoin investments is because they are scared because of stories they of heard of how people went bankrupt Because of an altcoin pump and dump scheme. I have also come across a lot of people who have this disturbing idea that Bitcoin is a get rich quick scheme that is even one of the main reasons why many of them easily gets scammed.People who see the light in Bitcoin investments are those who have actually settled to understand how the whole crypto space works. Even if not everything but at least the most important and basic parts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "March 28, 2024, 05:13:40 PM",
      "body": "Human nature doesn't lead us to be patient. As a species we want everything now, this is why most cryptocurrency investors tend to fail by either selling too early or at a loss. Patience is a virtue, most of don’t have it. Those of you who can buy Bitcoin regularly & HODL for at least, ideally, three cycles, will be grestly rewarded with very impressive profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "March 28, 2024, 05:24:56 PM",
      "body": "Quote from: Qwertykk on March 28, 2024, 02:00:21 PM\"common man\", a common term for the average citizen.\"An average citizen\", one who strives daily To meet up in securing the basic necessities of life. Approached by Bitcoin , the common man sees hope!Hope of a bright future.Hope of achieving a longtime dream of primordial success.Hope of all sorts and to all kinds of menBitcoin was like the bright light at the end ot the tunnel.And it still is!But with all the challenges faced by the average man, many have given up hope in this light(Bitcoin) .Patience is one key factor to acquiring success through Bitcoin .If only the common man would have to be patient, then a guarantee of life long success can be attainable.Well you do got the point and something which is true but it would be better that we should really be that realistic at least on the things that we are trying out to achieve.Trying out to become rich and having that changed up financial status in the future? Possible but it would really be depending on the amount that you had invested with Bitcoin.With the current price of BTC then we cant deny or we arent that blind that it is already too high. Lets say that it would be able to reach up $700k per coin on which it would really be just that x10with the money that you have invested basing up on the current price we do have now.This isnt something that revolutionary if we do speak about long term holds because it would really be that useless if you are someone who do able to make investment on small amounts but well as a form of savings then we can really say that it is really that worthy but of course you shouldnt be always forgetting about the riskssince there's no assurance that it would really be that still existing in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "March 28, 2024, 05:55:22 PM",
      "body": "Quote from: avikz on March 28, 2024, 04:54:12 PMQuote from: NotATether on March 28, 2024, 02:24:37 PMQuote from: Amphenomenon on March 28, 2024, 02:11:06 PMThe common man fail to become successful with bitcoin investment because they continue listen to the media, believing influencers or top figures who knows nothing about bitcoin investment. There is the problem right there.Stop treating bitcoin as just an \"investment\", it is a peer to peer digital currency implementation that you're supposed to buy and sell with. We literally would not get to this point if people weren't willing to pay what is now sizable amounts of bitcoin for everyday items.If Bitcoin needs to be treated like a currency system, it's going to be the most pathetic currency system I have ever used in my life! It's costly and slow. We are living in an era where money can be transferred from mobile phone by scanning a QR code. It's instant and free. Bitcoin doesn't stand a chance here. Bitcoin is thriving because it's the best investment option this humanity has ever come accross. If Bitcoin's price stabilizes, half of the crowd will be gone! That's right, even though Satoshi Nakamoto initially created bitcoin as a decentralized alternative payment method, in reality most people or investors use Bitcoin as an asset to store value, and also as a very promising investment in terms of profits.However, I assume that in the future it is very likely that Bitcoin will become the currency of the future, and the shortcomings of Bitcoin as a transaction tool, especially its high costs, will certainly be a consideration for many people. However, as time goes by, existing problems will definitely be resolved.And personally, although I use Bitcoin for investing, I also use it for transactions if I have to pay using Bitcoin personally and I've done that a few times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}