{
  "id": "topic_5449733",
  "title": "Ultegra134",
  "author": "Ultegra134",
  "created_time": "April 21, 2023, 07:45:36 PM",
  "content": "I signed up on this forum in 2014 with minimal knowledge of cryptocurrencies and a restricted ability to comprehend their concept. Being a young teenager, you'll understand. On top of that, I had no way of acquiring it myself. Thus, I missed the opportunity to buy at ridiculously low prices (compared to today's). I gave up shortly after and reappeared on the forum in 2017 for about a year or two at most, abandoning it again and kicking some great opportunities once again.I've seen an increasing trend over the past few months, mostly from newer BTT users striving to acquire as much Bitcoin as possible as soon as possible. Some even claim to sell their jewelry or other personal belongings in an attempt to acquire more capital to use towards a Bitcoin purchase. Other newbies claim that they found wallets filled with Bitcoin in the early stages, in an attempt to impress others, while a few days ago they'd be asking how to sign up on Binance or whatever. It's unclear whether any of these stories are true, but that's not the point.The majority of us missed the boat when Bitcoin was cheap, and now acquiring a whole coin isn't affordable anymore. The average wage in Greece is approximately €800 (about €10,000 per year), while Bitcoin's price is at $27,500 as we speak (about €25,000), which means that I will need 2.5 years to acquire the requested amount of money, in the condition of not spending a single Euro, without taking into account any price increases. Thus, purchasing a whole coin would effectively require up to 6 or even 7 years for the average person in Greece.I currently have less than 0.20 BTC, which is still a semi-decent amount for myself, the majority of which are from signature campaigns (huge thanks to Cryptobrainboss and Hampuzz for having me in their campaigns), and I'm totally okay with the idea of never owning a single Bitcoin; it's not the end of the world. So far, I'm earning an important side income through it, while spending time on the forum is like a hobby of mine now. This is what matters most to me.To summarize, my point is that many of us won't become rich or earn a great deal of money through Bitcoin, but that's okay; money isn't the greatest goal in life. We missed the early stages, but that doesn't mean that we don't have a chance in the future. There's no need to regret anything, coming from someone who was here during the first years and missed the boat. It's completely unnecessary to stress over how to acquire more and go above and beyond by selling stuff or exceeding the budget you can afford. Stick to what you can afford to spend and stick to that plan; don't go to extreme measures; and remember, there are no guarantees in investments.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449733",
  "comments": [
    {
      "author": "Rruchi man",
      "created_time": "April 21, 2023, 08:04:19 PM",
      "body": "Quote from: Ultegra134 on April 21, 2023, 07:45:36 PMTo summarize, my point is that many of us won't become rich or earn a great deal of money through Bitcoin, but that's okay; money isn't the greatest goal in life. We missed the early stages, but that doesn't mean that we don't have a chance in the future. There's no need to regret anything, coming from someone who was here during the first years and missed the boat. It's completely unnecessary to stress over how to acquire more and go above and beyond by selling stuff or exceeding the budget you can afford. Stick to what you can afford to spend and stick to that plan; don't go to extreme measures; and remember, there are no guarantees in investments.As you try to invest and get bitcoins, you still have to try to enjoy your life and not go to extreme measures to get bitcoins. We should be happy with whatever amount of bitcoins that you can get and keep and not focus on the portfolio of others that you hear are bigger than yours, so you do not do the extreme to get bitcoins or even die in the process of trying to sacrifice some things just so you can get bitcoins. Acquiring bitcoin is good, but you should have a life while trying to gather bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "April 21, 2023, 08:11:49 PM",
      "body": "Quote from: Ultegra134 on April 21, 2023, 07:45:36 PMI currently have less than 0.20 BTCDo not reveal your personal holdings in public. This advice does not only apply to those with multiple bitcoins in their wallet, but should be a practice for any bitcoiner. Build that habit of safe browsing while on the internet.Quote from: Ultegra134 on April 21, 2023, 07:45:36 PMIt's completely unnecessary to stress over how to acquire more and go above and beyond by selling stuff or exceeding the budget you can afford. Stick to what you can afford to spend and stick to that plan; don't go to extreme measures; and remember, there are no guarantees in investments.Never borrow or invest more than you can afford to lose. If you want to increase your Bitcoin holding; increase your income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "April 21, 2023, 08:13:28 PM",
      "body": "It's certainly true that most of us have missed the early days of bitcoin when it was still cheap because we ignore that opportunity. But then, as time passes by, we have understood that bitcoin's potential is endless and even if you're saying that you'll never own a single bitcoin but owning around 0.2BTC. You may quite that far from reaching half and its whole, don't doubt yourself. We just need to DCA until we reach that goal of having 1 bitcoin. And through accumulation in any means that you can, you're just enjoying the journey and no pressure at all. Even it might take a year or two or more, just be consistent on it and we're all gonna be there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "April 21, 2023, 08:22:02 PM",
      "body": "Most of the people here with huge experience in this forum had lost their chance to buy the 1 Bitcoin to their wallet. As we know bitcoin price was below 5k like 3-4K dollars in the 2016. In 6-7 years their was huge difference in the price of bitcoin and most of us not expected the value of 68k dollars.Because most of the people from forum before 2017 had criticised the price not reach the 20k dollars.But one day had answer for most of the traders negative comments on bitcoin price.I had trade some bitcoins in my trading history,but my maximum trade at a time 0.7 bitcoins during 2016.Then I had used that bitcoin when the price of bitcoin crossed 19k dollars in 2017.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "April 21, 2023, 08:26:36 PM",
      "body": "Quote from: Ultegra134 on April 21, 2023, 07:45:36 PMTo summarize, my point is that many of us won't become rich or earn a great deal of money through Bitcoin, but that's okay; money isn't the greatest goal in life. We missed the early stages, but that doesn't mean that we don't have a chance in the future. There's no need to regret anything, coming from someone who was here during the first years and missed the boat. It's completely unnecessary to stress over how to acquire more and go above and beyond by selling stuff or exceeding the budget you can afford. Stick to what you can afford to spend and stick to that plan; don't go to extreme measures; and remember, there are no guarantees in investments.It is too early to tell, Bitcoin Industry is still in its early phase, we still have long road ahead so I do not think that people who are not rich today don't have the chance to get rich later.  As long as we keep our dedication on fire, work smartly and hard, do preparations and smart planning, have financial knowledge, had the skill to work with different people, and put in more effort and time, I believe in due time, we can achieve the status we are dreaming of.  Just don't lose hope and enthusiasm, strive for the better, and step by step I believe we can hit the mark and accumulate the whole BTC we dream of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 21, 2023, 08:36:08 PM",
      "body": "As a newbie, then, if you had just stuck around a bit, I believe you would not have missed out on at least buying Bitcoin at a very affordable price of just about $800–$320 for 1 bitcoin. but again, you probably would have sold when the price was bullish in 2018.Some people had the money to invest in Bitcoin in the early days, but they were not informed; they lacked the knowledge of Bitcoin then, and their regrets today are that they would have made a lot of profit if they had bought them and held them until now. Despite the fact that the Bitcoin price today is so high, like you explained to the minimum wage in your country, if you still believe in the vision of accumulating 1 Bitcoin, you will definitely archive it one day, even if it takes you 4 or 5 years to do so. Just gradually buy and hold. Also, the DCA strategy has helped some people accumulate a significant fraction of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "April 21, 2023, 08:43:18 PM",
      "body": "News flash, Bitcoin wasn’t created for anyone to make millions out of it for free, if as a crypto-currency enthusiast I don’t get rich from it I would not necessarily blame Bitcoin for that.Many people has made great fortune from bitcoin already so that’s solidify the fact that Bitcoin is a good investment so if one can automatically buy one bitcoin they can atleast make use of their services into earning in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "April 21, 2023, 08:46:24 PM",
      "body": "Quote from: Ultegra134 on April 21, 2023, 07:45:36 PMsnipTo summarize, my point is that many of us won't become rich or earn a great deal of money through Bitcoin, but that's okay; money isn't the greatest goal in life. We missed the early stages, but that doesn't mean that we don't have a chance in the future. There's no need to regret anything, coming from someone who was here during the first years and missed the boat. It's completely unnecessary to stress over how to acquire more and go above and beyond by selling stuff or exceeding the budget you can afford. Stick to what you can afford to spend and stick to that plan; don't go to extreme measures; and remember, there are no guarantees in investments.The number of people which were able to get monster profits out of bitcoin are very limited, most of us will have to make do with way less than that, but it does not matter as even a small investment can help you to make your life way easier, for example if right now you only hold 20% of the amount needed to buy a house and that money was invested on bitcoin, then I think it is very possible bitcoin could grow 400% and allow you to buy that house without getting a mortgage, saving you a lot of money and stress over the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "April 21, 2023, 08:48:49 PM",
      "body": "Quote from: Ultegra134 on April 21, 2023, 07:45:36 PMTo summarize, my point is that many of us won't become rich or earn a great deal of money through Bitcoin, but that's okay; money isn't the greatest goal in life.It's true, money isn't everything, but everything needs money even in larger amounts when inflation continues to rise.Many people failed to take advantage of the opportunities in the market when the bitcoin price was very low in the past. Inexperience, lack of optimism, and price uncertainty have kept people from buying them a lot. But that's not a problem because it's better to have 0.xx than nothing.But now many people are starting to change their mindset about the potential of bitcoin, some even really want to sell their house, car or jewelry to invest in bitcoin. This is a testament to how mindsets have changed about bitcoin as the bitcoin economy has strengthened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 21, 2023, 09:04:35 PM",
      "body": "It is always a regret when one missed out at something that actually gained profits but don’t appreciate the fact that we might have also avoided some lose. Almost everyone coming into bitcoin post 2018 will actually find it hard to accumulate a bitcoin except someone reach or someone obsessed with having a bitcoin. But it’s not entirely bad to have satoshis. More so I don’t feel we are late already into bitcoin when we forecast at what could possibly happen in the future. Imagine having bitcoin at 500k while you invested at the 25k mark. That’s somewhat a high price. So bitcoin isn’t all about having it full but how long you can hold on to the fractions you have",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hannahB4",
      "created_time": "April 21, 2023, 09:13:30 PM",
      "body": "We may have people who invested early and held on to Bitcoin without rashly selling, therefore, having 1 to any amount in their possession. The most important thing to learn here is that there is no amount of Bitcoin you have that you shouldn't be proud of because of the dedication you put into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "April 21, 2023, 09:26:21 PM",
      "body": "I agree with what you say, it is absolutely not important or should not be necessary to own a full digit bitcoin.  For many it can probably become a psychological wall to break down to see a figure with so many zeros but in reality it is an excellent exercise to become familiar with the satoshi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "April 21, 2023, 09:33:51 PM",
      "body": "Earning 1BTC is not far from happening with you but it takes several years to fill it especially, if we are just reliant on signature campaigns. However, it doesn't really matter if we could reach it or not, the most important is that we already save some fractions of Bitcoin which is even better than those who have nothing and missed the opportunity. But I would suggest you OP find a way to help grow your earned BTC. Because for now, it is not how much we save or hold but it is how much we grow our finances as inflation keeps on increasing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "April 21, 2023, 09:43:32 PM",
      "body": "It's understandable that many of us missed out on buying bitcoin when it was cheaper than it is now. I joined the community after learning about bitcoin and with the excellent information I obtained from this forum, I will not be sorry for the decision I make on how to acquire and store bitcoin for future investments and use. I've decided to only invest what I can afford to lose, which is fine with me because that is one of my driving tools. I'm not troubled or disturbed by accumulating more when my income cannot support it. We all want good profits in the long run, but what is meant for you will not pass you by if you work towards achieving it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "April 21, 2023, 10:07:07 PM",
      "body": "Mate, don't worry about how many bitcoin you have right now, but worry about when you have nothing to invest. Even if you missed the best times to buy bitcoin at cheap price, you don't have to regret it now. The real regret is if you have nothing now because you have known bitcoin since almost 10 years, but you are still lucky to own 20% of 1 bitcoin.If you are consistent to invest, then I'm sure sooner or later you will get it, even if you have decent income, then try to accumulate during this correction. It's an opportunity to buy more bitcoin before the halving, and hold them until a new ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "April 21, 2023, 10:41:12 PM",
      "body": "Quote from: Ultegra134 on April 21, 2023, 07:45:36 PM-snip-and I'm totally okay with the idea of never owning a single Bitcoin; it's not the end of the world. I think with any value even just having 1 satoshi one should be proud because it shows one has the will to accumulate it someday.Bitcoin is not a new parameter to measure one's wealth, instead there are many rich people trapped out there with a centralized system. This is the pathway for anyone to a certain level of financial freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "April 21, 2023, 10:41:46 PM",
      "body": "Just continue on what you are doing and if you do want to hold for long term then go ahead.Dont rush up yourself on owning 1 Bitcoin because we should accept the fact or reality that this doesnt always happen because of real life conditions or scenarion and lets just accept that fact and be contented on what you are doing.We dont need to rush up and as long we do see progress on whatwe are targeting then we are just on the right track. Missed opportunities and chances is common because we arent all knowing person which we are really that able to missup something.Important thing is that you arent really that getting left behind and at least on having that savings up for long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "April 21, 2023, 10:58:08 PM",
      "body": "We are not required to do so. Owning an amount should be with initiative. Profit potential is there indeed but always be mindful of the risk. The bigger the amount, the larger the risk. And as cliché as it may sound, invest only an amount you can afford losing. Some people might just be confused; owning one bitcoin is the same as owning half of it. It just depends on your financial capabilities and risk tolerance. Any amount could result to profit. Just continue with what you are doing, instead you should be thankful of yourself because you are making a move for a better future-, engagement with investments and assets, which is in the first place already a good trait. Being open to investment is not all people could do, therefore you are in the right path.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "April 21, 2023, 11:02:34 PM",
      "body": "That's okay, everyone of us have each goal, sure money or getting rich is not the greatest goal of everyone. But you cannot get that greatest goal without spending a dime or being unfortunately poor, unless its not a money related goals which are rare nowadays.And yea, you dont need to have a whole bitcoin since its value is increasing and increasing, well unless it drop to again to 2-3k but it means that most are in us loss too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}