{
  "id": "topic_5444203",
  "title": "I_Anime",
  "author": "I_Anime",
  "created_time": "March 10, 2023, 04:51:13 AM",
  "content": "Bitcoin mining consumes power supply but the numbers of Bitcoin miners and other cryptocurrency miners continues to increase.Is it possible for the invention of a technology that will aid mining and reduce energy consumption?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444203",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "March 10, 2023, 06:15:00 AM",
      "body": "More than 100% of power used to mine bitcoin today can be reduced to just 10% or less than 10% if bitcoin go from PoW to PoS, but if bitcoin community moves towards that direction, that makes bitcoin which is not centralized before to becoming centralized. Also bitcoin is considered a commodity, moving from PoW to PoS would make bitcoin a security. So for bitcoin to move from PoW to PoS, it won't maintain its natural state of being a commodity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 10, 2023, 08:09:28 AM",
      "body": "It is definitely possible, just like any technological advancement. For example, better ASIC manufacturing processes, better energy generators, etc. When will it happen, and whether it is costly or not, should be the next question. If you take a look at the GPU market for example, the product does get better with advanced manufacturing processes (from 14nm to 7nm/5nm), but the cost to buy one is arguably increasing compared to older cards. The same will happen with ASIC or other mining devices, but probably won't be as fast.At the end of the day, when that day comes, I believe the hash rate will increase again. Eventually, we will reach another equilibrium as usual. Don't expect new miners to get profit easily with just some ASICs just because it is cheaper to run. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mocacinno",
      "created_time": "March 10, 2023, 08:12:27 AM",
      "body": "If, for example, a new type of chip would be found that's much more efficient, people would probably just buy more of them... The diff would probably just rise but the power consumption would remain the same.Only if the price would drop significantly over a longer period of time, people would start shutting down their ASIC's and the power consumption would decrease (at least, that's what i guess will happen).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 10, 2023, 08:30:57 AM",
      "body": "Quote from: joniboini on March 10, 2023, 08:09:28 AMIt is definitely possible, just like any technological advancement. For example, better ASIC manufacturing processes, better energy generators, etc. When will it happen, and whether it is costly or not, should be the next question. Better ASICs means lower cost per mined coin, increased profitability for the miners, and buying of more ASICs.It's like switching from S9 to S19, 3 times more efficient but we had the equivalent of 2 million at 1300W of the former at the end of 2017 and now 3 million of the latter at 3000W.Quote from: mocacinno on March 10, 2023, 08:12:27 AMOnly if the price would drop significantly over a longer period of time, people would start shutting down their ASIC's and the power consumption would decrease (at least, that's what i guess will happen).Yeah, that is only one way to cut energy costs without changing to some crappy algorithm, and it comes with the same problem, security, miners will consume less energy if the revenue is smaller, so a drop in price will for sure kill a lot of electricity consumption, but it will also degrade the security of the whole chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "March 10, 2023, 11:28:27 AM",
      "body": "Quote from: I_Anime on March 10, 2023, 04:51:13 AMBitcoin mining consumes power supply but the numbers of Bitcoin miners and other cryptocurrency miners continues to increase.Is it possible for the invention of a technology that will aid mining and reduce energy consumption? Bitcoin mining will develop if it is profitable. For mining, new modern nuclear power plants or other power generation stations will be built, but the price of electricity will also constantly rise.And mining will have to be concentrated in those countries where there will be opportunities to produce cheaper electricity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "I_Anime",
      "created_time": "March 10, 2023, 03:13:42 PM",
      "body": "Quote from: Charles-Tim on March 10, 2023, 06:15:00 AMMore than 100% of power used to mine bitcoin today can be reduced to just 10% or less than 10% if bitcoin go from PoW to PoS, but if bitcoin community moves towards that direction, that makes bitcoin which is not centralized before to becoming centralized. Also bitcoin is considered a commodity, moving from PoW to PoS would make bitcoin a security. So for bitcoin to move from PoW to PoS, it won't maintain its natural state of being a commodity.So this is the reason Vitalik Buterin innovation on bitcoin was not accepted?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "March 10, 2023, 07:15:47 PM",
      "body": "Quote from: I_Anime on March 10, 2023, 04:51:13 AMBitcoin mining consumes power supply but the numbers of Bitcoin miners and other cryptocurrency miners continues to increase.Is it possible for the invention of a technology that will aid mining and reduce energy consumption?  I don't know if there will be a cheaper source of electricity in the nearest future which might enhance mining activities, but presently there it is no cheap electricity,which is the major challenge to miners. The only way out is if miners don't see mining as a profitable investment anymore,they will shut down their mining farm and the few left will have more than enough electricity to use. Using cheaper mining devices will run you down financially and it is not advisable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "March 12, 2023, 08:23:43 AM",
      "body": "Quote from: I_Anime on March 10, 2023, 03:13:42 PMQuote from: Charles-Tim on March 10, 2023, 06:15:00 AMAlso bitcoin is considered a commodity, moving from PoW to PoS would make bitcoin a security. So for bitcoin to move from PoW to PoS, it won't maintain its natural state of being a commodity.So this is the reason Vitalik Buterin innovation on bitcoin was not accepted? AFAIK using PoS does not mean the coin/token is a security, but it makes it easier to centralize it and that definitely does not sound like what Bitcoin was meant to be. I'm not sure what innovation on Bitcoin you're referring to here other than switching to PoS, since Vitalik does not contribute to Bitcoin development iirc. CMIIW.Quote from: Merit.s on March 10, 2023, 07:15:47 PM I don't know if there will be a cheaper source of electricity in the nearest future which might enhance mining activities, but presently there it is no cheap electricity,which is the major challenge to miners. A better wording is probably not every miner has access to cheap electricity. Some miners do have one, and some build one if my understanding is correct based on reading on this sub, but most are constrained by location, devices to generate it, etc. That being said, as mentioned above, even if it becomes cheaper and easier to find electricity, the market will likely adapt and change the equilibrium between difficulty and profit. So basically, the condition won't change much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "March 13, 2023, 03:32:05 AM",
      "body": "Moving to Proof of Stake make bitcoin use less energy but I don't think this good Idea and community would like it. But as far as I know bitcoin machine today is already efficient if we can look at the past Antminer S1 SpecAntminer S1 Dual Blades SpecHash rate: 180 GH/SPower consumption: about 360 W from the wallPower supply: 3 +12V DC inputPower efficiency: 2 W/GH/s on wallToday Antminer S19XPModel   S19 XPAlgorithm | Cryptocurrency   SHA256 | BTC/BCH/BSVHashrate, TH/s   141 ±3%Power on wall @25°C, Watt   3031.5 ±5%Power efficiency on wall @25°C, J/TH   21.5 ±5%New ASIC new technology and a lot of things push miner manufacturers to keep more efficient what makes bitcoin hard to mine is that because the difficulty of block keeps increasing since a lot of miner popping up and introducing of big mining farm. But the machine is getting efficient .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "March 13, 2023, 04:10:25 PM",
      "body": "Quote from: dansus021 on March 13, 2023, 03:32:05 AMBut as far as I know bitcoin machine today is already efficient if we can look at the past Antminer S1 SpecHash rate: 180 GH/SPower consumption: about 360 W from the wallPower efficiency: 2 W/GH/s on wallToday Antminer S19XPModel   S19 XPHashrate, TH/s   141 ±3%Power on wall @25°C, Watt   3031.5 ±5%Power efficiency on wall @25°C, J/TH   21.5 ±5%Half a year after the S1 (let's give it time to get installed but not before the new version) was launched the hashrate was 100PH, which roughly makes 500k miners at 360W, that's 180 MW.Let's take the recent one with the current hashrate (thus ignoring the growth it will bring while it's replacing every older gear) and we have at least 2 million at 3000W, that's 6 GW.So, with all the efficiency gain instead of 180MW you have 6000MW, that's a 33x increase in power draw, but far more likely it's a 50x.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "March 13, 2023, 06:19:02 PM",
      "body": "The fact that the power consumption increases means that it's profitable to happen, which in a completely free market translates to inevitable to happen. If you lower the cost to mine bitcoin, then you increase the profitability, and set this barrier even higher. Therefore, while with an invention which lowered the cost of energy (or made better usage of an energy unit) you would expect less energy consumed, you'd have opposite results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "March 13, 2023, 07:39:17 PM",
      "body": "Quote from: I_Anime on March 10, 2023, 04:51:13 AMBitcoin mining consumes power supply but the numbers of Bitcoin miners and other cryptocurrency miners continues to increase.Is it possible for the invention of a technology that will aid mining and reduce energy consumption? The only technology that I believe that can be use to reduce electric energy in the Mining field is sun energy (solar system), where has will not be consumed and bed used to make noise in the environment. The PoW to PoS can also be boiled down to the technology which will be using to mine the coins. Because the question now is which of technology the PoS will be using? Yes from the op question I will say yes there would be a system that can reduce the electricity in the Mining field. How is it possible, I have mentioned solar system before, the another one I will mention is phone with sim card. If phone can be use to mine then it would reduce the energy consumption in the Mining field",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}