{
  "id": "topic_5446343",
  "title": "Robokon",
  "author": "Robokon",
  "created_time": "March 26, 2023, 09:06:51 AMLast edit: March 26, 2023, 05:31:01 PM by Robokon",
  "content": "Find and keep hidden Bitcoin.I would like to introduce the [Bitcoin Treasure Hunters] discord server. We are a new community and are looking to build a friendly environment for new players.The snippets of the Bitcoin address are hidden into a map or picture.The first one to find the full address - keeps the amount in Bitcoin.No tricks like in a casino - only your brain decides about success or defeat.You can prove your intelligence to other players, but don't forget, very smart people are going to participate in this competition.At the beginning, the bitcoin rewards will be relatively small, but as more people participate, the rewards will increase.Who knows, maybe we'll play in the annual game for 1 BTC at the end of the year.I would appreciate any useful suggestions to improve the server. Please refrain from posting any scam comments. The purpose of this game is to build a community for people who enjoy using their minds. I hope you understand.Thank you for your attention.Invite link: https://discord.gg/xRxU4ZvkpeServer structure:Server roles:Hunter       [Free account]Premium    [Premium membership]Big Player  [All monthly winners, Special rules]Game Rules1. Once, at the beginning of each month, a high-resolution treasure map will be published.    A bitcoin address is hidden on this map.    As you know, a bitcoin address consists of 34 digits.    This address is divided into 7 x 4 blocks + 1 x 6 block    As an example:    1JU1pSpdZoAhRNvWFRdYKQ24jTNRuqmLeG    1JU1 - pSpd - ZoAh - RNvW - FRdY - KQ24 - jTNR - uqmLeG    The correct sequence of blocks is not important.    The first person to find and report all of the blocks - is the winner.2. On the 25th of each month the winner will be announced here.    If there is no winner in a month, the BTC amount will double in the next month.    Difficulty level will remain the same. After successfully solving the puzzle,    the level of difficulty increases by one level.3. The winner will receive their BTC in the form of a paper wallet via email.    It is recommended to transfer the BTC from this paper wallet to your personal    BTC wallet.4. This game is neither a jackpot nor a casino. Everything remains transparent and no lazy    tricks are guaranteed.    The odds of being struck by lightning are higher than winning the lottery.    In this game every player gets equal chances to win.    After all, we all want to have fun.    Participation only costs 3 EUR per month, so game winnings and server costs are financed.    The initial prize for the first month is 100 EUR in BTC. So the more players, the higher the winnings.5. A special game is held at the end of the year between Christmas and New Year's Eve.    All monthly winners get the opportunity to participate in this competition.    The price is the sum of all won monthly prizes.    Use your attentiveness and intelligence to solve this picture puzzle. Any winner will be announced on Discord and in this thread. Winners' feedback is welcomed.A map for the example. Here is a bitcoin address hidden in secret writing.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446343",
  "comments": []
}