{
  "id": "topic_5411877",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "August 31, 2022, 11:57:44 AM",
  "content": "Сегодня случайно узнал прикольную штуку. Не уверен точно, правда это или нет. Якобы, если хозяин недвиги в Херсоне не зафиксировал своим присутствием в течении 1 месяца свои права на свою недвигу – то она автоматически переходит в пользование России. Ну. То есть. Например, кто-то хозяин квартиры в Херсоне. И он успел в первый день СВО свалить на запад. А потом не смог перейти через линию фронта. И лично подтвердить свои права. То тогда его квартира в Херсоне через месяц становится собственностью правительства России? Видел в инете  такую телегу. Это правда или нет?       И еще прикол уже из личного опыта. Был пару месяцев назад случайно на ярмарке зарубежной недвиги в Москве в Москва-Сити. Народу мало, жалкое зрелище. И что меня удивило – стенд какой-то там турецкой фирмы, который был на фоне части карты мира, на которой был Крым покрашен в цвета Украины. А рядом стенд, где от имени России какая-то фирма продавала недвигу в Крыму. С занесением в реестр России. И что, неужели были идиоты, которые там ее (недвигу) покупали? Как это все согласуется с международными нормами? А когда Крым перейдет обратно в состав Украины, то тогда получится, что все те, кто купили там недвигу этим летом, они пролетели, и все что они купили, будет изъято и внесено в реестр Украины?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411877",
  "comments": [
    {
      "author": "JuliaGomez",
      "created_time": "September 14, 2022, 12:51:52 AM",
      "body": "Думаю, что это скорее вброс, чем правда. Идет информационная война, писать могут что угодно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "September 14, 2022, 08:17:02 AM",
      "body": "И все-таки, интересна юридическая составляющая тема. Если например я (допустим) куплю квартиру в Крыму, а потом там сменится власть, то эту сделку признают недействительной и ничтожной? И откатят ее назад? До какого уровня? До границ 2021 года? Или 2013? Кто тогда будет выгодоприбретателем и куда жаловаться, если что?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "portyou",
      "created_time": "September 22, 2022, 08:38:03 AM",
      "body": "QuoteИ все-таки, интересна юридическая составляющая тема. Если например я (допустим) куплю квартиру в Крыму, а потом там сменится власть, то эту сделку признают недействительной и ничтожной? И откатят ее назад? До какого уровня? До границ 2021 года? Или 2013? Кто тогда будет выгодоприбретателем и куда жаловаться, если что?Думаю, тут нет смысла гадать, может вам знающие люди здесь и подскажут какие могут варианты развития событий. Но на сколько в наше время можно быть в чем то уверенным? Законы сейчас у нас, в России одни, завтра другие. Думаю и на Украине все тоже будет меняться в зависимости от конечного результата. Может все так развернуться, что и жилья там никакого не будет, от слова совсем. Поразмышлять интересно, конечно. С удовольствием почитаю аргументы знающих людей.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "September 24, 2022, 01:20:22 PM",
      "body": "Ну да. И я об чем. Наверное сейчас дико выгодно купить квартиру в Херсоне или Мариуполе. Наверное, долларов за 500 можно взять однушку или двушку (даже не в разбомбленном доме). И что дальше? Каковы дальнейшие юридические аспекты такой сделки? Или ее потом признают ничтожной?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gradovalik",
      "created_time": "September 26, 2022, 08:14:31 AM",
      "body": "Quote from: bonfire66 on September 24, 2022, 01:20:22 PMНу да. И я об чем. Наверное сейчас дико выгодно купить квартиру в Херсоне или Мариуполе. Наверное, долларов за 500 можно взять однушку или двушку (даже не в разбомбленном доме). И что дальше? Каковы дальнейшие юридические аспекты такой сделки? Или ее потом признают ничтожной?Как вариант ,покупать не на себя а на того кто там живёт где -то. Даже при смене гражданства всё там должно остаться в собственности. А на себя опасно по моему.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "September 26, 2022, 01:17:39 PM",
      "body": "Это все серые схемы.А вот более реальные. Допустим, у меня дофига свободного бабла. Где тогда мне лучше всего купить недвигу: в Херсоне и Мариуполе? И как это лучше всего оформить? Я - серьезно! Просьба реальным риелторам с обоснованием стучать в личку. Это типа есть такой вариант вложения денег. Риск? Да, риск. Но может быть я готов рискнуть? И купить? Предлагайте варианты. Но только с обоснованием легальности сделки!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gradovalik",
      "created_time": "September 29, 2022, 06:23:33 AM",
      "body": "А с другой стороны, люди же знают что скоро присоединение будет к России и зачем им тогда продавать жилье за так дешево? Разве что только в разрушенных домах что ли.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "September 30, 2022, 09:53:08 AM",
      "body": "А почем реально продают? А как долго, с вашей точки зрения протянется это \"навсегда\"? Ведь уже были прецеденты, например, с Изюмом, там тоже обещали, что Изюм с Россией навсегда. Но как-то не срослось. Почти ни одна страна мира не признает легитимность такой сделки. Даже Турция до сих пор не признает Крым российским, и на турецких картах Крым - он Украинский. Видел лично. Как-то так...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}