{
  "id": "topic_5417467",
  "title": "coyotela",
  "author": "coyotela",
  "created_time": "October 17, 2022, 09:27:11 PMLast edit: October 26, 2022, 11:19:13 PM by coyotela",
  "content": "Removed content due sensitive data",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417467",
  "comments": [
    {
      "author": "jackg",
      "created_time": "October 17, 2022, 09:32:51 PM",
      "body": "Omitting the characters you have likely still makes you identifiable (especially since block hashes are quite easy to search through if you've got the blockchain in front of you).You could try taking out the private keys and exporting them into electrum (from electrum.org) but if the address doesn't have funds on a block explorer, something else might be an issue (perhaps if you've spent the coins or the block didn't broadcast correctly).You could also install an up to date version of bitcoin core for the best privacy but it might need a lot of time to sync and a lot of bandwidth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 17, 2022, 09:38:47 PM",
      "body": "Quote from: coyotela on October 17, 2022, 09:27:11 PMMy friend and I generated bitcoin on his personal computer in March 2009 and received 50 bitcoins on his address, but, unfortunately, this computer is outdated and the blockchain take 10 years to update.I don't really understand what you mean by \"it takes 10 years to update\".Are you trying to download the blockchain in bitcoin core and it says it takes 10 years to be synced? If so, it shouldn't take that much. Quote from: coyotela on October 17, 2022, 09:27:11 PM1. Is possible the bitcoin still there but not updated on blockchain?No.Either you don't have bitcoin at all or you are looking at a wrong address.According to the data you shared, the 50 BTC have been mined in the block number 4111.Bitcoin generated on that block haven't been moved at all and are still in the address 1C7JtZUBeSPy7eZQ9vuCcaHRzYjKmnXACJ. This address doesn't match what you shared above. The transaction ID you shared above is also different from the hash of coinbase transaction of that block. Where did you take this data from?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "October 17, 2022, 09:43:53 PMLast edit: October 17, 2022, 10:28:08 PM by bitbollo",
      "body": "Quote from: coyotela on October 17, 2022, 09:27:11 PM...1. Is possible the bitcoin still there but not updated on blockchain?2. What is the best and safe way to update the blockchain and recover it from another machine?1. No. If you have received (mined) this block you have already received it... and of course are visible on blockchain.2. Blockchain is already updated. You can just check from any laptop. Try to recover your wallet using electrum or bitcoin core as already suggested by jackgAsk assistance with trusted member (I suggest @babo he has also low fees for that kind of service).Quote from: hosseinimr93 on October 17, 2022, 09:38:47 PM...According to the data you shared, the 50 BTC have been mined in the block number 4111.Bitcoin generated on that block haven't been moved at all and are still in the address 1C7JtZUBeSPy7eZQ9vuCcaHRzYjKmnXACJ....Coins from this block have been moved with such tx on Jan 2021https://www.blockchain.com/btc/tx/56e2093a3e71eb0f234f0587d33930c5260b2910d4f9c4b04d7870a697a27a90edit:394f36eb9ff916a3e913444f7fd32c0e1593134d648d2fdb2f84ab8efa441fc5coins have not been spent. here original coinbase. thank you @hosseinimr93",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 17, 2022, 10:00:22 PMLast edit: October 17, 2022, 10:28:49 PM by hosseinimr93",
      "body": "Quote from: bitbollo on October 17, 2022, 09:43:53 PMCoins from this block have been moved with such tx on Jan 2021https://www.blockchain.com/btc/tx/56e2093a3e71eb0f234f0587d33930c5260b2910d4f9c4b04d7870a697a27a90You are looking at a wrong transaction. In the transaction you shared, 17.61386661 BTC has been sent from a segwit address. According to the data shared by OP, the 50 BTC have been mined in the block number 4111. Click here to see the coinbase transaction of that block. The 50 BTC mined in that block is still unspent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coyotela",
      "created_time": "October 17, 2022, 10:04:54 PM",
      "body": "Quote from: jackg on October 17, 2022, 09:32:51 PMOmitting the characters you have likely still makes you identifiable (especially since block hashes are quite easy to search through if you've got the blockchain in front of you).You could try taking out the private keys and exporting them into electrum (from electrum.org) but if the address doesn't have funds on a block explorer, something else might be an issue (perhaps if you've spent the coins or the block didn't broadcast correctly).You could also install an up to date version of bitcoin core for the best privacy but it might need a lot of time to sync and a lot of bandwidth. Thank you for the tips, Jack!1. I do have another machine (macbook) with bitcoin core full synced. Do you think is safe to import his private key on this computer?2. There is no transaction on his wallet. I hope it was not broadcast correctly. Is still possible to recover?Quote from: hosseinimr93 on October 17, 2022, 09:38:47 PMQuote from: coyotela on October 17, 2022, 09:27:11 PMMy friend and I generated bitcoin on his personal computer in March 2009 and received 50 bitcoins on his address, but, unfortunately, this computer is outdated and the blockchain take 10 years to update.I don't really understand what you mean by \"it takes 10 years to update\".Are you trying to download the blockchain in bitcoin core and it says it takes 10 years to be synced? If so, it shouldn't take that much. Quote from: coyotela on October 17, 2022, 09:27:11 PM1. Is possible the bitcoin still there but not updated on blockchain?No.Either you don't have bitcoin at all or you are looking at a wrong address.According to the data you shared, the 50 BTC have been mined in the block number 4111.Bitcoin generated on that block haven't been moved at all and are still in the address 1C7JtZUBeSPy7eZQ9vuCcaHRzYjKmnXACJ. This address doesn't match what you shared above. The transaction ID you shared above is also different from the hash of coinbase transaction of that block. Where did you take this data from?1. Is possible to have \"broadcast\" problem because of outdated computer?2. How did you get the Block and this Wallet Address? My friend send this data from his computer (I think it is the miner's software output)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 17, 2022, 10:19:58 PM",
      "body": "Quote from: coyotela on October 17, 2022, 10:04:54 PM1. Is possible to have \"broadcast\" problem because of outdated computer?Don't worry about broadcasting your transaction. First, you should know whether you have any bitcoin or not. If you really have bitcoin and you own the private key, you will be able to spend the fund. Quote from: coyotela on October 17, 2022, 10:04:54 PM2. How did you get the Block and this Wallet Address?From \"blockheight\": 4111As I said above, the data you shared doesn't match the blockchain. Quote from: coyotela on October 17, 2022, 10:04:54 PMMy friend send this data from his computer (I think it is the miner's software output)What's the name of the software?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coyotela",
      "created_time": "October 17, 2022, 11:37:22 PM",
      "body": "Quote from: hosseinimr93 on October 17, 2022, 10:19:58 PMQuote from: coyotela on October 17, 2022, 10:04:54 PM1. Is possible to have \"broadcast\" problem because of outdated computer?Don't worry about broadcasting your transaction. First, you should know whether you have any bitcoin or not. If you really have bitcoin and you own the private key, you will be able to spend the fund. Quote from: coyotela on October 17, 2022, 10:04:54 PM2. How did you get the Block and this Wallet Address?From \"blockheight\": 4111As I said above, the data you shared doesn't match the blockchain. Quote from: coyotela on October 17, 2022, 10:04:54 PMMy friend send this data from his computer (I think it is the miner's software output)What's the name of the software?If I do have private key, what is the next step? Import it into full synced bitcoin core, right? How do you filter the block by blockheight? is there any website/script?I will figure out the software's name...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "October 18, 2022, 12:07:18 AM",
      "body": "Quote from: coyotela on October 17, 2022, 11:37:22 PMIf I do have private key, what is the next step? Import it into full synced bitcoin core, right? Exactly.Quote from: coyotela on October 17, 2022, 11:37:22 PMHow do you filter the block by blockheight? is there any website/script?You don't need to do that. Importing the private key will suffice to get access to those funds again.Just open the console window in Bitcoin-Qt (if you use that) and enter: importprivkey <your private key>.If you run Bitcoin Core on command line, it's bitcoin-cli importprivkey <your private key>.You may need to reindex the blockchain after that though, to see your updated balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coyotela",
      "created_time": "October 18, 2022, 01:03:12 AMLast edit: October 20, 2022, 01:11:54 AM by coyotela",
      "body": "Removed content due sensitive data",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "B1-66ER",
      "created_time": "October 18, 2022, 02:36:53 AM",
      "body": "What's isQuote\"vout\": 0 in my mind should be something like \"nonce\" (number used once)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 18, 2022, 04:10:12 AM",
      "body": "Quote from: B1-66ER on October 18, 2022, 02:36:53 AMWhat's isQuote\"vout\": 0in my mind should be something like \"nonce\" (number used once)Each transaction has one or more outputs (just as it has one or more inputs) and each output has an index inside the output array. The index of the first one is 0, next is 1 and so on. \"vout\" is that index here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 18, 2022, 06:37:02 AM",
      "body": "Quote from: coyotela on October 18, 2022, 01:03:12 AMNice! Is it safe?If your computer is clean and isn't infected with a malware, yes. That' safe. Quote from: coyotela on October 18, 2022, 01:03:12 AMIs possible to simple copy the wallet.dat to new full-synced computer? Yes.Quote from: coyotela on October 18, 2022, 01:03:12 AMImport private key into computer or replace the wallet.dat ?Both should work. Of course, if there's any bitcoin. Quote from: coyotela on October 18, 2022, 01:03:12 AMIt is weird because the address don't have bitcoin, but the bitcoin core is saying that was mined:https://www.blockchain.com/btc/address/19V3jeSqpTqdpGPQ3mupHaATHuNocKpMtrIf you are going to import the private key of this address, it will be useless. Blockchain doesn't lie to you. Quote from: coyotela on October 18, 2022, 01:03:12 AMI could not find any info about the Transaction ID:That simply means that there is no transaction with that ID at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 18, 2022, 07:08:40 AM",
      "body": "Quote from: coyotela on October 18, 2022, 01:03:12 AMDoesn't the gray font with the address between brackets mean it's not confirmed?That doesn't add up with this though:QuoteText is easier than screenshots, I typed this: 8202144d4cdb2340497c8a69ec805b27e49553f66da531c6c8f6a5eaa359751f, which doesn't exist.Quote from: coyotela on October 17, 2022, 09:27:11 PMMy friend and I generated bitcoin on his personal computer in March 2009 and received 50 bitcoins on his addressBitcoin was less than 2 months old back then. Any chance you bought the wallet instead?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "October 18, 2022, 07:09:59 AM",
      "body": "Take note that you might get false-negative result in Electrum because coinbase outputs at that time are P2PK by default, unless mined using other software.Means that Electrum might see zero transaction despite having a valid transaction;if you want 100% accurate result, you need to at least sync Bitcoin Core for a few minutes or until it reached beyond that block's height.However, taking all the available info in consideration, your 50BTC may just be from an orphaned block (not in the blockchain).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "October 18, 2022, 07:45:43 AM",
      "body": "care with electrum, download correct version, be aware from fake/cracker serveras @bitbollo said I can give you a handI'm not as good as Dave, but my fee is lower than Dave'sI can do the work you request cleanly, quickly and seriously",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coyotela",
      "created_time": "October 18, 2022, 01:33:44 PMLast edit: October 20, 2022, 01:12:08 AM by coyotela",
      "body": "Removed content due sensitive data",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 18, 2022, 01:45:51 PM",
      "body": "Quote from: coyotela on October 18, 2022, 01:33:44 PMIs it possible for Bitcoin to still be there? Because on the blockchain it does not show up, but on Bitcoin core's software is saying it was mined and confirmed!What's shown in block explorers is definitely correct. If you don't see any transaction, it simply means that the address has never received any bitcoin.Even if you download the blockchain and your wallet is synced, you won't be able to spend the fund which is not yours. The transaction you see in bitcoin core doesn't exist in the blockchain. You didn't answer the question asked by LoyceV above.Were you really mining bitcoin in 2009? Haven't you purchased the wallet file?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 18, 2022, 01:52:41 PM",
      "body": "Quote from: coyotela on October 18, 2022, 01:33:44 PMDo you guys think if I copy wallet.dat and database files to a new computer (full synced blockchain), will it work? Is it safe?The only way to be 100% safe, is be syncing the new computer, then taking it offline before you copy wallet.dat. You don't need to copy your old database files, only the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "October 18, 2022, 02:01:37 PM",
      "body": "Did you or your friend ever see those coins in your Bitcoin Core back in 2009 or did someone send you those screenshots? Maybe the same person who sold you the wallet? If in fact you bought it. I find it hard to believe that someone was mining Bitcoin that early on in its existence but is struggling to understand how to work the private keys and can't point out his address. But exceptions do occur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}