{
  "id": "topic_5451098",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "May 03, 2023, 01:11:22 PM",
  "content": "Alik BakhshiEmpire of Evil   Empire of Lie                “Lies are the embodiment of Evil”                                                          Victor Marie Hugo        For Russia, Ronald Reagan gave in 1983 the expression \"Evil Empire\" firmly entrenched. Reagan also called Russia \"the center of Evil in the modern world.\" I must say that today, despite the change in the political system, Russia continues to meet this definition. However, there is a very significant difference in the general appearance of Russia. During the Soviet period, Russia's actions were based on communist ideology, antagonistic to the principles of democracy and capitalism. The confrontation was open and the spirit of competition was present in literally all areas of social activity. In the end, democracy, the spirit of free creativity and entrepreneurship by the end of the 20th century proved the viciousness of the communist ideology. The systemic economic crisis led to the collapse of the Soviet empire. Life forced to rebuild the Russian economy in accordance with the requirements of modern times, which immediately affected the growth of the people's well-being. However, the idea associated with the willful introduction of democracy in Russia failed miserably due to weighty objective reasons, however, like all previous undertakings. Although the reasons are objective, they are essentially subjective, because they relate to such a subject as a people. Each nation has its own genetic background, which, in general, distinguishes one nation from another. Thus, the causes considered directly by us lie in the genetic area, which explains their stable constancy over time. As a result, two fatal factors returned Russia to its former place in the international community.         The first is the people's mentality. In my articles (1,2) I pointed out the pathological inability of the Russian people to self-organization and creative rational activity, lack of initiative in political and economic life, which is incompatible with democracy and leads to the emergence of oligarchs, more often than not of Russian nationality. Taken together, all of the above creates the conditions for the country to return to the authoritarian power familiar to the people, when everything is decided by one person, who is subsequently blamed for all the flaws and failures. That is why there was not a single leader in Russia who was not accused after he left office and, as usual, after his death.         Naturally, such attributes of democracy as a constitution, freedom and human rights, parliament, elections in Russia are superfluous and even harmful, they exist as a fig leaf covering autocracy and despotism, and not so much for the Russian people, accustomed to lies since the days of Communism and perceiving lies as a necessary daily routine, as much as for the international community.         Putin, realizing that the democracy of the Russian Empire is contraindicated (3), came up with a new definition of the social system in the country, calling it sovereign democracy, that is, democracy for the sovereign (4). If in democratic countries there is no special national idea - for all of them the common national idea is the desire for a prosperous life, then Russia needs a national idea to justify its aggressive nature (5). After all, Russia is an empire, and the Russian people, or, as they say today in Russia, the state that forms the people, is characterized by an imperial worldview with all the ensuing consequences. Having suffered a fiasco with the idea of Communism, consciously, but rather unconsciously, Russia began to frantically search for a national idea, not realizing that the lie, which is abundant in the country (6), being its hallmark, is the national idea of Russia. Fuhrer Putin loves to turn to the bonds of Russia, and so the Lie is now also the main bond of the Russian people. (7) He rallies around this bond, protecting it from the Truth, which the majority understands perfectly, but the imperial worldview and Great Russian chauvinism ( do not allow this Accept the truth.      The second is the great-power worldview and Great Russian chauvinism (, which I pointed out above, being the core of the empire, are firmly seated in the minds of the Russian people, who are ready for hardships and hardships for the sake of the empire. They are the reason for the aggressiveness of the \"Russian world\" (9) and it is in them that the power of Putin, who decided to restore the empire within the borders of the USSR, is supported. 1. People's fate or each cricket has its own hearth. http://www.proza.ru/2008/03/22/639 2. When the donkey dies. http://alikbahshi.livejournal.com/3702.html 3. Empire democracy is contraindicated. https://alikbahshi.livejournal.com/23826.html 4. Sovereign for sovereign democracy. https://alikbahshi.livejournal.com/11796.html 5. Russia is the most aggressive country. https://alikbahshi.livejournal.com/32531.html 6. The Empire of Lies, and its main liar. https://alikbahshi.livejournal.com/22317.html 7. Lies are the main bond of Russia. https://alikbahshi.livejournal.com/52550.html 8. Great Russian chauvinism, and Putin is his Fuhrer.  https://alikbahshi.livejournal.com/21133.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451098",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "May 03, 2023, 03:10:43 PM",
      "body": "The word \"Russia\" is simply a term or name of a group of people who live on a piece of land. The fact that there are leaders who promote evil at times does not make all the people to be this way.The only nation of the whole world that could possibly NOT be a nation of lies and evil, is one that has a vast majority of people who are Bible believing Christians, who DO as much as possible the good expressed in the New Testament of the Bible.Russia isn't any worse or better than any average nation. In fact, since they have the Russian Orthodox Church, they have Jesus salvation because they promote it through the Bible that they believe in.It is people who do not believe in the Bible and God and Jesus-salvation who are the evil liars. It is people who constantly defame other people or groups of people for no reason who are the evil liars. It seems that the leadership of Ukraine is trying to eradicate the Bible and religion from Ukraine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "May 03, 2023, 05:37:27 PM",
      "body": "Quote from: BADecker on May 03, 2023, 03:10:43 PMThe word \"Russia\" is simply a term or name of a group of people who live on a piece of land. The fact that there are leaders who promote evil at times does not make all the people to be this way.The only nation of the whole world that could possibly NOT be a nation of lies and evil, is one that has a vast majority of people who are Bible believing Christians, who DO as much as possible the good expressed in the New Testament of the Bible.Russia isn't any worse or better than any average nation. In fact, since they have the Russian Orthodox Church, they have Jesus salvation because they promote it through the Bible that they believe in.It is people who do not believe in the Bible and God and Jesus-salvation who are the evil liars. It is people who constantly defame other people or groups of people for no reason who are the evil liars. It seems that the leadership of Ukraine is trying to eradicate the Bible and religion from Ukraine.  Your attempt to cover up the Evil emanating from Russia with Faith and God is blasphemous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gormicsta",
      "created_time": "March 30, 2024, 07:18:07 AM",
      "body": "Quote from: BADecker on May 03, 2023, 03:10:43 PMThe word \"Russia\" is simply a term or name of a group of people who live on a piece of land. The fact that there are leaders who promote evil at times does not make all the people to be this way.The only nation of the whole world that could possibly NOT be a nation of lies and evil, is one that has a vast majority of people who are Bible believing Christians, who DO as much as possible the good expressed in the New Testament of the Bible.Russia isn't any worse or better than any average nation. In fact, since they have the Russian Orthodox Church, they have Jesus salvation because they promote it through the Bible that they believe in.It is people who do not believe in the Bible and God and Jesus-salvation who are the evil liars. It is people who constantly defame other people or groups of people for no reason who are the evil liars. It seems that the leadership of Ukraine is trying to eradicate the Bible and religion from Ukraine.I believe that one of the most essential things is to provide people's access to knowledge and education. When individuals have access to knowledge and the ability to create their own ideas, they are far less likely to be manipulated by those in authority. Furthermore, giving a place for free speech and dissent is critical; when people believe they have a voice and can speak out against injustice, they are far more empowered to combat oppression. Finally, ensuring that there is an independent justice system that can hold those in power responsible is also crucial; when people perceive that the rule of law is respected, they are more inclined to trust the system and less likely to be deceived.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 30, 2024, 09:17:55 PM",
      "body": "Quote from: Gormicsta on March 30, 2024, 07:18:07 AMQuote from: BADecker on May 03, 2023, 03:10:43 PMThe word \"Russia\" is simply a term or name of a group of people who live on a piece of land. The fact that there are leaders who promote evil at times does not make all the people to be this way.The only nation of the whole world that could possibly NOT be a nation of lies and evil, is one that has a vast majority of people who are Bible believing Christians, who DO as much as possible the good expressed in the New Testament of the Bible.Russia isn't any worse or better than any average nation. In fact, since they have the Russian Orthodox Church, they have Jesus salvation because they promote it through the Bible that they believe in.It is people who do not believe in the Bible and God and Jesus-salvation who are the evil liars. It is people who constantly defame other people or groups of people for no reason who are the evil liars. It seems that the leadership of Ukraine is trying to eradicate the Bible and religion from Ukraine.I believe that one of the most essential things is to provide people's access to knowledge and education. When individuals have access to knowledge and the ability to create their own ideas, they are far less likely to be manipulated by those in authority. Furthermore, giving a place for free speech and dissent is critical; when people believe they have a voice and can speak out against injustice, they are far more empowered to combat oppression. Finally, ensuring that there is an independent justice system that can hold those in power responsible is also crucial; when people perceive that the rule of law is respected, they are more inclined to trust the system and less likely to be deceived.Good points. You can bring the Bible and the rule of law to people, but if they do not read it and understand it, what good is it?Russian people have always understood and revered God. Even if Putin was faking it when he went to church regarding the dead in the recent terrorist thing, he did it because he knows that the people believe in God. Personally, I think Putin has become a believer over the years.But the point is the people. During the times of the USSR, the Russian people were constantly calling to Americans for help, and warning Americans to watch out for a similar kind of takeover in America. They understood the rule of law, and the foundation of humanity that it is based on. They understood that the leaders were often the criminals.So, somebody calling even the majority of the Russian people bad, is a mistaken thing. Check out who such people are who call Russians bad, and why they are writing/speaking like that. You will probably find that they are promoters of terrorism, themselves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "March 30, 2024, 10:03:13 PM",
      "body": "Quote from: BADecker on March 30, 2024, 09:17:55 PMRussian people have always understood and revered God. Did Trump really cause you to erase pre-Putin Russia from your mind? Seriously?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 30, 2024, 10:43:04 PM",
      "body": "Quote from: legiteum on March 30, 2024, 10:03:13 PMQuote from: BADecker on March 30, 2024, 09:17:55 PMRussian people have always understood and revered God. Did Trump really cause you to erase pre-Putin Russia from your mind? Seriously?It's really nice to be young. But don't worry about it. You'll grow out of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "March 31, 2024, 03:28:29 AM",
      "body": "Quote from: BADecker on March 30, 2024, 10:43:04 PMQuote from: legiteum on March 30, 2024, 10:03:13 PMQuote from: BADecker on March 30, 2024, 09:17:55 PMRussian people have always understood and revered God. Did Trump really cause you to erase pre-Putin Russia from your mind? Seriously?It's really nice to be young. But don't worry about it. You'll grow out of it.See that's the thing. I remember Russia from the 1990s and before. A \"Christian nation\" did not describe it in the least.But now it's important that it's seen as \"Christian\" so as to be compatible with the Republican voting base, so supporting Russia is compatible with the Republican voting base, so Trump's wishes are compatible with said voting base, so they will help him win the election.So we have Republicans calling Russia \"Christian\" now. What a truly bizarre turn of events...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JessieJames13",
      "created_time": "March 31, 2024, 04:13:54 AM",
      "body": "I find this post bizarre if you think Russia has such influence on the world...Especially when there is another more obvious group of people... who are not to hard to notice if you follow the big money.... they are truly evil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 31, 2024, 02:44:55 PM",
      "body": "Quote from: legiteum on March 31, 2024, 03:28:29 AMQuote from: BADecker on March 30, 2024, 10:43:04 PM~It's really nice to be young. But don't worry about it. You'll grow out of it.See that's the thing. I remember Russia from the 1990s and before. A \"Christian nation\" did not describe it in the least.But now it's important that it's seen as \"Christian\" so as to be compatible with the Republican voting base, so supporting Russia is compatible with the Republican voting base, so Trump's wishes are compatible with said voting base, so they will help him win the election.So we have Republicans calling Russia \"Christian\" now. What a truly bizarre turn of events...You have never heard of the Russian Orthodox Church? It's almost the same as the Roman Catholic Church, but with different leaders than the RCC Papacy. It has been there for ages. Look it up. Even if it is a State church, it attempts to follow the Bible and Christianity. If it IS a State church, that means that Russia is officially a Christian nation.Additionally, which nation is more Christian? The US or Russia? WOKE is anti-Christian, at least anti-Bible-Christian. The US is full of WOKE. But Russia hasn't gotten past the Vodka stage, yet. So, it's debatable which country is more Christian.Putin went to mass regarding the so-called ISIS terrorist thing. Why? Perhaps he is a Christian. But if he went for show and really isn't a Christian, there must be enough Christians in Russia that he had to do it to gain their respect.Further, in Zechariah 6:8 in the Bible, God speaking to Zechariah:Quote from: https://biblehub.com/zechariah/6-8.htmThen he called to me, “Look, those going toward the north country have given my Spirit rest in the land of the north.”While this might not be talking about Russia, Russia is certainly a land of the North.More: the US has destroyed Ukraine way more than Russia. If Ukraine had surrender by the second month of the war, there would have been some several hundred fewer deaths there. Does this mean that the US is more Christian by pushing the war... which they actually pushed on Russia starting at least 2014?Have you ever heard of Ivan Kupala Day? Throughout the Slavic countries - including Russia - this name is representative of John the Baptist. Certainly the holiday has been merged with paganism in some ways. But it shows that Christianity is there in the whole region.The point is, Russia has always been Christian, and under Putin they are returning to whatever Christianity they had lost under Stalin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "March 31, 2024, 04:41:56 PM",
      "body": "Quote from: BADecker on March 31, 2024, 02:44:55 PMYou have never heard of the Russian Orthodox Church? Have you ever heard of the Union of Soviet Socialist Republics? The one Vladimir Putin has vowed to reconstruct after what he called the greatest catastrophe in history in its dissolution?I am still convinced you'd have no opinion about Russia if Trump didn't care about it one way or another, and you'd be against Russia if Trump was. The reason I believe this is that all of the hard-core Trump supporters I talk to reverse themselves when they learn Trump has reversed himself. Trump has recently reversed himself on abortion (saying we should have moderate laws now) because he wants to win the election this November. But him reversing himself will be a one-way street for those wanting stricter laws on abortion because he's going to get millions to parrot his moderate views on abortion (which are pretty much pro-choice, at least rhetorically).So now Trump's followers have gone from \"it's murder and women who have abortions are murders\" to, \"we should have moderate abortion laws like Europe does\", calling the Florida law, \"horrible\" for instance.This leaves me wonder what y'all actually believe since the only constant is following Trump and whatever he happens to believe that day. Put it another way, what would Trump have to actually do in order for you to withdraw your support for him? If the answer (which you don't have to write down here if you don't want) is, \"nothing\", then your beliefs are that of a person and not any consistent ideas. I don't think there's anything wrong with that per se--lots of people don't have time in their busy lives to formulate complex ideas about politics and policy--but it's worth at least, for purposes of self-awareness--knowing yourself well enough to understand what really motivates you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 31, 2024, 06:39:59 PMLast edit: March 31, 2024, 06:56:19 PM by BADecker",
      "body": "Quote from: legiteum on March 31, 2024, 04:41:56 PMQuote from: BADecker on March 31, 2024, 02:44:55 PMYou have never heard of the Russian Orthodox Church? Have you ever heard of the Union of Soviet Socialist Republics? The one Vladimir Putin has vowed to reconstruct after what he called the greatest catastrophe in history in its dissolution?I am still convinced you'd have no opinion about Russia if Trump didn't care about it one way or another, and you'd be against Russia if Trump was. The reason I believe this is that all of the hard-core Trump supporters I talk to reverse themselves when they learn Trump has reversed himself. Trump has recently reversed himself on abortion (saying we should have moderate laws now) because he wants to win the election this November. But him reversing himself will be a one-way street for those wanting stricter laws on abortion because he's going to get millions to parrot his moderate views on abortion (which are pretty much pro-choice, at least rhetorically).So now Trump's followers have gone from \"it's murder and women who have abortions are murders\" to, \"we should have moderate abortion laws like Europe does\", calling the Florida law, \"horrible\" for instance.This leaves me wonder what y'all actually believe since the only constant is following Trump and whatever he happens to believe that day. Put it another way, what would Trump have to actually do in order for you to withdraw your support for him? If the answer (which you don't have to write down here if you don't want) is, \"nothing\", then your beliefs are that of a person and not any consistent ideas. I don't think there's anything wrong with that per se--lots of people don't have time in their busy lives to formulate complex ideas about politics and policy--but it's worth at least, for purposes of self-awareness--knowing yourself well enough to understand what really motivates you.Wow! You sound scared.Trump was peace. All you need to do is look at history to see this. But you are scared of him.Biden and his team have caused the deaths of at least 600,000. And in doing it, they have cause such great inflation in America that many Americans are finding it difficult just to live. And Biden and his team have brought hundreds of thousands of illegals into the US, without checking to see that there aren't any anti-American terrorists among them.Why aren't you scared of Biden? He has done many of the things that you are scared of Trump doing... and way worse than that in some areas.When Jesus returns, it will be in the form of a kingship. That's like a dictatorship. So, you should be afraid of a Christian USSR, because it would absolutely wipe out the unChristian activities of the USA and Nato, and especially the Western banking system.But that is what the Biden team are pushing into being... a war with Russia. They are trying to take over the world, even if they don't call it a USSR. But they are not Christian, as you can see from all the murder they are causing in Ukraine and the Middle East.Of course, we are getting the picture. You are showing yourself to be a warmonger who is against peace.An Easter Message For All, and How to Respond to the White House Dissing Godhttps://danielbobinski.substack.com/p/an-easter-message-for-all-and-howChrist, by the way, is not Jesus's last name. The word Christ comes from the Greek word Christos, which is a translation of the Hebrew word, Messiah. And the words Christ and Messiah both mean \"The Anointed One,\" referring to the prophesied King and Savior.Bible scholars tell us that God instituted a new dispensation about 2000 years ago, which came through the man Jesus, who, as the Bible points out, was also God in the flesh. Jesus himself fulfilled the Mosaic Law. He didn't abolish it; He fulfilled it by keeping the whole law. It was because He was God in the flesh that He was able to keep the law. We, as sinful man, could not. And cannot.Additionally, being perfect, Jesus also represented the spotless lamb required for a sin offering. He also represented the spotless lamb required for the Passover. And yet those who were self-righteous – the Priests and teachers of the day – who, as humans were insecure, rather than be curious and look into what Jesus was saying, they stuck with their own interpretations of the Mosaic Law: they had Jesus crucified.If you've read the Old Testament, you'll probably know a spotless lamb was required for the Passover. You'll also probably know a spotless lamb was required for a sin offering.  In the sin offering, the death of the lamb covered one's sins. And with the blood of the lamb at Passover, you'll recall the descendants of Abraham, Isaac, and Jacob had become slaves in Egypt, and God was bringing a plague of death across that  land....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "March 31, 2024, 09:59:11 PM",
      "body": "Quote from: BADecker on March 31, 2024, 06:39:59 PMTrump was peace. All you need to do is look at history to see this. But you are scared of him.I'll ask again: what possible thing could Trump do that you would no longer support him? Do you have an answer for that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 31, 2024, 11:19:34 PM",
      "body": "Quote from: legiteum on March 31, 2024, 09:59:11 PMQuote from: BADecker on March 31, 2024, 06:39:59 PMTrump was peace. All you need to do is look at history to see this. But you are scared of him.I'll ask again: what possible thing could Trump do that you would no longer support him? Do you have an answer for that?You sound like you think that I support Trump. Why do you think this, if you do? After all, You talk about him just about as much as I do, although your talk seems to be negative about him. And in case you haven't noticed, it seems the more the negative talk about Trump, the more popular he gets.So, answer your own question about yourself. What possible thing could Trump do that you would no longer support him?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "April 01, 2024, 01:59:31 AM",
      "body": "Quote from: BADecker on March 31, 2024, 11:19:34 PMYou sound like you think that I support Trump. Why do you think this, if you do? Everything I've ever read from your account indicates to me that you support Trump. You support everything Trump supports, and you repeat all kinds of negative things the Republican party comes up with about Biden and the Democrats.In the posting above, you implied that Trump (along with Putin) are the actual second coming of Christ, which, to me at least, sounds like you are very positive on Trump.If you want to put this rumor to bed, however, you can tell us the reasons why you won't be voting for Trump, and why you hope he loses the election in November.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "April 01, 2024, 12:37:24 PM",
      "body": "Quote from: legiteum on April 01, 2024, 01:59:31 AMQuote from: BADecker on March 31, 2024, 11:19:34 PMYou sound like you think that I support Trump. Why do you think this, if you do? Everything I've ever read from your account indicates to me that you support Trump. You support everything Trump supports, and you repeat all kinds of negative things the Republican party comes up with about Biden and the Democrats.In the posting above, you implied that Trump (along with Putin) are the actual second coming of Christ, which, to me at least, sounds like you are very positive on Trump.If you want to put this rumor to bed, however, you can tell us the reasons why you won't be voting for Trump, and why you hope he loses the election in November.Are these some of the reasons why you won't be voting for Trump? Or will you be voting for him? Trump accomplishments - https://bitcointalk.org/index.php?topic=5269905.msg55119252#msg55119252.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "April 01, 2024, 12:55:08 PM",
      "body": "Quote from: BADecker on April 01, 2024, 12:37:24 PMTrump accomplishments - https://bitcointalk.org/index.php?topic=5269905.msg55119252#msg55119252.So three posts later, you admit you are an ardent Trump support again. Glad we had that conversation.So you still haven't answered the question: what possible thing could Trump do that you would no longer support him? Is there anything you can think of?If the answer is no (and again, you don't have to tell us if you don't want to), then you aren't actually into \"politics\" or \"policy\" but rather you are faithful to a singular personality.And if that's the case, you should spend more of your time thinking and writing about Trump himself since that's the center of your belief system.Also, by the way, I've been meaning to ask this: why are only Trump and Putin only the second coming of Christ? Why not Xi, Robert Mugabe, or any of the rest of the world's dictators? Is it just Trump and Putin for you? If so, then why?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "April 01, 2024, 01:03:25 PM",
      "body": "Quote from: legiteum on April 01, 2024, 12:55:08 PMQuote from: BADecker on April 01, 2024, 12:37:24 PMTrump accomplishments - https://bitcointalk.org/index.php?topic=5269905.msg55119252#msg55119252.So three posts later, you admit you are an ardent Trump support again. Glad we had that conversation.So you still haven't answered the question: what possible thing could Trump do that you would no longer support him? Is there anything you can think of?If the answer is no (and again, you don't have to tell us if you don't want to), then you aren't actually into \"politics\" or \"policy\" but rather you are faithful to a singular personality.And if that's the case, you should spend more of your time thinking and writing about Trump himself since that's the center of your belief system.Also, by the way, I've been meaning to ask this: why are only Trump and Putin only the second coming of Christ? Why not Xi, Robert Mugabe, or any of the rest of the world's dictators? Is it just Trump and Putin for you? If so, then why?Since I have shown you how you are the one supporting Trump by badmouthing him, and since I have simply shown some of the good things that Trump has done...I know it is difficult for you to be righteous in what you are saying. So, all that might be left for you is borderline insane talk. And that seems to be where you are taking yourself. Or have you really gone over the edge already?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "April 01, 2024, 01:21:42 PM",
      "body": "Quote from: BADecker on April 01, 2024, 01:03:25 PMI know it is difficult for you to be righteous in what you are saying [...]Aren't you proud of your support for Trump? You seem to be intent on evading questions about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "April 01, 2024, 02:50:18 PM",
      "body": "Quote from: BADecker on March 31, 2024, 02:44:55 PMMore: the US has destroyed Ukraine way more than Russia. If Ukraine had surrender by the second month of the war, there would have been some several hundred fewer deaths there. Does this mean that the US is more Christian by pushing the war... which they actually pushed on Russia starting at least 2014?You use so many subverted analogies in the name of God... Few of the most important values The Bible shares are honor, loyalty and fidelity. It teaches us to not give up on principles, which are divine, even during the hardest moments faced in life. We can see this through the struggle many characters of the stories had to overcome in order to fulfill their missions. And when they gave up, God severily punished them, like when the prophet Jonah refused to preach to the people of Nineveh that the Assyrian capital would be destroyed, if they remained in sin. He ran away from his duty, escaping through the seas, when a storm reached the ship and the crew dropped him in the sea, where a giant fish swallowed him.Jesus could have given up on different moments during his earthly lifetime, but he didn't! Many others could have resigned to the opression imposed to them by much larger and more powerful empires (Exodus from Egypt, Gideon and the Small Army, David versus Goliath...), but they didn't, because they were loyal to those divine principles, and consequently loyal to God.Christians don't want war, but they have to defend themselves if war is declared to them. It's Ukraine's right to defend their territory, their home, as you would do if someone attempted to invade your house.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}