{
  "id": "topic_5419334",
  "title": "Flyingjack123",
  "author": "Flyingjack123",
  "created_time": "November 03, 2022, 06:25:18 PM",
  "content": "I came to know about bitcoin somewhere in December 2021. When it was hovering around 50,000 USD.  I read about its story from how Satoshi started the project to bitcoin pizza and more.  I felt inspired. I decided to learn more about it and joined the forum with the same intention.Over period of time i learnt things from crypto-wallets to crypto-exchanges. I learnt how bitcoin gained value and what are its benifits.I also learnt about the flood of altcoins in the market, and how they are rising and falling overnight. Giving people chance to gamble and make fortune.However to me bitcoin always felt special, because while projects fizzle out now and than, bitcoin has steadily been the corner stone of cryptoworld.Also maybe i joined this forum, may be this naturally enhanced my trust in bitcoin.I am not an avid investor. I invest small amounts now and than in bitcoin, and intend to not to touch my investment atleast this decade. I hope by then it will grow to a respectable sum.While lot of people off late were saying that bitcoin is finally doomed to fall. Recently my trust in bitcoin has substantially increased because of the  way it held its value against market forces . While all the currencies including euro and yen, showed a steep drop against dollar. The share marked saw a fall. Bitcoin held its ground.Against all the naysayers against all the government bans and restrictions, bitcoin managed to hold. I believe it has proven its mettle.I believe soon bitcoin will rise and shoot to the stars..Waiting for that to happen.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419334",
  "comments": [
    {
      "author": "uchegod-21",
      "created_time": "November 03, 2022, 07:49:55 PM",
      "body": "Bitcoin has always been around whenever the market condition is not fine. Bitcoin has witnessed the birth and death of many altcoins and shitcoins yet he has remained unshakable. It is a good idea that you want to invest in Bitcoin, I commend your courage, bur leaving your investment for a decade is a way too far . 10 years is not today and nobody knows what actually will happen in the next two years let alone in the next 10 years. How rich are you that you will not be needing your investment until 10yrs time?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "November 03, 2022, 08:28:51 PM",
      "body": "I guess that's part of the natural evolution, I mean when people says that a certain invention is going to fall and it will be doom, guess what, it will go the other way around. Just like in the beginning, yes many people invested on bitcoin but sell early because they think it's going to die. And majority of them are not regretting their decision to sell early because bitcoin really took off in the last 10 years or so. Not to late to invest right now, the price is very cheap so take advantage of this situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "November 04, 2022, 10:19:36 AM",
      "body": "Quote from: Flyingjack123 on November 03, 2022, 06:25:18 PMI came to know about bitcoin somewhere in December 2021. When it was hovering around 50,000 USD.  I read about its story from how Satoshi started the project to bitcoin pizza and more.  I felt inspired. I decided to learn more about it and joined the forum with the same intention.Over period of time i learnt things from crypto-wallets to crypto-exchanges. I learnt how bitcoin gained value and what are its benifits.I also learnt about the flood of altcoins in the market, and how they are rising and falling overnight. Giving people chance to gamble and make fortune.However to me bitcoin always felt special, because while projects fizzle out now and than, bitcoin has steadily been the corner stone of cryptoworld.Also maybe i joined this forum, may be this naturally enhanced my trust in bitcoin.I am not an avid investor. I invest small amounts now and than in bitcoin, and intend to not to touch my investment atleast this decade. I hope by then it will grow to a respectable sum.While lot of people off late were saying that bitcoin is finally doomed to fall. Recently my trust in bitcoin has substantially increased because of the  way it held its value against market forces . While all the currencies including euro and yen, showed a steep drop against dollar. The share marked saw a fall. Bitcoin held its ground.Against all the naysayers against all the government bans and restrictions, bitcoin managed to hold. I believe it has proven its mettle.I believe soon bitcoin will rise and shoot to the stars..Waiting for that to happen.You should only Trust or Believe in the Perfect HAND that controls/guides Bitcoin rather than trusting Bitcoin itself. Without the Perfect HAND, it would be corrupted by people and destroyed.It's actually a well developed and very useful technology. Anyone who understands its true value would invest his/her time, efforts (not necessarily money)etc in seeing that it continues to develop to the right direction for the benefit of humanity/society. Your good contributions will ensure a sustained price increase. So, better to focus more on its development... its price will continue to increase as long as it continues to be valuable/useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "November 04, 2022, 10:57:31 AM",
      "body": "Quote from: btc_angela on November 03, 2022, 08:28:51 PMI guess that's part of the natural evolution, I mean when people says that a certain invention is going to fall and it will be doom, guess what, it will go the other way around. Just like in the beginning, yes many people invested on bitcoin but sell early because they think it's going to die. And majority of them are not regretting their decision to sell early because bitcoin really took off in the last 10 years or so. Not to late to invest right now, the price is very cheap so take advantage of this situation.That is the standard response people have to anything that is new and they do not understand, and while they had been right about some of those new inventions and those inventions did disappear, they have also been wrong about technologies that changed the world.A few examples of this are cars, electricity, television, the Internet, computers, smartphones, video games and of course bitcoin, technologies which the average person did not understood and claimed they will disappear, only for those technologies to eventually form an integral part of our modern world, as such as long as we see potential in a technology we have to follow our own instincts and avoid doing what the majority of the people do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "November 04, 2022, 11:10:14 AM",
      "body": "OP from your point of view I can see that you cherish Bitcoin and you are also a good investor for you to invest on Bitcoin for a decade. You will reap from the fruit of your labour because its a long term investment but I hope you don't get discouraged later to sell your Bitcoin Holdings.A time will becoming when Bitcoin price will shoot high and so many investors will keep their Holdings. No amount is too small or big in Bitcoin investment, the important thing is that you have invested and have some MBTC. People that says Bitcoin will die are those that don't understand Bitcoin concept. In all cryptocurrency, Bitcoin has survived and spread rapidly  amongst other no matter the economy challenges the world is facing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "November 04, 2022, 11:30:19 AM",
      "body": "If to consider Bitcoin only as an investment asset you can believe it will grow or not to believe in that. But Bitcoin is much more than just an investment asset, it is an idea of returning of control on own money, it is an idea of automated decentralized decisions working for financial markets (instead of old bank system) and then for many more social or governmental systems. And if we look at Bitcoin with a larger angle we can see it already gave us lots of opportunities and will work for better future non depending on the BTC/USD rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 04, 2022, 12:26:05 PM",
      "body": "Quote from: Flyingjack123 on November 03, 2022, 06:25:18 PMWhile lot of people off late were saying that bitcoin is finally doomed to fall. Recently my trust in bitcoin has substantially increased because of the  way it held its value against market forces . While all the currencies including euro and yen, showed a steep drop against dollar. The share marked saw a fall. Bitcoin held its ground.Against all the naysayers against all the government bans and restrictions, bitcoin managed to hold. You're probably going to need to convince yourself more if what convinced you is bitcoin's recent performance. If you've been into bitcoin long enough, you'd know that things can easily go south even if doesn't make sense to do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 04, 2022, 12:49:46 PM",
      "body": "Don't only believe bin bitcoin, work out your bitcoin in it, make it seen and practice what you've learnt so far with the digital decentralized currency, bitcoin comes with divers opportunities in it if you consider ever it was launched, the years so far and the record should be your own personalities to result on whenever you're loosing hope that the further expectations could come just as always wanted to have them with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "glendall",
      "created_time": "November 04, 2022, 12:52:03 PM",
      "body": "Quote from: Flyingjack123 on November 03, 2022, 06:25:18 PMWhile lot of people off late were saying that bitcoin is finally doomed to fall. when people say bitcoin will fall, that's where people / whales are competing to add cargo so they can go to the moon in peace in their time,one thing is natural if they blaspheme bitcoin when it is falling, but with our faith and the strength of our hands,  one day bitcoin will return to its highest point, just need patience",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "November 04, 2022, 01:13:50 PM",
      "body": "Well, we all have reasons why we are here and why we believe in Bitcoin. But there is one thing in common and that is because we see Bitcoin as a profitable investment more than any cryptocurrencies in the market. Honestly, interest has been built up upon seeing on the news, social media ads, and of course, coming from the forum. I know doubts are what we feel at the start but it has changed as time passes by. I would say good to you who see it as an opportunity but I have to say that never consider this as a forever asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "November 04, 2022, 11:44:39 PM",
      "body": "Your not wrong to have a firm hope in bitcoin. Still u wouldn't compare bitcoin with Yen, Euro and other stocks out there. Bitcoin is unique and even in the crypto world being the pioneer cryptocurrency from which all alts sterns from. The value of bitcoin cannot be over emphasised and the fact that it continues to defy all odds the government and the critics have set against it projects it for how long its willing to stay.Regulations remains one of the chief issues with the government else tbu don't deny it for being a currency with some good standards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ultegra134",
      "created_time": "November 04, 2022, 11:59:07 PM",
      "body": "I first learned about Bitcoin in 2013-14. I was a clueless teenager back then, with no access to exchanges or a way to acquire Bitcoin. Admittedly, I was on the scene relatively early, seeing that it was worth as little as $200. Honestly, I've seen Bitcoin plummet and recover numerous times, and especially after the large market crash in late 2017, I'm more confident than ever. As long as you're patient enough, you'll have a good chance of making a successful investment. Also, don't compare Bitcoin with fiat currencies, it's no use. While they're both currencies, they share very little similarities. It'd be more sensible to compare it with gold rather than EUR or USD.Welcome to the Bitcoin world. I wish you the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "November 05, 2022, 01:37:33 AM",
      "body": "Quote from: Frankolala on November 04, 2022, 11:10:14 AMOP from your point of view I can see that you cherish Bitcoin and you are also a good investor for you to invest on Bitcoin for a decade. You will reap from the fruit of your labour because its a long term investment but I hope you don't get discouraged later to sell your Bitcoin Holdings.(....)That's why people like OP is the one must be a model to other people too especially for that user who are just starting to explore or to introduced to Bitcoin.Common problem right now with people that starting to introduced with Bitcoin are they are just here because of investment, they even don't know how Bitcoin works, because on their mind is only money and greed. We cannot blame them, but I'm just saying that it is not a good practice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stomachgrowls",
      "created_time": "November 05, 2022, 01:52:18 AM",
      "body": "Quote from: GreatArkansas on November 05, 2022, 01:37:33 AMQuote from: Frankolala on November 04, 2022, 11:10:14 AMOP from your point of view I can see that you cherish Bitcoin and you are also a good investor for you to invest on Bitcoin for a decade. You will reap from the fruit of your labour because its a long term investment but I hope you don't get discouraged later to sell your Bitcoin Holdings.(....)That's why people like OP is the one must be a model to other people too especially for that user who are just starting to explore or to introduced to Bitcoin.Common problem right now with people that starting to introduced with Bitcoin are they are just here because of investment, they even don't know how Bitcoin works, because on their mind is only money and greed. We cannot blame them, but I'm just saying that it is not a good practice.But sooner or later they would really be able to realize on whats the overall utility and benefits on Bitcoin does have.Its impossible for you to ignore such thing specially you've been dealing with it actively.You would really be that be aware on how it do works or its utility which its impossible for you to ignore out.It would really be just common sense that you would need to study on all about on thingsthat you've been dealing with.As a newbie,as you do gain up experience then you would eventually able to realize lots of things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "laurenB7742",
      "created_time": "November 05, 2022, 02:52:38 AM",
      "body": "Quote from: uchegod-21 on November 03, 2022, 07:49:55 PM 10 years is not today and nobody knows what actually will happen in the next two years let alone in the next 10 years. How rich are you that you will not be needing your investment until 10yrs time?Newbies often claim so, after learning about bitcoin but I doubt he will be able to hold btc when bitcoin hits $100k in 2025 without selling it. It's easy to say but to do it I don't think many people will do it or it will happen if they forget it, as investors, we will not be able to control our emotions if it falls too much as well as when the price rises significantly. If he buys from this price and holds until btc hits $100, there will be x5 profit, which is huge profit. If I was in that situation, I would sell my bitcoin and wait for the market to drop, I would buy it back and that's what investors are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "November 05, 2022, 03:43:05 AM",
      "body": "Quote from: Flyingjack123 on November 03, 2022, 06:25:18 PMI am not an avid investor. I invest small amounts now and than in bitcoin, and intend to not to touch my investment atleast this decade. I hope by then it will grow to a respectable sum.If you follow this strictly and do not touch your assets until decade ends then mate you just got yourself nice house alongside a beach with lambo parked up front. Though that's too much of saying but hey it's bitcoin and we are here because we know it's potential since the beginning. With the current situations around the globe it even pushes us towards more decentralized assets to stay away from restricted economy during the recession. A decade is lot of time, but you pass the period you gonna get sweet fruits for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 05, 2022, 04:06:51 AM",
      "body": "Quote from: Flyingjack123 on November 03, 2022, 06:25:18 PMWhile lot of people off late were saying that bitcoin is finally doomed to fall. Recently my trust in bitcoin has substantially increased because of the  way it held its value against market forces .Literary every time there is any kind of drop, a lot of cockroaches crawl out of their holes to say \"bitcoin is doomed\". Interestingly enough there is more of them when we are at the bottom and during accumulation phases.In any case you should \"trust\" bitcoin because of its technology and utilities not because of its price. In fact the only reason why price holds and in the long run keeps going on is because bitcoin offers a very unique utility that nothing else in the world does. A decentralized payment system that can not be censored.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "November 05, 2022, 12:40:59 PM",
      "body": "Quote from: glendall on November 04, 2022, 12:52:03 PMwhen people say bitcoin will fall, that's where people / whales are competing to add cargo so they can go to the moon in peace in their time,one thing is natural if they blaspheme bitcoin when it is falling, but with our faith and the strength of our hands,  one day bitcoin will return to its highest point, just need patienceIf we talk about the nearest future then definitely BTC to USD rates will go up and down multiple times. But if we look forward to the distant future I'd say that we'll see different new financial systems some of which will be better then Bitcoin and replace is one day as nowadays Bitcoin gives an alternative to an old bank system. So someday in the distant future Bitcoin will fall but it is not a problem, it is a blessed promise of non stopping Scientific Revolution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "November 06, 2022, 12:31:14 PM",
      "body": "On the way of bitcoin to its peaks and overcoming the next ATH, there will be an incredible amount of fud during the fall and subsequent exclamations of buy, buy when the next rise is reached, so this is a two-way road and the number of supporters and opponents of bitcoin grows and falls synchronously with its course and here faith really acquires value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}