{
  "id": "topic_5466055",
  "title": "sokani",
  "author": "sokani",
  "created_time": "September 07, 2023, 09:40:13 PM",
  "content": "Translated Topic in Pidgin Language: Help Bitcoin help Ukraine!Original Topic: Help Bitcoin help Ukraine!Author: GazetaBitcoinNa exactly one year wey Putin invade Ukraine - on February 24, 2022. Na sad anniversary for de Ukrainian people and humanity. One article from Bitcoin Magazine, wey 1miau recommend to me, come recently catch my attention. Bitcoin Magazine na one great resource place wey dey write beta informative articles about Bitcoin and also dey torchlight many philosophic and libertarian essays.De article dey long, maybe na one of de longest article wey I don ever read, e get about 14.000 words. E take me time to read am finish but as I read am reach de end, e come ginger me to support de Ukraine cause. De article yan about de chaotic past of the Ukrainian people, de struggle of de past wey still dey continue today, de things wey dey cause dis struggles dey different, but de pain na de same.We don also get information about Bitcoin adoption for Ukraine and e tell us about de tori of war heroes or tori of Ukrainian bitcoiners. One tori for dis article dey really touching. E yan about Naumenko, na confirm bitcoiner and a hero:QuoteIn 2018, Naumenko get de opportunity to work wit Bitcoin giants like Greg Maxwell and Pieter Wuille as intern for Blockstream, eventually him follow co-author a paper wit Maxwell and Wuille wey dem propose Bitcoin improvement, Erlay, wey go make de network more efficient and resilient. For 2021 and early 2022, Naumenko work on Bitcoin protocol come reach new milestone. Just some days before de invasion, Naumenko release “CoinPool,” a new implementation of bitcoin wey go allow may users to share the same \"UTXO\" or spendable piece of bitcoin. Na complement to de Lightning Network, and something wey go help Bitcoin scale well well and increase privacy. CoinPool na de result of many years of work wit fellow developer Antoine Riard. De release go be better achievement under any circumstance, na surprising scientific breakthrough from a country wey wan go war.On February 24, Naumenko wake up from sleep as him phone ring. Him friends bin don bombard am with messages: De invasion dey real, for him mind him no think say e go happen. Just 12 hours earlier, him bin cruise him electric scooter go coffee shop go read book. De weather bin no dey bright, no person for street, him bin come dey feel some how. Na wen dem wake am up by 5:00 am e clear for him eyes say war don come. Him carry him backpack quickly rush go metro shop, where him come hide for one Soviet-era bomb shelter, wey dem build to withstand nuclear attacks. Him spend three days and two nights for de bunker. At first, wen him go de subway station, one old woman wey dey de turnstile tell am make him wear mask. Him look at her come confuse. COVID-19 don finish, war wan start. Many people and families wit children dey come, dey carry pillows and food, dey prepare to live there. Initially, de shock of war bin drive people go underground, but after some days, out of necessity, people come dey return to their normal lives. Wen Naumenko finally leave de shelter, him bin meet with friends come decide to leave de city in a pink BMW. De car dey too bright but na de only one wey dey available. Dem come dey fear say de car fit bring too much attention but dem decide to use am like dat go west. Russian army bin dey some residential areas outside of Kyiv, dey kill civilians, and dem dey hear de gunshots. Time dey really important.Naumenko friends japa enter Romania but him tell dem to drop am for one Ukrainian town before dem cross de border. Him bin wan stay and help.Putin troops bring plenty suffering to Ukraine, where Russian troops bomb and destroy de houses of many Ukrainian civilians. Some Ukrainian cities dem bring am come ground and Mariupol, one city wey bin get population of 500.000 don finish kpa-kpa. Satellites images even show how Russians dig mass graves, to bury Mariupol citizens, wey go be war crime. Putin bring war for everybodi wey dey Ukraine even dose wey dey de western part of Ukraine need to look for shelter wen Russians begin to launch new missile strikes. E dey horrible, because anytime u fit get air raid warning, dey hope say rocket no go hit your house.Putin also bring suffering for him own country, wen him carry more troops to war front to conquer Ukraine, him bin announced de mobilization of 300.000 young men come send dem unprepared to de front for him own cruel war. Na wetin military strategies dey call \"cannon fodder\".Many Russians bin dey try to leave de country but Russian guards bin stop dem for border. Dem don hold dem, force dem go de war front.Na big shame wetin Putin dey do for deir, him don start de biggest land war since WW2, wen Hitler bin launch attack against Poland, and later many oda countries. E dey completely justifiable to call Putin \"Putler\" because him dey stand for de tradition of Hitler actions for WW2. People dey suffer because maniac Putin wan create Soviet Union 2.0 and wan re-establish him communist shit hole.How bitcoin go fit take help get rid of Putin dictatorship?As Alex Gladstein take describe am for him article Currency of last resort how Bitcoin dey take help people wey dey suffer from Putin's bloody war, e for make sense to see how Bitcoin go fit help us pursue Putin comot from office or atleast weaken am make him surrender.Sure, e no dey easy and Bitcoin alone no fit stop Putin from invading Ukraine but Bitcoin fit be part of the solution wey fit send Putin regime to Gulag 😊How Bitcoin fit contribute:Russians go disapprove Putin war by using Bitcoin. As all of us know, Putin dey fear to lose power. Him be dictator and dem no go fit remove am democratically, so people need to make democratic decisions. Bitcoin na democratic tool and him no fit ban am if the people choose to use am instead of him Ruble.We, as allies of Ukraine, go help undermine Russian Ruble, de national currency of Russia. E go weaken de Russian Ruble, and a fragile Ruble go weak Putin ability to buy or manufacture more weapons = less people go die for Ukraine from Russian missiles and Ukraine go fit push de Russian troops back comot from Ukraine.If Putin still dey rule in an authoritarian way, make Russians refuse to dey pay taxes as to dey pay taxes for de country wey free and fair election never take place for dey optional. By doing so, people fit force a democratic election and vote Putin out of power. Eastern Germany collapse in de same way.Bitcoin fit help us send aid to Ukraine as initiative from icopress or JohnnyUA don show us.Sometime ago I bin write dis topic Bitcoin can help a bit to reduce spreading of coronavirus, e get small help wey Bitcoin fit bring as e no dey like physical cash, wey fit carry de virus.E get another aid wey Bitcoin fit bring: help people from Ukraine wey no fit receive fiat donations, bitcoin dey unstoppable. G7 don sanction Russian but e no dey enough to shake de currency too much, bitcoin fit help for here as well. E no dey too much but na something! And, as we dey use bitcoin more, we all dey make am more powerful and de power dey come back to help us. E no dey much but at least, we fit do something to help Ukraine thru bitcoin.So help Bitcoin help Ukraine!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466055",
  "comments": [
    {
      "author": "GazetaBitcoin",
      "created_time": "September 08, 2023, 07:51:46 AM",
      "body": "This na de only political article wey I don ever write. Like dis, I write am to try do something to help de oppressed people - de Ukrainian people. I dey completely against war, against oppression, against violence of any kind, and I don try wit dis article to somehow help de Ukrainian people. One great help na 1maiu wey suggest dis to me and I dey happy say I write am for dis very day February 24th, wey de war reach one year.Thank you for translating dis my topic. All of us, as we dey use Bitcoin, we dey give more power to Bitcoin and so Bitcoin fit help de Ukrainian people even more. sokani, you don do a great job by translating dis topic and I no get enough words to thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "September 08, 2023, 07:24:42 PM",
      "body": "Quote from: GazetaBitcoin on September 08, 2023, 07:51:46 AMThis na de only political article wey I don ever write. Like dis, I write am to try do something to help de oppressed people - de Ukrainian people. I dey completely against war, against oppression, against violence of any kind, and I don try wit dis article to somehow help de Ukrainian people. One great help na 1maiu wey suggest dis to me and I dey happy say I write am for dis very day February 24th, wey de war reach one year.Thank you for translating dis my topic. All of us, as we dey use Bitcoin, we dey give more power to Bitcoin and so Bitcoin fit help de Ukrainian people even more. sokani, you don do a great job by translating dis topic and I no get enough words to thank you.OMO I almost for don suprise wen I see this your replies for pidgin English, I just dey wonder say if truly na you in your own write this by yourself but I read further I come know say na one of our broda sokani nai run am for you. OMO I no go lie I been first shock oo. But this issue of the war na something wey dey so disappointing to hear talk more say person come witness am first hand, my broda e too bad I just dey imagine how many souls wey don go down because of this careless war.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 08, 2023, 07:25:18 PM",
      "body": "Quote from: GazetaBitcoin on September 08, 2023, 07:51:46 AMThis na de only political article wey I don ever write. Like dis, I write am to try do something to help de oppressed people - de Ukrainian people. I dey completely against war, against oppression, against violence of any kind, and I don try wit dis article to somehow help de Ukrainian people. One great help na 1maiu wey suggest dis to me and I dey happy say I write am for dis very day February 24th, wey de war reach one year.Thank you for translating dis my topic. All of us, as we dey use Bitcoin, we dey give more power to Bitcoin and so Bitcoin fit help de Ukrainian people even more. sokani, you don do a great job by translating dis topic and I no get enough words to thank you.Sokani,nice work.@GazetaBitcoin,this your topic make sense and i enjoy every bit of information when i dey read am. na true talk you talk,e get as Russians go embrace bitcoin come begin use am more than Ruble wey go make Puttin get less power over the country. But the thing wey dey there be say Puttin na stubborn man wey every Russian dey fear because of him dictatorship government and them fit no get this idea to use remove am from power during this war time because anything we make am see say citizens don switch over to bitcoin,he go fit vex order him soldiers them to start to kill the people we bring this idea. Na wetin i understand for the matter. As for the Ukraine side their own contribution to undermine Russia Ruble go work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}