{
  "id": "topic_5476692",
  "title": "Sandra_hakeem",
  "author": "Sandra_hakeem",
  "created_time": "December 05, 2023, 11:26:46 PMLast edit: December 06, 2023, 12:28:44 AM by Sandra_hakeem",
  "content": "From this topic, I was able to get different answers to how I could retrace the tx.. so I imported the seed phrase to an electrum wallet, and I tried disconnecting and reconnecting to different severs until I got an interface that allowed me to either \"broadcast\" the transaction or \"remove\" it... I actually clicked on the remove option and it immediately reflected in my wallet for the first time...(y'all remember I used TW the last time?)? The case now is - I'm tryna accelerate the Tx and VIAbtc keeps giving me a warning - that my transaction id doesn't exist.. I also searched an old post from @LoyceV way back in 2017 and the instruction on it was to copy the hex format of the txid and rebroadcast it using coinb.in.The problem here is; i can't generate the hex format of my txid on an Android version of electrum wallet... Is there a way out to help me proceed?? Preciate y'all.Sandra 🧑‍🦰",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476692",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "December 06, 2023, 12:26:11 AM",
      "body": "If you removed your transaction from your electrum wallet, you can make and broadcast a new one using electrum itself and you don't need other tools like coinb.in for that. Also note that even if you have broadcasted your new transaction, it's possible that ViaBTC doesn't have it in their mempool and still has your previous transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "December 06, 2023, 12:35:53 AM",
      "body": "Quote from: hosseinimr93 on December 06, 2023, 12:26:11 AMIf you removed your transaction from your electrum wallet, you can make and broadcast a new one using electrum itself and you don't need to use other tools like coinb.in. Also note that even if you have broadcasted your new transaction, it's possible that ViaBTC doesn't have it in their mempool and still has your previous transaction.  I'm not able to rebroadcast the tx as I've been warned about an already pending transaction - so what i get everytime is  transaction conflictHow do I do this? Bump the fees again or cancel the tx with a much more higher fees? Cus the rate currently is 30sat/vbyte...Thanks for the correction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 06, 2023, 12:49:17 AM",
      "body": "Quote from: Sandra_hakeem on December 06, 2023, 12:35:53 AMI'm not able to rebroadcast the tx as I've been warned about an already pending transaction - so what i get everytime is  transaction conflictRebroadcast or broadcast?You said you removed your transaction from electrum and your balance reappeared. What did you do after that? Did you make a broadcast a new transaction using electrum? Since you have removed your transaction from electrum and the node you are connected to doesn't have it in its mempool, you should be able to make a new transaction and you shouldn't get any error.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "December 06, 2023, 12:56:54 AM",
      "body": "Quote from: hosseinimr93 on December 06, 2023, 12:49:17 AMQuote from: Sandra_hakeem on December 06, 2023, 12:35:53 AMI'm not able to rebroadcast the tx as I've been warned about an already pending transaction - so what i get everytime is  transaction conflictRebroadcast or broadcast?You said you removed your transaction from electrum and your balance reappeared. What did you do after that? Did you make a broadcast a new transaction using electrum? Since you have removed your transaction from electrum and the node you are connected to doesn't have it in its mempool, you should be able to make a new transaction and you shouldn't get any error. That's exactly what I did ... My balance appeared for the first time.. then I made a New transaction on electrum with a fair rate of 20sat/byte.it was unconfirmed for too long, probably due to traffic on the Blockchain? Idk. So I decided to bump the fees to 30sats/vbyte.. it's also been unconfirmed up till now.Quote from: hosseinimr93 on December 06, 2023, 12:26:11 AMAlso note that even if you have broadcasted your new transaction, it's possible that ViaBTC doesn't have it in their mempool and still has your previous transaction.  this might be the problem Honestly... Cus I used the same receiving address as the previous TX... So maybe it's been continually marked as the previous one??Edit: on two occasions, the old tx keeps reflecting back..(it just happened now)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 06, 2023, 01:12:22 AM",
      "body": "So, you have successfully broadcasted a transaction with 30 sat/vbyte. Now some nodes have the transaction paying 30 sat/vbyte in their mempool and some nodes have your first transaction in their mempool.Since ViaBTC doesn't accept your transaction, it means that they still have your first transaction in their mempool.Unfortunately, the network has become more congested and even 200 sat/vbyte isn't enough for getting confirmation now, let alone 30 sat/vbyte.If you are in a hurry, you should bump the fee. Quote from: Sandra_hakeem on December 06, 2023, 12:56:54 AMthis might be the problem Honestly... Cus I used the same receiving address as the previous TX... So maybe it's been continually marked as the previous one??It doesn't matter what address you used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 06, 2023, 10:22:41 AM",
      "body": "Quote from: Sandra_hakeem on December 06, 2023, 12:56:54 AMEdit: on two occasions, the old tx keeps reflecting back..(it just happened now)This is based from the auto-selected server's mempool.If your Electrum auto-selected a new server where the previous transaction is kept, your wallet will remove the conflicting transaction and replace it with the one in their mempool.To mitigate this (at least at your end), untick \"Select server automatically\" then manually select a server,preferably those that support \"full-rbf\" since you're replacing a non-rbf flagged transaction.(try electrum.blockstream.info:50002:s)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "December 08, 2023, 12:04:28 AMLast edit: December 08, 2023, 12:43:17 AM by Sandra_hakeem",
      "body": "Quote from: nc50lc on December 06, 2023, 10:22:41 AMThis is based from the auto-selected server's mempool.If your Electrum auto-selected a new server where the previous transaction is kept, your wallet will remove the conflicting transaction and replace it with the one in their mempool. This explanation has made me understood everything pertaining to auto-connection and manual de-selection .. I thought every single sever would automatically have the Tx as long as it was broadcasted.QuoteTo mitigate this (at least at your end), untick \"Select server automatically\" then manually select a server,preferably those that support \"full-rbf\" since you're replacing a non-rbf flagged transaction.(try electrum.blockstream.info:50002:s) I actually -- out of more curiosity (not to get the funds off the mempool, but to understand the whole process) cancelled the transaction and realized that that was as good as broadcasting another transaction, waiting to be confirmed 🤦So currently, I've got the first transaction with the 30 sat/vbyte waiting to be confirmed and also the same transaction waiting to be cancelled, also in the confirmation process but with a much lower fee rate.. I'm a mess!!!! But I'm happy that every bit of it isn't a waste cus I've definitely acquired alot of technical knowledge.Y'all really helped... I dunno what else to do now but maybe I'll just increase the fees of the cancelled transaction...if it's confirmed and cancelled, then I'll wait till whenever Edit; the cancelled transaction was on a higher fee rate; 50 sats/vbyte.Note: The pending transaction is the same transaction I canceled.. Quote from: hosseinimr93 on December 08, 2023, 12:14:22 AMWith canceling a transaction in electrum, you replace it with a new one paying higher fee and sending the fund to one of your own addresses.And @achow101, the great coderman once asked; why's the technical part of Bitcoin so hard to understand?. I'll just bump double fees; if it gets the money exhausted, I'll just let it slide.. that's life. Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 08, 2023, 12:14:22 AM",
      "body": "With canceling a transaction in electrum, you replace it with a new one paying higher fee and sending the fund to one of your own addresses.If you have an unconfirmed transaction and you want it to get confirmed fast, just bump the fee. If you cancel the transaction and then make a new one, you only waste your money. Because you will have to pay fee for an extra transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 08, 2023, 01:33:02 PM",
      "body": "Quote from: Sandra_hakeem on December 08, 2023, 12:04:28 AMQuote from: nc50lc on December 06, 2023, 10:22:41 AMThis is based from the auto-selected server's mempool.If your Electrum auto-selected a new server where the previous transaction is kept, your wallet will remove the conflicting transaction and replace it with the one in their mempool. This explanation has made me understood everything pertaining to auto-connection and manual de-selection .. I thought every single sever would automatically have the Tx as long as it was broadcasted.It isn't necessarily wrong, that is the case if the transaction doesn't have any conflict, the transaction would normally propagate to Bitcoin nodes' mempools including public Electrum servers (each has their own mempool).But in your case where there's conflicting transaction that doesn't have rbf flag, others that still have it and doesn't support full-rbf wont accept the replacement.Since Electrum client (wallet) relies on its server's mempool, it will choose the txn in its server.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "December 08, 2023, 08:51:35 PM",
      "body": "Quote from: Sandra_hakeem on December 08, 2023, 12:04:28 AM... This is a bit confusing! Please correct me if am wrong : You have a pending transaction which is unlikely to confirm any time soon. You used Electrum to connect to a node which has dropped the original transaction from its mempool. Removed the ( now local) transaction and created a new one paying higher fees and broadcast it but the fee rate was not high enough, for the second time.By doing so, you made things a bit more complicated since some nodes have the old transaction in their mempool and the others have the second one and both are unlikely to be dropped any time soon so you can repeat the same process to bump the fees! Luckily, since you used Electrum to create the second (replacement) transaction then you can easily bump its fee since Electrum create rbf transactions by default.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}