{
  "id": "topic_5456649",
  "title": "Little Mouse",
  "author": "Little Mouse",
  "created_time": "June 17, 2023, 10:47:57 AM",
  "content": "I'm an active participant in quora. Mostly I'm engaged in cryptocurrency discussion in Bengali. My purpose is simply to fight against FUD, misinformation. I have been doing this actively for long time now. I have engaged in debates in quora.For the last few years, I'm trying to have a debate about Bitcoin with Mohammad Ghoni who was a Professor in a private university of Bangladesh. He claims himself as a economic analyst.However, his negativity against Bitcoin is totally stupid. In fact, it seems he is biased when talking about Bitcoin or other cryptocurrency. He talks nonsense as if he doesn't know anything about Bitcoin. He is spreading wrong information about Bitcoin in quora. It's simple, when you don't know anything perfectly and you want to talk about that, you will only generate some stupid text.I tried to engage with him in his responses. I'm ready to have a debate with him. The problem is he doesn't reply when someone wants to talk against his stupid opinion. He simply put answer on quora and then leave. I have replied in many of his answer in quora but never got a reply.Now, I'm getting more concerned because he is spreading negativity in most of the questions. What can I do? Is there anything legal step someone can take, any foundation working on such issue? Or how can I invite him for a debate? I can simply put him on ignore but I'm also concerned about people getting wrong message. That's why I'm thinking something different.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456649",
  "comments": [
    {
      "author": "Hyphen(-)",
      "created_time": "June 17, 2023, 11:02:58 AM",
      "body": "Some people dislike it when others speak or say something that contradicts their beliefs, even if they are incorrect.I'm sure he listens to public media, like as radio stations; if so, you may hear requests on a radio station to teach the public about Bitcoin and instill some trust in them in the face of FUD. You can also respond to what the professor said by making it apparent that you are prepared to respond if he has any criticism for what you said. As a public figure, he will want to respond, and as a result, you will have the opportunity to engage in a public argument with him to clear him of most of the incorrect statements he made about Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Catenaccio",
      "created_time": "June 17, 2023, 11:14:17 AM",
      "body": "Quote from: Little Mouse on June 17, 2023, 10:47:57 AMI tried to engage with him in his responses. I'm ready to have a debate with him. The problem is he doesn't reply when someone wants to talk against his stupid opinion. He simply put answer on quora and then leave. I have replied in many of his answer in quora but never got a reply.You will waste your time if you keep him in your mind.He is not open minded and did not take your comments into his mind. You can move on, ignore him and use your comments to help other members on Quora. I don't know on Quora, they have Ignore like in bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 17, 2023, 11:15:47 AM",
      "body": "Quote from: Little Mouse on June 17, 2023, 10:47:57 AMMy purpose is simply to fight against FUD, misinformation. I have been doing this actively for long time now. I have engaged in debates in quora.This ia a decision that will help in a long way make people to understand more better on the needs to avoid the fear, but we have to consider the way cryptocurrency is fast moving forward with bitcoin adoption and new people coming in new and we continue to receive was on various aspects of bitcoin and cryptocurrencies, are his gives me the thought on the likely possibilities that if this FUD could actually be moderated globally.Quote from: Little Mouse on June 17, 2023, 10:47:57 AMNow, I'm getting more concerned because he is spreading negativity in most of the questions. What can I do? Is there anything legal step someone can take, any foundation working on such issue? Or how can I invite him for a debate? I can simply put him on ignore but I'm also concerned about people getting wrong message. That's why I'm thinking something different.You have to understand that his approach to bitcoin has nothing to do by stopping bitcoin from going more global, alot of people have done that before and yet bitcoin advances to where it is today, even government couldn't, if you can't convince him then you leave him alone, am sure he's too small to convince the whole world to stop bitcoin adoption, and you don't need to go further in legal action because bitcoin is a decentralized currency, you can learn more on the legal action on Craig Wright against bitcoin ownership, just ignore such time wasters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "June 17, 2023, 11:21:29 AM",
      "body": "I would suggest ignoring him But since you concerned about itYou can just continue what you doingWho wants to listen to you or are open minded would listen You can even quote words of popular figure since most people are biased towards the words of people in respectable positionEven if you get a debate doesn't guarantee he would change his stanceIts all about beliefIts not something that can be changed with wordsFUD's doesn't only exist in cryptocurrencyIts everywhereAs the saying goes \"many are called few are chosen\"Everybody can't be saved",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "June 17, 2023, 11:22:55 AM",
      "body": "Quote from: Little Mouse on June 17, 2023, 10:47:57 AMI'm an active participant in quora. Mostly I'm engaged in cryptocurrency discussion in Bengali. My purpose is simply to fight against FUD, misinformation. I have been doing this actively for long time now. I have engaged in debates in quora.For the last few years, I'm trying to have a debate about Bitcoin with Mohammad Ghoni who was a Professor in a private university of Bangladesh. He claims himself as a economic analyst.However, his negativity against Bitcoin is totally stupid. In fact, it seems he is biased when talking about Bitcoin or other cryptocurrency. He talks nonsense as if he doesn't know anything about Bitcoin. He is spreading wrong information about Bitcoin in quora. It's simple, when you don't know anything perfectly and you want to talk about that, you will only generate some stupid text.I tried to engage with him in his responses. I'm ready to have a debate with him. The problem is he doesn't reply when someone wants to talk against his stupid opinion. He simply put answer on quora and then leave. I have replied in many of his answer in quora but never got a reply.Now, I'm getting more concerned because he is spreading negativity in most of the questions. What can I do? Is there anything legal step someone can take, any foundation working on such issue? Or how can I invite him for a debate? I can simply put him on ignore but I'm also concerned about people getting wrong message. That's why I'm thinking something different.Just ignore him and don't even think that his misinformation could cause anything to Bitcoin community. He's not alone in doing such things and there are many skeptical people like him who are totally against Bitcoin and concept of crypto-currencies. These people will always try to spread wrong information about Bitcoin because they hate it deeply. The only thing we can do is to ignore all those people who do that, debating with a fool isn't a good choice because such people don't listen to others. They only consider their own opinion regarding as an eternal truth.You're just wasting your stamina and precious time on a naive person, and I suggest you to just ignore him. You should stop replying to his non-sense answers because if someone is scared from truth then he will never reply to the one who speaks truth. The guy is a liar and he is promoting misinformation intentionally, and that's why he won't listen to anyone. Just block him if the blocking option exists on Quora and never ever read his answers even from another account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "June 17, 2023, 12:01:10 PM",
      "body": "Quote from: Little Mouse on June 17, 2023, 10:47:57 AMI tried to engage with him in his responses. I'm ready to have a debate with him. The problem is he doesn't reply when someone wants to talk against his stupid opinion. He simply put answer on quora and then leave.So all you accomplish is bumping up his threads and giving him more visibility. You even bring his name and biography here, which increases his recognition, which gives strength to his words, whether true or false. some people have built their entire brand, and thus great fortunes, on misinterpreting reality and spaming their bullshit all around internet and every interaction with them only increases their view number. some are even known to be perfect anti-signals (e.g. peter shiff, every time he writes \"I told you bitcoin is worthless, you didn't want to listen, now you have it\" exacly when bitcoin hits the dip and starts a strong rebound and trend reversal).I don't think it makes sense to fight them. It's better to focus on building than on war with a single hammer hitting the wall.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "June 17, 2023, 12:13:14 PM",
      "body": "It is useless to prove anything to such people. Even if he is 100 percent wrong, he will never accept it. You argue against what he says, and that's enough. And people, if they are not stupid, will draw their own conclusions from your responses to his posts. And who knows, maybe this professor is paid to develop an aversion to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "June 17, 2023, 12:36:20 PM",
      "body": "I learnt from a wise man that don't try to talk to people who aren't ready to give you listening ears, and ever since I have been living that way I have been very happy with myself.One point you must understand is that there would always be people who would be against Bitcoin and crypto-currency in general regardless of what you have to tell them, Infact if the academic qualifications you say he has is truth then he isn't stupid and probably has done his research and there is nothing you have to tell him that he hasn't already researched about, but he has chosen to be stubborn and adamant about his personal views on Bitcoin, if he doesn't give you a platform to interact with him then let it be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "June 17, 2023, 12:44:28 PM",
      "body": "You don't have to. If you are getting affected by it then you will be the loser in the end. Do you want to be a loser? If you answer is \"no\" then ignore the FUD. \"Yes\" > have fun staying poor. If you re thinking about the other investors, again, you shouldn't because the same logic also applies to their situation. If they get affected by the FUD then they will lose money. I don't know about you but I don't give a damn if other people make or lose money. Who cares?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "June 17, 2023, 12:44:46 PM",
      "body": "Quote from: Little Mouse on June 17, 2023, 10:47:57 AMThe problem is he doesn't reply when someone wants to talk against his stupid opinion. He simply put answer on quora and then leave. I have replied in many of his answer in quora but never got a reply.Now, I'm getting more concerned because he is spreading negativity in most of the questions. What can I do? Is there anything legal step someone can take, any foundation working on such issue? Or how can I invite him for a debate? I can simply put him on ignore but I'm also concerned about people getting wrong message. That's why I'm thinking something different.Just do what he is doing. Spread your idea and ignore opinion that against you such as his post. We don’t need to defend all attack because they will just get enough attention with their comment. Haters will always gonna hate. It’s nonsense to debate with them because they will just find a way to twist your reasoning for their advantage or simply they will just ignore you. We are not required to reply all the opinions that opposite to us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ayers",
      "created_time": "June 17, 2023, 01:04:02 PM",
      "body": "Those are the people who are deliberately anti-bitcoin, and they will ignore all the people who are against them, and there is nothing you can do about those people but ignore him. Bitcoin is like everything else in this world, it is not perfect enough to please everyone, there will always be lovers and haters even if the government recognizes it. So let's not waste time with those types of people and should focus on people who have a positive view of bitcoin like us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "June 17, 2023, 01:15:50 PM",
      "body": "I don't know about your response though, if you call someone or their argument stupid, they would probably choose not to engage you then because it's going to useless, you've attacked the character and not the argument. But if you didn't do that then I should thank you first that you're an active commenter in Quora, pretty awesome that someone is actively fighting misinformation there. I think that you don't need to engage the professor on a debate, it's enough that you point out the wrong things in his argument, you stating the information is enough so the people who reads his statement will have no problem choosing which side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "June 17, 2023, 01:31:11 PM",
      "body": "There are lots of people on quora. I've been active on quora for a long time but I never talk about bitcoin. Are you the only one fighting against that person's negative opinion? I think creating a new answer that has positive value about bitcoin can counter negative answers about bitcoin. I'm ready to support you, we can reply to each other's comments to influence public opinion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "June 17, 2023, 01:34:22 PM",
      "body": "Let's accept the fact you can't be loved by everyone and not everyone will agree with your opinion, if they view Bitcoin is scam, then let them pick their choice. If you want to fight with everyone who spreading misinformation about Bitcoin, good luck you will waste most of your time just to fight with a stupid people. Winning isn't about your opponent admit if he was wrong, but end a debate with a stupid person is also a win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "June 17, 2023, 01:45:49 PM",
      "body": "Quote from: Solosanz on June 17, 2023, 01:34:22 PMLet's accept the fact you can't be loved by everyone and not everyone will agree with your opinion ~snip~Yes, I agree with you. But public opinion is built from pieces of puzzles, if that person builds a lot of puzzles then public awareness about bitcoin will be negative. Quora has a question and answer system and the quora algorithm will recommend the most read answers and get feedback. Maybe the OP should make an answer about bitcoin's positive value. I'm ready to support that answer with upvotes and commentsIndeed, not everyone has to agree with our opinion, but we can ensure that our opinion is enough to be considered, with logical reasons",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ektotanes",
      "created_time": "June 17, 2023, 01:52:44 PM",
      "body": "Unfortunately, it happens that a person does not understand anything about the topic of the question. Therefore, when someone responds to his statement with criticism, he has nothing to say. You can create a post on a social network and invite him to join the discussion. The more popular this post is, the more likely it is that he will respond",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "June 17, 2023, 01:53:28 PM",
      "body": "I would usually say ignore those people since it's a waste of effort but I could see you're heavily invested in promoting bitcoin in your online community. I think the reason he doesn't engage you in a debate is that he doesn't see you as an equal yet. He may be looking down on you since he's an economic analyst. It seems like you are trying too hard to \"chase\" him to prove a point and I think that's  probably not going to work. I say stop that and continue to build your reputation there and by that I mean keep opening topics to refute all the disinformation. I think he'll eventually engage you if you get more recognition from your online community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "June 17, 2023, 01:53:52 PM",
      "body": "Why don't you choose to ignore it? instead of always replying to his posts. it can actually get more people more interested in what he writes when there are more comments and viewers.when you surf the internet, on any topic there will always be such a thing. You don't need to make it so serious that you might have trouble sleeping.why not post on the opposite topic if you think the information he made up is wrong.nowadays people will sort the information they read. because everyone knows that not everything on the internet is true or fake. I know you have good care.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "June 17, 2023, 01:56:36 PM",
      "body": "Quote from: Little Mouse on June 17, 2023, 10:47:57 AMHowever, his negativity against Bitcoin is totally stupid. In fact, it seems he is biased when talking about Bitcoin or other cryptocurrency. He talks nonsense as if he doesn't know anything about Bitcoin. He is spreading wrong information about Bitcoin in quora. It's simple, when you don't know anything perfectly and you want to talk about that, you will only generate some stupid text. I read all the posts you made on here and thought it would be a waste of time arguing with people who hate bitcoin and somehow they will try to defend their argument. To my knowledge there are no legal institutions dealing with crypto or bitcoin issues so it's a bit difficult to find one, especially for those of us who live in countries that aren't very friendly to bitcoin in particular. If you think this needs to be straightened out, write to the institution where he works and invite them to discuss this issue openly or it could be via radio channels in your country.But the problem is when your country doesn't legalize bitcoin as a commodity asset, it will be difficult for you to build public impact on this and also impossible to have a public debate that gets people talking about bitcoin because there are regulatory limits set by your government. Even if you try to force this to happen and then you will be in trouble with the laws in your area of residence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}