{
  "id": "topic_5450785",
  "title": "kristycryptop",
  "author": "kristycryptop",
  "created_time": "May 01, 2023, 04:54:06 AM",
  "content": "Hello Bitcointalksorry if I been so dummy but I was hearing words like Mining BTC can someone explain to to me with simple words ? I searched and found many ways but they all seem so fishy to me so if someone can give me just a small hint hereThanksss",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450785",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 01, 2023, 05:19:22 AM",
      "body": "Maybe tell us what aspect of Bitcoin mining you don't understand instead? Instead of us going to explain everything from scratch.Anyway — just for fun, I asked chatGPT.Prompt: explain bitcoin mining to a 12 year oldAnswer: Sure, I can try to explain Bitcoin mining in a simple way!Bitcoin is a type of digital money that people can use to buy things online. But unlike regular money that is printed by a government, Bitcoins are created by people using computers to solve really hard math problems. This is called Bitcoin mining.The math problems that miners solve are like puzzles that require a lot of computing power to solve. When a miner solves a puzzle, they earn some new Bitcoins as a reward. This is how new Bitcoins are created and added to the Bitcoin system.But mining Bitcoins isn't easy - it requires a lot of expensive equipment and electricity to power it. That's why not everyone can mine Bitcoins. It's kind of like trying to find a treasure, but you need a lot of tools and energy to dig for it.Hope that helps! Let me know if you have any more questions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "May 01, 2023, 07:32:27 AM",
      "body": "Quote from: kristycryptop on May 01, 2023, 04:54:06 AMI searched and found many ways but they all seem so fishy to me so if someone can give me just a small hint hereTo add to the simple explanation above, there are basic ways people go about getting into bitcoin mining:1. Solo mining; You are running your own pool as a solo miner solely with your personal mining equipment. With how competitive mining is now, profiting solo requires a huge capital investment.2. Joining a Mining pool; Miners that join pools are literally pooling their hashrates together. If I do not have enough hashrate to be cimetitive as a solo miner, I can join a group of other miners and any reward gotten is split based on the hashrate the miner contributed.I would not comment on cloud mining cause it is a very grey area.The concept of mining can be explained as miners trying to solve a computational puzzle with computational energy. It has the dual function of confirming transactions and bringing new coins into circulation (until the total supply is reached).- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 01, 2023, 07:57:03 AM",
      "body": "Quote from: kristycryptop on May 01, 2023, 04:54:06 AMSnippedBitcoin mining simply means the process whereby new bitcoin were created and this is done through the set up of a mining rig where all other activities concerning bitcoin mining are carried out, you can read more from this thread i will be providing for you concerning bitcoin mining https://bitcointalk.org/index.php?topic=2415854.0 try as much as possible to read through the link and also make comparisons to the definitions you've received from the internet about bitcoin mining, but know this that this is the only official bitcoin discussion platform where you could get the best and accurate answer to any questions regarding bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "May 01, 2023, 07:59:24 AM",
      "body": "Mining is the activity that makes more Bitcoin to be available for circulation. The total Bitcoin supply would be 21 million BTC, which is the cap from the beginning and this amount is what the miners are gradually mining for a reward.Currently, about 19 million BTC has been mined so far and is in circulation for utilization. You can join for rewards if you are so desired and have what it takes to do it.The links below would help you further:1. https://www.investopedia.com/tech/how-does-bitcoin-mining-work2. https://www.bankrate.com/investing/what-is-bitcoin-miningLet me limit it there to avoid cumbersomeness. Also, some YouTube practical explanations could be helpful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "May 01, 2023, 01:23:53 PM",
      "body": "Quote from: kristycryptop on May 01, 2023, 04:54:06 AMHello Bitcointalksorry if I been so dummy but I was hearing words like Mining BTC can someone explain to to me with simple words ? I searched and found many ways but they all seem so fishy to me so if someone can give me just a small hint hereThanksss  Simply put, mining could be described as a process of verifying transactions on a proof of work blockchain and creation of coins through some mathematical puzzle with the use of special computers. And it's advisable to use ASIC miners for your mining https://bitcointalk.org/index.php?topic=3469416.0To get a more rich explanations in additions to the ones other members have given, I'll recommend you move your thread to  mining  board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "May 01, 2023, 02:31:48 PM",
      "body": "Quote from: kristycryptop on May 01, 2023, 04:54:06 AMI searched and found many ways but they all seem so fishy to me so if someone can give me just a small hint hereThanksss  You should be careful as searching for mining in Google could direct you into a scam mining cloud (most of them are scam btw.).Other forum members have already provided you with links to get you started in learning more about mining bitcoin, but just incase you're unable to afford the cost of setting up or acquiring you own mining equipments or after your calculation you found out that mining bitcoin won't be profitable for you due to electricity cost or whatever the reasosn might be; just know that you can also make good profits (and also loss some of you capital depending on the marlet movement) by just buying bitcoin directly. We have  so many bitcoiners who don't even know how mining works and yet are still making it big in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "May 01, 2023, 03:11:17 PM",
      "body": "Some have given good simple explanations, but I doubt you will easily get the point. To explain to beginners it is usually easier to use a little analogy as their knowledge is average not technical enthusiasts. Maybe you should look up some video based references about mining on youtub or tiktok, I think it explains better than just a text with pictures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "May 01, 2023, 06:24:52 PM",
      "body": "Quote from: kristycryptop on May 01, 2023, 04:54:06 AMHello Bitcointalksorry if I been so dummy but I was hearing words like Mining BTC can someone explain to to me with simple words ? It's great that you're interested in Bitcoin mining, but general questions like this might not get the best responses in a forum. Bitcoin mining is a vast subject that can't be explained in just a few sentences. Other members have already give you some great resources to read, and you can also use the internet search to learn the basics. Once you get a grasp of the basics, you can ask more specific questions, and the experienced members of this forum will be more than happy to help you out. Don't hesitate to ask!Quote from: kristycryptop on May 01, 2023, 04:54:06 AMI searched and found many ways but they all seem so fishy to me so if someone can give me just a small hint hereAlright, this question is a bit better, but in order for us to give you a specific answer about the mining methods you came across, we need more information from you. What ways are you talking about? What is your source of information?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "May 01, 2023, 06:33:05 PM",
      "body": "if you search for it in the search application on your smartphone, be careful with cloud mining which will usually advertise there. cloud mining has more potential to scam.on the forums, there are boards available discussing mining. some have already explained it. but if you are really interested in mining, maybe you will find more information there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "May 02, 2023, 08:12:25 AM",
      "body": "Quote from: kristycryptop on May 01, 2023, 04:54:06 AMsorry if I been so dummy but I was hearing words like Mining BTC can someone explain to to me with simple words ? I searched and found many ways but they all seem so fishy to me so if someone can give me just a small hint hereAll Bitcoin transactions are recorded in the block chain. A miner is a company that gets paid to collect new transactions into a \"block\" and add the block to the block chain.The ability to add each block to the block chain is determined by luck. It is a kind of lottery. Each miner computes a number that is based on its block (called a \"hash\") over and over until some miner somewhere computes a winning hash. When a winning hash is found, everybody adds the winning block to their copy of the block chain and then all of the miners start competing for the next block. Typically, when a miner has computed a winning hash, we say that they have \"found\" or \"solved\" a block.Of course, a miner that compute hashes more quickly is more likely to find blocks, but computing a hash uses electricity and computing more hashes costs more money, so only the efficient miners are able to make a profit.A \"mining pool\" is a group of miners that work together and act as a single miner. If one of the members of the pool finds a block, then all of the members share the block reward.The payment to the miner is called the \"block reward\". It consists of fees paid by the transactions plus the \"subsidy\", which is currently 6.25 BTC. To get paid, the miner simply includes a special transaction in the block that pays them the correct amount. This transaction is called the \"coinbase\" transaction.New bitcoins are created by the subsidy. The initial subsidy was 50 BTC, but it is halved every four years approximately until it reaches 0 around the year 2140. Of course, as the subsidy is reduced, the transaction fees will become an increasingly larger portion of the block reward. When the subsidy reaches 0, no more bitcoins will be created and there will be about 21 million bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}