{
  "id": "topic_5446832",
  "title": "Altamash Hasad",
  "author": "Altamash Hasad",
  "created_time": "March 29, 2023, 09:18:29 PM",
  "content": "https://s3.tradingview.com/snapshots/u/uO83UIrF.pngThe market changes so quickly, it won't wait for us to come to invest. The lowest price after the bullrun was (±) $16,600 on January 4, 2023. And the current price has reached (±) $28,387. According to my predictions, by April 2023 the Bitcoin price could reach (±) $35,000.If April 2023 the Bitcoin price can reach $35,000, then it is very likely that a bullrun will occur in April 2024.What do you think about this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446832",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "March 30, 2023, 01:33:05 AM",
      "body": "Quote from: Altamash Hasad on March 29, 2023, 09:18:29 PMI quoted to show the picture, what is the reason that you see that during the next month we will break the barrier of 30K, especially since it was a support level for a long time, and therefore it will not be that easy to break.Do not forget that bad news is still spreading, and with the turmoil in the world, I do not think that there is an appetite for high-risk investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 30, 2023, 07:21:47 AM",
      "body": "Quote from: Altamash Hasad on March 29, 2023, 09:18:29 PMAccording to my predictions, by April 2023 the Bitcoin price could reach (±) $35,000.If April 2023 the Bitcoin price can reach $35,000, then it is very likely that a bullrun will occur in April 2024.What do you think about this?Who knows what the market might turn out, but I think we are bullish in the past months and thats a good sign but quite to early to say that we are going in bull season. Like hugeblack have said, plenty of fud and bad news are still in the air and thats something could affeft the market flow. But 35k level is important cause if it indeed go there, chances that the bull run will be in the coming years of 2024 or 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "March 30, 2023, 08:30:30 AM",
      "body": "Quote from: Altamash Hasad on March 29, 2023, 09:18:29 PMWhat do you think about this?We haven't broken $30k yet, so I don't want to discuss higher prices. Bitcoin price increased continuously in the first months of the year, I think instead of expecting bitcoin to go higher, think of a scenario where bitcoin will correct sharply because we are not through the bear season yet. And with the macroeconomic news, as well as the SEC and CFTC, looking to clamp down on cryptocurrencies, there's so much negativity that I can't expect an early bull season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "March 30, 2023, 08:37:20 AM",
      "body": "Quote from: DanWalker on March 30, 2023, 08:30:30 AMQuote from: Altamash Hasad on March 29, 2023, 09:18:29 PMWhat do you think about this?We haven't broken $30k yet, so I don't want to discuss higher prices. Bitcoin price increased continuously in the first months of the year, I think instead of expecting bitcoin to go higher, think of a scenario where bitcoin will correct sharply because we are not through the bear season yet. And with the macroeconomic news, as well as the SEC and CFTC, looking to clamp down on cryptocurrencies, there's so much negativity that I can't expect an early bull season.even though there is a good sign of increasing today as the month is ending together with the first quarter yet we cannot be certain if what will truly happen so better to keep your funds on hold and never let go till it happens.i like your optimism but I also wanted to be my investment safe till it becomes reality .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "March 30, 2023, 12:21:42 PM",
      "body": "Quote from: cryptoaddictchie on March 30, 2023, 07:21:47 AMQuote from: Altamash Hasad on March 29, 2023, 09:18:29 PMAccording to my predictions, by April 2023 the Bitcoin price could reach (±) $35,000.If April 2023 the Bitcoin price can reach $35,000, then it is very likely that a bullrun will occur in April 2024.What do you think about this?Who knows what the market might turn out, but I think we are bullish in the past months and thats a good sign but quite to early to say that we are going in bull season. Like hugeblack have said, plenty of fud and bad news are still in the air and thats something could affeft the market flow. But 35k level is important cause if it indeed go there, chances that the bull run will be in the coming years of 2024 or 2025.Short term though, the price looks healthy at $28k++ and maybe next month we are going to hit $30k.Bu if you are talking long term, then yeah, we should be still buying and then holding for the next year or so. Wait for the bull in 2024-2025 as it's going to be big, new all time high of 6 digits minimum and it's the first if we are going to see the price at $100k. So really depends, as what the OP describe is just the short term price of $35k and even higher at the end of the year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "March 30, 2023, 12:26:56 PM",
      "body": "Quote from: hugeblack on March 30, 2023, 01:33:05 AMQuote from: Altamash Hasad on March 29, 2023, 09:18:29 PMI quoted to show the picture, what is the reason that you see that during the next month we will break the barrier of 30K, especially since it was a support level for a long time, and therefore it will not be that easy to break.Do not forget that bad news is still spreading, and with the turmoil in the world, I do not think that there is an appetite for high-risk investments.True bad news is still spreading and the support zone has not seen much significant breakthrough but at the same time, around the support zone it shows a range of lower highs and higher lows still maintaining the uptrend direction which depicts that if no external factor such has bad news pops up, April will experience new highs and $35k is a perfect take profit for April.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "March 30, 2023, 02:15:41 PM",
      "body": "$35k for April? It's possible, I mean at the start of the year, we are very much in the bullish phase.But it seems that the resistance at $28,500 is really huge at this point, I saw that we have broken it already, but then the price goes to $28,300 very quick. It means that speculators are selling at that price level that's why it's hard for it to reach $29k-$30k.So let's see how it goes for April, we need to get to $30k first during the first week because we talk about $35k at the end of that month.And we need to continue with our bullish sentiments and need investors to FOMO as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "March 30, 2023, 03:33:04 PM",
      "body": "It is very possible because now the price of bitcoin has been at $28,400 which means it will be closer to the opportunity for that price, it's just that we anticipate that a correction can occur at any time due to the influence of news about pressure on bitcoin, but consistently bitcoin can still hold up quite well.There has been a lot of speculation about it that in the next year there will be a bigger bullrun but we don't know what happened with the cycle but I'm just optimistic about next year bitcoin will be much better again, quite a lot more bitcoin than now before the rally comes more beginning.The halving is getting closer we have to hoard more bitcoins for the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 30, 2023, 04:57:04 PM",
      "body": "We broke $29K however the way we broke and rejected doesn't look good. Normally when the daily closes as a wick like that implies that its nothing but a stop hunt and we will start to head down. Could it reverse? Sure but it needs to close above the $28.4K quick or else many bears will come out and short it to $26K.There really isn't much going on in the markets. Stocks are up slightly but many are still worried that the anti crypto regulations and more banks will fail and it'll cause more mid term choas in the markets. The unemployment claims that came out today were pretty much inline and didn't mean anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnonBitCoiner",
      "created_time": "March 30, 2023, 05:00:11 PM",
      "body": "Bitcoin price in current year show highest rates and we can say that now we are in Bull season because from previous some days the Bitcoin increases regularly in price. The current price is higher and is more than 28k$ but has not reached to 29k$ yet.We know that the price of bitcoin is increase but we don't know that for how much time this increase price will persists. As this year was very suitable from the start for bitcoin holders to reap the benefits from elevated price so we also hope that this price will increase more in coming years but the certainty is not here that will it occur or not. It is possible that in coming months bitcoin reaches to the price of 30k$. April 2023 is very far yet so we cannot identify the price for the future because everything can happen for instance the price can increases and it can also reduces but we don't have any knowledge for the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "March 30, 2023, 05:47:05 PM",
      "body": "Quote from: Altamash Hasad on March 29, 2023, 09:18:29 PMThe market changes so quickly, it won't wait for us to come to invest. The lowest price after the bullrun was (±) $16,600 on January 4, 2023. And the current price has reached (±) $28,387. According to my predictions, by April 2023 the Bitcoin price could reach (±) $35,000.If April 2023 the Bitcoin price can reach $35,000, then it is very likely that a bullrun will occur in April 2024.What do you think about this?Well i might join on that prediction as that definitely looks like a bull flag. But it's hard to say if it's going to retrace after hitting your target. (i am thinking of elliot wave as that wiould be the 3rd rise). But in overall that it would be obviously bound to rise again higher later this year.Quote from: loabiti33 on March 30, 2023, 02:50:57 PMI'm with binance's zao on the 100x the next bull, but Im rooting for a 200k mark value till December 2023, little more then hundred but not the millions yet, balanced.Do you have any technical analysis behind this or is it just a feeling?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tygeade",
      "created_time": "March 30, 2023, 08:56:19 PM",
      "body": "Quote from: btc_angela on March 30, 2023, 02:15:41 PM$35k for April? It's possible, I mean at the start of the year, we are very much in the bullish phase.But it seems that the resistance at $28,500 is really huge at this point, I saw that we have broken it already, but then the price goes to $28,300 very quick. It means that speculators are selling at that price level that's why it's hard for it to reach $29k-$30k.So let's see how it goes for April, we need to get to $30k first during the first week because we talk about $35k at the end of that month.And we need to continue with our bullish sentiments and need investors to FOMO as well.I think it all depends on breaking above the resistance or not. If we do break over this price, then breaking over 35k shouldn't be a problem, if we can't then we will fail and stay here. So we are not entirely sure about what's going to happen, we will try to beat it obviously and that's a good thing but there is no guarantee that we will be able to.I hope that the best thing that could happen for us right now is seeing 30.001 dollars, because if that happens that means there is both the resistance broken and also a psychological barrier is breached and there would be a lot more people and a ton more money investing into bitcoin all over again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "March 30, 2023, 09:19:03 PM",
      "body": "$35000 in April would be great, it feels like a long time since the spot price was at $35000. We have a lot of issues in the banking system right now so there is always the chance of contagion which spills over into risk on assets. Hopefully the worst is over & we don’t head into a recession, bitcoin can then thrive & rally towards the halving. Short term though, $35000 would be sweet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "March 30, 2023, 09:51:52 PM",
      "body": "Quote from: DeathAngel on March 30, 2023, 09:19:03 PM$35000 in April would be great, it feels like a long time since the spot price was at $35000. We have a lot of issues in the banking system right now so there is always the chance of contagion which spills over into risk on assets. Hopefully the worst is over & we don’t head into a recession, bitcoin can then thrive & rally towards the halving. Short term though, $35000 would be sweet.This is possible if there’s a lot of good news for Bitcoin, though we’ve reached the price of $29k already and it seems like there’s a huge resistance on that price so we might see some correction first before hitting the price of $30k and beyond. Bitcoin is on a bullish trend if you look at a Monthly time frame, this could be an indication that we already survive the bear market and we are now waiting for a chance to reach a new peak again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "March 31, 2023, 03:55:45 AM",
      "body": "Well I am going to say I would be very happy with a 35k Bitcoin price in April. We have not seen this price of Bitcoin since May of 2022 I do believe.Your price prediction is also in agreement with Bloomberg. They say it will reach this price after United States Fed rate hike. https://coingape.com/bitcoin-price-set-for-35000-after-us-fed-rate-hike-decision-bloomberg/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "March 31, 2023, 05:03:08 AM",
      "body": "Quote from: tygeade on March 30, 2023, 08:56:19 PMQuote from: btc_angela on March 30, 2023, 02:15:41 PM$35k for April? It's possible, I mean at the start of the year, we are very much in the bullish phase.But it seems that the resistance at $28,500 is really huge at this point, I saw that we have broken it already, but then the price goes to $28,300 very quick. It means that speculators are selling at that price level that's why it's hard for it to reach $29k-$30k.So let's see how it goes for April, we need to get to $30k first during the first week because we talk about $35k at the end of that month.And we need to continue with our bullish sentiments and need investors to FOMO as well.I think it all depends on breaking above the resistance or not. If we do break over this price, then breaking over 35k shouldn't be a problem, if we can't then we will fail and stay here. So we are not entirely sure about what's going to happen, we will try to beat it obviously and that's a good thing but there is no guarantee that we will be able to.I hope that the best thing that could happen for us right now is seeing 30.001 dollars, because if that happens that means there is both the resistance broken and also a psychological barrier is breached and there would be a lot more people and a ton more money investing into bitcoin all over again.Bitcoin price prediction is an interesting thing even though I am a long-term investor, and the short-term rise or fall of the price doesn't matter to me. I see people saying that if bitcoin crosses $30k, it's easy to hit $35k, but I want people to be more careful. Even if bitcoin crosses $30k, there is no guarantee bitcoin will rise to $35k without any crash. When the market is too excited, too expecting higher levels, we should be careful because the market always tends to go against the crowd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darewaller",
      "created_time": "April 01, 2023, 08:48:59 AM",
      "body": "Quote from: adaseb on March 30, 2023, 04:57:04 PMWe broke $29K however the way we broke and rejected doesn't look good. Normally when the daily closes as a wick like that implies that its nothing but a stop hunt and we will start to head down. Could it reverse? Sure but it needs to close above the $28.4K quick or else many bears will come out and short it to $26K.There really isn't much going on in the markets. Stocks are up slightly but many are still worried that the anti crypto regulations and more banks will fail and it'll cause more mid term choas in the markets. The unemployment claims that came out today were pretty much inline and didn't mean anything.If you only focus on the price of BTC, yes. You can say that the movements are only minimal but if you mean the whole market of crypto, there are lots of happenings that occurred actually. Stocks are up but who care's about them? We are here in crypto and people here are more concerned of the status of the cryptos than anything else.There are anti-crypto regulations but I think they are only minimal. There are still good news that came out lately like China is now embracing cryptos again. That should counter them and help the price to not crash hard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "April 01, 2023, 12:11:25 PM",
      "body": "The price is still at $28k and it looks like it is still waiting for the right time to increase further.I have a feeling that right now, the market is at a weekend where a correction is usually coming and it's not until next week that the price starts to increase again.And this time, the market has entered the month of April, where we can expect the price to increase again.But I still doubt if the price can reach $ 35k in April because the movement of bitcoin is still almost the same as the previous months.But in April, there may be a high increase in the market so that it can immediately reach $30k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "April 02, 2023, 10:09:53 PM",
      "body": "Quote from: traderethereum on April 01, 2023, 12:11:25 PMThe price is still at $28k and it looks like it is still waiting for the right time to increase further.I have a feeling that right now, the market is at a weekend where a correction is usually coming and it's not until next week that the price starts to increase again.Again, $28,500 is the big wall upon us, there are times that during weekend we will see some action. But since we might be in the overbought zone, then it might be slow and deliberate for traders to take it slow this weekend. We are currently going to trade sideway and it might be good though with this temporary lull in the market. At least the price is still above $28k this start of April.Quote from: traderethereum on April 01, 2023, 12:11:25 PMAnd this time, the market has entered the month of April, where we can expect the price to increase again.But I still doubt if the price can reach $ 35k in April because the movement of bitcoin is still almost the same as the previous months.But in April, there may be a high increase in the market so that it can immediately reach $30k.We will have to wait for the break out run this month. It seems that bulls and bears are going to fight it out. However, the price seems to be on the strong side of it. So let's see this two forces, obviously we need to get over to $28,500-$28,600 to maintain this bullish trend. Otherwise the bears might be in control and pull the price to as well as $27,500. So let's see what will be the price action for this week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}