{
  "id": "topic_5469898",
  "title": "tg88",
  "author": "tg88",
  "created_time": "October 10, 2023, 04:56:10 PM",
  "content": "Esse Bear Market não está fácil pra ninguém. A Bitmain suspendeu o pagamento dos funcionários referente ao mês de setembro e anunciou redução de 50% no valor do salário dos funcionários para os próximos meses.  (Será que lá na China é assim? Dá para reduzir o salário quando a empresa está com dificuldades?)Em 2021 a Bitmain planejava lançar um IPO com planos de arrecadar 5 bilhões na operação, mas com o mercado de baixa os planos foram adiados. O mercado cripto no geral está precisando de uma nova Bull Run, várias empresas estão em situação bem complicada. Fabricante de ASICS de Bitcoin, Bitmain, interrompe pagamentos de salários de funcionários, aponta reportagem",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469898",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "October 10, 2023, 07:49:25 PM",
      "body": "Sei não. Uma empresa quando começa com isso é sinal que está na porta da falência. Quanto a direitos trabalhistas, a China é famosa por não possuir qualquer direito trabalhista. Por causa disso que muitas empresas ocidentais começaram a produzir por lá. Tem relatos de fábricas que produzem o Iphone onde funcionários não aguentavam de tanto trabalhar e se mataram. Complicado esse Capitalismo de Estado Chinês.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "October 10, 2023, 08:47:56 PM",
      "body": "O estranho é que o hash rate do Bitcoin está nas alturas.. Será que a Bitmain está perdendo espaço para outras empresas?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "October 10, 2023, 10:53:43 PM",
      "body": "Quote from: sabotag3x on October 10, 2023, 08:47:56 PMO estranho é que o hash rate do Bitcoin está nas alturas.. Será que a Bitmain está perdendo espaço para outras empresas?Tentei encontrar alguma comparação de dominância de mercado assim como é possível verificar no caso de Nvidia vs AMD mas infelizmente não encontrei nada. Realmente o hashrate não para de subir mas aparentemente a concorrência está sim bem mais forte e eles não estão mais conseguindo praticar preços com as margens tão elevadas quanto no passado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jpouza",
      "created_time": "October 10, 2023, 11:13:30 PM",
      "body": "Em Cripto não temos garantia de nada, é bem provável que a fabricante siga as outras já falecidas e tenha sua trajetória encerrada, mas torçamos para que algo positivo ocorra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "October 11, 2023, 03:07:52 AM",
      "body": "Pergunta sincera, quais são as concorrentes da Bitmain? Quando acompanhava mais essas notícias de mineração ela era que reinava com seus antminer. Hoje em dia tem outras fabricantes de Asic's do mesmo porte da Bitmain? O complicado pra uma empresa dessa é que o campo de atuação deles é bem limitado, então não tem muito pra onde correr.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "October 11, 2023, 05:14:58 PM",
      "body": "Também só encontrei dados antigos..Acredito que o caminho mais fácil é pegar os dados dessas mineradoras listadas em bolsa.. deve dar para ter uma ideia de como está dominância da Bitmain ao olhar para as compras realizadas por essas mineradoras.. pena que dá muito trabalho fazer isso.Enfim, halving chegando, imagino que surjam mais notícias sobre o setor de mineração.. desde vendas/compras de ASICs até falências..Hoje mesmo vi que as mineradoras venderam 20.000 BTC (R$ 2,7 bilhões) nesta semana, maior venda desde abril, com certeza influencia o mercado.. Fonte: https://twitter.com/intotheblock/status/1711767134081110191@Loganota, aqui tem algumas, mas não sei o tamanho delas: https://www.asicminervalue.com/manufacturers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "October 17, 2023, 07:41:26 PM",
      "body": "Hoje saiu uma matéria noticiando que a Bitmain demitiu 4 funcionários por esse vazamento da informação de que ela não estava pagando os salários em dias, em nota ela divulgou o nome dos funcionários e ainda comentou que ninguém deveria contrata-los.  : “Sem a autorização da empresa, você não pode dizer nada, bem drástico esse mercado de trabalho Chinês.Mas o mais legal é que na matéria tem um gráfico de dominância de fabricantes de ASIC e ele mostra claramente que a Bitmain vem perdendo bastante mercado:Vazamento de segredos industriais leva a demissões em fabricante de equipamentos de mineração de Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "October 17, 2023, 07:46:41 PM",
      "body": "Quote from: tg88 on October 17, 2023, 07:41:26 PMHoje saiu uma matéria noticiando que a Bitmain demitiu 4 funcionários por esse vazamento da informação de que ela não estava pagando os salários em dias, em nota ela divulgou o nome dos funcionários e ainda comentou que ninguém deveria contrata-los.  : “Sem a autorização da empresa, você não pode dizer nada, bem drástico esse mercado de trabalho Chinês.Mas o mais legal é que na matéria tem um gráfico de dominância de fabricantes de ASIC e ele mostra claramente que a Bitmain vem perdendo bastante mercado:Vazamento de segredos industriais leva a demissões em fabricante de equipamentos de mineração de BitcoinNunca ouvi falar dessas empresas que estão no gráfico, além da Bitmain, claro. Será que é o nome real do fabricante e no mercado as mineradoras utilizam outro nome fantasia? Isso é bem comum de acontecer. Veja essa tal de Ebang. Parece nome de fabricante de relógio desses falsificados.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "October 18, 2023, 01:39:05 AM",
      "body": "Quote from: tg88 on October 17, 2023, 07:41:26 PMHoje saiu uma matéria noticiando que a Bitmain demitiu 4 funcionários por esse vazamento da informação de que ela não estava pagando os salários em dias, em nota ela divulgou o nome dos funcionários e ainda comentou que ninguém deveria contrata-los.  : “Sem a autorização da empresa, você não pode dizer nada, bem drástico esse mercado de trabalho Chinês.Mas o mais legal é que na matéria tem um gráfico de dominância de fabricantes de ASIC e ele mostra claramente que a Bitmain vem perdendo bastante mercado:Vazamento de segredos industriais leva a demissões em fabricante de equipamentos de mineração de BitcoinOpa, muito interessante esse gráfico. A questão é que também a Bitmain não tem muito pra onde melhorar as suas asics e as outras empresas podem analisar como as máquinas dela funcionam para tentar chegar perto no poder de processamento. Sobre os funcionários demitidos, acho que na China e outros países asiáticos essa questão de indicação de empresa pesa muito, então é bem possível que esses caras realmente demorem a arrumar um novo trabalho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "October 18, 2023, 07:04:33 PM",
      "body": "Quote from: Paredao on October 17, 2023, 07:46:41 PMNunca ouvi falar dessas empresas que estão no gráfico, além da Bitmain, claro. Será que é o nome real do fabricante e no mercado as mineradoras utilizam outro nome fantasia? Isso é bem comum de acontecer. Veja essa tal de Ebang. Parece nome de fabricante de relógio desses falsificados.   Sim fica um pouco confuso pois no caso da Bitmain os seus ASIC's são chamados de Antminer e por ser a marca mais popular conseguimos vincular tanto marca quanto ao modelo a mesma empresa. MicroBT é quem fabrica os ASIC's conhecidos pelo nome de whatsminer e Canaan fabrica os ASIC's conhecidos como Avalon. Já a Ebang realmente eu também ainda não conhecia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 19, 2023, 11:11:54 PM",
      "body": "Quote from: tg88 on October 17, 2023, 07:41:26 PMHoje saiu uma matéria noticiando que a Bitmain demitiu 4 funcionários por esse vazamento da informação de que ela não estava pagando os salários em dias, em nota ela divulgou o nome dos funcionários e ainda comentou que ninguém deveria contrata-los.  : “Sem a autorização da empresa, você não pode dizer nada, bem drástico esse mercado de trabalho Chinês.Essa prática de queimar um funcionário ruim pra outras empresas acontece no mundo todo. O que tá bizarro é botar o nome no jornal.Já ouvi falar até no Brasil que se um funcionário sair e processar a empresa, rola uma listinha negra circulando entre os RH  de diferentes empresas. Lógico né.QuoteMas o mais legal é que na matéria tem um gráfico de dominância de fabricantes de ASIC e ele mostra claramente que a Bitmain vem perdendo bastante mercado:Vazamento de segredos industriais leva a demissões em fabricante de equipamentos de mineração de BitcoinBem legal a notícia  e o gráfico. Concorrência é sempre bom",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 03, 2023, 08:51:10 PM",
      "body": "Quote from: Loganota on October 18, 2023, 01:39:05 AMOpa, muito interessante esse gráfico. A questão é que também a Bitmain não tem muito pra onde melhorar as suas asics e as outras empresas podem analisar como as máquinas dela funcionam para tentar chegar perto no poder de processamento. Não tem porque?Eles como lideres no mercado, e terem sido praticamente os pioneiros na mineração ASIC, tinha todas as condições de continuarem a melhorar e a evoluir.Mas, continuam a lançar \"novas\" ASICs com as mesmas características das anteriores, mas com nomes diferentes.Existe claramente, uma falta de investimento na melhoria de eficiência energética nos seus equipamentos.Se a concorrência, mesmo com menor capacidade de hash, consegue trazer melhor eficiência energética, é só vantagens a longo prazo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "November 03, 2023, 10:33:21 PM",
      "body": "Quote from: joker_josue on November 03, 2023, 08:51:10 PMNão tem porque?Eles como lideres no mercado, e terem sido praticamente os pioneiros na mineração ASIC, tinha todas as condições de continuarem a melhorar e a evoluir.Mas, continuam a lançar \"novas\" ASICs com as mesmas características das anteriores, mas com nomes diferentes.Existe claramente, uma falta de investimento na melhoria de eficiência energética nos seus equipamentos.Se a concorrência, mesmo com menor capacidade de hash, consegue trazer melhor eficiência energética, é só vantagens a longo prazo.Imagino que a evolução de um miner para o outro seja mínima mesmo com muito investimento. A evolução nesse momento deve estar sendo logarítmica. É o mesmo que está acontecendo com os smartphones hoje em dia, a cada geração o poder de processamento aumenta de maneira ínfima.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 04, 2023, 12:50:09 AM",
      "body": "Quote from: Loganota on November 03, 2023, 10:33:21 PMImagino que a evolução de um miner para o outro seja mínima mesmo com muito investimento. A evolução nesse momento deve estar sendo logarítmica. É o mesmo que está acontecendo com os smartphones hoje em dia, a cada geração o poder de processamento aumenta de maneira ínfima.Por isso mesmo tens de procurar encontrar outros elementos evolutivos.Neste caso era aumentar a eficiência energética, não a sua capacidade de hash.Podes dizer que esta geração de chips já esta no seu limite. Aceito.Então tens de criar outros elementos que façam o equipamento se destacar, e neste momento eu pelo menos não vejo esse destaque.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 06, 2023, 04:11:17 PM",
      "body": "Estava vendo uma notícia e lembre desse tópico.. A Riot comprou 66.560 ASICs da MicroBT nesta semana.. o modelo é o M66S.O negócio foi fechado em US$ 290 milhões (1,4 bilhão de reais) Fonte: https://twitter.com/RiotPlatforms/status/1731675595275190753",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "December 06, 2023, 05:34:34 PM",
      "body": "Quote from: sabotag3x on December 06, 2023, 04:11:17 PMEstava vendo uma notícia e lembre desse tópico.. A Riot comprou 66.560 ASICs da MicroBT nesta semana.. o modelo é o M66S.O negócio foi fechado em US$ 290 milhões (1,4 bilhão de reais) Fonte: https://twitter.com/RiotPlatforms/status/1731675595275190753Bem diferenciada essa whatsminer M66S, 310 THS consumindo 5500 watts   Parece a qua MicroBT vem crescendo muito e em breve pode ultrapassar a Bitmain no marketshare, vai ser interessante acompanhar essa disputa. Acredito que essa alta recente do mercado deve ser o suficiente para a Bitmain se recuperar e evitar uma quebra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}