{
  "id": "topic_5444396",
  "title": "OrtaDirek",
  "author": "OrtaDirek",
  "created_time": "March 10, 2023, 11:12:02 PM",
  "content": "merhaba ilk defa donanım cüzdanı kullanıyorumda hata yapmamak adına, cihazı ilk açtığımda bir qr code çıktı ve cihazın sıfır olup olmadığını doğrula dedi telefonla kodu tarattım safepalın sitesinde cihazdaki güvenlik kodunu yazdım ve cihazınız kaydoldu dedi.sonra yeni wallet oluşturdan kelimeleri sırasıyla yanında gelen kağıda yazdım.kelimelerin doğruluğu nasıl anlarım? yani yazdığım kelimeleri cihaza nasıl doğrulatırım?telefona eşleştirdim ve binance den 0001 btc deneme çekimi yaptım ama uygulamada erc20 beb20 segwit vs adresi seçemiyorsun sadece bitcoin yazıyor hangi zincirde olduğu yazmıyor.adresi binanceye yağıştırdığımda saedece bitcoin olan seçenekte hata vermedi bep20 vs hata verdi yanlış adres girdin diye.gönderdiğim btc mobil uygulamaya geldi ama cihazda btcyi göremedim, son olarak gelen btcyi binanceye geri gönderdim, cihazda history kısmında giden btc görünüyor ama gelen btcnin kaydı çıkmıyor.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444396",
  "comments": [
    {
      "author": "Myrina",
      "created_time": "March 11, 2023, 11:07:28 AM",
      "body": "Hayirli olsun.Kelimelerin dogrulugu icin kurulumda iki kere kontrol ettiriyordu diye hatirliyoru.Ben cuzdandan degil islemleri telefondan yapiyorum gelen btcnin kaydi safepalin kendisinde gorunmez bu alet direk offline bakiye takibini uygulamadan yapacakainiz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OrtaDirek",
      "created_time": "March 11, 2023, 08:56:01 PM",
      "body": "telefona kurduğum safepal uygulamasının bir zararı var mı? güvenlik açısından soruyorum her defasında sil baştan kur olmasın diye, donanım cüzdanıyla eşleştikten sonra işlemi uygulamadan yaptıktan sonra uygulamayı sileyim mi?birde şu soru aklıma takıldı diyelimki cihaz bozuldu veya kayboldu kaydettiğim kelimeler ile coinleri safepal uygulaması üzerinden geri alabiliyor muyum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mentalpanda",
      "created_time": "March 11, 2023, 09:13:00 PM",
      "body": "cihazın settings bölümünde anahtar kelime doğrulama bölümü var.btcde sağ üstte adres yazan kutuya basarsanız legacy veya segwit seçeneğini görürsünüz diğer coinler için zaten yanlarında parantez içinde hangi ağa ait oldukları yazıyor.safepal uygulaması hem metamask gibi hemde normal defi cüzdanı olarak kullanılabilir. donanım cüzdanını uygulamaya eklediğinizde silmenize gerek yok zaten onaylama işlemlerini qr kod ile yapıyorsunuz. hatta chrome uygulamasınıda kurarsanız soğuk cüzdanı uygulama aracılığıyla sıcak cüzdan gibi kullanma pratikliği sağlıyor. cihaz kaybolduğunuzda anahtar kelimeleri ister uygulamaya ister herhangi bir cüzdana girebilirsiniz bir fark yok.cihaz içerisindeki ekranda coinlerinizi veya history görmenin önemi yok zaten senkronize çalışmıyor çünkü offline bir cihaz. uygulamayı baz alın.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "March 11, 2023, 09:28:10 PM",
      "body": "Quote from: OrtaDirek on March 10, 2023, 11:12:02 PMmerhaba ilk defa donanım cüzdanı kullanıyorumda hata yapmamak adına, cihazı ilk açtığımda bir qr code çıktı ve cihazın sıfır olup olmadığını doğrula dedi telefonla kodu tarattım safepalın sitesinde cihazdaki güvenlik kodunu yazdım ve cihazınız kaydoldu dedi.Cihazınız orijinal.Quote from: OrtaDirek on March 10, 2023, 11:12:02 PMsonra yeni wallet oluşturdan kelimeleri sırasıyla yanında gelen kağıda yazdım.kelimelerin doğruluğu nasıl anlarım? yani yazdığım kelimeleri cihaza nasıl doğrulatırım?Cihazı sıfırlayıp aynı kelimeler ile yeniden kurulum gerçekleştirin. Eğer herhangi bir zincirde size verdiği adres öncekinin aynısı ise kaydettiğiniz seed key doğru demektir.Quote from: OrtaDirek on March 10, 2023, 11:12:02 PMtelefona eşleştirdim ve binance den 0001 btc deneme çekimi yaptım ama uygulamada erc20 beb20 segwit vs adresi seçemiyorsun sadece bitcoin yazıyor hangi zincirde olduğu yazmıyor.adresi binanceye yağıştırdığımda saedece bitcoin olan seçenekte hata vermedi bep20 vs hata verdi yanlış adres girdin diye.Adresin başladığı harf yada rakama bakarak anlayabilirsiniz.1 ile başlıyor ise legacy.3 ile başlıyor ise segwit.bc1 ile başlıyor ise native segwit.Quote from: OrtaDirek on March 10, 2023, 11:12:02 PMadresi binanceye yağıştırdığımda saedece bitcoin olan seçenekte hata vermedi bep20 vs hata verdi yanlış adres girdin diye.gönderdiğim btc mobil uygulamaya geldi ama cihazda btcyi göremedim, son olarak gelen btcyi binanceye geri gönderdim, cihazda history kısmında giden btc görünüyor ama gelen btcnin kaydı çıkmıyor.Bep20 destekli olan gerçek BTC değil wrapped btc. Bep20 cüzdan adresi yapısı 0x ile başlarken bitcoin için 1-3-bc1 seçenekleri karşınıza çıkar.BTC'yi mobil cihazda gördüğünüz sürece problem yok.Quote from: OrtaDirek on March 11, 2023, 08:56:01 PMtelefona kurduğum safepal uygulamasının bir zararı var mı? güvenlik açısından soruyorum her defasında sil baştan kur olmasın diye, donanım cüzdanıyla eşleştikten sonra işlemi uygulamadan yaptıktan sonra uygulamayı sileyim mi?birde şu soru aklıma takıldı diyelimki cihaz bozuldu veya kayboldu kaydettiğim kelimeler ile coinleri safepal uygulaması üzerinden geri alabiliyor muyum?Uygulamayı silmenize gerek yok. Uygulamanın gönderim için kendi içerisinde yetkisi yok, donanım cüzdandan fiziksel olarak onay vermediğiniz sürece problem yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "March 12, 2023, 03:47:00 AM",
      "body": "Hocam hala eth tarafında tek adres mi veriyor bazen başka adreslere ihtiyacım var anlayamadım gitti",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "March 12, 2023, 02:20:20 PM",
      "body": "Quote from: mandown on March 12, 2023, 03:47:00 AMHocam hala eth tarafında tek adres mi veriyor bazen başka adreslere ihtiyacım var anlayamadım gitti Hayır, o sorunu düzelttiler Sub Account oluşturarak kendi desteklediği path'de (m/44h/60h/0h) yeni adresler elde edebiliyorsunuz. Ancak soğuk cüzdanda çok fazla adrese ihtiyacım olmadığı için limiti var mı diye denemedim. Ekranın üst orta kısmında kendi belirlediğiniz cüzdan adına tıklayıp oradan cüzdan ekle seçeneğini kullanabilirsiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}