{
  "id": "topic_5450896",
  "title": "famososMuertos",
  "author": "famososMuertos",
  "created_time": "May 01, 2023, 09:21:46 PMLast edit: May 12, 2023, 04:41:24 PM by famososMuertos",
  "content": "-/Cómo participar, es muy fácil/-✓ Coloque su predicción para el día 18 de mayo.✓ Escriba su predicción en dólares. (USD)✓ Escriba como máximo, 144 caracteres y/o al menos una palabra que le apetezca decir.-/Reglas de la predicción del precio/-Condiciones simples a seguir, si no las cumple esta fuera de competencia.❉Haga su predicción antes del 13 de mayo.❉Es necesario que cualquier participante tenga su cuenta creada antes de marzo del año 2023.❉Debe haber ganado al menos un mérito y tener al menos 10 post. Debe cumplir las dos.❉Debe haber realizado al menos un post en este año 2023 en nuestra sección local y antes del 1ro de mayo.❉El ganador será determinado con el precio de cierre del día 18 de mayo y se utilizara CMC.❉Tendremos un único ganador. La predicción ganadora se tomara por debajo del precio de cierre (close) del día 18 de mayo.❉No use sus cuentas Alternativas, una predicción por usuario.❉El ganador toma el premio acumulado, por ahora 0.006BTC. 6mBTC❉Debe tener trust neutral de DT.¡Suerte Para Todos!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450896",
  "comments": [
    {
      "author": "famososMuertos",
      "created_time": "May 01, 2023, 09:22:08 PMLast edit: May 12, 2023, 04:15:40 AM by famososMuertos",
      "body": "Antes que nada entienda que aunque es un concurso, el objetivo principal es la celebración y la buena vibra, cualquiera puede participar si cumple con las normas o reglas establecidas, nos hemos extendido en el apartado preguntas dado que varios de nuestros usuarios puede que no estén familiarizados con este tipo de concurso.Posibles Preguntas que pueden surgir a:-/Reglas de la predicción del precio/-Condiciones simples a seguir, si no las cumple esta fuera de competencia.►P1:Quote from: Haga su predicción antes del 13 de mayo.Debes colocar en este hilo tu predicción como máximo el día 12 de mayo hasta las 23:59 GMT.►P2:Quote from: Debe haber ganado al menos un mérito y tener al menos 10 post. Debe cumplir las dosTengo =>10 post pero cer0 méritos NO puede participar y no olvide la fecha de cuenta creada antes del 2022.Tengo => 1 méritos y 9 post. NO puede participar y no olvide la fecha de cuenta creada antes del 2022.►P3:Quote from: El ganador será determinado con el precio de cierre del día 18 de mayo y se utilizara CMCCMC=https://coinmarketcap.com/currencies/bitcoin/historical-data/En el \"historial data\" de CMC se anuncian 4 precios: Open - High - Low - CloseVamos a usar para este concurso \"Close\" y como ejemplo podemos usar el precio de cierre (close) del día 30 de abril, que es $29.268,81. Que en nuestro caso será el del día 18 de mayo. El día 19 de mayo se estará anunciando al ganador.►P4:Quote from: Tendremos un único ganadorTenga en cuenta que si por casualidad, ¡difícil! pero si toma el mismo precio de otro usuario, el ganador es quien lo público primero (post). Revise las predicciones antes de publicar la suya.►P5:Quote from: La predicción ganadora se tomara por debajo del precio de cierre (close) del día 18 de mayo.El precio tomado como ejemplo es $29.268,81 el ganador es quien más se acerque por debajo, si su predicción es $29.268,82 su predicción ⓃⓄ califica para el premio, cualquier predicción por debajo es ganadora.Aclaración: se entiende las otra calificaciones por descarte, pero cualquier precio igual al precio de cierre se considera ganador.De igual manera si nadie solo si nadie, es obvio, pero si se da el caso que ninguna predicción está por debajo del precio de cierre, que es la condición ganadora, en ese caso, si y solo si ocurre lo mencionado, que no exista ninguna predicción por debajo del precio de cierre, se tomará como ganador, pero entiéndase bien que el precio por debajo prevalece siempre si alguien lo consigue.►P6:Quote from: El ganador toma el premio acumulado, por ahora 0.004BTC.El pago se hará el mismo 19 de mayo en una dirección que proporcione para tal fin. ¡O! cuando el ganador proporcione la información para hacer el pago correspondiente.►P7:Quote from: Escriba como máximo, 144 caracteres y/o al menos una palabra que le apetezca decirEjemplos:una palabra: Hola.+ de 1 palabras: Quiero Ganar! o Feliz Cumple Local Español. ►P8:El premio debe estar en su totalidad en la dirección abajo mostrada antes del 12 de mayo. Gracias a los aportes de Porfirii, Don Pedro Dinero, DdmrDdmr darxiaomi y famososMuertos, la misma contara con el monto de 0.005BTC + el fee (0.26818 mbtc) El responsable del escrow es famososMuertos (fM)Dirección:bc1q9q2hqlqamp8w72mvvfv52mtyu4kna2zcmxcuq6►P9:Quote from: Debe tener trust neutral de DT on May 02, 2023, 01:09:21 PM... debe tener, de forma neta, trust neutral de DT. Es decir, alguien podría tener dos feedbacks positivos y dos negativos de miembros DT. O tres positivos y uno negativo, pero el caso es que para participar la suma neta no sea negativa. ...Si tiene preguntas adicionales o desea hacer comentarios puede hacerlos en el hilo de discusión cumpleañero. ► Local Español (LE)◄¡Suerte Para Todos!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "May 01, 2023, 09:22:19 PMLast edit: May 12, 2023, 06:49:27 PM by famososMuertos",
      "body": "Predicciones $:32.91432.45730.60028.74328.14227.99927.00126.00925.000",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 02, 2023, 03:40:44 AM",
      "body": "Enhorabuena por la trabajado del hilo, compañero fM. La única duda que tengo es sobre el siguiente punto:Quote from: famososMuertos on May 01, 2023, 09:21:46 PM❉Debe haber realizado al menos un post en este año 2023 en nuestra sección local y antes del 1ro de mayo.Creo que es muy restrictivo este punto, si se trataba de abrir el juego a los del Norte. Creo que participaremos la docena que solemos escribir aquí, y luego se me ocurre un italiano y un portugués pero poca gente más que cumpla este requisito. Si se trataba de generar movimiento en nuestro foro local (no estoy seguro), este punto se tendría que modificar o eliminar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 02, 2023, 10:19:50 AM",
      "body": "Gracias por el trabajo de planificación y diseño/redacción famososMuertos.Ya he enviado mi parte para el bote, aunque tardará unas horas en llegar (el precio de las fees está inusualmente alto y, como no hay prisa hasta el 19 de mayo, $0.50 me ha parecido más que suficiente por el envío).Coincido con Don Pedro Dinero en que quizás esa norma es excesivamente restrictiva si queremos abrir el concurso a otros participantes del norte. Podríamos replantearnos también la norma de haber creado la cuenta antes de 2022, y fijar en su lugar 2023 como requisito. Teniendo en cuenta que tampoco somos tantos por aquí, y que lo importante es promover la participación. ¿Qué opinan?Por lo demás, me parecen muy bien ideadas las reglas, y la FAQ nº 7 me hizo reír.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MA40",
      "created_time": "May 02, 2023, 10:46:02 AM",
      "body": "Hola.Mi predicción: 28.743 US$.Mi frase: \"La ocasión la pintan calva\".Saludos y suerte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "May 02, 2023, 01:09:21 PM",
      "body": "No se si vale la pena cambiar las reglas ahora que tenemos una primera predicción, pero yo añadiría una: tener, de forma neta, trust neutral de DT. Es decir, alguien podría tener dos feedbacks positivos y dos negativos de miembros DT. O tres positivos y uno negativo, pero el caso es que para participar la suma neta no sea negativa. Si no se añade, queda abierta la puerta a que estafadores con feedback negativo puedan participar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 02, 2023, 03:39:41 PM",
      "body": "Quote from: famososMuertos on May 01, 2023, 09:21:46 PM<…>❉Debe haber realizado al menos un post en este año 2023 en nuestra sección local y antes del 1ro de mayo. <…>A mí no me parece mal bajo el punto de vista de que es el aniversario del foro local, y que menos que haber participado en él. La idea de abrirlo a todo el mundo es una alternativa que se apuntó en el hilo preparatorio, pero en mi opinión, el requisito de >=1 mérito y >=10 posts da pie a que pudiésemos potencialmente ver granjas de otras latitudes con cierta facilidad (por mucho que se indique que no se aceptan Alts). Claro que entonces se reduce el público objetivo potencial.Nota: El último bloque ha pasado a razón de 104 .. 1014 sat/vB. Esto de los Ordinal debería haberse parado ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 03, 2023, 01:38:56 PM",
      "body": "Quote from: DdmrDdmr on May 02, 2023, 03:39:41 PMQuote from: famososMuertos on May 01, 2023, 09:21:46 PM<…>❉Debe haber realizado al menos un post en este año 2023 en nuestra sección local y antes del 1ro de mayo. <…>A mí no me parece mal bajo el punto de vista de que es el aniversario del foro local, y que menos que haber participado en él. <...>Pensándolo así, tienes toda la razón. Y todavía seguirían pudiendo participar unas pocas estrellas invitadas del norte que han hecho su aparición en el foro local en lo que va de año que, aunque no son muchas, se lo habrían merecido.Quizá tú o fM tengáis más a mano las tablas de participación en el foro local, pero en lo que va de año, ¿cuántos miembros distintos han participado en nuestro board? ¿más de 50? Quizá podríamos mantener lo de haber participado en el foro local, pero ampliar un poco el margen temporal. Podemos valorarlo sobre la marcha, si algún miembro inactivo quisiera participar.Cambiando de tercio, no veo una norma que prohíba a los promotores del evento participar. ¿Se supone que podemos? es para no hacer el ridículo si lanzo una predicción",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 03, 2023, 02:27:00 PMLast edit: May 03, 2023, 03:29:26 PM by DdmrDdmr",
      "body": "Quote from: Porfirii on May 03, 2023, 01:38:56 PM<...>Esta es la lista de todos los que han posteado en nuestro foro local en lo que va de año, sin mirar más criterios:Code:1. DdmrDdmr [536]2. famososMuertos [253]3. Don Pedro Dinero [202]4. Porfirii [183]5. darxiaomi [179]6. Hispo [178]7. seoincorporation [111]8. Artemis3 [66]9. Cuenta Alternativa [46]10. d5000 [39]11. Silberman [36]12. zenaku [27]13. LUCKMCFLY [24]14. Finandy [16]15. franckuestein [14]16. Drawesome [13]17. airbin [13]18. MA40 [9]19. Elpeor00 [7]20. Catalina2827 [6]21. joker_josue [6]22. Wowakaw [5]23. miguelik [5]24. womanderful [5]25. TheChin0s [4]26. WillyAp [4]27. badbunnyCripto [4]28. blackpink105 [4]29. Bittothefuture [3]30. LuisCar [3]31. Wimex [3]32. delfastTions [3]33. pinger [3]34. ruben25581 [3]35. vane91 [3]36. ChiNgadOr [2]37. Cswap [2]38. DrChaos.eth [2]39. Lavey666 [2]40. MachineGam [2]41. Narla [2]42. Paynote [2]43. Shawshank [2]44. cygan [2]45. darbitmobilerecovery [2]46. mandias [2]47. mikeywith [2]48. #Badinflunce [1]49. ARCADIA-OG [1]50. Becassine [1]51. Benjaminsss [1]52. Caribbeancoin [1]53. Celia Eugenia Nunez [1]54. CerrajerosCoruna [1]55. Csmiami [1]56. EXMON [1]57. Ellahudsama [1]58. Ermintrudeee [1]59. Fionmb [1]60. GX00 [1]61. Isabella Garcia Jimenez [1]62. Jandrito39 [1]63. Javiermagno [1]64. Joramikyssa [1]65. JustEmilyR [1]66. Keonos1976 [1]67. Kriptoks [1]68. LochaJr [1]69. Lucasgabd [1]70. N30W_414 [1]71. NFTmetria [1]72. Rafamad435 [1]73. Royse777 [1]74. SinBad.io [1]75. SneyderApp [1]76. Tapit_bd [1]77. Thomasrive [1]78. Xylber [1]79. Zele365 [1]80. aleix [1]81. andyfibe [1]82. andyjvv [1]83. bitxordev [1]84. cryptomomo007 [1]85. cryptosolucion [1]86. fillippone [1]87. frjuste [1]88. gamer11 [1]89. ganandoonline [1]90. guid8 [1]91. hackbert [1]92. impresiones [1]93. irsada [1]94. javitapbit [1]95. m4kstep [1]96. madsenax [1]97. maxist23 [1]98. midiam1 [1]99. nareedyn [1]100. ogamibr [1]101. paddy_exchange [1]102. paxmao [1]103. pmosalma [1]104. proofofaddress [1]105. tuabogadomadrid [1]106. vinay_93 [1]107. walletrecovery [1]108. zigicoin [1]Datos derivados de ninjastic. Puestos a mirar los nombres, no me suena ni un tercio diría (podemos entrar en detalles, pero no es el objeto de este hilo).En lo relativo a la participación por parte de los sponsors, yo lo daba por hecho. No es que se pueda amañar ...Edit:Quote from: Don Pedro Dinero on May 03, 2023, 03:12:41 PM<...> Ahora espero a ver los datos del mes pasado, que estoy seguro que como mínimo fui segundo.Así es...:Spoiler (Abril 2023 LE):Code:1. famososMuertos [66]2. Don Pedro Dinero [65]3. Hispo [42]4. Porfirii [42]5. DdmrDdmr [37]6. darxiaomi [23]7. seoincorporation [19]8. Cuenta Alternativa [11]9. Drawesome [10]10. airbin [10]11. zenaku [10]12. Artemis3 [9]13. LUCKMCFLY [9]14. Silberman [8]15. d5000 [7]16. Finandy [4]17. badbunnyCripto [4]18. miguelik [3]19. ruben25581 [3]20. vane91 [3]21. ChiNgadOr [2]22. blackpink105 [2]23. ARCADIA-OG [1]24. Becassine [1]25. Caribbeancoin [1]26. Csmiami [1]27. Ellahudsama [1]28. Isabella Garcia Jimenez [1]29. Jandrito39 [1]30. Lucasgabd [1]31. LuisCar [1]32. MA40 [1]33. N30W_414 [1]34. TheChin0s [1]35. WillyAp [1]36. Wimex [1]37. aleix [1]38. frjuste [1]39. guid8 [1]40. pmosalma [1]41. womanderful [1]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 03, 2023, 03:12:41 PM",
      "body": "Quote from: Porfirii on May 03, 2023, 01:38:56 PMCambiando de tercio, no veo una norma que prohíba a los promotores del evento participar. ¿Se supone que podemos? es para no hacer el ridículo si lanzo una predicción Yo he estado dudando de hacerlo, pero no debería de estar prohibido habiendo varios promotores. Lo que no sería muy lógico es que una sola persona hiciera un giveaway de estos y él participara también a ver si le toca (normalmente son casinos para promocionarse y cosas así), pero siendo varios particulares podemos participar.Yo aún no se lo que haré.Quote from: DdmrDdmr on May 03, 2023, 02:27:00 PMEsta es la lista de todos los que han posteado en nuestro foro local en lo que va de año, sin mirar más criterios:Code:1. DdmrDdmr [536]2. famososMuertos [253]3. Don Pedro Dinero [202]Orgulloso de ver mi tercer puesto. Ahora espero a ver los datos del mes pasado, que estoy seguro que como mínimo fui segundo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Csmiami",
      "created_time": "May 03, 2023, 10:35:31 PM",
      "body": "Quote from: DdmrDdmr on May 03, 2023, 02:27:00 PM---Madre mia, se que ha sido un primer cuarto del año duro, pero no me esperaba haber caido tan en desgracia en lo que respecta a BCT...Quote from: DdmrDdmr on May 02, 2023, 03:39:41 PMNota: El último bloque ha pasado a razón de 104 .. 1014 sat/vB. Esto de los Ordinal debería haberse parado ...Ordi....¿qué? No por secuestrar este hilo celebrativo, pero cada vez entiendo menos lo que pasa por estas tierras.Quote from: Don Pedro Dinero on May 03, 2023, 03:12:41 PMYo he estado dudando de hacerlo, pero no debería de estar prohibido habiendo varios promotores. Lo que no sería muy lógico es que una sola persona hiciera un giveaway de estos y él participara también a ver si le toca (normalmente son casinos para promocionarse y cosas así), pero siendo varios particulares podemos participarIncluso siendo una rifa particular, que ahi es donde alguno podria levantar un poco las cejar, mientras el resto de normas se respeten, y la forma de ganar no pueda ser predecible/modificable... No veo que nadie fuera a poner pegas. Si sois capaces de realmente afectar al precio, os perdonaremos si haceis una prediccion muy a la alza y todos contentos (o eso espero).En cuento a la predicción: 32.457$¡Vamos a coger carrerilla para llegar a los 35.000 otra vez!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 04, 2023, 01:25:54 PM",
      "body": "Antes he mirado y todas las transacciones menos una, incluida la mía, se han confirmado ya. He visto que varios hemos enviado un extra también para la fee, que si de aquí allí las fees bajan, se puede acumular al bote.Habrá que editar el OP y el segundo post, compañero fM, poniendo la cantidad de 0.005 BTC en vez de 0.004 BTC. Y ya que estamos creo que deberíamos de figurar en el OP los sponsors: darxiaomi, DdmrDdmr, fM, Profirii y yo. 5 en total.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "May 04, 2023, 04:54:38 PM",
      "body": "Gracias a todos aquellos que se pasen por este hilo para dar su predicción, y un especial saludo a las dos primeras.Por favor, cualquier comentario adicional, sugerencia como lo indique en el p0st #2 puede hacerlo en el hilo:https://bitcointalk.org/index.php?topic=5445477.0No se había dicho, pero si puede seguir el esquema/formato (gracias):Code:Predicción: $ xxx Frase: \"...\"Ejemplo:Predicción: $ 123.456 Frase: \"No es necesario que las dos previas predicciones tengan que editarlo\".Suerte para todos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "May 04, 2023, 07:01:41 PM",
      "body": "Predicción: $ 30.600 Frase: \"No es más rico el que más Bitcoin tiene, sino el que menos satoshis necesita\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zenaku",
      "created_time": "May 04, 2023, 07:33:32 PM",
      "body": "Predicción: $ 32914Frase: \"Te caes te levantas, te caes te levantas, te caes te levantas.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "May 12, 2023, 04:00:12 AM",
      "body": "Predicción: $ 27.999Frase: \" no se trata de hacerlo llegar, se trata de hacerlo bajito y así no te dicen que eres un ordinario sino un bb\"Amigos, unas horas... Para bloquear el hilo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 12, 2023, 04:35:33 AM",
      "body": "Yo no tenía claro si participar, pues a veces hago donaciones y de haber habido un gran movimiento en el hilo, probablemente no lo hubiera hecho, considerando los fondos que aporté como una donación. Vamos a darle vidilla a esto:Predicción: $25.000 Frase: 'El mercado puede permanecer irracional más tiempo del que usted puede permanecer solvente. (John Maynard Keynes)'",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 12, 2023, 05:14:02 AM",
      "body": "Predicción: 26.009 $ Frase: \"El bueno: bajan los fees. El malo: baja bitcoin. El feo: MiCA\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "May 12, 2023, 08:45:34 AM",
      "body": "Predicción: 27001Frase: “Mas vale tarde que nunca.” Anónimo, supongo.No sé porque le perdí el hilo al aniversario y apenas hoy me estoy dando cuenta de que se eligió esta forma para celebrarlo, por suerte me di cuenta de ultima hora y pude mandar mi predicción.Me tomé la libertad de mandar una pequeña donación de ultima hora, afortunadamente se confirmó rápido gracias a que el numero de transacciones aun por confirmar en la mempool bajó un poco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}