{
  "id": "topic_5485102",
  "title": "pbies",
  "author": "pbies",
  "created_time": "February 14, 2024, 07:13:10 AMLast edit: February 14, 2024, 08:18:20 AM by pbies",
  "content": "Guys,if puzzles over 66 were found because of public keys available,what was the process to find the private keys when knowing the pubkeys?EDIT: what differs known public key and unknown for getting privkeys?Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5485102",
  "comments": [
    {
      "author": "BlackBoss_",
      "created_time": "February 14, 2024, 07:21:11 AM",
      "body": "Quote from: pbies on February 14, 2024, 07:13:10 AMif puzzles over 66 were found because of public keys available,what was the process to find the private keys when knowing the pubkeys?You can not find a private key from a public key just like can not find a public key from a public address.Private key > Public Key > Public address. Two steps are all one way, you can not do the reversed steps.Keys and addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pbies",
      "created_time": "February 14, 2024, 07:30:21 AMLast edit: February 14, 2024, 09:51:58 AM by pbies",
      "body": "Quote from: BlackBoss_ on February 14, 2024, 07:21:11 AMQuote from: pbies on February 14, 2024, 07:13:10 AMif puzzles over 66 were found because of public keys available,what was the process to find the private keys when knowing the pubkeys?You can not find a private key from a public key just like can not find a public key from a public address.Private key > Public Key > Public address. Two steps are all one way, you can not do the reversed steps.Keys and addresses.I know that.Question was different, your answer is off-topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "February 14, 2024, 10:39:02 AM",
      "body": "Quote from: pbies on February 14, 2024, 07:13:10 AMGuys,if puzzles over 66 were found because of public keys available,what was the process to find the private keys when knowing the pubkeys?EDIT: what differs known public key and unknown for getting privkeys?ThanksWhat are these puzzles you are refering to? I am not aware of puzzles like this, where you are given a public key and you need to derive the private key. If an attacker wanted to find a private key from the corresponding public key, what they would need to do would be to solve the ECDLP. Check this post for further info by o_e_l_e_o: https://bitcointalk.org/index.php?topic=5393030.msg63258028#msg63258028There is a very good tool discussed here: https://bitcointalk.org/index.php?topic=5244940.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "February 14, 2024, 11:52:10 AM",
      "body": "Quote from: pbies on February 14, 2024, 07:13:10 AMwhat was the process to find the private keys when knowing the pubkeys?As of today, there are two well-known algorithms for this process. Baby-step, giant-step, and Pollard’s rho.Quote from: pbies on February 14, 2024, 07:13:10 AMEDIT: what differs known public key and unknown for getting privkeys?In both BSGS and Pollard's rho, you need to perform operations on the elliptic curve, which requires to know the actual points involved. You can't run these algorithms based on the hash of the public key. And since both have time complexity O(sqrt(N)), you have an orders of magnitude advantage on working out private keys of known pubic keys. Quote from: BlackBoss_ on February 14, 2024, 07:21:11 AMYou can not find a private key from a public key just like can not find a public key from a public address.You can actually perform a reversal from public key to private by reversing the modular multiplications which produced the public key; it's just very computationally expensive, and considered infeasible for very long numbers like 256 bits. In mentioned puzzles, the puzzle makers have deliberately generated insecure keys, to encourage finders from attempting to break them. It's a smart way to know the progress in breaking the elliptic curve's security. Quote from: apogio on February 14, 2024, 10:39:02 AMWhat are these puzzles you are refering to?They're probably referring to these: https://bitcointalk.org/index.php?topic=5218972.0. Here's a good article for everyone interested in the details to read: https://andrea.corbellini.name/2015/06/08/elliptic-curve-cryptography-breaking-security-and-a-comparison-with-rsa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pbies",
      "created_time": "February 14, 2024, 12:32:04 PM",
      "body": "Quote from: apogio on February 14, 2024, 10:39:02 AMWhat are these puzzles you are refering to? I am not aware of puzzles like this, where you are given a public key and you need to derive the private key. https://privatekeys.pw/puzzles/bitcoin-puzzle-tx",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "February 14, 2024, 02:35:24 PM",
      "body": "@OP I think you got the best answer by BlackHatCoiner and a satisfactory answer by apogio. I suggest you to lock this thread if you're satisfied with the answers and if you want to know more than make a comment here by asking them. Because allowing this topic to be opened won't be helpful since you got your answers. I highly suggest you to lock the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}