{
  "id": "topic_5400862",
  "title": "Flyingjack123",
  "author": "Flyingjack123",
  "created_time": "May 31, 2022, 12:45:01 PM",
  "content": "Crypto increases customer reach, reduces transction costs, Protects customer data. Allow realtime financial controls which are not available  Moreover there are many ways to incorporate crypto in a company I believe for any company to move ahead with crypto based economy new age crypto managers who have skill set of technology and financial management are a need What skill set or courses do you believe a crypto manager needs to learn to become a new age crypto finance manager",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400862",
  "comments": [
    {
      "author": "mk4",
      "created_time": "May 31, 2022, 02:32:14 PM",
      "body": "No sane non-crypto company would have a \"crypto finance manager\". A typical non-crypto company's job is to grow the company's one way or another, not to speculate with cryptocurrencies (outside of BTC and other good assets for some hedging).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "May 31, 2022, 03:00:39 PM",
      "body": "There is no special request, crypto is just another form of currency and also educates users to manage their own finances in full. In addition to the basic financial management skills of a typical company, anyone who is also used to using crypto will be ready to become a financial manager of a modern crypto company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "May 31, 2022, 06:19:16 PM",
      "body": "Some companies may benefit from receiving some limited Consultancy work, perhaps (although accreditation might be an issue in the current environment).  But I doubt they'd need anyone in a full-time managerial position.  Crypto generally negates the requirement for middlemen, so it's hard to figure out why so many people think the answer to everything is to add more middlemen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 31, 2022, 06:26:32 PM",
      "body": "Show me some real life \"crypto finance manager\" job listings. Because what you are describing is pure fantasy, almost no serious company is interested in crypto, and those that are just hire some self-proclaimed \"blockchain specialist\". Or they go to a company like Blockstream.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 01, 2022, 11:12:32 AM",
      "body": "Quote from: Flyingjack123 on May 31, 2022, 12:45:01 PMCrypto increases customer reach, reduces transction costs, Protects customer data. Allow realtime financial controls which are not available  Moreover there are many ways to incorporate crypto in a company I believe for any company to move ahead with crypto based economy new age crypto managers who have skill set of technology and financial management are a need What skill set or courses do you believe a crypto manager needs to learn to become a new age crypto finance managerQuote from: hatshepsut93 on May 31, 2022, 06:26:32 PMShow me some real life \"crypto finance manager\" job listings. Because what you are describing is pure fantasy, almost no serious company is interested in crypto, and those that are just hire some self-proclaimed \"blockchain specialist\". Or they go to a company like Blockstream.I believe that if a company need any kind of crypto job, most of those will be related to security and payment solutions.For example, someone to implement btcpayserver in a website. Additionally,  he would take care of private keys and anything related to security.Much more technical and boring than what op described",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "June 01, 2022, 01:21:38 PM",
      "body": "Hearing a position attached crypto with \"manager\" on it sounds like those scammers that have been scattered in the social media. You'll see them on different comment sections and offers; send me this, I'll send you more back. Honestly, what most companies are wanting are those with experience and real knowledge towards their position so if it's related to finance management then the qualification shouldn't be different if it's a crypto company opening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "June 01, 2022, 01:51:30 PM",
      "body": "Well sometimes it varies on the reputation --this is the most important that the company looking for and of course, the experience that you have includes, skills and knowledge to do the job and the tasks. The cryptocurrency finance manager did not have required any, if you are skillful related to crypto, you are qualified for it and the last part is your reputation to able to hold the company's money and make sure it is safe and there is no fraud will happen. Perhaps the reason, is company owners need to know their staff by asking for personal details.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "June 01, 2022, 05:31:23 PM",
      "body": "Quote from: Flyingjack123 on May 31, 2022, 12:45:01 PMCrypto increases customer reach, reduces transction costs, Protects customer data. Allow realtime financial controls which are not available  Moreover there are many ways to incorporate crypto in a company Any company that uses crypto will find very easy and fast in terms transaction cost and the company's financial control as they will be free from third parties like banks and others while making any financial transaction.QuoteI believe for any company to move ahead with crypto based economy new age crypto managers who have skill set of technology and financial management are a need What skill set or courses do you believe a crypto manager needs to learn to become a new age crypto finance managerAll they need is a person with adequate knowledge about cryptocurrency privacy and general knowledge Bitcoin and Data management.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}