{
  "id": "topic_5450391",
  "title": "libert19",
  "author": "libert19",
  "created_time": "April 27, 2023, 02:55:35 PMLast edit: May 14, 2023, 03:09:09 PM by libert19",
  "content": "Wow such easy to copy signatures, much wow",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450391",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "April 27, 2023, 03:08:57 PM",
      "body": "Sounds easy right? But that would be a hell in backend making a js script for that i assume, knowing you need add identifier for every code tags in the content. I say it's possible but not worth the time, if its the only use case for creating that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "April 27, 2023, 03:09:53 PMLast edit: September 20, 2023, 03:30:02 PM by Coin_trader",
      "body": "Quote from: libert19 on April 27, 2023, 02:55:35 PMWow such easy to copy signatures, much wowThis is a good idea especially for mobile users like me that having a hard time selecting all the text inside the code. But since this is just a one time procedure in every campaign that I join, I just developed a way to easily copy it. Start copying the signature code from the bottom part up-to the word code: above outside the code box. It will automatically copy all the content inside plus the code: text. Just delete the code: text when you input the signature code on your signature space.This is how it’s done:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "April 27, 2023, 03:52:15 PM",
      "body": "This is something campaign managers can do by themselves. They often add all kinds of eye candy (images) to their thread, and an external link to a .txt file with the signature would be an easy addition.Then again, I can imagine they don't care: if you don't want to spend the few seconds it takes to copy the signature, you may not be the best candidate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 27, 2023, 03:57:47 PM",
      "body": "Quote from: PX-Z on April 27, 2023, 03:08:57 PMSounds easy right? But that would be a hell in backend making a js script for that i assume, knowing you need add identifier for every code tags in the content. I say it's possible but not worth the time, if its the only use case for creating that.I don't think it's something extremely complicated to implement, but there will be another javascript to load on the page that would only be useful in half a dozen scenarios. Would it be useful? Yes. Is there a need for that? I agree with you that there is no need.As @LoyceV commented, campaign managers solved this even easier with a txt file. But, back to the same: would it be useful? Perhaps. Is this implementation worth it? Probably not, few would use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "April 27, 2023, 05:03:12 PM",
      "body": "Quote from: Coin_trader on April 27, 2023, 03:09:53 PMThis is a good idea especially for mobile users like me that having a hard time selecting all the text inside the code. But since this is just a one time procedure in every campaign that I join, I just developed a way to easily copy it. When I was looking for a signature campaign I came across this problem.I spent a good few minutes trying to copy the signature text correctly and couldn't (seriously), I gave up and waited to get access to a PC to copy it correctly.I can't complain because I like the forum the way it is, this style of forum I am getting used to a long time ago and it is very easy to navigate, but the mobile part is really difficult, I don't even try to post on my phone anymore.But even in a computer, the field code is weird, the CTRL + A command doesn't work inside the box.Quote from: LoyceV on April 27, 2023, 03:52:15 PMThis is something campaign managers can do by themselves. They often add all kinds of eye candy (images) to their thread, and an external link to a .txt file with the signature would be an easy addition....It's a simple and good ideaDespite the difficulties it is usually a very rare action to copy the signature, users do it only once when they join the campaign or when there is an update.Let's summon some user here  @TryNinja, can you add a button to copy the content of a code field?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "April 27, 2023, 05:33:38 PM",
      "body": "Quote from: Coin_trader on April 27, 2023, 03:09:53 PMThis is a good idea especially for mobile users like me that having a hard time selecting all the text inside the code.Excuse me, but may I ask what system you use? I mean iOS or Android? I use an Android tablet all the time and I have no problem at all with highlighting and copying. You just highlight one word, then a popup appears where you can select \"Select All\". Press it, all that is in the window will be highlighted. That's all, you can copy. No problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "April 27, 2023, 05:53:55 PM",
      "body": "Quote from: libert19 on April 27, 2023, 02:55:35 PMWow such easy to copy signatures, much wowWow it's very useful tool which should be added to Bitcointalk to copy these signature codes. I am smart phone user and whenever i want to copy signature codes its copy whole page and some time i have to skip 3-4 times and then i succeed after boring copy method. If such kind of tool added than it will become much easier and significant to copy signature codes at once.In my mind Thier should be two way to implement these feature in btt. Firstly if by chance Theymos watchout this thread and find it useful then he will do own coding to add this which will be much better, easy and more professional. Second if someone add this feature using extension then Mobile users should use Kiwi or any extension supported browser to use this copy feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "April 27, 2023, 09:01:29 PM",
      "body": "Quote from: libert19 on April 27, 2023, 02:55:35 PMWow such easy to copy signatures, much wowGreat suggestions. As a member ranked user when yahoo62278 accepted me in the first campaign I partook (Gamdom), I had very big issues to wear signature that very night. Even till now, it still gives issues, what I do is to copy the whole codes for all ranks, to a notepad and then delete the unwanted parts.Quote from: PX-Z on April 27, 2023, 03:08:57 PMSounds easy right? But that would be a hell in backend making a js script for that i assume, knowing you need add identifier for every code tags in the content. I say it's possible but not worth the time, if its the only use case for creating that.For experienced people, I don't think it will be very difficult from backend. Maybe we have to invite powerGlove",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "April 27, 2023, 09:34:37 PM",
      "body": "Signature campaigns are not moderated by the forum like scam are not moderated here.I don't think it will be deployed by theymos. By limitations and difficulty with SMF forum software and his limited time to moderate the forum and code for the forum upgrade.Your proposal looks cool and convenient for forum users who want to join signature campaign but can not access computer when they want to copy the code.If you are on phone, don't copy it directly from a post, but click on quote and copy it. With quote, you can more easily to scroll up and down to cut the part you want to copy.It can be done with SMF patch or userscripts from forum community coders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Igebotz",
      "created_time": "April 27, 2023, 10:07:33 PM",
      "body": "Quote from: uchegod-21 on April 27, 2023, 09:01:29 PMFor experienced people, I don't think it will be very difficult from backend. Maybe we have to invite powerGlovePowerGlove is busy right now, so I doubt he'd be interested in this one, especially because the campaign manager could compile it into a text file and place it under each signature code for mobile users to easily copy.. there is already ignore thread button proposal he is also handling tooQuote from: SquirrelJulietGarden on April 27, 2023, 09:34:37 PMIf you are on phone, don't copy it directly from a post, but click on quote and copy it. With quote, you can more easily to scroll up and down to cut the part you want to copy.This is the way I use anytime I'm on my phone and need to modify my signature; it's much easier than highlighting and copying from the main post, but you still have to go through some tedious scrolling, especially if the Op has a lot of details on it. However, this is the best option for everyone who uses a mobile device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "April 27, 2023, 11:02:34 PM",
      "body": "Quote from: SquirrelJulietGarden on April 27, 2023, 09:34:37 PMIf you are on phone, don't copy it directly from a post, but click on quote and copy it. With quote, you can more easily to scroll up and down to cut the part you want to copy.I mostly find it difficult to copy signature from my smartphone, but anytime I want to copy it became too bulky for me to get the line I want to copy since my android phone is not that large enough for me and most of it are very tiny to view. I wait whenever I gets to my pc I turn on and apply code, but if that copy option could work fine with smartphone it will be nice then with pc users can manually just take like 5 to 10 second to apply code & avatar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "April 27, 2023, 11:14:25 PM",
      "body": "Quote from: libert19 on April 27, 2023, 02:55:35 PMWow such easy to copy signatures, much wowThis is a suggestion from your side . Right  Better write it clearly becasue when i saw your post, i immediately open one of the campaigns to see if this new feature is implemented but it was not the case.Quote from: Cryptomiles1 on April 27, 2023, 11:02:34 PMI mostly find it difficult to copy signature from my smartphone, but anytime I want to copy it became too bulky for me to get the line I want to copy since my android phone is not that large enough for me and most of it are very tiny to view. I wait whenever I gets to my pc I turn on and apply code, but if that copy option could work fine with smartphone it will be nice then with pc users can manually just take like 5 to 10 second to apply code & avatar.Copying the signature code manually may be difficult on the smartphone but it is very easy to copy signatures on the computer. You just need to select the right text (only code) by selecting the code from the top till the end by scrolling with the mouse and pressing the Ctrl+ C and then pasting it with Ctrl+V on the signature space. I don't think anyone should face any difficulty with this. Doing it once or twice makes you an expert on this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "April 27, 2023, 11:50:20 PM",
      "body": "This function may not be smooth and cool for Thymos to implement since is just a signature, but i believe if he founds it very useful he may decides. But i don't think this is a big deal because every member should just devote few moment of their time to apply code manually and straight up to their works. So if that is being applied how do go of the avatar do you still go manually to apply it or you needed an auto mechanism that will allow you wear it without going through manually?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 28, 2023, 12:03:43 AM",
      "body": "It is a task that takes 3 seconds for a person to perform, that requires a lot of modifications to be made in the forum.You do not join signature campaigns daily, and at the worst, you do that once a week or a month. The effort it takes to do it is less than 3 seconds per week or month, and the campaign manager can attach .txt link to facilitate the task, and therefore there is no real benefit for Copy button",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "April 28, 2023, 12:07:40 AMLast edit: May 13, 2023, 07:02:32 AM by TryNinja",
      "body": "In the meanwhile... QuoteUse it with Tampermonkey, ViolentMonkey, etc...Code:// ==UserScript==// @name         Copy Code to Clipboard// @version      0.1// @description  Click the codeheader to copy the content to your clipboard// @author       TryNinja// @match        https://bitcointalk.org/*// @icon         https://www.google.com/s2/favicons?sz=64&domain=bitcointalk.org// ==/UserScript==(function() {      'use strict';        const codeheaders = document.querySelectorAll('.codeheader');        const copyCode = id => {          const header = document.querySelector(`.${id}`);          const copyBtn = document.querySelector(`.${id} > button`);          const code = header.nextElementSibling;          navigator.clipboard.writeText(code.innerText).then(() => {              copyBtn.textContent = 'Code: (copied!)';          });      }        for (const codeheader of codeheaders) {          const rand = Math.floor(Math.random() * 10e6);          const id = `code-${rand}`;          codeheader.classList.add(id);          codeheader.innerHTML = `<button type=\"button\" style=\"border: 0; background: none; color: rgb(136, 169, 195); font-weight: bold;\">Code: (click to copy)</button>`;          const copyBtn = document.querySelector(`.${id} > button`);          copyBtn.addEventListener('click', () => copyCode(id));      }  })();",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "April 28, 2023, 02:27:30 AM",
      "body": "Quote from: TryNinja on April 28, 2023, 12:07:40 AMIn the meanwhile... Welcome, you have many contributions in userscripts, bots for the forum.I counted 5 in total in my List of Bitcointalk.org Userscripts/ Add-ons / SMF patches. Please inform me if I miss any of your userscripts, bots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "April 28, 2023, 03:34:24 AMLast edit: May 14, 2023, 03:08:58 PM by libert19",
      "body": "Quote from: light_warrior on April 27, 2023, 05:33:38 PMQuote from: Coin_trader on April 27, 2023, 03:09:53 PMThis is a good idea especially for mobile users like me that having a hard time selecting all the text inside the code.Excuse me, but may I ask what system you use? I mean iOS or Android? I use an Android tablet all the time and I have no problem at all with highlighting and copying. You just highlight one word, then a popup appears where you can select \"Select All\". Press it, all that is in the window will be highlighted. That's all, you can copy. No problem.I use android phone, when I click 'select all', whole thread gets highlighted. What browser do you use? Quote from: virasog on April 27, 2023, 11:14:25 PMThis is a suggestion from your side . Right  Better write it clearly becasue when i saw your post, i immediately open one of the campaigns to see if this new feature is implemented but it was not the case.Wow, feeling really proud of my edit right now  Quote from: Adbitco on April 27, 2023, 11:50:20 PMThis function may not be smooth and cool for Thymos to implement since is just a signature, but i believe if he founds it very useful he may decides. But i don't think this is a big deal because every member should just devote few moment of their time to apply code manually and straight up to their works. So if that is being applied how do go of the avatar do you still go manually to apply it or you needed an auto mechanism that will allow you wear it without going through manually? Avatar is easy to do, signatures are annoying on mobile and this idea popped up in my mind so I created the post. I could care less whether this gets implemented or not, some of you appear to take these threads seriously than intended. Quote from: TryNinja on April 28, 2023, 12:07:40 AMIn the meanwhile... QuoteBeauty! Works fine on android!! I use Lemur, any extension supported browser should work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "April 28, 2023, 09:01:19 AM",
      "body": "Quote from: libert19 on April 28, 2023, 03:34:24 AMQuote from: light_warrior on April 27, 2023, 05:33:38 PMQuote from: Coin_trader on April 27, 2023, 03:09:53 PMThis is a good idea especially for mobile users like me that having a hard time selecting all the text inside the code.Excuse me, but may I ask what system you use? I mean iOS or Android? I use an Android tablet all the time and I have no problem at all with highlighting and copying. You just highlight one word, then a popup appears where you can select \"Select All\". Press it, all that is in the window will be highlighted. That's all, you can copy. No problem.I use android phone, when I click 'select all', whole thread gets highlighted. What browser do you use?Yes, you're right, I tried to highlight the contents of the window and it didn't work. For some reason the entire page is highlighted. Strange, maybe the highlighting behaves differently in a differently designed window? I have several browsers and the same thing happens in all of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "April 28, 2023, 03:26:49 PM",
      "body": "Quote from: light_warrior on April 27, 2023, 05:33:38 PMQuote from: Coin_trader on April 27, 2023, 03:09:53 PMThis is a good idea especially for mobile users like me that having a hard time selecting all the text inside the code.Excuse me, but may I ask what system you use? I mean iOS or Android? I use an Android tablet all the time and I have no problem at all with highlighting and copying. You just highlight one word, then a popup appears where you can select \"Select All\". Press it, all that is in the window will be highlighted. That's all, you can copy. No problem.Hmmm. I’m using both an Android and IOS since I became here in the forum and this problem on copying signature code is in there. I wonder how can you select all the signature code without copying the whole text on the thread. The code command doesn’t separate the signature code inside to all the text outside so using a select all when you highlighted one word on the signature code will not gonna work.If this is working then the OP probably won’t create this thread and I will be happy but this problem is still my struggle because I just try it on all of my handheld device without a good result.Can you provide screen record on how you do this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}