{
  "id": "topic_5406880",
  "title": "mx12.levins",
  "author": "mx12.levins",
  "created_time": "July 19, 2022, 05:21:59 PMLast edit: December 22, 2023, 03:38:14 PM by mx12.levins",
  "content": "Hello Bitcointalk community member and Bitcoin art collectorI am an artist who has been creating bitcoin art since 2017. My latest creation, \"Sound Money for Freedom,\" speaks for itself. Take a look: The price for this piece is BTC= + US $65 for shipping to the US + EU $18 for shipping to the EU.Payment address: 3Lsy9r9CUf8MDVVAM6gb79urTECxvTFBKkCollectors Edition 12 of 12SOUND MONEY FOR FREEDOM1. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE2. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE3. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE4. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE5. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE6. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE7. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE8. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE9. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE10. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE11. - “SOUND MONEY FOR FREEDOM” --- AVAILABLE12. - “SOUND MONEY FOR FREEDOM” --- AVAILABLEThis is a limited edition of 12, with #12/12 still available. The artwork is in size 17x25 inches (44.6x64.6cm) acrylic glass and includes a certificate of authenticity with all relevant information about the piece, as well as a Verisart time-stamp on the Bitcoin blockchain.Thank you to the supportive Bitcointalk community for your continued support. We are strong together!  ———————Feel Free to visit Mx12.Levins Bitcoin Art Threadhttps://bitcointalk.org/index.php?topic=5362071.0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406880",
  "comments": [
    {
      "author": "mx12.levins",
      "created_time": "November 06, 2022, 10:08:51 PM",
      "body": "I was watching this artwork. lots of thoughts. Bitcoin is arguably the soundest money we have right now. Bitcoin is sound money. Sound money in a digital age. BTC Maybe there should be a special day, like celebration, festival. Where exactly will be noted \"Sound Money\" day. Just a thought. When the bull market comes, I think these artworks will be sold out quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "January 06, 2023, 09:12:55 PM",
      "body": "As a collector of bitcoin art, I believe that having these pieces around me not only brings beauty and meaning to my surroundings, but also serves as a reminder of the values that bitcoin represents. The concept of \"sound money\" is something that is often overlooked in today's world of fiat currency, but it is an incredibly important aspect of a free and fair economy. By purchasing this artwork, you are not only supporting the artist, but also making a statement about the importance of financial freedom and the role that bitcoin can play in achieving it. Plus, with only 12 available and a time-stamped certificate of authenticity on the blockchain, this piece is sure to be a valuable addition to any collection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "June 04, 2023, 09:41:22 AM",
      "body": "These bitcoin art pieces hold immense value, both aesthetically and symbolically. They represent the power of sound money and financial freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "December 21, 2023, 07:45:45 PM",
      "body": "I am back with this artwork, back in this space where I stand alone with my created artwork. I often ask myself how this artwork makes me feel and where is the right place to hang it up. This is one of the favorite artworks, many people have pointed it out as their favorite. This artwork serves as a reminder for me, reminding us why we are here and fighting in this peaceful revolution. We are here to choose people's money, take a step forward, and make this a peaceful revolution. We are here to give power back to the people and live financially free—for financial freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "January 06, 2024, 09:28:49 PM",
      "body": "In the last years of my creative process, this artwork was my attempt to step into the Bitcoin propaganda art. In 2024, I plan to create another one with a new feature, where the artwork will be possible to load with Bitcoin, and to retrieve those bitcoins, you will need to destroy the artwork itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "January 07, 2024, 12:13:20 AM",
      "body": "Quote from: mx12.levins on January 06, 2024, 09:28:49 PMIn the last years of my creative process, this artwork was my attempt to step into the Bitcoin propaganda art. In 2024, I plan to create another one with a new feature, where the artwork will be possible to load with Bitcoin, and to retrieve those bitcoins, you will need to destroy the artwork itself.That's awesome... but will it be optional or required? 🤷‍♂️Will pm you soon. been very busy sorry!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mx12.levins",
      "created_time": "January 07, 2024, 01:14:24 PM",
      "body": "Quote from: owlcatz on January 07, 2024, 12:13:20 AMQuote from: mx12.levins on January 06, 2024, 09:28:49 PMIn the last years of my creative process, this artwork was my attempt to step into the Bitcoin propaganda art. In 2024, I plan to create another one with a new feature, where the artwork will be possible to load with Bitcoin, and to retrieve those bitcoins, you will need to destroy the artwork itself.That's awesome... but will it be optional or required? 🤷‍♂️Will pm you soon. been very busy sorry! The loadable card will be glued to the artwork, and guess what? You don't need to load it, you can keep it unloaded too – that's totally okay! 😄 But here's the twist, it's a bit different from what other collectible creators are doing in this space. Think of it like an Opendime, but way cooler.Firstly, there's no trust involved. You don't have to trust me with the private keys or worry about how I deleted them, and all that jazz. The collector can 'scan' the card and check out the content. If they want to recover the private key, they'll have to remove the card reader to grab those ownership rights. It's all thanks to the 'dual interface' and the cool ownership functionality on the NFC interface.Here's a quick example:It's a Satodime card loaded with some coins.The ownership right is NOT RELEASED.Whoever scans the card can only see the public info (the vaults, the deposit address), but they CAN'T unseal a slot. The only way to grab those coins is to plug the card into a chip card reader. 🚀Take care, my friend, and don't forget to enjoy life! Can't wait to catch up with you. Your message will brighten my busy day as well!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}