{
  "id": "topic_5440489",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "February 19, 2023, 11:37:24 PM",
  "content": "QuoteCardano (ADA) continued to gain this week after a brief pullback in early February. In the past 72 hours, the cryptocurrency surged over  17% to tap $0.41 amid a market-wide lift-off before recoiling on Sunday. At press time, ADA was exchanging hands at $0.40, down 0.77% in the past 24 hours, according to CoinMarketCap data.ADA’s attractive price growth can be traced to several developments around Cardano’s ecosystem. According to a report by crypto research firm CryptoCompare, the Total Value Locked (TVL) on the Cardano blockchain rose 49.9% in January, reaching levels last seen in August 2022. This growth was led by decentralized protocols, with lending protocols such as Meld and Indigo growing by over 48% and 76%, respectively. At the time of reporting, Cardano’s TVL sat at about $126M, as seen on DefiLama, showing that growth continued in the first half of February.The report also highlighted Cardano’s price growth in January, stating that “this was the best-performing month for the asset since August 2021.” The No. 7 cryptocurrency by market cap benefited from a market-wide crypto lift-off last month which saw its price recover by just over 70% from a record bottom of $0.25. Cardano’s attractive price action was accompanied by a spike in trading activity, with volumes on centralized exchanges rising roughly 158% to $9.87B.“This was the first increase in trading volume for the asset in thirteen months, a much-needed rebound after hitting the lowest monthly trading volume since October 2020 in December 2022,” said the firmEarlier this month, the much-awaited Djed stablecoin went live on the Cardano blockchain, sparking a wave of excitement for the community. Barely two weeks after launch, the so-called overcollateralized stablecoin has garnered over 31 million Cardano (ADA) coins as backing. As of Feb 16, there were 31,200,698.37 ADA in its base reserves, accounting for a 514% collateral ratio. Furthermore, the market capitalization of Djed had increased from $1.7M at launch to $2.17M  at press time, suggesting some adoption of the pegged asset.During a Twitter Spaces session on Tuesday, Binance CEO Changpeng Zhao noted that the crypto industry would likely “look for other options” as regulators tighten the nose around stablecoins. This suggests that non-dollar-backed stablecoins such as Djed and other algorithmic stablecoins may begin to emerge, propelling the entire crypto industry towards complete decentralization. https://zycrypto.com/cardano-ada-sees-immense-price-bump-in-18-months-as-ecosystem-grows-exponentially/....Interesting.QuoteDuring a Twitter Spaces session on Tuesday, Binance CEO Changpeng Zhao noted that the crypto industry would likely “look for other options” as regulators tighten the noose around stablecoins. This suggests that non-dollar-backed stablecoins such as Djed and other algorithmic stablecoins may begin to emerge, propelling the entire crypto industry towards complete decentralization. Might we soon see a rise of non US dollar backed stablecoins as Changpeng Zhao believes?.QuoteEarlier this month, the much-awaited Djed stablecoin went live on the Cardano blockchain, sparking a wave of excitement for the community. Barely two weeks after launch, the so-called overcollateralized stablecoin has garnered over 31 million Cardano (ADA) coins as backing.In our current era of high inflation, mounting debt and lingering market fears. Is there really such a thing as assets which are \"overcollateralized\"?The term \"overcollateralized\" is associated with robustness and stability. Both of which are key elements people of the world are searching for atm. Can we really have too much of that in an era where inflation is a concern?Cardano appears to be one of the largest gainers under the recent BTC uptrend in terms of overall percentage gains. Perhaps this is an alt worth looking into?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440489",
  "comments": [
    {
      "author": "el kaka22",
      "created_time": "February 20, 2023, 02:53:50 PM",
      "body": "ADA has always been a \"growing\" coin, it is not the biggest or best coin, neither at second position to rival ethereum, it's not there. However, one thing we can say about ADA is that it never stops, while you may not know what is developed in other coins and projects, you know that there is always something cooking in ADA.I used to own a ton of it, but I gave up and sold most of it and bought btc and eth with it, because even though it is growing constantly, doesn't mean it's great, and that's why I never felt at ease about it. But nevertheless, it is something that I could support psychologically and be rooting for it to have an amazing future because of all the hard work they put into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "February 20, 2023, 03:44:51 PM",
      "body": "One of the few things ADA enthusiasts brag is that they don't have to worry about future SEC investigation since they never opened token sale to US investors. It's unlikely to be labeled as security so that's probably one reason why investors and Djed supporters are confident about Cardano.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "February 20, 2023, 04:43:15 PM",
      "body": "Quote from: el kaka22 on February 20, 2023, 02:53:50 PMADA has always been a \"growing\" coin, it is not the biggest or best coin, neither at second position to rival ethereum, it's not there. However, one thing we can say about ADA is that it never stops, while you may not know what is developed in other coins and projects, you know that there is always something cooking in ADA.I used to own a ton of it, but I gave up and sold most of it and bought btc and eth with it, because even though it is growing constantly, doesn't mean it's great, and that's why I never felt at ease about it. But nevertheless, it is something that I could support psychologically and be rooting for it to have an amazing future because of all the hard work they put into it.Charles Hoskinson he has a very good thoroughness and vision for the progress of Cardano so that what he created and developed to stablecoins lately he has calculated well, we must also remember that Hoskinson is one of the founders of the ethereum network.But maybe you will be interested again in ADA to take some profits in the bullish phase of this cycle considering the development in ADA is very exponential and the price today is still very cheap $0.4 putting in some money might not be a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mich",
      "created_time": "May 21, 2023, 04:08:06 AM",
      "body": "'Bullish' news for Cardano. Now there is 400 Million ADA locked into the Cardano Defi ecosystem.  Djed stablecoin has $13.6 Million locked in.It is close to $150 Million.  https://www.binance.com/en/feed/post/542828",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 21, 2023, 11:21:07 AM",
      "body": "I owned a lot of ADA earlier but now my portfolio is empty, I was expecting a big growth in the price of ADA over the last period but so far I see slow growth.But I expect that there is still time to collect ADA because I expect it to grow significantly in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "May 21, 2023, 07:18:12 PM",
      "body": "I believe this is the beginning of the end for Cardano, it just doesn't work, it is not just Cardano even all its ecosystems, I remember Ardana is one of the most hyped exchanges on the blockchain it is more or less a dead project now and there are many like this, just like project like Prime coin and prime coin died natural death, I believe people won't be foolish enough to still continue to bag holding these tokens, this bull run we need new working tokens to displaced all the overvalued tokens that have failed to deliver any substance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 21, 2023, 07:31:53 PM",
      "body": "Quote from: jacafbiz on May 21, 2023, 07:18:12 PMI believe this is the beginning of the end for Cardano, it just doesn't work, it is not just Cardano even all its ecosystems, I remember Ardana is one of the most hyped exchanges on the blockchain it is more or less a dead project now and there are many like this, just like project like Prime coin and prime coin died natural death, I believe people won't be foolish enough to still continue to bag holding these tokens, this bull run we need new working tokens to displaced all the overvalued tokens that have failed to deliver any substanceNot really the end of the project. They are just not making the investors happy, it feels like there is a need for 3rd party platform to initiate ICOs in ADA. And without the easy migration system for ERC tokens to move to ADA, it is not somehow getting more attention. The token may stay above the rank but its price is sinking deeper. The holders are not making money, especially the ones with just a few thousand of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "May 22, 2023, 12:17:05 AM",
      "body": "Quote from: jacafbiz on May 21, 2023, 07:18:12 PMI believe this is the beginning of the end for Cardano, it just doesn't work, it is not just Cardano even all its ecosystems, I remember Ardana is one of the most hyped exchanges on the blockchain it is more or less a dead project now and there are many like this, just like project like Prime coin and prime coin died natural death, I believe people won't be foolish enough to still continue to bag holding these tokens, this bull run we need new working tokens to displaced all the overvalued tokens that have failed to deliver any substanceit might just become yet other coin like litecoin in which not really garnering all the attention and innovation but could still have quite high market capitalization and also trading volume which is fine.or even more likely to somewhat resemble tron, in which was glorified in the past yet only remnant of the past still exists yet still widely used for anticipating ethereum massive gas fee.ADA in this case, despite the growth of its ecosystem, doesn't necessarily it will always thrive, that's the thing with most of smart contract coin nowadays, the newer ones always gets the market share of the old ones.it might be very well the case with ADA since i've seen this coin rather stuck, much like the other smart contract coin that gets overshadowed by the presence of L2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "May 22, 2023, 04:20:51 AM",
      "body": "Cardano (ADA) is a competitor to Ethereum in terms of its utility as a smart contract platform, where developers build decentralized applications (DApps) on the network. One of them is in the field of decentralized finance (DeFi).Because of that I think Cardano is still my favorite coin because I have seen the progress Cardano has shown, showing very good results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "May 22, 2023, 04:19:21 PM",
      "body": "So is the big thing behind the pump Djed stablecoin? I feel like i am missing some point here as it's backed by ADA coins. I mean what could go wrong? I think this is worst idea ever that might make sense when ada is stable but let's say the price crashed. How much crash can it handle before it's going to unpeg in epic way?I am not an expert in this field but common sense and history itself tells you a story. I mean FTT were used in FTX reserves. Using ADA in Djed reserves is going to be different how?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Halime Anatolia",
      "created_time": "May 23, 2023, 05:42:18 AM",
      "body": "Quote from: o48o on May 22, 2023, 04:19:21 PMSo is the big thing behind the pump Djed stablecoin? I feel like i am missing some point here as it's backed by ADA coins. I mean what could go wrong? I think this is worst idea ever that might make sense when ada is stable but let's say the price crashed. How much crash can it handle before it's going to unpeg in epic way?I am not an expert in this field but common sense and history itself tells you a story. I mean FTT were used in FTX reserves. Using ADA in Djed reserves is going to be different how?In that sense the design of the Djed stablecoin is not much different from the stability mechanisms used by other stablecoins, such as Tether (USDT) or USD Coin (USDC) which have managed to maintain their peg to the US dollar despite market fluctuations despite being completely immune to risk.One more thing, about the comparison using FTT in FTX reserves may have different risk management features and strategies. I think that leveraging ADA in the Djed reserve will likely involve a comprehensive assessment of potential risks and implementation of specific measures for the Cardano ecosystem going forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}