{
  "id": "topic_5399533",
  "title": "325btc",
  "author": "325btc",
  "created_time": "May 20, 2022, 06:23:33 PM",
  "content": "Plan to solve Create usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399533",
  "comments": [
    {
      "author": "DrBeer",
      "created_time": "May 20, 2022, 06:43:49 PM",
      "body": "Quote from: 325btc on May 20, 2022, 06:23:33 PMPlan to solve Create usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money I apologize in advance, but most likely you are not familiar with how the economy, the financial system works. And why, for example, your state, do not print new \"anti-crisis dollars\", for example 5.600.900.999.999.999, equate them to the US dollar, and distribute to the whole world, and save it? Or can't you save? You understand that you won’t save it, because others could already do this, but they didn’t ... The bottom line is that printing papers that are not secured by assets, resources, position, (many more indicators), pieces of paper, does not give them any real value. If you have a powerful color printer - come up with your own currency, print 1 million of this currency to all residents of your city, distribute it, declare that each unit of this currency is equal to, for example, 1 gram of gold, and create a city of millionaires!  But you understand - it will not work. No, it will be fun, and even someone will sell you ice cream for a dollar in your name, but it will all end there ... Because your currency, in reality, has nothing worth behind it except your work ....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "May 20, 2022, 06:55:25 PM",
      "body": "Quote from: 325btc on May 20, 2022, 06:23:33 PMPlan to solve Create usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money This is the best plan to keep hungry people busy. Make a new shitcoin, call it EURO USD GOLD to make sure you didn't miss anything important and give it to everybody. Best is to ask them also do some work for you in exchange (to keep them busy, remember?).This new coin will be totally worthless, since I don't expect you have the billions of billions (or tons of gold) to back it and you can give all the APY you want (because 0 multiplied with everything you want it still 0).The only flaw is that since it's worthless, the exchanges will most probably not accept to trade it, since they want actual profit.And yes, everybody will be rich, at least in their dreams.Sorry, unless you are a rich country's government, this won't work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "May 20, 2022, 07:53:05 PM",
      "body": "Quote from: 325btc on May 20, 2022, 06:23:33 PMPlan to solve Create usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money this is not a solution to poverty, this will be the root of mass fraud...creating more stable coins will only destroy the crypto ecosystem, just see what happens when UST Luna loses liquidity, then it becomes a shit asset. don't create more shit assets/cryptocurrency, only trust trusted assets like bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "May 20, 2022, 08:53:20 PM",
      "body": "Quote from: 325btc on May 20, 2022, 06:23:33 PMPlan to solve Create usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money A new currency doesn't solve any problems at all. Currency is just a mechanism of storing value and exchanging it between two people. You seem to put a lot of content out into the forums but have a very weak grasp of how economics actually works in practice. People end up in poverty for all sorts of reasons, but arguably the best way to solve it is providing education and having a stable form of governance within the country. That requires all sorts of factors like an independent judiciary, strong institutions that do not bend to political pressure, a solid legal framework and all these things can take many decades, if not centuries, to formulate. Printing money usually only helps consolidate more of it with the very richest, who have the maximum ability to take advantage in times of plenty versus the poorest who need to spend to survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajochems",
      "created_time": "May 20, 2022, 08:59:40 PMLast edit: May 23, 2022, 03:36:55 AM by ajochems",
      "body": "Most of the stable coins, give the investors with certain amount as a profit at every points. For this ionic reasons, this coin was seems to be the one of the best coin,it had a potential to increase the profit percentage with 100 or 200x from the invested price. This surely increased the money flow and reduced the poverty .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "May 20, 2022, 09:01:29 PM",
      "body": "Increasing production to excess does not reduce poverty. why this stablecoin should have value? how it's backed this value? Airdropping new cash would not solve anything.Wages would not grow in proportion and there would be absurd prices that would make basic necessities practically unavailable for the majority of people.in the Weimar Republic they did something like this ... they printed coin upon coin... But there are other examples in the modern era such as in venezuela.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 20, 2022, 09:02:40 PM",
      "body": "Quote from: NeuroticFish on May 20, 2022, 06:55:25 PMQuote from: 325btc on May 20, 2022, 06:23:33 PMPlan to solve Create usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money This is the best plan to keep hungry people busy. Make a new shitcoin, call it EURO USD GOLD to make sure you didn't miss anything important and give it to everybody. Best is to ask them also do some work for you in exchange (to keep them busy, remember?).This new coin will be totally worthless, since I don't expect you have the billions of billions (or tons of gold) to back it and you can give all the APY you want (because 0 multiplied with everything you want it still 0).The only flaw is that since it's worthless, the exchanges will most probably not accept to trade it, since they want actual profit.And yes, everybody will be rich, at least in their dreams.Sorry, unless you are a rich country's government, this won't work.It is sad see that Satoshi's invention to create an antinflationary money is now being used to print money at will.People think that printing money is the solution. It is not. It generates inflation.And in this case suggested by OP, you are just printing a useless shitcoin which is not even money because it has no value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "May 20, 2022, 09:24:46 PM",
      "body": "Quote from: 325btc on May 20, 2022, 06:23:33 PMPlan to solve Create usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money Have you heard about the stablecoin that crashed recently? That coin was able to ruin many lives and how is that can solve the poverty? You know, cryptocurrency can’t solve that and even the government can’t solve that especially if those people don’t want to learn in the first place. Poverty will always be part of the country, and if you are on this level better to start thinking for your future and learn things now, I believe its not too late yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "May 20, 2022, 09:34:51 PM",
      "body": "OP, how in the world did you earn that single merit I see under your avatar?  That had to have been a fat-finger fuckup on paxmao's part, because every thread you start is as if some being from another galaxy where economics don't exist just happened to drop in on the forum and ensconced itself in the Economics section.Needless to say, I don't even have a counterargument to present except to once again plead with you to stop starting all of these threads with your multiple alt accounts.  Either you're trolling or (much worse) you really think ideas like airdropping some stablecoin created out of thin air to everyone in the world will eradicate poverty.  Believe me, if that plan had even a remote chance of working someone in academia or government would have thought of it about 5 minutes after the creation of the first stablecoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "May 20, 2022, 09:42:39 PM",
      "body": "Poverty is a problem since them, a lot of new presidents already came on every country and yet there’s still poverty and seriously in some country it become more worse every year. Stable coin is not the solution, because if its the solution then why Gold still not able to help many even before the time of Bitcoin? Good governance, no corrupt politicians and good programs can be a big game changer and that poverty level can be improve. I wonder if these kind of government still exist? Because in my country corruptions are getting more worst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptock",
      "created_time": "May 20, 2022, 10:18:10 PM",
      "body": "Quote from: NeuroticFish on May 20, 2022, 06:55:25 PMQuote from: 325btc on May 20, 2022, 06:23:33 PMPlan to solve Create usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money This is the best plan to keep hungry people busy. Make a new shitcoin, call it EURO USD GOLD to make sure you didn't miss anything important and give it to everybody. Best is to ask them also do some work for you in exchange (to keep them busy, remember?).This new coin will be totally worthless, since I don't expect you have the billions of billions (or tons of gold) to back it and you can give all the APY you want (because 0 multiplied with everything you want it still 0).The only flaw is that since it's worthless, the exchanges will most probably not accept to trade it, since they want actual profit.And yes, everybody will be rich, at least in their dreams.Sorry, unless you are a rich country's government, this won't work.Lol - that is why you are legendary. haha - some plans look good in Euphoria - they won't be implemented in the real world. But I like the idea of airdrop. Wish this could happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "May 20, 2022, 10:51:29 PM",
      "body": "Quote from: 325btc on May 20, 2022, 06:23:33 PMCreate usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money There are some blockchain based NFT games that do daily airdrops for 365 days.It could be a good form of passive income. The main issue is similar to the BAT token with brave browser rewards. In that everyone exchanges their earnings as quickly as possible, which causes the long term value of the token to trend towards the opposite of HODL.I think introducing intrinsic or functional utility to tokens and NFTS could also be important for their success.Each token should be guaranteed to be worth a set value of gold, metal, corn, oil or another set standard. That way people can feel assured that their wealth will be protected in the event of a disaster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "May 20, 2022, 10:54:40 PM",
      "body": "Quote from: 325btc on May 20, 2022, 06:23:33 PMPlan to solve Create usd or other stablecoin like eur or why not gbp...And make big airdrop.So everybody will get nice ammount  And exchangers will pay apy like 40-50% to holdIts instant plan to remove poverty you print money Yeah, instant money to everyone.But do you know the consequences of having it? You're pulling down the economy of whichever currency you planned to be backed off. That project is also going to die eventually because no flow is going in.And do you think exchanges will support the idea if they know the origin of that coin you're trying to produce? No way, they would go bankrupt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "May 20, 2022, 11:43:47 PM",
      "body": "Quote from: jossiel on May 20, 2022, 10:54:40 PMYeah, instant money to everyone.But do you know the consequences of having it? You're pulling down the economy of whichever currency you planned to be backed off. That project is also going to die eventually because no flow is going in.And do you think exchanges will support the idea if they know the origin of that coin you're trying to produce? No way, they would go bankrupt.that idea is dumb for one, where will they get the backing of that stablecoin? instant money? but where will it get its value from? i don't think exchanges will list it if there is no backing for this stable coin? so at the very start, it is already a failure. don't think about creating such crap concept.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "May 21, 2022, 12:36:40 AM",
      "body": "What you are describing is called money-printing. Unfortunately, it is the bankers who receive the air drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "May 21, 2022, 12:37:24 AM",
      "body": "When you're create stable coin out of thin air or print money, the price will decrease due to large supply. What's the purpose of the team to create stable coin? to earn profit! it doesn't make sense to them to give it as a free airdrop. They wouldn't care with the poverty/starve, what they're care is how to make a lot money for them. Since you're mostly talking about money oriented, even you're a billionaire, I doubt you will help the poverty/starve to give some portion from your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "May 21, 2022, 12:44:33 AM",
      "body": "I heard of Chinese money many years ago printed with a timestamp on it.   The money appears in the economy and is exchanged but by a certain date it will disappear again and not be accepted in payment of bills or taxes.   There is that idea of free money but only temporary, I dont think it can work especially as it just gifts money to some over others which is not capitalism but centralism of government using paper debt to pay bills.   The same thing applied to QE really, it was supposed to be reversed but they lack the ability to do so; in the end FIAT fails from its constant promises and confiscation of value from the common people.   There is no easy path, stability has a cost the same way insurance charges a premium I think.   Enabling the population to retain the benefits of their hard work is the first move to stop poverty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "May 21, 2022, 01:44:00 AM",
      "body": "That is basically what happened to Sri Lanka just very recently and today they are experiencing the collapse of their economy and then this energy crisis kicks in as well. They printed a lot of country's currency too. FED can print too but they  are also preventing this to crumble faster to the ground. Their solution for now is to crash the stock market and save the economy at the expense of the investors, this at least will prolong that they may find alternative to keep the economy running. Not so much of a bad idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "May 21, 2022, 04:32:00 AM",
      "body": "I mean if you consider a collection of values of 0's as \"rich\", then yea, sure, you're indeed rich. It wouldn't be bad if the token had some utility though, one that stops users from actually releasing/selling it immediately after getting it. That action just moves the coin towards its hell, just like how p2e games were formed. In the end, the large majority was in it for the game which lead the tokens for those games to ultimately become close to zero in value after a few months. They never last for the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}