{
  "id": "topic_5471365",
  "title": "EarnOnVictor",
  "author": "EarnOnVictor",
  "created_time": "October 23, 2023, 04:54:07 PM",
  "content": "First, let me congratulate those who bought Bitcoin late last year and in the wake of 2023, especially those who own/hold it. The last post-halving lowest level hit was in November 2023 at $15476, and such people might have struck it around that price or at a price around $16600 which is the 2023 opening price. As usual, 2023 is no doubt a dramatic year for Bitcoin as it had its fair share of both buy and sell moments, only that it was unable to hit back the opening price of the year, and with what I see now, it might not see that level again possibly till after 2025.My quick monthly chart analysis reveals that Bitcoin started its bullish journey after bottoming at $15,476 and a trendline support close to that level was never broken ever again to date. Instead, a bullish price action formed above that level and the two bullish interpretations guided the market higher till this year amidst some turbulent rides as you can see with both bearish and bullish candles on the chart. The summary of the view this year judging by the whole candle pattern shows that it's all bullish. But this never hinted to me the assurance that Bitcoin might not know $24,750 anymore this year until there exists a double-bottom at the $24,750 and also a rekindled bullish price action right above the level.For this, the recent bullishness might linger till next year, and I don't believe we would see the coin hitting $24,750 anymore in 2023.A weekly chart Fibonacci analysis might have hinted at the bullish trend as well. Fibonacci prevented the market from buying for several weeks, but eventually last week, Bitcoin prevailed as it breached the weekly chart Fibo level of 23.6% at $27,952 and even had a close above the level. This, coupled with the bullish price action above the level, I believe Bitcoin could hit the Fibo level of 38.2% at $35,865 over time. This is what it would be determined to achieve in the remaining months of this year as it shies away from the prominent lower levels hit this year.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471365",
  "comments": [
    {
      "author": "Latviand",
      "created_time": "October 24, 2023, 04:56:53 AM",
      "body": "Are we really sure that it's not going to? I hope your analysis is wrong because I've been slowly accumulating bitcoin and I have another upcoming big money coming and I want to make sure I'm buying a lot of bitcoin for a discounted price. But hey, if that's not going to be the case, I guess I'll just buy bitcoin in December and hope that I still get a lot of bitcoin value out of the money I'm going to get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "October 24, 2023, 07:28:37 AM",
      "body": "Quote from: Latviand on October 24, 2023, 04:56:53 AMAre we really sure that it's not going to? I hope your analysis is wrong because I've been slowly accumulating bitcoin and I have another upcoming big money coming and I want to make sure I'm buying a lot of bitcoin for a discounted price. But hey, if that's not going to be the case, I guess I'll just buy bitcoin in December and hope that I still get a lot of bitcoin value out of the money I'm going to get.Always expect an anomaly.My guess is that a country will start to liquidate their supply in order to hold it down, if anything were to happen. At the end of the day all countries are at war. The west, the east, Russia, china, US, Israel, middle east, etc. Not primarily a war of violence, but an economic war. Bitcoin is mixed into this war as well. War is not just government, it's people too. I am sure China will eventually move all wealth from BTC to Digital Yuan and cause some form of crash. Maybe even the entire BRICS ecosystem, or, the US will do it themselves. Especially considering they are having problems in their housing market (which will effect a lot of the countries they have also invested in)Let's also keep in mind that the IBTC SPOT ETF addition to the nasdaq clearing house is not an indicator that it is approved and wil l he traded. However, it's notable nonetheless. Pessimism aside, today was a significant day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "October 24, 2023, 10:01:25 AM",
      "body": "Quote from: Latviand on October 24, 2023, 04:56:53 AMAre we really sure that it's not going to? I hope your analysis is wrong because I've been slowly accumulating bitcoin and I have another upcoming big money coming and I want to make sure I'm buying a lot of bitcoin for a discounted price. But hey, if that's not going to be the case, I guess I'll just buy bitcoin in December and hope that I still get a lot of bitcoin value out of the money I'm going to get.It's not an analysis though, we really don't know. We can even say that we won't see another lowest low, the last low we had is during the FTX drama, the price goes down hard to $15,500. But still though, there could another black swan even that could happen next month.In any case, we will continue to accumulate no matter what. If you have chunk of money coming in then by all means buy as much as you can regarding of the price. Same with me, I remain positive that in the next 6 months I can still buy more. So we still have a lot of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 24, 2023, 12:14:05 PM",
      "body": "Quote from: EarnOnVictor on October 23, 2023, 04:54:07 PMFirst, let me congratulate those who bought Bitcoin late last year and in the wake of 2023, especially those who own/hold it. The last post-halving lowest level hit was in November 2023 at $15476, and such people might have struck it around that price or at a price around $16600 which is the 2023 opening price. As usual, 2023 is no doubt a dramatic year for Bitcoin as it had its fair share of both buy and sell moments, only that it was unable to hit back the opening price of the year, and with what I see now, it might not see that level again possibly till after 2025.My quick monthly chart analysis reveals that Bitcoin started its bullish journey after bottoming at $15,476 and a trendline support close to that level was never broken ever again to date. Instead, a bullish price action formed above that level and the two bullish interpretations guided the market higher till this year amidst some turbulent rides as you can see with both bearish and bullish candles on the chart. The summary of the view this year judging by the whole candle pattern shows that it's all bullish. But this never hinted to me the assurance that Bitcoin might not know $24,750 anymore this year until there exists a double-bottom at the $24,750 and also a rekindled bullish price action right above the level.For this, the recent bullishness might linger till next year, and I don't believe we would see the coin hitting $24,750 anymore in 2023.A weekly chart Fibonacci analysis might have hinted at the bullish trend as well. Fibonacci prevented the market from buying for several weeks, but eventually last week, Bitcoin prevailed as it breached the weekly chart Fibo level of 23.6% at $27,952 and even had a close above the level. This, coupled with the bullish price action above the level, I believe Bitcoin could hit the Fibo level of 38.2% at $35,865 over time. This is what it would be determined to achieve in the remaining months of this year as it shies away from the prominent lower levels hit this year.It seems that you are trying to “guarantee” us that it would not touch down $24,750 anymore. Correct me if I’m wrong though, but anything could happen without warning like another FTX level type news that would trigger the market to go down and experiencing more liquidations. Yes we’re bullish for 2024 but I wouldn’t rule out about another big pullback before the year ends. Black swans are always there and can trigger anytime and we have to be prepared for the unexpected.The bears are also hoping for that black swan to come. Their recent short positions are liquidated because they’ve never expected this to happen. Same thing goes later on if there would be another big FUD incoming. So time will tell if your predictions are accurate or not. But let’s just hope so and always anticipate the unexpected happenings. Just my two sats.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 24, 2023, 01:42:41 PM",
      "body": "Quote from: BenCodie on October 24, 2023, 07:28:37 AMAlways expect an anomaly.My guess is that a country will start to liquidate their supply in order to hold it down, if anything were to happen. At the end of the day all countries are at war. The west, the east, Russia, china, US, Israel, middle east, etc. Not primarily a war of violence, but an economic war. Bitcoin is mixed into this war as well. War is not just government, it's people too. I am sure China will eventually move all wealth from BTC to Digital Yuan and cause some form of crash. Maybe even the entire BRICS ecosystem, or, the US will do it themselves. Especially considering they are having problems in their housing market (which will effect a lot of the countries they have also invested in)I'm not 100% sure you are serious about this, but what wealth of China are you talking about when it comes to BTC? Do you even realize the total value of all BTC in circulation compared to China's GDP? No country except El Salvador has officially announced that it buys and holds BTC, and everything else is just speculation and conspiracy theories.Quote from: BenCodie on October 24, 2023, 07:28:37 AMLet's also keep in mind that the IBTC SPOT ETF addition to the nasdaq clearing house is not an indicator that it is approved and wil l he traded. However, it's notable nonetheless. Pessimism aside, today was a significant day Nothing is certain until the SEC makes an official announcement, and that could be in a month or in some 4-5 months at the latest, but it is obvious that moves like this signal that something is happening in the background. If nothing else, people have begun to understand a little bit what this is about, and whether it will be something that will change the rules of the game when it comes to large investments in Bitcoin remains to be seen.The spot ETF will be good for the price (at least in the short term), but in the long term it is not in favor of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "October 24, 2023, 04:18:04 PM",
      "body": "Quote from: EarnOnVictor on October 23, 2023, 04:54:07 PMFirst, let me congratulate those who bought Bitcoin late last year and in the wake of 2023, especially those who own/hold it. The last post-halving lowest level hit was in November 2023 at $15476, and such people might have struck it around that price or at a price around $16600 which is the 2023 opening price. As usual, 2023 is no doubt a dramatic year for Bitcoin as it had its fair share of both buy and sell moments, only that it was unable to hit back the opening price of the year, and with what I see now, it might not see that level again possibly till after 2025.My quick monthly chart analysis reveals that Bitcoin started its bullish journey after bottoming at $15,476 and a trendline support close to that level was never broken ever again to date. Instead, a bullish price action formed above that level and the two bullish interpretations guided the market higher till this year amidst some turbulent rides as you can see with both bearish and bullish candles on the chart. The summary of the view this year judging by the whole candle pattern shows that it's all bullish. But this never hinted to me the assurance that Bitcoin might not know $24,750 anymore this year until there exists a double-bottom at the $24,750 and also a rekindled bullish price action right above the level.For this, the recent bullishness might linger till next year, and I don't believe we would see the coin hitting $24,750 anymore in 2023.A weekly chart Fibonacci analysis might have hinted at the bullish trend as well. Fibonacci prevented the market from buying for several weeks, but eventually last week, Bitcoin prevailed as it breached the weekly chart Fibo level of 23.6% at $27,952 and even had a close above the level. This, coupled with the bullish price action above the level, I believe Bitcoin could hit the Fibo level of 38.2% at $35,865 over time. This is what it would be determined to achieve in the remaining months of this year as it shies away from the prominent lower levels hit this year.If you go on by saying this is possible for the rest of the days in October then i will say you're probably right, but assuming for the rest of the year is still a long way far enough for us to say we will not experience more bearish trend than bullish may be another thing to consider, though one can phantom this from the chart for a possibility, but if you're to consider the nature of occurences in the cryptocurrency economy today, nothing can be predictable on a long run like this, we will keep on speculating more to see how this may stay base on the chart subsequent results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "October 25, 2023, 05:17:54 AM",
      "body": "Quote from: BenCodie on October 24, 2023, 07:28:37 AMQuote from: Latviand on October 24, 2023, 04:56:53 AM~Always expect an anomaly.My guess is that a country will start to liquidate their supply in order to hold it down, if anything were to happen. At the end of the day all countries are at war. The west, the east, Russia, china, US, Israel, middle east, etc. Not primarily a war of violence, but an economic war. Bitcoin is mixed into this war as well. War is not just government, it's people too. I am sure China will eventually move all wealth from BTC to Digital Yuan and cause some form of crash. Maybe even the entire BRICS ecosystem, or, the US will do it themselves. Especially considering they are having problems in their housing market (which will effect a lot of the countries they have also invested in)Let's also keep in mind that the IBTC SPOT ETF addition to the nasdaq clearing house is not an indicator that it is approved and wil l he traded. However, it's notable nonetheless. Pessimism aside, today was a significant day I'm not being pessimistic though, I already have a considerable amount of bitcoin in my wallet and I just want to add more to what I currently have because I know that the pump is getting ever closer and I want to make sure that when that happens, I am not going to be saying to myself that I should've bought more bitcoin. I don't know much about how other countries plan to release what they currently have but one thing that I am sure of is that BRICS won't be doing anything, I am pretty sure that they're all currently infighting right now so they're not going to be influencing the bitcoin market or the global market anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "October 25, 2023, 06:18:30 AM",
      "body": "Quote from: Dunamisx on October 24, 2023, 04:18:04 PMQuote from: EarnOnVictor on October 23, 2023, 04:54:07 PMsnipI agree also that in the short term for the remainder of October certainly we could follow the current trend but there will be situations where the Bitcoin market will be over-bought and then over-sold. The market doesnt just keep rising, or falling.I think I would definitely agree though with the OP's point that we wont be going back to ~ $24,750 Quote from: Latviand on October 24, 2023, 04:56:53 AMAre we really sure that it's not going to? I hope your analysis is wrong because I've been slowly accumulating bitcoin and I have another upcoming big money coming and I want to make sure I'm buying a lot of bitcoin for a discounted price. But hey, if that's not going to be the case, I guess I'll just buy bitcoin in December and hope that I still get a lot of bitcoin value out of the money I'm going to get.I would say there are a few people still holding for a dip in the price to but Bitcoinon discount!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Out of mind",
      "created_time": "October 25, 2023, 07:15:54 AM",
      "body": "The Bitcoin market this week posted the highest growth we've seen in 2023. Where compared to other months, this month of October has seen the most bulls and prices have increased rapidly. Since in 2023 we see Bitcoin price at $35000, we can expect Bitcoin to basically hit $40000 by the end of this year. As the Bitcoin market has seen a lot of growth over time, we certainly expect to see more Bitcoin price lows this year. And the Bitcoin market in 2024 I expect the price of Bitcoin to reach $60k dollars and later when Bitcoin is halved then its price will increase relatively. A bull market will start after the bitcoin halving, and then the bitcoin market will reach higher highs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "October 25, 2023, 09:27:29 AM",
      "body": "Let's hope what @OP hopes for happens. If it survives until next year, we should feel happy because Bitcoin could have a chance to rise again next year. But there is no guarantee that the price can remain at the current level because today's correction caused Bitcoin to experience a decline of several hundred dollars.We also need to find out how long this correction will last, especially since we are only in the middle of the week. Usually, a correction will come at the weekend so we can get ready to buy more.But no matter what happens in the market, if the price has yet to reach above $50k, it is still a good price to buy Bitcoin. I'm still waiting for a while to see where the Bitcoin price moves to know when I can buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "October 25, 2023, 09:48:54 AM",
      "body": "Quote from: michellee on October 25, 2023, 09:27:29 AMLet's hope what @OP hopes for happens. If it survives until next year, we should feel happy because Bitcoin could have a chance to rise again next year. But there is no guarantee that the price can remain at the current level because today's correction caused Bitcoin to experience a decline of several hundred dollars.We also need to find out how long this correction will last, especially since we are only in the middle of the week. Usually, a correction will come at the weekend so we can get ready to buy more.But no matter what happens in the market, if the price has yet to reach above $50k, it is still a good price to buy Bitcoin. I'm still waiting for a while to see where the Bitcoin price moves to know when I can buy.I don't see any correction though, on the other hand, the bullish momentum continues to $35k. I guess even if there is fake news that push the market, it seems that investors are not going to sell right now. So as we break the $35k barrier, we will be looking on the next target which is $38k. If we did break it this month or at least November, then possible that we might reach $50k at the end of the year.And this is what the OP has seeing based on his charts, we have a break out Fibonacci and it could linger till the end of the year. Although he said that $35,865, the highest we go so far is $35,150 which is very close to his prediction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "October 25, 2023, 10:20:58 AM",
      "body": "Quote and I don't believe we would see the coin hitting $24,750 anymore in 2023.Nothing is sure and certain in the world of Bitcoin/crypto. I wouldn't bet on your prediction. It is completely possible for the BTC price to hit 24K by the end of 2023. First of all, I'm not sure what caused the current price pump to 34K. Is it a bunch of crypto whales buying BTC aggressively or some very bullish news about Bitcoin? I don't see anything new in terms of bullish news about Bitcoin. I don't think that the current price pump will be steady. It's most likely a short term price bubble, that will pop and the price might return back to 27K USD or even 25K. October has always been a special month for BTC. Last year,'s October, there was the FTX drama and a BTC price crash, while in October 2021, the Bitcoin price hit levels above 54K USD, if I remember this correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 25, 2023, 09:01:20 PM",
      "body": "There are way too many people who end up getting emotional about money, and that's the number one mistake without a doubt.You can't get emotional about money, it's a made up thing to keep people in control and there isn't really any value in it, see the magical aspect of it and you are going to realize that money can be tricked, and people can be tricked as well, so while you may end up losing it time to time, just use your psychology to turn that into a profit and not a loss, and just realize whatever you are feeling ,could be what the market is feeling and then you could trade accordingly to make some money. I understand it may sound like an evil thing to do or immoral but there is nothing that prevents you from doing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "October 25, 2023, 09:22:38 PM",
      "body": "Quote from: davis196 on October 25, 2023, 10:20:58 AMQuote and I don't believe we would see the coin hitting $24,750 anymore in 2023.Nothing is sure and certain in the world of Bitcoin/crypto. I wouldn't bet on your prediction. It is completely possible for the BTC price to hit 24K by the end of 2023. First of all, I'm not sure what caused the current price pump to 34K. Is it a bunch of crypto whales buying BTC aggressively or some very bullish news about Bitcoin? I don't see anything new in terms of bullish news about Bitcoin. I don't think that the current price pump will be steady. It's most likely a short term price bubble, that will pop and the price might return back to 27K USD or even 25K. October has always been a special month for BTC. Last year,'s October, there was the FTX drama and a BTC price crash, while in October 2021, the Bitcoin price hit levels above 54K USD, if I remember this correctly.We need to spend a long time at these levels to ensure stability at the current price. The damage to the economic structure in the world and wars may prevent this stability. So we will all see whether the price will stay at these levels for long.We should not think of Bitcoin independently of world events. Bitcoin is not an investment known to a limited number of people as it used to be. The whole world now knows and invests in Bitcoin. It is very difficult to predict which direction Bitcoin will move when global events are happening. You should make your investments considering the risks.When you say that nothing is certain in the Bitcoin world, it's a reminder to be careful every step of the way. We all want the Bitcoin price to go up, but we should also remember that we need time for many things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 25, 2023, 09:51:02 PM",
      "body": "It seems that the price movement of Bitcoin has been favorable this year. We can observe an uptrend despite some setbacks, possibly due to the upcoming halving and the numerous news surrounding it. In my opinion, the bullish trend will likely continue into the next year. However, we should still be prepared for other possible developments because we are aware that there are other factors that can influence the value of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "October 25, 2023, 09:54:50 PM",
      "body": "Quote from: davis196 on October 25, 2023, 10:20:58 AMQuote and I don't believe we would see the coin hitting $24,750 anymore in 2023.Nothing is sure and certain in the world of Bitcoin/crypto. I wouldn't bet on your prediction. It is completely possible for the BTC price to hit 24K by the end of 2023. First of all, I'm not sure what caused the current price pump to 34K. Is it a bunch of crypto whales buying BTC aggressively or some very bullish news about Bitcoin? I don't see anything new in terms of bullish news about Bitcoin. I don't think that the current price pump will be steady. It's most likely a short term price bubble, that will pop and the price might return back to 27K USD or even 25K. October has always been a special month for BTC. Last year,'s October, there was the FTX drama and a BTC price crash, while in October 2021, the Bitcoin price hit levels above 54K USD, if I remember this correctly.The pump is caused by the news and the approval ratings of the ETF. Many companies including Bloomberg made their predictions about the ETF and they are all positive, some even stating that it has 90% chance off being approved. That makes people buy bitcoin now.At the same time there's some natural causes like the fact that bitcoin used to stay at around half of its all time high price for months before and after the halving. in 2013 ATH was 1100 dollars and the price before the halving was sitting between 500 and 600 In 2020 ATH was 20000 dollars and the price before the halving was 10000 - 12000Now ATH was 68000 and price before the halving came is above 30000 so we're right on track.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "October 26, 2023, 01:29:42 PM",
      "body": "Quote from: Text on October 25, 2023, 09:51:02 PMIt seems that the price movement of Bitcoin has been favorable this year. We can observe an uptrend despite some setbacks, possibly due to the upcoming halving and the numerous news surrounding it. In my opinion, the bullish trend will likely continue into the next year. However, we should still be prepared for other possible developments because we are aware that there are other factors that can influence the value of Bitcoin.Even during bull season, there will be small incidents that cause the bitcoin price to correct, so we should not be surprised if there are events that cause the bitcoin price to drop between now and the halving. But I believe the main trend of the market will still be an uptrend. Bitcoin may be correct but will soon recover and continue to increase. That's what's happening this year and things will continue that way until the bulls arrive. Yes, bitcoin has gone high and I agree with the OP, we are unlikely to drop below $24k again. Things changed for the better when bitcoin crossed $30K.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ShowOff",
      "created_time": "October 26, 2023, 01:45:47 PM",
      "body": "Quote from: posi on October 26, 2023, 01:29:42 PMQuote from: Text on October 25, 2023, 09:51:02 PM-Even during bull season, there will be small incidents that cause the bitcoin price to correct, so we should not be surprised if there are events that cause the bitcoin price to drop between now and the halving. But I believe the main trend of the market will still be an uptrend. Bitcoin may be correct but will soon recover and continue to increase. That's what's happening this year and things will continue that way until the bulls arrive. Yes, bitcoin has gone high and I agree with the OP, we are unlikely to drop below $24k again. Things changed for the better when bitcoin crossed $30K.I never again expected the price of bitcoin to fall back to the $25k level after it broke through the $35k resistance this month. Of course bullishness is more expected than a correction or bearishness in the rest of the year, but both should absolutely not be ignored considering that it is always possible to see a correction and test new support levels.There is high confidence about $40k to $50k by the end of the year, of course that is a very realistic price to expect after seeing how quickly prices recovered at the end of October. We'll go to $36k, $37k and $40k, of course that's the hope.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "October 27, 2023, 10:16:16 AM",
      "body": "Quote from: ShowOff on October 26, 2023, 01:45:47 PMQuote from: posi on October 26, 2023, 01:29:42 PMQuote from: Text on October 25, 2023, 09:51:02 PM-Even during bull season, there will be small incidents that cause the bitcoin price to correct, so we should not be surprised if there are events that cause the bitcoin price to drop between now and the halving. But I believe the main trend of the market will still be an uptrend. Bitcoin may be correct but will soon recover and continue to increase. That's what's happening this year and things will continue that way until the bulls arrive. Yes, bitcoin has gone high and I agree with the OP, we are unlikely to drop below $24k again. Things changed for the better when bitcoin crossed $30K.I never again expected the price of bitcoin to fall back to the $25k level after it broke through the $35k resistance this month. Of course bullishness is more expected than a correction or bearishness in the rest of the year, but both should absolutely not be ignored considering that it is always possible to see a correction and test new support levels.There is high confidence about $40k to $50k by the end of the year, of course that is a very realistic price to expect after seeing how quickly prices recovered at the end of October. We'll go to $36k, $37k and $40k, of course that's the hope.It's not just you, many people don't want bitcoin to drop back to $25k, but there are still some people who are expecting it. Those are people who haven't accumulated a lot of bitcoin because they think the market will have another big drop and bitcoin will drop to $15k. But I think they will soon be disappointed after seeing what has happened in the past few days. But you're right, we also have no guarantees that bitcoin will no longer drop below $25k. I was pessimistic about the $40K goal by the end of the year but with everything going on, I think it's achievable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}