{
  "id": "topic_5404800",
  "title": "franch",
  "author": "franch",
  "created_time": "July 01, 2022, 03:36:16 PM",
  "content": "Deutsche Bank’ın bir analizine göre ABD hisse senetleriyle korelasyonu göz önüne alındığında yıl sonuna kadar 28.000 dolara ulaşabilir.Marion Laboure ve Galina Pozdnyakova tarafından yapılan analize göre Bitcoin, yıl sonuna kadar %30’luk bir ralli yaparak 28.000 dolar seviyelerini görebilir.Bankanın analistleri, kripto para birimlerinin Kasım ayından beri S&P 500 ve Nasdaq 100 gibi teknoloji ağırlıklı endekslerle korelasyonunun arttığını, yıl sonuna kadar endekslerde bekledikleri ocak seviyesine dönüşe Bitcoin’in de eşlik edeceğini düşünüyorlar.İkili, kripto para birimlerinin, altın ve diğer emtialardan çok elmaslara benzedigini ifade ediyor. Laboure ve Pozdnyakova, elmas sektörünün önemli aktörlerinden biri olan ve pazarlama çalışmalarıyla elmaslar hakkındaki tüketici algısını değiştiren De Beers’in hikayesine atıfta bulunarak \"Bir üründen ziyade bir fikir pazarlayarak, son seksen yıldır hakim oldukları, yılda 72 milyar dolarlık elmas endüstrisi için sağlam bir temel oluşturdular. Elmaslar için geçerli bu durum Bitcoin dahil birçok kripto para için de geçerlidir.\" dedi.Pozdnyakova, coinlerin kamu sermaye sistemindekiler gibi ortak değerleme modellerinin olmadığını, bunun coin fiyatlarını istikrara kavuşmasını zorlaştırdığını açıkladı. Sistemin karmaşıklığını işaret ederek, bir başka korku dalgasının gelmesi halinde kriptolardaki serbest düşüşün devam edebileceğini ifade etti.Kaynak: https://koinbulteni.com/deutsche-bank-analistleri-bitcoinde-yeni-bir-ralli-bekliyor-123101.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404800",
  "comments": [
    {
      "author": "jorgesalcedo",
      "created_time": "July 01, 2022, 07:54:36 PM",
      "body": "Konu başlığına ralli görünce daha büyük rakamlar beklemiştim ama artık en iyimser tahminlerde bile kısa ve orta vadede ath gelme olasılığı çok görünmüyor. Uluslararası piyasalara çok bağımlı halde gidiyoruz bu aralar ve böyle devam etmesi halinde sanırım istediğimiz rakamları ancak 2024’te görebileceğiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lossnet",
      "created_time": "July 02, 2022, 12:42:06 PM",
      "body": "Nereden nerelere gelmişiz. 8000 dolarlık artış için bile ralli ifadeleri kullanılıyor. Hem de 6 ay sonrasının öngörüsü bu! Hedefler minimum düzeye inmiş. Eskiden günlükte 5-6 bin dolarlık sıçramalar olurdu. Şimdilerde ise 1000 doları bile bulmuyor hareketler. Fenomenciklere bakarsak onlar da uçmuşlar; 100 bin dolara çıkacak diyenler de var, 1000 dolara düşecek diyenler de... İnsan bezdi artık!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero1111",
      "created_time": "July 02, 2022, 01:14:43 PM",
      "body": "Bitcoinin yeni bir ralli yapmaması zaten konu değil ama yazıda belirtilen olay ralliden değil bir toparlanma , yeni ralli dediğinizde bitcoin derken 200 bin dolarlardan veya daha üst bir rakamdan  bahsetmek gerekir 28 k lardan değil . Yazın sonunda doğru bir toparlanma geleceğini ve bunun biraz uzun zamanda gerçekleşeceğini düşünüyorum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "July 06, 2022, 06:01:24 AM",
      "body": "Quote from: franch on July 01, 2022, 03:36:16 PMBankanın analistleri, kripto para birimlerinin Kasım ayından beri S&P 500 ve Nasdaq 100 gibi teknoloji ağırlıklı endekslerle korelasyonunun arttığını, yıl sonuna kadar endekslerde bekledikleri ocak seviyesine dönüşe Bitcoin’in de eşlik edeceğini düşünüyorlar....bitcoin'in, teknoloji hisseleri ile olan korelasyonunu çok fazla anlamlandıramadım. :( bitcoin elbette bir teknoloji ürünü ama onun rekabeti apple ya da google gibi teknoloji üreten firmalarla değil (ki zaten bitcoin'in böyle bir misyonu ya da vizyonu da yok); bitcoin, küresel finans sistemine başkaldırı niteliği taşıyan, \"eşler arası, merkeziyetsiz\" bir para transferi aracıdır. onun rakibi ya da daha doğru bir ifadeyle korelasyon kurmasını bekleyeceğim finansal araçlar \"emtia benzeri değerli varlıklar olmalı\" diye düşünüyorum. teknoloji hisseleri ile olan korelasyonunu görünce yeterince ya da doğru bir şekilde anlaşılmamış olabileceğini düşündüm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}