{
  "id": "topic_5422514",
  "title": "meser#",
  "author": "meser#",
  "created_time": "November 21, 2022, 09:06:27 PM",
  "content": "Bu içerik meser# tarafından düzenlenen \"Bir yeteneğin varsa, onu kullanacağız-2 / YARIŞMA\" etkinliği için hazırlanmıştır. Sizlerinde bu etkinliğe teşriflerini ısrarla beklemekteyiz efenim Hepimizin etrafında illa ki bir hazır cevap insan bulunuyordur. Yoksa da o kişi bizizdir herhalde  Eğer değilsekte akşam yastığa başımızı koyduğumuzda ulan o zaman şunu diyecektim keşke falan diyen birisi de olabiliriz. Aslında hazır cevap olmamak bir eksiklik değil tembellik desek yeridir. Hazır olunan konu hakkında herkes birşeyler konuşabilir ancak hazır olunmayan konudan geldiğinde güzel cevaplar verebilmek işte o pek herkesin harcı olmayabiliyor. Peki bu konuda nasıl kendimizi geliştirebiliriz derseniz ise o en kolayı işte  Hazır olmadığınız zamanlarda hazır olmadığınız şeyler üzerine kendinizi sınayarak. Aşağıya bırakacağım resimden ilk farkettiğiniz kelime hakkında en az 10 cümlelik bir paragraf yazmanızı isteyeceğim. Bunu yazarken google, yakınlarınızdaki insanlar vb kişilerden yardım almamanızı da rica edeceğim. Unutmayın teknolojinin bu denli gelişmesinin bir yan etkisini farkedeceksiniz bu test ile. O da beyinde yer alan bilgiye erişmek için beyin gücümüzü zorlamak yerine teknolojiden faydalanmak bizdeki hafızanın keskinliğini zayıflatmakta. Her gün bu kelimelerden bir tane paragraf yazarsanız arada ki farkı kısa zamanda görürsünüz. Bunu günlük hayatınızda da uygulayabilirsiniz. Örneğin şuan bu satırları okurken bilgisayarınızın sağ tarafında yer alan küllük hakkında birşeyler karalayabilirsiniz ( Burdan çalışırken sigara içebileceği yer arayan @gospodin hocama selam olsun  ) Fazla uzatmayayım şuraya kısa bir özette koyayım uzun yazıyorsun diye fırça atan hocalarım da oluyordu (:- Resimde ilk gördüğünüz kelimeye dair en az 10 cümlelik bir paragraf yazın.- Kopya, destek almak ve internette araştırma yapmak yok",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422514",
  "comments": [
    {
      "author": "wolwoo",
      "created_time": "November 21, 2022, 09:41:33 PM",
      "body": "etek nedir arkadaş yaa  bu konuda acayip bilgi sahibiyim   etek, pantolon alternatifi bir giysi çeşididir. genelde kadınlar tercih eder ancak farklı kültürlerde erkekler de giyer. örneğin araplar ve iskoclar...kullanımı rahat ve havadar olmakla birlikte ısıyı muhafaza etmede nispeten başarısızdır. uzun, kısa ve mini (süper mini) gibi çeşitleri vardır. bacakları ya da baldirları açıkta bırakır, bu nedenle seksapalitesi yüksektir. pileli de olabilir düz de...zıctık benden bu kadar   \"eksik etek\" gibi deyimler vardır, çok kısa olduğunda kumaş yetmemiş derler vs vs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "November 21, 2022, 10:00:02 PM",
      "body": "Quote from: wolwoo on November 21, 2022, 09:41:33 PMetek nedir arkadaş yaa  bu konuda acayip bilgi sahibiyim   etek, pantolon alternatifi bir giysi çeşididir. genelde kadınlar tercih eder ancak farklı kültürlerde erkekler de giyer. örneğin araplar ve iskoclar...kullanımı rahat ve havadar olmakla birlikte ısıyı muhafaza etmede nispeten başarısızdır. uzun, kısa ve mini (süper mini) gibi çeşitleri vardır. bacakları ya da baldirları açıkta bırakır, bu nedenle seksapalitesi yüksektir. pileli de olabilir düz de...zıctık benden bu kadar   \"eksik etek\" gibi deyimler vardır, çok kısa olduğunda kumaş yetmemiş derler vs vs Gayet güzel hocam valla etek konusunda ben bu kadar detaya giremezdim herhalde. Bir de ben deneyeyim şansımı bakalım.Etek. Asırlardır vazgeçilmemiş bir giyim unsuru olarak karşımıza çıkmaktadır. Genellikle bayanlar ile bağdaştırılsa da İskoçya'da erkeklerde kullanmaktadır. Bahsettiğinizin aksine arapların giydikleri etekten ziyade entari olarak nitelendirilmesi doğru olacaktır. Niteki etek dediğimiz kıyafet bel altını kapsarken Arap dostlarımızın giydikleri boyun hizasından başlamaktadır. Belki tam etek tabirinde kıyafet giyen arap erkekler vardır bilemeyiz. Bu arada İskoçlar giyer demişken ilk etek giyen bir erkeği Sihirli annem dizisinde görmüştüm. 23 Nisan gösterisi için önceleri farklı milletlerden insanı ülkemizde ağırlardık. Bahsini geçirdiğim bölümde ise bu duruma dizide de yer verilmişti. Etek giyen bu iskoçyalılar için birçok espri meydana gelmiştir ülkemizde. Hanımınız eteğin boyuna karışıyor mu? Bu ilişki de hanım siz misiniz? gibi gibi. Ayrıca bir deyimde benden gelsin etekleri zil çalmak olarak. Bu deyim ise eteklerinin ucuna zil bağlayıp dans eden ablalarımızı anlatmaktadır desem olmaz çok büyük bir sevince sahip olan kişiyi nitelendirmek için kullanılır",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "November 22, 2022, 06:53:05 AM",
      "body": "İp Kelimeyi görünce aklıma şu koca dağların arasına ip çekip üzerinde paraşütüyle yürüyen adamlar geldi. Bu cümlelerde ip hakkında mı on cümle kurmalıyım bilmiyorum ama ben düz devam ediyorum oradan oraya atlatacak bu ip mevzusu beni. Bu ip üstünde paraşütlü adamları düşününce aklıma en çok yapmak istediğim ama hiç yapmaya cesaret demeyeceğim bir spor geliyor. Şu yarasa kıyafetiyle sadece rüzgarla yön alıp yere yakın uçarak manevra yapan insanlar var ya onlar yaşıyor bu hayatı  Öyle balona binmek sakin sakin uçmak falan değil hayalim yani yapacaksam bir şeyi bunlar gibi yapmayı isterdim. Bak buradan da başka istediğim bir şeye uçuyorum. Bilmem kaç km yükseklikten atlayıp havada binbir türlü aktivite yapıp belirli bir yere inme hedefleri var ya insanların işte bunu da ypamak isterdim. Şöyle bi düşününce de bu yazdıklarımın hepsinin ip ile bir ilgi var. Hepsinde paraşüt var ve bizi ona bağlayan şey ip  O yüzden de on cümlem ilk gördüğüm kelimeyle ilgili oldu, teşekkürler sahneyi başkasına bırakıyorum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "November 22, 2022, 07:29:58 AM",
      "body": "Bir kaç kombinasyondan bir paragraf yazmaya çalışacağım. Biraz bir hikayenin giriş kısmını andırabilir affınıza sığınıyorum. Koruyucu :Kaz dağlarının eteklerinde minderinde oturan bir yiğit vardı adı Mustafa. Dağların en uç noktaları bu cengaverden sorulurdu. Yıllardır hiç kimse Çıngırakların çaldığı diyarlardan uzaklarda, bu dağlarda yaşamasına anlam vermemişti. Mustafa genç, yakışıklı ve kudretli, Jilet gibi bir delikanlıydı. Atası Yavuz gibi bir kulağına küpeye benzer bir cisim takmıştı. Yavuz’un onu takma sebebi “Hadim’ül Haremeyn” olduğunu sürekli hatırlamaktı, Mustafa ise bu dağların hizmetkarı olduğunu hatırlamak için takmıştı. Bu yiğitte rivayet odur ki Kaz dağlarının en gizli anahtarları vardı ve asırlardır bu dağların koruyucusu olan ailenin fertlerinden birisiydi.  Derme çatma kulübesinde hatunu yeni bebesini büyütürken, Mustafa asırlardır süren bu koruma vazifesini şerefi olarak görüyordu. Köşeleri kırık bir Ranza’sı, ağacına taktığı Hamağı, Dağların soğuk havasında içeride yanan ateş ile Camları buğulanmış bir şekilde her zaman ki gibi oturuyordu. Bu soğuk dağlarda yatağında uzandığında aklına her daim gelen şey hayatının anlamı olmuştu. Onun için tek anlam şükür, görev sadakati ve yiğidini bu yolda büyütebilme tutkusuydu. Herkeste olmayan mangal gibi yüreğe, o mangalların demirleri gibi güçlü pazılara sahipti Mustafa. Bir gün ona uzaktan misafiri olduklarını söylediklerinde böylesine heyecanlanacağı aklının ucuna gelmezdi. Birileri onun koruduğu gizemi deşifre etmek üzere olabilirdi. Kaz dağlarının en korunaklı alanlarında, yer altında özel bir konumda yer alan bir mağarada yıllardır saklanan bir sırrı ortaya çıkarabilecek bu kişileri bir yolunu bulup def etmeliydi. Ayakkabısını giydi, bir fesi andıran şapkasını taktı ve aklında çalan zilleri bastırmaya çalıştı. Eldivenleri, onu her türlü sert dallardan ve bitkilerden koruyor, Kaya parçalarının içerisinden sağlıklı bir şekilde geçmesini sağlıyordu. Artık Mustafa’nın onu arayan misafirleri görmesine az kalmıştı…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "November 22, 2022, 08:12:56 AM",
      "body": "En eksik olduğum yanlardan birisi hazır cevaplılık. Bu konuda fazla iyi olmadığım için rastgele bir kelime belirleyip rastgele cümlelerden oluşturma çalışayım. Seçtiğim kelime Demir.Demir aslında kimyasal bir elementtir. Simgesi Fe olması lazım. Bazı değerlikleri de var öyle hatırlıyorum +2 ve +3 değerlikleri alabiliyor. Bunun dışında gümüşten daha fazla oksitlenmeye uğruyor. Oksitlenme ne demek diyen olursa oksitlenme hidrojen ile girdiği reaksiyon. Paslanma olarak da bahsedebiliriz aslında halk dilinde. Ayrıca güçlü bir metal olduğu içindir tarih boyu en çok kullanılan savaş gereçlerinin yapımı da demirden olmuştur. Buradan kalma dilimize girme Demir gibi diye bir tabir de vardır. Kaç cümle oldu bilmiyorum ancak Demir tarih boyu ilgi çekmeye devam edecektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "November 22, 2022, 07:39:15 PM",
      "body": "Evet gayet güzel cevaplamalar bunlar arkadaşlar. Katılmayan arkadaşlar hadi sizde deneyin şansınızı. Katılan arkadaşlar ise tekrar tekrar katılabilirler. Bunu evde boş zamanlarınızda sesli bir şekilde yapmanız da faydalı olacaktır. Bu şekilde hem topluluk önünde konuşma kabiliyetlerinizi arttırabileceğiniz gibi hem de hazır cevaplılık halinizi geliştirebilirsiniz. Unutmayın sesli düşünmek insanın düşünme stilinde farklılıklarda ortaya koyar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "November 22, 2022, 08:14:35 PM",
      "body": "zımpara, bir çeşit düzleme kağıdıdır üzerinde parlak şeyler oluyor, Google'a bakmak lazım  boyadan önce alçıdan sonra uygulanır ağaç ve metale de uygulanır uygulanan zemini pürüzsüz hale getirmek amaçlanırböylelikle estetik açıdan güzel bir görünüme büründürür zampara ile alakası yoktur",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 22, 2022, 10:34:32 PM",
      "body": "Zurna:Üflemeli bir müzik aleti olup zurna denilince akla mutlaka davulda gelir. Zurnayı herkes kolay kolay üfleyemez.Zurnacın ağzı o kadar sağlam şişer ki ne kadar zor üfledigini fark edebilirsiniz. Ayrıca halk dilinde davetsiz yere davulcu ile zurnacı gelir derler. Çeşitli argo deyimler de vardır. Ne bakiyon la zurna. Ya da birisi zurna derse cevap olarak koyayım da oyna diye cevap verilir. Bir de karşısında ki kişiye zurnamıs8n oğlum sen diye soru da sorulur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "November 27, 2022, 06:05:59 PM",
      "body": "Konuyu katılmamış olanlar için hortlatalım bakalım. 3 5 demeyin konumuza hücum edin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wolwoo",
      "created_time": "November 30, 2022, 03:56:09 PM",
      "body": "ipişçi partisi kısaltması iyi parti de olabilir iplememek tınmamakiplik sözcüğünün kökü pamuk ya da naylondan yapılır geneldeipimle kuşaaam... kaldık pek hazır cevap değilim yaa bazen saatler günler geçer düzgün ifade edebilmek için",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "November 30, 2022, 09:49:53 PM",
      "body": "Zor kelimeler var. Yorum yazan arkadaşlardan istemsizce kopya çekmemek için yorumları okumadım. Ben eldiven kelimesini seçiyorum fakat diğer kelimeler de kolay değil. Aslında seçerken çok kararsız kaldığımı itiraf etmeliyim.Elleri korumak için kullanılır. Ben soğuktan korumak için kullanıyorum. Beden gücü ile çalışan işçiler ellerinin yıpranmasını önlemek için kullanır genelde. Kaliteli bir deri eldiveni ömür boyu kullanabilirsiniz. Yağmurda ıslanmadıkları için ellerinizi de daha iyi korur. Yün eldivenler daha iyi hava alır. Ancak ıslandıklarında kullanışsız olurlar. Özel durumlar haricinde hijyen amacıyla eldiven kullananlar da vardır. Toplu taşımada eldiveni olmayan insanlar otobüs tutacaklarını mendil ile tutar. Pandemide hijyen nedeniyle eldiven kullanan insanların sayısı artmıştır.Yarışmayı hazır cevap olmaktan daha çok hayal gücüne yönelik bir yarışma gibi hissettim. Diğer arkadaşlar ne düşünür bilmiyorum. Bence eğlenceliydi. Teşekkür ederim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "December 08, 2022, 10:48:25 AM",
      "body": "Hamak görünce aklına tatil gelmeyen olmaz. İki ağaç da şarttır. Palmiye türü yaprakları olan ağaç olsa tadından yenmez. Hayalimdeki hamak öyle bi yerde. Sallanırken bazı açılarda güneşin yüzüme vurduğu bi alanda. Hamak keyifli bi tatil aparatıdır. Ama tehlikedir aynı zamanda. Düşme riski çoktur çünkü. Sizi sallaması için yanınızda bi kişi daha olması gerekir ayrıca. Tehlikesi kadar maliyeti de çoktur.  Çocuklar için çok eğlencelidir. Hamak hakkındaki yazdıklarımın hepsi çocukluk anılarımdan çıktı. Tekrar çocuk olamam. Ama bi hamak alıp çocukluk yıllarıma bi ziyaret yapabilirmişim gibi geldi bi an.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l99l",
      "created_time": "December 08, 2022, 12:57:55 PM",
      "body": "Kolye cinsiyet fark etmeden her insanın severek kullandığı bir aksesuar. Kolye ucunda güzel bir tılsımda bulunabilir. Kolyenize manevi değerlerde yükleyebilirsiniz, yada manevi değeri olan bir arkadaşınızdan, sevgilinizden ya da aile bireylerinden biri size hediye etmiştir. Hediye olarak çok yaygın olarak alınır verilir kolyeler.Güzel bir kolyeniz varsa hemen insanların dikkatini çeker, sizin iletişim kurduğunuz insanın kolyesi görünüyorsa gözleriniz her zaman o kolyeye takılır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}