{
  "id": "topic_5397972",
  "title": "MedicNoob",
  "author": "MedicNoob",
  "created_time": "May 10, 2022, 03:20:43 AM",
  "content": "Hello everyone this is my first post here and the first of its kind for that matter.I have been interested in crypto since 2012.Since then I have gotten my bachelor's and a medical degree.I was speaking to a big crypto influencer about the path I chose in life and he told me that medicine and crypto are not mutually exclusive.This makes sense to me as I believe all medical information and coding can be put on a blockchain for many reasons that go beyond efficiency.  I can see the rise of personalized medicine and the potential blockchain technology has in regards to this and I'm very excited.That is why I am asking this community - one of the OGs of the crypto world - what would be the best way to take part in health development concerning the crypto world?Thank you for taking the time to read",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397972",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "May 10, 2022, 03:38:24 AM",
      "body": "Decentralized blockchain and medicine together make no sense because blockchain is very inefficient and making it decentralized wouldn't provide the same amount of privacy as the currently existing centralized database does.You simply can't mix the two, others have tried and failed and majority of them were only scamming people.The only way the two worlds could mix is if doctors, like others, start accepting bitcoin payments alongside their fiat payment.Quote from: MedicNoob on May 10, 2022, 03:20:43 AMa big crypto influencerDid they by any chance tell you about buying some shitcoin too?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 10, 2022, 04:06:20 AM",
      "body": "I am curious to know exactly what kind of medical data you would want to store on a blockchain? (obviously not on Bitcoin as its too slow for that)From a non-medial person's perspetive, doesn't your industry deal with a lot of sensitive data that must be kept secret anyway such as patient info? Researchers post purely biological info inside research papers already, so I'm at a loss as to what you want to store using a blockchain (or, in fact, what companies like AWS offer to store for them, for that matter).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MedicNoob",
      "created_time": "May 10, 2022, 04:13:50 AM",
      "body": "Quote from: pooya87 on May 10, 2022, 03:38:24 AMDecentralized blockchain and medicine together make no sense because blockchain is very inefficient and making it decentralized wouldn't provide the same amount of privacy as the currently existing centralized database does.You simply can't mix the two, others have tried and failed and majority of them were only scamming people.The only way the two worlds could mix is if doctors, like others, start accepting bitcoin payments alongside their fiat payment.Not entirely.  I won't get into the details but you can have use cases for both decentralized and centralized blockchains for both individuals and corporations like health insurances.QuoteI am curious to know exactly what kind of medical data you would want to store on a blockchain? (obviously not on Bitcoin as its too slow for that)From a non-medial person's perspetive, doesn't your industry deal with a lot of sensitive data that must be kept secret anyway such as patient info? Researchers post purely biological info inside research papers already, so I'm at a loss as to what you want to store using a blockchain (or, in fact, what companies like AWS offer to store for them, for that matter).Well I can start by talking about the human genome which is about 3Gb of data and which I think can actually be halved considering there are no wobbles.  This info is gold in the next couple of years.  And you're entirely right - medical information is highly sensitive - to have a blockchain encrypting this data would be invaluable and ethically sound as technology moves on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 10, 2022, 04:54:03 AM",
      "body": "Quote from: MedicNoob on May 10, 2022, 04:13:50 AMWell I can start by talking about the human genome which is about 3Gb of data and which I think can actually be halved considering there are no wobbles.  This info is gold in the next couple of years.  And you're entirely right - medical information is highly sensitive - to have a blockchain encrypting this data would be invaluable and ethically sound as technology moves on.So that is basically bioinformatics gene sequences encoded as FASTA and the like (I have read a certain bioinformatics with python book from o'reilly).If I am understanding you correctly, you want to keep this data immutable (because that is a property of blockchains)? If not, then why not simply post it on WWW servers whose content can be changed later?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "death69",
      "created_time": "May 10, 2022, 02:13:57 PMLast edit: May 10, 2022, 02:27:40 PM by death69",
      "body": "Quote from: MedicNoob on May 10, 2022, 04:13:50 AMWell, I can start by talking about the human genome which is about 3Gb of data and which I think can actually be halved considering there are no wobbles.  This info is gold in the next couple of years.  And you're entirely right - medical information is highly sensitive - to have a blockchain encrypting this data would be invaluable and ethically sound as technology moves on.From what I know, Distributed ledger technology is considered a foundation of the blockchain (although there have been many upgrades and alterations) which contains different nodes to maintain the network. Currently, people estimate that there are around 15000 nodes, each full node is around 390GB. Therefore, in order to maintain a medical-based blockchain that contains genomes of 1 million customers, each node has to be a size of an enormous database. This is capable in the far future because technology advances every year. However, I still do not think it is a good idea. And, not, as far as I know, nothing is unhackable. We have seen many blockchains being hacked and lost millions of dollars. Shifting from the current defense system to the blockchain requires the cybersecurity team to extend their knowledge to protect not only one but more than 2 database systems. It is extremely hard to maintain Confidentiality, Integrity, and Availability for such data. And no matter how hard you try to harden the system, human is still the main factor that causes everything. Ronin's network was hacked and from what I know it is because an employee was exploited so sensitive information has been stolen. And you need to know that they have 9 nodes Therefore, a single centralized database is still a better option because right now, there have been many advanced defensive mechanisms with experienced engineers. You can create a many-layer system, use a virtual machine, fracture your data, etc...My friend told me that AI will have the biggest impact on the medical system in the future. Why? There is actually not much data for them to research, and analyze to form a model and AI has the power to create new and fresh samples for more information so that scientists/doctors can draw a more precise conclusion. Just like deep fake technology that can create a non-existing person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "May 10, 2022, 03:09:02 PM",
      "body": "Quote from: MedicNoob on May 10, 2022, 03:20:43 AMThat is why I am asking this community - one of the OGs of the crypto world - what would be the best way to take part in health development concerning the crypto world?There are many things you can do about health, services, medical, patients, pharmacists, medicine and so on, if you want to work with blockchain, crypto/Bitcoin.Before you ask about developments, especially in the field of health and crypto, doctors and other health fields have done it first, there are interesting things you can learn about health and crypto.Example:• Healthcare & Cryptocurrency: How Do They Work Together?• Blockchain: A new technology for global health development?• 5 blockchain healthcare use cases in digital health.I hope the information above can be an innovative input for you in the future.Honestly, we'd love to hear you've done something about health and crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "May 10, 2022, 03:33:44 PM",
      "body": "I remember some altcoin projects that had ideas about medical and health before but I totally forgot about the name of the project but the search feature on coin market cap can help you find the project.I'm probably not the only one here who says it's difficult to develop this idea into a project that will be hugely successful in the future. I don't know how anyone can think it's a potential thing considering that several projects with the same idea previously weren't enough to keep investors and traders interested in trading it in the long term. Anyway I don't know exactly what you want to do with the idea, but I hope it's not the worst idea you've ever thought.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bill gator",
      "created_time": "May 10, 2022, 09:40:51 PM",
      "body": "Quote from: MedicNoob on May 10, 2022, 03:20:43 AMI believe all medical information and coding can be put on a blockchain To a lot of people in this community, myself included, putting your most sensitive information that could be extremely impactful onto a public ledger sounds like a nightmare. Even if it were encrypted or secured in various ways, I personally would not feel safe enough to allow my medical information to be divulged over a blockchain. What would be the benefit to doing something like this? Quote from: MedicNoob on May 10, 2022, 03:20:43 AMwhat would be the best way to take part in health development concerning the crypto world?Cryptocurrency and medicine might be a good coupling for Telemedicine, which has seen a big rise in the past few years. I'd like to think that blockchain technology could help simplify and improve the billing/payment processes in the medical industry, but I don't have a specific applicable-solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 11, 2022, 03:19:52 AM",
      "body": "Quote from: MedicNoob on May 10, 2022, 04:13:50 AMNot entirely.  I won't get into the details but you can have use cases for both decentralized and centralized blockchains for both individuals and corporations like health insurances.Why not? I would love to hear what you think the details are because after years of seeing others trying to mix both and nothing coming out of it, I can not think of any reasons why they should be mixed.The biggest problem is that there is no logical answer to these questions:If the health care system, the hospitals, the insurance companies, etc are all centralized why should the patient data be decentralized? If it doesn't need to be decentralized then why use blockchain? You see how it falls apart when you ask the right questions?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "May 11, 2022, 03:59:52 AM",
      "body": "Generally when talking about crypto it's about \"profit\" especially if you mean implementing blockchain into it which has to create new coins/tokens. In this case it seems unethical to mix medical (humanitarian) activities with the smell of profit (economics). Unless you aim to trade such as medicines, medical devices or insurance and it is not directly involved in saving human lives.As Falconer points out, several projects in the medical world have been made and don't seem to get much attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 11, 2022, 05:58:23 AM",
      "body": "Current estimates put the amount of data generated by each patient to be around 80 megabytes per patient per year. Looking at the US alone with its population of 330 million, that equates to 26.4 petabytes per year. Within 10 years, your blockchain will be 264 petabytes are growing exponentially, due to both the increased population and the fact that each patient will create more data due to things like new scanning methods and techniques which are higher resolution and therefore generate more data. Or for your example regarding the human genome and personalized medicine, even with the lower bound of 1.5 GB per person, then for the same population you are now looking at 495 petabytes.How to you plan on storing such massive amounts of data on a blockchain? For reference, 264 petabytes is about 6,500x times larger than the bitcoin blockchain, and that's just for the citizens of one country.Second question - why? What benefits does it bring? It is expensive and less efficient. Why do it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "May 11, 2022, 10:53:11 AM",
      "body": "Quote from: pooya87 on May 10, 2022, 03:38:24 AMDid they by any chance tell you about buying some shitcoin too?Or developing your own medi token that will have no purpose like the rest of the shitcoins in the market. Quote from: o_e_l_e_o on May 11, 2022, 05:58:23 AMHow to you plan on storing such massive amounts of data on a blockchain? For reference, 264 petabytes is about 6,500x times larger than the bitcoin blockchain, and that's just for the citizens of one country.This is insane amount of storage and you can't handle such data with time as the patients would increase and it is leaving behind the rest of 192 countries also.For some countries it will grow even further where people have more disease and how will you store such big data as it will take lot of time.So it is not going to be possible at this time.Quote from: o_e_l_e_o on May 11, 2022, 05:58:23 AMSecond question - why? What benefits does it bring? It is expensive and less efficient. Why do it?Moreover the thing is you consult your doctor and you won't hope that your medical records will be updated on the blockchain so as some outsiders use this information against you.Blockchain is transparent ledger but don't think is suitable for such purpose.There is no need as your doctor will treat you and in return you will pay him but this doesn't involve any blockchain interaction so it's not the good option according to me also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bill gator",
      "created_time": "May 11, 2022, 01:00:49 PM",
      "body": "Quote from: o_e_l_e_o on May 11, 2022, 05:58:23 AMCurrent estimates put the amount of data generated by each patient to be around 80 megabytes per patient per year.Any idea how efficiently patient-data is currently generated and stored?  If I had to guess, it is probably extremely archaic and inefficient because storage space has never needed to be a priority.If we were to put this data on a blockchain, it is entirely possible that we could come up with a more efficient way to transmit and store the data than what is currently being used. Once you have storage space as a real consideration, like in our decentralized example, then there is a lot more incentive to improve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dataispower",
      "created_time": "May 13, 2022, 02:09:21 PM",
      "body": "Quote from: MedicNoob on May 10, 2022, 03:20:43 AMHello everyone this is my first post here and the first of its kind for that matter.I have been interested in crypto since 2012.Since then I have gotten my bachelor's and a medical degree. if you have interest for bitcoin nothing will mak you to lose tension for bitcoins. Work with your vision, since you have nursing the way to know bitcoin more abd be perfect for it.Quote from: MedicNoob on May 10, 2022, 03:20:43 AMI was speaking to a big crypto influencer about the path I chose in life and he told me that medicine and crypto are not mutually exclusive.And no course of profession is mutual with cryptocurrency. Cryptocurrency is a choice, decision, time and passion you have for it will make it to work. A medical profession trade with bitcoin as second discipline and it will help to increase the source of getting finance. Except you don't want to participate with cryptocurrency, if you have the passion cryptocurrency will be nice for you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "May 13, 2022, 09:56:13 PM",
      "body": "Quote from: dataispower on May 13, 2022, 02:09:21 PMQuote from: MedicNoob on May 10, 2022, 03:20:43 AMHello everyone this is my first post here and the first of its kind for that matter.I have been interested in crypto since 2012.Since then I have gotten my bachelor's and a medical degree. if you have interest for bitcoin nothing will mak you to lose tension for bitcoins. Work with your vision, since you have nursing the way to know bitcoin more abd be perfect for it.Quote from: MedicNoob on May 10, 2022, 03:20:43 AMI was speaking to a big crypto influencer about the path I chose in life and he told me that medicine and crypto are not mutually exclusive.And no course of profession is mutual with cryptocurrency. Cryptocurrency is a choice, decision, time and passion you have for it will make it to work. A medical profession trade with bitcoin as second discipline and it will help to increase the source of getting finance. Except you don't want to participate with cryptocurrency, if you have the passion cryptocurrency will be nice for youIn Cryptocurrencies world you are welcome even on how you are professional or what is your degree does not matter because in crypto we are all equal. And it's nice to hear that a medical doctor want to enter the world of crypto. Trading in crypto is a good choice you made and by this forum you will learn a lot OP and this forum will be your second school. Go for your dreams buy cryptocurrencies for your start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 14, 2022, 03:20:36 AM",
      "body": "Quote from: bill gator on May 11, 2022, 01:00:49 PMQuote from: o_e_l_e_o on May 11, 2022, 05:58:23 AMCurrent estimates put the amount of data generated by each patient to be around 80 megabytes per patient per year.Any idea how efficiently patient-data is currently generated and stored?  If I had to guess, it is probably extremely archaic and inefficient because storage space has never needed to be a priority.If we were to put this data on a blockchain, it is entirely possible that we could come up with a more efficient way to transmit and store the data than what is currently being used. Once you have storage space as a real consideration, like in our decentralized example, then there is a lot more incentive to improve.Why do you think blockchain is more efficient? Because it is actually the least efficient database that has ever existed. For example your full node has to add another big index on top of blockchain just to be able to function (it is called chainstate or UTXO set) if you want to add another utility or search function on top, you will have to add another index on top consuming a lot more space (like Electrum or what the block explorers do).Blockchain is also immutable by design whereas you don't need patient data to be immutable. For example you may enter someone's name wrong and have to be able to change that. You can't do it with a blockchain without adding bloat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bhig Daddy",
      "created_time": "May 14, 2022, 06:09:18 AM",
      "body": "I still don't get how bitcoin and medical Data work together, because to me there are alot sensitive data in the medical line which are supposed to be kept private, we'll I know I don't really know much about medical data but I know patient data are to be kept privately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}