{
  "id": "topic_5436040",
  "title": "Elesgadlo",
  "author": "Elesgadlo",
  "created_time": "January 19, 2023, 04:58:40 PM",
  "content": "Hi, I want to delete my account.I've seen that it's not possible, however tt's required to be possible by DGPR. How can we proceed",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436040",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "January 19, 2023, 05:12:29 PM",
      "body": "Why do you even want to delete your account, you seem to barely have any activity at all.I would have guessed that you wanted to delete it because you have posted too much personal information or something like that, but it is not the case.what about just stop logging in?Besides, perhaps some day you may feel like coming back around here, as a valuable member of our community",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "January 19, 2023, 05:32:24 PMLast edit: January 19, 2023, 05:46:10 PM by LoyceV",
      "body": "Quote from: Elesgadlo on January 19, 2023, 04:58:40 PMI've seen that it's not possible, however tt's required to be possible by DGPR.You mean GDPR?QuoteHow can we proceedYou won't. What makes you think the EU has any power over Bitcointalk?Quote from: Admin theymos in 2017I intend to ignore all stupidity coming out of the EUSSR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 19, 2023, 05:43:11 PM",
      "body": "Quote from: Elesgadlo on January 19, 2023, 04:58:40 PMHi, I want to delete my accountIt's not possible. The easiest way is to delete all your 3 posts, forget this account and move on.Bitcointalk is not GDPR compliant and not based in EU so they don't have any jurisdiction over this site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "January 19, 2023, 05:53:46 PM",
      "body": "He may be trying to hide something related to those addresses that  he posted, but unfortunately, even if the account is deleted, many sites recording/scarping every data that was published (after about 3 seconds or less), so there is no point in deleting the account.The best solution is to delete your social media accounts and then use mixing services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "January 19, 2023, 05:57:14 PM",
      "body": "Basically, if you ever visit a website for the first time and it doesn't immediately bombard you with requests for cookies, work on the assumption that they're not paying attention to any regulations of that nature.  Don't register an account on such sites up if you want to retain the right to be forgotten.  On top of that, everything posted on Bitcointalk is independently archived by several forum users, so even if you could delete your account, there would still be a record of everything you've contributed here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "January 19, 2023, 06:00:06 PM",
      "body": "Quote from: Elesgadlo on January 19, 2023, 04:58:40 PMI want to delete my account.There is no option for deleting Account on this forum . So we can't start any proceed.  And I don't think forum need have to full fill the any require from   DGPR. and if you have any problem with it then just turn off using the account.  and if there is any problem with the given name, then the perfect name should be chosen in advance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "January 19, 2023, 06:00:20 PM",
      "body": "Quote from: DooMAD on January 19, 2023, 05:57:14 PMBasically, if you ever visit a website for the first time and it doesn't immediately bombard you with requests for cookies, work on the assumption that they're not paying attention to any regulations of that nature.  Don't register an account on such sites up if you want to retain the right to be forgotten.  On top of that, everything posted on Bitcointalk is independently archived by several forum users, so even if you could delete your account, there would still be a record of everything you've contributed here. Bitcointalk doesn't set any cookies excerpt for the session cookie created right after you log in. This is required for logging in and technically classified as an \"essential cookie\" as otherwise this site would turn into a ghost town if everybody turned it off.  So it would never need a cookie banner in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}