{
  "id": "topic_5468639",
  "title": "Onyeeze",
  "author": "Onyeeze",
  "created_time": "September 30, 2023, 10:20:01 AM",
  "content": "Bitcoin investment, this is the opportunity for someone who wants to invest in bitcoin to invest in bitcoin without looking back, because anyone that invest in bitcoin now will make a profit during bullrun, the price of bitcoin is fluctuating and it does want to up since the price has being to twenty six thousand [26] is over one month or less than one month the price is being unrotational for price, I think that any one that plan to become a billionaire in bitcoin this is the opportunity to invest in bitcoin against next bullrun.The way I'm looking at next bullrun am thinking that the bullrun will be something that will push bitcoin price  to approach hundreds thousands [100] for the price, but people will not invest now. I split my funds currently to different of coins expecting that if I don't make profit in any of the coins when bullrun comes I will surely make profit in bitcoin because bitcoin price now is no longer going downward or going upwards, but any move the price will make to go up the price will increase, I'm expecting the price of bitcoin to rise in 2025 and 2026 so any investment in bitcoin  should be expected till next two years or three years time. Summary, invest in bitcoin and forget about the investment and hope that you will make profit after some years coming.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468639",
  "comments": [
    {
      "author": "kryptqnick",
      "created_time": "September 30, 2023, 10:28:20 AM",
      "body": "I agree with your estimates regarding the potential price of Bitcoin (although I'm probably on the lower side of hundreds of thousands, something like $100k-$200k) and about the timing (I expect it to be somewhat earlier, but the beginning of 2025 makes sense to me). An idea to invest and forget isn't bad, unless a person is very uncertain about Bitcoin and believes that there's a good chance Bitcoin won't recover in the foreseeable future (let's say, over the next 10 years). It's not impossible, so it should be taken into account. And it's also important that while forgetting about the investment, we must not forget where it's being stored and how to access that wallet. I think some early adopters invested in Bitcoin and forgot, but then unfortunately couldn't make use of it because of not having access to the funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "September 30, 2023, 10:37:26 AM",
      "body": "We need to connect all the facts that we have known till now about bitcoins. We know that bitcoins are limited in number, that is there is fixed amount of supply of the bitcoins. Hence we can consider bitcoins as a precious asset. Hence, we should always keep on collecting or accumulating the bitcoins.  A Time will come when there will be scarcity of bitcoins and at that time if you have enough bitcoins in the wallet, then you can sell them for a very high price. Hence, whatever OP said, it’s good. So invest in Bitcoins and keep the coins untouched for many years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 30, 2023, 10:50:36 AM",
      "body": "What you say is like, \"Invest now, then hold long-term.\" Actually, this is one of the best things to do for anyone, especially beginners who believe in Bitcoin, even if they don't have enough knowledge about it. And once someone has done this, they can actually add DCA this way while they wait for the right time to sell Bitcoin.As long as you have extra budget money, buy it again, even if it's a little bit, and at least somehow your holding are increased because your future savings are sure here in my view and belief in Bitcoin. There are people who still don't want to invest now. Believe me, when the price of Bitcoin is high, those people will buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 30, 2023, 11:12:57 AM",
      "body": "Quote from: Onyeeze on September 30, 2023, 10:20:01 AMBitcoin investment, this is the opportunity for someone who wants to invest in bitcoin to invest in bitcoin without looking back, because anyone that invest in bitcoin now will make a profit during bullrun, the price of bitcoin is fluctuating and it does want to up since the price has being to twenty six thousand [26] is over one month or less than one month the price is being unrotational for price, I think that any one that plan to become a billionaire in bitcoin this is the opportunity to invest in bitcoin against next bullrun.The bitcoin market is definitely going sideways and it seems like this is how it will be for the rest of this year. So the best thing is to invest only what you can hold for a very long time now. But the statement about been a billionaire is something that I don’t really go with because even in the next bull run the most anticipated like price high isn’t going to be above 5x although it go anywhere. But for someone with just few thousands then it will be hard to see them turn billionaire over night, only someone who invested hundreds of millions can actually get to a billion but also not in profits. So the billionaire tag is not realistic. QuoteThe way I'm looking at next bullrun am thinking that the bullrun will be something that will push bitcoin price  to approach hundreds thousands [100] for the price, but people will not invest now. I split my funds currently to different of coins expecting that if I don't make profit in any of the coins when bullrun comes I will surely make profit in bitcoin because bitcoin price now is no longer going downward or going upwards, but any move the price will make to go up the price will increase, I'm expecting the price of bitcoin to rise in 2025 and 2026 so any investment in bitcoin  should be expected till next two years or three years time. Summary, invest in bitcoin and forget about the investment and hope that you will make profit after some years coming.  yes a realistic approach will be to settle for 100k and it is possible we could meet that target in the year 2025 or 2026 because of the past trends. I wound also say all investment should strictly be in bitcoin because the risk of having them In Alticoins just for profit is big but if you some money you can gamble then you can swing to Alticoins but do not place any realist hope on them",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "September 30, 2023, 11:14:44 AM",
      "body": "It's a great feeling when you invest in something that you can afford without thinking about whether it has made a profit or not. Because if you think about something, apart from being confident that you will make money, it also shows that you are a disciplined person. You should also know and accept that investing has risk, so it's no guarantee that you will make profit, there is a chance that you will lose because we can't control what we invest. But, as an exception, if you know when to invest in Bitcoin, you will undoubtedly profit; there is no particular period when this will take place, as long as you do not sell it below your buying price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "September 30, 2023, 12:15:10 PM",
      "body": "Quote from: Onyeeze on September 30, 2023, 10:20:01 AM I split my funds currently to different of coins expecting that if I don't make profit in any of the coins when bullrun comes I will surely make profit in bitcoin because bitcoin price now is no longer going downward or going upwards, but any move the price will make to go up the price will increase There's no guarantee in altcoins investment as you can split your fund as much as you like and still lose in all the altcoins you invested into. Nobody knows the next altcoin that'll be pumped by whales for their selfish gains and later dumped as they have been doing whenever there's a bullish momentum in the market. It's better you don't have any altcoin Investment than putting your hopes on profiting from them as all investment in them should be consider as just a gamble (if you can't resist to invest in them). Put more money into your Bitcoin portfolio and keep increasing your stash. Just as you said, you can invest and take your mind off it but only do that when you have invested and taken your Bitcoin off exchange to stored in a secured hardware wallet or any other non custodial, open source recommended wallet.QuoteI'm expecting the price of bitcoin to rise in 2025 and 2026 so any investment in bitcoin  should be expected till next two years or three years time. Summary, invest in bitcoin and forget about the investment and hope that you will make profit after some years coming.These are all speculations as the past doesn't guarantee the future even when it comes to Bitcoin so we should Invest wisely, we should have the mindset that anything can happen. We expect the price to rise after the halving is completed but we shouldn't expect it to happen at a specific date or year as we might be disappointed (but very unlikely to happen). The only thing I can say is, the future of Bitcoin is going to have the price increase so our investment should be that for the future and not an immediate expectation of profit. A Bitcoin investor should have a long term mindset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "September 30, 2023, 12:35:49 PM",
      "body": "Quote from: Onyeeze on September 30, 2023, 10:20:01 AMBitcoin investment, this is the opportunity for someone who wants to invest in bitcoin to invest in bitcoin without looking backIf you're a bitcoin investor, then it is expected of you to invest and hold, but after doing that, you're also expected to to monitor your investment and keep track on the market trends and not that you left and leave without having focus on what you have invested in, when you invest on bitcoin, it is also required of you not to release your investment for other digital currencies, not to sell when you should hold and not to handle your wallet security carelessly after making an investment in other not for others to have access to your fund and steal them from you by any means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "September 30, 2023, 12:38:15 PM",
      "body": "It’s always advisable and has been proven that those who invest in bitcoin and don’t think about trading or selling them off any time soon from their initial time of investment always happens to be the winners at the end of the day. Why one decide to invest they should always make sure that they have something doing which can benefit them and give them a little earnings which will make them remove their attention on how their investment is doing and they can’t get moved by any small price drop. Investing and pretending to forget the investment why you are allowing it to grow is one best way to take a large profit out of the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "September 30, 2023, 12:58:38 PM",
      "body": "You can do this, meaning you buy Bitcoin, save it for the next few years and buy again, and so on. That will prevent you from panicking if the price of Bitcoin moves down to another low price because that's usually what happens to people. And if people want to start investing in Bitcoin, now is still a good time, especially since Bitcoin prices are still low.By doing DCA every week or month and doing it for 1 year until next year, he can make a lot of profit, depending on the amount of Bitcoin he has. But he can also keep Bitcoin for the long term, perhaps for the next few years. And it depends on the investment plan.At least, by using this method, you can be calm in making your investment. You will not be confused or panicked by Bitcoin price movements. You can also do other things while carrying out the investment plan until the time comes for you to sell it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terrific",
      "created_time": "September 30, 2023, 01:05:27 PM",
      "body": "It's like invest and go back on it when the price is higher. Like what everybody is expecting for Bitcoin, it's on 2025-2026 that we're moving forward to see the higher price.But I think in 2026, it's more of when the bear market will occur than of the extension of the bull run. We shall see it then but most like starting next year, during and after the halving there could be around 1.5 years for the bull run so it's like up to 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "September 30, 2023, 01:07:38 PM",
      "body": "Everyone wants Bitcoin, right? Let's step back and see the big picture. Bitcoin has had its moments, and it may have more. Everyone must realize that past performance doesnt always predict future results.Yes, I understand. Youre excited. You see the potential and think now is your chance. But what if its not? What if the market wont act as expected? Not that you shouldnt invest, but that everyone should know about the risks. Increase your investing diversification? Dont put all your eggs in one basket, right?Everyone wants to ride the Bitcoin train, but are we ready for the black swan? Bitcoin investing and forgetting about it sounds great, but what if the world changes in those \"forgotten\" years?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 30, 2023, 01:12:23 PM",
      "body": "I agree with the message the OP wants to convey and a parallel comes to mind, which is that the most profitable portfolios in the stock market are those that are not touched for many years after buying. Obviously you have to buy top quality assets to make it work. What I don't agree with is this:Quote from: Onyeeze on September 30, 2023, 10:20:01 AMBitcoin investment, this is the opportunity for someone who wants to invest in bitcoin to invest in bitcoin without looking back, because anyone that invest in bitcoin now will make a profit during bullrun, the price of bitcoin is fluctuating and it does want to up since the price has being to twenty six thousand [26] is over one month or less than one month the price is being unrotational for price, I think that any one that plan to become a billionaire in bitcoin this is the opportunity to invest in bitcoin against next bullrun.The way I'm looking at next bullrun am thinking that the bullrun will be something that will push bitcoin price  to approach hundreds thousands [100] for the price, but people will not invest now. You haven't stopped to do the maths, as happens in many of these threads. To be a billionaire in the next bull run you will need to invest a lot more money than you think. With the numbers you give, if you have $1,000 in bitcoin now, you will have $4,000 when the price reaches $100,000. Let's be optimistic and assume that the price next cycle doubles that amount, so you will have $8,000. To become a billionaire you would have to start with $125,000,000 and I don't think you have that.Bitcoin can give you a good return but it is not going to change your life in one cycle. For something significant you are going to have to invest aggressively for a couple of cycles, but I recommend taking it easy, investing little by little and enjoying the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WillyAp",
      "created_time": "September 30, 2023, 01:35:47 PMLast edit: September 30, 2023, 05:16:51 PM by WillyAp",
      "body": "Quote from: Onyeeze on September 30, 2023, 10:20:01 AM I think that any one that plan to become a billionaire in bitcoin this is the opportunity to invest in bitcoin against next bullrun.The way I'm looking at next bullrun am thinking that the bullrun will be something that will push bitcoin price  to approach hundreds thousands [100] for the price, but people will not invest now. You are aware that the economy is kind of tanking right now?We are on the brink of ww3, multiple chances to start a war which is the one piece needed for many governments to restart their economy. Its a marvel of time that Bitcoin can be that stable. The $100.000 mark requires a lot of people to make good extra money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 30, 2023, 01:45:54 PM",
      "body": "Quote from: Onyeeze on September 30, 2023, 10:20:01 AMBitcoin investment, this is the opportunity for someone who wants to invest in bitcoin to invest in bitcoin without looking back, because anyone that invest in bitcoin now will make a profit during bullrun, the price of bitcoin is fluctuating and it does want to up since the price has being to twenty six thousand [26] is over one month or less than one month the price is being unrotational for price, I think that any one that plan to become a billionaire in bitcoin this is the opportunity to invest in bitcoin against next bullrun.The way I'm looking at next bullrun am thinking that the bullrun will be something that will push bitcoin price  to approach hundreds thousands [100] for the price, but people will not invest now. I split my funds currently to different of coins expecting that if I don't make profit in any of the coins when bullrun comes I will surely make profit in bitcoin because bitcoin price now is no longer going downward or going upwards, but any move the price will make to go up the price will increase, I'm expecting the price of bitcoin to rise in 2025 and 2026 so any investment in bitcoin  should be expected till next two years or three years time. Summary, invest in bitcoin and forget about the investment and hope that you will make profit after some years coming. It is not wrong in the matter of the price and how bitcoin can make us enter a positive Return (ROI), it is always there latent, there are people who do it every second, we do not have to wait long to enter a profit at the end of month with ranges in green.Now, its appreciation has the variable volatility vs. expectation, it is speculation, yes, it will have 6 figures, the issue is when, they are two variables that work well for a long-term investment, I like to write this in simple words , especially since it is not on trade discussion board, since the idea in my opinion on this fair board is always to have a discussion about bitcoin as simple as possible.And, based on that, those of us who \"live\" in this forum understand it,OP topic, which is repeated regularly and grows when the halving is near, in short, the other thing, do not use the adjective millionaire, is to create \" smoke orange.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "September 30, 2023, 01:58:28 PM",
      "body": "Quote from: Onyeeze on September 30, 2023, 10:20:01 AMThe way I'm looking at next bullrun am thinking that the bullrun will be something that will push bitcoin price  to approach hundreds thousands [100] for the price, but people will not invest now. I split my funds currently to different of coins expecting that if I don't make profit in any of the coins when bullrun comes I will surely make profit in bitcoin because bitcoin price now is no longer going downward or going upwards, but any move the price will make to go up the price will increase, I'm expecting the price of bitcoin to rise in 2025 and 2026 so any investment in bitcoin  should be expected till next two years or three years time. It's good if you have a strategy for investing and most people may have difficulty providing capital when they want to buy, even though Bitcoin investment can be done in any amount. If you intend to collect bitcoins regularly then DCA can be applied as a strategy. I am a bit confused to understand what you mean by splitting multiple coins and if you think Bitcoin is one of the best investments, why would you prefer multiple coins to invest simultaneously. Other coins may not be able to show strength in sustaining themselves in the market and many risks may take you to the stage of loss as many coins suddenly die in the market.Quote from: Onyeeze on September 30, 2023, 10:20:01 AMSummary, invest in bitcoin and forget about the investment and hope that you will make profit after some years coming. That's the advantage when people invest in bitcoin and don't need to think about any conditions because bitcoin can provide a price spike when the four-year cycle arrives. If today you invest some money in bitcoin, in the next few years you will make a profit once bitcoin finds its next ATH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "September 30, 2023, 01:59:59 PM",
      "body": "Quote from: Onyeeze on September 30, 2023, 10:20:01 AM Summary, invest in bitcoin and forget about the investment and hope that you will make profit after some years coming. This is the best way when we invest in bitcoin and I believe any bitcoin investor knows about this but I don't think many people will do this. People will always check the bitcoin price every day and always check their investment portfolio every day. It's very easy to say, but to do it, not too many people can do it because they are investing with their own money and no one wants to take their eyes off their money. But you're right, the people who do that are mostly the ones who make huge profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "September 30, 2023, 02:13:53 PM",
      "body": "Easy to say from your mouth but to leave the BTC in your wallet for  long is the issue to some people because once there is a home challenges that require huge amount of money you will rush to sell your BTC without consider the price at the moment. Many people has use this opportunity well in this long bear run to buy as much they want to buy and hold for the bull run to come before they can sell and it will be difficult for such people to miss their opportunity when the price hit $100k. If you invest in BTC try to apply long holding to it, I guess you will not regret with your decision because long term holders make more money from their holding than short term holders in the community because short term holders don't use to hold their BTC like 1 or 2 years before they will sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Btc_1856",
      "created_time": "September 30, 2023, 02:34:55 PM",
      "body": "Quote from: WillyAp on September 30, 2023, 01:35:47 PMQuote from: Onyeeze on September 30, 2023, 10:20:01 AM I think that any one that plan to become a billionaire in bitcoin this is the opportunity to invest in bitcoin against next bullrun.The way I'm looking at next bullrun am thinking that the bullrun will be something that will push bitcoin price  to approach hundreds thousands [100] for the price, but people will not invest now. You are aware that the economy is kind of tanking right now?We are on the brink of ww3, multiple chances to start a war which is the one piece needed for many governments to restart their economy. Its a marvel of time that Bitcoin can bet that stable. The $100.000 mark requires a lot of people to make good extra money. There will be no third world war, you don't need to be so pessimistic. Recession? Even if it happens, it has to end at some point, it can't last forever so you don't need to worry too much about it affecting bitcoin. I still believe bitcoin will reach $100k or more in the next bull season. Of course, that won't happen right after the halving, it will take some time. And I think that's also when the world economy is gradually recovering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "September 30, 2023, 02:39:34 PM",
      "body": "Quote from: Onyeeze on September 30, 2023, 10:20:01 AM  The way I'm looking at next bullrun am thinking that the bullrun will be something that will push bitcoin price  to approach hundreds thousands [100] for the price, but people will not invest now. I split my funds currently to different of coins expecting that if I don't make profit in any of the coins when bullrun comes I will surely make profit in bitcoin because bitcoin price now is no longer going downward or going upwards, but any move the price will make to go up the price will increase, I'm expecting the price of bitcoin to rise in 2025 and 2026 so any investment in bitcoin  should be expected till next two years or three years time. Summary, invest in bitcoin and forget about the investment and hope that you will make profit after some years coming. Your expectation is high at $100,000, but it's not impossible. But it is better to keep your hopes not too high to avoid being too greedy and missing the opportunity to cash out some profit.  It seems you have so much money to risk in altcoins and how are you sure that you can recover your losses incurred from altcoins through your profits from Bitcoin? It will be better to focus only on Bitcoin if you don't have confidence in any altcoins.  Quote from: Ever-young on September 30, 2023, 12:38:15 PMWhy one decide to invest they should always make sure that they have something doing which can benefit them and give them a little earnings which will make them remove their attention on how their investment is doing and they can’t get moved by any small price drop. Investing and pretending to forget the investment why you are allowing it to grow is one best way to take a large profit out of the market.Bitcoin is not an investment that one can rely on as a daily source of income. So investors will always have full or part-time jobs that provide their daily needs. Whether we are investing using a lump sum or DCA strategy there is always a need to have a plan for our investment. In drafting our budget or plans we should always invest only what we can afford to live without. We should put in money that will not affect our all-round well-being even when plans fail to achieve it's target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}