{
  "id": "topic_5464044",
  "title": "cyrilmorris",
  "author": "cyrilmorris",
  "created_time": "August 21, 2023, 12:50:21 PM",
  "content": "Hello, fellow DeFi enthusiasts!I stumbled upon this incredibly insightful article discussing the intersection of traditional investments and the world of decentralized finance (DeFi). The concept of wrapped assets is truly fascinating and marks a significant stride towards bridging the gap between the conventional financial world and the innovative realm of DeFi.Wrapped assets, as explained in the article, are essentially tokenized versions of traditional assets like stocks, commodities, and fiat money. The magic lies in the process of wrapping these assets into a digital layer, making them compatible with DeFi platforms and blockchain networks. It's akin to bringing the best of both worlds together!For instance, Wrapped Bitcoin (WBTC) is a prime example of a wrapped asset – a token backed 1:1 by actual Bitcoin. This not only introduces more fluidity and readability but also preserves the core value of the original asset.What excites me most about wrapped assets is their potential to enhance accessibility. These tokens unlock doors to a more diverse range of assets within the DeFi landscape. By enabling assets like stocks and real estate to seamlessly integrate, the liquidity pool in DeFi grows, making users happier and more engaged.Moreover, the interoperability of wrapped assets is truly groundbreaking. It allows assets to traverse different blockchains while maintaining their value. Imagine the possibilities of using Ethereum smart contracts with Bitcoin or other assets – that's a game-changer!The benefits span far and wide, from isolating volatility exposure to improving capital efficiency. Additionally, the decentralized structure of wrapped assets aligns perfectly with the ethos of DeFi – transparency, security, and non-custodial structures.The use cases mentioned in the article also show the versatility of wrapped assets. They can be used as collateral, for liquidity mining, token trading, leveraged trading, and much more. The potential for innovation seems limitless.Of course, it's not all roses. There are risks associated with wrapped assets, including counterparty risk and smart contract vulnerabilities. Regulatory uncertainties and liquidity challenges also come into play. However, understanding these risks and trade-offs is crucial for any savvy investor or DeFi enthusiast.The article goes on to highlight a fantastic opportunity – the chance to collaborate with RWaltz, a leading DeFi development company. If you're passionate about pushing the boundaries of DeFi and want to harness the power of wrapped assets, this seems like a golden opportunity to explore.As we stand on the precipice of financial transformation, let's continue to engage with these fascinating developments and contribute to shaping the future of finance through innovation and collaboration.https://rwaltz.com/blog/wrapped-assets-in-defi-expanding-access-to-traditional-investmentsHappy discussing and learning, everyone!Cheers,",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464044",
  "comments": [
    {
      "author": "Darker45",
      "created_time": "August 22, 2023, 03:26:37 AM",
      "body": "This DeFi landscape is a questionable and complicated landscape, though. Wrapped assets are altcoins. They're essentially tokens built on questionable, even centralized networks. Their 1:1 back up is also questionable. The assets which they suppose to represent are under the custody of centralized companies. The DAO itself is questionable. I don't know if some members governing the protocol is enough to consider it a decentralized and independent organization. Wrapped assets could de-peg and it already happened. They are offered in centralized trading platforms, which again questions whether all of these these wrapped assets everywhere are really backed 1:1.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "honglu69",
      "created_time": "August 22, 2023, 03:44:20 AM",
      "body": "wrapped coins are not decentralized.  It is not very safe. Consider true decentralized alternative,  Thorchain or AtomicDEX are true DEX that you can trade many UTXO coins such as BTC, LTC DOGE DASH etc natively with ETH or BNB.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asriloni",
      "created_time": "August 23, 2023, 02:25:38 AM",
      "body": "Quote from: honglu69 on August 22, 2023, 03:44:20 AMwrapped coins are not decentralized.  It is not very safe. True. All of the deposits by people to wrap their assets will be stored in the same hot wallet. The new contract was just redistributing the new token that backed by the real coin with 1 on 1 ratio. The hot wallet can be hacked and wrapped coin will be surely losing its peg. It will be worth nothing. Quote from: honglu69 on August 22, 2023, 03:44:20 AMConsider true decentralized alternative,  Thorchain or AtomicDEX are true DEX that you can trade many UTXO coins such as BTC, LTC DOGE DASH etc natively with ETH or BNB. I can't even really say if thorchain was a true dex. It has ever hacked. I think that it doesn't really matter how decentralized it is, but the code always becomes the primary concern. The network might be decentralized but it's still controlled by the developers. Any undiscovered bug potentially harming the platform. It reminds me of true dex like etherdelta which has been shutdown due to the regulator's request. https://www.coindesk.com/markets/2021/07/23/blockchain-protocol-thorchain-suffers-8m-hack/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 13, 2023, 03:17:38 AM",
      "body": "Wrapped assets are a temporary solution to the inability of different blockchains to connect with each other, such as exchanging Bitcoin to Ethereum, and thus it locks Bitcoin and issues atoken on the other blockchain, but they are all centralized, and if hackers happen to the bridge, you will lose your money, so it may not have a future becauseHackersThere is a future solution that makes different blockchains communicate with each other.Cheaper costs on centralized exchanges.Strict restrictions on decentralized platformsThese Wrapped assets have no future for the reasons I mentioned, in addition to the fact that they are centralized and can be controlled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "September 13, 2023, 05:11:48 PM",
      "body": "What if wrapped assets can be unwrapped then that means that its potential to depegged from its main coin where it is getting is value is possible, right?Apart from that, if it's with the DeFi's, there have been a lot of issues that have seen there like hacking, a platform that has a high risk of being vulnerable to attacks and so on. They're good as what it can be right now but if you dig deeper with its use and risk, you'll get to see the bigger picture behind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 14, 2023, 11:06:45 AM",
      "body": "Quote from: sunsilk on September 13, 2023, 05:11:48 PMWhat if wrapped assets can be unwrapped then that means that its potential to depegged from its main coin where it is getting is value is possible, right?Unwrapped has happened several times and it will continue to happen because what is happening is not locking 1 Bitcoin for 1 WBTC, but rather there is a lot of WBTC being sold or bought in exchange for cryptocurrencies that you locked being withdrawn and you will get different currencies when you want to unwrapped.It will be stable when you get your same currencies and Bitcoin will be closed after that, but because people do not deal with WBTC as if it were a locked tunnel, but rather through a bridge, the bridge works as an exchange platform, but it is decentralized and claims that it will preserve the value just as happens in stablecoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "September 16, 2023, 04:54:07 AM",
      "body": "Tho in some cases that wrapped token can be helpful but yeah most people still don't believe it including me as well if the wrapped version of the token is not transparent or they using some algorithm-wrapped version like UST that fails LunaStable coin is one example of wrapped asset in my opinion and there is a bunch of other wrapped version of coin a single Ethereum alone can have multiple wrapped token for multiple companies or APP so it has two sides of blades. So if you want to use wrapped token make sure you know that the token really can be redeemable to the original version of coin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 20, 2023, 06:33:08 AM",
      "body": "Quote from: dansus021 on September 16, 2023, 04:54:07 AMTho in some cases that wrapped token can be helpful but yeah most people still don't believe it including me as well if the wrapped version of the token is not transparent or they using some algorithm-wrapped version like UST that fails LunaI believe that this industry is based on belief in the asset and provides liquidity more than it is a guarantee because there is 1:1 for every Wrapped Assets, or I can say that if the market is in a state of liquidity and everyone wants to buy and sell, then these assets will be safe, and if the market turns to the red color or panic begins, then you should Sell them immediately, as in the absence of liquidity, it will be easy to notice that there are more Wrapped Assets than deposited Bitcoin or Ethereum, and the bridge owners will not be able to fulfill the obligations.This is a solution for those who have no choice but to use it, but in any case, stay away from it when the market is red.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "September 21, 2023, 01:41:15 AM",
      "body": "Quote from: Husires on September 20, 2023, 06:33:08 AMSell them immediately, as in the absence of liquidity, it will be easy to notice that there are more Wrapped Assets than deposited Bitcoin or Ethereum, and the bridge owners will not be able to fulfill the obligations.This is a solution for those who have no choice but to use it, but in any case, stay away from it when the market is red.What happened on UST is that the liquidity is not enough when people redeem it making the LUNA the original token is crash and the USDT asset is not 100% cash If I'm don't mistaken they only save only ~30% of cash and rest of them put in short term investment or obligation. But why some of companies making wrapped version of Bitcoin I know that the user of wrapped version can be get benefit from bitcoin price but Bitcoin cannot be stake so the companies get nothing right? I dont believe there is companies especially in crypto industry that dont make profit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}