{
  "id": "topic_5454383",
  "title": "coinremitter",
  "author": "coinremitter",
  "created_time": "May 29, 2023, 12:03:59 PM",
  "content": "Compared to fiat currency, Digital currencies are very powerful in-terms of control. You can control your own coin. There is no interference from the government, no one can rob it or counterfeit it. You can use it globally and expand your business internationally. I don't find anything more powerful than this! what is your thoughts on it !",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454383",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "May 29, 2023, 12:11:00 PM",
      "body": "These are just the characteristics of bitcoin. Dawn are the days of centralised coins. If you have altcoins, like binance coin, usdt and other stable coins like usdc, busd, know that their creators can freeze your coins on noncustodial wallet. Do not generalized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "May 29, 2023, 12:11:49 PM",
      "body": "I don't accept the fact that you have generalized it. In terms of control not all digital currency are decentralized so it's not safe to use that term, the fact that governmenr are unable to conttrol it does not make it free from the control of those (non-government) in charge of it. I would apreciate next time if you're to make a similar post use \"Bitcoin\" instead. Digital currency include both bitcoin and altcoins, and I'm pretty sure that you and I know that there are some coin or token that are centralized take BNB for example and that make your thread incorrect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Clark Anderson",
      "created_time": "May 29, 2023, 12:41:26 PM",
      "body": "Well, I guess this op totally haven't understood the meaning of decentralization. He should probably understand that there are different digital currencies out there, with different levels of decentralization and controls. Some might have been designed to be decentralized and give it's users more control over their funds but not all and they are subjected to the control of external bodies.Quote from: Charles-Tim on May 29, 2023, 12:11:00 PMThese are just the characteristics of bitcoin. Dawn are the days of centralised coins. If you have altcoins, like binance coin, usdt and other stable coins like usdc, busd, know that their creators can freeze your coins on noncustodial wallet. Do not generalized.I wouldn't quite agree with that, Bitcoin is the most well-known and widely recognized decentralized digital currencies, but it is not the only one. We have others like Ethereum, Litecoin and some others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "May 29, 2023, 12:45:18 PM",
      "body": "Quote from: coinremitter on May 29, 2023, 12:03:59 PMCompared to fiat currency, Digital currencies are very powerful in-terms of control. You can control your own coin. There is no interference from the government, no one can rob it or counterfeit it. You can use it globally and expand your business internationally. I don't find anything more powerful than this! what is your thoughts on it !Under certain conditions of use you're right, but that's not necessarily a guarantee.The government can also interfere, and if you use some CEX and don't use P2P, you can find yourself blocked by regulations and laws (for example in a case of a national cryptocurrencies ban).Similarly, if you leave your BTC on a CEX hotwallet, you can have them frozen or seized by the CEX, or because some institution asked for.You can also have your seed phrase stolen (by burglary, for example), or be the victim of malware or well-targeted social engineering operation, it happened a lot.An informed user who is aware of the risks will benefit from using BTC for certain purposes, such as storing value. But a user who is not educated about the real risks involved in holding BTC may find himself in a bad position and regret his choices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 29, 2023, 12:47:06 PM",
      "body": "Quote from: Clark Anderson on May 29, 2023, 12:41:26 PMI wouldn't quite agree with that, Bitcoin is the most well-known and widely recognized decentralized digital currencies, but it is not the only one. We have others like Ethereum, Litecoin and some others. Litecoin is bitcoin carbon copy. Ethereum has been centralized before it was created. It started from presales of ether through ICO which makes it very centralised. Another is how it is somehow influenced by the co-founders, unlike bitcoin that its developer is not known, only known by name but left the bitcoin community. Ether moved from PoW to PoS, while staking itself is centralised. Securities are centralized. Ether is a security. Most altcoins are securities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "May 29, 2023, 12:54:29 PM",
      "body": "Quote from: coinremitter on May 29, 2023, 12:03:59 PMCompared to fiat currency, Digital currencies are very powerful in-terms of control. You can control your own coin. There is no interference from the government, no one can rob it or counterfeit it. You can use it globally and expand your business internationally. I don't find anything more powerful than this! what is your thoughts on it !if we say there is no government intervention, it is also not true, because if it is on the blockchain network it is true that there is no intervention, but in its distribution to the people, the government can intervene, like in china where the government intervened in Bitcoin and ensured that it illegal to transact Bitcoins in their area.and when talking about crypto security, there have actually been many cases where someone's wallet was stolen or an exchange took away users' assets. so you should also educate people that only a non-custodial wallet provides security other than that it doesn't and the need to keep the confidentiality of the private key to keep their assets safe from hackers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "May 29, 2023, 01:35:13 PM",
      "body": "Bitcoin is powerful as long as someone use it with high privacy, if people use Bitcoin without privacy and leave their coins on a centralized exchange, they already kill the powerfulness of Bitcoin.Quote from: Renampun on May 29, 2023, 12:54:29 PMif we say there is no government intervention, it is also not true, because if it is on the blockchain network it is true that there is no intervention, but in its distribution to the people, the government can intervene, like in china where the government intervened in Bitcoin and ensured that it illegal to transact Bitcoins in their area.Even though there's a government intervention, you still have a choice to use Bitcoin with high privacy in order to make the government can't trace you. As you can use Bitcoin by trade through P2P, you only need to find someone who are willing to trade with you, this make Bitcoin is unstoppable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "May 29, 2023, 01:48:45 PM",
      "body": "Quote from: coinremitter on May 29, 2023, 12:03:59 PMCompared to fiat currency, Digital currencies are very powerful in-terms of control. You can control your own coin. Is that what power really entails?I wasn't thinking of it in that way though as, I tend to view it from the point of having to control or influence other aspect ones life or the occurances within its system having some influence on the commodities within a state.Should we view it from this point, you could say cryptocurrencies occupies a neutral position and that's why, it's just the best for everyone. It bring about no inflation neither is it rocked by inflation as its often the case with fiat. Having to be in control of your won finance and its decentralisation nature as the case is with bitcoin is some big benefit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 29, 2023, 01:49:03 PM",
      "body": "Quote from: coinremitter on May 29, 2023, 12:03:59 PMCompared to fiat currency, Digital currencies are very powerful in-terms of control. You can control your own coin. There is no interference from the government, no one can rob it or counterfeit it. You can use it globally and expand your business internationally. I don't find anything more powerful than this! what is your thoughts on it !That is true because digital currencies are quite useful but you can't call them more powerful than fiat currencies. In value, some crypto-currencies are powerful than fiat but still fiat is more widely accepted and has more power over economics than any of the digital currencies. I agree that you can control your wallet if you own Bitcoin in it, but you can not control its volatility, and in the same way if you have fiat cash in your wallet you can choose to utilize them or let them lie in your wallet, so in that case there isn't any difference in both types of currencies.Now that point is very legit because Bitcoin is truly decentralized and no government has control over it and counterfeiting it is impossible because the nodes won't accept fake bitcoins in the supply. The Bitcoin is truly the winner in the case of wide acceptability because it can be traded all over the globe and there aren't any restrictions on it in that case. Bitcoin is truly powerful and it's the world's best crypto-currency, but we can't consider all crypto-currencies in the same way. Many of the crypto-currencies are totally useless and they exist because of the ones who own those useless coins. There are even some crypto-currencies that exist without any good purpose because they are created by the negative actors who intentionally create those coins just to scam the innocent users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "May 29, 2023, 02:23:43 PM",
      "body": "Quote from: coinremitter on May 29, 2023, 12:03:59 PMCompared to fiat currency, Digital currencies are very powerful in-terms of control. You can control your own coin. There is no interference from the government, no one can rob it or counterfeit it. You can use it globally and expand your business internationally. I don't find anything more powerful than this! what is your thoughts on it !Maybe the term that cryptocurrency is powerful is wrong, perhaps the correct one is that it has a strong influence on people because of the usage that Bitcoin or crypto has because it helps in today's era that we are facing.Yes, it's also true that most of these are controlled by us, something that banks can't give to their clients because if they do that, they won't earn anything, it's that simple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "May 29, 2023, 02:34:32 PM",
      "body": "Quote from: Renampun on May 29, 2023, 12:54:29 PMif we say there is no government intervention, it is also not true, because if it is on the blockchain network it is true that there is no intervention, but in its distribution to the people, the government can intervene, like in china where the government intervened in Bitcoin and ensured that it illegal to transact Bitcoins in their area.I think that is where bitcoin edges fiat, I am also of the view that it cannot be controlled by the government. If we analyze the issue of China as you mentioned, you would find out that China could only ban its public usage but couldn’t stop its circulation like how a paper money could be stopped from been distributed in China. If you look at the number Chinese citizens that even adopted bitcoin you could see that the number increased even though there was a ban. This is because only the public usage of it was stopped but it was continuously used by the citizens but discreetly. My own view of control is when the government bans it, then it becomes redundant to use and rendered the existing ones useless but bitcoin is not that. If one government stops its usage then you could still use it to transact with other countries. Quote from: Clark Anderson on May 29, 2023, 12:41:26 PMI wouldn't quite agree with that, Bitcoin is the most well-known and widely recognized decentralized digital currencies, but it is not the only one. We have others like Ethereum, Litecoin and some others. I think we would classify ethereum as a total decentralized system because there are bodies that actual controls it that is why it’s transition from POW to POS was easy, not like bitcoin that has to have general consensus first. Even the hard forks on bitcoin network today that lack consensus are struggling just like the litecoin you mentioned or others like BCH and so",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "May 29, 2023, 02:55:34 PM",
      "body": "Quote from: coinremitter on May 29, 2023, 12:03:59 PMCompared to fiat currency, Digital currencies are very powerful in-terms of control. You can control your own coin. There is no interference from the government, no one can rob it or counterfeit it. You can use it globally and expand your business internationally. I don't find anything more powerful than this! what is your thoughts on it ! You can control your coins when the wallet is decentralized but if it is centralized be a digital or online, then the coins are control by the creator of the wallet. So with that centralized digital system, there is an interference from the third party. The powerful way is only on decentralized assets and not on centralized ecosystems. And your statements, you didn't specify the particular coin you are talking about because not all the coins are in non custodian wallets but some coins use custodian wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "May 29, 2023, 03:17:42 PM",
      "body": "Quote from: coinremitter on May 29, 2023, 12:03:59 PMCompared to fiat currency, Digital currencies are very powerful in-terms of control. You can control your own coin. There is no interference from the government, no one can rob it or counterfeit it. You can use it globally and expand your business internationally. I don't find anything more powerful than this! what is your thoughts on it !Hmm, I don't know about this thought but I think some Fiat currency also has digital aspect of it for example, the apex bank in my country just launched its own digital currency known as the E-naira where people can be able to use online but that doesn't free it from the fact that its still controlled by a third party as the government are in full control but its also a digital currency so I think you need to be more district with the specifications of the particular digital currency you are talking about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "May 29, 2023, 03:25:03 PM",
      "body": "Quote from: Clark Anderson on May 29, 2023, 12:41:26 PMI wouldn't quite agree with that, Bitcoin is the most well-known and widely recognized decentralized digital currencies, but it is not the only one. We have others like Ethereum, Litecoin and some others. With bitcoin popularity in the crypto industry it has created a lot of branch of other alternative coins. Which means it doesn't have all the characteristics of Bitcoin carry. Bitcoin might be decentralized but some alternative coins might not be fully decentralized so in short, people may still rug those funds just like the government do where you funds are also not in your favor. Just do more research about in this industry, I think OP only have knowledge on the basic background of the crypto especially the popular one like Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "May 29, 2023, 03:41:12 PM",
      "body": "Quote from: coinremitter on May 29, 2023, 12:03:59 PMno one can rob it This is false... your cryptos aren't 100% secure and they can be robbed. Let's say you have your private keys on your home in a paper wallet, and a thief joins to your house and steals those private keys, another example is, let's say you have your private keys in your computer, and you download some software with a malware, that way your keys can get rob. And a last example, let's say you work hard on security and no one can access to your private keys, but sadly a user finds your private key with brute force.Quote from: coinremitter on May 29, 2023, 12:03:59 PMYou can use it globally and expand your business internationallyYou can do this but would be done in an illegal way, because the government loves taxes, and if you close a deal without paying taxes then you will be doing something illegal for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "May 29, 2023, 03:57:20 PM",
      "body": "Quote from: coinremitterThere is no interference from the government, no one can rob it or counterfeit it. If you expose your personal details in public, you can be rob by your enemy so in that aspect you need to be very careful the way you handle your BTC because it will be difficult for you to trace the person that done such evil.  QuoteYou can use it globally and expand your business internationally.Yes, you can use it to do business locally and internationally when it is well legal tender which is very good in profits making and many people has use it to grow their wealth to become a great men and women in the society.  I have seen some people in my area who use BTC to create two standard company and the companies are producing products that is making the community happy by purchasing the products in a low price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "May 29, 2023, 04:09:28 PM",
      "body": "I think we can say digital currencies are powerful in the sense that they are accessible to more users than a local currency which is limited by supply and user's  ,not forgetting being controlled by the central bank. And with no regulatory body in the drivers seat when it comes to these digital currencies , this means the value can easily skyrocket in a blink of an eye making them potential the most valuable assets out there, which means the command the influence and this is where the power is!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 29, 2023, 04:30:22 PM",
      "body": "I mean. Since some years ago, the whole world is going through a process of going digital and currencies are not an exception. What you say it is true, but only for decentralized currencies and projects, like Bitcoin. Government interference in finance and personal expenses is also something very powerful, which is the reason for the pushing towards CBDC adoption, they could want to give the facade of a free and global payment system but the censorship would be an option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 29, 2023, 04:37:20 PM",
      "body": "Quote from: coinremitter on May 29, 2023, 12:03:59 PMCompared to fiat currency, Digital currencies are very powerful in-terms of control. You can control your own coin. There is no interference from the government, no one can rob it or counterfeit it. You can use it globally and expand your business internationally. I don't find anything more powerful than this! what is your thoughts on it !When you're talking about digital currency, you need to be more specific because altcoins are digital currencies, CBDC are also digital currency, but i will admit that the only most acceptable and decentralized digital currency that has no acceptability barrier is bitcoin, you can have it privately, spend it anywhere and anytime and earn it as well because it uses a p2p network well secured on the blockchain, bitcoin is the only coin one can desire to have, invest, hodl and make profitability irrespective of the country or location you find yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}