{
  "id": "topic_5417200",
  "title": "Question:",
  "author": "dimonstration",
  "created_time": "October 15, 2022, 11:15:52 AM",
  "content": "If you are playing gambling for example slots and you double money with just a couple of bets on very early part of your game. Will you stop already or continue playing to earn more?I’ve been on this situation many times before and I keep playing until I get the entertainment that I want and to have more profit. But the result is always ended up losing everything because it’s very easy to increase bet if you knew that your money that you use is a profit.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417200",
  "comments": [
    {
      "author": "romero121",
      "created_time": "October 15, 2022, 11:19:54 AM",
      "body": "I used to take a break and come back again in the same day. Slowly I try to increase the winning, but at some point when there is consecutive loss on rolls I used to increase the bet to recover the losses. This makes me go out of control losing huge funds in few rolls. After losing everything my mind says you shouldn't have gone to such an extent. You should've taken the profit once the capital is being doubled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "October 15, 2022, 11:23:59 AM",
      "body": "Quote from: dimonstration on October 15, 2022, 11:15:52 AMIf you are playing gambling for example slots and you double money with just a couple of bets on very early part of your game. Will you stop already or continue playing to earn more?The rule is if you win little, wait till next time. If you haven't, try to win and never let it be beyond your gambling budget, especially if you run out money by using martingale or any other strategy.Quote from: dimonstration on October 15, 2022, 11:15:52 AMI’ve been on this situation many times before and I keep playing until I get the entertainment that I want and to have more profit. But the result is always ended up losing everything because it’s very easy to increase bet if you knew that your money that you use is a profit.  You do not have to increase the amount you are using to bet if you are winning. You need entertainment, then continue to play with just little amount and have the fun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "October 15, 2022, 11:24:36 AM",
      "body": "I think there is a similar post related to such question.I will say it all depends on the player or what you wanted to, if you gamble with a specific amount and tends to increase at some point, it would be ideal you don't use your additional funds but can only use profits and is under probability because you could also lose your profits when trying to increase your wager in the bet. So if you played with your initial money and you win don't use the profit to increase your wager thinking you could hit more good point at the end of increasing it.So the best Is to stop game and take some break maybe not that same day again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "October 15, 2022, 11:39:24 AM",
      "body": "It depends on what is your limit on gambling. In my opinion I will stop already because I do hit profit in early stage and that’s your best chance to beat the house in profit rather than play longer due to house edge. People should realized that we need to bet few as much as possible and take profit if you have it early before you start losing it all on house edge and lose streak. Gambling is game chance that only means that you will encounter long lose streak later if you continue since you already hit the long win streak because it will just balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "October 15, 2022, 11:48:57 AM",
      "body": "I've encountered this situation multiple times while gambling, playing slots. On this situation, it depends on my goal while playing if whether I'll stop or continue playing. However, I've answered, Yes, on the poll as I mostly lean on stopping while I'm ahead especially when my bankroll is a considerable amount. In most times, I stop playing even if I'm just 1.5x ahead of my whole initial bankroll however I continue playing when my bankroll isn't that high and wanted to have some entertainment and test my luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 15, 2022, 11:55:24 AM",
      "body": "Gambling for me are not about profit.... because I gamble for entertainment. So I will simply leave the money that I won ..on the casino to continue gambling. Yes, when I win something huge... I will withdraw a small amount to treat my family and friends or to buy something nice.... but the majority of the winnings stay on the casino.                               That is why they say... \"If you do not quit when you win big.. the house always win\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "October 15, 2022, 11:59:59 AM",
      "body": "Quote from: dimonstration on October 15, 2022, 11:15:52 AMIf you are playing gambling for example slots and you double money with just a couple of bets on very early part of your game. Will you stop already or continue playing to earn more?It depends on how much I gained in that session. If I hit a good multiplier and a good win, I will still continue to gamble as luck is there but not to the point that I will spend all those winnings completely. If things are getting worst, I will now stop and just return the next day (without withdrawing). Although most of the cases that I ended up busted, still there's a time that I enjoy my profits and cash it out. I admit it's hard to stop when we are experiencing winnings. Not wrong giving a few more runs after that big win before stopping.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shinpako09",
      "created_time": "October 15, 2022, 12:38:37 PM",
      "body": "I've changed my playing style over these past 2 years. Before, I'm setting a limit on how much I won or lose every day but now. I keep on playing and don't set any limits anymore. Whether I set a limit or not, the outcome is still the same so why bother? Just continue playing, who knows, maybe your single lucky day will come sooner or later. That's what I'm waiting for so I can stop playing gambling and shift my attention to other ways of earning in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "October 15, 2022, 12:44:18 PM",
      "body": "if you are gambling for the sole purpose of earning profit it would be best to stop and keep the profit you have gained. anyway, I don't really play slots but I would still gamble despite doubling my initial funds(just to let you know my funds for gambling are not that huge so I am not really bothered if I lost it) quickly, the reason for this is I don't really gamble for profit nowadays, gambling for me has been a great way to pass time and unwind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rahmad2nd",
      "created_time": "October 15, 2022, 12:52:31 PM",
      "body": "Whatever happened to what you describe in this post, it's not something surprising because we also experienced the same things as yours. this seems to be related to psychological problems, and something that usually happens to anyone who enjoys gambling activities.However, if you do not have good control, it is highly recommended to limit the amount you are ready to lose. the most difficult thing is to stop the game session, either when you get a lot of wins or losses in a row. The urge to continue playing is greater than ending the game session. As a result, you lose a lot of your coins. I don't mean to patronize you, but anything in excess is not good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "October 15, 2022, 01:02:00 PM",
      "body": "Quote from: dimonstration on October 15, 2022, 11:15:52 AMIf you are playing gambling for example slots and you double money with just a couple of bets on very early part of your game. Will you stop already or continue playing to earn more?I’ve been on this situation many times before and I keep playing until I get the entertainment that I want and to have more profit. But the result is always ended up losing everything because it’s very easy to increase bet if you knew that your money that you use is a profit.  Even without raising the bet size, the result will be the same if you don't stop  As for doubling, this is nonsense, hardly anyone stops after such a small win. It seems to me that when people dream of winning, they want to get at least x10. x2 even to the entire deposit is very little to stop. By the way, it seems to me that slots are exactly the area where gamblers are waiting for huge winnings, something like x100-x1000 and they definitely won’t stop after x2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 15, 2022, 01:02:18 PM",
      "body": "Quote from: dimonstration on October 15, 2022, 11:15:52 AMIf you are playing gambling for example slots and you double money with just a couple of bets on very early part of your game. Will you stop already or continue playing to earn more?I’ve been on this situation many times before and I keep playing until I get the entertainment that I want and to have more profit. But the result is always ended up losing everything because it’s very easy to increase bet if you knew that your money that you use is a profit.  To continue in a game when you're winning very much depends on your mindset, Do you want to recover your losses or do you want to be entertained more knowing the fact that you could lose your earnings, continuing when you already win a big amount is very risky for those who are chasing their losses and fun for those who want to see how long he can keep up, the first is taking a big risk and the latter comfortable on the outcome and he plays to be entertained not after the profit, in my case I will stop when I have reached my winning limit, I also want to recover part of my losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "October 15, 2022, 01:14:33 PM",
      "body": "Quote from: dimonstration on October 15, 2022, 11:15:52 AMIf you are playing gambling for example slots and you double money with just a couple of bets on very early part of your game. Will you stop already or continue playing to earn more?You must understand that there are no poor bookies or online gambling businesses, for sure you often see advertisements for online gambling sites that offer slot games with double wins, but that's just pseudo, for sure, the bookie who wins you must realize that, online slot gambling is one method in the form of a 'programming' code that is set up with genius and a method in such a way that you cry, the fact is that many online slot gambling players that I see 98% will definitely lose, another 2% are affiliate or influencer wins, to make bettors not cry and feel they are happy.With the various reasons that I have mentioned, based on my experience, it is clear that if I bet on online slot gambling and win big, I will definitely stop and not continue betting on that day and then, I will calm down, of course I will bet on other slot games in the coming day, not that day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 15, 2022, 01:24:05 PM",
      "body": "I will prefer to stop the game for the day if i begin to experience loss on two consecutive occasions, luck is far away as at that moment then I'll make a try another day, if we don't properly plan to position ourselves on a good eege, it may be difficult for us to make progress with winning, some will keep loosing at the scene of trying to play hard for a winning, but we you understand what's best and good for you, then you can know how to stop and or continue when needed, but as for me I will stop anytime am making a loss consecutively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "agustina2",
      "created_time": "October 15, 2022, 01:30:11 PM",
      "body": "Quote from: dimonstration on October 15, 2022, 11:15:52 AMI’ve been on this situation many times before and I keep playing until I get the entertainment that I want and to have more profit. But the result is always ended up losing everything because it’s very easy to increase bet if you knew that your money that you use is a profit.  Like you, I've also been in the same situation. It's really a tough choice for me if I will continue to play or not.Since I won big, why should I stop? That lucky chance might not come again. That reason fueled my eagerness to continue playing.And obviously, we all know the result at the end lol. Like anyone else, losing everything in the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "October 15, 2022, 01:36:03 PM",
      "body": "Stop, if the game continues it's likely not going to get more but losing this has become an experience and for me with an early multiplier and then winning it needs a break to calm it down.I only have certain limits in slot games so the initial multiplier will not be too big and set for example $0.2 this will not increase even though I win in the multiplier, so I want just because of the win then increase the bet it will be the beginning of my loss and this would be bad for me in doing.The entertainment slot is so the limit for the money that is entered is not too big so I need to control it again when I want to play so I always hold back from doing it except the next day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "October 15, 2022, 01:43:40 PM",
      "body": "Quote from: dimonstration on October 15, 2022, 11:15:52 AMIf you are playing gambling for example slots and you double money with just a couple of bets on very early part of your game. Will you stop already or continue playing to earn more?I'm very practical person, the answer is stop it then come back later on or by the next day. You're not so sure you'll be earning more when you play, besides it's just a game of chance after all and nothing comes to be predictable just because you got lucky the first time you hit that jackpot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doell",
      "created_time": "October 15, 2022, 01:44:23 PM",
      "body": "Has been 5 days maybe I got the same condition, earned even up to x150 from the initial deposit and yeah I keep playing so final result I get nothing. Usually I would stop but maybe this time it was different. For now I won't stop at slot gambling and probably won't give up on my goals, like an addict but I need to be able to control my funds to spend at slots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 15, 2022, 01:53:13 PM",
      "body": "Depends on my mood. When I have more time to go for it, I would still play as I did also in the past. I've seen my $5 to $60 from playing slot and dice but it always ends up zero when the time I got to increase my bets. Such a very little capital but made it more than 10x.Sometimes I stop but got no courage to withdraw and then the next day, I return in hopes to see if I could make it double again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}