{
  "id": "topic_5413577",
  "title": "John Crunch",
  "author": "John Crunch",
  "created_time": "September 14, 2022, 04:12:03 PM",
  "content": "Over the past year, the number of T15s running at our farm has dwindled from over 100 to less than 50. Today I finally got through processing all the dead units and discovered the PSU, the APW8 was the faulty component on nearly every single unit. I was able to tell this by putting a known good PSU on the 50 dead T15s, one at a time. Almost every single HB, CB, cable and fan was totally fine, just a bad PSU. Some totally dead, others just not delivering power correctly. So now I have 50+ totally functional T15s that are just missing their PSU. So my question is:Should I seek to buy 50 used APW8s to get these machines hashing again? Or just cut my losses and sell the working hashboards and control boards?Does anyone have experience with this PSU type? Will they continue to die at this rate if I buy more?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413577",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "September 14, 2022, 04:14:10 PM",
      "body": "Quote from: John Crunch on September 14, 2022, 04:12:03 PMOver the past year, the number of T15s running at our farm has dwindled from over 100 to less than 50. Today I finally got through processing all the dead units and discovered the PSU, the APW8 was the faulty component on nearly every single unit. I was able to tell this by putting a known good PSU on the 50 dead T15s, one at a time. Almost every single HB, CB, cable and fan was totally fine, just a bad PSU. Some totally dead, others just not delivering power correctly. So now I have 50+ totally functional T15s that are just missing their PSU. So my question is:Should I seek to buy 50 used APW8s to get these machines hashing again? Or just cut my losses and sell the working hashboards and control boards?Does anyone have experience with this PSU type? Will they continue to die at this rate if I buy more?if you can clock to low they won't burn quicklybut if you set to high they will all burn out.I found this to be true with my t15's and my s15's they use the same psu. and they pull too much juice to run on high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Crunch",
      "created_time": "September 14, 2022, 04:42:27 PM",
      "body": "Quote from: philipma1957 on September 14, 2022, 04:14:10 PMQuote from: John Crunch on September 14, 2022, 04:12:03 PMOver the past year, the number of T15s running at our farm has dwindled from over 100 to less than 50. Today I finally got through processing all the dead units and discovered the PSU, the APW8 was the faulty component on nearly every single unit. I was able to tell this by putting a known good PSU on the 50 dead T15s, one at a time. Almost every single HB, CB, cable and fan was totally fine, just a bad PSU. Some totally dead, others just not delivering power correctly. So now I have 50+ totally functional T15s that are just missing their PSU. So my question is:Should I seek to buy 50 used APW8s to get these machines hashing again? Or just cut my losses and sell the working hashboards and control boards?Does anyone have experience with this PSU type? Will they continue to die at this rate if I buy more?if you can clock to low they won't burn quicklybut if you set to high they will all burn out.I found this to be true with my t15's and my s15's they use the same psu. and they pull too much juice to run on high.Wow, Bitmain really screwed the pooch on these then. Good to know. Wish I'd known a lot sooner lol. Do you have any experience repairing these PSUs? I don't have a PHD in power science but would be willing to try.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 14, 2022, 11:22:28 PM",
      "body": "You can try to repair those dead PSUs there might be burned parts inside the PSU sometimes busted capacitors or rectifiers or maybe an open fuse replacing them could fix the issue. I searched a bit it seems that ZeusBTC has a guide on how to repair this PSU so I suggest you follow their step-by-step guide from this link below.- https://www.zeusbtc.com/manuals/Antminer-APW8-Power-Supply-Repair-Guide.asp If not, hire an Electronics expert to repair your PSUs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MinerMEDIC",
      "created_time": "September 16, 2022, 08:22:32 AM",
      "body": "Quote from: BitMaxz on September 14, 2022, 11:22:28 PMYou can try to repair those dead PSUs there might be burned parts inside the PSU sometimes busted capacitors or rectifiers or maybe an open fuse replacing them could fix the issue. I searched a bit it seems that ZeusBTC has a guide on how to repair this PSU so I suggest you follow their step-by-step guide from this link below.- https://www.zeusbtc.com/manuals/Antminer-APW8-Power-Supply-Repair-Guide.asp If not, hire an Electronics expert to repair your PSUs. I’d go a step further and say if the metal capacitors by the power rails look exploded or leaky this is the only repair you can make without the electronics expert. They are the aluminum capped ones with the blue or red striped on the side. J",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}