{
  "id": "topic_5399659",
  "title": "scammedbyHELIOSPNP",
  "author": "scammedbyHELIOSPNP",
  "created_time": "May 21, 2022, 09:16:04 PMLast edit: August 01, 2022, 05:31:17 AM by scammedbyHELIOSPNP",
  "content": "*** PNP coin investor funds are now at risk as criminal charges are pending ***Fraudwrongful or criminal deception intended to result in financial or personal gain.Hong Kong police force confirmed that PNP coin and Helios are registered as shell companies and therefore unable to trace!!Establishing a legal business entity such as an LLC or LTD protects you from being held personally liable if your cryptocurrency business is sued...alias Helios Groups (Hong Kong)alias Helios Wealth Management (HK) Limited (Hong Kong)alias PNP COIN Hong Kong Limited (Hong)alias Helios Architecture (HK) Limited (Hong Kong)alias Helios Trading (HK) Limited (Hong Kong)alias Helios Wealth Management Services (India)alias Helios Voice Communication Private Limited (India)alias Helios Dax Solutions Private Limited (India)alias Helios Wealth Management OU (Estonia)alias Helios Wealth Investment Management LLC (Dubai)Criminal Case for Fraud and Money LaunderingHong Kong police forceInvestigating officerSenior inspector of policeMr. B WongPh: +852 3660 1137Email: cdist-dit-7-office@police.gov.hkCase reference: CRN22000082- I paid Helios $390 000.00 in October 2020- PNP coin launched in march 2021- \"PNP coin franchise\" offered to me in April 2021- PNP coin and Helios unlawfully took $200 000.00 \"commitment fees\" from funds held on account in September 2021- PNP coin Hong Kong limited was only registered in Hong Kong in December 2021- Helios digital asset exchange was only registered in India in January 2022- Nareshkumar Danapalvalli issued a fraudulent \"PNP coin franchise\" agreement from India- I never accept nor agreed to the terms nor did I sign the fraudulent \"PNP coin franchise\" agreement offered- \"PNP coin franchise\" agreement was issued on Indian non judicial paper under Indian law- Helios (HK) listed as \"PNP coin franchisor\" incorporated under the laws of Hong Kong- the fraudulent \"PNP coin franchise\" agreement was notarized in India- Helios address in Hong Kong was listed for notices - Hong Kong police unable to verify address- the fraudulent \"PNP coin franchise\" agreement was signed by nareshkumar danapalvalli in India- the fraudulent \"PNP coin franchise\" was witnessed by neeraj mohan in india- Helios failed to honor their own irrevocable corporate refund undertaking- Helios ignored DBS bank instruction to return the $390 000.00- Helios moved all their funds to Chennai, india and Dubai instead- Helios physical offices listed as registered address cannot be verified in Hong Kong by police - Helios are ignoring all communication to resolve the refund amicably, last communication was in march 2022- Helios are blocking me from sharing my painful story on all platforms as they are raising funds for their initial coin offering- Helios Hong Kong phones lines are diverted to Chennai india instead- Helios never contacted or met with the investigating officers of the Hong Kong police- Instead of returning the funds, Nareshkumar Danapalvalli registered a case of defamation 9months AFTER HELIOS failed to returned the funds and served a summons with false sworn statement through private channels, disguised as “Final Settlement Offer”, bypassing the procedure set out in the Mutual Legal Assistance Treaty in Criminal Matters between India and South AfricaHelios are continuing with their lies and deception by telling anyone who questions them on the fraud and money laundering investigation that I am the fraud yet they never provide any proof, not even to the police!!!Anyone who pushes for more details on their counter claims without proof on their social media platforms gets blocked!!!Hong Kong police investigating are now proceeding with criminal charges for fraud and money laundering against the entire Helios groups!!!Interpol has been engage in order to freeze assets and recover funds from India and Dubai bank accounts as the funds in Hong Kong are from criminal proceedsAs the currency paid to Helios was United States Dollars, PNP coin and Helios DAX in India has now also been reported to the US securities and exchange commission for fraud!!Helios groups authorized representatives in india and UAEHelios Wealth Management Services / PNP Coin Hong Kong Limited / Helios Wealth Investment Management Llc /Helios DAX Solutions Private LimitedNareshkumar DanapalvalliOperations Manager - India & UAE (Dubai)Helios Wealth Management (HK) Limited / PNP Coin / Helios DAX Solutions Private Limited / Helios Voice Communication Private Limited / Helios Wealth Management Services[/Color](Corporate Identification Number (CIN) - U72900TN2022PTC149187)Director Identification Number (DIN) -  34328611. The Hive Level-3 @ Vr Mall Thirumangalam, Chennai - 600040 2. No 41 First Floor, 86th St, Ashok Nagar, Chennai, Tamil Nadu 600083, India3. Plot No.2171, L Block, 6th Street 12th Main Road, Anna Nagar West Chennai , Tamil Nadu4. Flat No.7, Ashok Balaji Apartment New No.41, Old No.18, 48th Street, 9th Avenue, Ashok Nagar, Chennai 5. 340-B, 4th Street Duraiswamy Nagar Arakkonam Vellore, Tamil Nadu  631005 IndiaGst Number  33ADLPN6001C2Z2+ 91 87546 36159+ 97 15868 12129+ 971 4331 5397+ 91 72009 38081+ 91 78240 99717+ 91 44610 22070+ 852 6808 4973+ 852 6045 9772dvn@heliosgroups.cominfo@pnpcoin.cominfo@heliosgroups.com Nareshkumar DanapalvalliNo.66/45, Appu Subaiyar Street, Gudiyattam,PichanoorVelloreTamil Nadu632602IndiaNeeraj MohanMarketing Manager PNP CoinHelios DAX Solutions Private Limited / PNP Coin Hong Kong Limited(Corporate Identification Number (CIN) U72900TN2022PTC149187)1. The Hive Level-3 @ Vr Mall Thirumangalam, Chennai - 600040 2. Plot No.2171, L Block, 6th Street 12th Main Road, Anna Nagar West Chennai , Tamil Nadu.+91 70102 64238+91 72009 38081Neeraj9941@Gmail.Com Info@Pnpcoin.ComInfo@Heliosgroups.Com Neeraj Mohan704, Sastha Nagar, Kovil Street, Chithathur, TiruvannamalaiTamil Nadu604410IndiaUnited Arab EmiratesHelios Wealth Investment Management LlcNareshkumar DanapalvalliDirectorLocal License No. - 852419Economic Register No. - 11419204Unit 407Etjar BuildingMankool 70Bur DubaiAl KarmaUnited Arab Emirates +971 4353 8879Estonia Helios Wealth Management (HK) Limited - (16349756 - Now Deleted)Commercial Register Card No. 1 Has Been Opened In Tartu County Court Registration Department In Respect OfHelios Wealth Management OÜ Registry Code: 16378545Key Principal: Nareshkumar DanapalvalliPersonal Identification Code: 38009020187Address: Harju Maakond, Tallinn, Lasnamäe Linnaosa, Lõõtsa Tn 2a, 11415 EstoniaPhone: +372-918754636159E-Mail Address: dvn@heliosgroups.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5399659",
  "comments": [
    {
      "author": "holydarkness",
      "created_time": "May 23, 2022, 09:34:07 AM",
      "body": "The name is familiar to me, there was a closed case for PNP and Helios project back in 2021, the OP for that scam accusation reached me and others, asking us to remove every post made by anyone on the accusation thread mentioning the case as a term asked by PNP to resolve the case.Were you the same person from the previous case --I'll refrain from mentioning a name for this time being-- or this is a completely different case and you're different victim?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "scammedbyHELIOSPNP",
      "created_time": "May 23, 2022, 10:09:17 AM",
      "body": "Hi Dark,Thank you for the response.Yes indeed, it is the same case and I am the same victim.HELIOS engaged after the posts were removed in an attempt to find a final mutual resolution. However, they have stopped communicating since March 2022 without concluding this longstanding matter.The Hong Kong Police visited their \"registered\" office premises and the office are occupied by companies who never heard of them!The Hong Kong Police also advised that upon further investigation they found that PNP COIN HONG LIMITED AND HELIOS WEALTH MANAGEMENT (HK)  LIMITED are only shell companies, that there are no funds to recover from HK as funds were moved to India and Dubai where HELIOS WEALTH MANAGEMENT SERVICES, HELIOS DAX SOLUTIONS PRIVATE LIMITED AND HELIOS WEALTH INVESTMENT MANAGEMENT LLC are now under the control of their operations head, NARESHKUMAR DANAPALVALLI who has been my point of contact since I paid the $390 000.00 over and the last point of contact since March 2022.NARESHKUMAR DANAPALVALLI has been attempting to block me from all their social media platforms and instructed his ill-informed staff to respond to anyone enquiring about the fraud and money laundering investigation by police that I am a fraud, yet they cannot provide any further details nor proof of their counter allegations and never communicated nor met with the police since October 2021 to proof their innocence.They have concluded yet another round of fund raising for their ICO in India, which did not go so well as they extended it 3 times!This time they celebrating their 1year anniversary\" yet my life has been at a standstill since March 2021!!!Hong Kong Police are now proceeding with criminal charges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "scammedbyHELIOSPNP",
      "created_time": "May 24, 2022, 09:41:34 AM",
      "body": "Hi Dark,A surprise twist when I opened my mail this morning, apparently there is a \"settlement offer\" enroute from India via courier!!Will provide an update once same is received hopefully before end of this week.Regards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "scammedbyHELIOSPNP",
      "created_time": "June 01, 2022, 01:43:07 PMLast edit: June 29, 2022, 04:32:50 PM by scammedbyHELIOSPNP",
      "body": "Hi Dark, This is the mail I received from PNP COIN AND HELIOS after 3months of ZERO communication:Dear Mr.Rudd,This is to update you about the opportunity. My advice think broadly and act smartly about this opportunityThis is to inform you that, As per the Legal cell and our Helios Management gives you the Last opportunity for final settlement to BT Commodities. The final settlement offer letter and terms sheet along with your Acceptance promissory letter draft sent to your registered office address alreadyThe document couriered Ref AWB No. 32201721484Thanking youWith Regards,Naresh Kumar DanapalvalliManaging Director / CEO - INDIA & UAE (Dubai)+91 87546 36159 |+ 971 5868 12129 | dvn@heliosgroups.com Br. Office: Unit 544 Corridor -2 | Hamsah A complex M Floor | Al Karama |P.O. Box 57770 | Dubai | United Arab Emirates | +971 4331 5397 | www.heliosgroups.aeReg. Office: Unit 2307 Enterprise Square III | 39 Wang Chiu Road | Kowloon Bay | Hong Kong | +852 5808 4973 | www.heliosgroups.comDo you really need to print this mail? Before Consider the environment… This email and any attachments to it may be confidential and are intended solely for the use of the individual to whom it is addressed. Any views or opinions expressed are solely those of the author and do not necessarily represent those of Helios Groups.If you are not the intended recipient of this email, you must neither take any action based upon its contents, nor copy or show it to anyone.Please contact the sender if you believe you have received this email in error.Registered in Hong Kong, Number: 2450135, Registered Address: Mau Lam Commercial Building, 16-18 Mau Lam Street, Jordan, Kowloon, Hongkong",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "scammedbyHELIOSPNP",
      "created_time": "June 01, 2022, 01:51:59 PM",
      "body": "Instead of the final settlement documents, I received a single document under false pretense via courier today.The letter states that a \"summons\" was issued by an Indian court for me to face a charge of defamation in Bangalore instead Chennai India where PNP COIN and HELIOS are registered and where legal representatives reside!Instead of settling the matter amicably, PNP COIN AND HELIOS continue with their LIES and DECEPTION",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edgycorner",
      "created_time": "June 01, 2022, 03:52:05 PM",
      "body": "Quote from: scammedbyHELIOSPNP on June 01, 2022, 01:51:59 PMInstead of the final settlement documents, I received a single document under false pretense via courier today.The letter states that a \"summons\" was issued by an Indian court for me to face a charge of defamation in Bangalore instead Chennai India where PNP COIN and HELIOS are registered and where legal representatives reside!Instead of settling the matter amicably, PNP COIN AND HELIOS continue with their LIES and DECEPTIONAt this point, I would suggest bending the rules in your favor.Hire a Private investigator in India to track the paperwork on these physical locations. A good PI will be able to track down the real culprits. Once you have their details, you have two options: Sue them in India(which I believe will lead to nothing) or try negotiating. I will leave the negotiation part to your imagination. If you can prove your case to me, with a money trail then I can help you out with a few things(like finding a good PI etc)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "scammedbyHELIOSPNP",
      "created_time": "June 29, 2022, 01:29:25 PMLast edit: June 29, 2022, 04:31:19 PM by scammedbyHELIOSPNP",
      "body": "OPEN LETTER TO PNP COIN AND HELIOS GROUPSNareshkumar Danapalvalli, Neeraj Mohan, Lisa Wei, Suki Chang, Ella Tang, Vicky Wu and Jessica Thomas, I paid HELIOS GROUPS $390 000.00 in advance, in trust and in good faithIt is now 9months since you failed to honour your commitment to the refund.You offered me a fraudulent and non-existing “PNP COIN FRANCHISE” in order to steal all the funds held on account due for a refund.You continue to fuck me in the ass and your Fraud and Deception has brought my life to standstill, destroyed my business, destroyed myreputation, destroyed my wealth plan, destroyed my socio-economic standing, destroyed my marriage, destroyed my son’s education and my entire family. I almost committed suicide…I sold my car and personal belongings to survive, I have now been evicted, I have no food, I now survive on handouts. I am now facing numerous litigation suits for non payments of bills since November 2021.I missed Christmases, New Years, birthdays and anniversaries. I now have no health cover, life cover and no funeral cover during worldwide pandemics as it all lapsed due to your deception.You ignored DBS BANK instruction to return the $390 000.00 and you moved all your funds to Chennai, and Dubai instead and registered HELIOS in INDIA and ESTONIA.The Hong Kong Police registered Criminal Case Number CRN22000082 for FRAUD AND MONEY LAUNDERING against the entire HELIOS GROUPS.Your physical offices listed as registered address cannot be verified by Hong Kong Police.You are ignoring all communication to resolve the refund amicably, last communication was in March 2022 and are blocking me from sharing my painful story on all platforms.Your phones lines, Whatsapp and support emails are diverted to Chennai instead.You claim that I am a scammer yet you never registered a case, never contacted nor met with the investigating officers of the Hong Kong Police since October 2021.Instead of returning the funds, Nareshkumar Danapalvalli registered HELIOS DAX in India.Instead of returning the funds, Nareshkumar Danapalvalli registered a case of defamation 9months AFTER you failed to returned the funds and served a summons with false sworn statement through private channels, disguised as “Final Settlement Offer”, bypassing the procedure set out in the Mutual Legal Assistance Treaty in Criminal Matters between India and South Africa.PNP COIN AND HELIOS ARE NOW CONTINUING TO RAISE FUNDS FROM UNSUSPECTING INDIAN INVESTORS FOR YOUR SHITCOIN WHILST THIS LONGSTANDING MATTER REMAINS UNRESOLVED.YOUR LIES, FRAUD AND DECEPTION WILL SOON ATTRACT THE NECESSARY ATTENTION FROM INDIAN AUTHORITIES AS IT DID IN HONG KONG WHERE A CRIMINAL CASE HAS BEEN REGISTERED BY HONG KONG POLICE AND ARRESTS ARE NOW IMMINENT!!!PAY BACK THE FUCKING $390 000.00 YOU FUCKING THIEVES AS THIS LONGSTANDING MATTER SHALL BE RESOLVED NO MATTER AT WHAT COST!!!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "June 29, 2022, 02:17:08 PM",
      "body": "You have a case here but can you please stop highlighting your post to blue I have a hard time reading it and I missed some important parts reading your post just post like you post normally post, you can highlight some important points but make that highlights short, no one will read your post if you keep doing this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maurice33",
      "created_time": "July 06, 2022, 11:45:05 AM",
      "body": "I have had my own share of crypto scams due to referrals from this site, I lost a lot of money and I was still told to send more money to unlock my account because my balance was non-spendable or something. Sadly I couldn't count on the police so I reached out to a company that helped. “{chargebacknowAT aol .Com }” and luckily for me, I was able to get my money back. They showed me how every bitcoin transaction is traceable. Your crypto first goes to the scam wallet, from there bitcoins will travel through some proxy wallets to cover the tracks. But, every single transaction is recorded in blockchain. So your bitcoins can be traced to the endpoint, which is some bitcoin exchange market where they are exchanged for real money. And then the exchanges in question will have records of who received the money and how they received it. Contact them if you've similar issues, You'll be grateful that you did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}