{
  "id": "topic_5409137",
  "title": "whatiwhat",
  "author": "whatiwhat",
  "created_time": "August 08, 2022, 02:08:51 PMLast edit: August 15, 2022, 04:25:36 PM by whatiwhat",
  "content": "I registered at this casino on July 14 and started playing at their bookmaker. On July 25 i placed few small bets(totally about 50-70usd with potentially win 100 usd or so) on live csgo match PALOMA vs EC Brugge. All my bets won but they never credited my winnings instead they voided all my bets.On July 26, my account was blocked with \"we detected suspicious activity\" excuse. Since then owl.games refuse to release my funds.Scammers Profile Link: https://bitcointalk.org/index.php?action=profile;u=3425425      Amount Scammed:approx 1300 usd Payment Method/proof of my deposits: one two three PM/Chat Logs: https://i2.paste.pics/a6ecc91e2226fc7f4ed38d55cc77ed9d.png https://i2.paste.pics/5eb2a57ad023761cf72697d7c63037c4.png  they never answered to my emails Additional Notes: If there really was any suspicious activity, the teams would be disqualified from this tournament. But in fact, these teams took 1st and 3rd places and earned 20k and 5,5k usd. And its obviously that i registered my account way before this game and i have no connections with any other account.owl.games excuses:Quote from: owlgames on July 31, 2022, 09:46:17 AMLike we said on our support channel, your account was banned because our sports book provider provided evidence on suspicious betting on the cs-go match.We quote from the sportsbook risk team:\"At the event CS-GO - PALOMA vs EC Brugge, suspicious activity was noticed. New game accounts were created and bets were placed on the same markets (preventive work is currently in progress and access to more detailed data is temporarily restricted)\"Thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409137",
  "comments": [
    {
      "author": "yahoo62278",
      "created_time": "August 08, 2022, 06:21:44 PM",
      "body": "Did you have multiple bets placed on the same game? If so, why not bet them all in 1 bet? Likely because you were trying to stay under the radar? I tend to side with a casino in cases like this assuming a player made multiple bets on the same match.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whatiwhat",
      "created_time": "August 08, 2022, 06:52:14 PM",
      "body": "Quote from: yahoo62278 on August 08, 2022, 06:21:44 PMDid you have multiple bets placed on the same game? If so, why not bet them all in 1 bet? Likely because you were trying to stay under the radar? I tend to side with a casino in cases like this assuming a player made multiple bets on the same match.Yes, multiple bets coz their limits were like $2-5 per bet, but since they allow to rebet i made few more bets. Btw not all of my bets were on the same outcome, i bet on maps winner/match winner hoping something will win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "August 08, 2022, 09:10:56 PM",
      "body": "But did you break their terms and conditions?I mean, no matter how draconian or wrong their rules might seem to the average person, you did sign up to them when you registered. By betting in the manner you chose to, did you stay within their rules?Quote from: whatiwhat on August 08, 2022, 06:52:14 PMQuote from: yahoo62278 on August 08, 2022, 06:21:44 PMDid you have multiple bets placed on the same game? If so, why not bet them all in 1 bet? Likely because you were trying to stay under the radar? I tend to side with a casino in cases like this assuming a player made multiple bets on the same match.Yes, multiple bets coz their limits were like $2-5 per bet, but since they allow to rebet i made few more bets. Btw not all of my bets were on the same outcome, i bet on maps winner/match winner hoping something will win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 08, 2022, 11:03:20 PM",
      "body": "What suspicious activity exactly are they talking about? Have they sent you information about the suspicious activity? If it is multiple accounts, then they should be able to mention them and the evidence linking them.I would not love them to use the same line of excuses 1xbit uses when scamming its customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whatiwhat",
      "created_time": "August 09, 2022, 12:58:36 AM",
      "body": "Quote from: JollyGood on August 08, 2022, 09:10:56 PMsnipnah i only played at their sportsbook not abused bonuses or something else.Quote from: Bitcoin_Arena on August 08, 2022, 11:03:20 PMWhat suspicious activity exactly are they talking about? Have they sent you information about the suspicious activity? If it is multiple accounts, then they should be able to mention them and the evidence linking them.I would not love them to use the same line of excuses 1xbit uses when scamming its customers.The reason they withheld all my deposits and winnings is because I bet on some csgo match. My emails were ignored and no other explanation was given to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0S0ul",
      "created_time": "August 09, 2022, 02:53:26 AM",
      "body": "Quote from: whatiwhat on August 08, 2022, 02:08:51 PMowl.games excuses:Quote from: owlgames on July 31, 2022, 09:46:17 AMNew game accounts were created and bets were placed on the same markets (preventive work is currently in progress and access to more detailed data is temporarily restricted)\" Oh. So their forum representative is already aware and has already explained. Would you mind answering one question? Do you have another account on their platform?If not, I don't see any problem there. As You said on their thread, You created an account on July 14 and deposited it on the same day and placed the bet on July 25. How can it be a new account to place a bet on this game? Doesn't make sense to me. Is that was your first bet on this platform? Or have you placed bets before?Quote from: yahoo62278 on August 08, 2022, 06:21:44 PMDid you have multiple bets placed on the same game? If so, why not bet them all in 1 bet? Well, If their max bet is too low and they also allow to place multiple bets, I guess there is nothing wrong with placing multiple bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whatiwhat",
      "created_time": "August 09, 2022, 10:37:57 PM",
      "body": "Quote from: Crypt0S0ul on August 09, 2022, 02:53:26 AMsnipNo, this is my one and only account. Yes, I made a few bets on other matches before this csgo game and even successfully withdrew $556. This situation is absurd, they have already canceled winning bets, but this was not enough for them and they decided to steal my deposits and winnings from previous bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 10, 2022, 01:42:23 PM",
      "body": "I am looking through their TOS to see if you maybe broke a rule by placing multiple wagers on that CSGO match when there was a limit of a only a few dollars for your account. Indeed there is a rule that mentions that you are not allowed to wager above a certain limit for your account. However, it's not mentioned what the consequence of that is. Quote4.7 Owl.Games reserves the right to reject or limit wagers. The user is not permitted to wager an amount exceeding his/her personal account. Wins are credited to the personal account of the user.If that limit was $2 to $5 for your betting account, your broke their TOS by betting more than that. But there is also this:Quote8.1 If You breach any provision of these T&C or Owl.Games has a reasonable ground to suspect that You have breached them, Owl.Games reserves the right not to open, suspend, close Your Member Account, withhold payment of your winnings and apply such funds on account of any damages due by You. They have the right not to pay out your winnings, and they can use the balance on your account to compensate for any damages created by your activities. Not sure what damages you caused them though.Quote8.2 You acknowledge that Owl.Games shall be the final decision-maker of whether you have violated Owl.Games’s rules, terms or conditions in a manner that results in your suspension or permanent barring from participation in our site. Source: https://docs.owl.games/info/terms-and-conditionI would advice you to contact the casino one more time and ask them directly what rule in their TOS you broke and what is the consequence of your violation. They should point out those things in their TOS and tell you exactly what you did wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whatiwhat",
      "created_time": "August 12, 2022, 11:45:36 PM",
      "body": "Quote from: Pmalek on August 10, 2022, 01:42:23 PMQuote4.7 Owl.Games reserves the right to reject or limit wagers. The user is not permitted to wager an amount exceeding his/her personal account. Wins are credited to the personal account of the user.If that limit was $2 to $5 for your betting account, your broke their TOS by betting more than that. I just used the feature of their bookmaker. They could easily disable it if they wanted to.Quote from: Pmalek on August 10, 2022, 01:42:23 PMI would advice you to contact the casino one more time and ask them directly what rule in their TOS you broke and what is the consequence of your violation. They should point out those things in their TOS and tell you exactly what you did wrong.owl.games don't give a shit. They ignored my emails, their ceo(i suppose) ignored my message in telegram. I'll give them some more time, if they continue to ignore me I'll have no choice but file a complaint with Curacao Antillephone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 13, 2022, 07:00:56 AM",
      "body": "Quote from: whatiwhat on August 12, 2022, 11:45:36 PMI just used the feature of their bookmaker. They could easily disable it if they wanted to. I don't know what you mean with you \"used a feature in their bookmaker\". I am saying that the reason why your account could have been closed is that you placed multiple bets on a CSGO match where the total amount of wagered money exceeds the limit on your account. They might look at that as a rule infringement. The possibility to wager above a certain limit shouldn't be possible at all, but that's a somewhat different discussion.Quote from: whatiwhat on August 12, 2022, 11:45:36 PMowl.games don't give a shit. They ignored my emails, their ceo(i suppose) ignored my message in telegram. I'll give them some more time, if they continue to ignore me I'll have no choice but file a complaint with Curacao Antillephone. You might also want to get Casino.guru involved if you don't hear back from the casino. They will independently review your game history if needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0S0ul",
      "created_time": "August 14, 2022, 05:56:26 PM",
      "body": "Quote from: Pmalek on August 10, 2022, 01:42:23 PMQuote4.7 Owl.Games reserves the right to reject or limit wagers. The user is not permitted to wager an amount exceeding his/her personal account. Wins are credited to the personal account of the user.If that limit was $2 to $5 for your betting account, your broke their TOS by betting more than that. Interesting. If their max bet limit is like $2 to $5 and they have these kinds of rules. Why not put a restriction when players place bets? For example, \"Error- Max bet amount reached\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 15, 2022, 07:59:11 AM",
      "body": "Quote from: Crypt0S0ul on August 14, 2022, 05:56:26 PMInteresting. If their max bet limit is like $2 to $5 and they have these kinds of rules. Why not put a restriction when players place bets? For example, \"Error- Max bet amount reached\". That's exactly how it should be and other casinos are doing it exactly like that. I was betting on a rather unpopular sport a few weeks ago on Sportsbet and was surprised that my bet wasn't accepted. I initially thought that the casino limited my account so I contacted the support. Turns out, there were betting restrictions for that particular tournament where you couldn't wager more than €15 per match. If you tried to bet more or make multiple €15 bets, the system wouldn't allow you. That's the proper way of handling such cases. The Owl.games forum admin hasn't been online since 2 August. I asked them to comment and share their side of the story last week in their ANN thread, but no one has responded yet.Quote from: Pmalek on August 11, 2022, 08:17:33 AM@owlgamesThere is an active scam accusation against your casino:owl.games scamCan you post in the scam accusation thread and explain exactly the reasons why the player's account got banned and what he did wrong? Point us also to the parts of your TOS that were broken and where the consequences of the player's actions are mentioned. Like the confiscation of the user balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "August 15, 2022, 10:37:38 AM",
      "body": "Quote from: Pmalek on August 13, 2022, 07:00:56 AMI am saying that the reason why your account could have been closed is that you placed multiple bets on a CSGO match where the total amount of wagered money exceeds the limit on your account. They might look at that as a rule infringement. If this is indeed what happened the I must say that both parties share part of the responsibility: The player for not ignorant of the casino's ToS and exceeding the limits by placing multiple bets on the same game and the casino for allowing him to do so in first place.Voiding all bets is a reasonable and fair decision in this case but I don't see any reason to lock the player's account and seize his fund. What he did didn't cause any damage whatsoever.In the meantime, owl.games should fix this to prevent other players from making the same mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 15, 2022, 11:12:21 AM",
      "body": "Quote from: khaled0111 on August 15, 2022, 10:37:38 AMIf this is indeed what happened the I must say that both parties share part of the responsibility: The player for not ignorant of the casino's ToS and exceeding the limits by placing multiple bets on the same game and the casino for allowing him to do so in first place. Yes. If the player tried to trick the system he needs to answer for his actions, but such a manipulation shouldn't be possible in the first place. I think the casino is more at fault than the player in this situation. Quote from: khaled0111 on August 15, 2022, 10:37:38 AMVoiding all bets is a reasonable and fair decision in this case but I don't see any reason to lock the player's account and seize his fund. What he did didn't cause any damage whatsoever. No matter what their TOS says, the player should not have his deposits confiscated, only his winnings. If this turns out to be the cause for the seizing of his funds, I am thinking that the casino should be tagged with some red paint unless they fix the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlgames",
      "created_time": "August 15, 2022, 01:45:34 PM",
      "body": "Quote from: whatiwhat on August 09, 2022, 10:37:57 PMQuote from: Crypt0S0ul on August 09, 2022, 02:53:26 AMsnipNo, this is my one and only account. Yes, I made a few bets on other matches before this csgo game and even successfully withdrew $556. This situation is absurd, they have already canceled winning bets, but this was not enough for them and they decided to steal my deposits and winnings from previous bets.1. The sportsbet game is a 3rd party game from a standalone game provider, which we have no rights to cancel any bet for you, the game provider cancelled the bets. 2. The game provider informed us regarding they found your betting suspicious along with other new accounts. 3. We thereby ban your account along with several other accounts per the risk warning from the game provider. 4. Please noted that some pre-cautions ban was taken and waiting for final risk analysis from game providers: so please check your account status regularly. Unfortunately, we do not send emails regarding account status change because most of our players do not have any email on file. 5. If you truly think you should not be banned, please contact us via our 24x7 chat on website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 15, 2022, 03:57:36 PM",
      "body": "Quote from: owlgames on August 15, 2022, 01:45:34 PM1. The sportsbet game is a 3rd party game from a standalone game provider, which we have no rights to cancel any bet for you, the game provider cancelled the bets. 2. The game provider informed us regarding they found your betting suspicious along with other new accounts.Since you are partners with them then you should be able to liaise with them and at least provide information on why they think OP's account was suspicious rather than keep someone in the dark with a ban.Quote from: owlgames on August 15, 2022, 01:45:34 PM5. If you truly think you should not be banned, please contact us via our 24x7 chat on website. He says he did contact you, and you ignored his messages. That's not how a service is supposed to treat customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "whatiwhat",
      "created_time": "August 15, 2022, 04:14:16 PM",
      "body": "Eventually they unblocked my account and I got my money. The funny thing is that one of my bets was settled correctly and the winnings were credited to my account https://i2.paste.pics/I5AMW.png",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 15, 2022, 04:20:49 PM",
      "body": "Quote from: whatiwhat on August 15, 2022, 04:14:16 PMEventually they unblocked my account and I got my money. The funny thing is that one of my bets was settled correctly and the winnings were credited to my account https://i2.paste.pics/I5AMW.pngWell, congrats I guess it's time to move on. It's one week of waiting and it's good that they still released your funds though. So many were in the same situation and then left hanging. You're still lucky.SammyGambler's situation is different but the rules are being stated in the forum and turn out it's not allowed as a violation of TOS. Its more than 2 weeks already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlgames",
      "created_time": "August 15, 2022, 04:44:44 PM",
      "body": "Quote from: bittraffic on August 15, 2022, 04:20:49 PMQuote from: whatiwhat on August 15, 2022, 04:14:16 PMEventually they unblocked my account and I got my money. The funny thing is that one of my bets was settled correctly and the winnings were credited to my account https://i2.paste.pics/I5AMW.pngWell, congrats I guess it's time to move on. It's one week of waiting and it's good that they still released your funds though. So many were in the same situation and then left hanging. You're still lucky.SammyGambler's situation is different but the rules are being stated in the forum and turn out it's not allowed as a violation of TOS. Its more than 2 weeks already. We made clear that SandBox operates on their own. Please see our notes here: https://bitcointalk.org/index.php?topic=5378280.msg60758150#msg60758150Also we felt that you should adjust your words on 'so many were in the same situation'. Unfortunately, unless game providers delivers the risk analysis we are not able to do anything. And it usually takes several business days for them to do that. Our last fraud report from YGG was made final in 3 weeks, which is usual for traditional game providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}