{
  "id": "topic_5406696",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "July 18, 2022, 10:37:35 AM",
  "content": "Bitcoin “UçarakGeliyor” é uma expressão turca que significa \"Bitcoin esta voando\" é uma das tendências de pesquisa no Google nos últimos dias na Turquia, que apresenta uma inflação de 80%.Pelos os dados mais recentes, o Bitcoin esta a ter um aumento bastante significativo no país, apesar das limitações de pagamentos com criptomoedas.QuoteO par de negociação BTC/TRY da Binance agora lida com US$ 17,5 milhões em volumes diários de negociação. BtcTurk, sua exchange mais famosa, movimenta US$ 128 milhões, grande parte na posição superior com US$ 11 milhões.https://livecoins.com.br/bitcoin-esta-voando-na-turquia-enquanto-inflacao-encosta-em-80/E parece que não é só o Bitcoin que esta na \"moda\", mas também o ETH.Será que a Turquia esta a entrar num momento em que a população vai mesmo começar a usar o Bitcoin como moeda de troca?@TryNinja tiveste na Turquia, não foi? O que é que te pareceu essa ligação entre a população e as criptomoedas?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406696",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "July 18, 2022, 12:19:04 PM",
      "body": "Quote from: joker_josue on July 18, 2022, 10:37:35 AM@TryNinja tiveste na Turquia, não foi? O que é que te pareceu essa ligação entre a população e as criptomoedas?Contextualizando: [Journal] Bitcoin pelo mundoNunca vi um país com tantas menções às criptomoedas. Anúncios de exchanges por todos os lados, exchanges físicas totalmente tematizadas com imagens do Bitcoin e outras cryptos, casas de câmbio tradicionais que também aceitam crypto, lojas com o adesivo de \"bitcoin accepted here\", etc... a super inflação deles, com absoluta certeza, tem tudo a ver com isso. Mostra que essa tecnologia tem uma função importante onde mais importa, que é dar um acesso rápido e fácil à todos que querem fugir das burrices do seu Governo e BC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 18, 2022, 03:40:11 PM",
      "body": "Achas que se o ritmo de adoção por parte da população continuar a aumentar, irá fazer o governo criar mais restrições ou acabar por \"aceitar\" essa nova realidade?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "July 18, 2022, 03:49:48 PM",
      "body": "É interessante ver como as pessoas lidam com os problemas, e especificamente no caso do Bitcoin e criptos em países com problemas, pois pode acabar gerando um exemplo e uma tendênciaNa Turquia e na Argentina estamos vendo o Bitcoin sendo fortalecido e utilizado devido ao medo das pessoas de perderem o que possui em pouco tempoChega a ser bizarro e amedrontador você pensar que guardou dinheiro por anos e anos pra perder um valor imenso em pouco tempo e ter todo o trabalho e tempo \"jogados fora\" devido a erros de política, ganância, poder etc.Não conseguimos ver de perto porque não estamos lá no dia a dia, mas é incrível ver o Bitcoin e criptos podendo ser um último reduto para essas pessoas não perderem ainda mais o poder de compra. Por isso eu acredito no Bitcoin e apoio para que sempre tenhamos essa opção.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "July 18, 2022, 04:06:37 PM",
      "body": "Quote from: rdluffy on July 18, 2022, 03:49:48 PMNão conseguimos ver de perto porque não estamos lá no dia a dia, mas é incrível ver o Bitcoin e criptos podendo ser um último reduto para essas pessoas não perderem ainda mais o poder de compra. Por isso eu acredito no Bitcoin e apoio para que sempre tenhamos essa opção. Sim, seria interessante perceber se já haverá empresas a pagar ordenados em Bitcoin ou não.Talvez não, mas muitos devem converter logo em BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}