{
  "id": "topic_5468505",
  "title": "bbc.reporter",
  "author": "bbc.reporter",
  "created_time": "September 29, 2023, 03:40:46 AMLast edit: April 17, 2024, 03:31:07 AM by bbc.reporter",
  "content": "These are the odds offered by the sportsbooks. These movies, directors and later actresses, actors and other categories added are not yet official from the Academy of motion picture arts and sciences. However, if you are a movie expert or a couch potato, you might already know which of these directors and movies has a chance to win hehehe. Share your knowledge! Important dates.November 18, 2023 deadline for submission of general categories.December 18, 2023 preliminary votes and shortlists.January 11-16, 2024 nominations voting.January 23, 2024 official nominations announcement.February 22-27, 2024 final voting March 10, 2024 ceremony and announcement of winners.Other important dates.January 7, 2024, Golden Globe AwardsFebruary 10, 2024, Directors GuildFebruary 18, 2024, Bafta AwardsFebruary 24, 2024, Screen Actors GuildBest PictureOppenheimer 2.20  1.77Killers of The Flower Moon 3.70  4.50Poor Things 6.00 Past Lives 9.00  10.00[New Entry] The Holdovers 10.00 Lee 12.00  13.00Maestro 12.00  13.00Anatomy of A Fall 13.00 The Color Purple 15.00  14.00The Killer 17.00 15.00Best DirectorNolan, Christopher 1.50Scorsese, Martin 3.00Lanthimos, Yorgos 4.50Gerwig, Greta 7.00Glazer, Jonathan 7.50Song, Celine 8.00Triet, Justine 13.00Cooper, Bradley 14.00Fennell, Emerald 14.00Fincher, David 17.00Best ActorMurphy, Cillian 1.83Domingo, Colman 3.45Di Caprio, Leonardo 3.75Cooper, Bradley 4.00Keoghan, Barry 9.00Dafoe, Willem 11.00Giamatti, Paul 12.00Kingsley, Ben 13.00Gosling, Ryan 13.00Yoo, Teo 15.00Best ActressStone, Emma 2.35Gladstone, Lily 3.00Mulligan, Carey 3.50Bening, Annette 4.00Barrino, Fantasia 4.25Huller, Sandra 7.50Robbie, Margot 8.50Lee, Greta 10.00Spaeny, Cailee 12.00Portman, Natalie 15.00",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468505",
  "comments": [
    {
      "author": "noormcs5",
      "created_time": "September 29, 2023, 03:56:21 AM",
      "body": "Quote from: bbc.reporter on September 29, 2023, 03:40:46 AMThese are the odds offered by the sportsbooks. These movies, directors and later actresses, actors and other categories added are not yet official from the Academy of motion picture arts and sciences. However, if you are a movie expert or a couch potato, you might already know which of these directors and movies has a chance to win hehehe. Share your knowledge! More important thing, where can we bet on the 2024 Oscars award? On which sites do you prefer to bet as i don't think the majority of the sports betting site will list these bets.The most probable date for the Oscar award is 10th March 2024 while the submission date of different categories entries will be somewhere around the middle or end of November this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "September 30, 2023, 02:38:54 AM",
      "body": "@noormcs5. Where to bet on the Oscar awards? It is in your signature hehehe. The sportsbook I checked only has the odds for best director and the best movie categories. In your sportsbook it also has the categories for the best actress and best actor which I will copy and add later.In case what is everyone's favorite picks? @Rikaflip. Oppenheimer is the favorite! This is what I have speculated when we were discussing movies during the last Oscar awards hehehe. Will Christopher Nolan win his first oscar? There is a conspiracy theory that the academy hates him hehehe. Also, Oppenheimer was a good movie, however, good for watching at home only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "edmundduke",
      "created_time": "September 30, 2023, 05:35:35 AM",
      "body": "Quote from: bbc.reporter on September 30, 2023, 02:38:54 AM@noormcs5. Where to bet on the Oscar awards? It is in your signature hehehe. The sportsbook I checked only has the odds for best director and the best movie categories. In your sportsbook it also has the categories for the best actress and best actor which I will copy and add later.In case what is everyone's favorite picks? @Rikaflip. Oppenheimer is the favorite! This is what I have speculated when we were discussing movies during the last Oscar awards hehehe. Will Christopher Nolan win his first oscar? There is a conspiracy theory that the academy hates him hehehe. Also, Oppenheimer was a good movie, however, good for watching at home only.I think Oppenheimer will most likely go home with a few. It seemed to be generally praised by critics and movie goers so it will be a solid bet. It would be so funny if Barbie won aswell, not because it is good, but just to be a sign of times lolI think The Color Purple will win something aswell, i have no clue what it will be, but im pretty sure it will get something given to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "September 30, 2023, 05:46:52 AM",
      "body": "I'm just wondering, and it's always on my head for long.I am sure there are already people behind the scene who knows what will be the result, as of course some of them are part of the judging panel and for sure might leak any information within their circle of friends. Is there a possibility that some of them, even at a low chance, are enthusiasts of placing a bet on this event and they will take advantage of that information?Anyways, back to the topic, I think too that Oppenheimer likely has a chance to grab that Best Picture Award but I think Killers of the Flower Moon is also a good movie or maybe I'm just biased because I really like the crime drama film genre (I wasn't able to watch it yet). As for the Best Director, it's usually the Best Picture Awardee that likely gets the Best Director award.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 03, 2023, 04:41:57 AM",
      "body": "@chaser15. I am quite certain there are no insiders who know who will win this early in the Oscars race hehehe. Also, there are no judges in the Oscar awards. The nominees and the winners are voted by the members of the Academy of arts and motion pictures sciences which has more than 10,000 members including actors, actresses, directors, producers, screenwriters, cameramen, designers and other ordinary people who work in the movie industry. There might be some bribery and politics, however hehehehe. However, knowing who the winners will be? This is very difficult. Some insiders might have information only after nominations voting on January which might also go to the oddsmakers. @edmundduke. On Oppenheimer, it might not win. The Oscars voters have voted on emotional and inspirational movies for best picture on 2022 and 2023 with Coda and Everything Everywhere. They might do this again hehe.On Barbie, agreed, it might be nominated for best costume and production design hehe. I have not seen the movie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 03, 2023, 06:21:15 AM",
      "body": "In my opinion, the first 3 categories will go to the most favorite and strong contender, none other than the excellence from the film \"Oppenheimer.\" Coming from one of the most acclaimed directors and one of the most talented actors working today. This will be the first time for Nolan if he wins.But, of course, the actual results can often be surprising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xLays",
      "created_time": "October 03, 2023, 10:03:58 AM",
      "body": "All in for; My pick for the Oscar's Best Picture is \"Killers of The Flower Moon,\" directed by (Best Director) Martin Scorsese with Leonardo DiCaprio winning Best Actor and Lily Gladstone for the Best Actress award! Eventhough Killers of The Flower Moon is not currently showing in theaters the trailer says it all, building excitement and anticipation for its Oscar worthy performance!Watch the trailer here: https://www.youtube.com/watch?v=7cx9nCHsemc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "October 04, 2023, 03:19:39 AM",
      "body": "Quote from: xLays on October 03, 2023, 10:03:58 AMAll in for; My pick for the Oscar's Best Picture is \"Killers of The Flower Moon,\" directed by (Best Director) Martin Scorsese with Leonardo DiCaprio winning Best Actor and Lily Gladstone for the Best Actress award! Eventhough Killers of The Flower Moon is not currently showing in theaters the trailer says it all, building excitement and anticipation for its Oscar worthy performance!Watch the trailer here: https://www.youtube.com/watch?v=7cx9nCHsemcI heard a lot of positive reviews related to this movie, but I am not sure whether it has the calibre to overtake the hype created by Oppenheimer. The combination of Martin Scorsese-Leonardo DiCaprio- Robert De Niro looks tempting, but it may not be enough to overcome the challenge from Christopher Nolan and Cillian Murphy in the form of Oppenheimer. I would still say that given the odds, it looks extremely attractive to make a bet in favor of Oppenheimer. IMO, the realistic odds should be somewhere in the range of 1.80-2.00.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 07, 2023, 01:56:33 AM",
      "body": "Quote from: Text on October 03, 2023, 06:21:15 AMIn my opinion, the first 3 categories will go to the most favorite and strong contender, none other than the excellence from the film \"Oppenheimer.\" Coming from one of the most acclaimed directors and one of the most talented actors working today. This will be the first time for Nolan if he wins.But, of course, the actual results can often be surprising.I had a similar speculation before because it is quite certain that the nuclear war storyline will be hyped on social media and mainstream news media. However, if you look at the winners for the last 2 years, the favorites before the official nominations were announced never won the Oscar. The movies that won were emotional movies about family, love and making the world a better world. What are these emotional and inspirational movies? I honesly have not watched much movies this year.In any case, the nuclear war storyline is only beginning.Vladimir Putin has ramped up his nuclear rhetoric, saying his country had successfully tested the nuclear-powered, nuclear-capable Burevestnik strategic cruise missile, as he suggested Russia could resume nuclear testing for the first time in more than three decades.Source https://www.theguardian.com/world/2023/oct/05/vladimir-putin-escalates-nuclear-rhetoric-with-threat-to-resume-testing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "October 25, 2023, 04:08:40 AM",
      "body": "News update.I reckon everyone might be concentrated very intently on Oppenheimer, Christopher Nolan, Cillian Murphy and Killers of the flower moon, Martin Scorsese, Leonardo Di Caprio hehe. There is a new movie that will be premiered on November 22 called Napoleon. This is directed by Ridley Scott and the role of Napoleon is played by Joaquin Phoenix. I speculate this might disappoint that fans of Nolan and Scorsese. The last time Ridley Scott and Joaquin Phoenix worked together was in the movie Gladiator where it won for best movie and best actor.Joaquin Phoenix is highly regarded as one of the greatest working actors today, as displayed in the varied roles he portrays and the multiple respected directors he has worked with. He now reunites with Ridley Scott, with whom he first worked with on “Gladiator” over two decades ago in 2000, on the upcoming historical epic “Napoleon,” playing the titular French commander set to be released on November 22.Source https://www.goldderby.com/feature/joaquin-phoenix-oscar-nominations-napoleon-1205584681/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "October 25, 2023, 06:58:12 AM",
      "body": "I think that Oppenheimer will win all the Oscars in the categories where it has nominations.Not because it's a great movie(it is pretty good, but I'm not that impressed), but because we live in the constant thread of a World War III right now. The USA tested nuclear weapons. Russia will get out of the treaty, which reduced nuclear weapon testing. There's is tension in the Middle East. Israel and Iran probably have nuclear weapons. Hollywood became totally political in the last few years and I don't believe that anything will change. The only good thing is that there won't be that much liberal propaganda this year(at least I hope so).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "redsun114",
      "created_time": "October 29, 2023, 06:11:29 PM",
      "body": "Quote from: davis196 on October 25, 2023, 06:58:12 AMI think that Oppenheimer will win all the Oscars in the categories where it has nominations.Not because it's a great movie(it is pretty good, but I'm not that impressed), but because we live in the constant thread of a World War III right now. The USA tested nuclear weapons. Russia will get out of the treaty, which reduced nuclear weapon testing. There's is tension in the Middle East. Israel and Iran probably have nuclear weapons. Hollywood became totally political in the last few years and I don't believe that anything will change. The only good thing is that there won't be that much liberal propaganda this year(at least I hope so).I haven't watched the movie yet despite of being popular but I only saw the trailer of it almost anywhere. Maybe many will also agree that it was a good movie but we can't just end up on a conclusion and say that it will win all the nominations being thrown at it.We shouldn't forget that there are also other participants and maybe some of them are also a great movie or actors, actresses, directors, etc... Plus you said Hollywood became political now, so expect that there will be some kind of manipulations going on here. It's a bad thing. I understand why many people are now losing their interest in these kind of events.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "October 29, 2023, 06:36:56 PM",
      "body": "Quote from: redsun114 on October 29, 2023, 06:11:29 PMQuote from: davis196 on October 25, 2023, 06:58:12 AMI think that Oppenheimer will win all the Oscars in the categories where it has nominations.Not because it's a great movie(it is pretty good, but I'm not that impressed), but because we live in the constant thread of a World War III right now. The USA tested nuclear weapons. Russia will get out of the treaty, which reduced nuclear weapon testing. There's is tension in the Middle East. Israel and Iran probably have nuclear weapons. Hollywood became totally political in the last few years and I don't believe that anything will change. The only good thing is that there won't be that much liberal propaganda this year(at least I hope so).I haven't watched the movie yet despite of being popular but I only saw the trailer of it almost anywhere. Maybe many will also agree that it was a good movie but we can't just end up on a conclusion and say that it will win all the nominations being thrown at it.We shouldn't forget that there are also other participants and maybe some of them are also a great movie or actors, actresses, directors, etc... Plus you said Hollywood became political now, so expect that there will be some kind of manipulations going on here. It's a bad thing. I understand why many people are now losing their interest in these kind of events.i happen to have seen Oppenheimer but never have I understood a thing. i might just watch it again. how often does the movie watcher's favorite win an Oscar by the way? it seems Oppenheimer and Killers of The Flower Moon have the closest odds and have only a chance of winning. and it's a long wait for the winners will be announced months later in March next year.i heard these movies are very related to current events these days, very political and i think they are the only very possible to win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "October 29, 2023, 06:57:33 PMLast edit: October 29, 2023, 07:20:59 PM by Saint-loup",
      "body": "Bookmakers really think Barbie will be nominated for the ceremony as a contestant for the best picture of the year? Along with Margot Robbie and Ryan Gosling as contestant for best actor and actress of the year? OMG it's insane. There is an option to bet against that somewhere? That would be crazy to be honest, I don't think it's a bad movie, but we are talking about the award of the Oscars academy here. For me, it was more a children or teenage movie than an adult one. And especially, more a long advertising for Mattel and Barbie toys than a serious movie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "November 04, 2023, 05:32:24 AM",
      "body": "Quote from: davis196 on October 25, 2023, 06:58:12 AMI think that Oppenheimer will win all the Oscars in the categories where it has nominations.Not because it's a great movie(it is pretty good, but I'm not that impressed), but because we live in the constant thread of a World War III right now. The USA tested nuclear weapons. Russia will get out of the treaty, which reduced nuclear weapon testing. There's is tension in the Middle East. Israel and Iran probably have nuclear weapons. Hollywood became totally political in the last few years and I don't believe that anything will change. The only good thing is that there won't be that much liberal propaganda this year(at least I hope so).Similar to what I have said before, this is not a certainty. Oppenheimer was not a very inspiring movie and if you have noticed, the members of the Academy of motion picture arts and sciences have more voted for movies like Green Book, Coda and Everything Everywhere for the best movie which were positive and inspiring. The favorites against those movies did not win. I have not yet watched much of the movies that have a chance to be nominated to make a recommendation which movies are inspiring.Other important dates before the Oscar Awards.January 7, 2024, Golden Globe AwardsFebruary 10, 2024, Directors GuildFebruary 24, 2024, Screen Actors Guild@Saint-loup. I am quite certain that it will not be nominated.@electronicash. The oddsmakers might only be guessing because they have the most popular directors. However, I reckon Napoleon might be very underestimated. It is directed by Ridely Scott and has Joaquin Phoenix as leading actor. They worked together on the movie The Gladiator which has won best picture, best director for Ridley and best supporting actor for Joaquin Phoenix. If this movie inspires, this might be the underdog winner hehhehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 04, 2023, 05:49:37 AM",
      "body": "Quote from: Saint-loup on October 29, 2023, 06:57:33 PMBookmakers really think Barbie will be nominated for the ceremony as a contestant for the best picture of the year? Along with Margot Robbie and Ryan Gosling as contestant for best actor and actress of the year? OMG it's insane. There is an option to bet against that somewhere? That would be crazy to be honest, I don't think it's a bad movie, but we are talking about the award of the Oscars academy here. For me, it was more a children or teenage movie than an adult one. And especially, more a long advertising for Mattel and Barbie toys than a serious movie.Don't Look Up movie doesn't look very serious movie also but it was very relatable to the what is happening in the society just like Barbie 2023. it creates the divide of the society whether it includes race, men and women or political views. i will be watching the Openhiemer to see how the writer may have twisted the story. most of the time the story teller always want to benefit on how it go and they end up righteous in the eyes of the watchers. Green Book is such a story of racism, quite true even today we identify which city/state is a black state.which story usually win the oscar, there must be a pattern for this. whether a story that tells about war or the story about divided society?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "November 05, 2023, 06:07:20 AM",
      "body": "@electronicash. This Barbie movie is only trying to have a meaningful message, however, @Saint-loup is right. This movie is only a big commercial for a toy company very much similar to many other of these common cartoon shows.In any case, on your question on which story usually win an Oscar in best movie category, you only need to look at the 5 last best movies. Everything Everywhere, Coda, Nomadland, Parasite and Greenbook. They are stories about family, growing up, being connected, perseverance and friendship. All of them are inspirational movies except for Parasite.The favorite Oppenheimer is not very inspirational, I reckon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "November 05, 2023, 10:00:03 PM",
      "body": "In short, the Oscar Awards seem close... but it is the awards season that adjusts the reality of the \"@\" although they say otherwise many betting houses, which remain \"stuck\" with these initial \"@.\"Then, awards season can make our bet more precise, consequently Oppenheimer being the candidate for these Oscar Awards, but be careful, eh!The list of awards is longer than indicated, without a doubt they are the most important awards, Golden Globe Awards, Directors Guild, Screen Actors Guild, I would add:Independent Spirit Awards, Critic's Choice among others but one that closes strongly is the Bafta. So no matter what the \"@\" says, awards season better defines where the real winners are and still, surprises happen at the Oscar Awards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "November 06, 2023, 12:06:17 AM",
      "body": "Quote from: Saint-loup on October 29, 2023, 06:57:33 PMBookmakers really think Barbie will be nominated for the ceremony as a contestant for the best picture of the year? Along with Margot Robbie and Ryan Gosling as contestant for best actor and actress of the year? OMG it's insane. There is an option to bet against that somewhere? That would be crazy to be honest, I don't think it's a bad movie, but we are talking about the award of the Oscars academy here. For me, it was more a children or teenage movie than an adult one. And especially, more a long advertising for Mattel and Barbie toys than a serious movie.I think it was a genius move from Mattel to let them openly critizise the Barbie brand in the movie. It had fresh takes and frankly it surprised me positively. Maybe it wins with best original song or best adapted screenplay or something, but i don't think it's in the same league as other films nominated.And would be absolutely puzzled if Oppenheimer wouldn't win best director award. Making a movie of that scale, that is supposed to have atom bomb blast without any CGI is an ambitious job to say the least. But i guess they don't do it purely on ideological reasons. I remember Nolan saying that they choose to blew up a real working Boeing 747 for Tenet because it is cheaper than doing it with CGI.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}