{
  "id": "topic_5429820",
  "title": "GxSTxV",
  "author": "GxSTxV",
  "created_time": "December 17, 2022, 07:47:16 PM",
  "content": "مؤخرا دخلت الى احد مشاريع شبكة الجيل الثالث والذي كان اكبر بكثير مما تخيلت فهو عالم اخر من الفرص المتاحة لتحقيق اهداف وثروة في اي مجال تتقنه لهذا اود ان اشارك معكم بعض المعلومات التي حصلت عليها من خلال بحثي وما فهمته في الايام السابقة من عملي مع احد المشاريع وايضا فرص العمل في هذا المجال الذي لا يتطلب استثمارا مثلما ضننت في الاول فيكفي ان يكون لدي وقت وتتعلم شيء من هذه الخدمات التي سوف تحصل على عمل مقابلهاأولآ يشير Web3 إلى الجيل الثالث من شبكة الويب العالمية ، والذي يركز على استخدام التقنيات اللامركزية مثل البلوكشين وشبكاتpeer to peer  لتمكين قدر أكبر من اللامركزية والاستقلالية على الإنترنت.هناك العديد من الفوائد المحتملة لاستخدام تقنيات web3 ، بما في ذلك:اللامركزية: تمكن تقنيات Web3 الشبكات والأنظمة اللامركزية ، مما يعني أنها لا تخضع لسيطرة أي كيان واحد. ويمكن أن يوفر ذلك قدرا أكبر من الأمن والقدرة على الصمود، فضلا عن توزيع أكثر إنصافا للسلطة والموارد.الأمان: يمكن أن توفر تقنيات Web3 ، مثل blockchain ، أمانا محسنا للبيانات والمعاملات ، حيث يتم تأمينها باستخدام تقنيات التشفير والشبكات اللامركزية.زيادة الخصوصية: يمكن لتقنيات Web3 تمكين زيادة الخصوصية للمستخدمين ، حيث لا تعتمد الشبكات اللامركزية على الخوادم المركزية التي يمكن اختراقها أو الوصول إليها من قبل أطراف ثالثة. زيادة إمكانية الوصول: يمكن لتقنيات Web3 أن تتيح وصولا أكبر إلى المعلومات والخدمات للأشخاص في المجتمعات الممثلة تمثيلا ناقصا أو المحرومة من الخدمات ، لأنها لا تعتمد على البنية التحتية المركزية. بالنسبة لعروض العمل ، يوجد حاليا طلب كبير على المهنيين ذوي الخبرة في تقنيات web3 ، مثل مطوري blockchain ومحللي العملات المشفرة ومديري منتجات web3. قد يعمل هؤلاء المحترفون في مجموعة متنوعة من الصناعات ، بما في ذلك التمويل والرعاية الصحية وإدارة سلسلة التوريد ، من بين أمور أخرى. وانا شخصيا عملت على مشروع كمدير المجتمع الخاص بالعرب وكل ما يتطلب هو معلومات كافية حول ما شرحته في الاعلى وللبحث عن فرص عمل يكفي ان تعرف بعض المشاريع التي تقوم على ال web3 وارسال معلوماتك لاحد هذه المشاريع وتنتظر قبولهم للبدا في العمل والمفاهمة على السعرهناك العديد من مشاريع web3 المختلفة التي يتم تطويرها واستخدامها اليوم. تتضمن بعض الأمثلة ما يلي:منصات Blockchain: هناك العديد من منصات blockchain المختلفة التي يتم تطويرها واستخدامها لمجموعة متنوعة من الأغراض ، مثل Ethereum ، وهي منصة لامركزية تدير عقودا ذكية.منصات التمويل اللامركزي (DeFi): تستخدم منصات DeFi تقنية blockchain لتمكين المعاملات والخدمات المالية دون الحاجة إلى المؤسسات المالية التقليدية. تشمل الأمثلة منصات الإقراض والاقتراض وتداول العملات المشفرة.المنظمات المستقلة اللامركزية (DAOs): DAOs هي منظمات لامركزية يتم تشغيلها بواسطة عقود ذكية على منصات blockchain. وهي تسمح باللامركزية في صنع القرار والحوكمة.أرجو اضافة معلومات اكثر اذا امكن ورأيكم حول هذا الامر. بالمناسبة اني قمت باستخدام ترجمة لبعض الكلمات من اللغة الانجليزية الى العربية ولا اعرف اذا كانت مفهومة ودقيقة",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429820",
  "comments": [
    {
      "author": "samcoin",
      "created_time": "December 23, 2022, 12:32:01 PMLast edit: December 23, 2022, 02:24:47 PM by samcoin",
      "body": "المفهوم الأشمل ل Web3 من وجهة نظري هو إمكانية الحصول على عائد مادي مقابل كل ما تقوم به عبر الإنترنت, مثل الحصول على عائد مادي مقابل التصفح, والدردشة, والتفاعل على مواقع التواصل, ولعب الألعاب. لذلك أود أن أضيف مجال جديد كلياً ومرتبط ب Web3 وهو مجال ألعاب الجيل الثالث من الإنترنت و التي بدأنا نشاهد انتشارها كونها يمكن أن تشكل مصدر دخل لمحبي الألعاب, بالإضافة إلى أن الكثير من شركات الألعاب التقليدية بدأت تدخل بعض التعديلات على ألعابها بحيث تصبح ألعابها شبية أو قريبة بعض الشيء لألعاب الجيل الثالث وأشهر هذه التعديلات هي إضافة NFT ضمن اللعبة.في ألعاب Web3 يمكن تحقيق ربح مادي ضمن اللعبة بعدة طرق, وهذا ما لاحظته مؤخراً من خلال إحدى الألعاب التي قمت بترجمتها للعربية:1- ربح توكن اللعبة لقاء اجتياز مراحل معينة أو الوصول لأهداف معينة ضمن اللعبة.2- إنشاء NFT خاص بك ضمن اللعبة و بيعه.3- المتاجرة بالأصول ضمن اللعبة والتي تكون على شكل NFT, بالإضافة إلى أن بعض الأصول يمكن تأجيرها أيضاً.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "December 23, 2022, 09:39:27 PM",
      "body": "Quote from: samcoin on December 23, 2022, 12:32:01 PMالمفهوم الأشمل ل Web3 من وجهة نظري هو إمكانية الحصول على عائد مادي مقابل كل ما تقوم به عبر الإنترنت, مثل الحصول على عائد مادي مقابل التصفح, والدردشة, والتفاعل على مواقع التواصل, ولعب الألعاب. لذلك أود أن أضيف مجال جديد كلياً ومرتبط ب Web3 وهو مجال ألعاب الجيل الثالث من الإنترنت و التي بدأنا نشاهد انتشارها كونها يمكن أن تشكل مصدر دخل لمحبي الألعاب, بالإضافة إلى أن الكثير من شركات الألعاب التقليدية بدأت تدخل بعض التعديلات على ألعابها بحيث تصبح ألعابها شبية أو قريبة بعض الشيء لألعاب الجيل الثالث وأشهر هذه التعديلات هي إضافة NFT ضمن اللعبة.في ألعاب Web3 يمكن تحقيق ربح مادي ضمن اللعبة بعدة طرق, وهذا ما لاحظته مؤخراً من خلال إحدى الألعاب التي قمت بترجمتها للعربية:1- ربح توكن اللعبة لقاء اجتياز مراحل معينة أو الوصول لأهداف معينة ضمن اللعبة.2- إنشاء NFT خاص بك ضمن اللعبة و بيعه.3- المتاجرة بالأصول ضمن اللعبة والتي تكون على شكل NFT, بالإضافة إلى أن بعض الأصول يمكن تأجيرها أيضاً. صحيح اغلب المشاريع القائمة على الويب ٣ تتضمن اما الاستثمارات بأي شكل من الاشكال او الربح مقابل تقديم خدمات ربما توجد مشاريع ومواقع اخرى لافكار مختلفة لكن يتوجب ان تكون عليها dapp الالعاب التي تحدثت عليها حاليا في صدارة افضل المشاريع لهذا العام وانا شخصيا ادير مجتمع لمشروع فكرته لعبة على الميتافرس اي يمكنك ان تربح وتبيع ال nfts الخاصة بك بالاضافة على شراء عملة المشروع ايضا للحصول على امتيازات عديدةاضن ان كل هذا التطور في الكريبتو سيكون الثورة القادة في عالم العملات الرقمية ويشعل السوق من جديد",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 26, 2022, 02:49:58 AM",
      "body": "Quote from: GxSTxV on December 17, 2022, 07:47:16 PMزيادة الخصوصية: يمكن لتقنيات Web3 تمكين زيادة الخصوصية للمستخدمين ، حيث لا تعتمد الشبكات اللامركزية على الخوادم المركزية التي يمكن اختراقها أو الوصول إليها من قبل أطراف ثالثة. زيادة إمكانية اتفق معك أخي ومع الأخ  samcoin في الكثير من النقاط التي ذكرتموها حول  تقنيات Web3 ، لكني لا أتفق مع هذه النقطة بالتحديد لأنني عانيت منها شخصيا. جميعكم تذكرون حادثة ممحفظة MetaMask التي قاموا فيها بحظر المستخدمين الروس والدول الموالية للروس أو التي تدور في فلكهم مثل سوريا، لقد قاموا بحظري ولم أعد أستطع استخدام المحفظة حيث تعذر علي الاتصال بكل المواقع أو التطبيقات التي تتطلب الاتصال عن طريق ميتاماسك. هذا انتهاك واضح للخصوصية، زعموا أنهم يحافظون على الخصوصية بشكل كبير وليس لديهم القدرة على الوصول إلى بيانات المستخدم، كما أنهم زعموا أن المحفظة لامركزية بشكل كامل!!!!لقد تبين كذب الأمرين: 1 - هم لا يحافظون على الخصوصية ولديهم القدرة على الوصول إلى بيانات المستخدم بدليل أنهم قاموا بحظري وحظر المستخدمين الروس عن طريق قراءة بيانات جهاز الموبايل أو الكمبيوتر ومعرفة IP. 2 - كذبوا أيضا في موضوع اللامركزية لأنه تبين أنه بإمكانه التحكم بالمحفظة ومنع المستخدمين من الوصول للتطبيقات أو استخدام خدمات ميتاماسك. طبعا بعد الحادثة وبعد أن تم فضحهم على الانترنت قاموا بإلغاء الحظر، لكن هذا الحادثة كانت سببا جيدا في معرفة أنه لايمكن الوثوق بهذه التطبيقات بشكل كامل. مثال آخر على تطبيقات Web3 التي يتم فيها حظر المستخدمين بناء على IP هو متصفح Brave، أيضا نفس الشي يمكن تنصيب المتصفح واستخدام معظم الميزات لكن هناك ميزات تكون معطلة عندك بناء على IP الدولة التي تعمل منها، مثلا أنا استخدم المتصفح لكن ممنوع من استخدام برنامج المكافآت وربح التوكن الخاص بالمتصفح بسبب كوني من دولة محظورة. برأيي لم نصل إلى الشكل المطلوب بعد من تقنية WEB3 كما هو مفروض أو متوقع أن تكون، لأن اللامركزية حسب وجهة نظري يجب أن تكون التطبيقات مفتوحة للجميع ولايمكن لأي جهة التحكم أو حظر أي شخص من استخدام هذه الخدمات كما هو الحال مع البيتكوين مثلا الذي هو أفضل مثال على اللامركزية والمحافظة على الخصوصية.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "December 26, 2022, 06:23:09 PM",
      "body": "Quote from: yhiaali3 on December 26, 2022, 02:49:58 AMبرأيي لم نصل إلى الشكل المطلوب بعد من تقنية WEB3 كما هو مفروض أو متوقع أن تكون، لأن اللامركزية حسب وجهة نظري يجب أن تكون التطبيقات مفتوحة للجميع ولايمكن لأي جهة التحكم أو حظر أي شخص من استخدام هذه الخدمات كما هو الحال مع البيتكوين مثلا الذي هو أفضل مثال على اللامركزية والمحافظة على الخصوصية. أتفق معك في هذه النقطة.يتمثل أحد الأهداف الرئيسية للتكنولوجيات اللامركزية في إنشاء أنظمة مفتوحة ومتاحة للجميع، دون الحاجة إلى سلطة مركزية أو وسيط. يمكن أن يساعد ذلك في ضمان أن تكون هذه الأنظمة أكثر مقاومة للرقابة والاحتيال وأشكال الإساءة الأخرى.ومع ذلك، من المهم أيضا ملاحظة أن اللامركزية مفهوم معقد ومتعدد الأوجه، وهناك العديد من الطرق المختلفة التي يمكن تنفيذها وتطبيقها. على هذا النحو، ليس من السهل دائما تحقيق اللامركزية الحقيقية في الممارسة العملية، وقد تكون هناك مقايضات يجب إجراؤها من أجل تحقيق التوازن بين فوائد اللامركزية واعتبارات أخرى.بشكل عام، إنه وقت مثير للتكنولوجيات اللامركزية، وسيكون من المثير للاهتمام أن نرى كيف تستمر في التطور والتأثير على العالم في السنوات القادمة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 27, 2022, 02:18:02 AM",
      "body": "Quote from: Ulven on December 26, 2022, 06:23:09 PMومع ذلك، من المهم أيضا ملاحظة أن اللامركزية مفهوم معقد ومتعدد الأوجه، وهناك العديد من الطرق المختلفة التي يمكن تنفيذها وتطبيقها. على هذا النحو، ليس من السهل دائما تحقيق اللامركزية الحقيقية في الممارسة العملية، وقد تكون هناك مقايضات يجب إجراؤها من أجل تحقيق التوازن بين فوائد اللامركزية واعتبارات أخرى.بشكل عام...يا صديقي ليست المشكلة في اللامركزية بحد ذاتها، لكن المشكلة في الشركات القائمة على هذه التطبيقات اللامركزية وخضوعها للحكومات التي تكره اللامركزية وتفرض على هذه الشركات شروط وقيود معينة، مثل حظر بعض الدول من استخدام التطبيق أو حتى جمع معلومات من المستخدمين أو أي أشياء أخرى تقتل اللامركزية. للتوضيح أكثر نعود لمثالنا السابق حول حادثة تطبيق محفظة ميتامسك، لماذا يقوم تطبيق لامركزي بحظر هذه الدول؟ الجواب ببساطة حسب رأيي: بسبب الحكومة التي تقوم بحظر هذه الدول وبالتالي تجد الشركات القائمة على هذه التطبيقات نفسها مرغمة على اتباع سياسة الدولة المتواجدة بها خوفا من تعرضها لعقوبات هي الأخرى من قبل الحكومة. هنا المشكلة وهنا الفرق بين البيتكوين وهذه التطبيقات التي تزعم أنها لامركزية، هذه التطبيقات جميعها في النهاية مملوكة لجهة أو شركة أو منظمة أو أي كان مما يعني أنها ليست لامركزية بشكل كامل. بينما التجربة الفريدة في البيتكوين أنه لاتوجد جهة أو منظمة تملك البيتكوين أو تستطيع السيطرة عليه أو التحكم به لذلك لايخضع البيتكوين لشروط وقوانين أي دولة كما أنه لايرتبط بأي نظام اقتصادي أو سياسي.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcoin",
      "created_time": "December 27, 2022, 07:23:42 PMLast edit: December 27, 2022, 10:07:25 PM by samcoin",
      "body": "Quote from: yhiaali3 on December 27, 2022, 02:18:02 AMQuote from: Ulven on December 26, 2022, 06:23:09 PMومع ذلك، من المهم أيضا ملاحظة أن اللامركزية مفهوم معقد ومتعدد الأوجه، وهناك العديد من الطرق المختلفة التي يمكن تنفيذها وتطبيقها. على هذا النحو، ليس من السهل دائما تحقيق اللامركزية الحقيقية في الممارسة العملية، وقد تكون هناك مقايضات يجب إجراؤها من أجل تحقيق التوازن بين فوائد اللامركزية واعتبارات أخرى.بشكل عام...يا صديقي ليست المشكلة في اللامركزية بحد ذاتها، لكن المشكلة في الشركات القائمة على هذه التطبيقات اللامركزية وخضوعها للحكومات التي تكره اللامركزية وتفرض على هذه الشركات شروط وقيود معينة، مثل حظر بعض الدول من استخدام التطبيق أو حتى جمع معلومات من المستخدمين أو أي أشياء أخرى تقتل اللامركزية. للتوضيح أكثر نعود لمثالنا السابق حول حادثة تطبيق محفظة ميتامسك، لماذا يقوم تطبيق لامركزي بحظر هذه الدول؟ الجواب ببساطة حسب رأيي: بسبب الحكومة التي تقوم بحظر هذه الدول وبالتالي تجد الشركات القائمة على هذه التطبيقات نفسها مرغمة على اتباع سياسة الدولة المتواجدة بها خوفا من تعرضها لعقوبات هي الأخرى من قبل الحكومة. هنا المشكلة وهنا الفرق بين البيتكوين وهذه التطبيقات التي تزعم أنها لامركزية، هذه التطبيقات جميعها في النهاية مملوكة لجهة أو شركة أو منظمة أو أي كان مما يعني أنها ليست لامركزية بشكل كامل. بينما التجربة الفريدة في البيتكوين أنه لاتوجد جهة أو منظمة تملك البيتكوين أو تستطيع السيطرة عليه أو التحكم به لذلك لايخضع البيتكوين لشروط وقوانين أي دولة كما أنه لايرتبط بأي نظام اقتصادي أو سياسي. أتفق معك أخي, هذه مشكلة كبيرة تهدد سوق الكريبتو, فالحكومات لن تدع هذا السوق بدون تنظيم والسبب هو أن الحجم السوقي ينمو في كل دورة بشكل كبير وأكبر بكثير من الحجم السوقي للدورة التي سبقتها, حيث يمكننا أن نلاحظ أن ضغط الحكومات باتجاه التنظيم يزداد مع ازدياد الحجم السوقي لهذا القطاع. لكن يمكننا أن ننظر للأمور من ناحية إيجابية وهي أن التنظيم قد يجد حلاً لعمليات السرقة والنصب الكثيرة التي تحدث في هذا المجال. شخصياً, أعاني من نفس المشاكل التي تعاني منها مع حظر بعض البلدان لكنني أستخدم خدمة VPN في معظم الأحيان ولا تكون هناك مشاكل. من جهة أخرى, أعتقد أن التنظيم إن حدث سيستهدف المحفظات اللامركزية (حيث لمح الاتحاد الأوروبي لذلك منذ مدة) ومنصات التداول, في ذلك الحين لن يهم إن امتلكت بيتكوين أو عملة أخرى (محفظة Blockchain مثلاً تحظر العديد من الدول وهي من أوائل محفظات البيتكوين) وفي كل الأحوال سيبقى هناك وسائل للتحايل على ذلك والعودة لاستخدام تلك الخدمات.في مسألة اللامركزية يجب أن نفرق بين المحفظة وشبكة سلسلة الكتل, في البيتكوين مثلاً, يمكن للمحفظة التي تتيح لك التفاعل مع سلسلة كتل البيتكوين أن تحظر بعض الدول لكن لا يمكنها أن تحظر محفظتك من سلسلة الكتل, أي الحظر هنا على استخدام الخدمة وليس حظراً من الشبكة. في الإيثريوم من قام بجمع البيانات هي محفظة MetaMask ولا أعرف لو كنت تستخدم محفظة أخرى هل سيجمعون بياناتك أم لا, لكن هناك الكثير من الخدمات التي يمكنك من خلالها التفاعل مع سلسلة الكتل بدون أن يتم حظرك, ولا أعتقد أن ذلك سيحصل بالنسبة للإيثريوم.بحسب معلوماتي Solana أو Ripple يمكنها تجميد محفظتك لسبب ما, هذا ما يمكن أن نسميه شبكة مركزية أو شبكة متحكَّم بها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 28, 2022, 09:47:52 AM",
      "body": "Quote from: samcoin on December 27, 2022, 07:23:42 PMفي مسألة اللامركزية يجب أن نفرق بين المحفظة وشبكة سلسلة الكتل, في البيتكوين مثلاً, يمكن للمحفظة التي تتيح لك التفاعل مع سلسلة كتل البيتكوين أن تحظر بعض الدول لكن لا يمكنها أن تحظر محفظتك من سلسلة الكتل, أي الحظر هنا على استخدام الخدمة وليس حظراً من الشبكة. في الإيثريوم من قام بجمع البيانات هي محفظة MetaMask ولا أعرف لو كنت تستخدم محفظة أخرى هل سيجمعون بياناتك أم لا, لكن هناك الكثير من الخدمات التي يمكنك من خلالها التفاعل مع سلسلة الكتل بدون أن يتم حظرك, ولا أعتقد أن ذلك سيحصل بالنسبة للإيثريوم.بحسب معلوماتي Solana أو Ripple يمكنها تجميد محفظتك لسبب ما, هذا ما يمكن أن نسميه شبكة مركزية أو شبكة متحكَّم بها.نعم صحيح أخي، هذا مفهوم وشكرا لك للإشارة لهذه النقطة المهمة، نعم عندما تم حظري بواسطة MetaMask لم يتم حظر عملاتي أو حظري من الوصول إلى بلوكتشاين إيثريوم بل تم حظري من استخدام خدمات MetaMask فقط، يعني أنا كنت قادر للوصول إلى محفظتي عبر التطبيق لكن عند قيامي بأي عملية مثل بيع أو شراء أو حتى نقل كنت أحصل على رسالة الفشل أو الحظر. بما أنني أملك مفتاحي الخاص قمت بالوصول للمحفظة عن طريق تطبيق آخر وليس هناك أي مشكلة، لكن المشكلة كانت أن معظم المنصات اللامركزية وكثير من تطبيقات Web3 الأخرى التي كنت أقوم باستخدامها كانت تطلب الدخول عن طريق MetaMask وهنا كانت أكبر مشكلة، لذلك عانيت كثيرا حتى انتهت المشكلة وانتهى الحظر. الحقيقة أنه رغم كل السلبيات التي تحدثتُ عنها لكن تبقى تطبيقات Web3 أفضل بكثير من التطبيقات أو المنصات المركزية، التي تستطيع السيطرة على أصولك أوتجميدها بشكل كامل.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}