{
  "id": "topic_5447405",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "April 03, 2023, 02:17:57 PM",
  "content": "ОЧЕНЬ важный философский вопрос. Готовы ли вы выдержать пытки? Вытерпеть невообразимо-невозможное нечто кошмарное, просто ради вашей собственной (или несобственной) идеи? Вы готовы к этому? А вы знаете, как могут на ваш мозг воздействовать психоактивные химические соединения в концентрации, в 10 (или 50) раз превосходящей описанную в самых невинных невозможных научных статьях? Вы что, действительно верите, что реально сможете этому противостоять? Как? Зачем? А надо? А во имя чего?   Это все бред, бахвальство и ничтожество. Я вот никак не верю, что даже самый заскорузлый и подготовленный ко всем всевозможным испытаниям человеческий мозг, способен противостоять этим самым элементарным современным химическим методам воздействия. Поверьте мне, кандидату химических наук, НИЧТО в этом мире не сможет противостоять, например, если бы вам по вене дали бы 10-Х от максимально возможной описанной в науке концентрации, например, ЛСД. Внутривенно. Вы что, реально уверены, что сможете это выдержать? Да никогда! Да ни за что!   Вас просто размажет по реальности. Надолго. Обещаю. Знаю. После этого, прийдя в себя, вы, пуская слюни и обсираясь жидко в памперс, выложите господам чекистам все, что вы знаете или не знаете. Потому что ваш мозг – он ничто, против воздействия конкретных, специально подобрарнных лично для вас химикатов. Доказано наукой. И вам будет жопа. Конкретная и всеобъемлющая.   И когда к вам тут же придут, они, тут же, не фиксируя на видео, (просто потому что видеофиксация, она обычно тут же ломается) – они сделают с вами все, что они захотят сделать. Запросто и легко. И никогда вы это ни за что не докажите, что это было именно так.    Не надо печалиться, ведь вся жизнь впереди – всего лишь надейся, надейся и жди.    Когда к вам придут и применят. Реальность на вымысел. То, что они знают, как можно применить. Кто еще не успел свалить из России – тому соболезнования. Кто успел – тот молодец! Впереди – только жопа. Лучше не будет – будет только хуже. Как-то так, ИМХО!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447405",
  "comments": [
    {
      "author": "leonello",
      "created_time": "April 03, 2023, 03:09:29 PM",
      "body": "Quote from: bonfire66 on April 03, 2023, 02:17:57 PMОЧЕНЬ важный философский вопрос. Готовы ли вы выдержать пытки? Вытерпеть невообразимо-невозможное нечто кошмарноеболезнования. Кто успел – тот молодец! Впереди – только жопа. Лучше не будет – будет только хуже. Как-то так, ИМХО!Ты про ту галиматью что тут пишешь? Не знаю кто как но я пока держусь.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "April 03, 2023, 04:55:03 PM",
      "body": "А как вы думаете, почему люди сознаются в том, что они не совершали?Ведь до сих пор, почему-то, в юриспруденции России есть такой прикол - что \"если ты сознался - то ты виновен\". Помните историю с Тухачевским? Или с Жуковым? Они во всем признались. И были признаны виновными. А почему? А хрен знает. Признались - и все. Виновны!Можно человека накачать таким дерьмом, что он признается про все, что только можно. Но суд это примет ввиду. Потому что законы такие. Увы.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}