{
  "id": "topic_5438158",
  "title": "Helena Yu",
  "author": "Helena Yu",
  "created_time": "February 05, 2023, 11:21:43 AM",
  "content": "Every year Bitcoin adoption is always improving especially the price, market cap, trading volume, exchange and other things. Bitcoin is still grey area in majority of countries, now Bitcoin is already legal as a commodities, even though some countries still ban Bitcoin. But there's a big improvement between government and Bitcoin, it's where El Salvador and Central African Republic officially accept Bitcoin as a currency. El Salvador started to give $30 for every citizens by creating an account and complete KYC verification in Chivo wallet. AFAIK Nayib Bukele doesn't force their citizens to use Chivo wallet, on the other hands I don't see any activity from Central African Republic to create their own wallet or exchange. Many of Bitcoin enthusiasts are don't like with Chivo wallet due to closed source, custodial and ask KYC verification. It's a way for the El Salvador's government to have a control over their citizens funds, make sure they're not done money laundering or any illegal things, taxing their profit, etc. After all any government will try to tightening their laws which will reduce privacy of every citizen. Although it's not happen yet, but I've thinking the day when Bitcoin is accepted as legal tender in most of countries, a lot centralized exchanges building in each country just like stock exchange or securities, and it's already normal to hear someone own a Bitcoin.Imagine the future of centralized exchange would be:They will have a reserved funds and offer insurance funds maximum of (let's say $250,000 for each person). I know Binance have SAFU, but Binance isn't fully regulated, this one is differentThe company will have an auditor and they're transparent to release their financial report for every year.They can reverse your transaction, in case you've send Bitcoin to wrong address, network, hacked, etc.But, you need to give all of your information and you're need to agree if the centralized exchange will ask you more verification including a street selfie or anything else. If you not accept it, they've a right to confiscate or frozen your coins.However you still have a way to trade Bitcoin anonymously by using decentralized exchange/P2P with mixer, no KYC verification, enjoy 100% privacy, holding your coins on hardware wallet/cold storage. But it would be tricky if you want to cash out your coins, because you only have 2 ways:P2P with someone you trustedUsing gift cardBut, if you've make a mistake and your banks are successfully detect your funds came from suspicious activity, they will ask you for multiple questions and you need to make them satisfy or convince them. I don't think all privacy oriented people will able to escape from this, there's still a chance you will show your identity.So what's your choice? are you okay to give your KYC and trust to centralized exchange where they will offer insurance, protect from mistakenly transaction, transparent and you have a right to report to the court when the exchange done wrong. Or you will still become your own bank and privacy oriented, even it will make you harder to enjoy 100% anonymity from future no privacy world?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438158",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "February 05, 2023, 01:42:55 PM",
      "body": "<shrug> Why can't it be both?I can use Coinbase / Gemini and a host of others where I don't care if what I do is known about or anything else and I can use F2F or other forms of transactions where if I want to be a bit more private I can be.Wait, I do that now.If I am selling to pay bills / cover expenses then I can't just make money 'appear' [in theory I can but that is how you get tax audits and such] because if I put money into a fiat account and send to the car loan people there will be a trail.Going out to dinner with a friend and I send him BTC to cover my 1/2 would be no different then handing him some cash out of my wallet.I posted about it a while ago, that once you have any kind of anonymity lost it becomes harder and harder if not impossible to get it back.At this point it's not something I worry about. AND as more places start to take BTC, if we want to use it in a commercial environment you will become less and less anonymous anyway. i.e. there is a liquor store in NYC that takes crypto but since it's an age controlled thing they scan your drivers license to have proof of age. I'm am obviously WELL over the drinking age but when I bought there still got my drivers license scanned. If I used BTC instead of my AMEX would I be anonymous? If you are being legit, paying taxes and everything else there is no way to be anonymous.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "February 05, 2023, 02:48:12 PM",
      "body": "This is the present scenario in cryptocurrency exchanges and not the future. Centralized exchanges already can request any additional information and freeze your funds at their discretion and also keep certain amount of reserve funds in case of losses.Quote from: Helena Yu on February 05, 2023, 11:21:43 AMSo what's your choice? are you okay to give your KYC and trust to centralized exchange where they will offer insurance, protect from mistakenly transaction, transparent and you have a right to report to the court when the exchange done wrong. Or you will still become your own bank and privacy oriented, even it will make you harder to enjoy 100% anonymity from future no privacy world? I would rather be my own bank, cause that's the purpose of an alternate currency. It gives me control over my assets and I can transact without authorization from a 3rd party.Centralized exchanges also has lots of cons attached to it and you don't have protection from mistaken transactions or transparency. They also own your coins as you do not have the private keys.Quote from: BTCBroker2016 on February 05, 2023, 02:27:33 PMI do not realy understand why people are so crazy about this privacy. If you don't have anything super secret why to hide?• My data is valuable and is highly prone to being abused,• I do not want my data circulating on the dark web or being resold to other platforms,• I would want my Bitcoin transactions to be pseudo anonymous to prevent being tracked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "February 05, 2023, 03:14:01 PM",
      "body": "Quote from: Helena Yu on February 05, 2023, 11:21:43 AM-snip-So what's your choice? are you okay to give your KYC and trust to centralized exchange where they will offer insurance, protect from mistakenly transaction, transparent and you have a right to report to the court when the exchange done wrong. Or you will still become your own bank and privacy oriented, even it will make you harder to enjoy 100% anonymity from future no privacy world? I like both but I'm a bit picky on trust. At some point I still need centralized exchanges.To be honest I don't mind doing KYC, just don't trust much of any service that stores my identity. Data breaches have received a lot of special attention lately, as some people try to achieve as much privacy as they can everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "February 05, 2023, 03:22:34 PM",
      "body": "Quote from: Helena Yu on February 05, 2023, 11:21:43 AMImagine the future of centralized exchange would be:You are describing a bank. Don't forget that they can also seize your coins and censor you at any time. Many exchanges do this already.Quote from: Helena Yu on February 05, 2023, 11:21:43 AMBut it would be tricky if you want to cash out your coins, because you only have 2 ways:Or via any good DEX or P2P exchange. Or the best way - just spend it.Quote from: Helena Yu on February 05, 2023, 11:21:43 AMI don't think all privacy oriented people will able to escape from this, there's still a chance you will show your identity.There isn't, because I don't use any platform or service which ever requests KYC.Quote from: Helena Yu on February 05, 2023, 11:21:43 AMare you okay to give your KYC and trust to centralized exchange where they will offer insurance, protect from mistakenly transaction, transparent and you have a right to report to the court when the exchange done wrong.All the things you have listed are to protect you from the exchange itself. I only need insurance if the exchange are sloppy with their security. I only need to report to the courts if the exchange tried to scam me. All this is completely unnecessary if you keep your own coins in your own wallet.Quote from: Helena Yu on February 05, 2023, 11:21:43 AMOr you will still become your own bank and privacy oriented, even it will make you harder to enjoy 100% anonymity from future no privacy world?Being unable to achieve 100% anonymity does not mean you should therefore accept zero privacy.Quote from: BTCBroker2016 on February 05, 2023, 02:27:33 PMI do not realy understand why people are so crazy about this privacy. If you don't have anything super secret why to hide?Because I have nothing I want to share. If you aren't doing anything super secret, then I'm sure you'll have no problem sharing your real name, address, phone number, bank statements, all your bitcoin addresses, and the passwords to your email and social media accounts, just so we can all take a good look through your life and share anything interesting we find. After all, you aren't doing anything super secret, so you don't need privacy, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "February 05, 2023, 03:27:08 PM",
      "body": "Quote from: Helena Yu on February 05, 2023, 11:21:43 AMThey can reverse your transaction, in case you've send Bitcoin to wrong address, network, hacked, etc.Bitcoin transactions are irreversible. Centralized exchanges can't change the protocol. QuoteBut, you need to give all of your information and you're need to agree if the centralized exchange will ask you more verification including a street selfie or anything else. If you not accept it, they've a right to confiscate or frozen your coins.I'd never agree to that. You're waving your rights and opening yourself to abuse from the exchange.We don't like your selfie, it's too dark, the resolution is too low, wee need to see the name of the street behind you... Quotetransparent and you have a right to report to the court when the exchange done wrong. How did the courts help people who lost money in Cyprus bailouts? This gives people a false sense of security, that's all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "February 05, 2023, 03:27:34 PM",
      "body": "It is hard to remain anonymous when you want to exchange your BTC to fiat at some point. Even the P2P will require a bank transfer which in the trial they'll see BTC transactions on the platform. The government of Indonesia is already up to developing a crypto exchange, they'd be able to link your Binance wallet to the Indonesian exchange.  But I guess when BTC is adopted widely and people are using it even in the public market, we can already trade face-to-face and buy products using wallet apps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "February 05, 2023, 03:33:51 PMLast edit: February 05, 2023, 04:31:30 PM by mindrust",
      "body": "Quote from: BTCBroker2016 on February 05, 2023, 02:27:33 PMI do not realy understand why people are so crazy about this privacy. If you don't have anything super secret why to hide?That's a very wrong way to look at it. Privacy is a basic human right. You just can't say \"do you have something to hide? what are you afraid of?\" The reason could be anything. There shouldn't be a reason anyway but let's say he just don't want his friends to see his online activities and it is nobody's business. It seems to me you are perfectly OK with Schwab's 2030 agenda.You are both basically saying the same thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "February 05, 2023, 04:10:42 PMLast edit: February 05, 2023, 04:22:41 PM by salad daging",
      "body": "Quote from: Helena Yu on February 05, 2023, 11:21:43 AMSo what's your choice? are you okay to give your KYC and trust to centralized exchange where they will offer insurance, protect from mistakenly transaction, transparent and you have a right to report to the court when the exchange done wrong. Or you will still become your own bank and privacy oriented, even it will make you harder to enjoy 100% anonymity from future no privacy world? I have a Binance account that does KYC if we want to trade/withdraw there so I did this and I trust a secure centralized exchange that offers insurance, protects against transaction errors transparently as well as even local exchanges they have to require KYC with their rules for obey.I would be my own bank to keep my bitcoins in a Cold Wallet and this should be completely within my control but I would not enjoy 100% anonymity as I would still need a centralized exchange to trade my bitcoins to fiat to withdraw them anyway.Actually I want to do P2P with I trust but it's difficult now that most of them have trusted exchanges to do it compared to P2P.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "February 05, 2023, 04:28:11 PM",
      "body": "Quote from: BTCBroker2016 on February 05, 2023, 02:27:33 PMI do not realy understand why people are so crazy about this privacy. If you don't have anything super secret why to hide?\"Privacy is a right, self-disclosure is a choice.\"You should get your rights first, then make your choice. You use bitcoin (on-chain), you take your right to some of that privacy, and of course without bureaucratic restrictions. Then it's up to you to choose to remain private or reveal yourself through the CEXes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "February 05, 2023, 04:56:11 PM",
      "body": "Quote from: bittraffic on February 05, 2023, 03:27:34 PMIt is hard to remain anonymous when you want to exchange your BTC to fiat at some point. Even the P2P will require a bank transfer which in the trial they'll see BTC transactions on the platform. The government of Indonesia is already up to developing a crypto exchange, they'd be able to link your Binance wallet to the Indonesian exchange.  But I guess when BTC is adopted widely and people are using it even in the public market, we can already trade face-to-face and buy products using wallet apps. Yes, as long as fiat remains the main currency of the world, we will never be completely anonymous, we need to exchange bitcoins for fiat to use.I think that using bitcoin can only help us to minimize the disclosure of our privacy, but it cannot help us be completely anonymous to the outside world.  One more thing that makes me wonder is that we want bitcoin to be widely accepted and used as a means of payment, and also have privacy, I don't think this is going to happen. Once we use bitcoin to pay our daily bills, how can we continue to remain anonymous?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oneandpure",
      "created_time": "February 05, 2023, 05:19:08 PM",
      "body": "Decentralized with cryptocurrency right now is not happen in my country after government investigating due taxes, right now holding Bitcoin and altcoin assets in my local exchange market there are not any privacy about how much your assets holding. Just waiting with revenue officer coming to your house and filled form for taxes paying.Due all exchange have to submit with KYC procedure I don't sure about privacy and several decentralized exchange more priority with the government regulation then how important keep hidden or privacy with the user or costumer. Right now Kucoin still the best exchange because still not required with KYC and keep privacy about how much Bitcoin or altcoin assets we have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "February 05, 2023, 05:19:53 PM",
      "body": "Quote from: Helena Yu on February 05, 2023, 11:21:43 AMBut, you need to give all of your information and you're need to agree if the centralized exchange will ask you more verification including a street selfie or anything else. If you not accept it, they've a right to confiscate or frozen your coins.Then switch to a different exchange if you don't like to be bothered by these exchanges that are asking for KYC they're just following some protocol in order to stay in the market. There are DEX out there that you can use that won't ask KYC for you but expect that there's a huge difference of convenience compared to when you use a CEX.Quote from: Helena Yu on February 05, 2023, 11:21:43 AMSo what's your choice? are you okay to give your KYC and trust to centralized exchange where they will offer insurance, protect from mistakenly transaction, transparent and you have a right to report to the court when the exchange done wrong. Or you will still become your own bank and privacy oriented, even it will make you harder to enjoy 100% anonymity from future no privacy world? The government are pushing these regulation to every merchant that offer a trade of crypto to fiat.You have a choice to stay private on your own and the government/exchanges can't do anything about it but once you decide to use/trade fiat with your crypto then expect that there's always a KYC if you trade it on an exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "February 05, 2023, 05:47:51 PM",
      "body": "I think CEX is a requirement for exchanging your tokens no matter how much you advocate privacy and decentralisation if it comes to exchanging your coins to some other tokens or some other Cryptocurrency, CEX is obviously the best, cheapest and safest option as well to do it. I know it comes at the cost of KYC but I think I am ready to do that as long as this ensures exchange also is regulated. Especially after the case of FTX, exchange has to be squeaky clean in every aspect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "February 05, 2023, 07:10:37 PM",
      "body": "Quote from: Helena Yu on February 05, 2023, 11:21:43 AMSo what's your choice? are you okay to give your KYC and trust to centralized exchange where they will offer insurance, protect from mistakenly transaction, transparent and you have a right to report to the court when the exchange done wrong. Or you will still become your own bank and privacy oriented, even it will make you harder to enjoy 100% anonymity from future no privacy world? I would like to take advantage of both but I don't have a choice but to choose one in every situation.  I think I already did the first option of submitting a KYC to exchange to fully acquire to use all the features of centralized exchanges.  I have no choice but to do it because I am not comfortable with P2P.  I am ok with decentralized exchanges but since I am also invested in altcoins,  I prefer the convenience of centralized exchanges to the anonymity of decentralized exchange platforms.But obviously after all the trades and sells and buys, I always withdraw my funds out of centralized exchange and keep them on my wallet.I believe privacy is only a dream, we have been exposed the moment we were registered during our birth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "February 05, 2023, 09:17:33 PM",
      "body": "Quote from: mindrust on February 05, 2023, 03:33:51 PMIt seems to me you are perfectly OK with Schwab's 2030 agenda.Those people are crazy. I don't know if any of you guys saw some of the panels at the WEF, but they're all about \"we know what's good for you\" and \"this or that is dangerous for us. Us meaning the supporters and investors in the WEF, not us as the people of the world. They don't care what we think, they're only interested in their own agenda but are happy to hide that agenda behind all the eco babble. Their perfect world is you and me not having any assets under our control and being happy, eating the food they give us, watching the tv channels they want us to watch, working in their factories.Schwab said it himself, he's in the process of penetrating cabinets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "February 06, 2023, 04:19:17 AM",
      "body": "Quote from: Helena Yu on February 05, 2023, 11:21:43 AMSo what's your choice? are you okay to give your KYC and trust to centralized exchange where they will offer insurance, protect from mistakenly transaction, transparent and you have a right to report to the court when the exchange done wrong. Or you will still become your own bank and privacy oriented, even it will make you harder to enjoy 100% anonymity from future no privacy world? Everyone has their reason for using Bitcoin. Some people don't give a damn about their privacy because they are using bitcoin for other purposes. Some people use it for international trade because of unfavorable government policy, others use it to invade sanctions and some enjoy it because of its low transaction fee and reliable network. These assertions you made above would attract people that don't care about their privacy. This set of persons' greatest need is protection from fraud and the right to hold these centralized platforms accountable for any loss. So any government or CEX that offer them insurance and security has won their hearts to use KYC-powered exchanges without considering the effect.But some bitcoiners will never trade privacy for anything. To them, all the idealistic benefits of CEX you mentioned are Greek gifts. When anonymity and privacy are important to you, then you will always choose to own your bank regardless of the perceived consequences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "February 06, 2023, 05:30:38 AM",
      "body": "Anonymity and privacy are always a struggle. I cannot have the fullness of them. There are things in which I could stay private or even anonymous. There are things in which I don't have a choice but to reveal my identity and some other personal details which I otherwise would have preferred to keep private. But, again, there's always that struggle to be as private and anonymous as possible. I am my own bank, but at the same time I also have an account in a private bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "February 06, 2023, 05:48:16 AM",
      "body": "Quote from: Helena Yu on February 05, 2023, 11:21:43 AMSo what's your choice? are you okay to give your KYC and trust to centralized exchange where they will offer insurance, protect from mistakenly transaction, transparent and you have a right to report to the court when the exchange done wrong. Or you will still become your own bank and privacy oriented, even it will make you harder to enjoy 100% anonymity from future no privacy world? I wouldn't be comfortable doing it even though the centralized exchanges becomes the most trusted things in the world (which is impossible by the way). All what you stated will be passed into law by some law markers and they can also cancel or modify them in the future while you won't have a say/voice on them. I personally think there can't be any solution better than been incharge of your own security. Haven't we trusted centralized system for centuries now and yet the results has always been the same. They haven't been competent in safeguarding our privacy and nothing can change about that.Infact the centralized exchanges haven't successfully protected themselves so how then can they protect sensitive information that are been entrusted.into their hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "February 06, 2023, 06:56:29 AM",
      "body": "The both worlds of regulated crypto exchanges and crypto anonymity have their own pros and cons. I choose to use the both in order to maximize the pros and minimize the cons. Unfortunately we can't live in a financial world where KYC verification isn't required. Unfortunately, the crypto industry has to be regulated in order to achieve wider global adoption. Bitcoin shouldn't be used by criminals and money launderers. I know that KYC is far away from being perfect, but there's nothing better than KYC, when it comes to fighting financial crimes. The people, who want maximum anonymity and privacy have something to hide. If you have something to hide, sooner or later somebody is going to find your secret.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}