{
  "id": "topic_5475065",
  "title": "Alpha Marine",
  "author": "Alpha Marine",
  "created_time": "November 22, 2023, 02:18:18 PM",
  "content": "I don't know who needs to hear this but you need to get insurance if you have assets that are your source of income and it can be insurable. This may not mean much to a lot of folks in developed countries because they're familiar with it, but a lot (and I mean a lot) of people in underdeveloped countries don't care about insurance. I've read stories of people who were okay financially going broke because they have spent all they had to treat an illness for themselves, their children, or loved ones. I'm not saying insurance is our personal lord and savior, but it can help you in tight situations.Around November last year, I volunteered to join a local and small NGO that was taking food, drugs, and other supplies to flood victims.For context of how big the flood was, we used speedboats on roads and it was as though we were on a high sea.Experts gave lectures on how to prepare for a flood and not wait for it to be too late. Some of the people we met told their stories.We met one woman whose case I found very interesting. She had a farm; a fishery and a poultry farm. The poultry was much bigger than the fishery. The farm was so big and established it made her thousands of dollars monthly in gross income. The flood took her by surprise, she was able to rescue some feeds and animals, but she lost so much of it. Now let's ignore the fact that she was careless for not believing the warnings that a very big flood was coming because, in her words \"In my 56 years of being alive and my 17+ years of doing this business, I've never experienced the tiniest bit of flood\" Let's focus on the fact that neither her farm nor a single thing on the farm was insured despite generating that kind of income. Because of the damage we saw, the NGO started a campaign for the government to help these farmers with grants and loans so they can get back on their feet (but y'all know how politics gets). This allowed us to visit this woman at her farm. She's back on her feet, but it could take years to get back to what she was before the flood. If her farm was insured, it most likely wouldn't have taken her that long. There are many more people like this. A cab driver loses his care and he's back to square one because that's his source of income. Others get an illness that is expensive to treat and they go broke trying to pay for the treatment.A husband and father die unexpectedly and leave nothing behind, leaving the wife to struggle alone to take care of the children. This takes a family that was comfortably a middle-class family to a lower-class family. If you make money, get health insurance for you and your family, and insure your assets that are a source of income, businesses. Get a life insurance to secure your family's future.There's a saying \" hope for the best and plan for the worst\".",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475065",
  "comments": [
    {
      "author": "lizarder",
      "created_time": "November 22, 2023, 02:40:57 PM",
      "body": "Quote from: Alpha Marine on November 22, 2023, 02:18:18 PMI don't know who needs to hear this but you need to get insurance if you have assets that are your source of income and it can be insurable. This may not mean much to a lot of folks in developed countries because they're familiar with it, but a lot (and I mean a lot) of people in underdeveloped countries don't care about insurance. For some small people, entering insurance is not an option because when we choose insurance, a monthly fee is definitely required as a condition that we must fulfill. The question is why enter insurance if the monthly income for small people is unclear and it is difficult to even meet their food needs. Insurance is needed when you have a clear and regular source of income because it can help protect against unexpected things happening.Quote from: Alpha Marine on November 22, 2023, 02:18:18 PMI've read stories of people who were okay financially going broke because they have spent all they had to treat an illness for themselves, their children, or loved ones. I'm not saying insurance is our personal lord and savior, but it can help you in tight situations. There are various types of insurance nowadays and when people who have good financial capabilities do not take part in insurance, it is very unfortunate because when things happen as you explained, they will be at a great loss. I know several types of insurance that have existed in my country, one of which is?1. Life Insurance2. Health Insurance3. Education Insurance4. Investment Insurance5. Vehicle Insurance6. Accident InsuranceTo enter these six insurances, you have to pay a monthly fee as a mandatory requirement because this is what makes some people feel burdened Because not everyone has a fixed income and if they don't have an income then it is impossible to afford the monthly expenses. If people have a good source of income, then insurance is the right choice because it can protect health, education and damages costs when unexpected things happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "November 22, 2023, 02:49:37 PM",
      "body": "Varies. Could be yes, it could also not and wise saying and usually the items that many people take are vital, for example education, health and business and are all stated in the insurance policy if the user wants and agrees. Well, maybe this also sounds normal. In the case of applying for a loan, if you have met the loan requirements, the bank will also cut costs for insurance if at any time the borrower dies and the automatic payment of insurance is covered by no longer a member of the family, for example his wife.But apart from that, problems are often found in the application, apart from the first thing being high premium costs, then the mismatch in prices and protection values and unclear claims which confuse users and this often happens and the worst thing is that the company collapses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JMBitcointernational",
      "created_time": "November 22, 2023, 02:55:23 PMLast edit: November 22, 2023, 05:55:23 PM by JMBitcointernational",
      "body": "Quote from: Alpha Marine on November 22, 2023, 02:18:18 PMA cab driver loses his care and he's back to square one because that's his source of income. Others get an illness that is expensive to treat and they go broke trying to pay for the treatment.A husband and father die unexpectedly and leave nothing behind, leaving the wife to struggle alone to take care of the children. This takes a family that was comfortably a middle-class family to a lower-class family. If you make money, get health insurance for you and your family, and insure your assets that are a source of income, businesses. Get a life insurance to secure your family's future.There's a saying \" hope for the best and plan for the worst\".Most developed countries plan their future with insurance because it brings them to the initial position that they were before the loss but in developing countries the reverse becomes the case because they are afraid of losing their assets to the firm if they probably fail to meet up with the terms of the contract , maybe if they fail to pay premium before the expiration of the policy .Insurance is also one of the major players in financial sector because they not only secure but also offers loans to individuals which helps to facilitate in the economic growth .Let’s look at one of the case study you cited about a cab driver , if the man had taken a motor vehicle insurance against accident , theft or loss arising out of fire and still keeps to the terms and conditions of the policy and also Obeys all the exclusion clauses the firm will bring him back to normal position that he was before the loss after the loss adjusters have valued the current value of the car .In addition, some policy like educational policy , can also help the insured to study anywhere globally because most insurance firms take care of all the bills , same applies to health insurance /sickness insurance and also theft/burglary insurance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "November 22, 2023, 03:04:48 PM",
      "body": "If we are given the opportunity, then we should also make use of it to insure ourselves and the properties we have, the general approach many have towards this is that they believe that those that should to on insurance should be those that have alot of properties assets because they will have the required financial stand to pay in for the service and also benefited from using it, but if there are low level insurance for the average individuals, then we can also go in for them and have ourselves insured together with our belongings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "November 22, 2023, 03:14:53 PM",
      "body": "It depends on where you live, but yes, insurance is important because it is a protection against risk. If you live in a country where there is a lot of public aid and social coverage for certain things you won't need as much insurance, but at least for your car or your house it is advisable. If you have assets that are your source of income, it is also advisable, except if you have a very large patrimony in relation to those assets. In short, it is a whole world with a varied casuistry, but in general it is important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "November 22, 2023, 03:19:43 PM",
      "body": "Insurance is good and like you said it is more valued in developed countries. This is because it is well organized and insurance companies won't have to deny an insured or whatever was insured after you have been paying your premium.Like you said again, you mentioned politics. It is unfortunate that in most less developed countries, companies and government are not sincere to keep their own part of the bargain or contract and so that raises a lot of distrust. A reason that would have made the woman not to take the flood warning seriously. Although it is to her own detriment but to prove that your property was destroyed sometimes is like the cow passing through the eye of a niddle even in the midst of glaring and public evidences. Moreover, restitution and compensation takes ages. These and more would make an average person living in a corrupt country to rather put their fate to what they can do by themselves, more like every man to himself and God for us all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "November 22, 2023, 03:32:24 PM",
      "body": "Quote from: Alpha Marine on November 22, 2023, 02:18:18 PMIf you make money, get health insurance for you and your family, and insure your assets that are a source of income, businesses. Get a life insurance to secure your family's future.There's a saying \" hope for the best and plan for the worst\".Of course financially, insurance is important, in my country there are several government and private agencies that require every employee to have insurance, at least the insurance required includes: Health insurance Life insurance, these two are things that often happen and are experienced by many people in general, that is why the importance of Health and Life insurance is one of the requirements for employees who work in government and private agencies.Plus, insurance was mentioned by: @lizarder, maybe we all know how important insurance is, because we never expect disruption to the financial/economic stability of every human being, it could happen suddenly, like a house fire, car accidents, natural disasters and also the assets we own, so to overcome risks that can happen to us at any time, of course insurance is one of the companies that handles these risks, financially and as a priority, The point is that bad things can happen unexpectedly and unthinkably, of course I agree with what the OP said about the importance of insurance in our lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "November 22, 2023, 04:09:35 PM",
      "body": "I couldn't agree more.  As a financial advisor this is of course a topic that comes up a good bit in my practice.  I am starting to see a \"self-insure\", \"insurance is a waste of money\" type of movement.  Sort of like there is with college and people calling it a waste of time and money.Insurance is extremely important.  I've used my health and auto-insurance countless times.  Had I not had it, I'd have built up a great deal of debt.  Another example is having bought my mother LTC (long term care insurance) some years back.  I knew her future health wouldn't be the greatest and unfortunately she is not quite sick, and has been for several years.  Thank god for the LTC insurance as it's more than paid for itself.  It's all about the situation, the costs etc..but to flat out say insurance isn't necessary is to be ignorant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "November 22, 2023, 04:35:38 PM",
      "body": "Having insurance can only waste money in the long run, and our money will only be wasted paying for insurance every month.Because in fact when I take health insurance and I pay every month. When I fell ill and went straight to the hospital to be treated, it turned out that the treatment given to patients who used insurance was not optimal and excellent, it was different from when I paid directly to the hospital, the service was so fast and excellent, I didn't even have to queue too long to get it. can get care and treatment at the hospital.we can have insurance but not health. So the most important thing is, take care of your health and make as much money as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wajik-tempe",
      "created_time": "November 22, 2023, 04:46:46 PM",
      "body": "Quote from: Juse14 on November 22, 2023, 04:35:38 PMHaving insurance can only waste money in the long run, and our money will only be wasted paying for insurance every month.Because in fact when I take health insurance and I pay every month. When I fell ill and went straight to the hospital to be treated, it turned out that the treatment given to patients who used insurance was not optimal and excellent, it was different from when I paid directly to the hospital, the service was so fast and excellent, I didn't even have to queue too long to get it. can get care and treatment at the hospital.we can have insurance but not health. So the most important thing is, take care of your health and make as much money as possible.Many people have discovered insurance to be a critical safety net amid unexpected events. diversifying your coverage to include insuring income-generating assets and life can safeguard against various risks, ensuring a more comprehensive safety net for you and your loved ones in times of need. having insurance adds an additional layer of protection, offering peace of mind and financial security in the face of unforeseen challenges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "November 22, 2023, 05:00:23 PM",
      "body": "In developing countries, having insurance for the average folks is probably seen as a waste of money. But when disaster strikes, they’re left with little to nothing and are left to start afresh. And while their income level isn’t much as a whole lot don’t earn enough to cover their expenses, there isn’t much left to save not less paying into an insurance policy that would cover up any losses that may arise in the future. As a business owner, having an insurance to cover your business irrespective of your location is extremely important as it could be the backup plan you never thought to make that could end up saving your business. Same with health and life insurance. But I don’t think a lot of people in developing countries would be open to having insurance just yet having yet to understand what it fully entails and just how important it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "November 22, 2023, 05:05:42 PM",
      "body": "Quote from: Alpha Marine on November 22, 2023, 02:18:18 PM~snipIn a world in which various force majeure circumstances are possible, be it war or epidemic, natural disasters or economic crises, there is an urgent need for insurance. But not the one you're talking about. In fact, diversification is insurance. You talked about a woman's poultry business that she lost due to a flood. The first thing is that she relied only on this business. That is, she didn't have any reserves (a third-party additional business is immune to flooding), and also, apparently, didn't have any financial reserves, which is why she turned out to be practically destitute (if I understood correctly from the story above). Diversification of insurance reserves should be carried out in different locations (home, city, region, country and different financial institutions - bank, stock exchange, even though these are bad places to store your assets) and in different assets (business, money, securities , cryptocurrencies - optional).An insurance company is a commercial organization whose main goal is to extract money from you and give back as little as possible. I wouldn't rely on them 100%. I am sure that even with insurance, the victims of this flood would receive small amounts (compared to the money that would have been spent on monthly premiums from the insurance company for 5, 10 or more years). It is not every day that disasters such as floods occur in the same places. Or they would not have received anything at all as victims due to restrictions in the insurance conditions written in small print (the absence of this clause). Not a single insurance company as a commercial organization will work to its own detriment.The business of insurance companies is set up ingeniously: they collected 100% of the money and returned 10% to the insured. Essentially, this is money out of thin air that their clients pay. What's stopping you from becoming your own insurance company for free?The most correct decision (in the context of this forum) would be to prepare insurance reserves yourself in bitcoin. If part of the profit from the poultry farm were set aside monthly in a bitcoin, then, taking into account the rising price, this would form an impressive amount, which she so badly needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "November 22, 2023, 05:23:28 PM",
      "body": "There will be a lot of pro-bitcoin and anti-insurance comments in this thread, I will just state the obvious.Bitcoin will not save you during an acute illness. Just picture yourself half-paralyzed being rushed to the OR and your family has no idea of what bitcoin you own and where you own them, how to access them, unless you already taught them how to. Even then they have to convert it to fiat and then pay the hospital bill.On the contrary the Health insurance will solve this problem in a few seconds, however processed it might be. Hence I will always advice people to keep their health insured at least among other things. Bitcoin will not help here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 22, 2023, 06:05:30 PM",
      "body": "Quote from: Alpha Marine on November 22, 2023, 02:18:18 PMIf you make money, get health insurance for you and your family, and insure your assets that are a source of income, businesses. Get a life insurance to secure your family's future.There's a saying \" hope for the best and plan for the worst\".While I agree that someone who's working for the family and is the source of living should get insurance. It is because you don't know what's about to come and having it means that the word itself, you're going insurance to your family that if something happens to you unexpectedly, you have them insured with money that won't be a burden to them anymore when you're gone.I myself bought insurance last year and you can choose what type of plans you have. Life insurance, health insurance, asset insurance, anything as long as you can afford it. The type depends on your needs and what you think is the one that suits you. There are even insurances for the real estate when you're still paying the mortgage and if ever you're gone, that's going where the insurance will be used and your mortgage will serve as a paid asset already and your mortgage will be done in full by your insurance provider. That's how insurance works for those who don't understand it yet because they think that you're strong today and you don't need it and it's just another expenses. Actually, it's a way to protect your source of living and your family from unexpected situations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "November 22, 2023, 06:15:56 PM",
      "body": "Quote from: lizarder on November 22, 2023, 02:40:57 PMQuote from: Alpha Marine on November 22, 2023, 02:18:18 PMI don't know who needs to hear this but you need to get insurance if you have assets that are your source of income and it can be insurable. This may not mean much to a lot of folks in developed countries because they're familiar with it, but a lot (and I mean a lot) of people in underdeveloped countries don't care about insurance. For some small people, entering insurance is not an option because when we choose insurance, a monthly fee is definitely required as a condition that we must fulfill. The question is why enter insurance if the monthly income for small people is unclear and it is difficult to even meet their food needs. Insurance is needed when you have a clear and regular source of income because it can help protect against unexpected things happening.Quote from: Alpha Marine on November 22, 2023, 02:18:18 PMI've read stories of people who were okay financially going broke because they have spent all they had to treat an illness for themselves, their children, or loved ones. I'm not saying insurance is our personal lord and savior, but it can help you in tight situations. There are various types of insurance nowadays and when people who have good financial capabilities do not take part in insurance, it is very unfortunate because when things happen as you explained, they will be at a great loss. I know several types of insurance that have existed in my country, one of which is?1. Life Insurance2. Health Insurance3. Education Insurance4. Investment Insurance5. Vehicle Insurance6. Accident InsuranceTo enter these six insurances, you have to pay a monthly fee as a mandatory requirement because this is what makes some people feel burdened Because not everyone has a fixed income and if they don't have an income then it is impossible to afford the monthly expenses. If people have a good source of income, then insurance is the right choice because it can protect health, education and damages costs when unexpected things happen.You are right in pointing out that fees have to be regularly paid inorder to maintain a good insurance plan. Those with white collar jobs are easily opened to such schemes because most times these insurance companies propose or present offers that is better suited to those with a steady source of income. The best bet we have these days and see as insurance for the future is HODLing BTC or other forms of cryptocurrency to cover unexpected expenses that range from health hazards to emergencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "November 22, 2023, 06:35:25 PM",
      "body": "Quote from: Cryptomultiplier on November 22, 2023, 06:15:56 PMQuote from: lizarder on November 22, 2023, 02:40:57 PMQuote from: Alpha Marine on November 22, 2023, 02:18:18 PMI don't know who needs to hear this but you need to get insurance if you have assets that are your source of income and it can be insurable. This may not mean much to a lot of folks in developed countries because they're familiar with it, but a lot (and I mean a lot) of people in underdeveloped countries don't care about insurance. For some small people, entering insurance is not an option because when we choose insurance, a monthly fee is definitely required as a condition that we must fulfill. The question is why enter insurance if the monthly income for small people is unclear and it is difficult to even meet their food needs. Insurance is needed when you have a clear and regular source of income because it can help protect against unexpected things happening.Quote from: Alpha Marine on November 22, 2023, 02:18:18 PMI've read stories of people who were okay financially going broke because they have spent all they had to treat an illness for themselves, their children, or loved ones. I'm not saying insurance is our personal lord and savior, but it can help you in tight situations. There are various types of insurance nowadays and when people who have good financial capabilities do not take part in insurance, it is very unfortunate because when things happen as you explained, they will be at a great loss. I know several types of insurance that have existed in my country, one of which is?1. Life Insurance2. Health Insurance3. Education Insurance4. Investment Insurance5. Vehicle Insurance6. Accident InsuranceTo enter these six insurances, you have to pay a monthly fee as a mandatory requirement because this is what makes some people feel burdened Because not everyone has a fixed income and if they don't have an income then it is impossible to afford the monthly expenses. If people have a good source of income, then insurance is the right choice because it can protect health, education and damages costs when unexpected things happen.You are right in pointing out that fees have to be regularly paid inorder to maintain a good insurance plan. Those with white collar jobs are easily opened to such schemes because most times these insurance companies propose or present offers that is better suited to those with a steady source of income. The best bet we have these days and see as insurance for the future is HODLing BTC or other forms of cryptocurrency to cover unexpected expenses that range from health hazards to emergencies. Why would you say he is right? I disagree with him. In some countries Insurance is a necessity and as far as i know i am certain that no insurance is not worth it. Insurance is like a safety net that helps protect you from big, life-changing losses. However, there are things i feel like not necessary taking an insurance on if you get unlucky. Like your tv, refrigerator and some home appliances that one can do without you could put hose money into savings for better purpose and wait till sometimes you can get them back. The thing is money doesn't work the same way for everyone. Losing $1000 might not hurt too much for most people, but losing $100,000 could mean selling your house, selling your cars, quitting school, or getting another job. The effect on your life is way more than just 100 times the difference between the two amounts. This is the reason why insurance is important. Instead of you losing so much you could gradually settle those things with time even if you have to pay more to the insurance company for there services, its better than pulling such an amount at a time for life issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "November 22, 2023, 06:40:47 PM",
      "body": "There are different types of insurance and they work in different ways. However, insurances often work in times of danger. So insurance is very important for us. But there are many who don't like it.  But in reality insurance is very beneficial. Life Insurance. Health Insurance. Investment InsuranceI think the importance of these three is very high. These reduce our financial risk a lot. And bad times will support us a lot. So I think everyone should take the services of these insurances",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "November 22, 2023, 06:47:05 PM",
      "body": "This insurance is actually important and not important. And an wise person will definitely prepare everything, including his future and other things. And we will never know when we will get sick, nor when we will die.If we are not good enough at managing finances, then the presence of this insurance is a pretty good solution. because the presence of insurance will help us to prepare for everything, such as possible risks and also help us to prepare for our and our family's future. However, if you have good financial management, then I recommend not using insurance.And in closing, if you decide to use insurance, I just advise you to be careful in sorting and choosing the insurance company you want to use, because currently there are many irresponsible insurance companies, which do not provide the rights of the insured in the company. the insurance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "November 22, 2023, 07:19:55 PM",
      "body": "Quote from: Alpha Marine on November 22, 2023, 02:18:18 PMI don't know who needs to hear this but you need to get insurance if you have assets that are your source of income and it can be insurable. This may not mean much to a lot of folks in developed countries because they're familiar with it, but a lot (and I mean a lot) of people in underdeveloped countries don't care about insurance. I've read stories of people who were okay financially going broke because they have spent all they had to treat an illness for themselves, their children, or loved ones. I'm not saying insurance is our personal lord and savior, but it can help you in tight situations.Around November last year, I volunteered to join a local and small NGO that was taking food, drugs, and other supplies to flood victims.For context of how big the flood was, we used speedboats on roads and it was as though we were on a high sea.Experts gave lectures on how to prepare for a flood and not wait for it to be too late. Some of the people we met told their stories.We met one woman whose case I found very interesting. She had a farm; a fishery and a poultry farm. The poultry was much bigger than the fishery. The farm was so big and established it made her thousands of dollars monthly in gross income. The flood took her by surprise, she was able to rescue some feeds and animals, but she lost so much of it. Now let's ignore the fact that she was careless for not believing the warnings that a very big flood was coming because, in her words \"In my 56 years of being alive and my 17+ years of doing this business, I've never experienced the tiniest bit of flood\" Let's focus on the fact that neither her farm nor a single thing on the farm was insured despite generating that kind of income. Because of the damage we saw, the NGO started a campaign for the government to help these farmers with grants and loans so they can get back on their feet (but y'all know how politics gets). This allowed us to visit this woman at her farm. She's back on her feet, but it could take years to get back to what she was before the flood. If her farm was insured, it most likely wouldn't have taken her that long. There are many more people like this. A cab driver loses his care and he's back to square one because that's his source of income. Others get an illness that is expensive to treat and they go broke trying to pay for the treatment.A husband and father die unexpectedly and leave nothing behind, leaving the wife to struggle alone to take care of the children. This takes a family that was comfortably a middle-class family to a lower-class family. If you make money, get health insurance for you and your family, and insure your assets that are a source of income, businesses. Get a life insurance to secure your family's future.There's a saying \" hope for the best and plan for the worst\".In as much as it's of utmost importance we insure our investment or important properties, don't also forget that the lady has been in business for almost two decades, you wouldn't blame her for doubting that there will be flood, because she hasn't experienced it before.I believe for everything there is a first time experience, going forward she must have learned lesson. But most times insuring some of these business can be very expensive especially for starter business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}