{
  "id": "topic_5446728",
  "title": "crwth",
  "author": "crwth",
  "created_time": "March 29, 2023, 04:15:23 AM",
  "content": "Bitcoin falls after CFTC sues crypto exchange Binance for allegedly breaking trading rulesSource: https://www.cnbc.com/2023/03/27/bitcoin-drops-after-cftc-sues-crypto-exchange-binance-for-allegedly-breaking-trading-rules.htmlQuoteCryptocurrencies dropped on Monday morning after the CFTC sued Binance, the biggest crypto exchange in the world, for allegedly violating trading rules.With the recent happenings in the cryptocurrency markets, do you think something is cooking behind the scenes that could affect the crypto market? Especially BTC? There's already a bounce with the prices when posting this topic, but we could only know what could happen once it's published.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446728",
  "comments": [
    {
      "author": "LeGaulois",
      "created_time": "March 29, 2023, 12:29:30 PM",
      "body": "I rarely look at the price of Bitcoin, maybe every quarter or half year.This article is just trying to panic people into believing that the apocalypse is coming in a few days.So I looked at the stats to see what was going on. So yes, the value of Bitcoin has gone down. But only by $1K. So a ~4% drop. So dramatic.And besides, it only lasted five or six hours. And if you look today, the price is back to where it was and it's like nothing happened.The top 100 cryptocurrencies are in green, generally speakingBitcoin is increasingly resistant to this type of bad news, and is able to absorb it as if nothing had happenedDon't fall into the trap, whatever it is about cryptocurrencies, virus, politics, etc, the media always try to create the fear to whoever read itStatistics and facts matter, not the opinion of a journalist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "March 30, 2023, 07:48:37 AM",
      "body": "Quote from: LeGaulois on March 29, 2023, 12:29:30 PMThis article is just trying to panic people into believing that the apocalypse is coming in a few days.This is probably true. There are a lot of people who really see the news in their feeds every day and affects their emotional well-being with regard to BTC.Quote from: LeGaulois on March 29, 2023, 12:29:30 PMSo I looked at the stats to see what was going on. So yes, the value of Bitcoin has gone down. But only by $1K. So a ~4% drop. So dramatic.And besides, it only lasted five or six hours. And if you look today, the price is back to where it was and it's like nothing happened.The top 100 cryptocurrencies are in green, generally speakingWhat I'm thinking about when I read this topic is that it has something to do with the biggest exchange, Binance, and how it would really affect the image and would there be something behind the scenes that could have that FTX thing that it could collapse of some sort. I don't really know but it's definitely something to discuss.Quote from: LeGaulois on March 29, 2023, 12:29:30 PMStatistics and facts matter, not the opinion of a journalist.Agree with this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 30, 2023, 09:50:44 AM",
      "body": "Quote from: crwth on March 30, 2023, 07:48:37 AM~snip~What I'm thinking about when I read this topic is that it has something to do with the biggest exchange, Binance, and how it would really affect the image and would there be something behind the scenes that could have that FTX thing that it could collapse of some sort. I don't really know but it's definitely something to discuss.No one is too big to fail, and of all the globally positioned CEX, the one you mention is certainly the one that is most talked about in a negative context. Some would say that it is only because the competition is trying to steal a part of their users, and some others would say that you cannot hide in the gray zone forever and that sooner or later you will become a target. Generally speaking, such companies have turned into a ticking bomb and threatens to cause enormous damage if (and when) it explodes. The advice that is constantly repeated is even more relevant today, which is to not use any CEX as a wallet for storage, but only for trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "March 31, 2023, 09:28:56 AM",
      "body": "Quote from: Lucius on March 30, 2023, 09:50:44 AMNo one is too big to fail, and of all the globally positioned CEX, the one you mention is certainly the one that is most talked about in a negative context. Some would say that it is only because the competition is trying to steal a part of their users, and some others would say that you cannot hide in the gray zone forever and that sooner or later you will become a target.  They have been a target for quite some time now, and it will always be a target. Still best to have that safety precaution in place and not put everything in one basket.Quote from: Lucius on March 30, 2023, 09:50:44 AMGenerally speaking, such companies have turned into a ticking bomb and threatens to cause enormous damage if (and when) it explodes. The advice that is constantly repeated is even more relevant today, which is to not use any CEX as a wallet for storage, but only for trading.It is going to cause damage when it explodes. This is where DEX would come in and make trading safe. Because you have to admit that you would want to put more on your portfolio if you want to profit more, and sometimes that's a lot, and you cannot do anything about it if the one who crumbles the CEX you are trying to use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}