{
  "id": "topic_5450294",
  "title": "JamesBorn",
  "author": "JamesBorn",
  "created_time": "April 26, 2023, 06:48:03 PMLast edit: April 26, 2023, 07:01:53 PM by JamesBorn",
  "content": "Investment in bitcoin can makes you developed reasoning on how to expand your income, most people who do holdings for a long period of time makes enough money at every running of bulls price and they begins to diversified their investment into different places. Some expands to mining, trading and physical business but when you eat you investment at every little price increase or drops you tends to remained statics, holding is a good option no matter the current price. Some people who became big bitcoin investors became it as a result of holdings.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450294",
  "comments": [
    {
      "author": "2double0",
      "created_time": "April 26, 2023, 06:57:47 PM",
      "body": "Bitcoin does not make any money, it gets 'generated or produced' through the mining process, and that process has nothing to do with making money or giving value to btc. Trading btc was being done because we needed an asset in which we could transact our fiat without the need of a third party, which is called Peer 2 Peer. So, it has given us the way to transact our money removing all the borders and allowing us to be our own bank, but btc does not make any money through mining process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "April 26, 2023, 07:04:30 PM",
      "body": "What's the point of this thread? Title is totally different from the entire content. If you were to be wearing signature like I do I could have assumed you are just creating topics just to fill up your weekly signature post. If I'm to ask what's  exact information are you trying to pass to us. Most people already know how Bitcoin transaction works, miners down to the confirmation of blocks etc. Edit: OP edited entire thread why I was typing my reply...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesBorn",
      "created_time": "April 26, 2023, 08:19:55 PM",
      "body": "Quote from: Ever-young on April 26, 2023, 07:04:30 PMWhat's the point of this thread? Title is totally different from the entire content. If you were to be wearing signature like I do I could have assumed you are just creating topics just to fill up your weekly signature post. If I'm to ask what's  exact information are you trying to pass to us. Most people already know how Bitcoin transaction works, miners down to the confirmation of blocks etc. Edit: OP edited entire thread why I was typing my reply...Yes, is entirely different because the content of what I wanted to post was a mistake taken from my noted pad, I wanted to post why people are not making money this season before I could realizes I have hit the button but since I cannot delete post, I chose to edit to this post. Apology please.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "April 26, 2023, 08:24:51 PM",
      "body": "There are always 2 types of people in this world:1. Investors2. GamblersIf you are an investor, you will simply buy some % of Bitcoin every month out of your incomeIf you are a gambler, you will prefer the all-in YOLO strategy.QuoteSome people who became big bitcoin investors became it as a result of holdings.No math is required to DCA Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "April 26, 2023, 08:26:45 PM",
      "body": "Is it your belief that profiting from Bitcoin is a straightforward task? Bitcoin investment is a common topic of discussion, including for myself. However, in reality, we are purchasing a highly unstable currency that can experience both significant drops and increases in value. Thus, in the event of a price drop, one may suffer substantial losses. It is essential to recognize both the positives and negatives of Bitcoin investing. Failing to do so could lead to financial ruin. To generate profits from Bitcoin's volatility, you must master risk management.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "April 26, 2023, 08:31:00 PM",
      "body": "You need to do trade as the part time as compared to full time.If you trade as part time,you can easily get money to inverse and to re inverse with certain period of time.Some will have the savings habit for their own house from the beginning.You can inverse such money to multiple in the cryptocurrency.Some mid earning people doesn’t have money to save,because they use all his money for their food and their family members food.So you need to join the big job which satisfy your need and your family needs.Multiple your earning by doing different job as compared to the single job.Because one income use for the food and other money to inverse in the cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahanton",
      "created_time": "April 26, 2023, 09:05:38 PM",
      "body": "Quote from: JamesBorn on April 26, 2023, 06:48:03 PMInvestment in bitcoin can makes you developed reasoning on how to expand your income, most people who do holdings for a long period of time makes enough money at every running of bulls price and they begins to diversified their investment into different places. Some expands to mining, trading and physical business but when you eat you investment at every little price increase or drops you tends to remained statics, holding is a good option no matter the current price. Some people who became big bitcoin investors became it as a result of holdings.Depends on how much you do hold but if you do pertain or trying out to compare into those Bitcoin OG's then the earning or possible profit you could really make isnt something that big compared into those holders.There's no doubt that holding for a long time does really give out that kind of chance or benefit specially if you are holding Bitcoin or even into those top altcoins that we do have in the market. We know thatthis market does have its own cycle and if you have placed yourself on the right time or simply in the bottom then you could definitely really be having the chance on making profitsbut of course profit size will be basing on how much you've been holding which is understandable.Quote from: Ever-young on April 26, 2023, 07:04:30 PMWhat's the point of this thread? Title is totally different from the entire content. If you were to be wearing signature like I do I could have assumed you are just creating topics just to fill up your weekly signature post. If I'm to ask what's  exact information are you trying to pass to us. Most people already know how Bitcoin transaction works, miners down to the confirmation of blocks etc. Edit: OP edited entire thread why I was typing my reply...You know that there are people who do make out some initial post but actually make out some edit later on.This is why it isnt really that just right on telling on whats the purpose of the said thread.Its clearly not a shit one and it is really something that suits out into this board. It might sound basic and typical but it do really counts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "April 26, 2023, 09:06:50 PM",
      "body": "Quote from: The Cryptovator on April 26, 2023, 08:26:45 PMIs it your belief that profiting from Bitcoin is a straightforward task? Bitcoin investment is a common topic of discussion, including for myself. However, in reality, we are purchasing a highly unstable currency that can experience both significant drops and increases in value. Thus, in the event of a price drop, one may suffer substantial losses. It is essential to recognize both the positives and negatives of Bitcoin investing. Failing to do so could lead to financial ruin. To generate profits from Bitcoin's volatility, you must master risk management.It's not easy to get profit from bitcoin because it takes a long time to produce more, especially for us as investors, we have to be ready to buy more bitcoin in a downturn, we really have to understand that from the positive and negative levels because in the second bitcoin is almost the balance that often occurs from an increase will be positive and a decrease will certainly be bad news which spreads a lot of FUD.We must be mentally prepared when entering into bitcoin investors with risk management is very important and it must be managed properly so as not to cause destruction due to selling at low prices.With a strong hand and not being swayed by other news, we can definitely hold bitcoin longer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blckhawk",
      "created_time": "April 26, 2023, 09:12:06 PM",
      "body": "Nah, it's just that most of us got introduced to bitcoin first that we associate bitcoin as a gateway to investing when in reality it could be anything that involves finances. All in all, it's still a good thing though, when you are investing on something then you're one step closer to financial stability than most people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "April 26, 2023, 09:20:04 PM",
      "body": "Bitcoin investment is profitable if you hold it for a long time. Investing in bitcoin can secure your future, so you can't really make regular profit from bitcoin investments. So you need other sources of income to generate regular income or bitcoin. There are so many opportunities where you can make bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "April 26, 2023, 09:51:03 PM",
      "body": "Quote from: JamesBorn on April 26, 2023, 06:48:03 PMSome people who became big bitcoin investors became it as a result of holdings.Not just some but many of the bitcoin people in here have became big with their investment because of just holding. This is why don't underestimate the power of holding.Many of those traders think that holding is nothing but this is one of the best ways to accumulate wealth through bitcoin and it's lesser in effort and you'll be making a lot from it when the bull run arrives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Supreemo",
      "created_time": "April 27, 2023, 01:10:37 AM",
      "body": "Quote from: Mahirap on April 26, 2023, 09:20:04 PMBitcoin investment is profitable if you hold it for a long time. Investing in bitcoin can secure your future, so you can't really make regular profit from bitcoin investments. So you need other sources of income to generate regular income or bitcoin. There are so many opportunities where you can make bitcoin.in investing you need to have enough knowledge, experience and courage first because you put your money to it since it's risky it can be profitable or a loss for you and for those who think for long term investment bitcoin is the most valuable asset that you can lean on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "April 27, 2023, 01:20:00 AM",
      "body": "Quote from: JamesBorn on April 26, 2023, 06:48:03 PMInvestment in bitcoin can makes you developed reasoning on how to expand your income, most people who do holdings for a long period of time makes enough money at every running of bulls price and they begins to diversified their investment into different places.(....)But you must consider the risk of investing in Bitcoin. Because investing in Bitcoin is just like investing in any asset risk always exists. For me, we must not assume always that it will always \"expand your income\" because it's not always 100% guaranteed as no one knows what will be the future of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "April 27, 2023, 05:52:12 AM",
      "body": "Quote from: JamesBorn on April 26, 2023, 06:48:03 PMInvestment in bitcoin can makes you developed reasoning on how to expand your income, most people who do holdings for a long period of time makes enough money at every running of bulls price and they begins to diversified their investment into different places. Some expands to mining, trading and physical business but when you eat you investment at every little price increase or drops you tends to remained statics, holding is a good option no matter the current price. Some people who became big bitcoin investors became it as a result of holdings.Holding on to Bitcoin is always a good decision. But not everyone has the mindset or patience needed to hold. And those with limited invested funds cannot hold any coin for a long period of time even if they wanted to. Because they have to spend that money for daily needs. Those who hold their investments for a long period of time earn higher returns on their investments.  Long-term holders don't do the things we normal investors do.  Like we have made a profit of $100 by investing in bitcoins then a thought will work in our mind that we should sell our investments now but those who hold for long term should not focus on this small profit. Because they have a specific target. And they have maximum patience to reach that target.  That's why holding long is always positive for investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reizella28",
      "created_time": "April 27, 2023, 06:02:11 AM",
      "body": "You need to widen your knowledge when it comes to crypto or blockchain technology if you're gonna invest or trade. And we all know that people could win big time here that's why a lot of people are willingly to understand how it works. But it's not simply as investing or holding, that's why \"risk\" is the one we could describe in this industry. Those numbers could pump and dump that could affect the value of your funds. Holding for a long time is actually good but if people needed some funds right away then it would be impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obito",
      "created_time": "April 27, 2023, 06:27:09 AM",
      "body": "Quote from: Mahirap on April 26, 2023, 09:20:04 PMBitcoin investment is profitable if you hold it for a long time. Investing in bitcoin can secure your future, so you can't really make regular profit from bitcoin investments. So you need other sources of income to generate regular income or bitcoin. There are so many opportunities where you can make bitcoin.Technically, it's true but if you're relying on it alone by hodling on it then it's not profitable per se because you're not creating a constant profit although you are expecting a profit nonetheless. Totally that you need another source of income, with the current world economy, it's really in anyone's best interest that they have a multiple streams of income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "April 27, 2023, 06:28:05 AM",
      "body": "Expand the income or buy to have the \"possible increase\" in value in assets? It allows you to add the possibility of earning more instead of just holding fiat. You are probably talking about those early investors and believers of Bitcoin that became Big because of holding Bitcoin in the first place. I think it has more potential than we have now; we have to wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Popkon6",
      "created_time": "April 27, 2023, 07:40:50 AM",
      "body": "Investments are of the highest level of risk and action must be taken with due consideration. To earn bitcoins you must receive large amounts of bitcoins and hold them for long periods of time. Buy Bitcoin when the price is low and sell it when the price goes up, thus earning some of your short-term hold. And long term income can be earned by holding but it should be kept at a very safe all rate. Bitcoin never relies on a third party Bitcoin is accepted through P2P as a single transaction with no third party dependency. Currently bitcoin price is increasing periodically so now both long term hold and trading are applicable for bitcoin so it is better to choose either way for income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "April 27, 2023, 09:06:08 AM",
      "body": "Quote from: JamesBorn on April 26, 2023, 06:48:03 PMInvestment in bitcoin can makes you developed reasoning on how to expand your income, most people who do holdings for a long period of time makes enough money at every running of bulls price and they begins to diversified their investment into different places. Some expands to mining, trading and physical business but when you eat you investment at every little price increase or drops you tends to remained statics, holding is a good option no matter the current price. Some people who became big Bitcoin investors became it as a result of holdings.You are right but holding is not something that everyone can successfully do, to hold your Bitcoin peacefully you need to make enough money monthly, you will have other expenses in your life and if you are not making enough money, your holding won't last lost before you start spending it.Before jumping into Bitcoin long term hold, make sure you are making enough money and you always have left over money that are laying around, this type of money is the best for investment, nothing will be able to control you, and we know how volatile crypto market is, if the money invested was meant for something else, your mind won't ease and you will panic. Do some calculations, how much are you making every month, how much are you spending on yourself, this should always be the first thing to do before thinking about any investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}