{
  "id": "topic_5465829",
  "title": "Makus",
  "author": "Makus",
  "created_time": "September 06, 2023, 08:00:50 AM",
  "content": "Hello guys with several wallets out there, I want to be sure make the right choice, because I have seen posts were members of this forum are complaining about some wallets and exchanges because of their unprofessional behavior.So my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. With the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465829",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "September 06, 2023, 08:05:25 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMHello guys with several wallets out there, I want to be sure make the right choice, because I have seen posts were members of this forum are complaining about some wallets and exchanges because of their unprofessional behavior.So my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. With the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.Open-source hardware wallets are what you should consider using (Passport, Trezor).As for your question about buying the dip, no one can really help you make that decision. It's completely up to you. You should understand the price is very volatile, and any news (for example ETFs being rejected/approved) could trigger a big move in price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 06, 2023, 08:05:42 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMHello guys with several wallets out there, I want to be sure make the right choice, because I have seen posts were members of this forum are complaining about some wallets and exchanges because of their unprofessional behavior.So my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. Definitely a hardware wallet is the best option for a long time hold. Read about other bitcoin wallets -which, what and why Quote from: Makus on September 06, 2023, 08:00:50 AMWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.I would say you should go ahead to buy right now if you have the funds at hand. The best strategy will be to do DCA with the way the price is going up and down. Waiting for the right time to buy is something I wouldn’t advice because we never might know maybe this is the lowest we will see bitcoin or it will go down again. But to cast doubts out it is better to invest when you have the money",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 06, 2023, 08:12:48 AM",
      "body": "You may also consider going for a cold storage option on an airgapped device, like Electrum cold storage: https://electrum.readthedocs.io/en/latest/coldstorage.htmlOr just buy a hardware wallet like Passport (bitcoin-only) or Trezor (multicoins)If you want to buy bitcoin and hold in long term, it is good to buy now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "September 06, 2023, 08:14:03 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMSo my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. Electrum is a hot wallet, so if you are using electrum default hot wallet, then it isn't safe for long term holding. The safest wallet for hodling Bitcoin for the long term is wallets that are offline, wallets like hardware wallets or air-gapped wallets (of which you can create with electrum).Quote from: Makus on September 06, 2023, 08:00:50 AMWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.DYOR. I think we are already in the dip and Bitcoin might not fall much lower than it is right now before the next bull run begins, so now seems a good time to buy Bitcoin for a cheaper price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kodec5",
      "created_time": "September 06, 2023, 08:17:31 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.At this particular point In Bitcoin , I believe we are currently in the dip and this should be one of the perfect time to accumulate Bitcoin.And I am sure you don't want to miss such an opportunity before it reaches ATH",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "September 06, 2023, 08:18:46 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMSo my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. Beside Electrum wallet, you can use Bitcoin Core, full node if you want best privacy with Tor connection, or prune node if you are not serious about privacy.Hardware wallets if you can buy them.[LIST] Open Source Hardware WalletsQuoteWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Best time to buy Bitcoin is when you stop thinking, hesitation and start to buy it with your spare money without pressure to borrow money for investment.Because you can not timing the market, can not find bottom, stop worrying about best time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "September 06, 2023, 08:19:51 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMHello guys with several wallets out there, I want to be sure make the right choice, because I have seen posts were members of this forum are complaining about some wallets and exchanges because of their unprofessional behavior.You are probably referring to Ledger and they are right, that hardware wallet should be avoided.Quote from: Makus on September 06, 2023, 08:00:50 AMWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.No one can tell when its the right time to buy bitcoin, but for me personally best time is always now. If you are usnure or think that bitcoin price might go down, you should consider dollar cost average (DCA) investment method where you don't spend all your money on bitcoin at once and instead you are buying at regular intervals no matter the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 06, 2023, 08:20:41 AM",
      "body": "Quote from: Coyster on September 06, 2023, 08:14:03 AMI think we are already in the dip and Bitcoin might not fall much lower than it is right now before the next bull run begins, so now seems a good time to buy Bitcoin for a cheaper price.Nobody knows if bitcoin price will still dip further, it might. But the reason to buy now is because any further downtrend would only be an unrealized loss if the buyer do not sell, and the price will later increase and reach all-time-high. That is the reason it is wise to buy bitcoin now. Some people can even go for the DCA option. So if anyone buys bitcoin now and the price started to fall, the person should not panic but wait and the price will increase back and later all-time-high will become a reality again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "September 06, 2023, 08:28:39 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMHello guys with several wallets out there, I want to be sure make the right choice, because I have seen posts were members of this forum are complaining about some wallets and exchanges because of their unprofessional behavior.So my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. With the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.The best one is the hardware wallet Trezor wallet. although there are lots of wallet that can be use, like electrum, but to be safe you have to remember to keep the seed phrase, keep it safe, from natural disasters and thief, since if it got to the wrong hands for sure, the money inside will be gone, also securing your computer of course from hackers.Bitcoin price from high above 60 Thousand dollars, i thinks its okay to buy now, if you have funds, its up to you if you have prepare for this dip, and have lots of room to accommodate and bag some bitcoin, since we are not sure when will it rally, if two people are debating and you don't know what to do, do some research, since your source at the moment have different ideas, so that your research will be the tie-breaker, but we are not really sure so better be prepare for the result good luck hope this helps you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 06, 2023, 08:33:44 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMHello guys with several wallets out there, I want to be sure make the right choice, because I have seen posts were members of this forum are complaining about some wallets and exchanges because of their unprofessional behavior.So my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. A hardware wallet is the safest one. Quote from: Makus on September 06, 2023, 08:00:50 AMWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.If you want to wait for the dip then you will never buy Bitcoin. There is no bottom so no matter how dip the price of bitcoin goes some people will never be satisfied and will tell you the price will drop more. If you think the price will go down then buy in parts. If the price further crashes you will DCA to lower your average. This is the safest and most proven method I know of investing in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "September 06, 2023, 08:33:49 AM",
      "body": "You may be asking yourself what price you would be interested in buying at. But you must understand that the longer you wait for a profitable offer, the more time you lose if you prefer to invest using the DCA method. Check the history to make sure that even if you make a mistake with the price now, bitcoin will still grow over time. Therefore, if you have an amount that you do not need for some period of time, feel free to buy, but do not give up on any price fluctuation. We say investing is risky; however, with the correct calculation of your funds, you can always return them, even with some pluses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "September 06, 2023, 08:46:48 AM",
      "body": "Choosing a safe wallet for long-term Bitcoin holding is crucial. Anyway, the safest wallet for long-term holding of Bitcoin is a hardware wallet like Ledger Nano S, Trezor Model One and Coldcard. And some other highly reputable wallets for long-term storage such as Paper Wallets, Cold Storage Wallets and Multisignature Wallets. And aside from electrum software wallet, there is also Mycelium and Green Wallet.Best time to buy Bitcoin? Well, it's challenging to predict price movements accurately.For a long-term investment, I would prefer dollar-cost averaging (DCA). A strategy that involves buying a fixed amount of Bitcoin at regular intervals regardless of price fluctuations. I avoid trying to time the market and benefit from both highs and lows over time. I think the current price may be a good entry point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 06, 2023, 08:53:52 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMSo my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. It may worth mentioning that electrum can give you complete security, only if you run it on an airgepped device.If you run electrum on an online device, there's always the chance of getting hacked.If you want to be completely secure and you can't have an airgapped device for any reason, you should go for a good hardware wallet. Quote from: BlackBoss_ on September 06, 2023, 08:18:46 AMBeside Electrum wallet, you can use Bitcoin Core, full node if you want best privacy with Tor connection, or prune node if you are not serious about privacy.Whether you a run a prune node or you keep the entire blockchain, it has nothing to do with level of privacy. Even if you run a prune node, you can still broadcast your transactions by yourself without relying on any third party.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 06, 2023, 10:27:56 AM",
      "body": "Quote from: DVlog on September 06, 2023, 08:33:44 AM~snip~A hardware wallet is the safest one. When you express yourself in this way, then I can say that it is definitely not good advice, because it turns out that every hardware wallet is equally secure, which is simply not true. We are witnessing that what we considered safe yesterday becomes unsafe overnight, so we need to choose carefully which HW we will choose.I, for one, cannot say that a good HW is one that has the possibility to share the user's seed with third parties, but I cannot say that a good HW is one that has an irreparable vulnerability that, if not properly patched by the user, allows possible attackers to extract the seed for less than 5 minutes in case he gets physical access to the device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "September 06, 2023, 10:33:38 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMSo my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. Any non-custodial, open-sourced wallet is good for storing bitcoins whether it is long-term or short-term.For PC: Sparrow wallet (Mac/windows/linux)Download: https://sparrowwallet.com/download/Github: https://github.com/sparrowwallet/sparrowFor Android and IOS: Blue wallet Download: https://bluewallet.io/Github: https://github.com/bluewallet/bluewalletIf you are looking better wallet for multiple crypto storage then Unstoppable wallet is good choiceURL: https://unstoppable.money/Github: https://github.com/horizontalsystemsQuote from: Makus on September 06, 2023, 08:00:50 AMWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.No one can predict the future but my opinion just buy now since you mentioned long-term holding small dumps further doesn't matter if you look at the expected price at the next bull run which maybe over 100K or even 150K.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "September 06, 2023, 10:42:10 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMSo my question is, apart from electrum wallet which other wallet is the safest for long term holding of bitcoin?. Hardware wallet preferable like Trezor. You can also use cold storage wallet on an airgap device.Quote from: Makus on September 06, 2023, 08:00:50 AMWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.Nobody knows how dip the price of bitcoin will be but I believe that bitcoin price has a good discount now and you shouldn't miss this opportunity of buying because who knows if the price will pump from here. Don't wait and feel that we will see a lower price from this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "September 06, 2023, 10:53:24 AM",
      "body": "Electrum wallet is still good for new crypto investors if they can't afford an open-source hardware wallet like Trezor but a hardware wallet is still better and more secured than every other wallets available, I have an Electrum wallet that I still use since 2016 and till today I still use it to move my Bitcoin around.I will like to warn you though, do not keep a lot of money on any wallet apart from hardware wallets, if you can afford to invest a thousand dollars on Bitcoin you can afford a hardware wallet easily. Keep this in mind and make sure it's part of your plan in the neartes future, as many people somehow feel relaxed after using mobile wallets for a while, thinking nothing can go wrong with the wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "September 06, 2023, 11:46:32 AM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AM~~~~You have already received good answer in this regard, you should also consider the price of the hardware wallet I.e if you’re going for one and also the amount that you want to invest in your bitcoin, and if you won’t be able to afford a hardware wallet then you should look for a way to create an airgapped wallet it will give you the same security as a hardware wallet.QuoteWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.To be on a safer side, I’d advise that you practice DCA because right now you really can’t tell if the price will continue to deep or rise so just make plans to be purchasing a fixed amount of coins every week or twice in a month that way you’ll be able to purchase your coins at different rates and when averaged it will give you a nice amount. It requires dedication and discipline to achieve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "September 06, 2023, 12:42:24 PM",
      "body": "Quote from: Makus on September 06, 2023, 08:00:50 AMWith the current reduction of price in Bitcoin, is it the best time to buy bitcoin or should I still wait for the dip?.Though I have seen some post talking about \"buy now or wait for the dip\" but the debating answers got me confused, so I need the final clarity from you guys.If the previous debating answers got you confused what's the chance that the ones you'll get now wouldn't maintain the confusion more deeper. No one should tell you why to do, the market is open for everyone to study and make their decision, even those of us giving you answers aren't sure of the next action of the bitcoin price wether more dip or bull. Take decision for yourself so you can be responsible for yourself in whatever later happens to the bitcoin price. Do your study!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}