{
  "id": "topic_5473893",
  "title": "WhyFhy",
  "author": "WhyFhy",
  "created_time": "November 13, 2023, 10:48:50 AM",
  "content": "Hello Bitcointalk Community,I'm excited to announce that I'm currently open for work and offering a variety of services tailored to the crypto and tech sphere. My services encompass a wide range of skills, ensuring that your diverse needs are met with expertise and efficiency. Here's what I can offer:Signature Campaign Management: Expertise in running and managing effective signature campaigns that resonate with the target audience.Web Design: Crafting visually appealing and user-friendly websites, tailored to your specific requirements.Pool Design & Deployment: Setting up and managing mining pools with a focus on stability and high performance.Bruteforcing Services: Offering advanced bruteforcing capabilities for various security and data analysis needs.AI Services:Prompt Engineering & Visuals: Creating and optimizing prompts for AI applications, along with generating compelling visual content.Bot Creation: Developing intelligent bots for a variety of applications, including automation and interaction tasks.Compute/Training Services for AI: Providing substantial computing power for AI training and other intensive tasks.I'm not just limited to these services. I'm open-minded and adaptable, ready to explore and take on work that may not be listed here. Whether it's a unique project or a challenging task, I'm here to provide solutions.Feel free to reach out to me with your project details, and let's make something happen.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473893",
  "comments": [
    {
      "author": "CryptSafe",
      "created_time": "November 20, 2023, 12:09:13 PM",
      "body": "Good one mate. It is nice seeing your post but I understand that you are growing and I must commend you for your bold step in putting up with this post. You have a good skills at hand to patronise here but do you not think that you would be required to make a graphic design of a pictorial illustration of your services here so that members would see for themselves the scope of your work.Lastly, I do not really know if you have done a job before but if you have done that, do you not think it would be nice you make up your work portfolio and present it here so that prospective clients and members here can see for themselves how creative and productive you are?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "November 20, 2023, 04:02:14 PM",
      "body": "Quote from: WhyFhy on November 13, 2023, 10:48:50 AMHello Bitcointalk Community,I'm excited to announce that I'm currently open for work and offering a variety of services tailored to the crypto and tech sphere. My services encompass a wide range of skills, ensuring that your diverse needs are met with expertise and efficiency. Here's what I can offer:Signature Campaign Management: Expertise in running and managing effective signature campaigns that resonate with the target audience.Web Design: Crafting visually appealing and user-friendly websites, tailored to your specific requirements.Pool Design & Deployment: Setting up and managing mining pools with a focus on stability and high performance.Bruteforcing Services: Offering advanced bruteforcing capabilities for various security and data analysis needs.AI Services:Prompt Engineering & Visuals: Creating and optimizing prompts for AI applications, along with generating compelling visual content.Bot Creation: Developing intelligent bots for a variety of applications, including automation and interaction tasks.Compute/Training Services for AI: Providing substantial computing power for AI training and other intensive tasks.I'm not just limited to these services. I'm open-minded and adaptable, ready to explore and take on work that may not be listed here. Whether it's a unique project or a challenging task, I'm here to provide solutions.Feel free to reach out to me with your project details, and let's make something happen.I must confess to you having a wide ranger of skills in the glorified areas of trending tech space. However, I see the need for your portfolio or link to your jobs done. This will accelerate the process of securing jobs faster than the regular rigour people often go through.Again, I feel you need to also put out word on 'X' to increase your visibility as your skills are in high demand out there also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "November 21, 2023, 01:38:11 PM",
      "body": "I understand you'd like to see some of my visually striking portfolio pieces, I'll be straight up in saying I don't do a lot of that here.I do have some other sites , at the moment I'm in process of getting a warehouse built out so my server is on standby with only cgnat tunneling options I haven't set up. (New warehouse is in the boonies).I'm posting here in hopes of my post recognition will get me by on some work for the time being.Someone wanting lets say a signature campaign designed and ran might could see that I've ran microlancee.io sig campaign.Or someone wanting a pool deployed or brute force application modified would likely already know who I am (if they frequent here a lot)As for the AI stuff, I haven't done any work for others in it yet with exception to some coin design bas relief designs for some members in the collectibles section that haven't released coins. (Visually) Backend GPT bots have been demonstrated in the past here with little feedback. (Via discord)If you are genuinely interested in my services please reach out for a scope evaluation of your project.If it's out of my scope ,I'll kindly let you know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CCMS",
      "created_time": "November 21, 2023, 01:56:48 PM",
      "body": "It is good to see variety of services but it includes Brute Forcing too which makes me wonder if the service can be used for evil works ?Also, for Brute Forcing do you using cloud GPU(s) or you have made any cluster of powerful computing systems ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "November 21, 2023, 02:06:07 PMLast edit: November 21, 2023, 04:26:32 PM by WhyFhy",
      "body": "Quote from: CCMS on November 21, 2023, 01:56:48 PMIt is good to see variety of services but it includes Brute Forcing too which makes me wonder if the service can be used for evil works ?Also, for Brute Forcing do you using cloud GPU(s) or you have made any cluster of powerful computing systems ?Yes ,in theory cracking could be used for nefarious purposes, however I wouldn't accept work like that.my current main worker is a beast it's great for development in ai and (some)cracking.I do have clusters. But a bit dated at the moment. Soon GPU prices will keep sliding and I'll be able to retrofit that.I used to work in a project called 1SPLiTKEY ,it was a brute for vanity wallet application that only worked with splitkey generation.We offered enough compute power to give most users a free vanity wallet up to 7 digits long.I let the service run a year before taking it down.(cost prohibited,we literally only had like 3 paid jobs on it)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RIDER3D",
      "created_time": "November 30, 2023, 01:52:24 AM",
      "body": "OP, DM me please with your contacts. Thank you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}