{
  "id": "topic_5404292",
  "title": "Ojima-ojo",
  "author": "Ojima-ojo",
  "created_time": "June 27, 2022, 11:34:46 PM",
  "content": "Haven't looked at and experienced the cryptocurrency industry for a long time, with all the hacks and crashes that have happened to other cryptocurrencies, Bitcoin has proven to be the only option left for crypto users who are looking forward to both security for both network and investment.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404292",
  "comments": [
    {
      "author": "franky1",
      "created_time": "June 27, 2022, 11:40:57 PM",
      "body": "just stay away from the sidechains/altnets and subnets/submarine chains that are pegged to bitcoin, pretending to be bitcoin.. their units of measure they use in their messaging system(network) are not bitcoin. bitcoin never leaves the bitcoin network. and the pegs of each unit can break. be cautious of these altnets. bitcoin is the mainnet.. stick to it and secure your keys. no one can hack the blockchain. but they can hack your house door, window and that table drawer you wrote your key in and put inside. or remotely hack your computer. custodian services(businesses holding value pretending its your but they have it on their keys).. be cautious of that. if its not on your keys its not your bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 28, 2022, 12:20:13 AM",
      "body": "It has always been this way, isn't it? With bitcoin having one of the best risk/reward ratios among the cryptocurrencies. I'm really not against speculating with other cryptocurrencies assuming you know what you're doing (most people don't), but bitcoin is the right pick if you just want to leave it there and be able to sleep comfortably at night.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 28, 2022, 12:51:33 AM",
      "body": "Quote from: mk4 on June 28, 2022, 12:20:13 AM...but bitcoin is the right pick if you just want to leave it there and be able to sleep comfortably at night.And yet, there are hundreds (or even thousands) of people that prefer not to buy a single satoshi and purchase and hold literal useless tokens with food names, dog names, memes and names of billionaries.Have these people sacrificed their sweet sleep hours in favor of embracing greed or is it a case of credulity?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "June 28, 2022, 01:17:35 AM",
      "body": "I am also in the position of a long-term investor, so in the end, I dropped my choice for trust to invest long-term only in bitcoin. but my position as a day trader is still trading altcoins. not to hold but just to find the price difference and profit from it within 1 day timeframe. because I dare not hold altcoins for long term. maybe sometimes only for the medium term or a few weeks. but for the long term I only trust to hold bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "June 28, 2022, 02:25:59 AM",
      "body": "hacked and crash always exist in our world not just in cryptocurrency only in fact because of this we can learn from it and make it better . bitcoin in the other hand according bitcoin.org still in beta'Ongoing development - Bitcoin software is still in beta with many incomplete features in active development. New tools, features, and services are being developed to make Bitcoin more secure and accessible to the masses. Some of these are still not ready for everyone. Most Bitcoin businesses are new and still offer no insurance. In general, Bitcoin is still in the process of maturing'",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 28, 2022, 02:27:19 AM",
      "body": "Quote from: Hispo on June 28, 2022, 12:51:33 AMAnd yet, there are hundreds (or even thousands) of people that prefer not to buy a single satoshi and purchase and hold literal useless tokens with food names, dog names, memes and names of billionaries.Have these people sacrificed their sweet sleep hours in favor of embracing greed or is it a case of credulity? People can buy useless tokens and dog coins and still sleep comfortably. It's either they only allocated a very small amount of money (hence they can comfortably lose that money), or they're simply delusionally confident.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "June 28, 2022, 02:50:42 AM",
      "body": "Quote from: Ojima-ojo on June 27, 2022, 11:34:46 PMHaven't looked at and experienced the cryptocurrency industry for a long time, with all the hacks and crashes that have happened to other cryptocurrencies, Bitcoin has proven to be the only option left for crypto users who are looking forward to both security for both network and investment. Security wise bitcoin is the safest compared to altcoins. Yes there are plenty of incident on cryptocurrency infustru about hack so beware of where youll putting up your money. People keeps innovating and of course they arent creating a perfect platform for that so these issues will continue to happen on those platform whether we like it or not.If for long term goal and you wanted to park your money, bitcoin is the best asset there for you without worrying of its value getting near zero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "June 28, 2022, 03:16:48 AM",
      "body": "As the official King of Cryptos, Bitcoin has come a long way starting from almost nothing to where it is now and despite the ongoing red color of the market and subsequent falling down of the USD value of the coin there is no question that it is still the most viable cryptocurrency out there bar none and once the bullishness can be back we will definitely be on the road to great surprises as well. never mind all the naysayers and those proclaiming that Bitcoin is dead...soon they will be silenced and be shifting their attracts on other matters about Bitcoin. So why is it that many people still prefer to be holding \"shitty' digital assets...one reason is that many people are looking for one that can be making x10 or even x100 and they know they can't find that with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "June 28, 2022, 03:36:11 AM",
      "body": "Altcoins come and go but Bitcoin remains. The top 10 cryptocurrencies have changed through the years but Bitcoin remains at the top. All kinds of cryptocurrency hypes have made the short history of cryptocurrency a little more interesting but they're all short-lived and eventually perished. Bitcoin is the only cryptocurrency that is worth sticking to for the longest term possible. But let us never forget that exchanges, wallets, apps, etc are not Bitcoin. They also may come and go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 28, 2022, 03:53:38 AM",
      "body": "Quote from: Hispo on June 28, 2022, 12:51:33 AMHave these people sacrificed their sweet sleep hours in favor of embracing greed or is it a case of credulity? It's mostly the latter combined with gambling tendencies of them.Imagine you are a newcomer who sees bitcoin that is worth tens of thousands of dollars, then someone introduces you to something else that looks like bitcoin but is worth less than a cent. Then they tell you that this new thing is \"better\" than bitcoin and is going to \"surpass\" it or at the very least rise the same way bitcoin did only because it's price is so low.Almost everyone presented with such a lie, accepts it. Partly because they want to believe that they are not \"late\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "June 28, 2022, 03:55:10 AM",
      "body": "Bitcoin is superior and for the long term indeed. It is the first and only one I truly believe in until now since I dived into this industry and came across different coins, tokens, networks, and chains. But only Bitcoin stands out and remains on the top. I'd rather keep it among the rest even those that have a high quantity number. I still choose the quality one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "June 28, 2022, 05:13:02 AM",
      "body": "Quote from: Ojima-ojo on June 27, 2022, 11:34:46 PMHaven't looked at and experienced the cryptocurrency industry for a long time, with all the hacks and crashes that have happened to other cryptocurrencies, Bitcoin has proven to be the only option left for crypto users who are looking forward to both security for both network and investment. Why is that we realise this fact that Bitcoin is the only reliable option to invest you money in that can guarantee you some profit return in future after we see all other coins are dead? There are many coins but after the pump dump scheme they didnt rise any further and on the other side btc has recovered after such dips also and we feel it's good but it always was.Most of the coins don't stand a chance but if you understand it timely before losing money in other one's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "June 28, 2022, 05:46:09 AM",
      "body": "Well, it also depends on what you do with your bitcoin. If you happen to leave it on a platform like Celsius to get a shitload of extra interest, you have a high risk of losing your bitcoins, so I would add that safekeeping your bitcoin yourself is the only option left. In addition, perhaps in this part of the forum we are a bit biased with respect to bitcoin and some altcoins will probably be widely used in the future, but fiat currencies are also widely used and that does not mean that they are good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 28, 2022, 05:51:40 AM",
      "body": "If you think about investing in an altcoin you have to ask yourself what does this coin really offer that bitcoin does not offer. For all the altcoins that I have seen so far this is nothing. Many of them claim to be the better payment solution, but since the adoption in online and offline shops is zero this is all a big lie and will never become reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kudosinitchi",
      "created_time": "June 28, 2022, 05:55:55 AM",
      "body": "Don't forget also that aside from Bitcoin, I do believe that these crypto currencies are worth to hold and look forward to based on their market capitalization, or total value of all of the coins in current circulation, which is still best to invest for me this current bear market.1. Bitcoin (BTC)    Market cap: $406.71 billion2. Ethereum (ETH)    Market cap: $148 billion3. Tether (USDT)    Market cap: $66 billion4. U.S. Dollar Coin (USDC)    Market cap: $55 billion5. Binance Coin (BNB)    Market cap: $39 billion6. XRP (XRP)    Market cap: $17 billion7. Cardano (ADA)    Market cap: $17 billion8. Binance USD (BUSD)    Market cap: $17 billion9. Solana (SOL)    Market cap: $13 billion10. Dogecoin (DOGE)      Market cap: $9 billion*Market caps sourced from coinmarketcap.com, current as of June 27, 2022.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "June 28, 2022, 06:03:12 AM",
      "body": "Quote from: Ojima-ojo on June 27, 2022, 11:34:46 PMHaven't looked at and experienced the cryptocurrency industry for a long time, with all the hacks and crashes that have happened to other cryptocurrencies, Bitcoin has proven to be the only option left for crypto users who are looking forward to both security for both network and investment. it is not left but it is the only one since the beginning mate, Bitcoin will always be the  only or should I say the safest and secured currency for us to invest , yes there are some coins that has bright future but the assurance will always be in bitcoin and also the community had proven this already for years now and we will always find this way for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 28, 2022, 06:06:53 AM",
      "body": "Quote from: kudosinitchi on June 28, 2022, 05:55:55 AMDon't forget also that aside from Bitcoin, I do believe that these crypto currencies are worth to hold and look forward to based on their market capitalization, or total value of all of the coins in current circulation, which is still best to invest for me this current bear market.*snip*If that's your thesis — investing in them just because they're in the top 10, then don't be surprised and disappointed if we're going to have a different top 10 next year (outside of BTC, ETH, and stablecoins).https://coinsources.io/crypto-top10-history/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kudosinitchi",
      "created_time": "June 28, 2022, 06:23:10 AM",
      "body": "Quote from: mk4 on June 28, 2022, 06:06:53 AMQuote from: kudosinitchi on June 28, 2022, 05:55:55 AMDon't forget also that aside from Bitcoin, I do believe that these crypto currencies are worth to hold and look forward to based on their market capitalization, or total value of all of the coins in current circulation, which is still best to invest for me this current bear market.*snip*If that's your thesis — investing in them just because they're in the top 10, then don't be surprised and disappointed if we're going to have a different top 10 next year (outside of BTC, ETH, and stablecoins).https://coinsources.io/crypto-top10-history/How do we know the next top crypto best to invest in? From the picture, i see BTC, ETH and other stablecoin still remain top to invest throughout this past several years. Maybe your right, investing in them because they are in top this year cannot guarantee that they will still be the next best to invest in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "June 28, 2022, 06:24:52 AM",
      "body": "Quote from: hZti on June 28, 2022, 05:51:40 AMIf you think about investing in an altcoin you have to ask yourself what does this coin really offer that bitcoin does not offer. For all the altcoins that I have seen so far this is nothing. Many of them claim to be the better payment solution, but since the adoption in online and offline shops is zero this is all a big lie and will never become reality.People can also invest in altcoins but have to consider that many altcoins cannot be one investment that can give us a profit.Maybe altcoins can be one of our investments but we must be wise to know when to buy and sell those coins.It is hoped that doing so can provide good benefits for us, which can help us collect more bitcoins or stable coins.Altcoins can't be used as a better payment solution because of the fluctuating factor and so is bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}