{
  "id": "topic_5442963",
  "title": "Sarah Azhari",
  "author": "Sarah Azhari",
  "created_time": "March 05, 2023, 05:11:50 AM",
  "content": "1st edition - Bitcointalk Pie Baking Contest Quote from: RickDeckard on February 14, 2023, 12:00:01 AMkalauu mata kalian jeli melihat sudut kiri atas dibagian news, akan menemukan link baru yang cukup menarik, yaitu: Pie baking contestIni adalah kontes Pie yang dimotori oleh @RickDeckard untuk semua member bitcointalk yang memenuhi syarat. Kontes dimulai bertepatan dengan Valentine Days 2 minggu lalu dan akan berakhir 2 minggu berikutnya, 14 maret 2023. Pemenang akan dibagi untuk juara 1 (60%), juara kedua (30%) dan juara ketiga (10%) dengan pool hadiah saat ini 0.0095 BTC dan khusus juara 1 akan mendapatkan juga Custom Ledger nano dari Betnomi Syarat dan ketentuan:1. Peserta disyaratkan minimal 30 merit earned dan 30 activity2. Kue Pie musti dubuat sendiri dan bertemakan bitcoin atau bisa juga bertemakan bitcointalk forum3. Gambar dipost di thread link di atas dan musti menuliskan nama dan tanggal pada secarik kertas4. lebihh jelas silahkan ke thread.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5442963",
  "comments": [
    {
      "author": "Sarah Azhari",
      "created_time": "March 12, 2023, 07:40:16 AM",
      "body": "Masih tersisa beberapa hari lagi sebelum tutup tanggal 14 maret 2014, ku lihat saat ini total pool hadiah untuk didistribusikan kepada pemenang nantinya berkisar 0.0145 BTC atau kalau untuk pemenang ke 3 dari 10% total hadiah mendapatkan sekitar 470 ribuan. kebetulan yang baru daftar sekita 18 orang, jadi kalau ada yang berniat ikut, jangan sampai terlambat untuk memanfaatkan kesempatan langka ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "puloweh555",
      "created_time": "March 12, 2023, 10:21:07 AM",
      "body": "Quote from: Sarah Azhari on March 12, 2023, 07:40:16 AMMasih tersisa beberapa hari lagi sebelum tutup tanggal 14 maret 2014, ku lihat saat ini total pool hadiah untuk didistribusikan kepada pemenang nantinya berkisar 0.0145 BTC atau kalau untuk pemenang ke 3 dari 10% total hadiah mendapatkan sekitar 470 ribuan. kebetulan yang baru daftar sekita 18 orang, jadi kalau ada yang berniat ikut, jangan sampai terlambat untuk memanfaatkan kesempatan langka ini.Saya baru saja selesai entri dan ikut berpastipasi dalam kontes tersebut, terima kasih om sebelumnya kalau tidak ada thread ini mungkin saya tidak tau ada acara kontes Pie.  Iya benar kesempatan langka ini harus di manfaatkan syukur2 bisa menang atau bisa masuk 3 besar lumanyan buat jajan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "March 14, 2023, 07:31:30 AM",
      "body": "Quote from: puloweh555 on March 12, 2023, 10:21:07 AMQuote from: Sarah Azhari on March 12, 2023, 07:40:16 AMMasih tersisa beberapa hari lagi sebelum tutup tanggal 14 maret 2014, ku lihat saat ini total pool hadiah untuk didistribusikan kepada pemenang nantinya berkisar 0.0145 BTC atau kalau untuk pemenang ke 3 dari 10% total hadiah mendapatkan sekitar 470 ribuan. kebetulan yang baru daftar sekita 18 orang, jadi kalau ada yang berniat ikut, jangan sampai terlambat untuk memanfaatkan kesempatan langka ini.Saya baru saja selesai entri dan ikut berpastipasi dalam kontes tersebut, terima kasih om sebelumnya kalau tidak ada thread ini mungkin saya tidak tau ada acara kontes Pie.  Iya benar kesempatan langka ini harus di manfaatkan syukur2 bisa menang atau bisa masuk 3 besar lumanyan buat jajan.Aku sebenarnya pengen entri dan pengen ikut, dan bahan-bahan untuk membuat kue sudah kepersiapkan tapi karena ada keperluan mendadak ke luar kota hari ini sehingga tidak bisa kulanjutkan. Semoga kue-mu ith bisa masuk ke dalam 3 besar, syukur-syukur juara. Aku selalu support entri dari wakilindonesia.Sisa hari ini, semoga wakil indonesia bertambah dan mendominasi lomba.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "March 14, 2023, 10:39:38 AM",
      "body": "Dapat link dari teman minggu lalu dan sudah saya bookmark bahkan sudah planning namun sampai saat ini hingga beberapa hari event ditutup belum sempat ikut, padahal bahan sudah mempersiapkan semua kebutuhan yang dibutuhkan untuk membuat kue PIE namun karena ada kendala dan kesibukan sepertinya sulit mengejar deadlinenya.Jangan dilihat dari hadiahnya, sepertinya ini event juga bagus untuk mendapatkan tambahan poin merit meskipun sebagian user yang ikut berpatisipasi ingin mengeksplor hobi dan karya seni mereka dalam membuat kue Pie terbaik. Semoga nanti list pemenangnya ada peserta dari SFI dan setidaknya karya user disini tidak kalah hebatnya dengan user global lainnya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "March 14, 2023, 12:56:52 PM",
      "body": "Quote from: armanda90 on March 14, 2023, 10:39:38 AMDapat link dari teman minggu lalu dan sudah saya bookmark bahkan sudah planning namun sampai saat ini hingga beberapa hari event ditutup belum sempat ikut, padahal bahan sudah mempersiapkan semua kebutuhan yang dibutuhkan untuk membuat kue PIE namun karena ada kendala dan kesibukan sepertinya sulit mengejar deadlinenya.Jangan dilihat dari hadiahnya, sepertinya ini event juga bagus untuk mendapatkan tambahan poin merit meskipun sebagian user yang ikut berpatisipasi ingin mengeksplor hobi dan karya seni mereka dalam membuat kue Pie terbaik. Semoga nanti list pemenangnya ada peserta dari SFI dan setidaknya karya user disini tidak kalah hebatnya dengan user global lainnya. Berdasarkan tanggal yang tertera di gambar, hari ini menjadi hari terakhir untuk kontes Pie, anda masih memiliki waktu beberapa jam lagi untuk mengikuti kontes sebelum ditutup.Tidak ada kewajiban bagi user manapun untuk memberi Merit pada karya seni yang dikirim disana, tambahan merit sebagai penghargaan atas usaha yang dilakukan. Kalau tujuannya untuk mendapat merit, ujung-ujungnya akan kecewa jika tidak ada yang menghargai karya yang dibuat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luffygroove",
      "created_time": "March 15, 2023, 03:37:09 AMLast edit: March 15, 2023, 04:02:14 AM by Luffygroove",
      "body": "Wow menarik sekali, awalnya saya bertanya-tanya kenapa pie? apakah ini terkait dengan suatu perayaan di bulan Maret. Setelah browsing, saya menemukan ada perayaan yang disebut Pi Day  yang diperingati tiap tanggal 14 Maret (bulan ke-3) karena 3, 1, dan 4 adalah tiga angka penting pertama dari π. Perayaan ini pertama kali dicetuskan oleh Larry Shaw, seorang karyawan museum sains San Francisco, California, The Exploratorium pada tahun 1988. Biasanya dirayakan dengan acara makan pai atau mengadakan kompetisi pembacaan pi (sumber : https://www.piday.org/). Tapi apakah ini berkaitan dengan kompetisi pie yang diadakan bitcointalk? saya tidak tahu, mungkin ada yang tahu dan ingin mengkonfirmasi?.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "loopes",
      "created_time": "March 17, 2023, 11:29:18 PMLast edit: March 26, 2023, 03:50:19 PM by loopes",
      "body": "Quote from: armanda90 on March 14, 2023, 10:39:38 AMJangan dilihat dari hadiahnya, sepertinya ini event juga bagus untuk mendapatkan tambahan poin merit meskipun sebagian user yang ikut berpatisipasi ingin mengeksplor hobi dan karya seni mereka dalam membuat kue Pie terbaik. Semoga nanti list pemenangnya ada peserta dari SFI dan setidaknya karya user disini tidak kalah hebatnya dengan user global lainnya. Sebenarnya lebih kepada tujuan hadiah nya gan. Saya ikut karena lihat hadiah pertama sekitar Rp3.200.000 per kurs tanggal 14 Maret. Selain itu pemenang pertama di berikan hadiah tambahan oleh @Icopress berupa Ledger Betnomi. Jadi, ini sangat menarik.Mohon bantuan vote jika berkenan & tertarik dengan pie saya buatan saya asli, sampai saya bikin video 2 jam pembuatan   . Berikut link submission saya =   Submission - LoopesSaya juga telah mengabadikan proses pembuatan PIE Bitcoin buatan saya pribadi sebagai BUKTI yang kuat bahwa I made it by myself. Silakan berkunjung ke Youtubenya yang telah merekam pembuatan selama 2 jam 46 menit  tapi bisa lihat pie punya member SFI lain juga pada bagus2 ko. Total semua peserta dari berbagai negara sampai 40an peserta yang mengikuti contest ini. Semoga salah satu dari 3 pemenang ada yang dari Indonesia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zuzie",
      "created_time": "March 29, 2023, 08:10:35 AM",
      "body": "Ikut posting ya gan saya baru ikutan kontes ini, yuk barang kali ada yang mau cuci mata atau mungkin sebagai inspirasi menu buka puasa  sangkin semangatnya sampai buat 2 kue  yang pertama gagal posting tapi akhirnya berhasil juga dengan kue ke 2 ini  yuk user indo pasti bisa  Di posting disini: https://bitcointalk.org/index.php?topic=5444932.msg61996877#msg61996877Here we go Orange Pie ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "March 30, 2023, 12:05:03 AM",
      "body": "Quote from: zuzie on March 29, 2023, 08:10:35 AMHere we go Orange Pie ...Sudah tutup gan, tapii ya ndak apa2 kalau untuk memeriahkan dan menenangkan mata.sejauh yg ku tahu ada sekitar 10 orang Indonesia yang menyampaikan dan ikut perlombaan, diantaranya:Quote from: RickDeckard on February 14, 2023, 12:00:19 AMParticipants:#1 - rat03gopoh - Submission#2 - salad daging - Submission#3 - halim50_ - Submission#4 - ajiz138 - Submission#5 - puloweh555 - Submission#6 - bangjoe - Submission#7 - Ryu_Ar1 - Submission#8 - taufik123 - Submission#9 - Renampun - Submission#10 - loopes - Submissiondiantara orang Indonesia ada beberapa yang dapat vote, diatarnya:Loopespuloweh555 (2)ajiz138Dan kemungkinan voting juga tutup karena batas waktunya tanggal 29 maret 2023. sejauh ini saya bingung mau vote siapa, paling cuma bisa ngasih merit aja.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}