{
  "id": "topic_5474554",
  "title": "Gencecikmen",
  "author": "Gencecikmen",
  "created_time": "November 18, 2023, 11:45:29 AM",
  "content": "Mutluluk endeksi genellikle ortalama yaşam süresi, sosyal destek, özgürlük, yolsuzluk algısı, kişi başına düşen GSYİH gibi faktörlerin kullanılmasıyla hesaplanır. BM tarafından hazırlanan rapora göre Dünya’nın en mutlu ülkeleri; Finlandiya, Danimarka, İzlanda, İsrail, Hollanda, İsveç, Norveç, İsviçre, Lüksemburg, Yeni Zelanda. Türkiye, 2023 Mutluluk Raporunda 137 ülke içinde 106. sırada yer alıyor. 2012’den bu yana Türkiye’nin bu endeksten aldığı puanlar incelendiğinde, yıllar içerisinde Türkiye’nin mutluluk düzeyinin düşme eğilimine girdiği ve düzenli olarak azaldığı gözlemleniyor. 2012’de bu endekste 77. sırada yer alan Türkiye, güncel olarak 106. sıraya gerilemiş durumda.En mutsuz ilk beş ülke; Afganistan, Lübnan, Botsvana, Yemen, Ruanda. Kaynak: https://www.dogrulukpayi.com/dogruluk-kontrolu/turkiye-dunyanin-en-mutsuz-ilk-bes-ulkesi-arasina-mi-girdiKaynak: https://www.polatlipostasi.com/dunyanin-en-mutlu-ulkeleri-aciklandiKaynak: https://twitter.com/beehaber/status/1724382787430502688",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474554",
  "comments": [
    {
      "author": "gospodin",
      "created_time": "November 18, 2023, 12:59:03 PM",
      "body": "çok kalabalık bir çevrem yok ama kiminle konuşsam mutsuz amk:)mutsusuz olm işte ne yapacaksın? benim asıl merak ettiğim konu 2008 kriziyle ekonomik anlamda batan ülke izlanda hala nasıl mutlu lan? oğlum gidin ağlayın, ne bileyim yapacağınız işi sikeyim diye sağa sola salça olun. bu arada hayatta yaşamak istediğim tek ülke izlanda. orada yaşayamadığım için mutsuzum!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "November 18, 2023, 01:09:05 PM",
      "body": "Ekonomik durum düzelse bile insanların mutlu olması için çok zaman geçmesi lazım. Şu anda iş ekonomiyi de geçti. Ülkede hukuk yok, adalet yok, kriz var, siyasi görüşü ne olursa olsun herkes de bu durumun gerçekliğinden söz ediyor. Hal böyleyken ülke de mutluluk sıralamasında en sonlarda kalıyor, durumu olan insanlar bile mutsuz hissediyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 18, 2023, 02:14:41 PM",
      "body": "Şu sıralarda mutlu olmayan epey kesim vardır. ülkenin ekonomik koşulları çok kötü. Bir çok kişi sadece karnını doyurmak zorunda ekstra bir şeyi yok. Nereye baksan bozuk. Zaten dünya hayatında sürekli mutlu olmak diye bir şey yok. En önemli mesele hayatta beklentisiz olmak. Eğer onu başarabilirsek zaman kendiliğinden akıp gidiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 18, 2023, 03:38:52 PM",
      "body": "Bence gelecek kaygısı mutluluğu en çok etkileyen faktördür, çünkü bir gün sonra uyandığınızda sizi nelerin beklediğini kestiremezsiniz. Gerek siyasi olsun gerekse ekonomik olsun sürekli yaşamdan kaygı duyduğumuzu düşünüyorum. Kaygı ise mutluluğun önündeki en büyük bariyerdir. Random yaşıyoruz bu hayatı küçük şeylerle mutlu olmaya çalışıyoruz bu nedenle listede sonuncu değiliz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "November 18, 2023, 04:03:19 PM",
      "body": "Ekonomik faktörlerden dolayı insanlarımız mutsuz gerek şehir hayatı gerek hukuk ve adalet sisteminin tam işlememesi. Toplum birbirinin aynası olduğundan dolayı çoğunluk mutsuz olduğu için onların mutsuzluğu, mutlu olanların mutluluğunu da mutsuzluğa çeviriyorlar ister istemez yansıyor bu mutsuzluklar. Genelde etrafımda çok mutlu insana rastlamıyorum bende. En iyisi pılı pırtı toplayıp köye gitmek herhalde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "November 18, 2023, 05:55:23 PM",
      "body": "Bir şey diyeyim mi aslında bizim toplum bu kadar mutsuz değildir, iddia ediyorum imkansız ama gerçekten mutluluğu ölçebilecek parametrelere sahip kapsamlı bir araştırma yapılsa biz yukarıda çıkarız. Neden biliyor musunuz? Çünkü milletin kafa tınnn. Vizyon sıfır. Dünya hakkında tek bildiği bizim ana kanalların yaptığı dizilerden ne görürse. Kimse kusura bakmasın toplumun büyük bir bölümü böyle. Yani mesela avrupada çok ortalama gelirlere sahip insanların yılda birkaç kere tatile çıkabildiğini görse, sadece memlekete gidebiliyor olmanın bir lütuf olmadığını anlar. Allahın Tayvan'ında Kore'sinde vs. çok yakın zamanlarda sürünen toplumların nasıl geliştiğini, nasıl kilo kilo et yediğini, alım güçlerinin nasıl yüksek olduğunu görse o zaman mutsuz olur. Ama şu anda kafa tınnnn, durumumuzu iyi sanıyorlar ve bence mutlular. Buna da şükür derler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "November 18, 2023, 08:12:18 PM",
      "body": "Yurdumuzdaki mutluluk endeksini yükseltme konusunda mevcut sıralamaya getiren yada şöyle söyleyeyim sona kaymasını önleyen kesim yine doktorlar. Hani giderlerse gitsinler gurubu. Bunların yazdığı anti depresanları aradan çıkın sıralamadaki o 106 sıra var ya 137 ye kayar gerçekten. Bizde para kazanan kesim de mutlu değildir sonuçta. Dışarı bir çıkıyorsun alayının kafası kırık. Dışarda kimseye günaydın merjaba denmiyor. Adamlar saz teli gibi gergin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "November 18, 2023, 11:30:32 PM",
      "body": "bizde demokrasiyi hazmedemediği için süngülerin üzerine kurdukları despotizmi özleyen (yani, ne yaparsanız yapın yine de mutlu olmayacak) bir ~%18,5'lik kesim var. onlar için mutlu olmanın yolu tek bir şeyden geçiyor ama o da imkansız be gülüm. bak harbiden imkansız diyorum. neden anlamıyorsun... :)bence onlar ortalamamızı çok büyük bir oranda düşürüyor. yani, kesinlikle süper değiliz ama malum kütle olmasa bu sıralamada daha yüksek bir seviyede olabilirdik. olsun, onlar yokmuş gibi davranıp mutlu olmaya çalışabiliriz. belki, tıpkı etkileri gibi sayıları da azalır zamanla... :)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "November 21, 2023, 07:30:43 PM",
      "body": "Bu sene bu kadar sıra gerilememizin nedeni malum Mayıs seçimleridir malum nüfüsun %50'sine yakını bu sonuçtan ilk başta memnun değildi sonrasında da %5-10 arası daha akıllanıp mutsuz olmuştur seçiminden ötürü  Bir de millet olarak çok kafaya takıyoruz yani nasıl desem ruhsal tepkilerimiz çok uçta bununda mutsuzlukla alakası çok. Bununda en büyük nedeni millet olarak hislerimizi net bir şekilde ifade edemememizden kaynaklı. Aile içinde sevgi görmeden büyüyen insanlar sevgi göstermeyi bilmiyor; sevgi gösteremeyince yalnızlaşıyor bu da mutsuzluk katsayısını arttırıyor. Aile içerisinde sevgi ve saygıyı başarılarla elde edebileceğini düşünerek büyüyen bireyler daha sonrasında sürekli başarılı olmaları gerektiği kanısıyla kendi üzerlerinde stres oluşturuyor bu da en ufak başarısızlıkta büyük bir ölçekte mutsuzluk olarak dönüyor. Büyürken ebeveynleri tarafından terkedilmiş bireyler herkesin onu terkedeceği korkusuyla ufak bir tartışmada hemen bitti ayrılalım diyebilecek bir hale geliyor ve sonuç yalnızlığa gidiyor. Bunun gibi yüzlerce sebep sayabilirim psikolojik mentalde. Birde ekonomik boyutu var durumun keza ülkemizdeki yüksek enflasyon neredeyse nüfusun % 50'sini aşkın bir ölçekte etkiliyor. Kimisi 2 işte çalışıyor kimisi işsiz kalma korkusuyla mobbing vb şeylere maruz kaldığı bir işte devam ediyor, kimisi borç batağında vs. Bu durumlar altında gayet iyi dayanıyoruz ya bile diyesim geldi  En güzeli \"sıkıntı yok ya\"  repliğini dile oturtmak. Bırakın olabilecek sıkıntılarla 3 gün 5 gün 6 ay 1 yıl sonraki siz uğraşsın şimdiden sıkıntı yapmayın",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 21, 2023, 08:22:57 PM",
      "body": "Sürekli zam enflasyon vs duymaktan ve uyguna ürün almak için çabalamaktan gerçekten hayatı ıskalıyoruz. Eskiden burada tatilimizi nerede geçireceğimizin hayalini yapardık paylaşırdık, şimdi bakıyorum da pandemiden bayan dertler sıkıntılar bitmek bilmiyor bir yanda hastalıklar bir yanda doğal afetler bir yanda savaşlar... sanırım hepimiz bundan 5-10 sene öncesini arıyoruzdur diye düşünüyorum en azından o zamanlar şimdiden daha mutluyduk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 21, 2023, 08:31:42 PMLast edit: November 21, 2023, 08:48:35 PM by mandown",
      "body": "Her gece uyurken cebindeki paran çalınıyor,Eğitim her geçen gün leş hale geliyorHer geçen gün bir gün önce almadığın herşey zamlanıyor.Birçok ülkede teneke parçası araçlar ulaşılabilir bir ürünken bizde en zor ürünlerden biri oluyor.Adalet sistemi her geçen gün daha da kötüye gidiyor.Sence böyle bir ortamda kim mutlu olabilir?Geçenlerde bistten hisse alayım dedim aldımda dolar bozduk neyse efendim kar ettikmi ettik lan oda nesi kar ettiğim miktar paramızın hızlı değer kaybetmesi yüzünden sattığım doları ancak geri alabiliyorum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "November 22, 2023, 12:34:21 PM",
      "body": "Bu mutluluk endeksi denen şeyi şimdi yeniden değerleseler belki bir iki ülkeyi geride bırakmış olabiliriz. Emeklilerimize yapılan ödeme sonunda bir miktar etkilendiğini düşünüyorum. Yoksa olmamışmıdır. Bizim bu emeklilerde ne yapsan mutlu olmuyorlarmı. Hem emekli hem mutsuz. Olmazki daha ne yapsınlar. Aralarından yapılan kura ile bir bölümüne 5k ödeme yapıldı. Diğerleri bir sonraki çekilişte belki bu tarz bir şans yakalayabilir. Belki onlarada çıkabilir. Emekli piyango.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "November 22, 2023, 01:08:55 PM",
      "body": "Oysa ki cehalet mutluluktur derler madem bu kadar mutsuz bu millet demek ki çok akıllılar. Yaptıkları tercihlerden bu belli oluyor zaten. Makarnanın bile paketi 25 lira olmuş böyle bir ortamda kim nasıl mutlu olabilir ki? Kendini gerçekleştirmek olmalıyken insanın yaşam amacı, burada sadece hayatta kalmaya çalışıyor. Haberleri izlemeyenler bile mutsuz. Sıralamadaki yerimiz daha da düşecektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 22, 2023, 01:30:02 PM",
      "body": "Quote from: verbakalim on November 22, 2023, 12:34:21 PMBu mutluluk endeksi denen şeyi şimdi yeniden değerleseler belki bir iki ülkeyi geride bırakmış olabiliriz. Emeklilerimize yapılan ödeme sonunda bir miktar etkilendiğini düşünüyorum. Yoksa olmamışmıdır. Bizim bu emeklilerde ne yapsan mutlu olmuyorlarmı. Hem emekli hem mutsuz. Olmazki daha ne yapsınlar. Aralarından yapılan kura ile bir bölümüne 5k ödeme yapıldı. Diğerleri bir sonraki çekilişte belki bu tarz bir şans yakalayabilir. Belki onlarada çıkabilir. Emekli piyango.Mutluluk para olmamalı ama para öncelikler listesinde en önde olduğu için paraya sahip olmadan insanlar mutlu olamıyorlar, bence bu test veya araştırma neyse, gücü yerinde ülkeler içerisinde yapılmalı, şu an parasızlık yüzünden hemen hemen herkes mutsuz ve mutsuzlukları ile ülkede psikolojik sorunlar hat safhaya çıkmış, etrafımda artık daha fazla gelecek kaygısı yaşayan insanlar görüyorum, tükenmek üzere olan bir toplumda ne kadar mutlu olunabilir ki?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "November 22, 2023, 01:58:22 PM",
      "body": "Keşke mutluluk sıralamasında üstlerde yer alsa güzel ülkemiz. Maalesef her tarafında önemli değerler olmasına rağmen bunu değerlendiremiyoruz.Üç tarafı denizlerle çevrili ve biz Afrika’dan balık ithal ediyoruz. Her tarafında meyve sebze yetişiyor ama değer verilmediği için ağaçları çiftçi söküp kökünden imha ediyor. Bu gelişmelerle nasıl mutlu olabilir insanlar? Bunların kaynağında ise maddi güç vardır. Mutluluk zirvesinde ülkelere bakın maddi kaygısı olmayan ülkeleri göreceksiniz eminim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "verbakalim",
      "created_time": "November 23, 2023, 07:41:45 AM",
      "body": "Quote from: kriminall on November 22, 2023, 01:30:02 PMQuote from: verbakalim on November 22, 2023, 12:34:21 PMBu mutluluk endeksi denen şeyi şimdi yeniden değerleseler belki bir iki ülkeyi geride bırakmış olabiliriz. Emeklilerimize yapılan ödeme sonunda bir miktar etkilendiğini düşünüyorum. Yoksa olmamışmıdır. Bizim bu emeklilerde ne yapsan mutlu olmuyorlarmı. Hem emekli hem mutsuz. Olmazki daha ne yapsınlar. Aralarından yapılan kura ile bir bölümüne 5k ödeme yapıldı. Diğerleri bir sonraki çekilişte belki bu tarz bir şans yakalayabilir. Belki onlarada çıkabilir. Emekli piyango.Mutluluk para olmamalı ama para öncelikler listesinde en önde olduğu için paraya sahip olmadan insanlar mutlu olamıyorlar, bence bu test veya araştırma neyse, gücü yerinde ülkeler içerisinde yapılmalı, şu an parasızlık yüzünden hemen hemen herkes mutsuz ve mutsuzlukları ile ülkede psikolojik sorunlar hat safhaya çıkmış, etrafımda artık daha fazla gelecek kaygısı yaşayan insanlar görüyorum, tükenmek üzere olan bir toplumda ne kadar mutlu olunabilir ki? Sen mutluluğun resmini yapabilir misin Abidin?işin kolayına kaçmadan amagül yanaklı bebesini emziren melek yüzlü anneciğin resmini değilne de ak örtüde elmalarınne de akvaryumda su kabarcıklarının arasında dolaşan kırmızı balığınkiniSen mutluluğun resmini yapabilir misin Abidin?1961 yazı ortalarındaki Küba’nın resmini yapabilir misin?Çok şükür çok şükür bugünü de gördümölsem gam yemem gayrının resmini yapabilir misin üstad?https://www.cafrande.org/sen-mutlulugun-resmini-yapabilir-misin-abidin-isin-kolayina-kacmadan-ama/Şair zamanında mutluluğun resminin nasıl olacağını ve yapılıp yapılamayacağını merak edip sormuş. Ama günümüzde mutsuzluğun resmini yapanlar var. Bunları sayılara çevirip tablolarını hazırlayanlar var. Bunları sıraya koyanlar var. Mutsuzluk için ne gerekiyorsa canla başla çalışanlar var. Bunlar kolay çünkü olumsuz ne varsa koy torbaya sonuç ortada. Bunu tersine çevirecek güç ve erki ben bu yaşıma kadar görmedim. Olumlu bir işin altına imzasını atabi,lecek bir yöneticiyi bulamazsın. Muhalefet hariç. Onlarında zaten gücü yetmiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}