{
  "id": "topic_5449859",
  "title": "joker_josue",
  "author": "joker_josue",
  "created_time": "April 23, 2023, 07:39:10 AM",
  "content": "Esta semana deparei-me com uma noticia a indicar que o Reino Unido esta a planear uma lei que irá obrigar as empresas de mensagens, deixarem de poder usar sistemas de encriptação nas suas apps. Ou seja, isso iria permitir as autoridades poderem aceder as mensagens trocadas entre utilizadores em apps como WhatsApp, Telgram, etc.Quote from: https://pplware.sapo.pt/internet/reino-unido-quer-acabar-com-criptografia-e-apps-de-mensagens-uniram-se-para-o-evitar/Tal como muitos outros já o tentaram fazer, o Reino Unido quer criar uma forma de podem aceder às conversas e a outras trocas de mensagens. Estas simplesmente resultam e tornam-se acessíveis depois de remover a criptografia, colocando assim em causa a privacidade dos utilizadores.Este é um cenário que está a ganhar muita força e que de prepara para avançar, com a justificação de combater a pornografia infantil e criar um sistema de vigilância. Claro que isso é por agora impossível com a criptografia implementada, que o Reino Unido quer assim remover de vez.Logicamente, que as empresas estão contra essa medida, que poderá por em causa todo o seu negocio.Será que a privacidade que ainda temos nos sistemas de comunicação que usamos, vão realmente desaparecer?Se algo do género surgir, que meios poderemos usar para garantir a privacidade? Será difícil...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449859",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "April 23, 2023, 01:51:43 PM",
      "body": "Quote from: joker_josue on April 23, 2023, 07:39:10 AMSe algo do género surgir, que meios poderemos usar para garantir a privacidade? Será difícil...Pode ter certeza que apps com mensagens encriptadas sempre vão existir, se não um mainstream como WhatsApp ou Telegram, com um P2P open-source (+ VPN se até ele levar um bloqueio). Só se formos total para o caminho do estado big brother distopico que a coisa vai ficar feia, mas aí teremos até outros problemas graves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "April 23, 2023, 01:55:13 PM",
      "body": "Quote from: joker_josue on April 23, 2023, 07:39:10 AMLogicamente, que as empresas estão contra essa medida, que poderá por em causa todo o seu negocio.Será que a privacidade que ainda temos nos sistemas de comunicação que usamos, vão realmente desaparecer?Se algo do género surgir, que meios poderemos usar para garantir a privacidade? Será difícil...Até o btc pode ser usado para enviar mensagensEu vi que tem chats sendo elaborados com a lightning network Tem vários mas esse é o primeiro q aparece no Google.https://www.getjuggernaut.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "April 23, 2023, 03:49:36 PM",
      "body": "Quote from: bitmover on April 23, 2023, 01:55:13 PMQuote from: joker_josue on April 23, 2023, 07:39:10 AMLogicamente, que as empresas estão contra essa medida, que poderá por em causa todo o seu negocio.Será que a privacidade que ainda temos nos sistemas de comunicação que usamos, vão realmente desaparecer?Se algo do género surgir, que meios poderemos usar para garantir a privacidade? Será difícil...Até o btc pode ser usado para enviar mensagensEu vi que tem chats sendo elaborados com a lightning network Tem vários mas esse é o primeiro q aparece no Google.https://www.getjuggernaut.com/Mas no btc vc precisaria enviar uma transação para a mensagem ir, assim como na ethereum?Ja tem algumas soluções de mensagens sem custos surgindo com ENS e endereços ethereum então basicamente em termos de tecnologia já existem plataformas que o governo não consegue parar. Concordo que é bizarro querer remover a criptografia do telegram e whatsapp. Se é que realmente podemos confiar nela. Signal me parece uma opção melhor. O mais difícil acredito que é fazer com que os usuários se importem. Muita gente acaba caindo na besteira do quem não deve não teme e abre mão de sua privacidade Alguém sabe se o wechat usa criptografia ponta a ponta na China??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "April 23, 2023, 04:37:01 PM",
      "body": "Quote from: joker_josue on April 23, 2023, 07:39:10 AMEsta semana deparei-me com uma noticia a indicar que o Reino Unido esta a planear uma lei que irá obrigar as empresas de mensagens, deixarem de poder usar sistemas de encriptação nas suas apps. Ou seja, isso iria permitir as autoridades poderem aceder as mensagens trocadas entre utilizadores em apps como WhatsApp, Telgram, etc.Tem um artigo muito interessante de um Cypherpunks famoso sobre a criação a chave PGP e ele cita bastante sobre a tentativa do governo de obrigar todas as empresas de comunicação a colocar  backdoors na infraestrutura pra permitir exatamente isso, que pudessem interceptar todas as comunicações. É uma nova \"fase\" e \"estratégia\" para acesso sem restrições as comunicações",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "April 23, 2023, 05:47:52 PM",
      "body": "Quote from: Lucasgabd on April 23, 2023, 03:49:36 PMMas no btc vc precisaria enviar uma transação para a mensagem ir, assim como na ethereum?Toda mensagem é enviada por meio de uma transação, que é o que a rede entende. Caso contrário não teria a segurança e descentralização da rede.Se a mensagem for on-chain, ela só conhece inputs e outputs em uma cadeia de blocos (portanto tem que ter uma tx).Se a mensagem for pela lightning, cada par de canais só conhece as txs que ocorrem entre eles. É a mesma coisa de você enviar qualquer transação off-chain (com possíveis taxas de roteamento - aquela coisa de 1-10 sats por tx).O que muda é ambas as pontas usando um protocolo para codificar e decodificar dados dessa tx de forma que entendam as suas mensagens. Mesma coisa de qualquer meio de comunicação, por exemplo, uma batida em código morse é uma forma de comunicação pois ambas as partes entendem que \"ponto-ponto-ponto, traço-traço, ponto-ponto-ponto\" significa SOS (caso contrário é só um som).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "April 23, 2023, 07:30:59 PM",
      "body": "Quote from: Disruptivas on April 23, 2023, 04:37:01 PMTem um artigo muito interessante de um Cypherpunks famoso sobre a criação a chave PGP e ele cita bastante sobre a tentativa do governo de obrigar todas as empresas de comunicação a colocar  backdoors na infraestrutura pra permitir exatamente isso, que pudessem interceptar todas as comunicações. É uma nova \"fase\" e \"estratégia\" para acesso sem restrições as comunicações Eu acredito que há empresas que deixam esse backdoor para o governo e em troca podem ganhar algumas vantagens.Não sei quais, não tenho provas, mas também já li a respeito e é totalmente possível que haja essa \"cooperação\", tanto que dá pra ver que algumas empresas são mais perseguidas com essa questão do que outras.Alguns exemplos que podemos usar para ilustrar um pouco disso são a Huawei e o Tik Tok, ambas os Estados Unidos estão em cima, e a Huawei até já é banida dos EUA.E hoje mesmo vi uma notícia que os Estados Unidos estão multando a Seagate em 300 milhões de dólares, por fornecer HDs para a empresa: https://tecnoblog.net/noticias/2023/04/21/seagate-e-multada-em-us-300-milhoes-pelos-eua-por-enviar-hds-a-huawei/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "April 23, 2023, 09:32:05 PM",
      "body": "Quote from: joker_josue on April 23, 2023, 07:39:10 AMEsta semana deparei-me com uma noticia a indicar que o Reino Unido esta a planear uma lei que irá obrigar as empresas de mensagens, deixarem de poder usar sistemas de encriptação nas suas apps. Ou seja, isso iria permitir as autoridades poderem aceder as mensagens trocadas entre utilizadores em apps como WhatsApp, Telgram, etc.Quote from: https://pplware.sapo.pt/internet/reino-unido-quer-acabar-com-criptografia-e-apps-de-mensagens-uniram-se-para-o-evitar/Tal como muitos outros já o tentaram fazer, o Reino Unido quer criar uma forma de podem aceder às conversas e a outras trocas de mensagens. Estas simplesmente resultam e tornam-se acessíveis depois de remover a criptografia, colocando assim em causa a privacidade dos utilizadores.Este é um cenário que está a ganhar muita força e que de prepara para avançar, com a justificação de combater a pornografia infantil e criar um sistema de vigilância. Claro que isso é por agora impossível com a criptografia implementada, que o Reino Unido quer assim remover de vez.Logicamente, que as empresas estão contra essa medida, que poderá por em causa todo o seu negocio.Será que a privacidade que ainda temos nos sistemas de comunicação que usamos, vão realmente desaparecer?Se algo do género surgir, que meios poderemos usar para garantir a privacidade? Será difícil...Mas essa facilidade para a quebra do sigilo telemático será somente quando a policia ou outro órgão administrativo do governo pedir, ou tem que ter ordem de algum membro do poder judiciário ? No Brasil, oficialmente, a quebra de sigilo só pode acontecer com ordem de algum membro do juidiciario( juiz, desembargador, ministros de instancias superiores).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "April 23, 2023, 09:41:23 PM",
      "body": "Quote from: joker_josue on April 23, 2023, 07:39:10 AMEsta semana deparei-me com uma noticia a indicar que o Reino Unido esta a planear uma lei que irá obrigar as empresas de mensagens, deixarem de poder usar sistemas de encriptação nas suas apps. Ou seja, isso iria permitir as autoridades poderem aceder as mensagens trocadas entre utilizadores em apps como WhatsApp, Telgram, etc.Sinceramente, acredito que esses aplicativo irão preferir deixar de operar (oficialmente) nesses países do que mudar seus mecanismos de forma a permitir que governos possam interferir nessas trocas de mensagens.E pensem comigo, se um governo propõem tal ação, o que o impedem de obrigar empresas como a Amazon ou Google de criarem \"mecanismos\" capazes de ouvir oque se fala para um echo-dot ou google-nest?E as câmeras conectadas que temos em casa, ser~á que não há ordem judicial para que obrigem elas a nos vigiarem?Qual aseria a diferença disso para o monitoramente das mensagens trocadas pelo whatsapp?Quote from: Paredao on April 23, 2023, 09:32:05 PMMas essa facilidade para a quebra do sigilo telemático será somente quando a policia ou outro órgão administrativo do governo pedirE você confia na polícia ou em um governo justo que vai pedir essa quebra de sigilo somente em casos legítimos? Eu não!Privacidade não tem preço, qualquer medida como essa anunciada no OP deve ser repudiada sempre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "April 23, 2023, 09:45:43 PM",
      "body": "Quote from: alegotardo on April 23, 2023, 09:41:23 PME você confia na polícia ou em um governo justo que vai pedir essa quebra de sigilo somente em casos legítimos? Eu não!Privacidade não tem preço, qualquer medida como essa anunciada no OP deve ser repudiada sempre.Então você vai fazer uma investigação policial como ? Sem quebrar o sigilo de ninguém ? Vai lá e pede por favor para te fornecer elementos de um crime ? Logicamente tem que ter um juiz para saber se o pedido de quebra é justo ou injusto, senão como se faz ? Se for injusto, que se puna quem pediu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 24, 2023, 12:56:09 AM",
      "body": "Quote from: Paredao on April 23, 2023, 09:32:05 PMMas essa facilidade para a quebra do sigilo telemático será somente quando a policia ou outro órgão administrativo do governo pedir, ou tem que ter ordem de algum membro do poder judiciário ? No Brasil, oficialmente, a quebra de sigilo só pode acontecer com ordem de algum membro do juidiciario( juiz, desembargador, ministros de instancias superiores).O problema esta é que se as mensagens estão encriptadas, não existe forma de nesses casos conseguir-se saber o conteúdo das mensagens. Pelo o que eu percebi, o que esta a ser proposta, é essas aplicações deixarem de usar a encriptação ou deixarem um blackdoor com o objetivo de se conseguir o acesso a essas mensagem.Quote from: alegotardo on April 23, 2023, 09:41:23 PMSinceramente, acredito que esses aplicativo irão preferir deixar de operar (oficialmente) nesses países do que mudar seus mecanismos de forma a permitir que governos possam interferir nessas trocas de mensagens.E pensem comigo, se um governo propõem tal ação, o que o impedem de obrigar empresas como a Amazon ou Google de criarem \"mecanismos\" capazes de ouvir oque se fala para um echo-dot ou google-nest?E as câmeras conectadas que temos em casa, ser~á que não há ordem judicial para que obrigem elas a nos vigiarem?Qual aseria a diferença disso para o monitoramente das mensagens trocadas pelo whatsapp?Pois, esse é o problema. Ao criar esse tipo de lei, todo o conteúdo gerado por esses dispositivos ou outros, passam a ser possível aceder. Abrindo-se um grande procedente para que a privacidade posta em causa e violada por terceiros. Alias, é isso que muitas das empresas das apps tem estado alertar, apos ter se conhecido desta \"ideia\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "April 24, 2023, 03:26:03 AM",
      "body": "Quote from: Paredao on April 23, 2023, 09:45:43 PMEntão você vai fazer uma investigação policial como ? Sem quebrar o sigilo de ninguém ? Vai lá e pede por favor para te fornecer elementos de um crime ? Logicamente tem que ter um juiz para saber se o pedido de quebra é justo ou injusto, senão como se faz ? Se for injusto, que se puna quem pediu.Que inocência, hein Paredao? Vai deixar o juiz bonzinho e bem intencionado vasculhar as suas mensagens quando bem entender? Entenda que na prática não existe isso de de \"se for injusto, que se puna\"! O caso Snowden mesmo revelou que a NSA estava espionando de forma ilegal milhões de cidadãos estadunidenses, pela rede de telefones e pela rede global de internet... quem foi punido?? Isso mesmo, o Snowden!!Ou o caso do Julian Assange que segue preso por revelar crimes de guerra, onde inocentes eram bombardados sem qualquer tipo de preocupação ou punição aos culpados. Quem está preso até hoje??? O Assange!Acha que o poderoso governo vai botar o dele na reta? Em nome da \"segurança nacional\" tudo vale, inclusive em tempos onde até você pode fazer parte do grupo alvo. São dois palitos para que as cryptomoedas e seus fãs façam parte desse seleto grupo dos que \"minam a segurança economica do país\"... ai quero ver, pois já vai ser tarde demais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "April 24, 2023, 08:25:59 AM",
      "body": "Quote from: TryNinja on April 24, 2023, 03:26:03 AMAcha que o poderoso governo vai botar o dele na reta? Em nome da \"segurança nacional\" tudo vale, inclusive em tempos onde até você pode fazer parte do grupo alvo. São dois palitos para que as cryptomoedas e seus fãs façam parte desse seleto grupo dos que \"minam a segurança economica do país\"... ai quero ver, pois já vai ser tarde demais.É isso! E como a \"desculpa\" do terrorismos já esta muito gasta em não pega lá muito bem, eles argumentam que é para combater a pedofilia. Alegadamente, esses monstros andam a usar esse tipo de comunicação para partilhar fotos e vídeos.Então, como esse tema é bem sensível e a sociedade de modo geral condena fortemente essas praticas, irão conseguir reunir muitos apoios. E a sociedade nem vai se aperceber o que ficara envolvido para os inocentes esse tipo de leis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "April 24, 2023, 12:17:12 PM",
      "body": "Quote from: Lucasgabd on April 23, 2023, 03:49:36 PMMas no btc vc precisaria enviar uma transação para a mensagem ir, assim como na ethereum?O  custo seria irrisório,  pois seria enviada pela lightning Um custo pequeno a pagar pela privacidade garantida e pela resistência à censura.Imagina pagar poucos usd por ano para poder enviar mensagens?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}