{
  "id": "topic_5464331",
  "title": "CryptoMax66",
  "author": "CryptoMax66",
  "created_time": "August 23, 2023, 06:28:11 PM",
  "content": "Hi finde leider kein passendes thema. da chipmixer offline ist suche ich einen neuen mixer. welche sind die größten/seriösten anbieter? gibt es einen unterschied zwischen mixer und tumbler?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464331",
  "comments": [
    {
      "author": "1miau",
      "created_time": "August 23, 2023, 09:18:27 PMLast edit: August 24, 2023, 12:07:42 PM by 1miau",
      "body": "Quote from: CryptoMax66 on August 23, 2023, 06:28:11 PMHi finde leider kein passendes thema. da chipmixer offline ist suche ich einen neuen mixer. welche sind die größten/seriösten anbieter? gEs gibt im internationalen Forenbereich eine sehr detaillierte Liste mit allen Mixern, die aktuell bekannt sind: 2023 List Bitcoin Mixers Bitcoin Tumblers Websites Wie immer gilt natürlich, dass man bei Mixern, wie bei zentralisierten Tauschbörsen, (für kurze Zeit) die Coins dem Dienstleister anvertraut, weshalb man immer sorgfältig über den Anbieter recherchieren sollte. Eine andere Möglichkeit wäre noch CoinJoin. Die Liste ist aber sehr gut recherchiert und andere Forenteilnehmer schreiben da direkt was rein, wenn ihnen etwas auffält.  Quote from: CryptoMax66 on August 23, 2023, 06:28:11 PMgibt es einen unterschied zwischen mixer und tumbler?Nö, soweit ich weiß, ist das nur ein gerne gebrauchtes Synonym.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "August 24, 2023, 07:57:17 AM",
      "body": "Quote from: CryptoMax66 on August 23, 2023, 06:28:11 PMHi finde leider kein passendes thema. da chipmixer offline ist suche ich einen neuen mixer. welche sind die größten/seriösten anbieter? gibt es einen unterschied zwischen mixer und tumbler?Da es erst kürzlich wieder einen größeren Mixer-Scam hier im Forum gegeben hat, achte bitte darauf, dass du dich selbst (!) über den Anbieter vertraust und nicht nur auf Empfehlungen handelst.Zusätzlich bietet es sich an einen neuen Mixer erst mit einem kleineren Betrag zu testen, bevor man seine gesamten, zu wechselnden BTC rübersendet. Das kostet dann zwar ein wenig mehr Transaktionsgebühren, aber so kann man erst einmal schauen, ob einem der Service überhaupt zusagt und dieser seriös ist.Daneben natürlich darauf achten, dass du die richtige Webseite aufrufst, denn gerade bei Mixern gibt es unzählige Fake-Seiten die sich in der Domain meist nur um einen Buchstaben unterscheiden (so wird zum Beispiel in der Domain aus einem i ein l und wenn man nicht richtig hinschaut oder kopiert, versendet man die BTC an eine täuschend echt aussehende Fake-Seite).Es gibt aber weiterhin einige seriöse Anbieter. Darum schau in den oben verlinkten Thread, mach dich schlau und hole am besten noch weitere Informationen ein bevor du die erste Transaktion tätigst.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virginorange",
      "created_time": "August 25, 2023, 02:34:17 PM",
      "body": "Wieso sollte ich als Nutzer einen Mixer benutzen und nicht einen Coinjoin von Whirlpool von Samouraiwallet oder Sparrowwallet?https://samouraiwallet.com/whirlpoolhttps://sparrowwallet.com/docs/mixing-whirlpool.htmlIst das Betreiben eines Mixers nicht rechtlich problematisch?https://www.coindesk.com/policy/2022/11/22/tornado-cash-developer-alexey-pertsev-to-remain-in-jail-until-at-least-late-februrary/https://twitter.com/sethforprivacy/status/1694434777611325805?s=20",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "August 25, 2023, 08:10:19 PM",
      "body": "Quote from: virginorange on August 25, 2023, 02:34:17 PMWieso sollte ich als Nutzer einen Mixer benutzen und nicht einen Coinjoin von Whirlpool von Samouraiwallet oder Sparrowwallet?https://samouraiwallet.com/whirlpoolhttps://sparrowwallet.com/docs/mixing-whirlpool.htmlBeides, weder Mixer noch CoinJoin, ist eine hundertprozentige Garantie für sicheres Mixen der Coins. Um mal die größten Nachteile für beide Varianten aufzulisten: Nachteile CoinJoin:- nur effektiv, wenn viele Teilnehmer- Blockchainverbindung bleibt intakt, daher über Blockchainanalyse (relativ einfach) zu ermittelnVorteile CoinJoin:- dezentralisiert: man gibt die Kontrolle über die Coins nicht abNachteile Mixer: - zentralisiert, man ist abhängig vom DienstleisterVorteile Mixer: - gute Mixer nehmen eine Unterbrechung der Blockchainverbindung (Input / Output) vor, was ein deutlich höheres Privatsphärelevel bringt- einfacher zu erledigenDabei wäre für mich besonders die Tatsache relevant, dass bei CoinJoin stets die Blockchainverbindung erhalten bleibt, egal wie viel Liquidität es gibt. Viel Liquidität macht eine Rückverfolgung dann zwar schwieriger aber nicht unmöglich. Rückverfolgbarkeit ist bei Mixern nur bei enorm großen Summen möglich, da diese selbst auffällig sind, was durch forensische Analyse herausgefunden werden kann. Bei kleinen Transaktionen ist das nicht praktisch unmöglich.Muss jeder selbst entscheiden, was er verwenden möchte und so gesehen würde die Verwendung von beidem nacheinander die Effektivität noch erhöhen. Wenn man so viel Zeit investieren und Gebühren ausgeben möchte. Quote from: virginorange on August 25, 2023, 02:34:17 PMIst das Betreiben eines Mixers nicht rechtlich problematisch?https://www.coindesk.com/policy/2022/11/22/tornado-cash-developer-alexey-pertsev-to-remain-in-jail-until-at-least-late-februrary/https://twitter.com/sethforprivacy/status/1694434777611325805?s=20Kommt darauf an, wo der Betreiber sitzt. In den meisten Ländern Mitteleuropas ist ein Betreiben eines Mixers wegen der Geldwäschevorschriften nicht möglich. In manch anderen Teilen der Welt wird es hingegen ganz anders aussehen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "August 26, 2023, 07:07:56 AM",
      "body": "Ich muss gestehen, dass ich Mixer und Coinjoins auch noch nicht im detail durchdrungen habe.Was ich mich frage ist ob man das nicht auch einfach über XMR regeln kann?! Also bspw. auf der Börse mit KYC wo die BTC liegen XMR kaufen, die auf eine non-kyc Börse schicken, da wieder BTC kaufen und die dann aufs wallet transferieren....Hätte man damit nicht das selbe erreicht wie bei mixer + coinjoin? Gebühren dürften da je nach Börse auch <1% sein?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "August 26, 2023, 10:33:31 AM",
      "body": "Quote from: Turbartuluk on August 26, 2023, 07:07:56 AMIch muss gestehen, dass ich Mixer und Coinjoins auch noch nicht im detail durchdrungen habe.Was ich mich frage ist ob man das nicht auch einfach über XMR regeln kann?! Also bspw. auf der Börse mit KYC wo die BTC liegen XMR kaufen, die auf eine non-kyc Börse schicken, da wieder BTC kaufen und die dann aufs wallet transferieren....Hätte man damit nicht das selbe erreicht wie bei mixer + coinjoin? Gebühren dürften da je nach Börse auch <1% sein?! Exakt, bzw fast so, habe ich es auch gehandhabt wenn ich Coins hatte wo ich mir nicht so 100% sicher ob man so \"offiziell\" nutzen soll.Hatte jedoch erst auf einem Wallet mit Exchange Funktion (komplett ohne KYC, dafür aber mit Gebühren) mit den BTC Monero gekauft, dann Monero wieder woanders in BTC, und fertig.Da einige Mixer sich derzeit verabschieden will ich das Risiko nicht eingehen und den denkbar schlechtesten Zeitpunkt erwischen wo gerade nichts mehr geht auf der Seite, wäre typisch für mich so ein Pech zu haben. Daher lieber den alten bewährten Weg, auch wenn es gebührentechnisch etwas höher ausfällt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "August 28, 2023, 04:45:18 AM",
      "body": "Quote from: CryptoMax66 on August 23, 2023, 06:28:11 PMHi finde leider kein passendes thema. da chipmixer offline ist suche ich einen neuen mixer. In Zeiten strenger werdender Regulierungen der Börsen muss man leider auch im Hinterkopf behalten, dass Börsen ggfs die Coins aus Mixer verweigern könnten ... bzw ist um Fall des Falles ein Herkunftsnachweis deutlich aufwändiger. Solltest du also einen Verkauf planen könntest du vorab schon mit der Börse Kontakt aufnehmen wie sie Coins aus Mixer behandeln. Ich weiß jetzt natürlich nicht, was du mit den gemixten Coins machen willst (und geht mich/uns auch nix an), sollte daher nur als zusätzlicher Denkanstoß verstanden werden!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "August 28, 2023, 10:30:27 AM",
      "body": "Quote from: Turbartuluk on August 26, 2023, 07:07:56 AMWas ich mich frage ist ob man das nicht auch einfach über XMR regeln kann?! Also bspw. auf der Börse mit KYC wo die BTC liegen XMR kaufen, die auf eine non-kyc Börse schicken, da wieder BTC kaufen und die dann aufs wallet transferieren....In den Zeiten wo Mixer noch nicht so verbreitet waren, war genau dieser Weg meist die erste Wahl. Wobei heutzutage für viele Nutzer ja eher der umgekehrte Weg interessant sein dürfte.In den Zeiten wo es noch viele weitere Hinterhofbörsen ohne KYC gab, war das ganze dann auch meist relativ einfach umgesetzt. Natürlich etwas gebührenintensiver, aber da es eben an KYC-freie Börsen nicht mangelte konnte man sich so quasi mit ein paar Transaktionen seinen Privatsphäre zurückholen.Quote from: Lakai01 on August 28, 2023, 04:45:18 AMIn Zeiten strenger werdender Regulierungen der Börsen muss man leider auch im Hinterkopf behalten, dass Börsen ggfs die Coins aus Mixer verweigern könnten ... bzw ist um Fall des Falles ein Herkunftsnachweis deutlich aufwändiger. Solltest du also einen Verkauf planen könntest du vorab schon mit der Börse Kontakt aufnehmen wie sie Coins aus Mixer behandeln. Wichtiger Punkt. Man liest immer wieder, dass Börsen Coins, die aus Mixern oder von gewissen Casino-Webseiten stammen ablehnen. Inwiefern das für Börse X oder Y relevant ist oder welche Limits hier gelten dürfte wohl von Fall zu Fall unterschiedlich sein.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "August 28, 2023, 10:03:09 PM",
      "body": "Quote from: Turbartuluk on August 26, 2023, 07:07:56 AMWas ich mich frage ist ob man das nicht auch einfach über XMR regeln kann?! Also bspw. auf der Börse mit KYC wo die BTC liegen XMR kaufen, die auf eine non-kyc Börse schicken, da wieder BTC kaufen und die dann aufs wallet transferieren....Hätte man damit nicht das selbe erreicht wie bei mixer + coinjoin? Gebühren dürften da je nach Börse auch <1% sein?! Zentrale Mixer hatte ich früher genutzt, um kleinere Mengen an Bitcoin zu mixen. Aber mir ist das Risiko ab einer bestimmten Summe dann doch zu groß und daher nutze ich dafür ausschliesslich Monero. Aber du solltest die XMR nicht direkt von Börse A zu Börse B schicken, denn dann sind beiden deine Adressen bekannt. Wenn sollte immer ein eigenes Wallet dazwischengeschaltet sein. Also Börse A -> XMR Wallet -> Börse B. Einige schalten sogar noch ein zweites XMR Wallet hinter das erste. So war das jedenfalls früher empfohlen.ARRR (Pirate Chain) ist sogar noch anonymer. Doch leider ist das Volumen sehr gering und so kann man dort auch nur mit geringen Volumen anonymisieren.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "August 29, 2023, 08:33:31 AM",
      "body": "Quote from: bct_ail on August 28, 2023, 10:03:09 PMZentrale Mixer hatte ich früher genutzt, um kleinere Mengen an Bitcoin zu mixen. Aber mir ist das Risiko ab einer bestimmten Summe dann doch zu groß und daher nutze ich dafür ausschliesslich Monero. Aber du solltest die XMR nicht direkt von Börse A zu Börse B schicken, denn dann sind beiden deine Adressen bekannt. Wenn sollte immer ein eigenes Wallet dazwischengeschaltet sein. Also Börse A -> XMR Wallet -> Börse B. Einige schalten sogar noch ein zweites XMR Wallet hinter das erste. So war das jedenfalls früher empfohlen.Kurze Rückfrage dazu:Transaktion Börse A -> Börse BBörse A gebe ich ja die XMR-Adresse, insofern ist klar dass die wissen wo die Zahlung hingeht. Sofern außerdem bekannt ist, dass die Adresse zu Börse B gehört kann also die Zahlung zugeordnet werden.   Börse B wiederum weiß aber nicht wo die Zahlung herkommt, oder? Das heißt, damit beiden Börsen die Adressen bekannt werden müsste ich auch mal XMR zurück schicken, oder?Transaktion Börse A -> Wallet 1 -> Börse BSelbst wenn ich XMR PingPong hin und her schicke wäre beiden Börsen nicht bekannt woher die XMR kommen, sondern nur wohin Sie geschickt werden. Die Wallet 1 ist aber nicht öffentlich bekannt und kann somit auch nicht zugeordnet werden. A und B wissen folglich nichts voneinander. Ist das so korrekt?Transaktion Börse A -> Wallet 1 -> Wallet 2 -> Börse BSofern mein bisheriger Wissensstand korrekt ist verstehe ich demnach nicht, wo der Vorteil einer zweiten Wallet wäre?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Real-Duke",
      "created_time": "August 29, 2023, 10:31:35 AM",
      "body": "Quote from: Turbartuluk on August 29, 2023, 08:33:31 AMTransaktion Börse A -> Wallet 1 -> Wallet 2 -> Börse BSofern mein bisheriger Wissensstand korrekt ist verstehe ich demnach nicht, wo der Vorteil einer zweiten Wallet wäre?!  Meiner Meinung nach erhöhst Du durch das zwischenschalten einer zweiten Wallet nochmal die Anonymisierung der Coins.Börse A kennt nur Wallet 1 und Börse B nur Wallet 2. Sollte es in irgendeiner Form möglich sein, von irgendeiner Seite aus Transaktionen von Börse A und B abzufragen, lässt sich so immer noch kein Zusammenhang erkennen.Ob das nur eine Aluhut Theorie ist, oder bereits Realität sein könnte, lasse ich mal so im Raum stehen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "August 29, 2023, 10:49:47 AM",
      "body": "Quote from: Real-Duke on August 29, 2023, 10:31:35 AMQuote from: Turbartuluk on August 29, 2023, 08:33:31 AMTransaktion Börse A -> Wallet 1 -> Wallet 2 -> Börse BSofern mein bisheriger Wissensstand korrekt ist verstehe ich demnach nicht, wo der Vorteil einer zweiten Wallet wäre?!  Meiner Meinung nach erhöhst Du durch das zwischenschalten einer zweiten Wallet nochmal die Anonymisierung der Coins.Börse A kennt nur Wallet 1 und Börse B nur Wallet 2. Sollte es in irgendeiner Form möglich sein, von irgendeiner Seite aus Transaktionen von Börse A und B abzufragen, lässt sich so immer noch kein Zusammenhang erkennen.Ok, verstanden. Das gilt aber nur wenn die Coins hin und wieder zurück fließen, richtig? Weil ansonsten kennt ja Börse B die Wallet 2 gar nicht und wallet 1 würde reichen oder?Dann mach ich mal weiter:Angenommen ich habe bei Kraken jeweils ein KYC und ein Non-KYC (=Starter-)Konto. Fiat zu Kraken KYC, in XMR wandeln -> zu Wallet 1, paar Tage/Wochen liegen lassen -> zu Kraken Non-KYC, in BTC wandeln -> auf die BTC Hodl Wallet, 10 Jahre liegen lassen.Ließen sich bei Kraken die Transaktionen zusammenführen und wenn ja wie? (unterschiedliche Anmeldedaten der Aliase für Name, Geburtsdatum, Adresse, Mail, Tel vorausgesetzt)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virginorange",
      "created_time": "August 30, 2023, 08:42:17 AMLast edit: August 30, 2023, 11:38:36 AM by virginorange",
      "body": "Quote from: Turbartuluk on August 29, 2023, 10:49:47 AMAngenommen ich habe bei Kraken jeweils ein KYC und ein Non-KYC (=Starter-)Konto. Fiat zu Kraken KYC, in XMR wandeln -> zu Wallet 1, paar Tage/Wochen liegen lassen -> zu Kraken Non-KYC, in BTC wandeln -> auf die BTC Hodl Wallet, 10 Jahre liegen lassen.Die zentralen Börsen loggen bestimmt deine IP-Adresse.Also würde ich auch unterschiedliche IPs über VPN benutzten. Nimm Mullvad oder miete dir per Bitcoin einen eigenen Server und setzt dir per Wireguard eine eigene VPN auf.Welchen Zweck/Vorteil verfolgst du bei der anonymisierung der Coins?Dein Kraken KYC Konto weis natürliche wie viel Kryptovermögen du gekauft hast und wo du wohnst, nur nicht Coins dir konkret gehören.Quote from: 1miau on August 25, 2023, 08:10:19 PMNachteile CoinJoin:- nur effektiv, wenn viele Teilnehmer\"Samourai Wallet Wirlpool hat 8630 unspent BTC. Im Remix befinden sich rund 152500 einzelne Imputs verteilt auf 4 Poolgrößen.Jetzt kann ein Teilnehmer mehrere Inputs produzieren, aber das ist ja im Mixer genauso möglich. Quote from: 1miau on August 25, 2023, 08:10:19 PM- Blockchainverbindung bleibt intakt, daher über Blockchainanalyse (relativ einfach) zu ermittelnDer Coinjoin von Wasabi ist problematisch, aber der Coinjoin von Samourai/Sparrow lässt sich nicht deterministisch zurückverfolgen. Mit jedem neuen Mix sinkt die Rückverfolgbarkeit exponentiell.Natürlich kann man beim Coinjoin (und auch beim Mixen) viele Fehler machen, wie das Vermischen von UTXO, Umgang mit Change, Nutzung eines fremden Nodes.Wenn man alles korrekt durchführt, dann sind deine Bitcoin mit Coinjoin nicht von fremden Bitcoin mit Coinjoin zu unterscheiden.Das die Bitcoin durch einen Coinjoin oder einen Mixer gelaufen sieht man immer auf der Blockchain.Quote from: 1miau on August 25, 2023, 08:10:19 PMVorteile Mixer:- gute Mixer nehmen eine Unterbrechung der Blockchainverbindung (Input / Output) vor, was ein deutlich höheres Privatsphärelevel bringt\"Der Mixer unterbricht die Verbindung zwischen mir und dem Bitcoin.Der Mixer unterbricht (nach meinem Verständnis) nicht die Verbindung zwischen dem Bitcoin und seiner Historie, oder liege ich hier falsch?Hat jemand eine Blockchainadresse eines Mixers? Ich habe auf Anhieb keine gefunden https://oxt.me/directory#Zum Vergleich, so sieht ein Coinjoin auf der Blockchain aus: https://youtu.be/mArTGt5yirAQuote from: 1miau on August 25, 2023, 08:10:19 PMDabei wäre für mich besonders die Tatsache relevant, dass bei CoinJoin stets die Blockchainverbindung erhalten bleibt, egal wie viel Liquidität es gibt.Viel Liquidität macht eine Rückverfolgung dann zwar schwieriger aber nicht unmöglich. Rückverfolgbarkeit ist bei Mixern nur bei enorm großen Summen möglich, da diese selbst auffällig sind, was durch forensische Analyse herausgefunden werden kann. Bei kleinen Transaktionen ist das nicht praktisch unmöglich.Wirlpool hat x^5 Optionen für die Herkunft der Bitcoin, wobei x die Anzahl der Mixvorgänge ist. Nach 10 Runden bist du bei 1 zu 10 Mio.Das unterstellt natürlich auch 10 Mio. unterschiedliche Inputs. Bei genügend Mixvorgängen lässt sich aber nicht feststellen, welcher Output zu welchem Input gehört.Quote from: 1miau on August 25, 2023, 08:10:19 PMNachteile Mixer:- zentralisiert, man ist abhängig vom DienstleisterWie lange speichert der Mixer die Daten, welche Bitcoin er wohin geschoben hat und wer hat Zugriff auf diese Daten?Mein Zwischenfazit:- Mixer ist einfacher für den Endanwender anzuwenden.- Was die Rückverfolgbarkeit angeht, ist der Mixer besser als eine einzige Wirlpool-Coinjoni-Runde aber schlechter als viele Wirlpool-Coinjoni-Runden.- Für buy and hold würde ich Coinjoins und Mixer sparsam verwenden, weil Coinjoins und Mixer die Verwendbarkeit von Bitcoins einschränken.- Für Spending würde ich je nach Anwendungsfall Mixer, Coinjoins oder Monero verweden.  - Wenn der Händler Monero akzeptiert, würde ich Monero verwenden, da muss man sich keine Gedanken machen.  - Wenn ich dem Menschen vertraue und ihn mag, würde ihm Bitcoin mit guter Historie (kein Coinjoin / Mixer) schicken.  - Wenn ich meine Identität und meinen Vermögensstand besser verbergen möchte, aber meinen Gegenüber mag, würde ich Coinjoins + Hopps benutzten.Ich bin kein Markting-guy, der sagen geschäftsschädigend sagen möchte „Coinjoin = gut, Mixer schlecht“, sondern ich möchte für mich selbst verstehen, wann ich welches Werkzeug anzuwenden habe. Wenn ich also bei einzelnen Punkten im Irrtum bin, lasse ich mich gerne korrigieren.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "August 30, 2023, 10:20:51 AMLast edit: August 30, 2023, 05:31:47 PM by Turbartuluk",
      "body": "Quote from: virginorange on August 30, 2023, 08:42:17 AMQuote from: Turbartuluk on August 29, 2023, 10:49:47 AMAngenommen ich habe bei Kraken jeweils ein KYC und ein Non-KYC (=Starter-)Konto. Fiat zu Kraken KYC, in XMR wandeln -> zu Wallet 1, paar Tage/Wochen liegen lassen -> zu Kraken Non-KYC, in BTC wandeln -> auf die BTC Hodl Wallet, 10 Jahre liegen lassen.Die zentralen Börsen loggen bestimmt deine IP-Adresse.Also würde ich auch unterschiedliche IPs über VPN benutzten. Nimm Mullvard oder miete dir per Bitcoin einen eigenen Server und setzt dir per Wireguard eine eigene VPN auf.Welchen Zweck/Vorteil verfolgst du bei der anonymisierung der Coins?Dein Kraken KYC Konto weis natürliche wie viel Kryptovermögen du gekauft hast und wo du wohnst, nur nicht Coins dir konkret gehören.Das mit der IP stimmt natürlich, das hab ich unterschlagen. Mullvad klingt echt spannend. Muss ich mir das so vorstellen, dass ich mit Mullvad Browser + Mullvad VPN zwei Fenster öffnen kann die unter unterschiedlicher IP laufen?Tatsächlich ist der Zweck relativ banal, ich möchte es einfach gerne mal ausprobieren um mich dann zu freuen, dass ich jetzt \"wirklich\" anonyme BTC habe. Der zweite Gedankte folgt dann aber schnell: die Börse kann anhand der Transaktionen natürlich trotzdem abschätzen wieviel ich grob habe und falls die Börse mal krachen geht könnten auch die herkunftsnachweise schwierig werden, also vielleicht doch eher nicht für die 10 Jahre Hodl wallet geeignet.Ein guter Anwendungsfall wäre aber ggf. dinge mit den BTC zu bezahlen wo XMR nicht akzeptiert wird (z.B. Mullvard VPN)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lassdas",
      "created_time": "August 30, 2023, 11:15:00 AM",
      "body": "Mullvad, nich vard.  Nutz ich schon seit Jahren, Mullvad war ja auch \"Early Adopter\", einer der ersten Webservices überhaupt, die Bitcoin akzeptiert haben.Quote from: Turbartuluk on August 30, 2023, 10:20:51 AMMuss ich mir das so vorstellen, dass ich mit Mullvard Browser + Mullvard VPN zwei Fenster öffnen kann die unter unterschiedlicher IP laufen?Wusste noch garnich, daß die jetz auch nen eigenen Browser haben, hab ich gleich mal ausprobiert und klappt prima.Client hat ne Frankfurter-, der Browser ne Berliner-IP.Also ja, kann man so machen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "August 30, 2023, 01:35:07 PMLast edit: August 30, 2023, 05:32:13 PM by Turbartuluk",
      "body": "Quote from: lassdas on August 30, 2023, 11:15:00 AMMullvad, nich vard.  Nutz ich schon seit Jahren, Mullvad war ja auch \"Early Adopter\", einer der ersten Webservices überhaupt, die Bitcoin akzeptiert haben.Quote from: Turbartuluk on August 30, 2023, 10:20:51 AMMuss ich mir das so vorstellen, dass ich mit Mullvard Browser + Mullvard VPN zwei Fenster öffnen kann die unter unterschiedlicher IP laufen?Wusste noch garnich, daß die jetz auch nen eigenen Browser haben, hab ich gleich mal ausprobiert und klappt prima.Client hat ne Frankfurter-, der Browser ne Berliner-IP.Also ja, kann man so machen.  Sorry für den Schreibfehler.... ist korrigiert. Ja genau, das hatte ich schon über Youtube rausbekommen. Frage ist ob du jetzt nen 2. Fenster aufmachen kannst was dann beispielsweise unter einer Münchner IP läuft?!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lassdas",
      "created_time": "August 30, 2023, 03:00:02 PM",
      "body": "Im Mullvad-Browser?Nee, wennde da n 2tes Fenster aufmachst und die IP wechselst, wechselt die im ersten Fenster mit auf den neuen Server (grad ausprobiert).Aber eine IP im \"normalen\" Browser und ne 2te im Mullvad-Browser sollten doch reichen, oder? Jetzt willste schon 3?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaxMueller",
      "created_time": "August 30, 2023, 05:39:43 PM",
      "body": "Quote from: lassdas on August 30, 2023, 03:00:02 PMAber eine IP im \"normalen\" Browser und ne 2te im Mullvad-Browser sollten doch reichen, oder? Jetzt willste schon 3?  Wie 3 nur? Mehr ist doch immer besser und haben besser als brauchen oder nicht?! Ich war nur neugierig... Quote from: Turbartuluk on August 29, 2023, 10:49:47 AMDann mach ich mal weiter:Angenommen ich habe bei Kraken jeweils ein KYC und ein Non-KYC (=Starter-)Konto. Fiat zu Kraken KYC, in XMR wandeln -> zu Wallet 1, paar Tage/Wochen liegen lassen -> zu Kraken Non-KYC, in BTC wandeln -> auf die BTC Hodl Wallet, 10 Jahre liegen lassen.Ließen sich bei Kraken die Transaktionen zusammenführen und wenn ja wie? (unterschiedliche Anmeldedaten der Aliase für Name, Geburtsdatum, Adresse, Mail, Tel vorausgesetzt) Aber zurück zur XMR frage... ließen sich die Transaktionen Verknüpfen wenn man Anmeldedaten und IP  verändert.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "August 30, 2023, 06:06:52 PM",
      "body": "Quote from: virginorange on August 30, 2023, 08:42:17 AMWie lange speichert der Mixer die Daten, welche Bitcoin er wohin geschoben hat und wer hat Zugriff auf diese Daten?Da wird dir vermutlich jeder Mixer-Anbieter sagen, dass sie natürlich keine Daten speichern. Dass dem aber nicht der Fall ist hat ja vor nicht allzu langer Zeit Chipmixer gezeigt, hier steht nach wie vor im Raum, dass jede Menge Daten über die Benutzer des Dienstes gespeichert und auch archiviert wurden. Was 1miau damit meint ist, dass man hier einfach vollstes Vertrauen gegenüber dem Mixer-Anbieter haben muss. Klar man sich selbst etwas besser schützen, bspw. durch die Benutzung von Tor, letztendlich bleiben mit exzessiven Nutzungsdaten deine Mixing-Vorgänge aber nachvollziehbar. Quote from: virginorange on August 30, 2023, 08:42:17 AM- Für buy and hold würde ich Coinjoins und Mixer sparsam verwenden, weil Coinjoins und Mixer die Verwendbarkeit von Bitcoins einschränken.Den Punkt würde ich so gerne nochmal herausstreichen und geht für mich auch in deine Folgepunkte über. Wenn man die Bitcoins verschenken möchte sollten die \"sauber\" und niemals durch einen Mixer gegangen sein. Der Beschenkte hat sonst höchstwahrscheinlich Probleme, die jemals gegen Geld einzutauschen (sofern er das natürlich überhaupt will) und kann dann auch den Mixing-Vorgang nichtmal belegen. Ansonsten finde ich deine Punkte sehr gut, danke für die Zusammenfassung!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}