{
  "id": "topic_5455874",
  "title": "arufox",
  "author": "arufox",
  "created_time": "June 09, 2023, 04:29:32 PM",
  "content": "The crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455874",
  "comments": [
    {
      "author": "Ultegra134",
      "created_time": "June 09, 2023, 05:30:08 PM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?Well, it depends on what you're planning to do. Bitcoin isn't the best when it comes to privacy; there are other options for this job, such as Decred, Dash, and Monero. Regarding security now, I'm not too certified to voice an opinion, but quite a few incidents have occurred with wallets being compromised, some of which were supposed to be non-custodial but turned out not to be; see the latest incidents with Atomic or Trust wallets. There are certainly ways to preserve your security, by using non-custodial, air-gapped or hardware wallets. While there's never a guarantee, taking the necessary precautions to prevent a possible compromise",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "June 09, 2023, 08:57:20 PM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?Those challenges are not easily solved, as due to the nature of this market we cannot rely on a centralized solution which will solve all of our problems, we need that each person informs themselves about the challenges ahead and learn how to protect their coins on their own, now they could give up the control of their coins and rely on a centralize solution to store their coins, however we know those solutions have huge problems and for the most part they do not resolve a single one of the challenges we have to face anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "June 09, 2023, 10:13:28 PM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMWhat many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?The crypto industry cannot overcome these challenges, these challenges are part of the industry. The best we can do is to find a way to mitigate them.For security and privacy, it can be said as below; The security of the coin network: In this aspect, the most secured coin is bitcoin and it is very much decentralized.  So, unless you talk about shitcoins which has not good security architecture Security of the coin in the custody of the investor: This is when we begin to talk about the type of wallet you use (custodial or non custodial), here we begin to talk the right use of the exchanges. We also talk about how safe your devices where you install your wallets are and more. Privacy:  It is here we talk about how the projects are about to conceal the data and information of the investor. It is here that privacy coins like Monero comes to play, also here mixers comes in for Bitcoin and more. So, every problem already has solutions in the cryptocurrency industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "June 09, 2023, 10:34:47 PM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?Here is a compilation of good threads, Security and Privacy Topics on Guides and Protection.Also you need to understand, what a $5 Wrench Attack. The world that we move right now is really dangerous, yes, we can make a lot of money out of it, but there security concerns and we should know what is the best practice in this industries. Not just criminals online but there are attacks even in real life know on those people who talk about their crypto investments. So we need to be very careful.Then you also have to know what is the difference between a custodial and non-custodial wallet, Custodial vs. Non Custodial Wallets - \"Not your keys, not your coin\" Explained.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "June 09, 2023, 11:11:54 PM",
      "body": "Quote from: Baofeng on June 09, 2023, 10:34:47 PM-snip- Not just criminals online but there are attacks even in real life know on those people who talk about their crypto investments. So we need to be very careful.It will attack us for real and many will target crypto assets if we cannot protect the privacy of our portfolio. See some news that reported that the owners of quite a lot of Bitcoin assets were targeted for robbery and murder. That means being anonymous is very important and crypto privacy must be very well maintained. If only online crime may only deal with Malware, Phishing, and some scammer methods that will try to steal the private key or seed phrase wallet that we use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Weawant",
      "created_time": "June 10, 2023, 04:34:34 AM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?There are so many solutions to security and privacy problems. Centralized exchange has made it impossible to stay anonymous while using their exchange because you're obligated to complete their KYC verification or you won't be granted your withdrawal.We have mixers that can be used to increase privacy, if you withdrew from a KYC exchange, you can send the coins directly to mixers then mixed the coins before sending it your wallets. Make sure you make use of wallets that you have your private keys as that increase privacy. KYC is the main challenge when protecting the security and privacy of a user therefore making use of exchanges that don't mandate kyc or completely ignoring centralized exchange and only make use to decentralized exchanges will solve this privacy problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "June 10, 2023, 05:00:22 AM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?In terms of what? hacks? then do used hardware wallets, make a very hard password that is not easy to break. Used 2FA or Google Authenticator.On the outside world, don't talk to anyone about how your crypto investments is, whether it's big or just enough for you. Don't trust anyone. We all know that \"byob\" - Be our own Bank so that alone will tell us to be very very careful already.And for the wallets, protect your private keys and do not divulge it to anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Epaper",
      "created_time": "June 10, 2023, 07:46:54 AM",
      "body": "I think, to address this challenge, the crypto industry needs to adopt a comprehensive approach towards security and privacy. One of the steps that can be taken is that the crypto industry must continue to develop and implement new security technologies to protect users' crypto assets. This includes the use of strong encryption, innovative identity authentication technologies, and sophisticated threat monitoring and detection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 10, 2023, 10:10:24 AM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.When we are talking about the general terms which is cryptocurrency that has brought every other digital currency into same approach, we cannot but different bitcoin in cryptocurrency that it's different from the same consequences other crypto received in terms of security and privacy matters, bitcoin is the only most secured and privacy digital currency anyone can choose to adopt, other cryptocurrencies are centralized and there's lesser security and privacy on anything centralized.Quote from: arufox on June 09, 2023, 04:29:32 PMWhat many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?Everyone of us constitute to the change in cryptocurrency, if you engage in scam or promote any related activities in scam, we should learn about bitcoin, know the difference between this and other cryptocurrencies, avoid investment on shitcoins, then take custody of our asset into our possession, avoid third party interference, avoid centralized means of holding our digital coins by being decentralized using a cold storage wallet, if all these were taken into consideration we may not have issue related to scam, security and privacy challenges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 11, 2023, 12:55:59 PM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?finance has never had privacy. even before crypto fiat was not private. it had KYC.. yep KYC is nothing new. its been around for decades before cryptothe issue with crypto is that in 2009-2013 it was defined as private property (like pokemon cards or ty beanie babies) where they were not legally defined as a recognised currencyhowever in 2013 they became legally recognised as a currency which meant that currency laws and regulations had to step in. and start messing around with licencing payment processorstrying to do DEFI, DEX and subnetwork routing wont solve this. things like localbitcoins tried it and eventually the small independent traders were getting caught by banks being told they cant just use their personal bank accounts if they were acting as a business trader of a currency. causing those traders to then need to request KYC (there were other reasons too)DEFI DEX and subnetwork routers are a new thing of the same problem which they will be hit sooner or later with the same issue localbitcoiners faced.(it takes time for regulators to catch up on how to track and hit unlicenced payment processors)however the big picture solution to privacy is thishave a system that doesnt define itself as a currency system but as a private property swap system, thus currency laws wont apply",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "June 11, 2023, 04:52:52 PM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?I am talking about the Bitcoin here so it's known that it can't be tampered or reversed after the confirmation which is the positive side of using cryptocurrency but the idea of being our own bank might be the challenge cause we are completely responsible for our holdings so if our system becomes vulnerable then attackers can assess the keys or wallets itself and drain your wallet.This is not only related to cryptocurrency but the whole privacy of all internet users so its important to create awareness about keeping our data safe while connected to online.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "June 12, 2023, 10:58:04 AM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?Dump centralized crypto exchanges as much as you can. Setup a cold wallet and \"be your own bank\".This is the only way the crypto world could overcome privacy and security problems. Not the so called \"crypto industry\".I assume that by the term \"crypto industry\" you mean all the centralized crypto companies, which are offering crypto fintech services.I couldn't care less about some centralized crypto companies having issues with the authorities, getting sued or being forced to shut down.Their problems are not my problems, because I don't have any crypto funds stored in their hot wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "June 12, 2023, 02:17:48 PM",
      "body": "Quote from: jrrsparkles on June 11, 2023, 04:52:52 PM the idea of being our own bank might be the challenge cause we are completely responsible for our holdings so if our system becomes vulnerable then attackers can assess the keys or wallets itself and drain your wallet.I feel that is the most we can do for security and also privacy, you cannot be scared about securing your own funds and then trust others to keep it for. The kind of attention you will pay for any of your things is certainly not measured same to how a person or an entity will have over yours. And if you are kind of too scared then there are options like trusting your kin or families to keep some for you rather than storing these keys on platforms that either the developer would one day compromise or some of its work will. But with multiple back or using kin and family then you know where or who must have been involved in compromising your funds. I still think the best of bitcoin and crypto currency at large is the been our own bank. Quote from: Epaper on June 10, 2023, 07:46:54 AMI think, to address this challenge, the crypto industry needs to adopt a comprehensive approach towards security and privacy. One of the steps that can be taken is that the crypto industry must continue to develop and implement new security technologies to protect users' crypto assets. This includes the use of strong encryption, innovative identity authentication technologies, and sophisticated threat monitoring and detection.The problem is all these authentication are actually available but the major problem is as technology advances with developers trying to create extra layers of security so will scammers, there is no way beating this. The thing should be people should seek out adequate knowledge in everything they want to get into and shouldn’t be in a rush to do things like installing or updating apps, verify them diligently. Even if people use encryption they would still get compromised if they aren’t careful. Take off your keys off online services no matter how hard it is for you to be your own bank. People should also be less greedy because most of the major scams are through phishing which are followed through by people that want to earn through faucets or airdrops",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "June 12, 2023, 07:23:04 PM",
      "body": "Security and Privacy are very different things that needs to be taken care of. Security needed by everyone, it is something we need to protect our funds and I understand that is going to be to that easy, but we are handling it some way or another. I wouldn't expect it to do too well, obviously it is not going to be easy but that doesn't mean that we are going to end up with some trouble, it will take a while.I think it is quite important to remember that if you are giving your crypto to someone, there is a good chance you will never see it and that is the scary part about it, always keep remembering that. I know that it takes time to adjust in this market but that is what we need to do and that is what we will need for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "June 12, 2023, 07:44:11 PM",
      "body": "There's no privacy worth protecting when you use centralized platforms - almost all of them require you to pass KYC. If you care about privacy - then you should use decentralized exchange that has good reputation. The advent of decentralized exchanges is how some developers have handling this problem.Apart from that - the mixer is made to make it easy for you to get some privacy for your coins. But recently the government has closed some of its services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "June 12, 2023, 11:10:38 PM",
      "body": "In terms of security, it's always best to note that the known quote that we've got which is \"if you don't hold the keys, you don't own the coins.\"And about privacy, we should start it from ourselves like being lowkey and not too noisy of what you've been doing or investing or holding unless someone asks you what are those. Physical concern of privacy like avoiding wrench attacks which has been on the news and even took lives of those holders/investors. The lesson of starting to your own by protecting your privacy and not being too vocal about it is what should everyone does. The next one is about the wallets that we use, if it's an unknown wallet and you're still optimistic about it you have to make sure that you've done enough research before using it as your personal wallet or cold storage. Too many stories have been said that they've used an unknown wallet and then eventually someone has hacked them or their funds were no longer there and that's because there are other people that has access to that wallet that they've downloaded randomly. Use known desktop wallets for protection and also hardware wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wrathofcoins",
      "created_time": "June 12, 2023, 11:38:49 PM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?First of all, you had been here for quite a long time, you can put more effort when you created a thread.Quote from: franky1 on June 11, 2023, 12:55:59 PMQuote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?finance has never had privacy. even before crypto fiat was not private. it had KYC.. yep KYC is nothing new. its been around for decades before cryptothe issue with crypto is that in 2009-2013 it was defined as private property (like pokemon cards or ty beanie babies) where they were not legally defined as a recognised currencyhowever in 2013 they became legally recognised as a currency which meant that currency laws and regulations had to step in. and start messing around with licencing payment processorstrying to do DEFI, DEX and subnetwork routing wont solve this. things like localbitcoins tried it and eventually the small independent traders were getting caught by banks being told they cant just use their personal bank accounts if they were acting as a business trader of a currency. causing those traders to then need to request KYC (there were other reasons too)DEFI DEX and subnetwork routers are a new thing of the same problem which they will be hit sooner or later with the same issue localbitcoiners faced.(it takes time for regulators to catch up on how to track and hit unlicenced payment processors)however the big picture solution to privacy is thishave a system that doesnt define itself as a currency system but as a private property swap system, thus currency laws wont applyI agree with you in most of your statement, the only problem i see its..... the \"new\" crypto guys who doesnt want to understand basic question and think all its beautifull and easy, and also think KYC was only invented to destroy crypto.When you ask them the question , ok now go an buy a house in the real life with the money made in crypto without having a job and without making a laundry enginering of money.Yes, they cant provide an answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "June 13, 2023, 04:05:50 AM",
      "body": "Quote from: arufox on June 09, 2023, 04:29:32 PMThe crypto market has experienced rapid growth in recent years. However, behind this tremendous potential lie serious challenges related to security and privacy.What many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?If someone is too insecure regarding their privacy and security after joining the cryptocurrency market, they should simply use exchanges that don't require KYC or are decentralized, use wallets that give them access to their private keys, and use or hold cryptocurrencies that are 100% decentralized like Bitcoin, otherwise, it will become a bit difficult for them to protect their privacy and security.It is totally up to you how much you can protect yourself whether it's about the security of your coins or the projection of your personal information and documents. Use the services and platforms that provide best security and protection to avoid any issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "June 13, 2023, 09:20:24 AM",
      "body": "Quote from: rby on June 09, 2023, 10:13:28 PMQuote from: arufox on June 09, 2023, 04:29:32 PMWhat many people are asking is what are the main challenges faced in protecting the security and privacy of users in the crypto market? How can the crypto industry overcome these challenges?The crypto industry cannot overcome these challenges, these challenges are part of the industry. The best we can do is to find a way to mitigate them.For security and privacy, it can be said as below; The security of the coin network: In this aspect, the most secured coin is bitcoin and it is very much decentralized.  So, unless you talk about shitcoins which has not good security architecture Security of the coin in the custody of the investor: This is when we begin to talk about the type of wallet you use (custodial or non custodial), here we begin to talk the right use of the exchanges. We also talk about how safe your devices where you install your wallets are and more. Privacy:  It is here we talk about how the projects are about to conceal the data and information of the investor. It is here that privacy coins like Monero comes to play, also here mixers comes in for Bitcoin and more. So, every problem already has solutions in the cryptocurrency industry. Crypto industry definitely CAN tackle these issues, just not yet as there are no tools ready for that. But there's going to be. Privacy trough ZK smart contracts alone and ZK based ID will guarantee that information will be private, and can in fact be a holy grail for GDPR / privacy laws. These are currently being made, they are just not ready for big adoption yet.I am thinking that by security, OP means investor's security as user is always responsible for themselves. And it's really hard to do anything for the user safety on this. Users will be always the weakest link and vulnerable for social engineering, thefts or hacks. Some coins could technically deal this in token issuancer level and make transactions reversable. But i am not sure what that would look like or what would it do to the ideology of decentralization and permissionless transactions.These immutable transactions most likely won't fly with regulators when we are talking about altcoins that had an ico, ido or any kind of sale. It's likely that demanding that user is responsible of his tokens (self custodity) will be against consumer protection laws but it isn't yet being dealt with.Regulators can't really do anything about fairly distributed POW coins, or coins that have achived a certain level of decentralization, except maybe they can ban them from CEXes, but teams of funded coins could technically be sued later on about this. I am actually baffled why they haven't yet used this type of attack yet. Maybe it's coming later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}