{
  "id": "topic_5430104",
  "title": "yahoo62278",
  "author": "yahoo62278",
  "created_time": "December 19, 2022, 05:08:07 AMLast edit: February 10, 2023, 09:03:58 AM by yahoo62278",
  "content": "As some of you know, I have been dealing with a lot in my life over the past 2 years. Honestly, I have been dealing with it a lot longer, but the last 2 years have been where it has gotten a little scarier than the rest. Let me start with a little backstory. I don't want to get too deep into it, but 1996 I'm a 17-year-old high school kid trying to figure out this thing called life. My mother had been feeling ill and decided she needed to go get herself checked out at the hospital. Little did I know That was 1 of the last times I would see her. She went from getting checked out to being transported to a larger hospital a little over an hour away where they had the appropriate doctors to diagnose her condition. Long story short, she had heart failure along with an enlarged heart. A couple months later she was gone.....Now fast forward to 2017. I had made it to almost 40 years old and had started to make a name for myself here on the forum. I also started feeling a little different as far as health went. I had noticed my heart was always racing without anything to make that happen. Wasn't doing drugs, wasn't drinking heavily, nor was I abusing any pills. I decided to go get myself checked out. I was diagnosed with heart failure myself. At the time I had piss poor insurance and I feel like some doctors treat patients differently based on whether they do or do not have insurance and the type of insurance they have. If you're a rich person with great insurance or cash, you're gonna get the best treatment. If not, well I feel like you get shit on. My Doctor at that time did the bare minimum. Ran as few tests as possible and made me feel that I wasn't worth his time. I went to my appointments like I should and took the medicines as prescribed but in the end, I decided he wasn't doing much to help. Eventually I just said screw it and stopped going. (not the smartest thing to do BTW)Now let's fast forward to 2021. In March of 2021 I had gone into the hospital because I could not breathe. I felt like I was drowning and gasping super hard for air. Somehow, I had dealt with that for 2 weeks until I decided I needed to go to the Emergency room, or I was gonna die. Within a half an hour of arriving there, they had taken x-rays and seen my heart was surrounded by water and they needed to get the water off my heart ASAP. I ended up being hospitalized for a week and given water pills and oxygen until I pissed out 9 liters of water. Needless to say, I was pretty close to death by being an idiot and not getting checked out sooner. The good part of that stay in the hospital is I was given a new heart doctor. During my stay they had ran multiple tests, 1 of which was called a left heart catheter. That's where they open your wrist (sometimes groin) and send a scope through your artery into your heart and take a look around. You are completely awake for this test and it's weird as fuck. They got some more information about my condition and made some changes to my daily meds that doctor #1 prescribed years earlier. My new doctor was leaving the hospital and passed me off to another doctor. He was not happy with all the tests that had been done to this point, so he ordered what is called a TEE Also known as a Transesophageal echocardiogram. This is basically an ultrasound of my heart. They shove a tube down your throat and take pictures of your heart. This test I was not awake for, but this test found an important factor in my case. It had found that I was born with a Bicuspid aortic valve. Most of the world is born with a Tricuspid valve. July of 2021 is when all this was found. I had been getting regular CT tests as well and they know that I had an aortic aneurysm that was likely caused due to the faulty valve I was born with. By October of 2021 I was scheduled for open heart surgery. I don't think I've been more scared of anything in my life. It's not a small surgery by no means and definitely lots of things that can go wrong where a patient may not make it through. Not to mention 1 hell of a long recovery process. They opened me up and cut out most of my aorta and replaced it with medical tubing. Along with cutting out the faulty valve and replacing it with a mechanical valve. I thought that this surgery was going to happen, and everything was going to be fine. I just had to wake up and focus on the healing process. Apparently, I was incorrect. I took the meds and tried rehabbing as best I could, but I always seemed to be tired. My doctor had exhausted all that he knew to test and decided to send me to a heart specialist. While going through this specialists' tests multiple times, we had found that while in fact the first surgery did save my life, it did not fix all my issues. My heart had already been damaged to the point that it was not going to heal completely, and I was going to need a transplant. So, for the past 6 months it seems like I have had anywhere from 1-3 appointments per week. Running test after test and getting vaccines. It's a very lengthy and costly process. Finally, after all this time I have jumped through enough hoops and have been listed on the heart transplant list at status 4.  I just got the news Thursday. I also will be admitted into the hospital early January and be a status 2 recipient on the list. This means on average I will have a 2-4 week wait for my 2nd heart surgery. Let's hope I survive this surgery, and everything is fine this time. I'm obviously going to have many obstacles to deal with at that time, but I'm optimistic that I'll be able to get through. Insurance covers some of the costs of the testing and medicines, but not gas, food, hotel rooms if overnight stays, or lost wages from my wife taking days off. I'm not asking for donations or anything, but I do have a bitcoin address in my profile if anyone wants to help out they can. I have been communicating with a few on here that know my story. Jayce, condoras, hopenotlate, and a couple others can confirm this all to be true. Why post this you ask? The main reason is to show you that even though some of you think I am lucky and probably live a rich and lavish life, I am human and have everyday problems like all of you. If you'll notice, my issues are hereditary meaning passed on from my family. I urge all of you to get checked and get your kids checked. Whether it be mental health or physical health, it is very important to make sure you are in the best condition you can be in. Don't put it off, get tested ASAP.  Not all issues will be obvious and can only be found through testing. If this story helps 1 person I will feel it was worth it to share my story.  I hope anyone who takes the time to read all of this will also take the time to make an appointment and get checked. DONATION ADDRESSES",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430104",
  "comments": [
    {
      "author": "Shaha98",
      "created_time": "December 19, 2022, 06:31:30 AM",
      "body": "I couldn't stop myself from crying as I read the entire story that you have presented in a small sample of the many things that happened in your life.  Your mother's illness and passing away forever is one of the first unexpected true events in life.  Then some unexpected events started in your life.  It is heartbreaking that you have lived through so much suffering due to illness at various times in your life.  Even if you don't know the many heartbreaking stories that happened in your life, the number of incidents that you have highlighted today will really bring tears to everyone's eyes.  Although I am unable to help you financially, I pray from the bottom of my heart to God for a speedy recovery.I have been working under you for the last two weeks on a signature.  I read your post today and decided to send you my one week payment to your wallet account.  Even though this payment will be nothing for your treatment, it will be a great comfort to me that my little help will be used for your treatment.  Finally, I wish you all the best and health.God bless you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "December 19, 2022, 07:13:00 AM",
      "body": "Quote from: Shaha98 on December 19, 2022, 06:31:30 AMI couldn't stop myself from crying as I read the entire story that you have presented in a small sample of the many things that happened in your life.  Your mother's illness and passing away forever is one of the first unexpected true events in life.  Then some unexpected events started in your life.  It is heartbreaking that you have lived through so much suffering due to illness at various times in your life.  Even if you don't know the many heartbreaking stories that happened in your life, the number of incidents that you have highlighted today will really bring tears to everyone's eyes.  Although I am unable to help you financially, I pray from the bottom of my heart to God for a speedy recovery.I have been working under you for the last two weeks on a signature.  I read your post today and decided to send you my one week payment to your wallet account.  Even though this payment will be nothing for your treatment, it will be a great comfort to me that my little help will be used for your treatment.  Finally, I wish you all the best and health.God bless you. Hey thanks for reading and hopefully the events of my life help you to make sure you are always taking care of your health. Please do not send me any funds. If someone is well off and can afford it, i'm happy to accept help, but I do not want anyone suffering to help me. I will make what I have work regardless of the circumstances.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "December 19, 2022, 08:15:44 AM",
      "body": "@yahoo62278After reading your whole topic carefully, people actually don't value health to have time.  Health is the precious wealth of man, there is no one in the world who does not have good health to live in the world.  After reading your complete story, I realized that no matter how much wealth there is in life, there is no wealth as valuable as health.  After I read the whole post I pray to god we need a valuable forum manager like you.  Your survival is very important to bitcoin forum.  You have given so much to this forum, not that we can't give you a little help in return.  I urge every member of the forum to read your life story and learn a lot and help each other in danger.  Finally I end by wishing you good health and long life.Quote from: Shaha98 on December 19, 2022, 06:31:30 AMI have been working under you for the last two weeks on a signature.  I read your post today and decided to send you my one week payment to your wallet account.  Even though this payment will be nothing for your treatment, it will be a great comfort to me that my little help will be used for your treatment.  Finally, I wish you all the best and health.God bless you.Like you, we should all be focused on helping others at their peril like this.  Our small contribution can lead to great benefits for others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "December 19, 2022, 08:39:01 AM",
      "body": "Hey buddy, I'm so sorry to hear about your condition. I had no idea you were dealing with anything so serious. It can be very difficult and overwhelming to deal with such a serious illness, especially considering that you lost your mother at a young age. I'm sorry about that too. Please know that my thoughts are with you and your family during this difficult time. It's important to remember that you are not alone and that there are people who care about you and want to support you. Of course, I'll try to help in any way that I can. Please don't hesitate to reach out if you need any additional support. Hang in there!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "December 19, 2022, 10:51:32 AM",
      "body": "Quote from: yahoo62278 on December 19, 2022, 05:08:07 AMThey opened me up and cut out most of my aorta and replaced it with medical tubing. Along with cutting out the faulty valve and replacing it with a mechanical valve. I thought that this surgery was going to happen, and everything was going to be fine. I just had to wake up and focus on the healing process. Apparently, I was incorrect. I took the meds and tried rehabbing as best I could, but I always seemed to be tired.Dear Yahoo62278, I understand the current situation you would have been right now but i want to let you know that there's nothing above the power of change, which means there is certainty that the Egyptian (ailment) which you see today you can see it no more only by your \"Faith\" I don't really know the religion you may practice but i think it's time to practice the supernatural when the natural is failing, I don't want you to feel discouraged or dismayed but to remain steadfast in what you believe which is the report of what the word of God says about you and not what the doctors said, i think it's time to be more closer to your God in prayers for this kind of perfection in healing with Faith, pray and never give up on anything, some have passed through this challenges before and have escaped and yours as well can end up in a testimony with your believe.I don't want this to sound like am preaching to you but just receive it as an advise to cheer you up that you've got hope in your creator for the supernatural replacement of certain organs and conditions for good, i will also advise that you monitor your diets which i believe you would have been doing that for long but never relent, avoid processed or casinogenic food consumption, eat fresh food and take enough fruits, then you will need to tune your mind to the direction of being anticipated for a supernatural healing from above, honestly your kind heart and gesture towards the forum's progress and impact in numerous ways whereby members participate in campaigns you manage and your divers consideration to others favour will also yield and triggered your own healing perfection, because many also depends on you for their living in earnings from campaigns you managed.I wish you a quick recover and a supernatural restoration of all damaged cells, tissues, organs or systems from your body and wish you best of luck in this recovery process of healing perfection, please get well soon and have faith it is settled already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jayce",
      "created_time": "December 19, 2022, 11:20:19 AM",
      "body": "I tell you guys, this man is not only a good manager, but also a great life advisor with his own life experiences. We have been discussing many things since long time ago, and his suggestions are very helpful especially when I was breaking up with gf lol. It's worth of your time to discuss everything especially when it's about life. He might sound a bit rude to some people but I think he is just being straight to the point. I was very shocked when he told me about his heart problem for the first time but his vigor motivates me for sure. He takes the meds and goes to the hospital regularly, and in the same time he is still managing campaign. One of the strongest people I've ever known on this forum. Bitcointalk is not just a place to get info about crypto, but also a place for us to care for each other.The lesson from this post is, I agree with yahoo, we have to take care of ourselves, and check your health, both of physical and mental, anytime you can. If you have a healthy body today, you still need to invest for your health, e.g. doing sports, eating healthy food, having enough rest time, and getting insurance. You can still enjoy life though but in responsible way.Hey Yahoo, you can get through this. Like I said many times, with that new heart, you could be as strong and cool as Tony Stark. Don't forget to make it glows this time  We are with you man.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "December 19, 2022, 12:06:45 PM",
      "body": "@yahoo62278We know him not only as a manager, we know him as an efficient and intelligent person.  He is very punctual and likes to do his work on time.  He is a good advisor and gives various advices.  He is an efficient and intelligent member of the forum.  He is much needed in the forum, so we should all pledge to stand by him in danger.  A wise, skilled and patient person like him is considered not only a member of the forum but also an asset of the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "December 19, 2022, 12:18:04 PM",
      "body": "I have read this topic and paid attention to it, it is very sad to know that your life is undergoing very serious treatment, to be honest, I just found out that you are experiencing big problems in your life, especially in health, I hope for the best for you, hopefully you can go through everything, Best wishes for you yahoo62278 .Health is very important, so we must routinely check our health, the most important thing is to maintain a pattern in which we avoid dangerous diseases.I will not stay silent when I am with my family, especially my child, when there are even the slightest symptoms I have to see a doctor and make sure that everything is fine and recovers quickly because I don't want it to happen again, basically I remember my parents. the man had a heart attack and he couldn't be saved, that's what traumatized us, we still have to take good care of our health patterns.I think you will be more supported to go through all of this.Get well soon friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "December 19, 2022, 12:19:45 PM",
      "body": "Quote from: yahoo62278 on December 19, 2022, 05:08:07 AMI also will be admitted into the hospital early January and be a status 2 recipient on the list. This means on average I will have a 2-4 week wait for my 2nd heart surgery.Damn that's a lot to take in! I hope to see you around in February, and I wish you the very best!QuoteI am human and have everyday problems like all of you.If there's one thing I've learned over the years, it's that everyone has their problems (some much worse than others), and barely anyone talks about it. It sucks. Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "December 19, 2022, 12:20:58 PM",
      "body": "I can't say much but you are a survivor and can do it. I'm sure you will recover and be able to do your activities better. You can focus on your healing. We pray for your healing and that of your family.Note: Health is most important above all, even more than BTC. The advice from Yahoo is for all of us and I hope we can stay healthy, especially for Yahoo. Get well soon, buddy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "December 19, 2022, 12:34:56 PM",
      "body": "I can relate to your issue since I once diagnosed with some serious health condition and ignored until I can’t handle. I’ve been on a point that I already accepted my fate and just leave the decision to God if he will give me more time or not. I know this sound like a religious preach but praying is always working in times you feel that you can’t make it. It’s good to have faith to hold on rather than become on panic or nervous state on what’s to come.I work with you a lot of times in the past and I witness how you progress you career here in the forum. You persevere to achieve all the credentials that you have right now and I’m sure you can do this kind of progress on your health battle. Even though we are not family but I will include you on my prayer for your speedy recovery. Godbless men!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "December 19, 2022, 12:37:05 PM",
      "body": "Quote from: yahoo62278 on December 19, 2022, 05:08:07 AMWhy post this you ask? The main reason is to show you that even though some of you think I am lucky and probably live a rich and lavish life, I am human and have everyday problems like all of you. If you'll notice, my issues are hereditary meaning passed on from my family. I urge all of you to get checked and get your kids checked. Whether it be mental health or physical health, it is very important to make sure you are in the best condition you can be in. Don't put it off, get tested ASAP.  Not all issues will be obvious and can only be found through testing. If this story helps 1 person I will feel it was worth it to share my story.  I hope anyone who takes the time to read all of this will also take the time to make an appointment and get checked. Thank you so much yahoo62278 for the very important message you gave us in the midst of your current situation.Honestly, I really want to help you with all the things you have told me even though you said that you don't want to ask for help from everyone here. In the meantime, the only help I can give you is prayer.As a Muslim I will pray with a sincere heart that God will give you strength to face this process. If I have any assets saved up, I will definitely send them to you. But the reality is that I have absolutely no assets to save because all this time I have been struggling to fulfill some of the daily needs of the people I love the most, namely my wife, two children and two parents.I don't know you as intimately as some of the names you mentioned, but I feel that you are the closest person to me with a unique character.My tears welled up as my fingers typed the keys letter by letter.May Allah give you the best.I promise I will carry out your message to the people I love.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "December 19, 2022, 12:43:50 PM",
      "body": "Quote from: LoyceV on December 19, 2022, 12:19:45 PMQuote from: yahoo62278 on December 19, 2022, 05:08:07 AMI also will be admitted into the hospital early January and be a status 2 recipient on the list. This means on average I will have a 2-4 week wait for my 2nd heart surgery.Damn that's a lot to take in! I hope to see you around in February, and I wish you the very best!It hurts to accept such bad news but lately unfortunately we are seeing it frequently. Long time ago I woke up and saw the plead from Bruno, ever since few members died (RIP all). Now this. We all are ageing too fast. yahoo62278, you already proved yourself a fighter since your mother left you. You kept fighting for your health and won in every major life threatening situation. You are going to win this one too brother. No matter which corner of the world you are reading it, your brother is next to you always and is going to pray for your quick recovery. Love and pray for you from me and my family.My respect and love to your wife too. I know it's not long you got married to her after long years of relationship. She is a brave woman otherwise she was not going to tie up her life with you knowing everything about you. Very few people are blessed with such wife and I am one of them too.May God and the angels are looking after you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Murat",
      "created_time": "December 19, 2022, 12:59:53 PM",
      "body": "Damn, I am so sad after reading this  wishing you a very healthy recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "December 19, 2022, 01:05:33 PM",
      "body": "You were never born to lose ! All our prayers are with you brother @yahoo. Despite of any religion, god is with you, watching from a corner.Quote from: BitcoinGirl.Club on December 19, 2022, 12:43:50 PMWe all are ageing too fast.Age is just a number, its all about living life to the fullest! I don't mind living a short but \"happy\" life in the end!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jayce",
      "created_time": "December 19, 2022, 01:10:59 PM",
      "body": "Quote from: BitcoinGirl.Club on December 19, 2022, 12:43:50 PMIt hurts to accept such bad news but lately unfortunately we are seeing it frequently. Long time ago I woke up and saw the plead from Bruno, ever since few members died (RIP all). Now this. We all are ageing too fast. Nah this one is different. He will be in better shape than ever on February.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "December 19, 2022, 01:23:24 PM",
      "body": "Quote from: yahoo62278 on December 19, 2022, 05:08:07 AMIf this story helps 1 person I will feel it was worth it to share my story.  I hope anyone who takes the time to read all of this will also take the time to make an appointment and get checked. Sometimes we in developing nations feel that we are having a very bad time because of various economic challenges but I have learnt today that a health man is far better than luxury or wealth. I might not have all the basic needs of life currently but I am grateful that I am healthy today. It is very painful that your illness is not as a result of your bad behavior, but thank God you took it in good fate. I am a Christian that believes the intervention of a Supernatural force that can give healing. I will surely put you in my prayers and I believe that the surgery would be successful. One of my New Year resolution would be to always check my health status periodically. This is a trying face of your life, I am sure your would overcome and this thread would be updated and everyone would be saying Congratulations and not RIP.    Thank you or sharing your story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "December 19, 2022, 02:12:05 PM",
      "body": "@yahoo62278, I can't say anything else after reading your medical history with the diagnosis of left ventricular systolic heart failure that you are currently suffering from, this is the hardest blow and trial for you and your family, what's more you just got married as I remember a few years ago, you said in this forum.I can only pray for you to be healthy and given fortitude for your family in facing all of this, what you are experiencing is the toughest trial and illness in some cases, usually heart failure is caused because we drink a lot of alcohol or methamphetamine, cocaine and poison, but you say you don't do it all, other factors like family history are also the main thing, usually hereditary up to the next 3 generations, I can only pray for you that the surgery goes well and you are safe and can see you here longer, @yahoo62278 please keep your diabetes and high blood pressure stable before the doctor performs your heart surgery.I'm quite sad to read your resume, heart failure due to heredity, god took, away heart failure @yahoo62278 and made it easy for all his life affairs, amen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anguwa",
      "created_time": "December 19, 2022, 02:13:47 PM",
      "body": "It always takes me too long to read some articles because I get discouraged with some, but this one speaks to my heart. First and foremost, thank you for the advice to get tested as soon as possible; your story was heartfelt and deserves proper condolences; I wish you the best as you prepare for your transplant. I may not be able to contribute financially, but I will send my best wishes and prayers. I hope the surgery went well, Amen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}