{
  "id": "topic_5406924",
  "title": "mikebj22",
  "author": "mikebj22",
  "created_time": "July 20, 2022, 01:28:50 AM",
  "content": "So does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406924",
  "comments": [
    {
      "author": "cryptoaddictchie",
      "created_time": "July 20, 2022, 01:47:47 AM",
      "body": "Quote from: mikebj22 on July 20, 2022, 01:28:50 AMSo does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?Yes bitcoin has it own blockchain and altcoin too but there are instances that some altcoins reside on other blockchain since they dont have their own and only using such platform with supported smart contract tokenization until they can make their own but some really prefer to have a token only while launching their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 20, 2022, 01:50:39 AM",
      "body": "Coins have their own independent blockchain, that is why they are called coins. Tokens make use of blockchain of a coin, just like USDT built on omini layer (Bitcoin blockchain), Ethereum blockchain (USDT ERC20) or on Tron Blockchain (USDT TRC20). Or NFTs that are non fungible tokens built on a coin blockchain. Or DeFi too which are all tokens built on a coin blockchain.Bitcoin is a coin and not a token, it has its own Blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 20, 2022, 03:38:38 AM",
      "body": "No, not every cryptocurrency has its own blockchain. The big majority of altcoins don't have their own blockchains. They're only built on a blockchain that they don't own. And while the thousands and thousands of cryptocurrencies are generally called coins, they're actually not in the strictest sense of the word since they're actually just tokens. Most developers, who are nothing but greedy opportunists, are developing and running projects in the most convenient or easiest way possible. And a number of blockchains such as Ethereum, Binance, Solana, or Tron's are providing them that platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "July 20, 2022, 06:01:48 AM",
      "body": "Quote from: mikebj22 on July 20, 2022, 01:28:50 AMSo does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?Yes and No.Yes, because every cryptocurrency executes its transaction with the help of blockchain.No, because in crypto we have coin and token.Coins are cryptocurrencies that have their own blockchain. An example is BTC, ETH, BNB, LTC, TRON, SOL, etc.Token are cryptocurrencies that rely on another cryptocurrency blockchain it executes their transaction. An example is USDT, CAKE, UNI, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 20, 2022, 09:04:30 AM",
      "body": "Quote from: suzanne5223 on July 20, 2022, 06:01:48 AMQuote from: mikebj22 on July 20, 2022, 01:28:50 AMSo does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?Yes and No.Yes, because every cryptocurrency executes its transaction with the help of blockchain.No, because in crypto we have coin and token.Coins are cryptocurrencies that have their own blockchain. An example is BTC, ETH, BNB, LTC, TRON, SOL, etc.Token are cryptocurrencies that rely on another cryptocurrency blockchain it executes their transaction. An example is USDT, CAKE, UNI, etc.I understood that you know the difference between coins and tokens, but the answer is only no because some cryptocurrencies do not have their own different blockchain, just like you later said. We can not say yes because each cryptocurrency execute its own transaction, tokens still rely on the blockchain of the coin which was used to make the token to be existing, the token even rely on the coin as fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FERDYs",
      "created_time": "July 20, 2022, 09:42:22 AM",
      "body": "The confusion comes from websites and blogs that do not use the term coin and call it as native token instead.A good example is Investopedia which calls ETH as the native token of Ethereum blockchain and defines erc-20 as smart contract tokens.Taken from https://www.investopedia.com/news/what-erc20-and-what-does-it-mean-ethereum/\"What's the Difference Between ETH and ERC-20?Ether (ETH) is the native token used by the Ethereum blockchain and network as a payment system for verifying transactions. ERC-20 is the standard for creating smart contract-enabled fungible tokens to be used in the Ethereum ecosystem.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "July 20, 2022, 10:42:07 AM",
      "body": "Quote from: FERDYs on July 20, 2022, 09:42:22 AMThe confusion comes from websites and blogs that do not use the term coin and call it as native token instead.A good example is Investopedia which calls ETH as the native token of Ethereum blockchain and defines erc-20 as smart contract tokens.Taken from https://www.investopedia.com/news/what-erc20-and-what-does-it-mean-ethereum/\"What's the Difference Between ETH and ERC-20?Ether (ETH) is the native token used by the Ethereum blockchain and network as a payment system for verifying transactions. ERC-20 is the standard for creating smart contract-enabled fungible tokens to be used in the Ethereum ecosystem.\"There is no theory that makes it absolute to describe other coins on blockchain as native tokens, though bitcoin is unique and exclusive, it is a coin and doesn't support smart contracts like other chains. However, the Native token describes the chains that are EVM compatible, not really the coin of a blockchain. Example: KCS token is supported on Ethereum as ERC and Kucoin chain(Kuchain) as a native token because it is EVM compatible, this helps to tell users when making transactions and knows the type of token and the chain they are interacting with, the same with other layers one blockchain like Matic (now polygon), Fantom etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "July 20, 2022, 03:40:22 PM",
      "body": "There are exchanges that creates their own tokens and it's like that they've made their own network for it. So, transactions doesn't have to go through a complicated process and it's like from point A to point B in an instant because it's happening inside their network/chain.I guess you've got several good answers already and that will make you have an idea on how tokens, coins and blockchain works.Also, I think this discussion belongs to Altcoin Discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "July 20, 2022, 04:36:12 PM",
      "body": "Bitcoin does have its own Blockchain but some altcoin doesn't have their own network or Blockchain which every record of a transaction is recorded. Take a look at some tokens where it rely on Ethereum network to use the token. Erc20 are token that uses Ethereum network therefore some tokens doesn't have their own Blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 20, 2022, 04:54:21 PM",
      "body": "Quote from: nakamura12 on July 20, 2022, 04:36:12 PMtherefore some tokens doesn't have their own Blockchain.Not \"Some tokens\", but tokens in general don't have their own Blockchain, that's why they are called tokens, immediately a token has its own blockchain, it converts and become a coin.I think _act_ already gave the perfect answer to the question op asked.Tokens are crypto assets that do not have their own Blockchain, this means they are dependent on another crypto asset's blockchain to run and carry out transactions.While on the other hand...Coins are crypto assets that have their own Blockchain and doesn't depend on any other crypto asset to run and carry out transactions, they are independent and on their own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "July 20, 2022, 07:16:59 PM",
      "body": "Quote from: Fivestar4everMVP on July 20, 2022, 04:54:21 PMNot \"Some tokens\", but tokens in general don't have their own Blockchain, that's why they are called tokens, immediately a token has its own blockchain, it converts and become a coin.I think _act_ already gave the perfect answer to the question op asked.right my bad, a token with its own Blockchain is considered as coin as you have said or altcoin. Altcoins do have their own network right?. I have explained it wrong and yes I am aware that tokens are created using an existing network like Ethereum that you can utilize smart contracts, which is used to run defi and NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "July 21, 2022, 03:22:50 PM",
      "body": "Quote from: _act_ on July 20, 2022, 09:04:30 AMQuote from: suzanne5223 on July 20, 2022, 06:01:48 AMQuote from: mikebj22 on July 20, 2022, 01:28:50 AMSo does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?Yes and No.Yes, because every cryptocurrency executes its transaction with the help of blockchain.No, because in crypto we have coin and token.Coins are cryptocurrencies that have their own blockchain. An example is BTC, ETH, BNB, LTC, TRON, SOL, etc.Token are cryptocurrencies that rely on another cryptocurrency blockchain it executes their transaction. An example is USDT, CAKE, UNI, etc.I understood that you know the difference between coins and tokens, but the answer is only no because some cryptocurrencies do not have their own different blockchain, just like you later said. We can not say yes because each cryptocurrency execute its own transaction, tokens still rely on the blockchain of the coin which was used to make the token to be existing, the token even rely on the coin as fee.Despite your explanation, I believe you still don't understand that the OP question is a vice-versa situation. Therefore, the answer is still yes and no.Every cryptocurrency has a blockchain which they use to execute its transaction this stand for \"Yes\".While some cryptocurrencies rely on dApps using the smart contract and a frontend user interface to create their token which will operate on another project blockchain. This stand for \"No\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "July 28, 2022, 01:51:26 PM",
      "body": "Quote from: mikebj22 on July 20, 2022, 01:28:50 AMSo does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?No, Not every cryptocurrency has it own blockchain. The one that has it's own Blockchain generally called Coin, the one that do not have their own blockchain called Token. The one that does not have their own blockchain use the blockchain of crypto that run smart-contract, some of the are Ethereum, Binance Smart Chain, Stellar. etc. Some coin that initially does not have it's own blockchain, later on their development end up creating their own blockchain and then migrating their project to their own blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "July 28, 2022, 02:13:17 PM",
      "body": "Quote from: mikebj22 on July 20, 2022, 01:28:50 AMSo does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?Majority, everyone has it's own network, so called blockchain, but it has all the features, immutable and very very hard or next to impossible to hack unless some entity will pull what we call a 51% attack, but it is not feasible in the long run.There could be crypto that don't have a blockchain but it's more of an exception than a rule though. One advantage of a crypto having it's own blockchain is obviously the trust, so it's better for them to have their own blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ilovealtcoins",
      "created_time": "July 28, 2022, 02:14:20 PM",
      "body": "Quote from: mikebj22 on July 20, 2022, 01:28:50 AMSo does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?Bitcoin has its own blockchain and altcoins do not all have their own blockchain. Coins that have their own blockchain are often called coins, those that do not have their own blockchain and live parasitically on another blockchain are often called tokens. most coins on the market mostly exist as tokens, the ones that actually have their own blockchain are really not many.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "July 28, 2022, 03:30:51 PM",
      "body": "Quote from: mikebj22 on July 20, 2022, 01:28:50 AMSo does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?The blockchain that used by bitcoin was different than altcoin. Some altcoins have similar blockchains, i meant the blockchain that compatible from one to the another blockchain. Ethereum has its first layer blockchains and there are some altcoins that develop the layer 2 and 3 blockchains that compatible with ethereum. Mostly of altcoins were building as assets that used blockchains that owned by the coin. You must know the difference between the token and coin. Some altcoins have their own type of blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mosharafhh",
      "created_time": "July 28, 2022, 05:02:12 PM",
      "body": "Not every crypto-currency have their own blockchain!  Crypto currency can built in very simple method but blockchain technology is not that easy to built its need good and intelligent developer but crypto can launch by a common person who can built it easily!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 28, 2022, 05:23:32 PM",
      "body": "I can answer this question in two ways. Both yes and no. There are cryptocurrencies with their own infrastructure. However, the majority of them try to create their own network in some way by being established on the infrastructure of their own blockchain altcoins. The majority of them try to maintain their existence by issuing their own crypto money using the infrastructure of these chains.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "July 28, 2022, 08:04:41 PM",
      "body": "Quote from: mikebj22 on July 20, 2022, 01:28:50 AMSo does every cryptocurrency including bitcoin and altcoins have their own different type of blockchain?Not every crypto project of the thousands that are listed on coinmarketcap or coingecko or whatever has it's own blockchain. Bitcoin of course is has it's own blockchain and obviously it was also the very first blockchain because Bitcoin invented the whole cryptocurrency thing. Ethereum also has it's own blockchain and that is not only a \"normal\" blockchain like the one from Bitcoin because Ethereum offers smart contract functionality which means that you can use Ethereum to make Dexes, to programm Defi applications and also to create tokens. Which means that a lot of the crypto projects, even big ones are just tokens that were created on the Ethereum blockchain or others ones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}