{
  "id": "topic_5472030",
  "title": "Yraa",
  "author": "Yraa",
  "created_time": "October 28, 2023, 04:59:56 PM",
  "content": "Клиенты для всех сфер услуг, включая рекламные агентства.Работа строится так:1. Создаю для клиента аккаунт в Яндекс Директ.2. Клиент пополняет баланс на 20000 рублей.3. Создаю для клиента Телеграм бот, настраиваю рекламу.4. Клиент получает первые заявки в Телеграм.5. Оплачивает мои услуги – 15000 рублей календарный месяц.Цифр по количеству заявок не называю, всё очень индивидуально и будет понятно только после запуска!Если готовы начать, пишите здесь информацию о своём бизнесе и почту для создания аккаунта.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472030",
  "comments": [
    {
      "author": "klarki",
      "created_time": "October 28, 2023, 11:02:32 PM",
      "body": "Какая живучесть акков яда под рекламу серого бизнеса? Как часто отлетают акки и предоставляете ли Вы какие-либо гарантии своему клиенту? Или опять же, все сугубо индивидуально? Под серую тематику рб ниже или все тот же в размере 20к рублей?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yraa",
      "created_time": "October 29, 2023, 12:00:07 PM",
      "body": "Quote from: klarki on October 28, 2023, 11:02:32 PMКакая живучесть акков яда под рекламу серого бизнеса? Как часто отлетают акки и предоставляете ли Вы какие-либо гарантии своему клиенту? Или опять же, все сугубо индивидуально? Под серую тематику рб ниже или все тот же в размере 20к рублей?Ниразу серый бизнес не рекламировал и рекламировать не хочу",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yraa",
      "created_time": "November 12, 2023, 04:44:18 PM",
      "body": "Создать бот, настроить рекламу, объяснить клиенту как этим пользоваться занимает примерно 5 часов.Далее начинают поступать первые заявки. Объясняю клиенту как с ними работать, чтобы были сделки.Клиент инвестирует рекламный бюджет, я инвестирую своё время. Ещё несколько миллионов рублей было инвестировано в разработку бота и рекламным тестам на реальных бизнесах.Попробовать: https://kurl.ru/HNFpd",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "November 12, 2023, 04:49:14 PM",
      "body": "Quote from: Yraa on November 12, 2023, 04:44:18 PMПопробовать: https://kurl.ru/HNFpdЗачем вы прячете ссылку на Telegram под сторонним сервисом? Это заработок за переходы?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yraa",
      "created_time": "November 12, 2023, 05:29:57 PM",
      "body": "Quote from: Xal0lex on November 12, 2023, 04:49:14 PMЗачем вы прячете ссылку на Telegram под сторонним сервисом? Это заработок за переходы?Не хочу, чтобы ссылка индексировалась поисковиками.Не понимаю о каком заработке за переходы идёт речь. Это мой бот с демонстрацией возможного функционала, на том конце бота отвечаю лично, чтобы потенциальные клиенты понимали, как можно общаться через бот.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yraa",
      "created_time": "November 16, 2023, 09:09:32 AM",
      "body": "Услуги до конца 2023 года бесплатны — клиент пополняет Директ на 20000 ₽, я создаю бот, настраиваю рекламу.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}