{
  "id": "topic_5424870",
  "title": "Zilon",
  "author": "Zilon",
  "created_time": "November 30, 2022, 08:57:25 PM",
  "content": "The U.S Securities and Exchange Commission disclosed some intended initiatives regarding crypto assets in its strategic plan for the fiscal years 2022-2026. This intended initiatives is aimed to address the SEC's top priorities for the next four years.It boils down to developing and implementing some rigorous regulatory structures that will monitor the evolving market, business models, and technologies:The aim of this strategic plan published by SEC for the fiscal year 2022-2026 is meant to'Address its top priorities over the next four years.”“develop and implement a robust regulatory framework that keeps pace with evolving markets, business models, and technologies.”“examine strategies to address systemic and infrastructure risks faced by the capital markets and the market participants.” “Understand the rapid growth in crypto assets” “recognize significant developments and trends in the evolving capital markets and adjust their activities accordingly.”The next four years might comes with stricter regulations in the U.S for crypto investors  The chairman of the SEC, Gary Gensler, stressed:QuoteThe SEC pursues our three-part mission: to protect investors, maintain fair, orderly, and efficient markets, and facilitate capital formation.As far as i know there are no strategic plans the U.S will set up that will not involve consistent modification of regulations that will make investing in Bitcoin and crypto generally worth considering. Making stricter rules with claims to protect investors above other priorities.link",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5424870",
  "comments": [
    {
      "author": "Fortify",
      "created_time": "November 30, 2022, 10:10:45 PMLast edit: December 01, 2022, 09:30:25 PM by Fortify",
      "body": "Quote from: Zilon on November 30, 2022, 08:57:25 PMThe U.S Securities and Exchange Commission disclosed some intended initiatives regarding crypto assets in its strategic plan for the fiscal years 2022-2026. This intended initiatives is aimed to address the SEC's top priorities for the next four years.It boils down to developing and implementing some rigorous regulatory structures that will monitor the evolving market, business models, and technologies:The aim of this strategic plan published by SEC for the fiscal year 2022-2026 is meant to'Address its top priorities over the next four years.”“develop and implement a robust regulatory framework that keeps pace with evolving markets, business models, and technologies.”“examine strategies to address systemic and infrastructure risks faced by the capital markets and the market participants.” “Understand the rapid growth in crypto assets” “recognize significant developments and trends in the evolving capital markets and adjust their activities accordingly.”The next four years might comes with stricter regulations in the U.S for crypto investors  The chairman of the SEC, Gary Gensler, stressed:QuoteThe SEC pursues our three-part mission: to protect investors, maintain fair, orderly, and efficient markets, and facilitate capital formation.As far as i know there are no strategic plans the U.S will set up that will not involve consistent modification of regulations that will make investing in Bitcoin and crypto generally worth considering. Making stricter rules with claims to protect investors above other priorities.linkIt's surprising that regulators still feel so far behind in many respects when it comes to monitoring and charging crypto assets effectively, you'd think they might have a handle on it right now as it is still circumventing so many financial controls that they put in place (even though decentralization makes it hard to do anything about). Ironically if Bitcoin and crypto keeps drifting down then they might just about arrive at the party after most other people have left. At least until the next uncontrolled bubble comes along and they spend ten years trying to figure it out. At least they are using the words fair and efficient markets, which you could say is some of the prime benefits of crypto already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "November 30, 2022, 10:29:22 PM",
      "body": "Quote from: Zilon on November 30, 2022, 08:57:25 PM'Address its top priorities over the next four years.”“develop and implement a robust regulatory framework that keeps pace with evolving markets, business models, and technologies.”“examine strategies to address systemic and infrastructure risks faced by the capital markets and the market participants.” Zzzzzzzzzzzzzzzzzzz.....That sounds like a whole lot of nothing to me--and mind you, in the context of the SEC regulating crypto I'm not complaining.  If they don't end up meeting those extremely generic and vague goals, hopefully they were too busy tackling the real issues in the financial world, which mostly happen in the stock market.  There might be some serious chicanery in crypto, but all of the scumbags getting rich at the expense of investors do so behind corporate walls and everywhere else in the business world.They probably made this announcement to give the appearance of them doing something instead of nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "November 30, 2022, 11:04:33 PM",
      "body": "If there was a way to develop a robust regulatory framework for emerging technologies, why has it taken them so long. It's hardly like crypto was the first problem they've had since the bug four tech firms became as big as they did... Their stance is more aimed at crypto in general and not just bitcoin this time.Quote from: The Pharmacist on November 30, 2022, 10:29:22 PMQuote from: Zilon on November 30, 2022, 08:57:25 PM'Address its top priorities over the next four years.”“develop and implement a robust regulatory framework that keeps pace with evolving markets, business models, and technologies.”“examine strategies to address systemic and infrastructure risks faced by the capital markets and the market participants.” Zzzzzzzzzzzzzzzzzzz.....That sounds like a whole lot of nothing to me--and mind you, in the context of the SEC regulating crypto I'm not complaining.  If they don't end up meeting those extremely generic and vague goals, hopefully they were too busy tackling the real issues in the financial world, which mostly happen in the stock market.  I say this every time a thread like this has been made before, if it was something simple or easy to implement then it'd be done already. Whenever people make targets and don't have to stick to them - they normally just get pushed back constantly. The vagueness is so they can add to their list in 2026 of the new scope they want to target before 2040... In four years they want a rebust framework but in 12 they couldn't make one. The EU's one for tech firms took 20 years with Gdpr.This could also show how little a threat the crypto problem is or how advanced it is as the computer misuse act in the UK came into effect within 2 years of the first protoype malware was published. It'd seem to me the slowness is either thst they have no clue what they're doing or they don't want to stunt the growth of the industry (the longer it takes for crypto to be regulated, the fewer money from pension schemes/institutions can trickle into it though and I think that'll be a negative thing to happen - especially if it's regulated as well/poorly as the stock market). I don't remember stocks doing this badly for so long in the US before their circuit breaker trading ban idea of stopping the market for two weeks after a drop (although it did decentralise the market for Eurasia quite well who seem to have a lot of exchanges backed by otc desks so they can stay liquid).Quote from: Fortify on November 30, 2022, 10:10:45 PMIronically if Bitcoin and crypto keeps drifting down then they might just about arrive at the party after most other people have left. At least until the next uncontrolled bubble comes along and they spend ten years trying to figure it out. I wonder how it's still a talking point for them though. Maybe they've run out of things to pretend they need to regulate this time... Bitcoin's already dropped a lot since its highs (along with the rest of the industry) perhaps it's focussed a lot.more at altcoins trying to rebrand themselves as each other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 01, 2022, 09:30:55 AM",
      "body": "one massive \"disruptor\" the crypto-space never thought to implement to really mess with FIAT(government currencies) is about to lose its loophole opportunity to develop..the idea is simple.have exchanges(swap services) of a token that is not rated at USD. but instead 'minimum wage'where by if US is $10/h .. uk is £9.50/hour and africa is $0.20/hour where the exchange rates a coin as \"1hour\"they all pay fair labour cost for 1 coin for 1 hour labour with their native currency at their nations min wage amount. ..this disrupts fiat/forex massivelybecause US$10 buys you 50 african allotments of min wage.meaning a 50x opportunity by converting $10US(a single coin value in us) to african currency then buying 50 coins at african priceso arbitraging forex can get people accumulating alot of coin.. and doing a massive forex push to change the forex rates due to sells on forex. where by it disrupts the forex currency rate until 1 hour in africa becomes the same currency amount as US.but these proposed changes in next 4 years include things that prevent exchanges from allowing to have a market orderbook that does this function via crypto. as it is seen as a national security threat to the US economy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "December 01, 2022, 11:27:47 AM",
      "body": "Quote from: jackg on November 30, 2022, 11:04:33 PMIt'd seem to me the slowness is either thst they have no clue what they're doing or they don't want to stunt the growth of the industryIsn't it just typical for governments to be that slow? From their perspective, it probably truely is a \"top priority\" to finish something in 4 years. But if they think they can \"keep pace\" by taking that long, that's not going to work. Four years ago, the ICO hype just cooled down, and since then, we've had DeFi and NFT bubbles created and popped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 01, 2022, 11:35:32 AM",
      "body": "with midterm elections.. most politicians only work for 2 year . so if they can put deadlines of 3 years+ the problem they are tasked with becomes another persons problem.. or they can promote it as \"if you re-elect me i will finally get around to X policy\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "December 01, 2022, 11:11:00 PM",
      "body": "Quote from: LoyceV on December 01, 2022, 11:27:47 AMIsn't it just typical for governments to be that slow? From their perspective, it probably truely is a \"top priority\" to finish something in 4 years. But if they think they can \"keep pace\" by taking that long, that's not going to work. Four years ago, the ICO hype just cooled down, and since then, we've had DeFi and NFT bubbles created and popped.It could be! This might be why companies are happy also to buy ISO standards and accreditation (like the 17000 series - those are available for free from sources for educational purposes though even if they're a bit harder to find).It's in their favour to attempt to offer education against most of these things (it's very hard to control nfts and other things you don't understand as a government). It should be general knowledge that if you invest in a well marketed stock IPO (especially on average) you're going to lose money especially in the short term, it's not though (I'll accept the argument this is not a great example as that might change if it was taught on its own). Quote from: franky1 on December 01, 2022, 11:35:32 AMwith midterm elections.. most politicians only work for 2 year . so if they can put deadlines of 3 years+ the problem they are tasked with becomes another persons problem.. or they can promote it as \"if you re-elect me i will finally get around to X policy\"This is generally the case for the government but not normally the regulators (from a European perspective, this might be different in the two party system in the US).It could be they're waiting for a big problem they can fix by legislating against it though at the time it appears and that could be why regulation is slow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "r00thog",
      "created_time": "December 02, 2022, 12:14:43 PM",
      "body": "I suspect their biggest fear is a rising Bitcoin price will expose the unfunded pension plans for all the Boomers, not only in the US but also in Europe & the UK (as the whole Gilt market blow up exposed). The numbers are just so large that they have very little room for error in whatever dogshit financial model these people all worship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tygeade",
      "created_time": "December 03, 2022, 06:15:10 PM",
      "body": "Quote from: Zilon on November 30, 2022, 08:57:25 PMAs far as i know there are no strategic plans the U.S will set up that will not involve consistent modification of regulations that will make investing in Bitcoin and crypto generally worth considering. Making stricter rules with claims to protect investors above other priorities.If you want to protect the investors, first start with firing the bank and hedge fund managers that caused so much loss for the people in stock investments; yeah, people lost their entire savings and life on stock market for the past 100 years and yet they are not getting regulation that crypto is getting.  Just to even focus on the 2008 crisis, there were a lot of people who should have been jailed for losing that much money, 800+ billion dollars of regular investors money, and none of them were, in fact they were given extra bonus that year for buying things at cheap. So all in all, I have to say crypto should be left alone as much as stock market does.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 03, 2022, 08:07:29 PM",
      "body": "I look at regulation from the other side.If the regulator recognizes cryptocurrencies as shares, then crypto projects will have to pay heavy fines. This applies to those coins where there were ICO or other public sales. For example, Ethereum will pay a fine, but many projects will not be able to do this.And what will happen to crypto-exchanges. If they trade shares, then they need to pool new licenses and delist many coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "December 04, 2022, 07:44:38 AM",
      "body": "Quote from: jackg on November 30, 2022, 11:04:33 PM...I wouldn't get too complacent. It starts with the umbrella term \"cryptocurrency,\" and then it ends with Bitcoin. The reason there hasn't been much focus in the past is because crypto hasn't made up any sizeable portion of the economic activity in the U.S. At this point, it's probably too lucrative of a market to ignore. They're worried about tax revenue. IRS would target someone that hasn't reported transactions in the hundreds of dollars, so they probably view crypto as a major threat to their collection attempts. Or, they could be targeting crypto as a whole because they see it as a threat to USD.The regulatory framework exists if they want it to exist. The government hasn't hesitated overregulating out of hesitation of ineffectiveness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "December 04, 2022, 08:35:42 AM",
      "body": "Quote from: Zilon on November 30, 2022, 08:57:25 PMAs far as i know there are no strategic plans the U.S will set up that will not involve consistent modification of regulations that will make investing in Bitcoin and crypto generally worth considering. Making stricter rules with claims to protect investors above other priorities.Such a number of \"throws\" of investors, as in the crypto world, perhaps in the first place, and it is difficult to find another industry in the modern world, where there would be more crime. And the most important point is the almost complete impunity of those who, to put it mildly, deceived investors. Therefore, the tightening of control and the formalization of the work of companies attracting investments has long been asking for such regulatory laws. I don't see anything wrong with that. Although I do not exclude that there may be excesses. But it seems to me that if there is a risk, the restrictions should be quite strict. As history has shown - with a well-heated topic in the media, in society - they begin to carry money, completely turning off their brains ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "December 04, 2022, 09:30:44 AM",
      "body": "Quote from: The Pharmacist on November 30, 2022, 10:29:22 PMZzzzzzzzzzzzzzzzzzz.....That sounds like a whole lot of nothing to me--and mind you, in the context of the SEC regulating crypto I'm not complaining.  If they don't end up meeting those extremely generic and vague goals, hopefully they were too busy tackling the real issues in the financial world, which mostly happen in the stock market.  There might be some serious chicanery in crypto, but all of the scumbags getting rich at the expense of investors do so behind corporate walls and everywhere else in the business world.They probably made this announcement to give the appearance of them doing something instead of nothing.This will become less attractive when the SEC starts to interfere too much in the development of crypto, their main goal is to limit crypto as a measure of control that was exercised over fiat currencies before, the concept of decentralization will no longer look attractive when the The SEC interferes too much with cryptos in general. In the financial world they are starting to lose trust, so they are starting to limit crypto and trying to ensure security as a legal measure, eventually crypto and fiat currencies will be subject to the same regulations in their journey.It is useless to hope from the SEC, because they are completely incompetent to take care of what they are supposed to be responsible for, crypto and bitcoin are already complete in their own dimensions, there is no more perfect binding regulation as they want to design",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "December 05, 2022, 08:04:46 PM",
      "body": "I hope sec regulations within the years in view will also cover the legal side and defined punishment for crypto scammers and exchange that defraud investors. There is the need for proper regulations for crypto now as market is growing and opening up unlike the dark days of ICO that team of scammers did a lot of exit on investors money and put a lot of rules that investors were not able to retrieve their coins after investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "December 05, 2022, 08:42:15 PM",
      "body": "Quote from: gantez on December 05, 2022, 08:04:46 PMI hope sec regulations within the years in view will also cover the legal side and defined punishment for crypto scammers and exchange that defraud investors. There is the need for proper regulations for crypto now as market is growing and opening up unlike the dark days of ICO that team of scammers did a lot of exit on investors money and put a lot of rules that investors were not able to retrieve their coins after investment.Once the regulation is enacted, it will definitely be more than what you expect, and even your privacy they will not ignore, they will find a way to control you more. Under the pretext of introducing strict regulations to protect investors, they enter the market and gradually seek to control it completely. I don't think regulations will be better for cryptocurrencies but regulations that will make us feel uncomfortable rather than safe. But eventually, regulation is inevitable. Sooner or later, they will also put it in crypto with their power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lixer",
      "created_time": "December 06, 2022, 03:25:24 AM",
      "body": "Quote from: Smack That Ace on December 05, 2022, 08:42:15 PMQuote from: gantez on December 05, 2022, 08:04:46 PMI hope sec regulations within the years in view will also cover the legal side and defined punishment for crypto scammers and exchange that defraud investors. There is the need for proper regulations for crypto now as market is growing and opening up unlike the dark days of ICO that team of scammers did a lot of exit on investors money and put a lot of rules that investors were not able to retrieve their coins after investment.Once the regulation is enacted, it will definitely be more than what you expect, and even your privacy they will not ignore, they will find a way to control you more. Under the pretext of introducing strict regulations to protect investors, they enter the market and gradually seek to control it completely. I don't think regulations will be better for cryptocurrencies but regulations that will make us feel uncomfortable rather than safe. But eventually, regulation is inevitable. Sooner or later, they will also put it in crypto with their power.Regulation are already been there even before but as you and the title said there might be more/new to come. Regulations can mess up with our privacy that cryptos are supposed to offer to us. When we use these centralized platforms and submit our data's maybe that is the only time that they can control us but we are still free to choose a different platform which are exempted on the regulations.We also have decentralized platforms and I do not think they can cross the line and regulate them. There are still people who love regulations and they can sacrifice some things only to be more safer from criminals but for us who are a fan of decentralization we think it's a bad thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rokok lokal",
      "created_time": "December 06, 2022, 05:00:56 AM",
      "body": "I think This includes cryptocurrency initiatives. The SEC will continue to examine ways it can remove barriers to capital formation and market integrity in this space and for investors in terms of crypto-related enforcement action. While most of the documents are newsworthy, it is important to note that each of the SEC's priorities is feasible and relevant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "December 09, 2022, 04:21:59 AM",
      "body": "Quote from: lixer on December 06, 2022, 03:25:24 AMQuote from: Smack That Ace on December 05, 2022, 08:42:15 PMQuote from: gantez on December 05, 2022, 08:04:46 PMI hope sec regulations within the years in view will also cover the legal side and defined punishment for crypto scammers and exchange that defraud investors. There is the need for proper regulations for crypto now as market is growing and opening up unlike the dark days of ICO that team of scammers did a lot of exit on investors money and put a lot of rules that investors were not able to retrieve their coins after investment.Once the regulation is enacted, it will definitely be more than what you expect, and even your privacy they will not ignore, they will find a way to control you more. Under the pretext of introducing strict regulations to protect investors, they enter the market and gradually seek to control it completely. I don't think regulations will be better for cryptocurrencies but regulations that will make us feel uncomfortable rather than safe. But eventually, regulation is inevitable. Sooner or later, they will also put it in crypto with their power.Regulation are already been there even before but as you and the title said there might be more/new to come. Regulations can mess up with our privacy that cryptos are supposed to offer to us. When we use these centralized platforms and submit our data's maybe that is the only time that they can control us but we are still free to choose a different platform which are exempted on the regulations.We also have decentralized platforms and I do not think they can cross the line and regulate them. There are still people who love regulations and they can sacrifice some things only to be more safer from criminals but for us who are a fan of decentralization we think it's a bad thing.In the current state, we do still have some really decentralized platforms like Bisq or mixers that can help us better protect our privacy. But remember what the US government did with Tornado Cash, if the government suppresses us, they puts decentralized platforms in their sights, then we will have a hard time protecting privacy. I see that the government is still not really strong with bitcoin as well as decentralized platforms, and that is a good sign, and hopefully the regulations won't become too harsh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 09, 2022, 05:04:04 AM",
      "body": "This is in general how it works. In Canada back in late 2010s forex trading was very popular. Basically you were given 500x leverage or something like that. Eventually many lost all their money and complained to regulators. So what did regulators do? They prevented retail from trading forex in certain provinces. With crypto most likely the same thing will happen. They will set limits on what you can and can’t trade to prevent another FTX event.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}