{
  "id": "topic_5401638",
  "title": "titanlotto",
  "author": "titanlotto",
  "created_time": "June 07, 2022, 05:33:38 AM",
  "content": "Titan Lotto is the world's first & fairest fully blockchain-based lottery platform. Titan Lotto is not only a chance-based game that provides fun & entertainment, but it also gives players an opportunity to test their luck and make some unbelievable money.  100% TransparencyTimely PayoutsNo Hidden PoliciesCrypto Wallet Fund ManagementImpeccable Support System https://twitter.com/titanlotto1/status/1533032759135875072?s=20&t=B-THe-grHIelLa36i8H4pA",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401638",
  "comments": [
    {
      "author": "ANKIT007",
      "created_time": "June 09, 2022, 03:18:06 PM",
      "body": "Blockchain technology has already started to break geographical borders, and Fire Lotto is the latest and ideal example of this trend. It is a blockchain-based lottery platform launched on January 1, 2018, and provides a truly global pool of customers, including even those belonging to the regions where lotteries are banned. The platform ensures that 70% of the ticket sales go to the jackpot and the winners are paid right after the draw to their ETH wallets. Fire Lotto was recently launched on January 1, 2018, starting with 4 popular lottery games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frengki_cisco",
      "created_time": "June 17, 2022, 08:08:25 AM",
      "body": "Quote from: titanlotto on June 07, 2022, 05:33:38 AMTitan Lotto is the world's first & fairest fully blockchain-based lottery platform. Titan Lotto is not only a chance-based game that provides fun & entertainment, but it also gives players an opportunity to test their luck and make some unbelievable money.  100% TransparencyTimely PayoutsNo Hidden PoliciesCrypto Wallet Fund ManagementI have been gambling for a long time and till now, there are hundreds of lotteries that i try for luck no matter the lottery platform works with blockchain system, i want to know, your experience in Titan Lotto, can you please provide us with proof of some of your bets and the luck you got.What are the advantages of the lottery in Titan Lotto, other than what you mentioned above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}