{
  "id": "topic_5436442",
  "title": "Mustang Shelby",
  "author": "Mustang Shelby",
  "created_time": "January 23, 2023, 08:47:17 AM",
  "content": "Bu sözleri söyleyen Bakan Nebati, işsizlik olmaması için, sanayinin yavaşlamaması için Türk Lirasını değerli hale getirmeyi amaçlamadıklarını kastediyor herhalde.Bu kadar da sistem yalakası olmayın, yanlışa yanlış, doğruya doğru sözler kullanın. Türkiye’de dolar 20 lira oldu, düşüremedik diyemiyorsunuz da biz kontrollü olarak düşürmüyoruz algısı yaratmaya çalışıyorsunuz. Tamam o zaman hadi senin mantıkla doları 50 lira yapalım bakalım nasıl bir senaryo ile karşılaşacağız? Bunu söylenenin bakan olmasına mı yanayım, bakanlık mevkisinde hala bulunmasına mı?Kaynak https://www.yenialanya.com/amp/haber/13794822/nebati-turk-lirasini-degerli-hale-getirirseniz-sanayi-yavaslar-issizlik-olur",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436442",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "January 23, 2023, 09:07:13 AM",
      "body": "Siyasetten kendimi bildim bileli nefret ediyorum. Dünya siyasetinde durum farklı mıdır bilmiyorum fakat Türkiye'de siyasi karakterlerin orada olmasının tek sebebi halkı daha fazla soymaktan öteye gitmiyor. Siyasetçinin benim sözlüğümdeki tek karşılığı dolandırıcı. Siyaset anlayışları hırsızlığın, beceriksizliğin üzerini örtmekten öteye gitmiyor. Yapmak istediklerini yapıp üstünü örtüyorlar. Daha acısı ülkede sağ/sol yada başka perspektiflerde ayrışmış çoğunluğu koyun gibi gütmeye devam ediyorlar. Çoğu insan yöneticileri hizmet etmekle görevli değil kutsal bireyler gibi görmeye devam ettiği sürece dilediklerini yapmaya devam edecekler ve futbol takımı tuttuğunu zanneden fanatik taraftarları her koşulda onları desteklemeye devam edecek. Bizdeki en büyük problemlerden birisi biat kültürü, yöneticileri kutsal zannetme... Halk olmadan hiç bir hükümleri yok. Dünyanın belirli bölgelerinden teknolojik ve ekonomik olarak geride olmamızın en büyük nedeni de biat kültürü. Eleştiriye kapalı insanlar asla gelişemezler. Eleştirilemez yöneticilerin olduğu ülkelerde gelişim imkansız. Topyekün halkın mantalitesinin değişmesi gerekiyor ve bu değişimler genellikle büyük baskı ve felaketlerden doğmuş hep.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "January 23, 2023, 09:22:28 AM",
      "body": "Adamın 3 cümlesinden 2si ortalığı karıştıracak nitelikte. Ya kasıtlı olarak gaflar yapıyor ya da kafası gerçekten farklı çalışıyor. Yaptığı şey kesinlikle normal değil Bir açıdan bakınca haksız olduğunu söylemek doğru değil. Şu anda ülkenin çarkı dönen tek sektörü sanayi sektörü ve dövizin fiyatı düşük olsa bu sektörden gelir elde edilemezdi. Ama hata şurada ki her akla geleni bu şekilde açıklamak doğru değildir. Kendince bir fikri var ama fikirlerini çok yersiz bir şekilde açıklayan bir bakanımız var",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "January 23, 2023, 09:56:58 AMLast edit: January 23, 2023, 10:47:41 AM by mandown",
      "body": "Bir iktidar düşünün ülkesine, milletine, topraklarına bu kadar düşman olsun. Birde bunlara oy veren bir topluluk olsun.Bir dönem düşünün ülkesindeki parayı korumak için kanun bile çıkartılmış o kadar naif bir düşünce yapısından geldiğimiz noktaya bakın rezillik.Bu getirdikleri sistem ile orta sınıf ve alt sınıf komple yok olmaya mahkum zengin daha zengin Lanet olsun sizin yönetiminizede düşüncenizedeKarne hediyesi olarak et alınan bir ekonomiyiz. O derece iyiyiz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "January 23, 2023, 03:46:53 PM",
      "body": "Çok ilginç açıklama gerçekten. Türk lirasının değersizleştiğine sevinmemiz lazım diyecek neredeyse. Ülke olarak en büyük sorunumuz buyken çıkıp böyle açıklamaları bakan sıfatıyla yapmakta büyük bir saçmalık bence. Bakan olabilirsin ama milleti de salak yerine koymayın artık canım ya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "January 23, 2023, 08:50:52 PM",
      "body": "Şimdiye kadarki yaptığı açıklamalar ortada en basitinden şimdi Türk Lirası alınır dibin dibini gördü daha gidecek yeri yok dediğinde dolar 14,50 lira civarındaydı bu gün baskılanmış hali 19 lira. Son iki yılda yapılanlar ülkeyi öyle bir bataklığa sürüklediki yıllarca bunların ceremesini yine halk çekecek. Bir ülke bile bile parasının değersiz olmasını neden ister ki, tüm dünya parasının değerini artırmak için çabalıyorken bizim siyasetçiler ekonomi alanında tam tersini yapıyorlar. Tamam küresel anlamda enflasyon var ve FED bunun için aylarca faiz artırımına gitti sonuç olarak karşılığını aldılar hem enflasyonu hem işsizlik oranını düşürdüler ya bizde durum nasıl tam tersi ama yinede enflasyon yüksek olmasına karşın gerçeği yansıtmayan bir rakam açıklıyorlar. Bir ülke nasıl batırılır işte ortada ve hangi yüzle tekrardan seçimde oy istiyorlar anlayamıyorum. Siyasetin karşılığı bizim ülkemizde en iyi yalan konuşabilmedir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "January 23, 2023, 09:55:21 PM",
      "body": "TL değerli olsa bir dert değersiz olsa başka dert. Bunlara kalsa iki taraf da olumlu durum neyse kendilerine ona göre pay çıkarıyorlar. Dolar kuru düşükken bununla övünüyorlardı ithalat yapmak kolaydı ülkede bolluk vardı şimdi kur yüksek olunca yine övünüyorlar bu sefer ihracat arttı tüm dünyaya mal satıyoruz diyorlar. Bana göre de kurun yüksek ya da düşük olması çok büyük sorun değil ama belirsiz olması büyük sorun. Bundan 2 ay sonra kur ne olacak tahmini olan var mı yok çünkü her an her şey olabiliyor. Son dönemde sabit tutmayı başardılar ama onu yaparken de rezervleri bitirdikleri konuşuluyor. Bunun olumsuz yansımasını ekonomide görüyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "January 24, 2023, 09:06:52 AM",
      "body": "Bizim bu zamana kadar bildiklerimiz öğrendiklerimiz mi yanlış yoksa ekonomi temeli değişti de o yüzden zamana ayak mı uyduramadık. Gerçekten artık açıklamaları okuduğumda cümlelerin neyi kastettiğini anlayamıyorum. Yüksek lisansımı ekonomi üzerine yaptım ama bu cümleleri anlayamıyorum. “Türk lirasının değerli hale getirirseniz sanayi yavaşlar, işsizlik olur” cümlesini bana açıklayın bilen varsa. Bilerek mi yapılıyor ya da söylenilmek istenen şey doğru kelimelerle mi anlatılmıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "January 24, 2023, 06:09:31 PM",
      "body": "Türk lirasının değerli olmasını dert edinmeyen siyasi hareketlere oy vermeyen millet bence bu muameleyi hak ediyor hem de sonuna kadar. Türk lirası hep mi değersiz kalacak diye soralım abiye o zaman. Hani sanayi güçlenince otomatikman değerlenmesi gerekiyor da. Sanayiyi güçlendirip inatla düşürecek miyiz yeniden? Öyleyse niye çalışıyoruz arkadaş ölmek için mi çalışıyoruz? Saçma sapan konuşmasınlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "January 25, 2023, 05:17:28 AM",
      "body": "Ne talihsiz açıklama ama, bir bakanın özellikle para politikaları ile ilgilenen bir bakanın yerli parayı değerli yapmaya çalışması lazımken tam tersi açıklamalar yapması, kendisinin eğitim ve öğretimini sorgulatmaya yetti benim için, ekonomi dalında ne bilgisi olduğunu bilmiyorum ancak hiç bir bilgisi olmadığına bu açıklama fazlasıyla yeterli bence,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Distraction",
      "created_time": "January 25, 2023, 06:00:54 PM",
      "body": "Bu sözün özeti şu oluyor; yurtdışı firmaları için ucuz işgücü oluşturmak varken neden bunu bozalım ki? Örneğin Xiaomi bildiğiniz gibi İstanbul'un Avcılar ilçesine fabrika açmıştı ve dolar bazında çok komik miktarda maaş vererek ciddi bir şekilde kara geçiyor. Böyle firmaların daha çok bu şekilde girişimlerini duyarız bu gidişle. Sonuçta nasıl olsa burada çok daha ucuza aynı işi yaptıracak birilerini bulabilirler.Bizim için en sağlıklı formül refah içerisindeki Avrupa ülkelerinin formülüdür. Bundan başka maceraya gerek yok. Ayrıca bir ara Çin modelinin lafını bile etmişlerdi ve akıl almaz bir fikirdi. Bizim şu an nereye gittiğimiz belli ve bakalım seçim sonrası nasıl bir değişim olacak ya da olacak mı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "January 26, 2023, 01:04:04 PM",
      "body": "Quote from: Distraction on January 25, 2023, 06:00:54 PMBu sözün özeti şu oluyor; yurtdışı firmaları için ucuz işgücü oluşturmak varken neden bunu bozalım ki? Örneğin Xiaomi bildiğiniz gibi İstanbul'un Avcılar ilçesine fabrika açmıştı ve dolar bazında çok komik miktarda maaş vererek ciddi bir şekilde kara geçiyor. Böyle firmaların daha çok bu şekilde girişimlerini duyarız bu gidişle. Sonuçta nasıl olsa burada çok daha ucuza aynı işi yaptıracak birilerini bulabilirler.Bizim için en sağlıklı formül refah içerisindeki Avrupa ülkelerinin formülüdür. Bundan başka maceraya gerek yok. Ayrıca bir ara Çin modelinin lafını bile etmişlerdi ve akıl almaz bir fikirdi. Bizim şu an nereye gittiğimiz belli ve bakalım seçim sonrası nasıl bir değişim olacak ya da olacak mı.Türkiye seçimleri son 50 yılın en önemli seçimleri olacak bana göre, aradaki darbe zamanını çıkarırsak, Türkiye’nin potansiyelinin ortaya çıkabileceği bir seçim olacak, iktidar kazansa da bu dönem kadar rahat hareket edeceklerini zannetmiyorum çünkü kazanırlarsa ucu ucuna bir zafer olacak, koltuk sayıları mecliste ciddi değişebilir, cumhurbaşkanlığı için de Kemal Kılıçdaroğlu aday olursa bir dönem daha Recep Tayyip Erdoğanı görebiliriz,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "January 27, 2023, 11:08:32 AM",
      "body": "Türk lirasının değerli hale gelmesini acaba neden istemiyorsunuz?Türk lirası değerli hale gelirse beklenilen şey ihracatın, ithalatın oynaklığı mı?Türk lirası değerli olursa sanayi ilerler, işsizlik azalır.İnsanlar keyifle çalışacak alanlar bulur.Hangi Avrupa ülkesinde sanayi yavaşlamış?Almanya’nın maddi gücüne bakın sanayisi kötü mü?Hala dünyada belirli alanlarda sanayi gücü onların elinde.Demek ki neymiş, sanayi azalması para gücüyle değilmiş.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pulsar77",
      "created_time": "January 28, 2023, 04:57:16 PM",
      "body": "Evet gerçekten çok ilginç bir düşünce yapısı. Ben bu açıklamanın samimi olduğuna inanmak istemiyorum. Çünkü söylediğiniz gibi Türk Lirası'nın değerli hale gelmesi sanayiyi olumsuz değil olumlu yönde etkiler. Bu mantıkla o zaman örneğin refahı sağlam tüm Avrupa ülkelerinin sanayisi çöktü mü yani?    Bu tarz açıklamalar yapıldığında görevden almalar görüyorduk ama bu sefer olmayacak gibi gözüküyor.Paramız artık değerli hale gelmeye başlasın ki insanlar da istediklerini daha rahat bir şekilde alabilsinler. Dolar yükseldikçe başta teknoloji ürünleri olmak üzere bir ton şeye zam geliyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "January 29, 2023, 05:10:50 AM",
      "body": "Quote from: Pulsar77 on January 28, 2023, 04:57:16 PMEvet gerçekten çok ilginç bir düşünce yapısı. Ben bu açıklamanın samimi olduğuna inanmak istemiyorum. Çünkü söylediğiniz gibi Türk Lirası'nın değerli hale gelmesi sanayiyi olumsuz değil olumlu yönde etkiler. Bu mantıkla o zaman örneğin refahı sağlam tüm Avrupa ülkelerinin sanayisi çöktü mü yani?    Bu tarz açıklamalar yapıldığında görevden almalar görüyorduk ama bu sefer olmayacak gibi gözüküyor.Paramız artık değerli hale gelmeye başlasın ki insanlar da istediklerini daha rahat bir şekilde alabilsinler. Dolar yükseldikçe başta teknoloji ürünleri olmak üzere bir ton şeye zam geliyor.Hocam şu an yapılan şey sanırım içinde bulunulan duruma şükür ettirmek ve iyi durumda olduğumuza insanları inandırmak bu yüzden böyle açıklamalar çok normal karşılanıyor karşılanır da yapar böyle açıklamalar daha sonra ne kadar saçma açıklamalar yapıldığı başka şekilde mutlaka konuşulur şimdi pek bir şey diyemiyor insanlar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "January 29, 2023, 11:13:35 AM",
      "body": "Quote from: RaltcoinsB on January 29, 2023, 05:10:50 AMQuote from: Pulsar77 on January 28, 2023, 04:57:16 PMEvet gerçekten çok ilginç bir düşünce yapısı. Ben bu açıklamanın samimi olduğuna inanmak istemiyorum. Çünkü söylediğiniz gibi Türk Lirası'nın değerli hale gelmesi sanayiyi olumsuz değil olumlu yönde etkiler. Bu mantıkla o zaman örneğin refahı sağlam tüm Avrupa ülkelerinin sanayisi çöktü mü yani?    Bu tarz açıklamalar yapıldığında görevden almalar görüyorduk ama bu sefer olmayacak gibi gözüküyor.Paramız artık değerli hale gelmeye başlasın ki insanlar da istediklerini daha rahat bir şekilde alabilsinler. Dolar yükseldikçe başta teknoloji ürünleri olmak üzere bir ton şeye zam geliyor.Hocam şu an yapılan şey sanırım içinde bulunulan duruma şükür ettirmek ve iyi durumda olduğumuza insanları inandırmak bu yüzden böyle açıklamalar çok normal karşılanıyor karşılanır da yapar böyle açıklamalar daha sonra ne kadar saçma açıklamalar yapıldığı başka şekilde mutlaka konuşulur şimdi pek bir şey diyemiyor insanlar Şükür kelimesi doğru kelime aslında. Şu anda “şükürsüzlük” diye bir tabir ortaya attılar. Eğer herhangi bir şeyden memnun değilseniz sen şükretmiyorsun ve değer bilmiyorsun, şükürsüzsün diyorlar. Karşı tarafa dini yönden saldırmanın farklı bir çeşidi aslında bu.Paranın değeri yükselse bütün bunlardan uzaklaşmaya başlarız. Ama şu anda paranın değeri yok, kriz var, insanlar ister istemez birbirileriyle zıtlaşıyorlar. Durum çok kötü ama kimsenin ağzını açtığı yok",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "January 29, 2023, 11:47:39 AM",
      "body": "Cahilin bu kadar fazla olduğu döneme nasıl denk geldik anlamadım gitti. Şükür olayı bir dönem canımı aşırı sıkıyordu. Şükretmek ne demek abi. Yada şükretmemek. İşi gücü bırakalım evde oturalım şükredelim nasıl olsa kendi kendine olur değilmi?Şükür ile alaksı olmayanların ürettiği teknoloji olmasa şimdi elimizde bilgisayar yerine taş olurdu. Konusunda ne kadar uzman oldukları geldiğimiz noktadan belli.Şükredin zamanla 1 tl'ye 0.05 usd den 0.001 usd alacağoz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "January 29, 2023, 12:19:38 PM",
      "body": "Quote from: mandown on January 29, 2023, 11:47:39 AMCahilin bu kadar fazla olduğu döneme nasıl denk geldik anlamadım gitti. Şükür olayı bir dönem canımı aşırı sıkıyordu. Şükretmek ne demek abi. Yada şükretmemek. İşi gücü bırakalım evde oturalım şükredelim nasıl olsa kendi kendine olur değilmi?Şükür ile alaksı olmayanların ürettiği teknoloji olmasa şimdi elimizde bilgisayar yerine taş olurdu. Konusunda ne kadar uzman oldukları geldiğimiz noktadan belli.Şükredin zamanla 1 tl'ye 0.05 usd den 0.001 usd alacağoz. Denk mi geldik, denk mi getirildik orasını bilemedim. Bir kaosla birlikte dünyada bütün insanlarla iletişim halinde yaşıyoruz global olarak, bunun sonucunda da cahilleşme artıyor. Temel ihtiyaçlarını karşılamıyor insanlar, birilerinden yada tek bir kişiye ümit bağlıyorlar. Kendi içlerine dönüp baksalar daha çoğunu bulacaklar, toplum içinde faydalı olacaklar daha bazı şeylerin değişmesi için çok zaman var. İşi gücü bırakıp şükretmek, o tarz yaşayanların tercihi saygı duyarım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pulsar77",
      "created_time": "January 29, 2023, 05:15:57 PM",
      "body": "Quote from: RaltcoinsB on January 29, 2023, 05:10:50 AMQuote from: Pulsar77 on January 28, 2023, 04:57:16 PMEvet gerçekten çok ilginç bir düşünce yapısı. Ben bu açıklamanın samimi olduğuna inanmak istemiyorum. Çünkü söylediğiniz gibi Türk Lirası'nın değerli hale gelmesi sanayiyi olumsuz değil olumlu yönde etkiler. Bu mantıkla o zaman örneğin refahı sağlam tüm Avrupa ülkelerinin sanayisi çöktü mü yani?    Bu tarz açıklamalar yapıldığında görevden almalar görüyorduk ama bu sefer olmayacak gibi gözüküyor.Paramız artık değerli hale gelmeye başlasın ki insanlar da istediklerini daha rahat bir şekilde alabilsinler. Dolar yükseldikçe başta teknoloji ürünleri olmak üzere bir ton şeye zam geliyor.Hocam şu an yapılan şey sanırım içinde bulunulan duruma şükür ettirmek ve iyi durumda olduğumuza insanları inandırmak bu yüzden böyle açıklamalar çok normal karşılanıyor karşılanır da yapar böyle açıklamalar daha sonra ne kadar saçma açıklamalar yapıldığı başka şekilde mutlaka konuşulur şimdi pek bir şey diyemiyor insanlar Bir de bu var evet. Durum ne olursa olsun her seferinde şükretmemiz söyleniyor. Şükürle koca bir ülke nasıl kalkınacak ve daha ileriye gidecek?Ayrıca bu konulara dini karıştırmanın son derece yanlış ve tehlikeli bir şey olduğunu düşünüyorum. Biz bir din devleti değiliz laik bir devletiz. İnsanların alım gücünün sürekli düştüğü bir ülkede yaşıyoruz bunun ötesi yok. Bizim hiçbir şeye şükretmememiz tam tersine durumları düzeltmek için neler yapabiliriz diye düşünmemiz gerekir. Yoksa bu gidişle Türkiye hep belli bir kesimin zengin geri kalan kısmın zorluklarla istediklerini alabildiği bir ülke olarak kalacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "January 29, 2023, 10:44:06 PM",
      "body": "Aklı olan ve normal çalışan herkes yaptıklarını anlıyor da bir de böyle dalga geçer gibi konuşmuyorlar mı çıldırıyorum. Bir Çin modeli vardı sahi ona ne oldu? Emeği ucuzlatırmak için kendilerince “kuru dengelediler”. İhracat artacak cari açık artıya geçecek döviz bollaşınca yine düşecek vs diye giden umudu ucuz emek ve doğaya bağlayan (en çok ihracat madende artmış) sistem. İnsan biraz utanır ya. Bu Çin modeli saçmalığındaki haberleri hatırlıyor musunuz? Saatlerce konuşuldu. Bir de işsizlik olur demiş. Genç işsizliğinde düzgün ülkeler arasında rekor kırmıyormuşuz gibi konuşun tabi. Akıl alır gibi değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}