{
  "id": "topic_5452181",
  "title": "crypticj",
  "author": "crypticj",
  "created_time": "May 10, 2023, 02:19:02 AM",
  "content": "I was thinking about Bitcoin as a currency a lot lately and I have some doubts about how currently we see its future.The problem is, in order for Bitcoin to become a currency everyone will use, it should be stable. I know that you might say that people will still use it because it's not about stability, it's about freedom and technology. I agree with that, but Bitcoin needs to be stable in order for people to treat it like money, and not like an asset. Just look at what people are saying right now, experts say that people shouldn't hold USD because inflation is just 5% a year, but imagine if you have bitcoin that can go down like 5% a day because some whales sold it. It will be problematic for people to use it on a daily basis because of that.I know that people say that when Bitcoin will be adopted, it should become stable because there is a limited amount of it, but I don't see how it's gonna happen. From what I see people treat bitcoin as an asset to invest and hold and I can't imagine that will change in the future.Why do you guys think Bitcoin will really become the \"money of the future\" and people will actually use it like one?From what I see, I think it's possible that people in the future will still trade bitcoin or try to buy as much of it as possible to manipulate the market.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452181",
  "comments": [
    {
      "author": "electronicash",
      "created_time": "May 10, 2023, 02:31:37 AM",
      "body": "BTC's unpredictable price is also a positive attribute that Bitcoiners like. you can make money out of this inflation. but BTC may not become stable due to the cycles, when the cycles probably are over like all 21M coins are already mined, i think there will be a stability of price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "May 10, 2023, 02:34:48 AM",
      "body": "Bitcoin will always be seen as an asset. On the aspect of money, I don't agree with your definition that it should be stable before it can be seen or considered as money. Bitcoin can't be stable, not now or even in the future. I really don't think it can. Inflation is what makes Bitcoin. If the price is to be stable, why then buy Bitcoin? What pairs and to what are we going to trade it? And what will be the use of Bitcoin again? Since it will then be seen as any other fiat currency out there. Most governments don't want to agree to the fact that Bitcoin is money, not because it lacks what it takes to be stable, but because they know its capabilities and are afraid of them. I really don't support the motion for Bitcoin to ever be stable. There should always be a drastic movement in price; either it goes up or it drops. The price shouldn't settle just at one point; it really doesn't make sense that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 10, 2023, 03:01:24 AM",
      "body": "OP, nobody has ever said Bitcoin will be stable one day. It will never be stable. It trades in an open market. Price is dictated by the market. It will always move up and down everyday.Even national currencies aren't stable, they move up and down, just less (though of course they in general lose value every year due to inflation as well). And they are even highly manipulated by central banks and govts to try to keep them stable, and they still aren't stable. However, national currencies may SEEM stable within the country they are being used primarily because of MSRP. MSPR is the thing that keeps products at a consistent value, not the stability of a currency. Notice how stuff like food constantly changing price, specifically stuff like produce. But packaged products with an MSRP aren't, in order to keep prices stable for consumers. If it wasn't for MSRP prices of everything would be going up and down as they become more and less available. That up and down would be affected by both the supply and demand of the product as well as the changing value of the currency.Basically, no, Bitcoin will never be stable, and no, it doesn't need to be stable. It will get MORE stable over time, as it has already been doing since it first got a market value 13 years ago. It will continue to get more stable as it matures and the price becomes harder to move as the market cap rises and the growth of it steadies out as it becomes more adopted, but it will never be stable because that is impossible. It doesn't need to be stable because why would it? You got to a store and you pay in bitcoin whatever the price is. Doesn't matter if the price went up or down a percent from the previous day.They key is that once people have owned Bitcoin for awhile they will always be in the green so its not like they will ever be spending bitcoin they lost money on. I wouldn't expect people to spend Bitcoin they just received while we are still going through massive 4 year market cycles. But eventually once it is much less volatile (but never stable) that won't be a concern.There is a reason why a currency being organically adopted from 1 person to global must go through speculation phase first, then store of value phase, then i guess you could save savings phase, and finally the last phase is the transactional phase. Because it takes time for adoption to mature and volatility to go down, and also for people to have owned it long enough so that they don't mind spending it whether the price is up a little or down a little, before people are readily willing to spend it at all times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "May 10, 2023, 03:09:36 AM",
      "body": "The reason why BTC is still volatile because of not many people are use it due to some countries ban, have a bad impression, lack of money etc. Although everyone can buy Bitcoin, but maybe only 1% of population in this world is adopt Bitcoin, if it's adopted more than 80%, the BTC price would be more stable. If BTC price now drop for $5,000, it's high because $5,000 from $27,500 is around 18%. But if BTC price hit $1,000,000 and the price is decrease for $5,000, we will not see it's a big volatility because the change is less than 1%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "May 10, 2023, 03:20:59 AM",
      "body": "Bitcoin will never be as \"stable\" as something like the USD — heck, even gold isn't that stable. It's just that as time goes and as more and more people use bitcoin, bitcoin wouldn't be as volatile as it is today.Quote from: crypticj on May 10, 2023, 02:19:02 AMJust look at what people are saying right now, experts say that people shouldn't hold USD because inflation is just 5% a year, but imagine if you have bitcoin that can go down like 5% a day because some whales sold it. It will be problematic for people to use it on a daily basis because of that.Because you don't buy your bitcoin to immediately sell it in a day. Usage-wise, probably wait for it to appreciate by a few points before actually using it. There's a reason it's almost never recommended to go 100% on bitcoin — always leave room for your fiat currency",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "May 10, 2023, 03:35:47 AM",
      "body": "Quote from: crypticj on May 10, 2023, 02:19:02 AMI was thinking about Bitcoin as a currency a lot lately and I have some doubts about how currently we see its future.The problem is, in order for Bitcoin to become a currency everyone will use, it should be stable. I know that you might say that people will still use it because it's not about stability, it's about freedom and technology. I agree with that, but Bitcoin needs to be stable in order for people to treat it like money, and not like an asset. Just look at what people are saying right now, experts say that people shouldn't hold USD because inflation is just 5% a year, but imagine if you have bitcoin that can go down like 5% a day because some whales sold it. It will be problematic for people to use it on a daily basis because of that.I know that people say that when Bitcoin will be adopted, it should become stable because there is a limited amount of it, but I don't see how it's gonna happen. From what I see people treat bitcoin as an asset to invest and hold and I can't imagine that will change in the future.Why do you guys think Bitcoin will really become the \"money of the future\" and people will actually use it like one?From what I see, I think it's possible that people in the future will still trade bitcoin or try to buy as much of it as possible to manipulate the market.The initial plan why bitcoin was invented was altered by whales who bought from panic sellers at the early stage. Since then it seems some set or group controls the market but not withstanding, Satoshi Nakamoto invented the bitcoin to stand in place of money whereby bitcoin would be used for daily transaction or payment for goods and services in our various locations.Since the initial plans did not go well as planned, then whales resolved to turning it into an investment for which they succeeded as they have a big chunk of the coin in their possession and they decide what ever direction the market would hence the market volatility  and this is one of the beauties of the Bitcoin. It was never going to be stable because it was turned into store of value whereby one can use bitcoin to measure and store his or her assets online which made it the digital gold it is popularly known for and by the virtue of bitcoin being the first digital currency to have existed.The market volatility allows for more investors to get hold of bitcoin there by increasing the numbers of holders since it is just 21,000,000 of it as total supply. The higher the holders of bitcoin the more it is in circulation and the possibility of price increment when the demand for it increases. At then every  little fraction of bitcoin would definitely count.The idea of bitcoin been stable is not feasible because of  its nature and market demand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hitsnorth",
      "created_time": "May 10, 2023, 05:19:11 AM",
      "body": "Quote from: mk4 on May 10, 2023, 03:20:59 AMBitcoin will never be as \"stable\" as something like the USD — heck, even gold isn't that stable. It's just that as time goes and as more and more people use bitcoin, bitcoin wouldn't be as volatile as it is today.Quote from: crypticj on May 10, 2023, 02:19:02 AMJust look at what people are saying right now, experts say that people shouldn't hold USD because inflation is just 5% a year, but imagine if you have bitcoin that can go down like 5% a day because some whales sold it. It will be problematic for people to use it on a daily basis because of that.Because you don't buy your bitcoin to immediately sell it in a day. Usage-wise, probably wait for it to appreciate by a few points before actually using it. There's a reason it's almost never recommended to go 100% on bitcoin — always leave room for your fiat currencyTrue, I don't really understand why people still talking about BTC becoming stable. It's not even possible. Yes, it won't be as volatile as it was for the last decade, but still, there is a big room for growth. And you can't rely only on Bitcoin anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoBuds",
      "created_time": "May 10, 2023, 05:23:05 AM",
      "body": "Bitcoin is decentralized, so it is difficult to control and cannot become stable like USD or national currencies. But its volatility can decrease over time as it gets bigger and bigger. But honestly, it wouldn't be interesting if that happened. What do we enter the market for? It's for profit, so if bitcoin stabilizes we won't have any reason to be here anymore. I don't know what people want, but I never expected bitcoin to become stable. The more volatile Bitcoin is, the more interesting I am because I can take advantage of that volatility to make a lot of profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danskgraes",
      "created_time": "May 10, 2023, 05:57:15 AM",
      "body": "The future of Bitcoin as the world's currency is a topic that could fuel a thousand debates. It's like trying to predict if aliens will be wearing Bitcoin t-shirts in a century. Stability is definitely a big hurdle, but hey, let's remember that change is the only constant. With technological advancements and evolving mindsets, who knows what surprises the future holds? Just buckle up and enjoy the crypto roller coaster!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "May 10, 2023, 06:02:39 AM",
      "body": "Quote from: crypticj on May 10, 2023, 02:19:02 AMI was thinking about Bitcoin as a currency a lot lately and I have some doubts about how currently we see its future.The problem is, in order for Bitcoin to become a currency everyone will use, it should be stable. I know that you might say that people will still use it because it's not about stability, it's about freedom and technology. I agree with that, but Bitcoin needs to be stable in order for people to treat it like money, and not like an asset. Just look at what people are saying right now, experts say that people shouldn't hold USD because inflation is just 5% a year, but imagine if you have bitcoin that can go down like 5% a day because some whales sold it. It will be problematic for people to use it on a daily basis because of that.I know that people say that when Bitcoin will be adopted, it should become stable because there is a limited amount of it, but I don't see how it's gonna happen. From what I see people treat bitcoin as an asset to invest and hold and I can't imagine that will change in the future.Why do you guys think Bitcoin will really become the \"money of the future\" and people will actually use it like one?From what I see, I think it's possible that people in the future will still trade bitcoin or try to buy as much of it as possible to manipulate the market.The price of Bitcoin is already stable. 1 BTC = 1 BTC.When/if the adoption and usage of Bitcoin against Fiat flips, things will begin to be priced in Bitcoin. People will not even want dollars, they will want Bitcoin. An example of why this would happen would be if fiat money, let's use USD as an example, devalues so much that you're paying $200 for a loaf of bread which otherwise would have costed $2 in non-hyperinflation times. By this logic, 1 BTC = something like $20,000,000. With this ratio, 1 loaf of bread = 0.00001 BTC. Let's assume that USD is well and truly destroyed at this point  and the rate of Bitcoin fluctuates between $15,000,000 and $25,000,000 over time, which is still quite volatile. 0.00001 BTC will be worth $150 or $250 in this fluctuation. Or, it will be worth 0.00001 BTC and its value will be unchanged. The example is kind of rough and quickly thought out, however I am sure that my point is coming across, being:One day, fiat money will be so weak that its value will be irrelevant, and goods and services will have to be priced in Bitcoin in order for merchants to receive a stable income. The day that goods and services begin to be priced in Bitcoin, is the day that fiat can be considered completely irrelevant. The only physical thing that Bitcoin could be valued against at this stage might be metals such as gold and silver.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crypticj",
      "created_time": "May 10, 2023, 06:21:50 AM",
      "body": "Quote from: electronicash on May 10, 2023, 02:31:37 AMBTC's unpredictable price is also a positive attribute that Bitcoiners like. you can make money out of this inflation. but BTC may not become stable due to the cycles, when the cycles probably are over like all 21M coins are already mined, I think there will be stability of price. Yes, but that's the problem. When you say that we can make money out of it, it means that you treat it like an asset and not like money to pay for everyday stuff. You can treat it like both, but for most people there fluctuations will be a bad sign because you can not only earn some money out of it, but also lose them due to the dip.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "May 10, 2023, 06:28:07 AM",
      "body": "Bitcoin has its value and is convertible into any currency people want, so I don't think it's going to have to become a fiat currency, like gold or many other asset of other value one can use fiat to trade them with each other. I don't think of a future where there is only one common currency, but instead a harmony of valuable assets, the volatility of bitcoin against fiat will forever be, and indeed people will still use it without its stability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "May 10, 2023, 06:33:33 AM",
      "body": "Quote from: crypticj on May 10, 2023, 06:21:50 AMYes, but that's the problem. When you say that we can make money out of it, it means that you treat it like an asset and not like money to pay for everyday stuff. You can treat it like both, but for most people there fluctuations will be a bad sign because you can not only earn some money out of it, but also lose them due to the dip.If you worried about Bitcoin dump and it make the price decrease, what's the difference with fiat where every year your money's value will decrease? Bitcoin has a chance to lose it's price and at the same it has a chance you would make profit during bull run, while fiat money's value will always decrease and has no chance the value will increase.I will give a bold statement: If you're think Bitcoin can't become a currency and you don't want to use it as a currency, that's OK! it's up to everyone choice!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stella Mese",
      "created_time": "May 10, 2023, 06:38:58 AM",
      "body": "I also don't know when the bitcoin price will stabilize, but even so, in my opinion, BTC can still be used as a digital currency, but with the condition that you have to be able to accept the risk of paying using BTC because the price fluctuates.so the point in this case is to know the risks,so in my opinion btc with fluctuating prices will actually provide big profits as long as people who make buying and selling transactions must be patient and set a good strategy in order to get big profits.so if you don't want to take the risk, in my opinion, don't use btc as a means of payment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "May 10, 2023, 07:10:37 AM",
      "body": "Bitcoin is very difficult to become a stable currency, firstly because Bitcoin is decentralized so there are no rules or regulations that can really bind Bitcoin, secondly Bitcoin is traded on exchanges on a large scale so traders will continue to influence prices to go up or down as a way to benefit from the activities they do.Fluctuations in the price of Bitcoin actually benefit many people who can understand how it works and hopes for Bitcoin to become a stable currency will probably happen for a very long time or even won't happen at all, because Bitcoin is considered an investment asset its price must rise to provide returns to investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "May 10, 2023, 07:28:26 AM",
      "body": "The term you use is not appropriate here mate , because to become Stable? that is even coming in the long future.bitcoin will always be use as trading money but will also use as real money and that is the reality here , your perception has potential but not in the soonest time .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "May 10, 2023, 07:36:43 AM",
      "body": "Quote from: crypticj on May 10, 2023, 06:21:50 AMQuote from: electronicash on May 10, 2023, 02:31:37 AMBTC's unpredictable price is also a positive attribute that Bitcoiners like. you can make money out of this inflation. but BTC may not become stable due to the cycles, when the cycles probably are over like all 21M coins are already mined, I think there will be stability of price. Yes, but that's the problem. When you say that we can make money out of it, it means that you treat it like an asset and not like money to pay for everyday stuff. You can treat it like both, but for most people there fluctuations will be a bad sign because you can not only earn some money out of it, but also lose them due to the dip.That's the reason why Bitcoin will never become a stable currency. Even fiat currency can't be considered stable because the price of it still moves, and so is Bitcoin.The fact that people see Bitcoin as an asset where they can make money from it makes Bitcoin excluded from it being a stable currency. Some see it as an asset, and some see it as a currency, and this kind of thinking towards Bitcoin is the reason why it will never be a stable currency. Fluctuations will be a bad sign? Volatility is a double-edged sword. It can give you profits, but at the same time it can also give you losses, and it all depends on the investor. Bitcoin will never stabilize, as some of the investors see it as an asset like Gold, Silver, or the Stock Market as a whole. I guess it's a good thing that Bitcoin is a currency where we can use it to buy stuff, but at the same time, it can be an asset where people can make money off of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jet Cash",
      "created_time": "May 10, 2023, 07:53:00 AM",
      "body": "Bitcoin will never become a currency - stable of otherwise. When the bankers created it, they built in a few characteristics that meant it could never be used as a mass global currency. The 21 million cap on Bitcoins is one factoir, the 10 minute block generation, and that fact that you need five confirmations to be sure of a transfewr is anoither.  The trhird factor is the variability of the miners' fees, CBDCs will be free and instant, and Bitcoin can't cope with that. Howevwe, Bitcoins strengths which have been well documented will ensure that it will be a secure store of wealth, and an efficient and secure medium of exchange. The latter characteristics make it a far better investment than a Government/bankers' currency in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 10, 2023, 07:57:32 AM",
      "body": "Quote from: crypticj on May 10, 2023, 02:19:02 AMThe problem is, in order for Bitcoin to become a currency everyone will use, it should be stable. Bitcoin was created to be an unstable coins, it can not become stable.Quote from: crypticj on May 10, 2023, 02:19:02 AMJust look at what people are saying right now, experts say that people shouldn't hold USD because inflation is just 5% a year, but imagine if you have bitcoin that can go down like 5% a day because some whales sold it. It will be problematic for people to use it on a daily basis because of that.You are not looking at the reality, that bitcoin will increase in price and reach all-time-high. Bitcoin volatility has helped many people to make money.Quote from: crypticj on May 10, 2023, 02:19:02 AMI know that people say that when Bitcoin will be adopted, it should become stable because there is a limited amount of it, but I don't see how it's gonna happen. From what I see people treat bitcoin as an asset to invest and hold and I can't imagine that will change in the future.Who is saying that? I have not heard that from anyone before.Quote from: crypticj on May 10, 2023, 02:19:02 AMI know that people say that when Bitcoin will be adopted, it should become stable because there is a limited amount of it, but I don't see how it's gonna happen. From what I see people treat bitcoin as an asset to invest and hold and I can't imagine that will change in the future.Bitcoin is actually an asset. Bitcoin is money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}