{
  "id": "topic_5503552",
  "title": "Free Market Capitalist",
  "author": "Free Market Capitalist",
  "created_time": "July 20, 2024, 02:26:22 AM",
  "content": "At the moment it seems to be just a rumor but it has already been echoed in several media, so I think it is worth bringing it here. QuoteFormer US president and current Republican presidential candidate Donald Trump could announce Bitcoin as a “strategic reserve asset” during a crypto conference in Nashville later this month, according to rumors on social media.Trump is widely expected to speak at the upcoming Bitcoin conference in Nashville, which will take place later this month.Dennis Porter, co-founder and CEO of the Satoshi Action Fund, said he got this information from “credible” sources.“Adding #Bitcoin as a ‘strategic reserve’ to the US Treasury is a no brainer and once the USA does it, the paradigm will shift and the world will understand they must also have a #Bitcoin position,” he wrote on X.Read more on:Trump potentially declaring Bitcoin a strategic reserve asset seen as a ‘watershed moment’I think if it came true this would be huge. But that's a big if. What do you think about it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5503552",
  "comments": [
    {
      "author": "honestworker",
      "created_time": "July 20, 2024, 04:34:57 AM",
      "body": "We should go all in now. Bitcoin bull run is now confirmed if the news comes true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Btcdeybodi",
      "created_time": "July 20, 2024, 05:20:01 AM",
      "body": "Just hope all these doesn't end in political propaganda in order to gain political influence because since a lot of politicians have discovered that Bitcoin is gaining more attention globally, they will choose to engage in discussions about possible adoption of Bitcoin just for political favours. For some time now the news about Donald Trump's interest in Bitcoin have been spreading across social media platforms so if he completely has the interest of Bitcoin at heart then it's really gonna be a win for we the Bitcoin lovers. Just wish rumors about Bitcoin heading towards adoption comes to reality  What if he announces Bitcoin as a strategic reserved asset will the Americans be excited about it? I mean this development might devalue the dollars that has been a global reserve currency since America became world power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slaman29",
      "created_time": "July 20, 2024, 07:02:44 AM",
      "body": "Don't care Trump or Biden or whatever president, but watershed reserve sounds like too much of a huge step forward.Federal Reserve would never allow it, so I think they will ensure all the politicians never pass such a proposal.USD will crash and burn even earlier than we expected if this really happens!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "July 20, 2024, 08:37:13 AM",
      "body": "The real question is, is he sitting on a pile of Bitcoin right now? Knowing that could tell us what he might do next. Everyone loves money, but come on, rich folks are kinda obsessed with it, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "July 20, 2024, 11:58:02 AM",
      "body": "Quote from: slaman29 on July 20, 2024, 07:02:44 AMDon't care Trump or Biden or whatever president, but watershed reserve sounds like too much of a huge step forward.Federal Reserve would never allow it, so I think they will ensure all the politicians never pass such a proposal.USD will crash and burn even earlier than we expected if this really happens!Can the Fed intervene in this? I don't think the Fed will have the right to intervene and it is US Congress who makes the decision because this is the country's strategic reserve fund.But I also don't think this will happen anytime soon even if Mr. Trump actually proposes this to Congress. After all, we need to admit that bitcoin is still too young and still has potential risks, governments will not rush to use bitcoin as a national reserve strategic asset. I think he's just exaggerating. Also, I don't think if that comes true it will affect the USD, bitcoin is just considered an asset similar to gold, it won't damage or crash the USD. Trump's mission is to protect the USD, so I think he will not make proposals that will affect the future of the USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "July 20, 2024, 12:34:56 PM",
      "body": "I personally believe it may be just another PR stunt from Trump just to win some votes.He further said that he would be using bitcoin to back the USD which sounds insane and too good to be true.Even if he wins the elections, there is not guarantee that he would be promoting the use of bitcoin or use it to back USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "July 20, 2024, 01:18:40 PM",
      "body": "Quote from: honestworker on July 20, 2024, 04:34:57 AMWe should go all in now. Bitcoin bull run is now confirmed if the news comes true. Of course this initiative will certainly boost the bitcoin price if it's initiated. Donald Trump has been spitting fire in support of the bitcoin community, and we hope some of this his promises will come into limelight if he wins the election by November. Let's just keep our fingers crossed  and watch how things unfold, because politicians can make some exciting statement just to boost our morale so they can garner support for their political ambition, but we are hopeful of Donald trump to be a man of his words.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "July 20, 2024, 01:48:10 PM",
      "body": "Quote from: Poker Player on July 20, 2024, 02:26:22 AMTrump potentially declaring Bitcoin a strategic reserve asset seen as a ‘watershed moment’Something stinks with this news.I think they are all playing some dirty tricks with bitcoin, and I don't believe that US will ever use bitcoin as strategic reserve.First red flag for me is the flag that Blackrock is purchasing so many bitcoins, Germany sold everything and now there are speculations about UK doing the same.I don't trust anything coming from politician puppets like Trump or Biden, and we should be ready for potential bumpy road ahead in bitcoin and all other markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "July 20, 2024, 02:27:11 PM",
      "body": "Quote from: Poker Player on July 20, 2024, 02:26:22 AMAt the moment it seems to be just a rumor but it has already been echoed in several media, so I think it is worth bringing it here. QuoteFormer US president and current Republican presidential candidate Donald Trump could announce Bitcoin as a “strategic reserve asset” during a crypto conference in Nashville later this month, according to rumors on social media.Trump is widely expected to speak at the upcoming Bitcoin conference in Nashville, which will take place later this month.Dennis Porter, co-founder and CEO of the Satoshi Action Fund, said he got this information from “credible” sources.“Adding #Bitcoin as a ‘strategic reserve’ to the US Treasury is a no brainer and once the USA does it, the paradigm will shift and the world will understand they must also have a #Bitcoin position,” he wrote on X.Read more on:Trump potentially declaring Bitcoin a strategic reserve asset seen as a ‘watershed moment’I think if it came true this would be huge. But that's a big if. What do you think about it?Although all his moves are seeming real in Favour of bitcoin and seeming discoveries after badmouthing it previously during his tenure, I still kinds tie these big moves to his political ambition, politicians can gather as many allies as they can to get proper funding and make it to office and change their minds afterwards. Its a rumour still anyways, lets calm down and hear from the horse's mouth before we start drawing conclusions. Its still a good development if he is real in his developed trust and recognition of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "July 20, 2024, 04:15:36 PM",
      "body": "Quote from: dkbit98 on July 20, 2024, 01:48:10 PMI think they are all playing some dirty tricks with bitcoin, and I don't believe that US will ever use bitcoin as strategic reserve.They know their leadership position and if they do that, use Bitcoin as part of their national treasury reserve strategically, it will trigger many other nations to follow the USA. It's not the time for the USA. to do this but they can buy benefit of doubt, get votes from undecided, swing citizens for the coming President election.QuoteFirst red flag for me is the flag that Blackrock is purchasing so many bitcoinsThey got support from US government to take down Binance before the Bitcoin Spot ETF approval that benefits BlackRock, the US. company.QuoteI don't trust anything coming from politician puppets like Trump or Biden, and we should be ready for potential bumpy road ahead in bitcoin and all other markets.They do their jobs as politicians and we can do our jobs, assess their words, promises and their actions. Talk for myself, trusting politicians is not my favorite practice because I agree with you, I can not trust politicians. Listen to them and have different plans for myself, if they keep their promise or if they don't keep their promise, having two plans can help me to adapt myself better to policians and their administration and regulatory policies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "legiteum",
      "created_time": "July 20, 2024, 04:36:39 PM",
      "body": "Wow, the people wanting this are fools. I don't know how else to put it.If the US taxpayers pay to make the Bitcoin market go up, then US taxpayers will want something in return.Hence the \"strategic reserve\" would lead directly to Bitcoin becoming part of the US government, and it's price would be regulated by popular vote.And then US voters will vote for whether they think Bitcoin's billionaire holders should be given more money that year. Spoiler alert: voters tend to hate billionaires who profit from the the meager taxes they pay. Average Joe is going to get pretty pissed off if he learns that the taxes he just paid made Elon Musk another 10 billion dollars, and populist politicians will make a meal out of this.\"Live by the sword, die by the sword.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "snerd",
      "created_time": "July 20, 2024, 05:00:23 PM",
      "body": "Quote from: legiteum on July 20, 2024, 04:36:39 PMWow, the people wanting this are fools. I don't know how else to put it.If the US taxpayers pay to make the Bitcoin market go up, then US taxpayers will want something in return.Hence the \"strategic reserve\" would lead directly to Bitcoin becoming part of the US government, and it's price would be regulated by popular vote.And then US voters will vote for whether they think Bitcoin's billionaire holders should be given more money that year. Spoiler alert: voters tend to hate billionaires who profit from the the meager taxes they pay. Average Joe is going to get pretty pissed off if he learns that the taxes he just paid made Elon Musk another 10 billion dollars, and populist politicians will make a meal out of this.\"Live by the sword, die by the sword.\"There you go again! Always ready with a defense of your senile old fossil lolol!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "July 20, 2024, 05:05:32 PM",
      "body": "Quote from: legiteum on July 20, 2024, 04:36:39 PMWow, the people wanting this are fools. I don't know how else to put it.If the US taxpayers pay to make the Bitcoin market go up, then US taxpayers will want something in return.Hence the \"strategic reserve\" would lead directly to Bitcoin becoming part of the US government, and it's price would be regulated by popular vote.And then US voters will vote for whether they think Bitcoin's billionaire holders should be given more money that year. Spoiler alert: voters tend to hate billionaires who profit from the the meager taxes they pay. Average Joe is going to get pretty pissed off if he learns that the taxes he just paid made Elon Musk another 10 billion dollars, and populist politicians will make a meal out of this.\"Live by the sword, die by the sword.\"You don't understand how little they think of voters.Two quotes may help.\"Suckers and losers\"\"You have to pay to play\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "July 20, 2024, 05:49:02 PM",
      "body": "With all this saga, I keep wondering why Trump finally had a sudden change of mind towards Bitcoin. Why all the sudden praise for Bitcoin, or was it that he never realized it when he first ran for president in 2017? There was a BBC report in 2021 in which he clearly stated that he doesn't like Bitcoin because it's competing with the dollar. If Bitcoin is declare as a strategic reserve, what are the chances that it will not still compete with the dollar, which was Trump's fear in 2021?\"Bitcoin, it just seems like a scam,\" Mr Trump said. \"I don't like it because it's another currency competing against the dollar.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "July 20, 2024, 05:50:23 PM",
      "body": "Once again, this is election season. Second, Donald Trump loves to talk. He's always been so generous with his words. This isn't his first pronouncement in supporting Bitcoin. This won't be the last either. There'll be more to come. And if we end up making a big deal out of each of his statement, the joke's probably on us. Trump said that he'll end Biden's war on crypto. He also said that Bitcoin's future will be made in America. And he also divulged that JPMorgan's Jamie Dimon, one of Bitcoin's harshest critics, has already changed his stand on Bitcoin a bit. Trump also mentioned that he doesn't want another country to dominate Bitcoin and that it won't go away. He even claimed that China is into Bitcoin and that the US should compete against China. The catch, however, is that he said all of these while courting for votes. Around two years ago, my country's president said in his campaigns that he will bring down the price of rice to $0.34. Now, it's already $1.15 per kilo. There's a reason why they're called politicians. LOL!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "July 20, 2024, 05:58:54 PM",
      "body": "Quote from: honestworker on July 20, 2024, 04:34:57 AMWe should go all in now. Bitcoin bull run is now confirmed if the news comes true. Even if this news does not become true, even then the bull run is confirmed. There should be no doubt about it. The increasing popularity of the bitcoin and the institutional investments / ETF are enough for the bitcoin bull market confirmation.Regarding going all into Bitcoin is not recommended, even if Trump declare a Bitcoin strategic reserve. Yes you should invest in bitcoin only the amount that is surplus with you and you can afford to lose. Going all in is like gambling and you should be careful with all investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "July 20, 2024, 09:08:11 PM",
      "body": "Quote from: Poker Player on July 20, 2024, 02:26:22 AMAt the moment it seems to be just a rumor but it has already been echoed in several media, so I think it is worth bringing it here. QuoteFormer US president and current Republican presidential candidate Donald Trump could announce Bitcoin as a “strategic reserve asset” during a crypto conference in Nashville later this month, according to rumors on social media.Trump is widely expected to speak at the upcoming Bitcoin conference in Nashville, which will take place later this month.Dennis Porter, co-founder and CEO of the Satoshi Action Fund, said he got this information from “credible” sources.“Adding #Bitcoin as a ‘strategic reserve’ to the US Treasury is a no brainer and once the USA does it, the paradigm will shift and the world will understand they must also have a #Bitcoin position,” he wrote on X.Read more on:Trump potentially declaring Bitcoin a strategic reserve asset seen as a ‘watershed moment’I think if it came true this would be huge. But that's a big if. What do you think about it?I think it’s absolutely epic. Just the fact that this is a huge topic of discussion because it is so relevant, we are seriously witnessing history and we will tell our kids about all this stuff that happened one day. The stakes are so high right now, Trump promotes freedom so Bitcoin is an obvious choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 21, 2024, 04:19:39 AM",
      "body": "Quote from: FatFork on July 20, 2024, 08:37:13 AMThe real question is, is he sitting on a pile of Bitcoin right now? Knowing that could tell us what he might do next. Everyone loves money, but come on, rich folks are kinda obsessed with it, right?It does not appear that Trump has Bitcoin, although we cannot know for sure, the one he does have and has declared it is the VP pick.https://investorplace.com/2024/07/j-d-vance-is-the-first-bitcoin-holder-on-a-presidential-ticket-heres-everything-we-know-about-his-position/I'm not going to give this much more thought until the rumor is confirmed or disproved. If it is confirmed it will be huge, that's for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 21, 2024, 04:31:45 AMLast edit: July 21, 2024, 04:48:12 AM by mindrust",
      "body": "Quote from: honestworker on July 20, 2024, 04:34:57 AMWe should go all in now. Bitcoin bull run is now confirmed if the news comes true. That’s a big risk because it is just a rumor. If it turns out to be a lie, bitcoin would dump hard and that means the people who spread this rumor used it to empty their bags on people like you from a higher price.Never go all in on any asset. Be smart, diversify.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}