{
  "id": "topic_5427731",
  "title": "hZti",
  "author": "hZti",
  "created_time": "December 10, 2022, 11:56:44 AM",
  "content": "From what I have understood, a bitcoin miner that is connected to a pool, will constantly solve shares and submit them to the pool. Once a miner finds the \"golden\" share that is more than the current difficulty the pool will be rewarded with the block. The block is shared based on the reward system, wich will reward all miners for their effort, even if they just contributed worthless shares for this block.Now my idea (that I hope somebody can explain why it won't work) comes to play. What if you would recode the mining software, that all your \"worthless\" shares, that still get paid if somebody else finds a block, are directed to a mining pool and if you would find the \"golden\" share that solves the block it will get recognized and sent to a solo mining block instead. Is this possible?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427731",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "December 10, 2022, 02:30:19 PM",
      "body": "Short version, no you can't.Longer version that is not technically 100% correct but close enough to get the point across: Part of the data that is sent from the pool to your miner to be worked on contains data that is only relevant to that share for that pool. Submitting it elsewhere will not work.Edit: Take a look at this post: https://bitcointalk.org/index.php?topic=5397166.msg60503248#msg60503248 more or less if you decode what is given to you from the pool which is what data you are working with it has the pool address, you can't change it without changing what you are working on. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 10, 2022, 09:25:59 PM",
      "body": "Thanks for the reply! I was thinking about it being an issue about how blocks are solved, but in reality the shares are controlled by the pool, so obviously the solution is much simpler. In any case this was very helpful, since there is not to much information about the technical details of mining around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 10, 2022, 10:16:52 PM",
      "body": "Quote from: hZti on December 10, 2022, 09:25:59 PMThanks for the reply! I was thinking about it being an issue about how blocks are solved, but in reality the shares are controlled by the pool, so obviously the solution is much simpler. In any case this was very helpful, since there is not to much information about the technical details of mining around.There actually is a fair amount, but you really have to dig for it. Much like the post I referenced things are buried in the middle of a post about something else. Or a comment 4 pages in holds a lot of information that you would not find unless you happen to stumble upon it.I think a lot of that comes back to at least now it's buy miner, plug in miner, point at pool.Back in the early days there tended to be a lot more you had to sit there and figure out so when someone asked a question like you did I would not have had to sit there trying to remember where I saw that post with the info. There were so many you could find it in 20 seconds.The biggest issues today is probably the other way in the fact that pools can steal blocks. Unless you are monitoring you miners to see if they found a block and comparing it to what the pool says. Assuming they even have something that shows who founds a block then on a PPLNS pool you might never know that your miner found a block but the pool had sent you another address that instead of going to the public address of the pool and the miners went into the operators pocket. You just have to trust the operators.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "December 10, 2022, 10:20:06 PM",
      "body": "Quote from: DaveF on December 10, 2022, 10:16:52 PMQuote from: hZti on December 10, 2022, 09:25:59 PMThanks for the reply! I was thinking about it being an issue about how blocks are solved, but in reality the shares are controlled by the pool, so obviously the solution is much simpler. In any case this was very helpful, since there is not to much information about the technical details of mining around.There actually is a fair amount, but you really have to dig for it. Much like the post I referenced things are buried in the middle of a post about something else. Or a comment 4 pages in holds a lot of information that you would not find unless you happen to stumble upon it.I think a lot of that comes back to at least now it's buy miner, plug in miner, point at pool.Back in the early days there tended to be a lot more you had to sit there and figure out so when someone asked a question like you did I would not have had to sit there trying to remember where I saw that post with the info. There were so many you could find it in 20 seconds.The biggest issues today is probably the other way in the fact that pools can steal blocks. Unless you are monitoring you miners to see if they found a block and comparing it to what the pool says. Assuming they even have something that shows who founds a block then on a PPLNS pool you might never know that your miner found a block but the pool had sent you another address that instead of going to the public address of the pool and the miners went into the operators pocket. You just have to trust the operators.-DaveOr mine at a pps+ pool where you know what they will pay in advance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 11, 2022, 01:20:13 PM",
      "body": "Quote from: philipma1957 on December 10, 2022, 10:20:06 PMOr mine at a pps+ pool where you know what they will pay in advance.Agreed, and that's what I do but it's more a theoretical discussion about what can be done not what really is going on out there.I would be more worried at this point about small PPLNS pools going away and all that time and hash being wasted then anything else. And the fact that so many pools still do not use dnssec [ https://www.icann.org/resources/pages/dnssec-what-is-it-why-important-2019-03-05-en ] for their domains means that a crafty enough person can just re-direct hash if they can poison the DNS resolver you use.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "December 17, 2022, 10:12:29 PM",
      "body": "Quote from: hZti on December 10, 2022, 09:25:59 PM but in reality the shares are controlled by the pool, so obviously the solution is much simpler. shares are not controlled by the pool, they are controlled by the miner, however, the outcome of those shares is made up of a few aspects, one being the coinbase transaction, which tells the mining/non-mining nodes who gets the block rewards.So even if you managed to somehow broadcast that shares outside of the pool, the payout will still go to that pool if it contains their btc address in the coinbase transaction, they only reason the pools pays you BTC for shares you submit is that fact that your share contains their btc address as the payout address if the address is anyone else's they will simply reject the share.Quote from: DaveF on December 11, 2022, 01:20:13 PMQuote from: philipma1957 on December 10, 2022, 10:20:06 PMOr mine at a pps+ pool where you know what they will pay in advance.I would be more worried at this point about small PPLNS pools going away and all that time and hash being wasted then anything else. There seem to be more issues with using PPLNS pools even the large ones, one of the largest Non-PPS pools had a bad month last month, something like 20% less rewards throughout the whole month, some people say this is bad luck, some say it's bad software, it could be anything for all I know but it wouldn't change the outcome.If it was bad luck, with profitability being this low, a 20% drop in rewards is probably going to hurt most miners, also, I tend to believe that pools that offer PPS payouts have more reasons to continuously check their code/servers and every tiny aspect of their infrastructure because every block the pool loses will have to be paid from their own pockets, pools that play by the \"if we find blocks we pay you, if we don't we don't\" have fewer incentives in keeping everything in a perfect shape.Of course, it doesn't mean they will intentionally lose blocks because they still want to get the fees, since they pay for employees and servers, but they are not under enough pressure in many cases, I would still point out the fact that there are likely better built and maintained PPLNS pools than some PPS pools but why would I count on that? what reasons do I have to take any risks when I can pay slightly more fees to know in advance that I will get x btc -+1-2% for the next 2016 blocks whether the pool had a software bug or a node server go down?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "December 21, 2022, 12:27:24 PM",
      "body": "Was thinking about this some more, once again in the purely theoretical view and part of me wonders if the fact that some places are using multiple providers for their stratum servers which then connect back to the pool can be an issue.---note just a random thought not saying it has happened or is happening---But if I know us-stratum.thepool.com is being hosted on my network but the actual back end node for thepool.com is someplace else is the operator does not have any form of encryption / VPN / whatever between the 2 I could sit there all day [or at least a program monitoring the routers can] and drop the occasional share that found a block.The pool would just see it as lost work after the miner did not respond and send a new job, the miner would think it found something but unless you check it you might never know.If I know a lot of hash is coming though from one set of IPs then I can actually have my routers bounce it out before since I know the incoming address and outgoing address.A lot of work just to screw with a miner or pool, but it could be done.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 26, 2022, 12:08:15 PM",
      "body": "Quote from: DaveF on December 21, 2022, 12:27:24 PMA lot of work just to screw with a miner or pool, but it could be done.Sounds interesting even if it seems that nobody does it. Since one block is already 6.25 BTC you could not really easily keep one for yourself without making a quite big drop in the pool reward. But who knows what criminal energy this idea sparked",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}