{
  "id": "topic_5401163",
  "title": "HolidayHam",
  "author": "HolidayHam",
  "created_time": "June 02, 2022, 09:43:44 PM",
  "content": "Dude I keep going back n forth between quitting gambling and n then going back. Therefore I'm selling my stake account again. This time somebody should actually buy it, it honestly amazes me how anyone could pass it up but then again I haven't really made the effort to sell it. anyway, It would be helping me and it's 1% away from platinum 2 which is $600 in instant bonus (base bonus and recent gameplay bonus) that you can withdraw immediately and a 28 day reload (10-20 per day for 28 days). I'm done with the account. It's a verified account. No issues with transferring money to your crypto wallet..selling for only $150. Will also include email access to the email account associated with it. Plz be BTC ready.contact me on telegram @gr200188 or Whatsapp (831) 291-1514 or cell (831) 291-1514",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401163",
  "comments": [
    {
      "author": "yahoo62278",
      "created_time": "June 02, 2022, 09:51:22 PM",
      "body": "If you read Stake's ToS you will find it is illegal to sell your Stake account. Specifically 3. Stake Account - Registration You are prohibited from selling, transferring or acquiring Player Accounts to or from other Players.. This is found https://stake.com/policies/terms.Really makes no sense that you would try to sell an account for $150 that is close to getting a $600 bonus and a decent reload. Sound like a sure way for a user to get scammed dealing with you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "June 03, 2022, 07:47:06 PM",
      "body": "Quote from: yahoo62278 on June 02, 2022, 09:51:22 PMReally makes no sense that you would try to sell an account for $150 that is close to getting a $600 bonus and a decent reload. Sound like a sure way for a user to get scammed dealing with you.No one will sell a platinum 1 rank account which is only 1% away from the platinum 2. However, the rank up bonus is $400 for platinum 2. Recent gameplay activity won't give $200 extra. It is easy to complete the remaining 1% wager with the bankroll of $60. So, it doesn't make sense to sell such accounts for $150 only. Moreover, it is against the terms of Stake like you have said above. OP is undoubtedly trying to scam here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 03, 2022, 08:20:45 PM",
      "body": "Obviously this is a bad idea for everyone involved as others have already said. I also don’t think this is the right place for this thread, if it’s allowed here at all. I’m sure moderators will remove it, but the odd way this was posted makes it seem more like you’re trying to get someone in trouble then actually trying to sell something. So many red flags here. I’m not sure what could have motivated you to do such a thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "June 03, 2022, 09:09:10 PM",
      "body": "Quote from: Maasdamer on June 03, 2022, 08:19:53 PMStake violates their own rules all the time so why should the players obey them?sure they can ignore the ToS but then again they are the one who is risking their money by buying the account. I know you have something against stake.com but the ToS is being brought up as a reminder for the OP and whoever wants to buy it that they could lose the account by breaking the ToS, not to mention the risk of being scammed by the seller.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gianluca95",
      "created_time": "June 03, 2022, 09:18:10 PM",
      "body": "I guess that you should post it in digital goods section. Then, it is illegal to sell your account , as TOS says. Then, you should consider that another player will use your identity for play. And at last, you should consider that 150$ for an account with 600$ bonus, means at least a SCAM attempt.Stay away from this user.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "June 03, 2022, 09:25:31 PM",
      "body": "Quote from: acroman08 on June 03, 2022, 09:09:10 PMQuote from: Maasdamer on June 03, 2022, 08:19:53 PMStake violates their own rules all the time so why should the players obey them?sure they can ignore the ToS but then again they are the one who is risking their money by buying the account. I know you have something against stake.com but the ToS is being brought up as a reminder for the OP and whoever wants to buy it that they could lose the account by breaking the ToS, not to mention the risk of being scammed by the seller.^ How the Stake.com determine if there is an account that has been changed hand like OP wanted to sell his platinum account. It is possible when the IP address changes? probably that is the only way they determine a sold account that is violating the ToS. Changing hands like wagering are normal and it will change. Second, probably a device that was used? is that right? It is very risky, you buy nothing if your account will freeze including your fund that has been deposited.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}