{
  "id": "topic_5403673",
  "title": "MARK21",
  "author": "MARK21",
  "created_time": "June 22, 2022, 07:05:29 PM",
  "content": "Quote“After rising significantly in value and popularity, the meme cryptocurrency Dogecoin (DOGE) now finds greater use in illicit activities”The currency is apparently being used by criminals to facilitate vices such as fraud, scams, Ponzi schemes, terrorism, and the sale of millions of dollars worth of child sexual abuse materials, according to research published by Elliptical Connection on June 22.According to research, it is said that:QuoteHigh-profile crimes facilitated by Dogecoin involve scams, fraud, and Ponzi schemes numbering around 50 cases.Some of the notable crimes include the Plus Token Ponzi scheme that resulted in the seizure of over $20 million in DOGE by Chinese authorities and the alleged theft of $119 million in Dogecoin linked to a Turkish Ponzi scheme in 2021.Breakdown of DOGE usage in crime. Source: Elliptic ConnectSource: https://finbold.com/doge-records-increased-utilisation-in-criminal-activities-research-shows/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403673",
  "comments": [
    {
      "author": "Z-tight",
      "created_time": "June 22, 2022, 07:18:14 PM",
      "body": "Not Doge, but fraudulent humans who commit crimes are increasing in their criminal activities. Criminals can choose to perpetrate their crime with any cryptocurrency, or best of all they use fiat. This is similar to the lie that \"bitcoin facilitates crimes and criminal activities\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 22, 2022, 07:24:12 PM",
      "body": "The thread title and topic is a bit laughable... I don't think any traceable crime could really occur when doge was 15 sats .But yes as things increase in popularity and price you can expect criminals to try to monopolise off that as well as people who don't understand why something's gone up not caring about where they put it (if they've not mentally realised the gain in actual numbers or don't need it).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RashidulIR",
      "created_time": "June 22, 2022, 07:30:31 PM",
      "body": "Quote from: MARK21 on June 22, 2022, 07:05:29 PMThe currency is apparently being used by criminals to facilitate vices such as fraud, scams, Ponzi schemes, terrorism, and the sale of millions of dollars worth of child sexual abuse materials, according to research published by Elliptical Connection on June 22.According to research, it is said that:QuoteHigh-profile crimes facilitated by Dogecoin involve scams, fraud, and Ponzi schemes numbering around 50 cases.Some of the notable crimes include the Plus Token Ponzi scheme that resulted in the seizure of over $20 million in DOGE by Chinese authorities and the alleged theft of $119 million in Dogecoin linked to a Turkish Ponzi scheme in 2021.There are many things in the world that can be used for the benefit of human beings. Cryptocurrency is one of them. Just think of the little knife we ​​use to do the necessary work every day, on the other hand, many people are harming people or animals with this same thing, so we can not blame the knife.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 22, 2022, 07:45:47 PM",
      "body": "Quote from: Z-tight on June 22, 2022, 07:18:14 PMNot Doge, but fraudulent humans who commit crimes are increasing in their criminal activities. Criminals can choose to perpetrate their crime with any cryptocurrency, or best of all they use fiat. This is similar to the lie that \"bitcoin facilitates crimes and criminal activities\".exactly! so doge, bitcoin or any other crypto coins can be subject to this kind of propaganda. but when you compare it with fiat-related fraudulent activities, i believe the crypto numbers is just a small one. fiat is still the leading market to be used in fraudulent or illegal activities. people are just highlighting the use of crypto in criminal activities, and so the negative notion of the public towards crypto, ignoring the fact that fiat is still the major currency used in this kind of illicit activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "June 22, 2022, 09:13:52 PM",
      "body": "I don't think it has a direct relationship to the price of the Dodge coin to be used for illegal activities ; In my opinion, the nature of the currency in itself is what makes it a safe haven for anyone who wants to try something that requires a sufficient amount of anonymity and privacy.Dodge currency is decentralized because there is no central work team working on developing the network. Therefore, it is not possible in any way to freeze balances or addresses, as happens with many other currencies. And it is also difficult to track transfers and addresses on its network, that is, not as happens with Bitcoin, for example, which has many means of tracking transfers on its blockchain network.Elon Musk exploited him in almost the same way, and it is certain that his choice was deliberate and not arbitrary.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "June 23, 2022, 05:33:19 PM",
      "body": "Quote from: Z-tight on June 22, 2022, 07:18:14 PMNot Doge, but fraudulent humans who commit crimes are increasing in their criminal activities. Criminals can choose to perpetrate their crime with any cryptocurrency, or best of all they use fiat. This is similar to the lie that \"bitcoin facilitates crimes and criminal activities\".That's true! It's the human who is committing the crimes and using cryptos for their transactions. This is a true statement! However, it is also true that cryptocurrency has given criminals a great way to transfer crime proceedings to another criminal. Cryptos like XMR is a great tool for the money launderers. Not sure why Doge is becoming a favorite among criminals, but XMR leads this segment. Criminals have always wanted to avoid banking channel and cryptocurrency, especially privacy cryptocurrencies have given criminals a great choice for sending or receiving payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eridan_world",
      "created_time": "June 23, 2022, 05:39:07 PM",
      "body": "Quote from: avikz on June 23, 2022, 05:33:19 PMQuote from: Z-tight on June 22, 2022, 07:18:14 PMNot Doge, but fraudulent humans who commit crimes are increasing in their criminal activities. Criminals can choose to perpetrate their crime with any cryptocurrency, or best of all they use fiat. This is similar to the lie that \"bitcoin facilitates crimes and criminal activities\".That's true! It's the human who is committing the crimes and using cryptos for their transactions. This is a true statement! However, it is also true that cryptocurrency has given criminals a great way to transfer crime proceedings to another criminal. Cryptos like XMR is a great tool for the money launderers. Not sure why Doge is becoming a favorite among criminals, but XMR leads this segment. Criminals have always wanted to avoid banking channel and cryptocurrency, especially privacy cryptocurrencies have given criminals a great choice for sending or receiving payments. But at the same time, nothing prevented criminals from doing their business without cryptocurrency. Yes, it may have become more convenient for them, but this is probably the price for the fact that it has also become much more convenient for all law-abiding citizens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "June 23, 2022, 05:50:12 PM",
      "body": "A survey like this, don't really need at all.Because we all know, any asset can be used like that. Since we're on the internet, and that's why they using it. Criminal activity is always can using any aspect, not even crypto but also real things asset. Is always depends on the deal it self.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "June 23, 2022, 07:55:04 PM",
      "body": "What is attracting criminals to use dogecoin for their bas activities? Is it because of the very cheap transaction fees, or dogecoin is more private and can not be easily traced by the government?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "June 23, 2022, 08:00:42 PM",
      "body": "Quote from: MARK21 on June 22, 2022, 07:05:29 PMSome of the notable crimes include the Plus Token Ponzi scheme that resulted in the seizure of over $20 million in DOGE by Chinese authorities and the alleged theft of $119 million in Dogecoin linked to a Turkish Ponzi scheme in 2021.Well, the news background around DOGE keeps getting worse and worse. First accusations of manipulation from Ilon Musk, now the use of the coin in various fraud schemes. In the meantime, the coin keeps falling to the bottom, having already reached 6 cents. I wouldn't be surprised if the price drops below 1 cent soon, because the price of it has been actively pumped up too much lately. If this news about ponzi schemes and other frauds involving DOGE is spreading more widely now, exchanges may start to remove this coin from listing massively, like it happened with Ripple in its time, and then DOGE will start to sink even more massively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "June 23, 2022, 08:59:15 PM",
      "body": "Quote from: Anonylz on June 23, 2022, 07:55:04 PMWhat is attracting criminals to use dogecoin for their bas activities? Is it because of the very cheap transaction fees, or dogecoin is more private and can not be easily traced by the government?Maybe because DOGE is just a meme token and no one expect this token to be more active, but for sure its not because of being secured since they will still use exchanges for this kind of activities. Those illegal users will always find a way and maybe, DOGE is good for their activities for some reason better to be safe on any project especially those who are using any meme tokens, they usually a hype and scam project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 23, 2022, 09:13:15 PM",
      "body": "Quote from: ryzaadit on June 23, 2022, 05:50:12 PMA survey like this, don't really need at all.Because we all know, any asset can be used like that. Since we're on the internet, and that's why they using it. Criminal activity is always can using any aspect, not even crypto but also real things asset. Is always depends on the deal it self.I’m also wondering why there’s a focus on DOGE right now, is this another hype or an end to hype this meme token? We know that hackers and scammers will always find a way to get easy money here no matter what crypto it is, even the top coins are being used for illegal activities so this is not a new thing anymore. If you want to be safe, choose and analyze before you invest, always have the time for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "June 25, 2022, 04:31:08 AM",
      "body": "Quote from: Z-tight on June 22, 2022, 07:18:14 PMNot Doge, but fraudulent humans who commit crimes are increasing in their criminal activities. Criminals can choose to perpetrate their crime with any cryptocurrency, or best of all they use fiat. This is similar to the lie that \"bitcoin facilitates crimes and criminal activities\".Yeah, this is also the first impression I got. I thought criminals are using Doge to hide their illicit activities but it's just the same for any other crypto specially Bitcoin, they are being used to scam other investors.So this research seems rubbish to me, and there are a lot of crypto as I have said that is being used as a front to scam, by imitating or cloning the website or by any other means. I remember ADA was well, there were a lot of fake Youtube videos claiming that they are giving free ADA but it was all a scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "June 25, 2022, 11:06:32 AM",
      "body": "Probably those criminals thought that doge coin will increase a lot in the future so they demanded or used Dogecoin instead of others. How the survey can be real? Not really a fan of Dogecoin or memecoins in general but its just seems like a make-up story to defame the value for short time so the big whales can buy it for cheaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "June 25, 2022, 12:13:35 PM",
      "body": "Nothing much different than what happens with bitcoin or fiat. They are also being used to do criminal activities since many years now. I’m wondering why is it any different when it comes to DOGE. These are just numbers by the way. I believe if they really want to go for the Ponzi schemes and stuff then they might use new coins, even create new coins so that they will get less attention while transferring those funds. Doge is too popular whether in funny way or normal use case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue_hurricanger",
      "created_time": "June 25, 2022, 04:02:20 PM",
      "body": "I think Doge got a lot of normal people who use and hold it, this makes it look easy to be diluted in case of criminal activities want to remove its track. So can't really blame Doge for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "June 25, 2022, 04:13:40 PM",
      "body": "Doge and similar altcoins are just tools, and tools depend on how they are used. Like a double edged knife, you can use it to hurt other people or you can use it to slice onions. There is no denying that the fact is not always that crypto is a hotbed of fraudsters, but rather fraudsters who try to evade identification to eliminate evidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Morningstarr",
      "created_time": "June 25, 2022, 05:04:50 PM",
      "body": "According to the investigation, about two trillion US dollars are used every year in various crimes. Should we ban the dollar or has the US government ever taken any drastic measures to stop it? All their emphasis is on propaganda against the corrupt currency. Everything can be used in both good and bad ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 25, 2022, 11:42:56 PM",
      "body": "Quote from: goaldigger on June 23, 2022, 08:59:15 PMMaybe because DOGE is just a meme token and no one expect this token to be more active, but for sure its not because of being secured since they will still use exchanges for this kind of activities. Those illegal users will always find a way and maybe, DOGE is good for their activities for some reason better to be safe on any project especially those who are using any meme tokens, they usually a hype and scam project. I feel sorry for those criminals who use Doge for their transactions.  Once the coins hit the exchange, they are sure to be recognized.Quote from: Anonylz on June 23, 2022, 07:55:04 PMWhat is attracting criminals to use dogecoin for their bas activities? Is it because of the very cheap transaction fees, or dogecoin is more private and can not be easily traced by the government?Dogecoin is traceable although anonymous if it doesn't reach a centralized exchange.  But once it enters centralized exchanges then the account owner can be known.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}