{
  "id": "topic_5410595",
  "title": "Sabbir Hossen",
  "author": "Sabbir Hossen",
  "created_time": "August 20, 2022, 02:07:34 PM",
  "content": "On Tradingview there is an indicator named Hash Ribbon. I noticed that when that indicator give a buy signal the price of bitcoin goes up in long time. It just gave Buy signal 7 time and each time bitcoin pumped a lot. And after 1 year it give buy signal again. Do anyone know about this? Please check it and tell me if anyone know about it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410595",
  "comments": [
    {
      "author": "jackg",
      "created_time": "August 20, 2022, 02:12:53 PM",
      "body": "I just saw a thread about historic trends of this earlier that looked interesting: https://bitcointalk.org/index.php?topic=5410574.msg60787658#msg60787658It had quite a lot of examples of where the ribbon worked in the past to.make predictions (it might be worth noting past performance doesn't guarentee future results of any indicator and trends stay only until they're invalidated).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "August 20, 2022, 03:04:09 PM",
      "body": "Quote from: Sabbir Hossen on August 20, 2022, 02:07:34 PMOn Tradingview there is an indicator named Hash Ribbon. I noticed that when that indicator give a buy signal the price of bitcoin goes up in long time.When the price of BTC dips 70%,  you don't even need an indicator esp if you are up for long term. Anyone who has plans to sell BTC after Halving will have the idea to buy now and hold til that time come because its anticipated that it may just be more than its previous ATH.But its good to know that's how Hash Ribbon indicator works.  dragonvslinux had really provided a great thread for anyone to learn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "August 20, 2022, 03:09:55 PM",
      "body": "Quote from: Sabbir Hossen on August 20, 2022, 02:07:34 PMOn Tradingview there is an indicator named Hash Ribbon. I noticed that when that indicator give a buy signalHash Ribbon is good to show you when miner capitulation happens. When a Great Capitulation happens, you will likely be around the bottom. It's certainly that from bottom, price will recover first and begin a new bull run.I don't think hash ribbon gives you a buy signal because buy and get profit or get loss, it depends on the amount of time you can stay in a market. Even two people buy at the same price, at the same time, their exit time will decide their profit or their loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "August 20, 2022, 03:16:51 PM",
      "body": "Quote from: jackg on August 20, 2022, 02:12:53 PMI just saw a thread about historic trends of this earlier that looked interesting: https://bitcointalk.org/index.php?topic=5410574.msg60787658#msg60787658Quote from: cabron on August 20, 2022, 03:04:09 PMBut its good to know that's how Hash Ribbon indicator works.  dragonvslinux had really provided a great thread for anyone to learn.Thanks for the referencing  Worth remembering that on longer-term time-frames where the indicator remains most relevant (Weekly/Monthly) the signal remains unconfirmed. It's signalling now, but can change by end of day tomorrow given the MAs have only just crossed over, and the positive price action is currently only +2% from the hash rate recovery signal. But otherwise yes, it's a relatively reliable signal for upside price action.The \"worst\" signals it has provided would be in December 2019 at $7,385 where price rallied +40% before dropping lower -46% below signal, followed by August 2021 at $43,829 with +58% before dropping to where we are now, -59% below that buy signal. It has otherwise signalled anything from trend reversals, end of consolidations as well as continued upside price momentum.The lowest downwards price action used to be around -15%, but now it's -59% based on the most recent confirmed signal a year ago. So not as reliable as it used to be in fairness.Here's otherwise a summary of buy signals:Quote from: dragonvslinux on August 20, 2022, 11:00:36 AMDaily chart signals (partial source)1. $4.08, December 27th 20112. $5.09, May 20th 20123. $6.46, June 22nd 20124. $20.55, February 2nd 20135. $234, January 28th 20156. $234, May 2nd 20157. $238, May 28th 20158. $612, September 4th 20169. $3652, January 11th 201910. $7245, December 27th 201911. $7505, April 24th 202012. $9306, July 12th 202013. $19,226, December 2nd 202014. $44,612, August 7th 202115. $20,834, August 19th 2022Weekly chart signals1. $5.28, December 26th 20112. $6.35, June 18th 20123. $23.80, February 4th 20134. $227, January 26th 20155. $231, May 25th 20156. $3533, January 7th 20197. $7385, December 30th 20198. $7706, April 20209. $9303, July 202010. $19,375, December 202011. $43,829, August 202112. ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}