{
  "id": "topic_5456844",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "June 19, 2023, 10:34:21 AM",
  "content": "В преддверии печальной даты 22.06.1941.Есть ли тут историки? На Форуме?           Мне хотелось бы узнать, реальные данные, по реальной истории тех времен. Тех времен, на которые так любит ссылаться ВерхоГлавк Путин. На историю 1939-1945 гг. С ссылками, желательно. Впрочем, для тех обывателей, кто абсолютно всегда согласен с генеральной линией партии (любой, которая в данный момент у власти), никаких данных приводить не нужно. Им и так все понятно. Но не мне. Я хочу разобраться!          Итак. Сколько, на самом деле существовало официальных планов защиты СССР от нападения Гитлера в 1941 году?  Ведь мудрый Сталин (якобы) все знал и все предвидел. И готовился к нападению Гитлера. И все предусмотрел ЗАРАНЕЕ. Разработал ряд оборонительных мероприятий, воздвиг ряд оборонительных сооружений как вбизи границы СССР («линии Молотова»), так и на запасных рубежах. Однако, Фашистская Германия, при этом, почему-то ВЕРОЛОМНО и внезапно напала на бедный несчастный СССР. Который, на тот момент, на самом деле, имел РЕАЛЬНО ПЕРВУЮ АРМИЮ МИРА (а не то что сейчас). И готовился только исключительно к обороне, а не к нападению. И не совершенно не ожидал, что Гитлер, с которым 28 сентября 1939 года был подписан Договор о Дружбе и Границе. (прям как Будапешстский Меморандум 1994 года). Хотелось бы  увидеть эти документы. Планы обороны, а не планы нападения. Не домыслы, а документы. Ведь в 90х годах были рассекречены большая часть документов о войне (но не все). Но ни одного плана обороны границ СССР от нападения Гитлера так и не было найдено. Однако было найдено несколько совершенно противоположных планов.         Ну, конечно же. Сталин не готовился к наступлению Гитлера. Он ничего об этом не знал. Но поручил при этом все приготовления к обороне военному преступнику Маршалу Жукову, который на тот момент был начальником Генштаба. Ну прям как начальник генштаба Герасимов. Улавливаете сходство? В этой стране, почему-то, обычно, так бывает, что почти ни один, кто \"у власти\" почему-то ни в чем не виноват. Потому что \"покарать провластного\" - это означает признаться всем, что ты - \"допустил его до власти и не замечал долгое время его косяков\".         И тот, и другой, в итоге, свои задания провалили. Как НачГенштаба Жуков, так и НачГенштаба Герасимов (спустя 81 год) так и не смогли представить документов, подтверждающих готовность к защите СССР (России) от нападения. Если такие документы всеж существуют – расскажите! Зато вот есть многочисленные объективные факты, доказательства, планы и документы, что тогда, в 1941 году СССР планирована вероломно напасть на Германию, а Лукашенко рассказывал, как в 2021-22 году Россия планировала напасть на Украину («а вот сейчас я вам покажу, с какой стороны готовилось наступление»). Что мы имеем по-факту? Оба НачГенштаба провалили свои задания. Оба – не справились. Один допустил фашистов до Москвы, второй – слил 2022 (и не только?) год СВО. Но оба, почему-то, до сих пор не посажены и не расстреляны. В этом и есть весь прикол России (СССР). Под раздачу попадают единицы – остальным удается откосить. Тем и живем!         Война документов. Война доказательств. Но, отнюдь, не война мозгов. Народу на все насрать. Он смотрит и слушает пропаганду. Нет, не так. Эта война существует только в мозгах тех, кто реально думает. А остальные – просто верят. Пропаганде и ЛЖЕисторикам, которые, при каждом НОВОМ правителе, придумывают для него специально, каждый раз новую историю. Так было всегда в этой стране – так будет и потом. И нет никакой надежды, никаких намеков на то, что, может быть, хотя бы в этот раз все может быть пойдет по-другому.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456844",
  "comments": []
}