{
  "id": "topic_5439483",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "February 11, 2023, 04:51:16 PM",
  "content": "Looks like Musk is helping to stop the war by removing some of Ukraine's strength from them. It will be interesting to see if the US government steps in to force the Starlink system to become operational for Ukraine again. On the other hand, it might be the US who covertly ordered Musk and Shotwell to do this... just to give the US an honorable way for getting out of their Ukraine failure.Zelensky Lashes Out After Starlink Cuts Off Ukrainian Droneshttps://www.activistpost.com/2023/02/zelensky-lashes-out-after-starlink-cuts-off-ukrainian-drones.htmlSpaceX president Gwynne Shotwell in a statement asserted that Starlink technology was \"never meant to be weaponized\". According to BBC, \"She made reference to Ukraine's alleged use of Starlink to control drones, and stressed that the equipment had been provided for humanitarian use.\"Shotwell confirmed that the \"surprise decision\" was taken due to it never being the company's intent to allow Starlink to be used \"for offensive purposes\" in remarks given before a conference in Washington DC. Shotwell further said Ukraine had utilized the technology—\"in ways that were unintentional and not part of any agreement,\" according to Reuters.After Musk provided the Starlink systems, the Ukrainian military quickly became dependent on them given the extreme battlefield conditions, including damage to existent communications infrastructure and frequent power outages. Additionally the Russians would often jam signals, thus Starlink allowed Ukrainian troops to circumvent these factors.The Wednesday announcement from SpaceX was met with anger in Kiev, after already there's been an avalanche of Ukrainian government criticism aimed at Musk personally over his 'Russia-Ukraine peace poll' offered in October. As Bloomberg observed during that prior spat and tensions, Musk's tweets were \"drawing the wrath of Ukrainians\" merely for his proposing a negotiated solution which involved territorial concessions for the sake of lasting peace....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439483",
  "comments": []
}