{
  "id": "topic_5459573",
  "title": "ChronoPay",
  "author": "ChronoPay",
  "created_time": "July 12, 2023, 07:00:59 PM",
  "content": "We accept payments for HIGH RISK projectsOur target audience:• Igaming - gambling, casino, betting, lotteries, auctions; selling game items• Finance: Binary Opicons, Forex• Pharma - pharmaceutical products, pharmaceuticals• Edalt - adult sites, video chats• Dating - Dating Agencies• Software• Sms services, etc.Everything is subject to automation, the work is built through the API!We offer the following solutions:- c2c; p2p- Payment aggregatorsEach solution individually depends on the customer's needsOur main advantages are:-No legal entity required-No gambling license required-No Forex license required• Beautiful and comfortable merchant uniform• Operational inference• No limits• Risk coverage• Extensive experience in this area• Good reputation and many positive reviewsOur specialists will select the best solution for you and provide the most convenient option! We will always agree on a percentage for our services!Contact:Telegram: @nevrublevsky",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459573",
  "comments": [
    {
      "author": "CryptSafe",
      "created_time": "July 12, 2023, 10:38:59 PM",
      "body": "OP it seems you do not read rules why spamming the platform with this advert of yours and if you may wish to know, this board is a gambling board and does not fits here. Do well to move it to the right board which is the service board there you would get the attention you desire otherwise.  It is obvious from your actions it shows you do not wish to learn and know about forum policies but rather you go about spamming the platform.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 12, 2023, 10:40:31 PM",
      "body": "Then why don't you share the website URL? Do you accept cryptocurrency payments? How legit are you when in the first place  you don't require legal docs of the service/casino. It looks suspicious to me when a payment processor don't required legal docs from a business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}