{
  "id": "topic_5414985",
  "title": "darxiaomi",
  "author": "darxiaomi",
  "created_time": "September 26, 2022, 04:26:17 PM",
  "content": "Bueno andando por internet encontre esta noticia, segun los periodistas es la primera del pais (lo cual puede ser cierto). Es una empresa enorme claramente de hecho si no recuerdo mal auspicia el futbol mexicano.https://www.clarin.com/economia/billetera-cripto-pico-punta-lanzo-opcion-pagar-qr-comercios_0_C6187mjzSx.html?utm_term=Autofeed&utm_medium=Social&utm_source=Twitter#Echobox=1664202851Mi principal duda es, quien va a gastar sus monedas en este momento que todo indica HODL, logicamente que hay gente que lo hara pero....En Stablecoins (que tambien se puede como indica el articulo) es otro cantar pero veremos. Tambien veremos en cuanto el BCRA se las ingenia para que no funcione, y voy a intenar seguir por TW si realmente funciona.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414985",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "September 26, 2022, 05:29:22 PM",
      "body": "Por lo que veo, el cliente podrá pagar en pesos argentinos, stable USDs, BTC, ETH y DAI. Entiendo que esto es a través de su app ya existente, aunque este aspecto no me queda del todo claro al leer la información al respecto. Siendo así, se trataría de poder optar usar las criptomonedas de tu wallet custodial en multitud de comercios, para un millón de argentinos, lógicamente todo dentro de un circuito KYC (por si tiene derivadas con la Hacienda pública Argentina).De alguna manera, es cierto que con el IPC interanual disparado al 78,5%, uno probablemente quiera ahorrar y no gastar su cripto, a la espera de ver si puede para el impacto de la inflación desbocada. No obstante, me imagino que aquellos que tengan suficiente cripto ahorrada, y aquellos que no tienen más remedio que abrir la hucha de los ahorros, pueden encontrar una facilidad de uso de esta solución. Lo interesante sería ir conociendo datos de uso (algo que no sé si veremos ...).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "September 26, 2022, 06:27:04 PM",
      "body": "Quote from: DdmrDdmr on September 26, 2022, 05:29:22 PMDe alguna manera, es cierto que con el IPC interanual disparado al 78,5%, uno probablemente quiera ahorrar y no gastar su cripto, a la espera de ver si puede para el impacto de la inflación desbocada.Y luego nos quejamos de la alta inflación en España y de la necesidad de una reserva real de valor. Vaya, lo siento de veras por nuestros compañeros argentinos: el valor de sus ahorros de un año a otro se está viendo reducido casi a la mitad!Me pregunto yo qué haría en esa situación. No hacer nada es peligroso, pero convertir todos mis ahorros a Bitcoin, o a alguna stablecoin, tampoco parece una opción con la que pudiera conciliar el sueño por las noches. Iría en contra de la ley de oro: no inviertas lo que no puedas permitirte perder.Volviendo al topic, parece que el futuro pasa por este tipo de soluciones de pago, KYC incluido, al menos en lo que a grandes empresas se refiere. Espero que no afecte a la libertad P2P.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "September 27, 2022, 12:35:35 AM",
      "body": "La empresa que está detrás de estos pagos por QR es Bitso, y sin duda alguna es la empresa mas grande de Bitcon y Altcoins en México, y por lo que entiendo se está extendiendo a latinoamérica.Aparte de pagos con cryptos, también es muy fácil de usar con las tarjetas de débito, incluso cuentan con un sistema de pago dentro de la aplicación con la cual se pueden hacer transferencias entre usuarios. Podríamos describirla como un monstruo que crece a pasos agigantados.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 27, 2022, 03:02:17 AM",
      "body": "Voy a hacer un poco de aguafiestas:QuoteLa función, que estará disponible para el millón de usuarios que la firma tiene en el país desde el martes próximo, permitirá \"cambiar\" automáticamente dólares digitales, bitcoin, Ether o DAI por pesos al momento de hacer la compra Y es que he pensado que esta misma noticia en el foro en inglés, en seguida tendría a gente quejándose de esto citado. Que en vez de hacerse el pago en bitcoin directamente, se cambia automáticamente a fiat. Pero siendo realista, si los pagos en Bitcoin se generalizan va a ser de esta manera. Y más teniendo en cuenta que los pagos se habilitan también para otras criptos.Quote from: darxiaomi on September 26, 2022, 04:26:17 PMMi principal duda es, quien va a gastar sus monedas en este momento que todo indica HODL, logicamente que hay gente que lo hara pero....Bueno, ahora indica HODL, y cuando el precio subía y subía y llegó a 69.000 USD también indicaba HOLD, porque todos pensábamos que iba a seguir subiendo como mínimo hasta 100.000.Al final, la gente gasta bitcoin en transacciones del día a día, otra cosa es que si estuviera claro que el precio fuera a estar estable durante muchos años, lo gastaría más.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 27, 2022, 07:51:13 AM",
      "body": "En otro artículo que he leído al respecto, que hay un mínimo importe para los pagos, mínimo que se me antoja un tanto elevado para el mayor potencial de transacciones que uno podría hacer de manera cotidiana:QuoteEl pago mínimo es de $100 y Bitso cobrará una comisión por cada transacción cripto a fiat, mientras que las transacciones en moneda local no serán tasadas.Por otro lado, este parece ser uno de los formatos de publicidad asociados:Ver: https://decrypt.co/es/110409/cripto-pagos-qr-como-es-nueva-funcion-bitso-argentinahttps://www.ambito.com/negocios/criptomonedas/pagos-qr-cripto-como-es-la-nueva-funcion-que-lanza-bitso-argentina-n5542003Nota: En cuanto a lo de la inflación, es algo que planteaba aquí para el caso de Europa. Si estuviésemos al ritmo de Argentina por estas latitudes, no se si correríamos, o nos quedaríamos con los pies incrustados en un bloque de cemento …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "September 27, 2022, 06:27:08 PM",
      "body": "Igual aca por lo que veo hicieron una especie de hibrido entre una billetera virtual tradicioanl + el tema crytpo, ya que al dejar usar pesos y sumarse a los QR debe ser similar como pagar con MercadoPago.Es mas algo para traccionar clientes a mi parecer, ya que si uno paga y transforma ya sea BTC o stable coin a pesos para realizar el pago se come el tipod e cambio que ponga la empresa y encima ese % que te come por conversion de divisa. Resumen no conviene ni a palos.Quote from: Porfirii on September 26, 2022, 06:27:04 PMQuote from: DdmrDdmr on September 26, 2022, 05:29:22 PMDe alguna manera, es cierto que con el IPC interanual disparado al 78,5%, uno probablemente quiera ahorrar y no gastar su cripto, a la espera de ver si puede para el impacto de la inflación desbocada.Y luego nos quejamos de la alta inflación en España y de la necesidad de una reserva real de valor. Vaya, lo siento de veras por nuestros compañeros argentinos: el valor de sus ahorros de un año a otro se está viendo reducido casi a la mitad!Me pregunto yo qué haría en esa situación. No hacer nada es peligroso, pero convertir todos mis ahorros a Bitcoin, o a alguna stablecoin, tampoco parece una opción con la que pudiera conciliar el sueño por las noches. Iría en contra de la ley de oro: no inviertas lo que no puedas permitirte perder.Volviendo al topic, parece que el futuro pasa por este tipo de soluciones de pago, KYC incluido, al menos en lo que a grandes empresas se refiere. Espero que no afecte a la libertad P2P.JAJAJA, aca ya es algo normal practicamente, ademas nuestros padres/abuelos vivieron peores Rodrigazo 1975 y Plan Austral, Plan Primavera e hiperinflacion de 1989 que termino incluso con la caida del gobierno. En esta ultima toda la gente que lo vivo cuenta que era una cosa de ir a comprar por la mañana porque literal a la tarde ya habia otros precios.Y ahora hace mas de 10 años que venimos con una inflacion \"alta\" y hace 5 con una ya muy alta.Eso si, la cantidad de oportunidades que hay tambien hay que decirlas, por ejemplo cantidad de compras a credito con tasa 0 a 18 meses (obvio que esto es financiado por el gobierno haciendo despues mas grande el problema), lo cual es un delirio. Cuando la TNA es del 107%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "September 30, 2022, 07:27:40 PM",
      "body": "Por estas latitudes, el pago con QR me da que no está tremendamente extendido, aunque a veces me da la sensación de estar un tanto desconectado de los medios de pago más empleados por las generaciones más recientes.Donde sí lo encuentro útil es en Electrum para móvil, donde el código QR me permite hacer ciertas operaciones entre entornos que me evitan tener que estar tecleando toda la dirección bitcoin. Eso no quita que luego lo revise todo, pero es el caso de uso que sí suelo utilizar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}