{
  "id": "topic_5469431",
  "title": "Bitstar_coin",
  "author": "Bitstar_coin",
  "created_time": "October 06, 2023, 03:19:21 PM",
  "content": "\"A whale put 30,000 BTC up for sale at $300 each and the market eventually bought them all. Years later, BearWhale explained what happened (they fell victim to FUD)\".I came across this interesting story on twitter and i followed it to the main source, links include.So this guy practically dump 30k btc base on FUD he claimed he read on social media like reddit and bitcointalk.org Which includes:-*The block size limit of 1MB was a threat to bitcoin’s future*“Satoshi’s vision” was unlimited block sizes*Gavin was ousted by a cabal of self-interested engineers, a.k.a. “Blockstream”*Blockstream took control of bitcoin’s source code repository*Theymos colluded with Blockstream to censor block size increase discussions*The subreddit r/bitcoin heavily censored block size increase discussions*Blockstream wanted the block size low to promote its proprietary Lightning Network*Gregory Maxwell was a bad actor and Luke-Jr was a religious nut*The market agreed with the above, leading to the then-decline in price towards $300.And what is more surprising according to the article is he didn't sell during the MtGox saga. However could not resist to sell after reading all kinds of FUD post about btc. The point is - everyday btc battles all kinds of fud from haters or bad intent people but never allow such fud to lead you to sell your coins. I believe this Bearwhale is seriously regretting his action after seeing the performance of btc price long after he sold.  I highlighted the Theymos part because am not aware of such post.Find the complete full story in the below reddit link Reddit LinkTwitter LinkPlease do share your thoughts...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469431",
  "comments": [
    {
      "author": "Faisal2202",
      "created_time": "October 06, 2023, 03:44:50 PM",
      "body": "A whale was played out by a FUD, unbelievable, I mean, we all are humans and make mistakes, but I never heard this story and it is totally new for me. I never heard any relevant story as well, where a whale fell prey to FUD sentiment and sold that much amount of BTC. That's a huge amount. He might not be in contact with other whales, I mean with experienced ones, it's like a whale abandoned from its group and now facing the difficulties of the market. Well, those 30 BTC are almost equal to 839,509,089.43 dollars. hohoho. I don't have words to explain the feelings of a person who would have 839 Mil in dollars right now but he lost them just due to the FUD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "October 06, 2023, 04:26:02 PM",
      "body": "Quite interesting story to read, but no matter how many reasons he could give, it was always about him selling in the end. I mean nobody hacked into his account just to sell his coins, it was his own decision to sell them and that doesn't really turn that well into something else, there is no reason that is valid enough to sell due to someone else. I would understand if he sold for some emergency, people do that and it makes sense, but he sold because he was afraid of the FUD? Thats really not the point, that can't be a reason to sell and if it is then the whole blame goes to him. In the end he joined back in, which means that he is still in profit and he should be doing fine in the end, if he is back in during all that time, then it means he must be in big profit currently, so he is still doing fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunaidAzizi",
      "created_time": "October 06, 2023, 04:36:56 PM",
      "body": "Quote from: Bitstar_coin on October 06, 2023, 03:19:21 PMPlease do share your thoughts...The whale was so stupid how he came into the fears and in the wrong misguidance related to Bitcoin. My belief is that whales are so experienced, well knowledge, have future plans, and are very good observers but now i am liking losing this belief. If he was added by the FUDS then why he was not looking at the price history of bitcoin? From almost zero to $300 at that time, why did he not take the lesson that Bitcoin is going up like it was increased price from zero to 300 similarly it will go up and up but maybe he was not so much experienced. He has a lot of money and he invested all in bitcoins fear and selling it clearly shows that he knows little about bitcoins. But this story looks unrealistic about how a whale sells all his own bitcoin at that time, Whales have long vissions, and if he has bitcoin then how is it possible that he does not have access to this forūm? But somehow we need to take lessons from it and need to be very attentive. For the newbie, Fuds is the strategy that is used by the scammers of other whales or persons against the whole market. They start spreading rumors about a specific currency and it's the most powerful strategy to set the fear in the hearts of others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 06, 2023, 04:43:08 PM",
      "body": "I'm not even surprised by the quantity sold. Many who started early in Bitcoin managed to collect many coins, and many also sold them over time.What really surprises me is that a whale took this action because of the FUD about block sizes. There are many more credible FUDs about the possible downfall of Bitcoin than block sizes.Either way, he can obtain a good financial return. And if he used it correctly, he had money for the rest of his life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "October 06, 2023, 06:03:55 PM",
      "body": "Quote from: JunaidAzizi on October 06, 2023, 04:36:56 PMThe whale was so stupid how he came into the fears and in the wrong misguidance related to Bitcoin. My belief is that whales are so experienced, well knowledge, have future plans, and are very good observers but now i am liking losing this belief. This news is very old, and there was less attention at that time, but still, you made a valid point, and I also have the same thoughts that whales are the ones who have the resources and knowledge to dump the market and fill their own bags with BTC in both scenarios, like by selling to dip the market and buying at the dip. But this whale might be a new one, and I don't have much experience with the BTC market.Maybe he was just a spoilt rich kid who had money but no education.  Quote from: JunaidAzizi on October 06, 2023, 04:36:56 PM If he was added by the FUDS then why he was not looking at the price history of bitcoin? From almost zero to $300 at that time, why did he not take the lesson that Bitcoin is going up like it was increased price from zero to 300 similarly it will go up and up but maybe he was not so much experienced.You are right; he must have less experience or education in the market. But I hope he must have learned a good lesson for this because the amount of BTC is 30k. I mean, that is so huge. He would have hundreds of millions of dollars now, even at the current price tag. He might be having stress attacks when the price of BTC was around $69k. But let's just not rub salt on others' wounds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "October 06, 2023, 06:28:32 PM",
      "body": "Quote from: Bitstar_coin on October 06, 2023, 03:19:21 PM\"A whale put 30,000 BTC up for sale at $300 each and the market eventually bought them all. Years later, BearWhale explained what happened (they fell victim to FUD)\".Means anybody can be affected by FUD, not just people like me who are investing the little we can. The higher the BTC owned, I think the higher the Fear, uncertainty and doubt that will be faced because nobody likes to loss plenty money. This is a good story to learn from, actions must be taken after thinking, not taken first and later thought about. The whale acted too quickly without thinking about his actions and also without consulting any other person he knew was having bitcoins too. Talking to another investor in bitcoin then who was more strong willed to keep their coins would have helped him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 06, 2023, 06:58:30 PM",
      "body": "Block wars and the lightning network weren't a thing 9 years ago, so at some point this story doesn't make sense. The former began in mid 2015 and lightning in 2017. As for \"Satoshi's vision\" being \"unlimited block size\" or theymos colluding with blockstream to censor discussions, just LOL.  Anyway, so the tl;dr is that there was a whale with weak hands. Not surprising given the time this happened. Try finding that now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "October 06, 2023, 07:21:57 PM",
      "body": "Quote from: BlackHatCoiner on October 06, 2023, 06:58:30 PMBlock wars and the lightning network weren't a thing 9 years ago, so at some point this story doesn't make sense. The former began in mid 2015 and lightning in 2017. As for \"Satoshi's vision\" being \"unlimited block size\" or theymos colluding with blockstream to censor discussions, just LOL.In the signed message there is no mention of 9 years, OP has added that, in the original, it only mentions the pricehttps://pastebin.com/Lp5Djs5Rand that of a little over 300 does make sense for the drama around the 2015 clash, but at that time it was about XT, not casH or SV.The dates do correlate with the events, including the bitcointalk censorship drama.Besides, that address had in 2014 34k coins which he sent to Bitstamp, so he's not just trolling.PSQuoteLuke-Jr was a religious nutthis ain't FUD, it's a 1001% proven beyond-a-doubt fact!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "October 06, 2023, 07:46:24 PM",
      "body": "If that whale had hold his Bitcoin ATH of 2021 then he would have made at least 1.9 Billion USD, but he sold his Bitcoin for $300 a coin and made over $9 million USD only. The BearWhale fall into the trap of the FUD and sold his Bitcoin for way cheaper rate. A lesson we can learn is that HOLD your Bitcoin and don't fall in the trap of social media because if you hold for a decade or two then you'll make a lot more if you sell it early due to fear. Everyone should learn a lesson from that guy and hold their Bitcoin for longer to earn better profits. Just HODL!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "October 06, 2023, 08:20:27 PM",
      "body": "Regardless, I believe that whale sold at a profit.  During those times, only a few foresee that Bitcoin price will reach this height.  That is not the only event that happen when whales sold out their stash and was nibbled by the Bitcoin community.  The FUD reason, IMO is just a reason to justify his action, probably he sold his stash to invest in what he believes is more profitable venture than just holding BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "October 06, 2023, 08:38:38 PM",
      "body": "While he is probably regretting his decisions now, you can't deny the fact that way back then this means serious trouble for bitcoin, block size wars was a full on issue that no one couldn't ignore. Names are being dragged, shits being thrown back and forth like we're some sort of monkeys only for the whole fiasco to die down eventually. While I wasn't exactly a part of it, I've taken a lot of reading regarding the issue and I must say, if a similar event happened now and not before, it could very well lead to the death of bitcoin from the sheer amount of distrust it created within the whole ecosystem. Years from now we're laughing about it, 9 years ago this is literally what could've been the Armageddon of bitcoin, let that sink in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "October 06, 2023, 11:02:21 PM",
      "body": "Quote from: Bitstar_coin on October 06, 2023, 03:19:21 PM*The market agreed with the above, leading to the then-decline in price towards $300.The market was in bear phase, that's the only reason why the price was going down. People were thinking that the drama was impacting the price, but it's just a case of \"correlation does not mean causation\". The blocksize drama was going on in 2016-17 when the bull market started. Similarly, people cherry-pick positive news during bull markets and think that they are responsible for the growth, even though it makes no sense for Bitcoin to double in price just because Elon Musk's company bought some.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 07, 2023, 03:45:58 AM",
      "body": "Yeah I remeber when this happened. Many people at first assumed this offer was fake and to scare the market into selling. However as price approached it looked like a real seller.If you go on YouTube there is a video of exactly when this wall get broken and I don’t think price ever again touched $300.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "October 07, 2023, 04:02:16 AM",
      "body": "I always think of Trendon Shavers as the original whale. I remember when he was moving the market with all the BTC he controlled to try and earn 1% per day of gains. It worked well until it didn’t. I believe in that case it was the guys at bitpay that ended up being the bigger whale and causing trendon to take massive losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "October 07, 2023, 04:24:53 AM",
      "body": "Quote from: Faisal2202 on October 06, 2023, 03:44:50 PMA whale was played out by a FUD, unbelievable, I mean, we all are humans and make mistakes, but I never heard this story and it is totally new for me. I never heard any relevant story as well, where a whale fell prey to FUD sentiment and sold that much amount of BTC. That's a huge amount. He might not be in contact with other whales, I mean with experienced ones, it's like a whale abandoned from its group and now facing the difficulties of the market. Well, those 30 BTC are almost equal to 839,509,089.43 dollars. hohoho. I don't have words to explain the feelings of a person who would have 839 Mil in dollars right now but he lost them just due to the FUD. There are thousands of whales of various sizes in the market and not all whales make a profit and become prey to other whales. If you are a whale, you can eat smaller fish but there are still bigger fish waiting to eat you. The financial market is extremely harsh. I've never heard this story either, but I'm not surprised. This reminds me of the downfall of FTX and aAlameda Research, they were really big elephants that manipulated and dumped the coins they invested in. But in the end they had to pay the price and were defeated by bigger hands. The total capitalization of the market is worth trillions of dollars and someone owning billions of dollars is really big for us but for the market, it's just a grain of salt in a big tank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "October 07, 2023, 04:40:03 PM",
      "body": "The safest thing is, to be free to all the news about Bitcoin and take the risks and become more stable stop looking for news, because you are granted in bitcoin knowledge, such news and fun no matter the level won't have anything to do with your mindset, because after all, you are not searching for them anyways and what you doing is concentrate on the price of bitcoin at whatever time and depend on your judgement on them, this is why as bitcoin investors you have to make a long term commitment to it, although the individual who dumped bitcoin at that price of $300 way back then may have bought those 30,000 Bitcoins when the price was very low may be around 100-50 dollar then, so he is still in profits.But for someone who bought at a higher price than the sell amount what that means is that the individual has actually played dump to the various market sentiments and also made an attempt to misconception the entire market and what the long term is with Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "October 08, 2023, 05:43:29 AM",
      "body": "Quote from: Bitstar_coin on October 06, 2023, 03:19:21 PM\"A whale put 30,000 BTC up for sale at $300 each and the market eventually bought them all. Years later, BearWhale explained what happened (they fell victim to FUD)\".I came across this interesting story on twitter and i followed it to the main source, links include.So this guy practically dump 30k btc base on FUD he claimed he read on social media like reddit and bitcointalk.org Which includes:-*The block size limit of 1MB was a threat to bitcoin’s futureThat's thanks to Mike Hearn for writing FUD in his blog, and wrote it with authority like it was the truth. Quote*“Satoshi’s vision” was unlimited block sizesI would have also believed that that was possible if I didn't learn the hard way, thanks to the forum's disinformationists, charlatans, and FUDsters.Quote*Gavin was ousted by a cabal of self-interested engineers, a.k.a. “Blockstream”*Blockstream took control of bitcoin’s source code repository*Theymos colluded with Blockstream to censor block size increase discussions*The subreddit r/bitcoin heavily censored block size increase discussions*Blockstream wanted the block size low to promote its proprietary Lightning Network*Gregory Maxwell was a bad actor and Luke-Jr was a religious nut*The market agreed with the above, leading to the then-decline in price towards $300. Wear your tin-foil hats on, only the very stupid will believe Roger Ver and the BCash community's rhetoric.QuoteAnd what is more surprising according to the article is he didn't sell during the MtGox saga. However could not resist to sell after reading all kinds of FUD post about btc. The point is - everyday btc battles all kinds of fud from haters or bad intent people but never allow such fud to lead you to sell your coins. I believe this Bearwhale is seriously regretting his action after seeing the performance of btc price long after he sold.  I highlighted the Theymos part because am not aware of such post.Find the complete full story in the below reddit link Reddit LinkTwitter LinkPlease do share your thoughts...The Core Developers are the rightful stewards of the network because they make design-decisions for what's good for the network. Plus they're the smartest people in the room, and if you have technical questions, or just questions about Bitcoin in general, try to communicate with them. I personally have some replies, and I have to say that many things that were said in the forum are simply untrue and/or disinformation that are made by charlatans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "October 08, 2023, 07:00:41 AM",
      "body": "Quote from: Faisal2202 on October 06, 2023, 03:44:50 PMA whale was played out by a FUD, unbelievable, I mean, we all are humans and make mistakes, but I never heard this story and it is totally new for me. I never heard any relevant story as well, where a whale fell prey to FUD sentiment and sold that much amount of BTC. That's a huge amount. That man luckily bought bitcoins with his savings when the price of one coin was 8 dollars. I predict he wasn't rich and either way he didn't want to become poor and after all the fud and negative campaigns run by Roger Ver, he decided to take 9 million dollars and leave the game.There is a big difference between the guy who holded 30K bitcoins in 2015 and there is a huge difference between guy who holds 30K bitcoin today. The one that ownes 30K bitcoin today is no ordinary guy.Quote from: joker_josue on October 06, 2023, 04:43:08 PMI'm not even surprised by the quantity sold. Many who started early in Bitcoin managed to collect many coins, and many also sold them over time.I remember back in 2016 how one guy lost 20 bitcoin on dice in 5 bets. I had possibility to chat with him and he just said that he is a early adopter and has enough coins not to worry about 20 bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "October 08, 2023, 07:19:54 AM",
      "body": "I have tried to be there since then and I have sold a number of bitcoins that I had about 9 years ago in 2021. With an expression that is far from surprised I would say, that person is very stupid for selling such a large amount of bitcoin without can analyze that it is FUD.Selling bitcoin out of FUD and feeling regret can ultimately become regret. If the defrauded person selling out of FUD is still alive today, he has already accumulated a lot of bitcoins and is comfortable with the bitcoins he hold.This story is interesting and can be a valuable lesson. When we start to know how valuable bitcoin is, various kinds of news that corner bitcoin will not give rise to panic and selling.Unfortunately, I am a latecomer among people who knew Bitcoin first and fortunately I was late because I got to know Bitcoin when I was able to understand the value of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}