{
  "id": "topic_5432115",
  "title": "Marcellin9",
  "author": "Marcellin9",
  "created_time": "December 28, 2022, 07:56:25 AM",
  "content": "2022 has come to an end. It has been a year of global economic downturn, regional wars and potential crisis. Uncertainty or fear of uncertainty has become top priority to deal with in most countries over the world. Personally I am pessimistic about the new year's prospect. I don't think the global economy will turn better or people will have a more stable and secure life. What is your opinion ? Anyone there who are also pessimistic about the future ? Please let me know. Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432115",
  "comments": [
    {
      "author": "Lordhermes",
      "created_time": "December 28, 2022, 09:21:39 AM",
      "body": "Like every other year, 2022 will present some difficulties. The year 2023 will likewise have its own difficulties. However, as human beings, we must hope and pray for a better tomorrow.2023 will be an election year in my nation of Nigeria. We're ready for a change in government and are hoping to choose leaders who will improve the country's situation. I believe 2023 will be a better year for my family, friends, the country, or the entire planet.I'm also hoping that the conflict between Russia and Ukraine is resolved in 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "December 28, 2022, 03:08:26 PM",
      "body": "Just the way we a kind of feels whenever we are about to buy or get into something new, the enthusiast and excitement that something new is about to be unfold, same we have anticipated for this coming new year 2023 to come with loads of fortunes, happiness and good surprises, but in other to bring all this into realisation, we must also do everything it takes to ensure that we got positioned to receiving the tidings coming along with it, by been determined to seek and work towards a change, we must be tired of doing same thing the old ways and try out new alternative approachs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "December 28, 2022, 04:45:03 PM",
      "body": "Through my experience with the past years, it makes no sense to be optimistic or pessimistic, since the global situation is changing and cannot be anticipated.If we put different indicators of the current global economic situation (aggravated by the Russian-Ukrainian war) and climatic changes that international strategies cannot deal with, the outlook will necessarily be pessimistic.Personally, I prefer making short-term predictions based on current data, and not according to the calendar of the administrative year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "December 28, 2022, 05:03:26 PM",
      "body": "Quote from: Marcellin9 on December 28, 2022, 07:56:25 AM Personally I am pessimistic about the new year's prospect. I don't think the global economy will turn better or people will have a more stable and secure life. What is your opinion ? Anyone there who are also pessimistic about the future ? Please let me know. Thanks. Everybody's experience is not the same, even in this year that you have categorized as a harsh and difficult year, it has been a very good year for some people. You get what you expect, and since you are already expecting a year without change next year, things may not change for you. But for those who are expecting a better year next year, things can be good for them. For me, even when I see that things are not looking fine, I still want to expect the best from next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "December 28, 2022, 06:34:52 PM",
      "body": "Quote from: Marcellin9 on December 28, 2022, 07:56:25 AM2022 has come to an end. It has been a year of global economic downturn, regional wars and potential crisis. Uncertainty or fear of uncertainty has become top priority to deal with in most countries over the world. Personally I am pessimistic about the new year's prospect. I don't think the global economy will turn better or people will have a more stable and secure life. What is your opinion ? Anyone there who are also pessimistic about the future ? Please let me know. Thanks.As long as the war between Russia and Ukraine continue next year, I doubt if the world would recover from the economic downturn. This is because these two nations a key players in the global economic settings. Russian currently is not replaceable in the oil and gas sector and Ukraine is a major producer of some vital agricultural products. Another challenge the world might face is the resurfacing of Covid-19. China is still battling with this virus and there are every possibilities that new variants might also emerge that might move to other countries. But I am quit optimistic that Bitcoin price would go up and some hodlers would reap from their patience and bravery. I also believe that Europe would recover from the the economic and political challenges caused by the war in Ukraine. Some nations like mine would have their presidential elections next year, I am optimistic that only selfless leaders would win these elections.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "December 28, 2022, 08:17:38 PM",
      "body": "I am very optimistic about 2023 and beyond. While I don't like pain just the same as anybody else, I know that pain is 'Old Law' stuff. 'New Law' stuff is that there will be eternal life for those who believe in Jesus for salvation.Mark 16:17,18:Quote from: https://biblehub.com/niv/mark/16.htm17And these signs will accompany those who believe: In my name they will drive out demons; they will speak in new tongues; 18they will pick up snakes with their hands; and when they drink deadly poison, it will not hurt them at all; they will place their hands on sick people, and they will get well.”The New Law of eternal life is extending its power into the Old Law. But even if it is time for me to leave this Old Law life, I have eternal life in the New Law life. Any good thing that happens in this life is simply additional icing on the cake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "December 28, 2022, 11:28:45 PM",
      "body": "Reading the news would surely have you feeling pessimistic.  I'm personally torn.  So many people are expecting a recession and inflation is so high, it's almost like the contrarian position (which I like to take) is that things will recover and be better than ever.  I have no idea how that would happen while our government is printing us off a cliff and still trying to force covid shots down our throats, but who knows.  I've been around long enough to know that the opposite of what the majority thinks will happen is usually what will happen.  So for now I sit tight and hope for the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 29, 2022, 01:11:08 AM",
      "body": "I feel rather pessimistic, there is much to do for better times to come yet.I am afraid we have not seen the worst of this global crisis and we still need to face more challenges, the Bitcoin price will eventually recover but at societal level we are still suffering the impact of the pandemic and the bad choices of my local government. Nevertheless, I have not lost the hope some years to come will be better than these ones we managed to go through. I'd wish for the conflict between Russian and Ukraine to cool down, for the sake of humanity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PouJonah31",
      "created_time": "December 29, 2022, 08:18:00 AM",
      "body": "When I was a student, I looked forward to it every year. When I was in the society, I felt the changes in the situation. I didn’t save the ideal assets every year, but I still had to face it optimistically. There is nothing worse than the epidemic, and the future will get better and better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "December 29, 2022, 08:19:41 AM",
      "body": "I am as pessimistic as you are, what is happening in 2022 will continue into 2023, I mean, wars, inflation, and recessions will continue to escalate, and we will have a tough economic year like 2022 or more. Although the Fed has made moves that are said to be less hawkish in raising interest rates, it seems that interest rates are now taking effect, and countries' economies are starting to absorb interest rates. Besides increasing the price of goods, in the last 3 months of the year, a series of businesses, companies, and factories in my country simultaneously laid off workers. I predict that this will happen more in early 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "December 29, 2022, 08:50:28 AM",
      "body": "Why you need to be pessimistic? even crisis happen in your country, you need to have a good mindset and be productive in order to increase your brand and skills to survive from the crisis. Blame to the government and don't want to work are really dumb because you can't just hope the government will give you donations. Don't forget they're also a human and they need a money too, they could corrupt donation's money.So, be ready.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "December 29, 2022, 08:55:45 AM",
      "body": "Quote from: Marcellin9 on December 28, 2022, 07:56:25 AM2022 has come to an end. It has been a year of global economic downturn, regional wars and potential crisis. Uncertainty or fear of uncertainty has become top priority to deal with in most countries over the world. Personally I am pessimistic about the new year's prospect. I don't think the global economy will turn better or people will have a more stable and secure life. What is your opinion ? Anyone there who are also pessimistic about the future ? Please let me know. Thanks.Honestly, I'm starting to see the recovery but it's too hard for most because majority has been down and gone and back to zero due to the covid-19 pandemic + inflation and lost of jobs.Depression has grown bigger and that's sad for those that have experienced and experiencing it. I've got a lot of friends that have dealt and are dealing with it right now and I feel bad for them.It's not just all about the financial matters to recover for 2023 but as well as the mental state of most that needs to be healed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "December 29, 2022, 09:33:56 AM",
      "body": "Surely the future is unpredictable but let's leave it as it is and just focus on our main goal in life. I know most of us to think there will be some more negative things coming next year but as long as it will not gonna come yet, we still have the chance to step forward and reach our dreams. We just don't to see another foolish war will happen next year because I really don't want to see innocent people suffering because of the greed and tyranny of their leaders. If only leaders themselves will fight, they would have ended this war a long time ago but they always sent their troops and it will not end until one party will surrender or is annihilated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sayakaaja",
      "created_time": "December 29, 2022, 10:33:26 AM",
      "body": "I always think optimistically for the year ahead. I hope that the next year will be even better than the previous years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "December 29, 2022, 01:31:09 PM",
      "body": "Quote from: Despairo on December 29, 2022, 08:50:28 AMWhy you need to be pessimistic? even crisis happen in your country, you need to have a good mindset and be productive in order to increase your brand and skills to survive from the crisis. Blame to the government and don't want to work are really dumb because you can't just hope the government will give you donations. Don't forget they're also a human and they need a money too, they could corrupt donation's money.So, be ready.Pessimism doesn't mean we'll give up or blame anyone, but honestly, I don't see any growth or recovery for our economy next year. Of course, the more unstable the economy is, the more we need to try harder and look for opportunities for ourselves because in a crisis there will be a lot of collapses, but it will also create a lot of new millionaires and billionaires. Therefore, crisis is also considered an opportunity if we know how to seize the opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marcellin9",
      "created_time": "December 30, 2022, 03:21:06 AM",
      "body": "Quote from: Despairo on December 29, 2022, 08:50:28 AMWhy you need to be pessimistic? even crisis happen in your country, you need to have a good mindset and be productive in order to increase your brand and skills to survive from the crisis. Blame to the government and don't want to work are really dumb because you can't just hope the government will give you donations. Don't forget they're also a human and they need a money too, they could corrupt donation's money.So, be ready.Being pessimistic equals blaming government and unwillingness to work ? Who taught you that and which word did I use or imply to generate that aweful thought ? This is a normal topic about discussing the future concerns and sharing thoughts, not assumption and accusation. Please be noted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PouJonah31",
      "created_time": "December 30, 2022, 06:51:24 AM",
      "body": "I think every year is a new beginning. Whether it is the economic problem or the epidemic problem, they are slowly getting better, making life full of joy. Face each day in the future objectively, and just hope that you can be safe and happy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarteeBernard29",
      "created_time": "December 30, 2022, 07:05:52 AM",
      "body": "The new year is a new beginning, all we can do is keep moving forward, the epidemic will dissipate in the new year, and all dreams will be on track.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fullbear2222",
      "created_time": "December 30, 2022, 07:44:48 AM",
      "body": "Quote from: Marcellin9 on December 28, 2022, 07:56:25 AM2022 has come to an end. It has been a year of global economic downturn, regional wars and potential crisis. Uncertainty or fear of uncertainty has become top priority to deal with in most countries over the world. Personally I am pessimistic about the new year's prospect. I don't think the global economy will turn better or people will have a more stable and secure life. What is your opinion ? Anyone there who are also pessimistic about the future ? Please let me know. Thanks.Nothing good for hope.Not enough money no jobs and other problems.Look like the 2023 could be the most bad year in 10 years time.The economy need money but rates Going higher so no liquity for the markets.If people lose Jobs then many people go grazy mental ilness and crimes can be our daily life.But Even the experts dont see nothing good about 2023.Also no recovery of btc crypto Market not moving much not much profit For traders.Crisis Will go bigger that's for sure everybody feels that nothing good coming many people are Prep now and they move out of the big cities.Better be prepared for the most bad it's better instead of pointless hope.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}