{
  "id": "topic_5404646",
  "title": "noormcs5",
  "author": "noormcs5",
  "created_time": "June 30, 2022, 02:11:52 PM",
  "content": "It's been observed that gamblers prefer to play on casino which do not enforce KYC. Well, let's discuss what are the main reasons that they do not want to show their identity and gamble anonymously. They don't trust the casino as the casino might misuse the kyc documents or the gamblers want to gamble without telling anyone that they are the gamblers,  gambling is illegal in their region or religion and they want to hide their identity or there could be any other solid reason?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404646",
  "comments": [
    {
      "author": "Beparanf",
      "created_time": "June 30, 2022, 02:16:14 PM",
      "body": "The reason why I’m not comfortable giving my KYC to casino is due to the nature of there business. Even in IRL casino, I’m having a hard time to go in there because your image will be ruined in my country if your colleagues know that you are a gambler and playing at the casino. My worst nightmare on providing KYC to casino is when someone manage to leak all the documents submitted to them and published in public my identity as a player for that particular casino. This will be very shameful since I choose crypto casino since I can play freely without the judgmental eyes watching me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 30, 2022, 02:19:39 PM",
      "body": "I think most of the time it'll be down to the potential documents can be misused or could be stolen if not secured well - if you can do kyc in some places by just confirming your address why can't online casinos do the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "June 30, 2022, 02:23:14 PM",
      "body": "Quote from: noormcs5 on June 30, 2022, 02:11:52 PMThey don't trust the casino as the casino might misuse the kyc documents or the gamblers want to gamble without telling anyone that they are the gamblers,  gambling is illegal in their region or religion and they want to hide their identity or there could be any other solid reason?Privacy and security is the reason why I avoid KYC in gambling. I just want to visit the casino website, register, make my bet, win or lose and leave in peace without thinking that some day my personal details can be compromised either by the casino or a third party. And it may end up being in the public domain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "June 30, 2022, 02:27:18 PM",
      "body": "The reason is very simple, we are in the crypto space so we should enjoy anonymous gambling. Crypto casinos became popular because of that feature, because if crypto casinos will require a KYC, then there's no difference from fiat casinos, and IMO Fiat casinos are safer because they are regulated by a more reliable agency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "June 30, 2022, 02:33:36 PM",
      "body": "Some people are from the countries which do not allow things like : Gambling, Online Gambling, Crypto Gambling which means that they might have to hide while Gambling so that they won't be prosecuted for it. Other than that there are people who generally ' Don't want to pay taxes for their Gambling profits' Then just comes the people who would prefer their privacy above all therefore they generally do not try and go for the casinos asking for KYC, it can also affect their job opportunities because believe it or not ' your digital footprint is a thing' therefore they might have to ward of any issues that might arise from those.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "June 30, 2022, 02:40:17 PM",
      "body": "Quote from: noormcs5 on June 30, 2022, 02:11:52 PMIt's been observed that gamblers prefer to play on casino which do not enforce KYC. Well, let's discuss what are the main reasons that they do not want to show their identity and gamble anonymously. They don't trust the casino as the casino might misuse the kyc documents or the gamblers want to gamble without telling anyone that they are the gamblers,  gambling is illegal in their region or religion and they want to hide their identity or there could be any other solid reason?All you've mentioned are valid reasons, some countries are treating gambling as taboo or they have lower respect for people who gamble, and some don't want their sensitive information on a site where they do not know who is managing the casino, we are not dealing with banks where they take their KYC and they have obligation to the government to keep this information confidential, we cannot say that with certainty on online casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "June 30, 2022, 02:41:22 PM",
      "body": "It's not only limited due to their religion or region, have you ever heard when someone send their personal identity to random sites and then after few years later, there's a debt collector ask to pay off your loan while you never ask a loan to anyone. This mean your personal identity have been used to borrow money by those people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "June 30, 2022, 02:48:14 PM",
      "body": "Quote from: noormcs5 on June 30, 2022, 02:11:52 PMIt's been observed that gamblers prefer to play on casino which do not enforce KYC. Well, let's discuss what are the main reasons that they do not want to show their identity and gamble anonymously. They don't trust the casino as the casino might misuse the kyc documents or the gamblers want to gamble without telling anyone that they are the gamblers,  gambling is illegal in their region or religion and they want to hide their identity or there could be any other solid reason?Some gamblers want to remain anonymous in terms of playing in casino they avoid KYC to prevent their identity and private information to avoid such things happen like their identity or private information will be public someday. And also those gamblers play in that particular casino for their happiness only and they not want to take a risk or hastle about answering all the kyc's asked from the casino. Cause all they want is to have fun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "June 30, 2022, 02:49:07 PM",
      "body": "Quote from: noormcs5 on June 30, 2022, 02:11:52 PMIt's been observed that gamblers prefer to play on casino which do not enforce KYC. Well, let's discuss what are the main reasons that they do not want to show their identity and gamble anonymously. They don't trust the casino as the casino might misuse the kyc documents or the gamblers want to gamble without telling anyone that they are the gamblers,  gambling is illegal in their region or religion and they want to hide their identity or there could be any other solid reason?You already stated the obvious, what else can I add   As for me, I don't mind whether the casino requires KYC or not.  We already had a Data leak in one of our Gov't institutions, the one that compiles voters in our country, what else can I hide lol.  Online gambling is legal (I suppose it is) in our country and most Casinos do not blacklist the access of our country's IP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "June 30, 2022, 02:49:25 PM",
      "body": "I think gamblers avoid KYC because they don't gamble on just one site, and showing their documents on all casino sites is very stupid, because most of these sites can't be trusted. This doesn't just apply to casinos. Leaving your documents unnecessarily on the internet is a bad habit. One day it may happen that you are blacklisted because someone else has used your documents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "June 30, 2022, 02:57:04 PM",
      "body": "Quote from: Apocollapse on June 30, 2022, 02:41:22 PMIt's not only limited due to their religion or region, have you ever heard when someone send their personal identity to random sites and then after few years later, there's a debt collector ask to pay off your loan while you never ask a loan to anyone. This mean your personal identity have been used to borrow money by those people.That's what we worry about so we are afraid of being misused for things like that or other bad things so I avoid any KYC from the casino, just imagine in every casino KYC applies while we play on many sites means we have to submit documents to all sites that play at there then it's not possible and I'm sure the casinos are now providing convenience without KYC.Basically my documents don't want to be misused, so this will be a concern for many people, well I know many crypto casinos now without KYC that's what we are happy about now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 30, 2022, 02:58:43 PM",
      "body": "Quote from: noormcs5 on June 30, 2022, 02:11:52 PMThey don't trust the casino as the casino might misuse the kyc documents or the gamblers want to gamble without telling anyone that they are the gamblers,  gambling is illegal in their region or religion and they want to hide their identity or there could be any other solid reason?Gambling is restricted in some countries and the person may ptefer to gamble on a no KYC casino. Gambling is not restricted in my country and I am not bothered and I do not avoid KYC on trustworthy casinos. KYC also even make me feel secure about my money on a casino than not having any documents to prove that I am the owner of the gambling account. But some gamblers can be afraid of their KYC documents not to be sold to third party which is a valid reason.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "June 30, 2022, 03:00:16 PM",
      "body": "Most no one likes KYC verification as a condition for one to gamble, and if there was and was needed, the site would definitely be abandoned by players.Because I believe that the identity of someone who plays gambling certainly does not want to be known by others, especially if it is misused. And I have never met the requirement that a person who gambles must submit his/her identity as a condition for gambling, in cyberspace or in real life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "June 30, 2022, 03:03:08 PM",
      "body": "Quote from: noormcs5 on June 30, 2022, 02:11:52 PMThey don't trust the casino as the casino might misuse the kyc documents or the gamblers want to gamble without telling anyone that they are the gamblers,  gambling is illegal in their region or religion and they want to hide their identity or there could be any other solid reason?I don't see any other reason why gamblers avoid KYC other than the things you've mentioned. I know that all of us are afraid that someone might use our identity for illegal activities so I think that's the main reason why we always hesitate  in complying with the KYC rule. Being afraid that someone like your relative or religion know that you're gambling isn't that scary for me, if it's illegal in your country then use vpn. There are some gambling casino that allows the use of vpn. While if someone used your identity, you could go to prison for many years or pay huge fines even though you did not do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasisog",
      "created_time": "June 30, 2022, 03:13:23 PM",
      "body": "There are lots of reasons why most gamblers don't like complying with the KYC. Some people see it as a hassle, others don't have the documents needed to pass the KYC while others are being careful with their details for the fear of document breach or identity theft. However, KYC is beneficial for us as well as the site because we could get the protection and security that we want by submitting it. We might have our personal reasons but I hope that we could also see its importance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "June 30, 2022, 03:16:34 PM",
      "body": "one solid reason is your identity is being at risk of being stolen, sold or used. a lot of people are cautious about it especially when there have been cases where important info about users' Identities being leaked. people just do not want to risk their identity being used in something that they know nothing of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlisle1",
      "created_time": "June 30, 2022, 03:21:11 PM",
      "body": "Quote from: virasisog on June 30, 2022, 03:13:23 PMThere are lots of reasons why most gamblers don't like complying with the KYC. Some people see it as a hassle, others don't have the documents needed to pass the KYC while others are being careful with their details for the fear of document breach or identity theft. However, KYC is beneficial for us as well as the site because we could get the protection and security that we want by submitting it. We might have our personal reasons but I hope that we could also see its importance. There are many personal reasons why gamblers are not really comfortable submitting KYC when they are playing, most of themare discreetly participating in this kind of activities and not willing to reveal their identities, while for some, they are not willing to engageto any possible hassle, especially in term of securities. Whatever reason behind KYC mostly being implemented and if you are really intothis kind of activities and you are using a decent amount of money, you'll be forced to submit this information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "June 30, 2022, 03:46:48 PM",
      "body": "Quote from: noormcs5 on June 30, 2022, 02:11:52 PMIt's been observed that gamblers prefer to play on casino which do not enforce KYC. Well, let's discuss what are the main reasons that they do not want to show their identity and gamble anonymously.Honestly, I'm not sure about gambling sites that prioritize the KYC system registration / provide real identity, if the gambling site insists on having to do kyc, I choose to withdraw, despite the huge and promising bonus offer, even with the first $$$$ deposit.For me personally, the article below will help me to be more careful in giving out my personal identity, especially gambling sites.• How KYC/AML poses a serious threat to your privacy and should not be used at all.• Be careful with your KYC documents.• The Unseen Danger of KYC.Conclusion: why do I have to give my ID/kyc, for certain gambling sites, in the end they also cheat their customers, Many gambling sites do not require KYC, but they are responsible and honest for their users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "June 30, 2022, 03:58:25 PM",
      "body": "Surely most of the reasons are privacy issues, especially if the KYC that has to be done must uploading documents containing important personal data but unfortunately this is not very well understood. Now that there are so many online casinos and we can choose which ones do not require KYC. Meanwhile, the desire for activities not to be known by the closest people can be easily tricked by playing in secret.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}