{
  "id": "topic_5402189",
  "title": "sovrynaut(RSK)",
  "author": "sovrynaut(RSK)",
  "created_time": "June 11, 2022, 12:45:57 PM",
  "content": "Hi all, I have a question. Would it be possible to implement Electrum's integration with DeFi platform from RSK - Sovryn? They are already integrated with Ledger, Trezor, Meta Mask, Liquality etc. and soon they will be providing integration with Lightning. I think they are doing good job there and for the Bitcoin ecosystem this would be a good step for Electrum and for RSK to integrate the wallet to the platform. What do you think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402189",
  "comments": [
    {
      "author": "Pmalek",
      "created_time": "June 11, 2022, 02:04:16 PM",
      "body": "Sovryn is a lending and borrowing platform right? Plus there is a staking feature if I am not mistaken. It operates on the RSK sidechain. Electrum works with the base layer + the LN. I guess they could integrate with Sovryn as well, but why is it needed and what do you gain from this partnership/integration? Do you want to connect your Electrum wallet directly to Sovryn to be able to lend/borrow other assets and stake them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sovrynaut(RSK)",
      "created_time": "June 11, 2022, 02:17:46 PMLast edit: June 11, 2022, 02:29:18 PM by sovrynaut(RSK)",
      "body": "Yes, what I mean is exactly analogical integration as they have with hardware wallets. It works in the way so that you keep your private keys but you can use the Sovryn's platform while. My idea is that people who do not have hardware wallets or for any reason do not want to use them could access Sovryn but in contrast to Meta Mask or Liquality etc. could keep private keys (which is the Sovryn's motto).Also my question on Sovryn's discord channel:\"09:04on last Community Call (42) I was the guy who asked about Electrum Wallet integration with SovrynI would like clarifywhat I mean is an integration such as Sovryn integration with Meta Mask or Ledger etc.in case of a Ledgere or Trezor you keep your keysin case of Meta Mask, Liquality etc. you give your keys to themin case of Electrum Wallet you keep your keys but no need for a hardwarethat is why I think it would be worth to consider Electrum integrationDragonly — 09:08does Electrum support Ethereum and other RPCs?and also  electrum doesn't have any web 3 functionalities.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sovrynaut(RSK)",
      "created_time": "June 25, 2022, 07:23:01 AM",
      "body": "Nobody interested in this subject?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 26, 2022, 04:05:48 PM",
      "body": "Quote from: Pmalek on June 11, 2022, 02:04:16 PMand what do you gain from this partnership/integration?I think that they want to gain some advertising by tying their name to Electrum's.Also I think that they were hoping that Electrum team may implement that, hence gain some sort of endorsement.Quote from: sovrynaut(RSK) on June 25, 2022, 07:23:01 AMNobody interested in this subject?While LN is seen as something that helps Bitcoin, your DeFi thing is not. So you'll have to find somebody from that DeFi team willing to make a fork of Electrum and implement what you need.And I second that: bitcoiners are not interested in DeFi as much as you'd expect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 29, 2022, 06:00:34 AM",
      "body": "You would need to create such a plugin yourself, using Electrum's plugin system.Be warned however that the plugin system's documentation is sparse, and you may have to find the integration points from the source code of Electrum (maybe you can make some commands open a browser link to the website's login page for example).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "June 30, 2022, 02:16:48 PM",
      "body": "Quote from: NeuroticFish on June 26, 2022, 04:05:48 PMQuote from: Pmalek on June 11, 2022, 02:04:16 PMand what do you gain from this partnership/integration?I think that they want to gain some advertising by tying their name to Electrum's.Also I think that they were hoping that Electrum team may implement that, hence gain some sort of endorsement.Lol, this looks suspiciously like shilling to me to, and I'm glad to see I don't have a monopoly on cynicism.Quote from: sovrynaut(RSK) on June 25, 2022, 07:23:01 AMNobody interested in this subject?This is bitcointalk.org not shitcointalk.org.  As others have said, you're not likely to get much support from this community or the Electrum development team seeing as how the majority of us are bitcoin maximalists.  If you want to integrate Electrum into your service (or vice versa) you'll need to create a fork of Electrum yourself.I don't presume to speak for the Electrum dev team, however so you're welcome to present the request the them directly.  You can make the suggestion on their github \"issues\" page:https://github.com/spesmilo/electrum/issues",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}