{
  "id": "topic_5419933",
  "title": "ChillyMatthew",
  "author": "ChillyMatthew",
  "created_time": "November 08, 2022, 11:32:21 AM",
  "content": "GM Crypto Fam. We've seen what's going on with Binance and FTX, so I came by to see what you all think of this since I'm not really sure how everything is going to pan out, and why is CZ doing what he's doing.FTT collapsed by 15%, BTC had its worst day in two months, dropping 4%, and ETH dropped 5%. All of that in less than 24 hours following this event. It seems that many investors are selling or just withdrawing their assets from FTX. Do you think this is a smart move, or are the people just panicking for no reason? What would you do if you had money laying around is FTX?Source of the story:https://decrypt.co/113723/investors-withdrawal-millions-from-ftx-binance-begins-liquidating-ftt-token",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419933",
  "comments": [
    {
      "author": "livingfree",
      "created_time": "November 08, 2022, 12:40:08 PM",
      "body": "Quote from: ChillyMatthew on November 08, 2022, 11:32:21 AMIt seems that many investors are selling or just withdrawing their assets from FTX. Do you think this is a smart move, or are the people just panicking for no reason?Their worry is legitimate. They don't know how long this shall stay or what will be the next episode of this noise made by FTX and CZ. It's better for them to take out all of their assets from FTX before they halt every withdrawal which is very likely to mitigate the effect of the dump that CZ will do.It's a smart move and it's always been smart to pull out your funds off exchanges for your sake.Quote from: ChillyMatthew on November 08, 2022, 11:32:21 AMWhat would you do if you had money laying around is FTX?I will withdraw and wait until the dust settles.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "November 08, 2022, 12:47:38 PM",
      "body": "Quote from: ChillyMatthew on November 08, 2022, 11:32:21 AMGM Crypto Fam. We've seen what's going on with Binance and FTX, so I came by to see what you all think of this since I'm not really sure how everything is going to pan out, and why is CZ doing what he's doing.FTT collapsed by 15%, BTC had its worst day in two months, dropping 4%, and ETH dropped 5%. All of that in less than 24 hours following this event. Yeah well FTX is one of the big players of the crypto space after all so i am not really surprised that news about the planned sell-off of FTT tokens by Binance is creating some fear among the crypto investors. I don't really know for sure why Binance is doing that sell-off but for me it is pretty obvious that they just want to harm another competitor again like a few months ago when they stopped supporting USDC as a stableocin on their exchange, even though USDC is a top stablecoin in terms of marketcap and reliability. Binance and CZ become a monopolist more and more and they continue to use that power to harm their competitors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "November 08, 2022, 01:12:03 PM",
      "body": "Quote from: ChillyMatthew on November 08, 2022, 11:32:21 AMGM Crypto Fam. We've seen what's going on with Binance and FTX, so I came by to see what you all think of this since I'm not really sure how everything is going to pan out, and why is CZ doing what he's doing.FTT collapsed by 15%, BTC had its worst day in two months, dropping 4%, and ETH dropped 5%. All of that in less than 24 hours following this event. It seems that many investors are selling or just withdrawing their assets from FTX. Do you think this is a smart move, or are the people just panicking for no reason? What would you do if you had money laying around is FTX?Source of the story:https://decrypt.co/113723/investors-withdrawal-millions-from-ftx-binance-begins-liquidating-ftt-tokenYes, the FTX token has fallen in price by 30 percent.  All these manipulations make investors nervous.  We are currently in a bear market phase. Panic prevails among investors.  Any careless actions and statements by the leaders of cryptocurrency exchanges can only increase the panic among traders and investors.  Now, few crypto assets are more or less stable.  For example, Bitcoin, Ethereum, Monero. It probably makes sense to buy the FTX token, but only when there is confidence that its price has reached its minimum values.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "November 08, 2022, 03:04:14 PMLast edit: November 08, 2022, 03:35:31 PM by suzanne5223",
      "body": "Quote from: Smartprofit on November 08, 2022, 01:12:03 PMQuote from: ChillyMatthew on November 08, 2022, 11:32:21 AMGM Crypto Fam. We've seen what's going on with Binance and FTX, so I came by to see what you all think of this since I'm not really sure how everything is going to pan out, and why is CZ doing what he's doing.FTT collapsed by 15%, BTC had its worst day in two months, dropping 4%, and ETH dropped 5%. All of that in less than 24 hours following this event. It seems that many investors are selling or just withdrawing their assets from FTX. Do you think this is a smart move, or are the people just panicking for no reason? What would you do if you had money laying around is FTX?Source of the story:https://decrypt.co/113723/investors-withdrawal-millions-from-ftx-binance-begins-liquidating-ftt-tokenYes, the FTX token has fallen in price by 30 percent.  All these manipulations make investors nervous.  We are currently in a bear market phase. Panic prevails among investors.  Any careless actions and statements by the leaders of cryptocurrency exchanges can only increase the panic among traders and investors.  Now, few crypto assets are more or less stable.  For example, Bitcoin, Ethereum, Monero. It probably makes sense to buy the FTX token, but only when there is confidence that its price has reached its minimum values.Yes, careless actions or statements from influencers or power exchange owners can lead to a lot of panic but his statement is clear and I believe he's not pointing to all crypto in the market. Therefore, anyone that claims to be a crypto trader or investor and panic sells because of the recent issue found on the FTX activities is totally naive about the market.What you said about buying FTX is true but exchange tokens or coins don't have a solid use case. I hope you'll be sure about all the allegations raised about the FTX exchange before buying the token. I expect the US SEC to step in soon since FTX.us provide services to US customer.Edit:  FTX token is not available in the United States or prohibited jurisdictions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "November 08, 2022, 03:24:51 PM",
      "body": "Billionaires or whales are fighting and us retail investors suffering from their actions   To be honest, I believe the recent issue with these exchanges (FTX and Binance) is nothing to do with the recent dumps exclude their own tokens of these said exchanges and other altcoins connected with the issue like SOL, SRM, FIDA, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "November 08, 2022, 06:44:19 PM",
      "body": "Time for action to 13,000$-15,000$.My expectation \"Bitcoin\" will reached this number for the dippest price until we're waiting again the halving bitcoin on 2024. I support Binance because FTX scheme is kinda worried and we don't want LUNA.2.0 from FTX ~xd",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mame89",
      "created_time": "November 08, 2022, 07:35:12 PM",
      "body": "FTT has reached a price of 3$ from now reaching minus 80%. it's really terrible the action of the two big markets in crypto monopoly each other. FTT is very difficult to restore large volumes with continuous large decline whether there will be a crash of FTX. although the error is not money laundering but it has a huge impact on other crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}