{
  "id": "topic_5441334",
  "title": "Bthd",
  "author": "Bthd",
  "created_time": "February 26, 2023, 08:09:45 PM",
  "content": "Coingecko üzerinden kullanışlı olabileceğini düşündüğüm bir portföy oluşturdum. Geçtiğimiz sezonda ortalama üstü yatırımcılardan yatırım almış projelerin en düşük halka satış fiyatı ile güncel fiyatlarını karşılaştırmanıza yarıyor.Her projenin ico fiyatından 1 adet alım girdim. Halka satış aşaması olmayan projeler için bu değeri gözleyemezsiniz ancak yine de gözden kaçırmamak adına alım girmeden listeye ekledim. Market cap / FDC sütunundan birimlerin ne kadarının dolaşımda olduğunu görebilirsiniz. PNL kısmından ise ico fiyatına oranını gözleyebilirsiniz.FEI ve benzeri halen piyasada fiyatı olan fakat projeyi durdurmuş birimleri listenin dışında tuttum. Yine de faaliyetlerini durdurmuş fakat dikkatimden kaçmış birimler olabilir. Listenin coingecko bağlantısını da paylaşacağım fakat bağlantıyı siz açtığınızda PNL kısmını göremiyorsanız yine de içlerinden kendi takibinize almak istedikleriniz varsa kendi listenizi oluşturabilmeniz için paylaşıyorum.Özellikle herhangi bir filtre uygulamadım. Geçtiğimiz dönemin icosu ses getiren projeleri olarak düşünebilirsiniz sadece. Yatırım yapmak yada yapmamak tercihini kendi araştırmalarınız sonucunda vermelisiniz. Zaten listede 80'den fazla birim var. Listede bu proje de olmalı derseniz memnuniyetle ekleyerek zamanla güncelleyebilirim.Coingecko paylaşım linki: https://www.coingecko.com/en/portfolios/public/BAh7BjoRcG9ydGZvbGlvX2lkaQM8l8A=--640412b2443f7bb69d591494108a5a1a1585e3d7",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441334",
  "comments": [
    {
      "author": "kriminall",
      "created_time": "February 27, 2023, 06:29:40 AM",
      "body": "Gözüme çarpan şey bazı projelerin ciddi market hacmi olmasına rağmen ico fiyatlarından inanılmaz uzakta oluşları, sizce bu neden oluyor, ico duyurdukları zaman kriptoparalara olan ilgiden pahalı piyasaya çıkması mı yoksa daha sonradan sirkülasyon değişiklikleri ile adet arttırımı yoluna mı gitmişler, düşüş yaşayan bir çok tokende bunu görüyorum en basitinden Vega protokol, elinize sağlık bu arada",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "February 27, 2023, 07:41:49 AM",
      "body": "Quote from: kriminall on February 27, 2023, 06:29:40 AMGözüme çarpan şey bazı projelerin ciddi market hacmi olmasına rağmen ico fiyatlarından inanılmaz uzakta oluşları, sizce bu neden oluyor, ico duyurdukları zaman kriptoparalara olan ilgiden pahalı piyasaya çıkması mı yoksa daha sonradan sirkülasyon değişiklikleri ile adet arttırımı yoluna mı gitmişler, düşüş yaşayan bir çok tokende bunu görüyorum en basitinden Vega protokol, elinize sağlık bu arada Boğa döneminde nasıl olsa satılıyor kafası ile çoğu proje çılgın rakamlardan sattı üstüne vesting takviminden açılan coinler olunca fiyatlar anormal düştü.Şuan düşün minima satılıyor bir cent'ten tohum yatırımı toplamış şuan 30 centten public sale yapıyor adamların vestingi başladığı gün ki wminima seed sale'de vesting yok.  Adam kafadan 30x yapmış durumda böyle bir dönemde bu adam neden projenin daha iyi yerlere gelmesini beklerki yada beklermi sonuçta o da biliyor dağıtım modelinin olduğunu.Burada benin canımı sıkan bazı projelerin çok kaliteli yerlerden çıkıp şuan alıcı bile bulmaması. qredo'ya bak mcap yerlerde  onu almak için millet sıraya giriyordu bu fiyattan alıcı yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "February 28, 2023, 06:10:17 PM",
      "body": "Hocam emeğinize sağlık güzel bir liste oluşturmuşsunuz. Bilinen ico fiyatlarının güncel karşılaştırması alıp almama konusunda kararsız olanlar için bir referans olabilir. Listeye bakıyorum da bir çok proje hala ico fiyatının altında kalıyor. Bunda farklı etkenler de olabilir tabi ama genel olarak fiyatların yükselmediği bazı projeleri takip etmekte fayda var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "March 01, 2023, 07:55:39 AM",
      "body": "Paylaşım ve emeğiniz için teşekkürler güzel bir çalışma olmuş. Alım yaparken listeyi iyice incelemek çok çok önemli alım yaptığınız fiyat belki size uygun geliyor olabilir ama proje aşamasında belki bu fiyatın 10-100 kat daha ucuza satılmış olabilir bu gibi durumlarda zarar etme olasılığı da artıyor. Yatırım yaparken bu bilgiler ışığında daha verimli yatırım yapılabilir araştırmak incelemek çok çok önemli.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ozgr",
      "created_time": "March 01, 2023, 11:47:04 AM",
      "body": "Gerçekten güzel bir liste olmuş teşekkürler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "March 01, 2023, 08:11:34 PM",
      "body": "Güzel, faydalı bir liste olmuş elinize sağlık. Ico'dan beri takip ettiğim bazı projeler vardı benim takip listemde hala sahip olduklarım da var. Daha detaylı inceleyip kendime ekstra bir şeyler çıkarmak için tekrardan bakacağım. Özellikle ICO fiyatının altına satılan projelere bakmak istiyorum detaylı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flipme",
      "created_time": "March 01, 2023, 09:35:06 PM",
      "body": "En kötüsü Oiler olmuş. Geri kalanların çoğunun ondan aşağı kalır yanı yok ama en büyük kaybı o yaşamış. Alt coinlere yatırım yapmak her zaman risklidir. Özellikle ayı sezonunda çok büyük kayıplar yaşıyorlar. Bu gibi riskleri bilmeden yatırım yapan insanlar bütün parasını bu pazarda kaybedebilir. Tablo bu açıdan bence çok önemli. Çünkü %90'lık kayıpların telafisi için yatırım yaptıkları coinin 10x yapmasını bekleyecek yatırımcılar. Bu bazı coinler için neredeyse imkansız. Yine de beklemeye devam edecek olan yatırımcılar olacaktır elbette. Ancak, bence bazıları hiçbir zaman eski fiyatlarına ulaşamayacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "March 02, 2023, 09:47:59 AM",
      "body": "Quote from: flipme on March 01, 2023, 09:35:06 PMEn kötüsü Oiler olmuş. Geri kalanların çoğunun ondan aşağı kalır yanı yok ama en büyük kaybı o yaşamış. Alt coinlere yatırım yapmak her zaman risklidir. Özellikle ayı sezonunda çok büyük kayıplar yaşıyorlar. Bu gibi riskleri bilmeden yatırım yapan insanlar bütün parasını bu pazarda kaybedebilir. Tablo bu açıdan bence çok önemli. Çünkü %90'lık kayıpların telafisi için yatırım yaptıkları coinin 10x yapmasını bekleyecek yatırımcılar. Bu bazı coinler için neredeyse imkansız. Yine de beklemeye devam edecek olan yatırımcılar olacaktır elbette. Ancak, bence bazıları hiçbir zaman eski fiyatlarına ulaşamayacak.İşte altcoinler bu saydıklarınız yüzünden de aynı zamanda çok yüksek kazandırmaya meyilliler. Hem çok düşüyorlar, hem de çok çabuk yükseliyorlar. Gerçi hatırlıyorum da bir dönem Coinbase satışları çok revaçta idi. Bazı projeler bunu kullanarak fahiş şekilde token satışları gerçekleştirmişti. O dönemde Coinbase üzerinde satılan çoğu token buna rağmen ciddi kazançlar sunuyordu. Bugün ise o seviyenin çok altındalar. Yine de bazı sağlam düşünülen projelere bir miktar yatırım yapmak için -%90 avantajlı bir istatistik görünümünde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "March 02, 2023, 02:43:06 PM",
      "body": "Quote from: Silence Scream on March 02, 2023, 09:47:59 AMİşte altcoinler bu saydıklarınız yüzünden de aynı zamanda çok yüksek kazandırmaya meyilliler. Hem çok düşüyorlar, hem de çok çabuk yükseliyorlar. Gerçi hatırlıyorum da bir dönem Coinbase satışları çok revaçta idi. Bazı projeler bunu kullanarak fahiş şekilde token satışları gerçekleştirmişti. O dönemde Coinbase üzerinde satılan çoğu token buna rağmen ciddi kazançlar sunuyordu. Bugün ise o seviyenin çok altındalar. Yine de bazı sağlam düşünülen projelere bir miktar yatırım yapmak için -%90 avantajlı bir istatistik görünümünde. Coinbase ile Coinlist'i karıştırıyorsunuz. Çoğu platformla kıyasladığınızda oldukça iyi sayılırlar. Vega, Stader gibi hype zamanı sattıkları büyük oranda zararda iken Flow, SOL, Mina gibi görece önce olanlar satış fiyatının halen oldukça üzerinde işlem görüyorlar.Quote from: flipme on March 01, 2023, 09:35:06 PMEn kötüsü Oiler olmuş. Geri kalanların çoğunun ondan aşağı kalır yanı yok ama en büyük kaybı o yaşamış. Alt coinlere yatırım yapmak her zaman risklidir. Özellikle ayı sezonunda çok büyük kayıplar yaşıyorlar. Bu gibi riskleri bilmeden yatırım yapan insanlar bütün parasını bu pazarda kaybedebilir. Tablo bu açıdan bence çok önemli. Çünkü %90'lık kayıpların telafisi için yatırım yaptıkları coinin 10x yapmasını bekleyecek yatırımcılar. Bu bazı coinler için neredeyse imkansız. Yine de beklemeye devam edecek olan yatırımcılar olacaktır elbette. Ancak, bence bazıları hiçbir zaman eski fiyatlarına ulaşamayacak.Oiler'in başlangıç fiyatının çok altında gidiyor olmasının sebebi Balancer üzerinde en yüksek teklifi veren alır tarzı havuzlardan satışa çıkmış olması. Sadece acemi kullanıcıların kullanacağı bir satış tipi. Zaten almayı en çok isteyen herkes satın aldığında geriye sadece satıcılar ve alıcısız mal kalıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ondekinecakabilirim",
      "created_time": "March 02, 2023, 04:33:53 PM",
      "body": "Quote from: Silence Scream on March 02, 2023, 09:47:59 AMYine de bazı sağlam düşünülen projelere bir miktar yatırım yapmak için -%90 avantajlı bir istatistik görünümünde. Bardağa dolu tarafından bakma stratejisi. Doğru değerlendiriyorsunuz bi bakıma. -%90 avantajlı bi istatisk görünümünde. Ama bazı coinler -%99 olmuş. -%90 iken aldığımız coin. -%99 olursa. Biz de -%90 zarar etmiş oluruz. Şu şekil100 birim coin 10 birime düşerse -%90 zarar olur.Daha sonra 10 birime düşen coin 1 birime düşerse. 10 birimken alan kişi için -%90 zarar olur. En başından alan kişi için ilaveten -%9 zarar olur sadece. Dibin dibi olmuyor ayı sezonunda. Acemi yatırımcılar en çok bundan kaybediyor bana kalırsa. Aaa çok düşmüş biraz alayım dedikçe zarar ediyor çoğu. Hoş ben de usta bi yatırımcı diilim. Ama gözlemlerim bu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 20, 2023, 04:05:09 PM",
      "body": "@bthd hocam listeyi coingecko olarak paylaşman harika oldu. Hayatta olan projelerden tadımlık cüzdana atacağım. Akla hayale gelmeyecek düşüşler yaşamışlar.  Tek tek inceleyeceğim.Teşekkür ederim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "November 22, 2023, 02:35:12 PM",
      "body": "Quote from: Ondekinecakabilirim on March 02, 2023, 04:33:53 PMDibin dibi olmuyor ayı sezonunda. Acemi yatırımcılar en çok bundan kaybediyor bana kalırsa. Aaa çok düşmüş biraz alayım dedikçe zarar ediyor çoğu. Hoş ben de usta bi yatırımcı diilim. Ama gözlemlerim bu.Bir coini çok düşmüş diye almak çok yanlış. Düşüşün nedenlerini araştırmak gerekir. Kilitli tokenlerin kilitleri açılmaya devam ediyorsa %90 düşüş de yeterli olmaz. %99'a kadar devam edebilir düşüş. Tabii kilitli tokenlerin açılması düşüşün devam edeceğinin garantisi olmaz. Fakat %100 seyreltilmemiş coinler her zaman problem çıkarma ihtimaline sahip benim tecrübeme göre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}