{
  "id": "topic_5464879",
  "title": "FresheIvis",
  "author": "FresheIvis",
  "created_time": "August 28, 2023, 07:03:29 PM",
  "content": "My services offered for all crypto consideredd ideally BTC. I am a new user looking to offer any service I can for crypto. We can discuss a payment option and proof of service suitable for both of us before we are committed.I am aware of scammers and and want to protect both parties. If you generally want a service I generally want bitcoin. I can offer crypto buying/selling with out KYC. Purchase items from Amazon eBay :ect. Any Digital services advice. Medical hemp buds  vapes and oils. Any service I can perform. Contact me. This is a mutual service not a scamming activity.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464879",
  "comments": [
    {
      "author": "logfiles",
      "created_time": "August 28, 2023, 11:34:24 PM",
      "body": "Quote from: FresheIvis on August 28, 2023, 07:03:29 PMI can offer crypto buying/selling with out KYC. A number of trustworthy p2p exchanges that do not require KYC verification to use their platforms, such as localcoinswap.com, HodlHodl.com, Agoradesk can offer buying and selling of crypto. Why would members abandon such service and use you instead?What more do you offer than those already reputable exchanges?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "August 28, 2023, 11:39:54 PM",
      "body": "Quote from: FresheIvis on August 28, 2023, 07:03:29 PMMy services offered for all crypto consideredd ideally BTC. I am a new user looking to offer any service I can for crypto. We can discuss a payment option and proof of service suitable for both of us before we are committed.I am aware of scammers and and want to protect both parties. If you generally want a service I generally want bitcoin. I can offer crypto buying/selling with out KYC. Purchase items from Amazon eBay :ect. Any Digital services advice. Medical hemp buds  vapes and oils. Any service I can perform. Contact me. This is a mutual service not a scamming activity.No you don't get it. This is not SilKroad lol... You need to establish trust first. Give something away or prove what you can do... otherwise you will be ignored with zero reputation here.  Edit - do you even accept escrow?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FresheIvis",
      "created_time": "September 03, 2023, 08:06:54 PMLast edit: September 03, 2023, 08:19:34 PM by FresheIvis",
      "body": "I appreciate your responses. I'm unable to fine any training sited offering goods and services like EBAY Amazon  Not crypto exchanges recommendations.Escrow accepted Trust is always built and that is what I was hoping to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 09, 2023, 04:38:53 PM",
      "body": "Quote from: FresheIvis on September 03, 2023, 08:06:54 PMI appreciate your responses. I'm unable to fine any training sited offering goods and services like EBAY Amazon  Not crypto exchanges recommendations.Escrow accepted Trust is always built and that is what I was hoping to do. What service are you trying to provide? Buying products from Amazon requires trust because I will give you my shipping address. Therefore, if you buy a product from a hacked or illegal account, this may cause problems for me while you get Bitcoin.be clear about the service you provide and prove that you are performing it from an account that was created legally.You also have an old thread[1] in which you tried to scam, so work on gaining trust first[1] https://bitcointalk.org/index.php?topic=5464880.new#new",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}