{
  "id": "topic_5410643",
  "title": "citb0in",
  "author": "citb0in",
  "created_time": "August 20, 2022, 09:29:22 PMLast edit: August 20, 2022, 09:54:44 PM by citb0in",
  "content": "Hallo Forum,als Anfänger lese ich mich in letzter Zeit in diverse technische Themen des Bitcoins ein und dabei habe ich auch folgende Fragen bezüglich Mining. Sicherlich werdet ihr mir als Profis diese simplen Fragne beantworten können. Und zwar:- da die Difficulty sowie die Stromkosten sehr hoch sind, heißt es meist überall wo man übers Mining liest --> es lohnt sich für Privatleute bzw. einzelne solo-Miner auf keinen Fall. Grund: die Kosten übersteigen das Nutzen bzw. die Wahrscheinlichkeiten, dass man durchs Finden eines Blocks profitieren würde. Vielmehr steigt die Wahrscheinlichkeit rapide, dass man ein Verlustgeschäft dadurch erleiden würde. Meine Frage: was sind das also für Leute, die trotzdem minen und das auch durchziehen? Ich weiß, dass es mining-Pools gibt, dass es Cloud-Mining gibt, usw... aber das müssten dann vermutlich richtig dicke steinreiche Leute/Firmen sein, die sich das leisten können, oder?- insofern ich es richtig verstanden habe, dann bekommt derjenige Miner den vollen Block award (aktuell entspricht das 6.25 BTC) und auch die im gefundenen Block enthaltenen Transaktionsgebühren, oder? Es wird also nie geteilt, sondern der Miner bekommt die volle Auszahlung, oder? Natürlich verstehe ich, wenn \"DER Miner\" ein Pool war, dann wird das dort 'privat unter der Hand' verteilt. Aber aus Sicht der Blockchain und der Technik werden die 6.25 BTC plus fees an eine einzige BTC Adresse gesendet und zwar die des Miners, korrekt ?- angenommen der Miner ABC (kann auch ein Miningpool dahinterstecken, ich bezeichne ihn aus Sicht des Netzwerkes trotzdem als \"einen Miner\") hat eine Hash-Power von 34 EH/s. Alle anderen Miner weltweit haben weniger Rechenpower. Ich hätte jetzt angenommen, dass dieser Miner ABC sämtliche Blocks \"knacken\" würde, da er doch die größte Rechenpower besitzt und somit höchstwahrscheinlich am Schnellsten die Lösung (PoF) findet. Offensichtlich ist das nicht so, denn die Blöcke werden auch von anderen Minern gefunden. Wie also ist das möglich, dass auch schwächer positionierte Miner Erfolg haben?- Der User @aundroid hat HIER eine tolle FAQ-Übersicht geschrieben (DANKE hierfür!), ganz am Ende gibt es folgende Beispielrechnung:Quote from: aundroid on January 17, 2020, 11:42:54 PMIch möchte Solo Minen, wie stehen meine Chancen einen gültigen Block- Hash zu finden?Die Difficulty wird folgendermaßen berechnet:Quotenew_difficulty = old_difficulty X (2016 blocks X 10 minutes) / (the time took in minutes to mine the last 2016 blocks)Alle 2016 Blöcke wird ja bekanntlich die Difficulty angepasst: war die durchschnittliche Block- Zeit zu kurz wird sie erhöht, war sie zu lang wird sie reduziert.Die Difficulty wird angepasst indem der target_value (256 bit Nummer) im Block Header entsprechend angepasst wird:Quotenew_target = old_target / new_difficultyJe kleiner der target value (mehr führende Nullen) desto schwieriger einen gültigen Block- Hash zu finden.Die Aufgabe der Miner ist es ja einen Block- Hash zu finden der kleiner oder gleich dem Ziel Wert ist.Wenn man sich nun z.B. 10 PH/s mietet und die aktuelle Difficulty bei z.B. 91 EH/s liegt1 Exa- Hash sind 10^18 H/s1 Peta- Hash sind 10^15 H/sist man im Besitz von ...(91 * 10^18) / (10 * 10^15) = 9100... 1/9100 des gesamten Netzwerksbei 10 Blocks / Minute =  6 Blocks / Stunde =  144 Blocks / Tag = 1008 Blocks/Wochemuss man im Schnitt 63,19 Tage warten, bis man einen gültigen Block- Hash findet.Sinkt die Hashrate weiter ist der Anteil an der Gesamt- Hashrate des Netzwerks größer und man findet im Schnitt früher einen gültigen Block- Hash.Die Difficulty regelt nur, dass im Schnitt alle 10 Minuten ein Block gefunden wirdWie könnte man die Beispielrechnung an aktueller Lage durchführen? HIER habe via Suchmaschine ich eine Seite aufgerufen, die mir einige Details zum Bitcoin ausspuckt:QuoteAlgorithm = SHA-256BTC network hashrate = 230.65 EH/sBTC difficulty = 28.3516TBTC block reward =   6.2500Bedeutet das, dass sämtliche Miner alle zusammengezählt eine Rechenkapazität von 230.65 Exahashes pro Sekunde bewältigen können? Was bedeutet die Einheit mit dem Großbuchstaben 'T' hinter dem Wert difficulty, so was wie Terra oder Trillion oder was zum Geier macht man mit diesem Wert difficulty   ? EDIT: Frage selbst beantwortet durch diese Seite hier. Demnach beträgt die difficulty als Dezimalzahl ausgedrückt aktuell 28351606743493.77  dazu hätte ich jetzt auf deutsch gesagt, das sind 28,351 Billionen. Aber auf englisch heißt die Billion missverständlicherweise leider Trillion. Deshalb denke ich steht auch das 'T', also im englischen Sprachraum 28.351 trillions sind auf deutsch ausgedrückt 28.351 Billionen. Wenn ich falsch liegen sollte, bitte korrigieren.Und wie würde man nun die Wahrscheinlichkeit anhand aktueller difficulty berechnen, wenn man beispielsweise die auf nicehash angemietete Rechenleistung von 25 PH/s anmieten würde, so wie sie auch Willy mit den Blockpartys für gewöhnlich bucht?EDIT: ok, auch hier habe ich mich weiter selbst bemüht und konnte DAS finden  Also gebe ich z.B. in diesen online calculator der bereits automatisch die aktuelle difficulty vorausgefüllt hat, lediglich die Rechenpower ein. Die 25 PH/s würden 25000 TH/s entsprechen wenn ich richtig liege. Dann spuckt er mir als Ergebnis aus wieviel man damit täglich,wöchentlich,usw... verdienen würde. Ich verstehe das aber nicht, weil bereits meine zuvor gestellten Fragen damit zusammenhängen. Ich denke man verdient nur wenn man einen Block findet. Wie kann es also sein, dass hier ein \"daily profit\" ausgegeben wird? Auch in diesem Rechner dasselbe. Ich gebe 25 PH/s ein und es erscheint ein Gewinn. Hier wird also doch was verdient, obwohl man keinen Block findet? Offensichtlich verdient ein Miner auch \"irgendwie anders\", aber wie und wie heißt dieses ?Und was ich auch nicht verstehe, um am Beispiel von Willys' Blockparty hier im Forum zu bleiben. Die angemietete Hashpower soll z.B. 25 PH/s betragen, aber wie lange läuft das dann eigentlich, also während welcher Laufzeit wird diese Power auf nicehash gemietet von Willy? Ich frage mich deshalb, weil ich gerne verstehen würde wie realistisch oder unwahrscheinlich es ist, (k)einen Block zu finden und somit komplett leer auszugehen. Es gibt z.B. auch diesen Rechner hier, der einem anzeigt wie lange man durchschnittlich warten müsste um einen Block zu finden. Ich habe dort als difficulty den Wert \"28351606743494\" und als Rechenpower den Wert \"25000000000 MH/s\" eingetragen. Das Ergebnis lautet --> 1353 Stunden oder umgerechnet knapp 56 Tage und 09 Stunden. Was sagt uns das nun? Und angenommen ein Block wird nicht gefunden, würde das nicht aus der vorherigen Frage implizieren dass man trotzdem paar Krümel verdient hat? Fragen über Fragen, ja ich weiß... habt jedoch Erbarmen mit mir, ich bemühe mich möglichst viele Antworten selbständig zu finden aber manchmal will ich auch die Antworten von den Pro's hören. Wer bekanntlich nicht frägt, bleibt dumm. Also lasst mich nicht dumm sterben   Danke an Alle.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410643",
  "comments": [
    {
      "author": "lassdas",
      "created_time": "August 21, 2022, 02:06:21 AM",
      "body": "Quote from: citb0in on August 20, 2022, 09:29:22 PMHallo Forum,Selber halloQuote..das müssten dann vermutlich richtig dicke steinreiche Leute/Firmen sein, die sich das leisten können, oder?Nich unbedingt,das sind eher Leute, die nich so hohe Strompreise zahlen.Hier (!) heißt es meist \"das lohnt nich\", weil wir hier so ziemlich den teuersten Strom der Welt haben,andere Länder, andere Strompreise, da kann sich das schon lohnen, oder wenn man hier halt irgendwelche Sonderkonditionen bekommt, oder seinen Strom gar selbst produziert,...Quote..aus Sicht der Blockchain und der Technik werden die 6.25 BTC plus fees an eine einzige BTC Adresse gesendet und zwar die des Miners, korrekt ?Korrektund es is auch völlig korrekt, den Pool als \"Miner\" zu bezeichnen, denn genau das is er, nur er erzeugt Blöcke.Leute die dem Pool nur ihre gefundenen Hashes schicken sind keine Miner, auch wenn sie das nicht gerne hören.Im Erfolgsfall kuckt der Pool(-Betreiber) nach, wieviele Hashes jeder einzelne \"Worker\" ihm geschickt hat und teilt dann Anteilsmäßig die 6.25BTC(+fees) unter allen Beteiligten auf.QuoteIch hätte jetzt angenommen, dass dieser Miner ABC sämtliche Blocks \"knacken\" würde, da er doch die größte Rechenpower besitzt und somit höchstwahrscheinlich am Schnellsten die Lösung (PoF) findet. Offensichtlich ist das nicht so, denn die Blöcke werden auch von anderen Minern gefunden. Wie also ist das möglich, dass auch schwächer positionierte Miner Erfolg haben?Er würde nicht sämtliche Blöcke knacken, nur im Durchschnitt mehr als andere,die Wahrscheinlichkeit, daß er den nächsten Block findet, ist höher, als die der anderen, aber die anderen haben trotzdem ne Chance.Es ist auch möglich, daß ein Miner mit sehr wenig Rechenleistung (bspw einem USB-Stick) sehr viel Glück hat und den \"Winning Hash\" für den nächsten Block findet,es ist aber nich sehr wahrscheinlich.Quotehttps://alloscomp.com/bitcoin/calculator.. es erscheint ein Gewinn. Nein, auf alloscomp.com erscheint keine Gewinn, sondern potentielle Einnahmen, die Ausgaben sind da nicht drin.Das is aber auch echt einer der ersten Kalkulatoren überhaupt, da gibts mittlerweile nen Haufen anderer \"Bitcoin Mining Calculator\"en, in die man auch gleich den Strompreis eintragen kann.QuoteHier wird also doch was verdient, obwohl man keinen Block findet? Offensichtlich verdient ein Miner auch \"irgendwie anders\", aber wie und wie heißt dieses ?Nein, wenn man keinen Block baut und an die Blockchain hängt, verdient man auch nix.Was da bei der Rechnung in der Tabelle erscheint, sind lediglich Durchschnittswerte.Wenn Du soundsoviel Rechenleistung hast, brauchst Du durchschnittlich soundsolange um einen Block zu finden und soundsoviel Reward zu erhalten, das wird dann runtergerechnet auf Einnahmen von soundsoviel $ pro Tag.Theorie, keine Praxis.Als sogenannter \"Worker\" eines Pools macht das durchaus Sinn, da dieser ja öfter Blöcke findet (täglich?), als Du es alleine könntest und Dich dementsprechend öfter (täglich?) auszahlt.Anhand der Tabelle kannst Du dann sehen, was für (tägliche?) Auszahlungen Du erwarten kannst. Aber als Solo-Miner bekommst Du nur dann was, wenn Du auch nen Block findest.Wenn Dir ein Calculator sagt, Du braucht durchschnittlich 400 Jahre, bekommst Du vermutlich nix, aber vielleicht hast Du auch einfach verdammt viel Glück und findest doch zu Deinen Lebzeiten noch was.   Quote...25PH/s...Blockparty....Das Ergebnis lautet --> 1353 Stunden oder umgerechnet knapp 56 Tage und 09 Stunden. Was sagt uns das nun? Das sagt uns, daß es durschnittlich knapp 56 Tage dauert, die \"Lotterie\" zu gewinnen/den Block zu finden,es kann auch nach 2 Stunden schon geschehen, oder erst nach 200 Tagen.Is halt wie Würfeln (mit echt vielen Würfeln),Du kannst schon beim ersten oder zweiten Versuch X 6en würfeln, kann auch sein, dasses Dir den ganzen Abend nicht gelingt.Glück hilft, viel Glück hilft viel.  Und die Länge der Laufzeit hängt davon ab, wieviel die 25PH kosten, n paar Tage vllt?Ich kenn mich da nich so aus, das kann der Willi, oder einer der Teilnehmer sicher besser beantworten,oder Du kuckst mal in die alten Runs wie lang das da so gelaufen is.QuoteUnd angenommen ein Block wird nicht gefunden, würde das nicht aus der vorherigen Frage implizieren dass man trotzdem paar Krümel verdient hat?Nein,bei den Blockpartys wird \"solo\" gemined, kein Block==kein Reward,da braucht Ihr schon Glück, damit das nich doch >56 Tage dauert bis zum Block, aber ich drück Euch die Daumen, Ihr schafft das. Wäre sonst auch langweilig, oder?  So, hoffe, ich hab keine Frage übersehen (die Du Dir nicht schon selber beantwortet hast).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "citb0in",
      "created_time": "August 21, 2022, 08:26:57 AM",
      "body": "Vielen Dank @lassdas für die Zeit und die Mühe. Hast mir wirklich weitergeholfen und das hat zum Verständnis beigetragen. Thanks!Vielleicht kann sich ja auch Willy oder sonstjemand noch zu der Blockparty äußern wie genau das funktioniert und was all die dort im Zusammenhang erwähnten Werte bedeuten usw...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwk",
      "created_time": "August 21, 2022, 08:50:57 AM",
      "body": "Ich ergänze das mal, weil ich den Eindruck habe, dass es vielleicht nicht ganz klar ist, warum es eben nur um Wahrscheinlichkeit geht.Wenn die Aufgabe des Miners wäre, eine sehr schwierige Rechnung zu lösen, was einfach sehr viel Zeit und Rechenleistung braucht, dann wäre es in der Tat so, dass ein Miner, der mehr Rechenpower als alle anderen hat, wohl jeden einzelnen Block gewinnen dürfte.Das aber ist nicht der Fall.Vielmehr ist die eigentliche Aufgabe, die der Miner zu lösen hat, besonders simpel: er muss sich eine Zufallszahl \"ausdenken\".Das ist so simpel, dass sogar ich das locker im Kopf machen kann.Allerdings weiß der Miner zunächst nicht, ob die Zufallszahl, die er sich ausgedacht hat, die \"Richtige\"* ist.Das kann er aber selbst überprüfen, indem er eine zweite Rechenaufgabe löst, die ebenfalls sehr einfach ist (die ich aber nicht mehr im Kopf, sondern bestenfalls auf einem Blatt Papier lösen kann).Damit geht es im Kern bei der Steigerung der Hashrate also nicht darum, besonders schnell eine einzelne Aufgabe zu lösen, sondern mit der zur Verfügung stehenden Rechenleistung so oft wie möglich zu versuchen, eine sehr einfache Aufgabe zu berechnen.Womit man jede einzelne Kombination aus Zufallszahl und Berechnung als eine Art \"Lotterielos\" betrachten kann.Mehr Rechenleistung bedeutet damit also nur mehr \"mehr Lose\".Womit dann letzten Endes auch klar ist, dass ein großer Glückspilz durchaus prinzipiell auch mit einem einzigen Los gewinnen kann, ganz egal, wieviele Trillionen Lose sich ein anderer kauft.* genauer: eine von zahlreichen möglichen richtigen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "citb0in",
      "created_time": "August 21, 2022, 12:42:51 PM",
      "body": "Hey super für diese sehr einfache Erklärung. Jetzt verstehe ich was du mit deinem Ausgangssatz meinst \"...warum es eben nur um Wahrscheinlichkeit geht\".Vielen Dank!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "-doubleU-",
      "created_time": "August 27, 2022, 11:14:12 PM",
      "body": "Quote from: qwk on August 21, 2022, 08:50:57 AMWomit dann letzten Endes auch klar ist, dass ein großer Glückspilz durchaus prinzipiell auch mit einem einzigen Los gewinnen kann, ganz egal, wieviele Trillionen Lose sich ein anderer kauft.Genau das haben dieses Jahr ja bereits einige Solo Runner mit im Verhältnis zu den großen Miningfarmen kleinster Leistung bewiesen. Block 718124 wurde mit nur 126TH,Block 718379 mit 116TH undBlock 720175 mit nur 8.3TH gelöst.https://twitter.com/ckpooldev/status/1480843321043865602https://twitter.com/ckpooldev/status/1481430284445024256War bei allen reines Glück und wenn man nur den kurzen Abstand zwischen den Erfolgen sieht, müsste statistisch betrachtet Willis Long-Time-Run längst erfolgreich sein.Im Gegensatz zu anderen Glücksspielen ist hier jedoch keine Manipulation der Karten, Würfel etc. möglich, so das es wahrscheinlicher ist leer auszugehen wenn man bedingt durch die geringe Rechenleistung nur wenige \"Lose\" hat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "citb0in",
      "created_time": "August 28, 2022, 09:48:16 AMLast edit: August 28, 2022, 10:17:34 AM by citb0in",
      "body": "Hallo W  vielen Dank für die Info und den Links. Wo kann man eigentlich die genutzte Hashrate des erfolgreichen Miners auslesen? Ich sehe diese Info nirgends in der Blockanzeige in mempool.space. Und kann man die auch von solo minern einsehen, die nicht Teil es pools sind wie es in diesen Beispieln der Fall war, sondern wenn sie privat von zu Hause aus geschürft hätten?Mittlerweile konnte ich auch dazu einiges lesen und danke euren Antworten und dem Lesen einiger weiterer Erklärungen hierzu, glaube ich es verstanden zu haben wie das funktioniert. Kurzum gesagt: die Nonce ist hier entscheidend um Relay Attacken zu verhinden und um so größer die Rechenkapazität eines Miners um so höher die Wahrscheinlichkeit eines Treffers. Das heißt aber nicht, dass die höhere Wahrscheinlichkeit zwangsweise zu höherem Erfolg führt. Es bleibt nun mal eine Wahrscheinlichkeit   Die Analogie von @qrk zum Lotterielos ist daher sehr treffend und beschreibt das Prinzip sehr gut.Quote from: qwk on August 21, 2022, 08:50:57 AMWomit man jede einzelne Kombination aus Zufallszahl und Berechnung als eine Art \"Lotterielos\" betrachten kann. Mehr Rechenleistung bedeutet damit also nur mehr \"mehr Lose\". Womit dann letzten Endes auch klar ist, dass ein großer Glückspilz durchaus prinzipiell auch mit einem einzigen Los gewinnen kann, ganz egal, wieviele Trillionen Lose sich ein anderer kauft.Vielen Dank nochmals an euch Alle !!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "willi9974",
      "created_time": "August 28, 2022, 10:34:06 PMLast edit: August 28, 2022, 10:52:20 PM by willi9974",
      "body": "Hallo,also ich / wir mieten die hashingpower auf Nicehash an und ballern die uns zur Verfügung stehende Leistung dann auf den Solo Pool von CK.Die Preise auf Nicehash schwanken, a) weil der BTC Preis schwankt b) weil manchmal User viel hashpower anmieten und wenn die verknappt wird, wird der Preis pro PHs / tag eben auch teurer.Aktuell liegt der Preis bei ca. 0.0045 bis 0.0052 BTC pro PHs pro Tag (derzeit stark schwankend)Wir haben bis jetzt ca. 65 Runs durchgeführt und dabei schon einiges an Blöcken gefunden (siehe Aufstellung der Blockfunde).Hier unsere 9 BlockfundeBlockparty 01 2015 (gained 25,207 BTC) https://bitcointalk.org/index.php?topic=1253410.0Blockparty 08 2016 (gained 74,99 BTC) https://bitcointalk.org/index.php?topic=1332729.0Blockparty 10 2016 (gained 25 BTC) https://bitcointalk.org/index.php?topic=1348143.0Blockparty 12 2016 (gained 24,8603 BTC) https://bitcointalk.org/index.php?topic=1364642.0Blockparty 13 2016 (gained 24,905 BTC) https://bitcointalk.org/index.php?topic=1375321.0Blockparty 08 2021 (gained 6,15 BTC) https://bitcointalk.org/index.php?topic=5363227.0Blockparty 14 2021 (gained 6,16 BTC) https://bitcointalk.org/index.php?topic=5373661.0In Summe sind wir im plus (wenn jeder immer dabei war)! War es dir einfach mal zu teuer, hat dich der Mut verlassen und dann wurde ein Block gefunden hast du die A-Karte gezogen.Warst du nur einmal dabei wie der User (Sledge0001) der später mit seinem USB Miner einen eigenen Block gelöst hat, bist du der KÖNIG!Der User hat damals aus dem Gewinn aus der Blockparty für mehrere tausend Doller USB Miner und Zubehör gekauft und ist zum zweifachen KÖNIG gekrönt worden, er hat mit seinen eigenen USB Miner einen eigenen Block gefunden. MEGA GLÜCK !!!Wir haben bis jetzt ca. 182 BTC verbrannt und ca. 187 BTC eingenommen.Und alle hoffen drauf das der nächste Block in den Blockpartys und Longtime Solo Mining Beitrag demnächst fällt.Das kann schon heute Nacht sein oder auch erst im nächsten Jahr --> man braucht die richtigen Würfel  --> GLÜCK PS: Hier gehts zu den aktuellen RunsBlockparty 26 (wird gerade organisiert)https://bitcointalk.org/index.php?topic=5410047.0Longtime Run (Run 1+2 läuft schon seit Januar 2022 mit ca. 200 THs und Run 3 hat gerade diese Woche gestartet und wenn noch mehr Interessierte da sind, starte ichnoch einen 4. Long Time Run)https://bitcointalk.org/index.php?topic=5381245.0Viele GrüßeWilli",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lassdas",
      "created_time": "August 29, 2022, 02:00:41 AM",
      "body": "Quote from: citb0in on August 28, 2022, 09:48:16 AMWo kann man eigentlich die genutzte Hashrate des erfolgreichen Miners auslesen? Ich sehe diese Info nirgends ..Man kann das nirgends auslesen.Ein Blockexplorer weiß nur, was in der Blockchain steht und von der individuellen Hashrate des Blockerstellers steht da nunmal nix drin.Im Prinzip erstellt der Miner ja \"Lose\" und kuckt auch sofort nach, ob's ein Gewinner-Los is, oder ne Niete.Die Nieten werden gleich weggeworfen. Davon, daß sie überhaupt erstellt wurden, bekommt das Netzwerk/die Blockchain garnichts mit.Die Hashrate muss also schon willentlich veröffentlicht werden, entweder von Nutzer/Miner selbst, oder vom Pool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}