{
  "id": "topic_5443798",
  "title": "BVeyron",
  "author": "BVeyron",
  "created_time": "March 06, 2023, 08:19:08 PMLast edit: March 12, 2023, 06:17:27 PM by BVeyron",
  "content": "Решил открыть такую тему с целью поделиться с вами, друзья, одним моим многолетним наблюдением о процессе \"старения\" когда то топовых  альткоинов.И соответственно потереи ваших денег.Когда то много лет назад топовыми альтами на  PoS были NXT  и NEM. И они четко входили в первую десятку рейтинга. CoinMarketCap. Тогда ещё не было Эфириуиа. Но время летит быстро и вот они уже опустились в этом рейтинге. Их место уверенно занимает Эфириум и, например, EОS и Tezos... Ещё несколько лет и вот уже  EOS и  Tezos на 50-х местах. А NXT и NEM вообще исчезли даже из первой сотни рейтингв. Сейчас в топе  Solana и Aptos с Cardanо и Polkadot... Ну и сколько они еще продержатся, как думаете? Да судя по всей этой истории года три и все, и дружно вниз.  Ну а что Эфириум? А с ним все плохо. После перехода в. PoS. появились явные вдадельцы контрольного пакета. Две биржи и Lido. Вероятно со вреиенем он будет нейтрализован как классическая криптовалюта с помощью фиатных банкиров, которые вращают на два порядка большими масштабами денег. И запросто все прихватят в этом акционерном обществе слегка нового типа. Итак, как ни крути а остается пока еще только один биткоин. Пока ещё гордый и не такой, как альты, превращающиеся в пепел.Вот как то так.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443798",
  "comments": [
    {
      "author": "echogomodrill",
      "created_time": "March 07, 2023, 09:56:24 AM",
      "body": "интересно, у кого основные запасы эфира?как ктото говорил, при генерации первых блоков тупо раскидали по сотне адресов оснонвую массу эфиров, может это адреса программистов? тут надо брать за шары андроид боя, чтобы все рассказал, можно еще ограничить на обмен эти основные адреса.если эфир начнет \"пахнуть\", его клонируют, но загнуться не дадут, это будет основная банковская криптовалюта",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "summonerrk",
      "created_time": "March 07, 2023, 12:50:21 PMLast edit: March 07, 2023, 10:08:57 PM by xandry",
      "body": "Наверное поэтому некоторые из них и были с PoSом билетов в локе. DCR например. Хотите лишний Декред - посидите около четырех недель, залочив токены. Получается изза этого и график цены альта усредненный, и паник сэйл не может состояться для товарищей, сидящих в локе. Может быть разрабы так не задумывали, но получается картина была такая.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "March 07, 2023, 02:28:13 PM",
      "body": "Спасибо  за ваши мнения. Они подтверждают мои выводы.Но открытым все равно остается вопрос о дальнейшей судьбе Эфириума.Я думаю, что он все таки не станет мировой банковской криптовалютой. Так будет немного использоваться, особенно смарт контракты и НФТ. И все. Риппл неплохо стоит. И тоже под банкирами ходит. Догекоин вытащил Маск  и он по моему не PoS   (если не ошибаюсь?). Но думаю будет скамится. А все остальные, нвпример такие как Трон, все равно будут постепенно валиться вниз. Интересно, каким альткоинам удастся задержаться в топе надолго или даже навсегда",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "March 07, 2023, 10:07:31 PM",
      "body": "Quote from: BVeyron on March 07, 2023, 02:28:13 PMСпасибо  за ваши мнения. Они подтверждают мои выводы.Но открытым все равно остается вопрос о дальнейшей судьбе Эфириума.Я думаю, что он все таки не станет мировой банковской криптовалютой. Так будет немного использоваться, особенно смарт контракты и НФТ. И все. Риппл неплохо стоит. И тоже под банкирами ходит. Догекоин вытащил Маск  и он по моему не PoS   (если не ошибаюсь?). Но думаю будет скамится. А все остальные, нвпример такие как Трон, все равно будут постепенно валиться вниз. Интересно, каким альткоинам удастся задержаться в топе надолго или даже навсегдаКакая может быть мировая банковская криптовалюта со стоимостью транзакций от 5$? Эфир ещё пилить и пилить в этом плане, но он никуда не денется уже.Dogecoin и без Маска вполне себе жил и имел востребованность в качестве транзитного пункта, чтоб дёшево перегнать крипту. Он POW и поддерживается силами сообщества, поэтому соскамиться в принципе не может.Трон вы сильно недооцениваете. По количеству протоколов и разнообразию сервисов он сильно уступает многим defi платформам, но остаётся вторым по TVL после эфира и закрепился партнёрством с Доминиканской Республикой, Сен-Мартен, а другие будут позже.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "March 08, 2023, 07:54:19 AM",
      "body": "Quote from: xandry on March 07, 2023, 10:07:31 PM^^^^^^^^^^.Спасобо за ценную информацию.Кое чего я не знал.Ну и конечно эфир останется скорее всего в топе рейтинга еще долгие годы.Но я и не говорю, что это будет банковская крипта.Я думаю он преврвтится в  банальное АО через некоторое время, когда  usa решат приравнять их токены eth к акциям. Вот и все. И кончится его славная стори.Да все к тому идет.В моих понятиях это и есть сначала угли, потом пепел Как думаете, а квкие альты могут задержаться в топе надолго?Вот про Трон не согласен.Доге возможно. Потому что PoW. И вообще все. PoS  будут выбиваться вниз новыми PoS хайп проектами. Типа Соланы, или вот теперь Аптос.Или ещё кого нового раскрутят под маркой супер пупер масштабируемости и низкой комиссии.И все по новой.... Конвеер рубить бабло",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "delfastTions",
      "created_time": "March 12, 2023, 11:48:05 AMLast edit: March 12, 2023, 07:24:18 PM by delfastTions",
      "body": "A вот в разделе \"Трейдеры\" ру локала  имеется замечательный топик Последний вагон на северЖивет успешно уж 6 лет, как  A не сделать ли нам  и из этого \"....огонь, угли пепел\" такой же разговорник, обсуждальник альтов, как в Трейдерах этот самый \"Последний вагон...\"Может и разовьется в чего то интересное?Но только уж чтоб не особая флудилка была.Название топика конечно не \"последний вагон.., но все равно вроде как подходит...   Как вам такое творчество? Надо найти 4 отличия Та, что слева: Бабенко И.А., \"В родную бригаду\" (1970)Та, что справа: Автор неизвестен, предположительно \"Доярки\" (или \"Сон солдата про дембиль за секунду до подъема\") (?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "March 12, 2023, 01:28:57 PM",
      "body": "Quote from: delfastTions on March 12, 2023, 11:48:05 AMA не сделать ли нам  и из этого \"....огонь, угли пепел\" такой же разговорник, обсуждальник альтов, как в Трейдерах этот самый \"Последний вагон...\"А чем вас не устраивает Аналитика, анализ, прогнозы. и Аналитика без подписей и модерации? Зачем городить то, что уже давно существует и предназначено как раз для того, что вы предлагаете?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "delfastTions",
      "created_time": "March 12, 2023, 01:52:08 PM",
      "body": "Quote from: Xal0lex on March 12, 2023, 01:28:57 PMQuote from: delfastTions on March 12, 2023, 11:48:05 AMA не сделать ли нам  и из этого \"....огонь, угли пепел\" такой же разговорник, обсуждальник альтов, как в Трейдерах этот самый \"Последний вагон...\"А чем вас не устраивает Аналитика, анализ, прогнозы. и Аналитика без подписей и модерации? Зачем городить то, что уже давно существует и предназначено как раз для того, что вы предлагаете?Ну, может быть, может быть....Да меня вообще-то все устраивает.Тут название топика мне понравилось. Оно по большому счету - суть всех альтов отлично отражает. Даже эфириума после его грубейшей глкбальной ошибки с  PoS. Не говоря уж про Солану и др...А дело ведь в сути....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "March 12, 2023, 06:30:58 PMLast edit: March 12, 2023, 06:49:24 PM by BVeyron",
      "body": "Спасибо за ваши отзывы.Но я открыл тему, а теперь еще ее переименовал, потому что все вы, наврное, сталкивались с тем, что передержали квкой то альт. Иногда даже до полного скама. Собственно я и подумал, что здесь в топике поделитесь с комьюнити своей историей о такой передержке и наивной вере в туземун какого то очередого скама, полускама. Истории такие могут быть всем полезны и интересны. Я вот несколько раз упусквл момент, когда надо было скинуть, а надежда на лучшие времена шептала на ухо, чтоб подождал. А ждать то было глупо и наивно. Вот как то так. Жду и от вас таких поучительных историй. Интересно же узнать, что не только я один так лохонулся, и что много нас таких сверхумных чудаков.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "March 13, 2023, 02:55:50 AM",
      "body": "Quote from: BVeyron on March 12, 2023, 06:30:58 PMСпасибо за ваши отзывы.Но я открыл тему, а теперь еще ее переименовал, потому что все вы, наврное, сталкивались с тем, что передержали квкой то альт. Иногда даже до полного скама. Собственно я и подумал, что здесь в топике поделитесь с комьюнити своей историей о такой передержке и наивной вере в туземун какого то очередого скама, полускама. Истории такие могут быть всем полезны и интересны. Я вот несколько раз упусквл момент, когда надо было скинуть, а надежда на лучшие времена шептала на ухо, чтоб подождал. А ждать то было глупо и наивно. Вот как то так. Жду и от вас таких поучительных историй. Интересно же узнать, что не только я один так лохонулся, и что много нас таких сверхумных чудаков. Я бы не сказал. что у всех альтов судьба такая, хотя топик на это намекает. Просто после сильного пампа идёт сильный и длительный дамп. Но у многих старых альтов есть множество вторичных отскоков, на которых можно заработать. А кто умеет в теханализ - для того старые альты (за вычетом очевидных трупов типа некста) - просто клад. Ведь теханализ требует истории графика. А молодые, перспективные альты без истории - это кот в мешке. Или лотерея.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "3meek",
      "created_time": "March 13, 2023, 05:52:15 AM",
      "body": "Мне кажется что полкадот и солана в топе чисто формально... Это первые альты на выход на свалку... Полку точно ждёт судьба еос... Хотя есть у меня наверное один единственный пример годного альта - это монеро... Монета живая, график хорош, и пофиг им на каком они там месте находятся... Надеюсь что лайт ещё жить будет...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "March 13, 2023, 06:22:11 AM",
      "body": "Quote from: 3meek on March 13, 2023, 05:52:15 AMМне кажется что полкадот и солана в топе чисто формально... Это первые альты на выход на свалку... Полку точно ждёт судьба еос... Хотя есть у меня наверное один единственный пример годного альта - это монеро... Монета живая, график хорош, и пофиг им на каком они там месте находятся... Надеюсь что лайт ещё жить будет... Да, точно, вы правы!Солана с Полкадотом и правда пойдут за EOS/ Tezos, Tе тоже когда то хайповали сильно.Да просто нет в них серьезной технологической фичи. Все это выдумки про время, как у соланы и голосования у полки. Фигия это рекламная, и она свое уже отыграла. Ну и они PoS,  а PoS  по определению всегда рушится владельцами и китами. Монеро сохранится из за уникальности. Это точно, если регуляторы не убьют.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Polkeins",
      "created_time": "March 13, 2023, 01:21:30 PM",
      "body": "Quote from: 3meek on March 13, 2023, 05:52:15 AMМне кажется что полкадот и солана в топе чисто формально... Это первые альты на выход на свалку... Полку точно ждёт судьба еос... Хотя есть у меня наверное один единственный пример годного альта - это монеро... Монета живая, график хорош, и пофиг им на каком они там месте находятся... Надеюсь что лайт ещё жить будет... Лайт не трогать, это другое..НА самом деле впервые после ухода Эфира на POS у лайта появился шанс \"выбится в люди\". По сути вторая сеть после битка, хэшрейт растет, адопшен почти такой же как у битка, комиссии дешевые, прозрачно, понятно. Я бы сказал у лайта по настоящему есть функция на крипто рынке теперь, это крипто-серебро. Кому биток дорого покупать, хранить или переводить не неудобно, страшно, то лайт как альтернатива. Храни, переводи все доступно. График идет за битком, немного с опозданием но все же. Так что пусть это и не заоблачные иксы, но зато просто и надежно. В общем ниша хорошая, перспективная.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "March 13, 2023, 04:18:32 PM",
      "body": "Quote from: BVeyron on March 13, 2023, 06:22:11 AMQuote from: 3meek on March 13, 2023, 05:52:15 AMМне кажется что полкадот и солана в топе чисто формально... Это первые альты на выход на свалку... Полку точно ждёт судьба еос... Хотя есть у меня наверное один единственный пример годного альта - это монеро... Монета живая, график хорош, и пофиг им на каком они там месте находятся... Надеюсь что лайт ещё жить будет... Да, точно, вы правы!Солана с Полкадотом и правда пойдут за EOS/ Tezos, Tе тоже когда то хайповали сильно.Да просто нет в них серьезной технологической фичи. Все это выдумки про время, как у соланы и голосования у полки. Фигия это рекламная, и она свое уже отыграла. Ну и они PoS,  а PoS  по определению всегда рушится владельцами и китами. Монеро сохранится из за уникальности. Это точно, если регуляторы не убьют. Это всё лишь предположения, основанные на допущениях. Баранья лопатка на кофейной гуще. Кто как будет иксовать, кагда, каким образом никому не ведомо. Всё может быть с точностью наоборот - к примеру иксовать будут только полка с соланой, а монеро канет в небытиё или просто уйдёт ниже 1000 места рейтинга. Много анонимных монет неплохих. Секрет, например. Пишут, что там и смарты якобы есть. Да и много чего.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "March 14, 2023, 04:40:00 AM",
      "body": "Quote from: Julien_Olynpic on March 13, 2023, 04:18:32 PMQuote from: BVeyron on March 13, 2023, 06:22:11 AMQuote from: 3meek on March 13, 2023, 05:52:15 AMМне кажется что полкадот и солана в топе чисто формально... Это первые альты на выход на свалку... Полку точно ждёт судьба еос... Хотя есть у меня наверное один единственный пример годного альта - это монеро... Монета живая, график хорош, и пофиг им на каком они там месте находятся... Надеюсь что лайт ещё жить будет... Да, точно, вы правы!Солана с Полкадотом и правда пойдут за EOS/ Tezos, Tе тоже когда то хайповали сильно.Да просто нет в них серьезной технологической фичи. Все это выдумки про время, как у соланы и голосования у полки. Фигия это рекламная, и она свое уже отыграла. Ну и они PoS,  а PoS  по определению всегда рушится владельцами и китами. Монеро сохранится из за уникальности. Это точно, если регуляторы не убьют. Это всё лишь предположения, основанные на допущениях. Баранья лопатка на кофейной гуще. Кто как будет иксовать, кагда, каким образом никому не ведомо. Всё может быть с точностью наоборот - к примеру иксовать будут только полка с соланой, а монеро канет в небытиё или просто уйдёт ниже 1000 места рейтинга. Много анонимных монет неплохих. Секрет, например. Пишут, что там и смарты якобы есть. Да и много чего.  Вот не думаю, что солана иксанет. Слишком неряшливо работает, на такое чудо инвестор серьезный не пойдет.Полкадот просто достанет всех своими заморочками с голосованием, и тоже бредовая идея. Зачем вообще это придумали? Ну это по моему так.Хотя всякое бывает.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "3meek",
      "created_time": "March 14, 2023, 05:24:15 AM",
      "body": "Quote from: Julien_Olynpic on March 13, 2023, 04:18:32 PMQuote from: BVeyron on March 13, 2023, 06:22:11 AMQuote from: 3meek on March 13, 2023, 05:52:15 AMМне кажется что полкадот и солана в топе чисто формально... Это первые альты на выход на свалку... Полку точно ждёт судьба еос... Хотя есть у меня наверное один единственный пример годного альта - это монеро... Монета живая, график хорош, и пофиг им на каком они там месте находятся... Надеюсь что лайт ещё жить будет... Да, точно, вы правы!Солана с Полкадотом и правда пойдут за EOS/ Tezos, Tе тоже когда то хайповали сильно.Да просто нет в них серьезной технологической фичи. Все это выдумки про время, как у соланы и голосования у полки. Фигия это рекламная, и она свое уже отыграла. Ну и они PoS,  а PoS  по определению всегда рушится владельцами и китами. Монеро сохранится из за уникальности. Это точно, если регуляторы не убьют. Это всё лишь предположения, основанные на допущениях. Баранья лопатка на кофейной гуще. Кто как будет иксовать, кагда, каким образом никому не ведомо. Всё может быть с точностью наоборот - к примеру иксовать будут только полка с соланой, а монеро канет в небытиё или просто уйдёт ниже 1000 места рейтинга. Много анонимных монет неплохих. Секрет, например. Пишут, что там и смарты якобы есть. Да и много чего.Если бы Монеро канул, то это бы уже давно случилось, ещё тогда, когда её почти отовсюду делистнули... Но теперь у монеро свой график и свой путь самурая... Кстати помню раньше они с дэш, зек и лайтом примерно на одних уровнях торговались.... Теперь Монеро стабильно 150 бакинских, а остальное хоть и тоже растёт, но с общей массой... А вот монеро имхо не так сильно к рынку привязано, как тот же лайт...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "March 14, 2023, 04:59:10 PM",
      "body": "Quote from: 3meek on March 14, 2023, 05:24:15 AMQuote from: Julien_Olynpic on March 13, 2023, 04:18:32 PMQuote from: BVeyron on March 13, 2023, 06:22:11 AMQuote from: 3meek on March 13, 2023, 05:52:15 AMМне кажется что полкадот и солана в топе чисто формально... Это первые альты на выход на свалку... Полку точно ждёт судьба еос... Хотя есть у меня наверное один единственный пример годного альта - это монеро... Монета живая, график хорош, и пофиг им на каком они там месте находятся... Надеюсь что лайт ещё жить будет... Да, точно, вы правы!Солана с Полкадотом и правда пойдут за EOS/ Tezos, Tе тоже когда то хайповали сильно.Да просто нет в них серьезной технологической фичи. Все это выдумки про время, как у соланы и голосования у полки. Фигия это рекламная, и она свое уже отыграла. Ну и они PoS,  а PoS  по определению всегда рушится владельцами и китами. Монеро сохранится из за уникальности. Это точно, если регуляторы не убьют. Это всё лишь предположения, основанные на допущениях. Баранья лопатка на кофейной гуще. Кто как будет иксовать, кагда, каким образом никому не ведомо. Всё может быть с точностью наоборот - к примеру иксовать будут только полка с соланой, а монеро канет в небытиё или просто уйдёт ниже 1000 места рейтинга. Много анонимных монет неплохих. Секрет, например. Пишут, что там и смарты якобы есть. Да и много чего.Если бы Монеро канул, то это бы уже давно случилось, ещё тогда, когда её почти отовсюду делистнули... Но теперь у монеро свой график и свой путь самурая... Кстати помню раньше они с дэш, зек и лайтом примерно на одних уровнях торговались.... Теперь Монеро стабильно 150 бакинских, а остальное хоть и тоже растёт, но с общей массой... А вот монеро имхо не так сильно к рынку привязано, как тот же лайт... Да, согласен, Монеро - отличная анонимная монета! Там правда какие-то терки с СЕО были, вроде как американцы его арестовывали... Но доказать походу смогли только \"вождение в нетрезвом виде\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "3meek",
      "created_time": "March 15, 2023, 12:17:15 AM",
      "body": "Судя по всему уголь и пепел пока что переносятся на неопределенный срок... Многие альты как и биток нарисовали отличные свечи... УСДТ снова включил печатный станок... Надеюсь что сейчас буудет долгожданный локальный отскок... Поздравляю всех кто на прошлой еделе альты докупал...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "March 15, 2023, 05:05:28 PM",
      "body": "Quote from: 3meek on March 15, 2023, 12:17:15 AMСудя по всему уголь и пепел пока что переносятся на неопределенный срок... Многие альты как и биток нарисовали отличные свечи... УСДТ снова включил печатный станок... Надеюсь что сейчас буудет долгожданный локальный отскок... Поздравляю всех кто на прошлой еделе альты докупал... Возможно и рано еще про пепел.Но смысл этой ветки, как я прикинул в том, чтобы как то последить за процессом \"старения альтов\".Не буду скрывыть, что отправной точкой было то, что я вспомнил о NXT. Я когда то был хорошо с ним знаком. Отлично помню его старт в ноябре 2013.Ну конечно больно и обидно смотреть в какое  заброшенное убожество превратился этот предшественник Эфириума.Я даже не буду смотреть его ветку здесь на форуме, не хочу расстраиваться. Да она вообще заброшена. И я знаю, что по капитализации NXT вообще где то на 800  месте в. Соinmarketcаp. A ведь был когда то  второй- третий сразу после битка. Аналогично, чуть получше у NEM. Ну или например родные наши  волны. Тоже прокукарекали и растворились в минимальном фанатском комьюнити. Конечно технология  ПОС да и ПОВ  развиваются, и новые монеты убивают старые.  Но не всех пока ещё убили. Вот об этом тоже речь  и это тоже хотел пообсуждать в этой ветке. Типа когда кто станет пеплом, как думаете.?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}