{
  "id": "topic_5525781",
  "title": "believer93248",
  "author": "believer93248",
  "created_time": "January 08, 2025, 06:47:57 PMLast edit: January 08, 2025, 06:59:19 PM by believer93248",
  "content": "Hello, I have been wanted to buy Bitcoin for some time now and I have been looking into Bitcoin.I want to invest some of the money I’ve got from a real estate liquidation, about 50-100k $. I am not looking for a big profit, but want to secure the value. I definitely plan to hold the Bitcoin for a few years, at least 1-2. A sudden drop in the price of Bitcoin would not scare me.I originally wanted to buy Bitcoin at a price when Bitcoin was at $60k, but I got my money later than I thought.When I'm paying attention to the news I hear a lot. Many voices claim Bitcoin will moon and skyrocket to new all time highs in 2025, they talk about 200k or 300k $ per Bitcoin. Others are talking about a crash to 60k $ or even lower, from which Bitcoin will start to recover. The scheme from 2020 to 2022.Of course I want to get a good entry price and that's why I'm asking you, people who have seen and experienced a lot when it comes to Bitcoin.I will store the Bitcoin on a cold wallet, I have already thought about it.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5525781",
  "comments": [
    {
      "author": "xLays",
      "created_time": "January 08, 2025, 07:13:37 PM",
      "body": "While seeking advice here can be helpful, we all know that the final decision rests with you. That said, based on your post where you mentioned you're not aiming for significant profit, my suggestion or advice lol would be to buy bitcoin now and hold it until its value increases. Once you're satisfied with your gains, you can sell. Just make sure not to sell at a loss. Anyway wHELLcome to Bitcointalk!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "January 08, 2025, 07:43:10 PM",
      "body": "My advice is to wait the crash before buy the coins, right now bitcoin is in the ATH and the crash will come in some poin, but since your goal is to hold them for some years better wait for the prive to go down and then buy, that's the right move for the long term.And a good option is to invest in different coins and not only in bitcoin, you should think about It.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 08, 2025, 07:49:12 PM",
      "body": "Quote from: believer93248 on January 08, 2025, 06:47:57 PMI want to invest some of the money I’ve got from a real estate liquidation, about 50-100k $. I am not looking for a big profit, but want to secure the value. I definitely plan to hold the Bitcoin for a few years, at least 1-2. A sudden drop in the price of Bitcoin would not scare me.You can use DCA for your accumulation and this can be done gradually instead of investing at once, the market is still high for now and the only advisable strategy is what had been mentioned already.Learn about DCA https://dcabtc.com/Quote from: believer93248 on January 08, 2025, 06:47:57 PMI originally wanted to buy Bitcoin at a price when Bitcoin was at $60k, but I got my money later than I thought.It is never too late, you can always find an entry point suitable for you over time, one thing you may like about bitcoin is the way it renders with several opportunities for those interested to invest in it.Quote from: believer93248 on January 08, 2025, 06:47:57 PMI will store the Bitcoin on a cold wallet, I have already thought about it.Make sure you have a good handling use of the hardware device you may be going for, here are few examples i may suggest to you as discussed from the forum.Open Source Hardware Walletshttps://bitcointalk.org/index.php?topic=5288971.0[/list]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "January 08, 2025, 07:54:37 PM",
      "body": "1-2 years? Maybe I will try to wait more time... at least wait for another halving.Regarding purchase options. You can buy all now. You don't care of speculation and avoid \"to wait\".Otherwise you can try to buy few portions each month or once you see some dump. You can also have a purchase based on event (like each time you see something...)I think that, regarding your options, the best value for your money is not giving of \"when you buy\" but more \"when you sell\". If this timeline is far away or just far enough, you will always have a decent premium on your coins. Very important = always base your decision on your plans. Trying to get the jackpot doesn't work here since it could be much probably you will have to sell coins  with a low or no profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alphakilo",
      "created_time": "January 08, 2025, 08:14:10 PM",
      "body": "OP, the together with the pieces of advice you will receive here on investing in bitcoin, I will also advice you to do your own research. Wait for a good entry point like you are anticipating however, this entry point is the one that will be set by you and you alone. When bitcoin price dips, and some people buy hoping that it doesn't dip again but it goes further, they'll say the dip is dipping. Know the price point you want because it could dip further or stop, we don't know.Ans if you decide to take the other advice I saw to invest in another coin while you wait for a good entry point for bitcoin, you have to also study that altcoin so that you don't lose your funds. Invest only what you can afford to lose is one of the most crucial rule to abide by.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 08, 2025, 08:15:47 PM",
      "body": "Quote from: believer93248 on January 08, 2025, 06:47:57 PMOf course I want to get a good entry price and that's why I'm asking you, people who have seen and experienced a lot when it comes to Bitcoin.You can always wait for the bear market after this bullish trend.   Since Bitcoin is currently at a hyper bull run, you might end up entering at a higher price unlike if you wait for the bear market and invest in that time.Bitcoin history records that during the bear market Bitcoin price plummeted.  It ranges from more than 20% up to 70% of its peak.  So if you think that the current price is way too much, you can always wait for the bear market dip, but be aware that there is always a possibility that Bitcoin might have a different performance in the future bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ever-young",
      "created_time": "January 08, 2025, 08:17:03 PM",
      "body": "Quote from: believer93248 on January 08, 2025, 06:47:57 PMWhen I'm paying attention to the news I hear a lot. Many voices claim Bitcoin will moon and skyrocket to new all time highs in 2025, they talk about 200k or 300k $ per Bitcoin. Others are talking about a crash to 60k $ or even lower, from which Bitcoin will start to recover. The scheme from 2020 to 2022.You seem to be very prepared with recent happenings and price history, which is good. Run a little research about what you want to invest in and feed yourself with the latest news. For now, all the above news is just speculation. We can't predict exactly how it will do; giving you advice on when to invest might end up being the wrong timing. My advice is that since the market is already struggling at a resistance level, we don't know to what length it will get down to, so if you have the money ready, you can just enter the market now and buy with the little you can; wait for a bit longer; if the price goes down a little bit, you can buy with the rest of the balance you want to invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "January 08, 2025, 09:05:40 PM",
      "body": "There will always be people who predict crazy prices both  ways. My advice to you is to get some bitcoin now and then think about whether this is what you really want.Let's say you have $100k. Get $5-10k at current prices and see how you feel about holding it. Make sure you know how to secure it, sleep on it. If everything is good and you still want to get more, buy another $10k next week, or in a month. As far as predictions go, the history has proven two things. 1. If bitcoin gained value, reached an ATH, and remains far above the 200 week average price, it will at some point go back to it. At the moment the average is at $42k and going up every week. Next month it will probably be $43k, and so on, but at some point we will revisit it. If it's in the next 12 months, maybe it will be $50k, but if the bull market lasts for another year or two, it could end up being $60k. This means that if you wait long enough, you will have the opportunity to buy bitcoin below $90k. The question is, can you wait that long and miss the bull market that could take us to $150k this year.2. Bitcoin always goes up in the long run. If you buy now at 90k, you will see a higher price. The only question is whether it will be this cycle, or the next, 3 years from now. I'm 99% sure that the top for this cycle is yet to come in the next few months. Probably q2 or q3 of this year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "January 08, 2025, 09:40:59 PM",
      "body": "There are several options that might be done such as buying in installments or DCA especially since the condition of bitcoin is now experiencing a slight correction and you can still do it in the purchase especially if it only includes profits that are not too significant then buying now and waiting for the price increase can be used as the first option.Or if you really don't want to be in bitcoin right now you might have to wait a few years before bitcoin starts bearish again but with a note that you will miss a lot of things before that because after all waiting for bitcoin to fall lower takes time and now it's actually not too suitable to wait for bitcoin to fall lower because the moment for now bitcoin still remains in bullish mode.So if in the end the goal is only for profits that are not too large then it will indeed be quite worth it to buy bitcoin when market conditions are in correction like now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "January 08, 2025, 10:03:45 PM",
      "body": "Since you're asking for Bitcoin investment advice here, the answers you get will be almost the same. It's not too late to buy Bitcoin and if you wait long enough, you're sure to make a profit.However, it's important to realize that we are now almost at ATH prices. If you only wait 1-2 years, you are likely to suffer losses in a possible bear market reversal. If you wait at least until another bull run after the next cycle, your chances of making a profit increase significantly.Instead of investing $50-100k in Bitcoin all at once, it makes the most sense to buy it gradually over days and weeks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "January 08, 2025, 10:21:56 PM",
      "body": "Not an expert yet with few research I will advice you invest the little you can afford to lose because you don’t want to hold anyone responsible whenever the price is low. From the post above I’m certain op is knowledgeable about bitcoin bearish and bullish season, it’s totally difficult predicting the entry price mostly times like this a lot of investors are scared to buy now viewing the price is very high well now is still the perfect time to buy just imagine missing out previous chance and now op feel the price is still not favorable. A long term plan will help but, not 1-2 years I doubt if it’s a good choice holding for a short period of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cityhunter34",
      "created_time": "January 08, 2025, 10:22:46 PM",
      "body": "Quote from: Ever-young on January 08, 2025, 08:17:03 PMQuote from: believer93248 on January 08, 2025, 06:47:57 PMWhen I'm paying attention to the news I hear a lot. Many voices claim Bitcoin will moon and skyrocket to new all time highs in 2025, they talk about 200k or 300k $ per Bitcoin. Others are talking about a crash to 60k $ or even lower, from which Bitcoin will start to recover. The scheme from 2020 to 2022.You seem to be very prepared with recent happenings and price history, which is good. Run a little research about what you want to invest in and feed yourself with the latest news. For now, all the above news is just speculation. We can't predict exactly how it will do; giving you advice on when to invest might end up being the wrong timing. My advice is that since the market is already struggling at a resistance level, we don't know to what length it will get down to, so if you have the money ready, you can just enter the market now and buy with the little you can; wait for a bit longer; if the price goes down a little bit, you can buy with the rest of the balance you want to invest.Indeed, the OP appears well prepared to invest in Bitcoin. Given the current market volatility, it's wise for individuals to make their own informed decisions. Advising someone to invest without knowing what the future holds is not prudent. As you suggested, a viable strategy is to accumulate Bitcoin initially and then consider buying more later. This approach allows for a more measured investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "January 08, 2025, 10:57:40 PM",
      "body": "HI,No one knows what the future price will be.  All anyone knows that pretty much any time you had mined or purchased over the last 16 years if you have held for any reasonable period of time you have done well.  Market timing is just guessing.  As others have said you can dollar cost average.  You may dollar cost average higher or lower, no one knows.  People say there are these 4 year cycles, but each time has been different and this time is different because MSTR, ETFs etc.  So there may be cycles or there may not be.  Any advice you get on here is only people's opinions, so you'll have to digest them all yourself and see what makes sense.  If I know the fiat price was going to drop, I'd wait or short it.  If I knew it was going to rise, I'd do the reverse, but no one knows.  :-)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "January 08, 2025, 11:10:04 PM",
      "body": "Quote from: believer93248 on January 08, 2025, 06:47:57 PMI want to invest some of the money I’ve got from a real estate liquidation, about 50-100k $. I am not looking for a big profit, but want to secure the value. I definitely plan to hold the Bitcoin for a few years, at least 1-2. A sudden drop in the price of Bitcoin would not scare me.How about if you continue with real estate since you are not looking for big profits, rather you want to tire the capital down.Again, 1 to 2 years is not a complete bitcoin cycle, you might be at great lose in 2 years time from now.Quote from: believer93248 on January 08, 2025, 06:47:57 PMI originally wanted to buy Bitcoin at a price when Bitcoin was at $60k, but I got my money later than I thought.That was a fair price, but I cannot say that for a price at the range of $100kQuote from: believer93248 on January 08, 2025, 06:47:57 PMWhen I'm paying attention to the news I hear a lot. Many voices claim Bitcoin will moon and skyrocket to new all time highs in 2025, they talk about 200k or 300k $ per Bitcoin. Others are talking about a crash to 60k $ or even lower, from which Bitcoin will start to recover. The scheme from 2020 to 2022.That shows the speculative nature of the asset. You can consider to invest only a portion of your capital and diversify the rest. No one can guarantee you anything here.Quote from: believer93248 on January 08, 2025, 06:47:57 PMOf course I want to get a good entry price and that's why I'm asking you, people who have seen and experienced a lot when it comes to Bitcoin.If you want a good entry, then wait for the next cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "January 08, 2025, 11:18:51 PM",
      "body": "You should wait for the crash at its price as low as possible from it's current price in order to acquire more bitcoin when buying bitcoin using the budget you mentioned or not. If you cannot wait for the price to decrease then you can buy portion by portion until you accumulate the amount you wanted. If you are not aware of it then you can make your own research about how DCA works and what's the best way to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "January 08, 2025, 11:43:51 PM",
      "body": "First off dont use an exchange as a wallet, if ypu dont control your own keys you are destimed to find out the hard way.  Second dollar cost average in, dont try to time the market, it takes a seasoned vet awhile to get the hamg of timing the market.  DCA lowers your risk on the downside by not going all in but sharing the upside incase it spikes.  Good luck and welcome you are in for a fun ride",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "January 08, 2025, 11:44:02 PM",
      "body": "If you buy bitcoin now, i suggest you to hold more longer as bitcoin struggling upward to at least break the $110k resistance. Or if you want with smaller profit then it's okay, it still depends on your preference. As long as you don't sell when bitcoin drops compare to your buy order, it's not considered as loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "January 09, 2025, 12:11:06 AM",
      "body": "Quote from: believer93248 on January 08, 2025, 06:47:57 PMI want to invest some of the money I’ve got from a real estate liquidation, about 50-100k $. I am not looking for a big profit, but want to secure the value. I definitely plan to hold the Bitcoin for a few years, at least 1-2. A sudden drop in the price of Bitcoin would not scare me.I originally wanted to buy Bitcoin at a price when Bitcoin was at $60k, but I got my money later than I thought.When I'm paying attention to the news I hear a lot. Many voices claim Bitcoin will moon and skyrocket to new all time highs in 2025, they talk about 200k or 300k $ per Bitcoin. Others are talking about a crash to 60k $ or even lower, from which Bitcoin will start to recover. The scheme from 2020 to 2022.Of course I want to get a good entry price and that's why I'm asking you, people who have seen and experienced a lot when it comes to Bitcoin.The simple truth is that bitcoin does have cycles but nobody knows when we reach either the top or the bottom. You have two strategies since you said you have $50-100k: you can buy all at once when you are happy with the price or you can DCA simply buying a little every single month and in that way you average your price. Anyway I don't think we'll reach $200k during this cycle, let alone $300k...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "January 09, 2025, 12:21:58 AM",
      "body": "Would've usually suggested to just put in everything since you're looking at 1-2 years of investment time but considering the assumption that the bull market is near us (which is what I personally think as well), might be better to wait until after that. At most I reckon it'd be a year? 6 months in the least. You'd probably be met with losses if you invest now and would only probably see a recoup maybe 3 years at least down the line. I'd suggest just putting it back into somewhere else, or DCA into Bitcoin instead and take profit from the bull run when the bullrun actually ends. You can also just put in everything and leave at the peak, but the risk of losses is probably too big, not to mention that you're looking for value, so I'd much rather wait after instead of doing it before when it's pretty close.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}