{
  "id": "topic_5446364",
  "title": "Suzume",
  "author": "Suzume",
  "created_time": "March 26, 2023, 01:57:09 PM",
  "content": "Recently, the largest Bitcoin mixing service, Chipmixer, was shut down as a result of an investigation by the U.S.  Department of Justice.This is not the first time that a Bitcoin mixing service has been targeted by law enforcement agencies. In the past, both BestMixer and Tornado Cash were also shut down.The closure of these services suggests that the authorities are cracking down on these anonymizing services. It is possible that smaller services may also be targeted in the future if they become more significant. This raises concerns about privacy. Bitcoin users who want to protect their identities and transactions will now have to find alternative ways to do it, but what? Even with coinjoin/privacy wallets, these things can also be taken down if they get bigger.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446364",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "March 26, 2023, 02:17:42 PM",
      "body": "Quote from: Suzume on March 26, 2023, 01:57:09 PMRecently, the largest Bitcoin mixing service, Chipmixer, was shut down as a result of an investigation by the U.S.  Department of Justice.This is not the first time a mixer is taken down and it will not be the last, but mixers are still existing.Quote from: Suzume on March 26, 2023, 01:57:09 PMBitcoin users who want to protect their identities and transactions will now have to find alternative ways to do it, but what?You still have the choice to convert to a privacy coin like monero, then converting back from monero to bitcoin.But there are still many mixers that are still existing, including the decentralized mixers that make use of coinjoin. Even on this forum, there are still bitcoin mixers that have ANN thread on this forum that you can still make use of their services.2023 List Bitcoin Mixers Bitcoin Tumblers Websites",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "March 26, 2023, 02:22:03 PM",
      "body": "Yes, it's definitely a worrying trend. Bitcoin users who value their privacy will now have to look for alternative ways to protect their identities and transactions. Another option is to use privacy-focused coins like Monero or Zcash, which provide enhanced privacy features. However, it's essential to note that even these coins are not entirely foolproof and can also be subject to regulatory scrutiny.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "March 26, 2023, 02:25:59 PM",
      "body": "Quote from: decodx on March 26, 2023, 02:22:03 PMYes, it's definitely a worrying trend. Bitcoin users who value their privacy will now have to look for alternative ways to protect their identities and transactions.There are still existing bitcoin mixers. Chipmixer was not the first mixer to be taken down. People are still making use of bitcoin mixers after it was taken down. Quote from: decodx on March 26, 2023, 02:22:03 PMAnother option is to use privacy-focused coins like Monero or Zcash, which provide enhanced privacy features. However, it's essential to note that even these coins are not entirely foolproof and can also be subject to regulatory scrutiny.I will advice you to use monero, if looking for a privacy coin.Why is monero the only recommended privacy coin on this forum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "March 26, 2023, 02:42:24 PM",
      "body": "Mixing services is just a part of many privacy related methods when dealing with bitcoin isn't it?I mean you still have the option to create your own full bitcoin node[1] to avoid leaking information about your transactions and balances to third parties, avoiding KYC-compliant P2P services, using wallet with coinjoin[2] functionalities and practicing coin control[3].[1] https://en.bitcoin.it/wiki/Full_node[2] https://en.bitcoin.it/wiki/Privacy#CoinJoin[3] https://en.bitcoin.it/wiki/Privacy#Coin_control",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "March 26, 2023, 02:48:30 PM",
      "body": "Quote from: Suzume on March 26, 2023, 01:57:09 PMThe closure of these services suggests that the authorities are cracking down on these anonymizing services. It is possible that smaller services may also be targeted in the future if they become more significant. This raises concerns about privacy.Governments always aim at big companies, big services first. Their resources are limited and they have to prioritize what they can do best with their resources. Small services will not be in to-do list of governments.QuoteBitcoin users who want to protect their identities and transactions will now have to find alternative ways to do it, but what?Not all Bitcoin users care about their privacy with their transactions.QuoteEven with coinjoin/privacy wallets, these things can also be taken down if they get bigger.I don't think wallets that support CoinJoin transactions will be targeted soon. There are privacy coins like Monero (a biggest privacy coin) with some past attacks but it is still here and can be traded on big exchanges. If governments want to do something with privacy coins, they will aim at Monero first. After succeeding with Monero and privacy coins, they can aim next at wallets that support Coin join transactions.It's a story for far future not now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "March 26, 2023, 11:46:40 PM",
      "body": "When Bestmixer was seized, around the same time Bitblender which was one of the biggest mixers also stopped Business, but this did not stop other mixers from taking over and thrivingClosure of Chipmixer is not the end of Bitcoin Mixing service. More will always pop up. In fact, as we speak, there are a handful of trustworthy alternatives. For example, cryptomixer is no small mixer and has been in operation since 2016.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "March 26, 2023, 11:55:05 PM",
      "body": "Quote from: Suzume on March 26, 2023, 01:57:09 PMRecently, the largest Bitcoin mixing service, Chipmixer, was shut down as a result of an investigation by the U.S.  Department of Justice.This is not the first time that a Bitcoin mixing service has been targeted by law enforcement agencies. In the past, both BestMixer and Tornado Cash were also shut down.The closure of these services suggests that the authorities are cracking down on these anonymizing services. It is possible that smaller services may also be targeted in the future if they become more significant. This raises concerns about privacy. Bitcoin users who want to protect their identities and transactions will now have to find alternative ways to do it, but what? Even with coinjoin/privacy wallets, these things can also be taken down if they get bigger.Why are you worried about your transactions if you deal with legally and you didn't commit frauds? Only scammers and money laundering individual but for people use bitcoin for daily transactions I guess the absence of mixers is not much a major concern. But you don't need to worry about that since even if a big mixer has been shutdown there will be another one will be created.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 27, 2023, 12:04:25 AM",
      "body": "There is an important difference between Mixers and privacy wallets/coinjoin, in my opinion.Mixers are a service, which need to be hosted and maintained by operators, which makes them vulnerable in a way or another. However, Privacy wallets and coinjoin are supposed to be open source and in the case of coinjoin, it can become a decentralized standard, in that case an government cannot realistically take down something which does not require a centralized host to work properly.What I think it is going to happen is that the agencies will get tougher on exchanges and casinos, so they won't be allowed to take coin-joined coins in any way shape or form in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "March 27, 2023, 01:14:19 AM",
      "body": "Quote from: Hispo on March 27, 2023, 12:04:25 AMWhat I think it is going to happen is that the agencies will get tougher on exchanges and casinos, so they won't be allowed to take coin-joined coins in any way shape or form in the future. With casinos too? I'm not sure but I don't think so. What I think will happen is that eventually cryptocurrency casinos will be forced to operate like fiat casinos, fully identifying their users from the start, and then coins coming from them won't have any problems, in the same way that fiat money coming out of an online casino today doesn't have any problems either. If they are casinos that operate without KYC or with high KYC limits, then I think coins could be blacklisted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "March 27, 2023, 01:39:54 AM",
      "body": "Quote from: Bitcoin_Arena on March 26, 2023, 11:46:40 PMWhen Bestmixer was seized, around the same time Bitblender which was one of the biggest mixers also stopped Business, but this did not stop other mixers from taking over and thrivingHow many mixers were seized in history? Only two (BestMixer and ChipMixer) or more than two in history?QuoteClosure of Chipmixer is not the end of Bitcoin Mixing service. More will always pop up. In fact, as we speak, there are a handful of trustworthy alternatives. For example, cryptomixer is no small mixer and has been in operation since 2016.I think so but governments will not stop their hunt for 'illegal' mixers. They will even enforce more law regulations against mixers. I don't think mixers will be eliminated completely but they will be challenged more by governments.Maybe governments will enforce some requirements on mixers and allow their operations but how is what I don't know. They can not ask license on business which they consider as illegal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "March 27, 2023, 02:15:29 AM",
      "body": "Quote from: BlackBoss_ on March 27, 2023, 01:39:54 AMQuote from: Bitcoin_Arena on March 26, 2023, 11:46:40 PMWhen Bestmixer was seized, around the same time Bitblender which was one of the biggest mixers also stopped Business, but this did not stop other mixers from taking over and thrivingHow many mixers were seized in history? Only two (BestMixer and ChipMixer) or more than two in history?QuoteClosure of Chipmixer is not the end of Bitcoin Mixing service. More will always pop up. In fact, as we speak, there are a handful of trustworthy alternatives. For example, cryptomixer is no small mixer and has been in operation since 2016.I think so but governments will not stop their hunt for 'illegal' mixers. They will even enforce more law regulations against mixers. I don't think mixers will be eliminated completely but they will be challenged more by governments.Maybe governments will enforce some requirements on mixers and allow their operations but how is what I don't know. They can not ask license on business which they consider as illegal.They will keep shutting down and I think even those wallets like wasabi or the coinjoin might also be attacked one day. They already figured these services can't be stopped so I wouldn't be surprised if the government itself will launch thier own mixing service secretly to get the database of users who are using these services. They probably have one already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "March 27, 2023, 02:37:02 AM",
      "body": "This will not be the end of Bitcoin mixing services. Just like it wasn't the end when Bestmixer.io was shut down in 2019. Mixing will continue to operate. One of them will grow big and will become the target of the authorities. If successful, the authorities will have it seized or shut down. But it will only cause more to grow. Tornado Cash was also shut down, but since it is simply a protocol, an open-source tool, there will come a time when a similar platform will come out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "March 27, 2023, 02:51:13 AM",
      "body": "Quote from: bittraffic on March 27, 2023, 02:15:29 AMThey will keep shutting down and I think even those wallets like wasabi or the coinjoin might also be attacked one day. They already figured these services can't be stopped so I wouldn't be surprised if the government itself will launch thier own mixing service secretly to get the database of users who are using these services. They probably have one already.I agree that they will continue to attack and shutdown mixers that are their first priorities. Wallets support privacy transactions will not be their next targets and I believe after mixers, they will focus on privacy coins with a biggest target is Monero. After that they can put their resources on Privacy wallets like Wasabi, Samourai ...However I believe that governments will be challenged by communities too. Especially challenge will become bigger if they make Bitcoin legal tender, citizens will have more reasons to require privacy as one of their basic freedoms.Or is it one of barrier for government to accept Bitcoin as legal tender especially in big countries like the USA.?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 27, 2023, 02:58:09 AM",
      "body": "Quote from: Don Pedro Dinero on March 27, 2023, 01:14:19 AMQuote from: Hispo on March 27, 2023, 12:04:25 AMWhat I think it is going to happen is that the agencies will get tougher on exchanges and casinos, so they won't be allowed to take coin-joined coins in any way shape or form in the future. With casinos too? I'm not sure but I don't think so. What I think will happen is that eventually cryptocurrency casinos will be forced to operate like fiat casinos, fully identifying their users from the start, and then coins coming from them won't have any problems, in the same way that fiat money coming out of an online casino today doesn't have any problems either. If they are casinos that operate without KYC or with high KYC limits, then I think coins could be blacklisted.I believe it would make more sense if the casinos and exchanges mixed both KYC and detection of coinjoined Coins. It is more useful for law enforcement to know who is using those anonymized coins, in a context where tools to enhance coin privacy are highly available through open source protocols and wallets, like wasabi and Trezor (Satoshilabs is planning to release CJ for both Trezor one and Trezor T in the future).For example, if I deposited anonymous coins in Binance, since they had my personal information, they could inform authorities to add me in some list of people to pay attention to. If they did not have that personal information, they could not do, so only restrict my account to some level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "March 27, 2023, 04:18:38 AM",
      "body": "You're very late to the party, these things have been discussed almost two weeks ago.I will opine though that converting between privacy coins at different exchanges is only a reasonable option at decentralized exchanges, and not centralized ones since they can still track your spending anyway!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "March 27, 2023, 04:53:01 AM",
      "body": "Quote from: Suzume on March 26, 2023, 01:57:09 PMSnipPrivacy of transactions will always be hunted by authorities. They want information about each transaction that a crypto user did but mixers make it difficult for them. No doubt some old mixers got banned due to involvement in illegal activities but more mixers in the market can be used to keep up your privacy while making transactions. Here is the list of all mixers that you may use to mix your BTC with basic details. These are the list of all the BTC MIXERs by LeGauloisI hope this list might help you. And I have a question for you if you do not mind answering. I had a conservation with my local community member about the illegal usage of the mixer, he said most of the usage of all mixers is for only illegal activities but I insist that people want to use it for good purposes like to get privacy but some might be using it for there own agendas by harming its(mixer) purpose. So can you tell if is it true like all mixers are intentionally involved in illegal activity? Just have a curious question. Because none of my friends ever used a mixer, not me. So I was curious about its experience and usage of it. People who have used it must have a better answer to the question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 27, 2023, 05:06:36 AM",
      "body": "We will have to see to it that we'll see more cracking down of these mixers eventually. And while we've got some notable mixers that are rising and starting to gain traction, they might just take it down in the future but knowing when are we have no idea. It appears to be that the authorities are only waiting for the right time until they crack down on these mixers when they become huge. But while some are in existence and not yet that big to shutdown, that's likely the pattern that they're doing. Because IMO, if they want to shut them down, they can do it to all of it if they've got leads. And that's making me think that's what they're only doing when it's got that many bitcoins already for them to confiscate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 27, 2023, 05:16:57 AM",
      "body": "Don't know why you're bringing up the topic now that the issue has gradually being forgotten. And btw, if you're not dealing with your Bitcoin illegally then there is nothing for you to be scared about, the only time I have used a mixer was when I was testing the mixer that I'm currently promoting I just had to check and see how it works and not because of privacy whatever.And you shouldn't forget that they are so many users here that haven't used any mixer since they got into Bitcoin are they not still alive?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "March 27, 2023, 05:23:19 AM",
      "body": "Do you think Peer-to-Peer sharing services all went down, when one of these sites were targeted in the past? No, new sites popped up like mushrooms to take it's place.....and that is what is going to happen with all the mixer services that are targeted. Let's not forget that the IT industry are very adaptive in nature... so people will develop something new to replace current mixer services to make it more difficult to take it down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}