{
  "id": "topic_5416668",
  "title": "llcj",
  "author": "llcj",
  "created_time": "October 10, 2022, 11:04:37 PM",
  "content": "daha once sorunsuz swift transferi yaptigim fiba dan sonra, akbank ta swift gonderimini durdurdu.birakin borsalari, ABD de kendi adima ait olan hesaba bile gonderime sorun cikartiyorlarsorunsuz swift yapabilen (ozellikle borsalara), banka var mi?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416668",
  "comments": [
    {
      "author": "Bthd",
      "created_time": "October 11, 2022, 10:25:38 AM",
      "body": "Quote from: llcj on October 10, 2022, 11:04:37 PMdaha once sorunsuz swift transferi yaptigim fiba dan sonra, akbank ta swift gonderimini durdurdu.birakin borsalari, ABD de kendi adima ait olan hesaba bile gonderime sorun cikartiyorlarsorunsuz swift yapabilen (ozellikle borsalara), banka var mi?Müthiş bir dolar açlığı var ve ülkeye giren her kuruşu emdikleri gibi çıkışları da mümkün mertebe engelliyorlar. Daha önce tavsiye etmiyor olsam da gidin Kapalıçarşı gibi yerlerden OTC USDT alın geçin. Takip altında kalmamış olursunuz. Bu saçma olaylar yüzünden 1 sene önce varlık barışı yapmayı bıraktım, dövizimi zincir üzerinde tutuyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "October 20, 2022, 09:23:00 AM",
      "body": "Ben de doları blok zincirine çevirmenizi tavsiye ederim. Bir devlet bankasından dolarımı kkm ye çevirmem için telefon almışlığım var. Resmen gelip randevu oluşturalım liranızı kur korumalıda değerlendirmeliyiz vesaire tarzıydı. Kime ne benim dolarımdan diye düşünüyorum ama ifade edemiyorsunuz işte. Çok şükür en azından sermaye kontrolü yok tam olarak. Aktar binance trye çevir busdye takıl kafana göre.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "llcj",
      "created_time": "October 21, 2022, 09:53:25 AM",
      "body": "yuklu miktarlarda al-sat yaptigim icin maalesef hem binance tr, hem de btcturk para yatirma limitlerim cok cabuk doluyor, (ikisinde de ek KYC ile normal limitlerin ustunde limitim mevcut)o yuzden yurtdisina swift yapiyordum, 3-4 senedir hic problem yasamamistim ama banka acik acik soyledi, problem kendilerinde degil, yurtdisina swift yaptirmamak icin otoritenin her turlu zorlugu cikardigini soylediler. saka gibi Amerika'daki kendi sahsi hesabima bile gonderirken gecerli bir neden istiyorlar !!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "superleggera",
      "created_time": "October 22, 2022, 07:46:33 PM",
      "body": "Quote from: llcj on October 21, 2022, 09:53:25 AMama banka acik acik soyledi, problem kendilerinde degil, yurtdisina swift yaptirmamak icin otoritenin her turlu zorlugu cikardigini soylediler. Hocam konunun cevabını kendiniz vermişsiniz işte. Sorun bankalardan kaynaklı olmadığı için diğer bankalarda aynı şekilde işlemlerinizi kısıtlayacaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teramit",
      "created_time": "October 29, 2022, 12:08:11 PM",
      "body": "senin ne yaptığını anlayamamışlar ondan durdurmuşlar , bana da yaptılardı, banka değiştir devam et",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ucuzbtc",
      "created_time": "November 14, 2022, 09:29:34 PM",
      "body": "Quote from: teramit on October 29, 2022, 12:08:11 PMsenin ne yaptığını anlayamamışlar ondan durdurmuşlar , bana da yaptılardı, banka değiştir devam etHocam tavsiye edebileceğiniz banka ve borsa varmı binancede yeterince battık bari transfere dönelim.Arkadaşlar ile toplanıp 20k dolar swift göndermek istiyoruz kraken bitstamp yada başka hangi borsayı önerebilirsiniz.Bankalardan işe yarayan hangisi var enpara iptal etti açıklamadan dolayı bugün teb falan diyenler oluyor aktif banka için yardım eden olursa sevinirim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isyet",
      "created_time": "November 23, 2022, 08:13:11 PM",
      "body": "Quote from: llcj on October 10, 2022, 11:04:37 PMdaha once sorunsuz swift transferi yaptigim fiba dan sonra, akbank ta swift gonderimini durdurdu.birakin borsalari, ABD de kendi adima ait olan hesaba bile gonderime sorun cikartiyorlarsorunsuz swift yapabilen (ozellikle borsalara), banka var mi?wise'de hesap açın. Türkiye ile çok iyi çalışıyor. Biz yıllardır sorunsuz çalışıyoruz. Yalnız, süper dürüst bilgiler vermeniz lazım. En ufak yanlış bilgide kapatıyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}