{
  "id": "topic_5414843",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "September 25, 2022, 01:58:32 PM",
  "content": "Is there a website or a platform that consists of all available testnets faucets information? Like avalanche testnet and others? I need this because I want to start joining testnet tasks and I need to at least feel how this works.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5414843",
  "comments": [
    {
      "author": "Despairo",
      "created_time": "September 25, 2022, 03:31:45 PM",
      "body": "I found some sites that have some various coins testnets that can be used for you:1. https://github.com/arddluma/awesome-list-testnet-faucets2. https://testnet-faucet.com/3. https://cointool.app/tools/faucetsDon't forget to send it back to the sites if you're done using the faucet testnet or you can give to other person who also need it, it doesn't make sense if someone carrying testnet while the value is worthless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "September 25, 2022, 08:37:23 PM",
      "body": "More can be found in these sites...1. https://testnet.help/en/2. Curated list of Testnet faucets for Ropsten, Goerli, Kovan, Polygon/Mumbai, FantomTest, Sokol, Aurora etcThough testnets for certain coins may be missing, but it's agood start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 26, 2022, 03:22:46 AM",
      "body": "Quote from: KiaKia on September 25, 2022, 01:58:32 PMIs there a website or a platform that consists of all available testnets faucets information? Like avalanche testnet and others? I need this because I want to start joining testnet tasks and I need to at least feel how this works.Hi there you might want to follow this guy. https://twitter.com/Abrahamchase09?t=PiefQwcES5CIssP78dGKCg&s=09He is compiling some testnet instructions and tutorials that include different set of incentivized testnets. Check his pinned tweet and youll see there list.Yes joining testnet could also be a good start aside from learning on how to use other network and tech, youll find yourself lucky when those are giving real mainnet tokens and can be monetize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}