{
  "id": "topic_5401410",
  "title": "kudosinitchi",
  "author": "kudosinitchi",
  "created_time": "June 05, 2022, 02:30:07 AM",
  "content": "Kung nabasa niyo mga kabayan na kamakailan lamang, ang bansang El Salvador to adopt bitcoin as legal na sa kanilang bansa. Kinilala rin ng mga bansang tulad ng Japan, US at European Union ang mga cryptocurrencies as legal, financial assets with value.Sa ngayon, nagpapakita na rin ang Pilipinas ng pagtaas ng optimismo tungkol sa crypto. Ipinapakita din ng data ng Banko Sentral ng Pilipinas (BSP) na halos 20 milyon na o 362% taon-taon ang dami ng mga transaksyon sa cryptocurrency sa unang kalahati ng 2021.Ang mga transaksyong ito, ayon sa isang ulat, ay nagkakahalaga ng P105.93 bilyon. https://www.philstar.com/business/2021/12/03/2145304/virtual-currency-transactions-hit-p106-billion-h1/amp/Kung inyo rin nabalitaan, naiulat na ang Pilipinas ay nasa ikalawa na sa buong mundo o 22.7% ng mga nasa hustong gulang na nagsasabing sila ay nagmamay-ari ng cryptocurrency.https://bitpinas.com/feature/philippines-ranks-2nd-in-crypto-ownership-survey/Masasabi ko na dahil ito sa lumalagong digital awareness at tech-savviness ng mga Pilipino na lalong nagpatibay at lumawak ang kaisipan mula ng pumutok o yung napausong larong play-to-earn. Idadagdag ko narin yung mga bagong at karagdagan services ng ng crypto app gaya ng Gcash, Paymaya, Coins.ph at maging ang bangko narin na unti unti sumasabay sa takbo ng digital finance na sa palagay ko magbibigay ng malawak at malayang transakyon.Masasabi ko din at naniniwala ako na sa crypto investment ay maaaring makagawa ng bagong batch ng mga milyonaryo ng digital currency basta't may malawak kang kaalaman, patience at experience kung paano ito laruin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401410",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 05, 2022, 05:54:57 AM",
      "body": "Quote from: kudosinitchi on June 05, 2022, 02:30:07 AMMasasabi ko din at naniniwala ako na sa crypto investment ay maaaring makagawa ng bagong batch ng mga milyonaryo ng digital currency basta't may malawak kang kaalaman, patience at experience kung paano ito laruin.Unfortunately ung tingin ko is ung kabaliktaran. Gaya rin sa mga \"crypto investors\" sa ibang bansa, sobrang liit ng persyento nung mga alam talaga nila ung ginagawa nila. May mga yayaman, pero mas maraming matatalo. Kung sana magstick nalang sa BTC ung karamihan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "June 05, 2022, 01:01:19 PM",
      "body": "Quote from: mk4 on June 05, 2022, 05:54:57 AMQuote from: kudosinitchi on June 05, 2022, 02:30:07 AMMasasabi ko din at naniniwala ako na sa crypto investment ay maaaring makagawa ng bagong batch ng mga milyonaryo ng digital currency basta't may malawak kang kaalaman, patience at experience kung paano ito laruin.Unfortunately ung tingin ko is ung kabaliktaran. Gaya rin sa mga \"crypto investors\" sa ibang bansa, sobrang liit ng persyento nung mga alam talaga nila ung ginagawa nila. May mga yayaman, pero mas maraming matatalo. Kung sana magstick nalang sa BTC ung karamihan.Sa ngayon kase puro hype lang talaga at karamihan sa mga Pinoy ay naaakit dito at kinakalimutan na nila aralin mismo kung paano ba ang kalakaran sa cryptocurrency. Malaki ang chance na maging successful ka dito kung talagang pagtutuunan mo ng pansin ito, pero kung aasa ka lang sa mga signal group or any investment advices, for sure mas malaki ang malulugi mo. Dito sa Pinas unti-unti na nakikilala ang Bitcoin, yun nga lang maraming scam projects paren ang nagsisisulputan kaya nakakaapekto ren ito sa tiwala ng ibang Pinoy. Kung ang government naten ay magbibigay ng tamang impormasyon patungkol sa Bitcoin, baka ito pa ang maging magandang dahilan ng pagasenso ng nakakarami.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "June 17, 2022, 11:54:31 PM",
      "body": "Sa totoo lang sumikat ang cryptocurrency sa Pilipinas dahil sa mga HYIPs at mga Pyramid scheme nga mga kumpanya.  Dahil dito medyo naging negatibo ang dating ng cryptocurrency sa karamihan sa mga hindi nakakaalam at nakikiayon lang sa mga balitang paninira sa Bitcoin.Sa ngayon, ang cryptocurrency regulation status ay kasalukuyang nirerepaso.  Ang mainit na usapin tungkol sa pagtatax ay isa sa mga pinopukusan ng gobyerno at kung paano ito iimplement sa bansa.  Quote from: mk4 on June 05, 2022, 05:54:57 AMQuote from: kudosinitchi on June 05, 2022, 02:30:07 AMMasasabi ko din at naniniwala ako na sa crypto investment ay maaaring makagawa ng bagong batch ng mga milyonaryo ng digital currency basta't may malawak kang kaalaman, patience at experience kung paano ito laruin.Unfortunately ung tingin ko is ung kabaliktaran. Gaya rin sa mga \"crypto investors\" sa ibang bansa, sobrang liit ng persyento nung mga alam talaga nila ung ginagawa nila. May mga yayaman, pero mas maraming matatalo. Kung sana magstick nalang sa BTC ung karamihan. Sang-ayon ako kung ang larangan na tatahakin ng makikipagparticipate sa Bitcoin industry ay trading at investment.  Pero kung ang ititake advantage ng mga tao ay ang mga job opportunities na dinedemand ng cryptocurrency industry ay maaring tumaas ang antas ng pamumuhay ng mga taong makikipagpariticipate dito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "June 18, 2022, 06:58:36 AM",
      "body": "Kung sanay lahat ng Datus na nabanggit ay lehitimo at tooong nangyayari eh masasabi kong ang pinas nga ay papunta na sa tuluyang adoption ng crypto sa pinas,pero kung totoong 22.7% ng mga mature Pinoy ay may crypto ? eh di sana eh ganon na kalawak ang kaalaman sa crypto ng pinas.Nagsimula lang naman lumawak ang data na yan dahil sa AXIE infinity an pumutok nung 2021 Hype , pero ngayon? halos mahigit sa kalahati ng kakilala kong namuhunan sa crypto nung 2021 ay sinusumpa na ang crypto now dahil sa pagkatalo hehe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "June 18, 2022, 08:51:15 PM",
      "body": "Quote from: mk4 on June 05, 2022, 05:54:57 AMQuote from: kudosinitchi on June 05, 2022, 02:30:07 AMMasasabi ko din at naniniwala ako na sa crypto investment ay maaaring makagawa ng bagong batch ng mga milyonaryo ng digital currency basta't may malawak kang kaalaman, patience at experience kung paano ito laruin.Unfortunately ung tingin ko is ung kabaliktaran. Gaya rin sa mga \"crypto investors\" sa ibang bansa, sobrang liit ng persyento nung mga alam talaga nila ung ginagawa nila. May mga yayaman, pero mas maraming matatalo. Kung sana magstick nalang sa BTC ung karamihan.Pupwede naman, at tingin ko attainable naman, yun nga lang medyo mababa ang chance na mangyari. If ever man nabhindi lang sa bitcoin ang investment, sa tingin ko mahalaga na iconsider kaagad ang take profit (para to sa mga altcoin at NFT na hyped nitong nakaraan). Pero yun nga may matatalo, may mananalo, pero di naman ibig sabihin na pinoy ang talo palagi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 19, 2022, 08:43:23 AM",
      "body": "Quote from: Eureka_07 on June 18, 2022, 08:51:15 PMPupwede naman, at tingin ko attainable naman, yun nga lang medyo mababa ang chance na mangyari. If ever man nabhindi lang sa bitcoin ang investment, sa tingin ko mahalaga na iconsider kaagad ang take profit (para to sa mga altcoin at NFT na hyped nitong nakaraan). Pero yun nga may matatalo, may mananalo, pero di naman ibig sabihin na pinoy ang talo palagi.Unfortunate reality is that sobrang taas ng financial illiteracy sa Pilipinas; exactly bakit sobrang uso ang pag uutang via \"5-6\" at sobrang hot ang pyramid schemes dito sa Pilipinas.So yes, pagdating sa investments in general syempre hindi literal na lahat matatalo, pero sobrang liit lang ng porsyento ng mga tao ang alam talaga nila ung ginagawa nila (hence matatalo).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "June 20, 2022, 02:10:10 PM",
      "body": "Quote from: kudosinitchi on June 05, 2022, 02:30:07 AMMasasabi ko na dahil ito sa lumalagong digital awareness at tech-savviness ng mga Pilipino na lalong nagpatibay at lumawak ang kaisipan mula ng pumutok o yung napausong larong play-to-earn. Idadagdag ko narin yung mga bagong at karagdagan services ng ng crypto app gaya ng Gcash, Paymaya, Coins.ph at maging ang bangko narin na unti unti sumasabay sa takbo ng digital finance na sa palagay ko magbibigay ng malawak at malayang transakyon.Nakakadagdag na din sa bilang na ito ang mga taong nahikayat dahil sa mga crypto related investment schemes. Dahil din sa pagputok ng p2e noong nakaraang taon, marami sa kababayan natin ang nag-invest sa crypto sa pag-aakalang ang value ay lagi tumataas. Di muna nila inaral mabuti ano ang mga risk kapag nag-invest ka dito. Marami tuloy akong nakikita sa social media na ang tingin sa crypto ay scam dahil sa kasalukuyang estado ng market. Dapat din magkaroon ng sapat na kaalaman ang mga kababayan natin kung ano ba ang cryptocurrencies, hindi maganda yung marami nga ang may alam satin kung ano ang tingin dito ay scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "June 23, 2022, 03:21:31 AM",
      "body": "Quote from: peter0425 on June 18, 2022, 06:58:36 AMKung sanay lahat ng Datus na nabanggit ay lehitimo at tooong nangyayari eh masasabi kong ang pinas nga ay papunta na sa tuluyang adoption ng crypto sa pinas,pero kung totoong 22.7% ng mga mature Pinoy ay may crypto ? eh di sana eh ganon na kalawak ang kaalaman sa crypto ng pinas.Nagsimula lang naman lumawak ang data na yan dahil sa AXIE infinity an pumutok nung 2021 Hype , pero ngayon? halos mahigit sa kalahati ng kakilala kong namuhunan sa crypto nung 2021 ay sinusumpa na ang crypto now dahil sa pagkatalo hehe.Sa tingin ko din dahil sa play to earn NFTs kaya mas naging marami ang transaksyon sa crypto. Pero hindi ibig sabihin na maintain yung dami ng users, dahil na rin sa nawala na yung hype ng NFTs at ang popular dito satin na Axie. Dagdag pa na bumagsak ang market  at malamang marami ang nalugi lalo na yung mga nakabili nung mataas pa ang value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}