{
  "id": "topic_5474608",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "November 18, 2023, 11:51:19 PM",
  "content": "Up until now I have been just buying and patiently waiting for the bull run but in the last week I have seen 2 altcoins I was interested in pump up 40% in less than 24 hours so want to try make some money and give trading a go.What is the best site for this in the UK? I am only going to start with $200 roughly to see what I can turn it into over the next few weeks and months as the market is starting to get very volatile so could be good opportunity to make some extra money which would then mean I can invest more into my long term plays.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474608",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "November 18, 2023, 11:58:15 PM",
      "body": "Do you mind to tell us what 2 altcoins you want to trade?So that we can find the right exchange that supports these two coins.Or search for the coins you want here https://www.coingecko.com/ and then check the coin and what exchange supports it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "November 19, 2023, 12:06:17 AM",
      "body": "Know that trading can be the start of losses. Trade with the amount of money that you can afford to lose.What coins are you talking about?On coingecko, click on the coins and click on 'market' which will list the exchanges that the coin is traded. You can also do that on Coinmarketcap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HelliumZ",
      "created_time": "November 19, 2023, 12:34:25 AM",
      "body": "There are certain precautions you must take when choosing an exchange to trade with. Whether you choose a decentralized or centralized exchange for trading, security matters more. It should be remembered that if you choose a centralized exchange but do not pay attention to security issues, you will be facing a big threat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "November 19, 2023, 12:49:28 AM",
      "body": "The two altcoins I am talking about are Alliance Block & Kaspa which have both been very up and down over the last week or so. Alliance Block pumped 35% in less than a day today. I am just getting bored of only buying and waiting for bull run as I have been doing that for almost 2 years now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DirtyKeyboard",
      "created_time": "November 19, 2023, 01:28:27 AM",
      "body": "Following the above advice it looks like KuCoin and Bitfinex are good options, but apparently those exchanges don't operate in the UK.ra/]https[Suspicious link removed]ra/https://coinmarketcap.com/currencies/kaspa/What exchange do you currently use, if you don't mind providing that info?EDIT: the allianceblock-nexera/ is getting marked as Suspicious.  That might be a sign...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 19, 2023, 03:04:01 AM",
      "body": "What coins are you buying? Majot exchange list only good projects on Binance and Kucoin, but if you also trading other unknown coins these are usually present on mexc exchange. Id like to use this they dont need to engage with KYC and Ive been using that eversince. Well for major coins its alwsys Binance on the top of the list as it have huge volume and very user friendly exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "November 19, 2023, 03:14:28 AM",
      "body": "Quote from: JamesDaniel90 on November 18, 2023, 11:51:19 PMWhat is the best site for this in the UK? It's hard to say what is a best exchange for you because to choose an exchange, you have to consider many things: KYC or non-KYC, Taker, Maker trading fee, withdrawal fee.I am not sure about UK, you can find some from exchanges for Europe.https://www.cryptowisser.com/exchanges?continent=EU&coins=&fee=2.0If you don't like KYChttps://kycnot.me/QuoteI am only going to start with $200 roughly to see what I can turn it into over the next few weeks and months as the market is starting to get very volatile so could be good opportunity to make some extra money which would then mean I can invest more into my long term plays. I will go frankly with you, trading is difficult and it's hard to get rich with trading.Your capital for trading is smal, $200 and I will use it for investment to layer 2 projects like Arbitrum or Optimism. If these projects successfully make its bull run in 2024 and 2025, chance for x10 or x20 with their tokens is possible. It's a better choice than trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "November 19, 2023, 04:57:38 AM",
      "body": "You should start with any exchange that doesn't require you to provide KYC documents to just buy or sell, withdraw, and deposit. There might be a limit to it (On withdrawals) however it's the best option if you want to go with a Centralised Exchange. Earlier, you could just use Binance as it's the #1 Exchange in terms of liquidity and overall stability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "November 19, 2023, 05:59:13 AM",
      "body": "Quote from: JamesDaniel90 on November 19, 2023, 12:49:28 AMI am just getting bored of only buying and waiting for bull run as I have been doing that for almost 2 years now  You have hold the forth stockpiling for a wholesome 2 years now and just a few months in view to the BTC halving and a harmonizing bull run you have suddenly gone grew bored. That's weird. Trade is completely different from holding, the risk associated with it is too high that $200 can't take you anywhere and from your op it's obvious you are about trading for the first time which very unlikely for you to make profit, so don't get too comfortable with a few basics you must have learnt about trading. Am not being pessimistic but realistic with you, to be a better trader you have to be prepared to make losses and those losses means money , the preliminary question you be asking yourself is are you ready to lose your money and be comfortable about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "November 19, 2023, 06:11:45 AM",
      "body": "Quote from: JamesDaniel90 on November 18, 2023, 11:51:19 PMUp until now I have been just buying and patiently waiting for the bull run but in the last week I have seen 2 altcoins I was interested in pump up 40% in less than 24 hours so want to try make some money and give trading a go.What is the best site for this in the UK? I am only going to start with $200 roughly to see what I can turn it into over the next few weeks and months as the market is starting to get very volatile so could be good opportunity to make some extra money which would then mean I can invest more into my long term plays. If you are very experienced about trading then surely you can earn money by trading. But you can use Binance Exchange and kucoin Exchange for trading. Because all these exchange sites are very useful for trading. You can trade with $200 or less it's up to you but always remember not to get too greedy with altcoin and don't hold it for long. Because at any moment the altcoin market can be dumping. Once the altcoin market takes a dump, it takes a long time to recover. I went into trading thinking like you but in return I got hurt in my trading. Whatever your goal is, I hope you succeed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "November 19, 2023, 06:23:51 AM",
      "body": "Quote from: JamesDaniel90 on November 18, 2023, 11:51:19 PMUp until now I have been just buying and patiently waiting for the bull run but in the last week I have seen 2 altcoins I was interested in pump up 40% in less than 24 hours so want to try make some money and give trading a go.What is the best site for this in the UK? I am only going to start with $200 roughly to see what I can turn it into over the next few weeks and months as the market is starting to get very volatile so could be good opportunity to make some extra money which would then mean I can invest more into my long term plays. You can see the altcoin you are referring to listed on certain exchanges. and you can see the best price and trading volume that you can choose.whatever you will earn depends on how good you are at trading. You may see the opportunities some altcoins present, but without the skills to trade you won't make anything.you can't just talk about profits when trading. because there is a risk that you will lose money if you make the wrong analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "November 19, 2023, 08:15:15 AM",
      "body": "Quote from: 2Pizza410000BTC on November 19, 2023, 06:11:45 AMQuote from: JamesDaniel90 on November 18, 2023, 11:51:19 PMUp until now I have been just buying and patiently waiting for the bull run but in the last week I have seen 2 altcoins I was interested in pump up 40% in less than 24 hours so want to try make some money and give trading a go.What is the best site for this in the UK? I am only going to start with $200 roughly to see what I can turn it into over the next few weeks and months as the market is starting to get very volatile so could be good opportunity to make some extra money which would then mean I can invest more into my long term plays. If you are very experienced about trading then surely you can earn money by trading. But you can use Binance Exchange and kucoin Exchange for trading. Because all these exchange sites are very useful for trading. You can trade with $200 or less it's up to you but always remember not to get too greedy with altcoin and don't hold it for long. Because at any moment the altcoin market can be dumping. Once the altcoin market takes a dump, it takes a long time to recover. I went into trading thinking like you but in return I got hurt in my trading. Whatever your goal is, I hope you succeed.You are not the only who got affected by trading as I was also a victim of such loss as I thought of how easy people were actually claiming trading is and how much profits they have made from it and this increase my anxiousness and curiosity to get into the trading world and I learnt my lesson the hard way as I lost some tangible fund in trading and since then I don't even believe all these ads about how trading is beneficial and how people are using it to make a living and I bet that if you follow these ads you will just end up crashed and wrecked. Although as for now I see that people are saying that trading can be beneficial if you learn the trade very well but with my experience I think even the so called expert get the losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesDaniel90",
      "created_time": "November 19, 2023, 08:35:25 AM",
      "body": "Like I said I am not looking at trading to make a big return and if I start with $200 will be happy if I can turn that into $1k to then invest the profits in my long term position. Alliance block I mentioned above has pumped even more and done over 55% now in less than 24 hours so had I put my $200 in when I thought I would now be over $300 in less then a day. The plan would then be to put that $300+ into another coin that yet to pump, wait for it to go up then repeat till i reach $1k so it is swing trading I am thinking of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "November 19, 2023, 09:07:14 AM",
      "body": "Quote from: JamesDaniel90 on November 18, 2023, 11:51:19 PMUp until now I have been just buying and patiently waiting for the bull run but in the last week I have seen 2 altcoins I was interested in pump up 40% in less than 24 hours so want to try make some money and give trading a go.What is the best site for this in the UK? I am only going to start with $200 roughly to see what I can turn it into over the next few weeks and months as the market is starting to get very volatile so could be good opportunity to make some extra money which would then mean I can invest more into my long term plays. I would rather use that $200 to invest in Bitcoin than to waste it on trading, I am expecting you to say that I am trying to discourage you because it's what most newbies used to say on here but I don't care, the truth is always something you guys don't want to hear, trading isn't something you can start because you have the money, as a matter of fact put that money aside first, what do you know about trading? Nothing, just because you have money to try trading out doesn't mean you should, there is also no demo trade for crypto trading available that I know of, if you want to know trading start learning first and when you are at a level you are free to use $10- $20 dollars as your testing amount, not $200.I have cousins that are into trading, as smart and educated that they are, it took them three years to start knowing the real strategy of trading, they started with rush and they lost a lot of money but that's not even the case, the thing is they end up in debt and I came to their rights rescue, trading is not like investing in coins and tokens, it's very complicated and you need to take your time in learning only, fix your mind on learning it instead of thinking about making money right now, the longer you take your time in learning the more you will get better knowledge about trading. I won't dare stop you if you are ready to pay for your own ignorance though, but I hope you will listen, it's not about having money to trade, it's about the skills you have gained from learning how to trade, start your trading journey today with zero money, learn how to read the charts and other important things, this is like going back to school honestly, you will come back and tell me that I am right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "November 19, 2023, 09:19:13 AM",
      "body": "It will totally depend on the coins you want to trade lol. If you're talking about majors, then just go with the biggest exchange that's available in your country.If you're going to trade the bottom-of-the-barrel shitcoins, then you're going to need to go with the kuCoin's and Gate.io's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "November 19, 2023, 09:28:41 AM",
      "body": "Quote from: JamesDaniel90 on November 19, 2023, 12:49:28 AMThe two altcoins I am talking about are Alliance Block & Kaspa which have both been very up and down over the last week or so. Alliance Block pumped 35% in less than a day today. You want to trade with altcoins, and not Bitcoin; so this topic should prolly be in the altcoin discussion board.I don't know anything about these two coins you have just mentioned, but i know they are pump and dump coins, you have seen them pump and that's why you want to get in right now, mind you that it is the dump that usually follows next. Altcoins generally do not have any actual utility like Bitcoin does, so they just pump and dump and if you must buy them, you have to know when to sell; if you hodl it longer than necessary, you might end up being a badholder. That's why buying/trading altcoins is generally regarded as gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Deva1290",
      "created_time": "November 19, 2023, 09:32:26 AM",
      "body": "Quote from: mk4 on November 19, 2023, 09:19:13 AMIt will totally depend on the coins you want to trade lol. If you're talking about majors, then just go with the biggest exchange that's available in your country.If you're going to trade the bottom-of-the-barrel shitcoins, then you're going to need to go with the kuCoin's and Gate.io's.yes Mate i totally agreed with you we have many choice to pick exchanges which most high trustable exchange (Binance , Kucoin , Bitget , Gate etc ) to give us all comforts to make simple way trades and gives us user friendly experience",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "November 19, 2023, 10:01:25 AM",
      "body": "Quote from: JamesDaniel90 on November 19, 2023, 08:35:25 AMLike I said I am not looking at trading to make a big return and if I start with $200 will be happy if I can turn that into $1k to then invest the profits in my long term position. Alliance block I mentioned above has pumped even more and done over 55% now in less than 24 hours so had I put my $200 in when I thought I would now be over $300 in less then a day. The plan would then be to put that $300+ into another coin that yet to pump, wait for it to go up then repeat till i reach $1k so it is swing trading I am thinking of. You think and say very simply but in reality completely different. Every time you think about turning $200 into $300 and $300 into $1000 you will never be able to do it if you actually want to do it. Everyone thinks like you and by participating in trading platforms with your thoughts, at some point it becomes difficult for many to return with the original balance. In some cases people lose their original balance. But I want to tell you that if you are very skilled in trading then you can do trading and if you are less qualified then avoid trading because at any moment your trading can be damaged.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "November 19, 2023, 10:36:21 AM",
      "body": "If you just want to get started, there are many Exchanges to choose from. Binance is the most popular trading place.But the question is, do you already have good trading knowledge so you feel very confident that you can get a profit with the $200. At first, you are just a Holder and want to try trading.It can be risky if you don't have the basics. It's not easy to grow a profit with just $200, let alone you make quick trades.Plan to make extra money with $200 capital, it could be the start of you losing $200, and you lose some of your long-term investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}