{
  "id": "topic_5429749",
  "title": "Coinflip256x",
  "author": "Coinflip256x",
  "created_time": "December 17, 2022, 02:24:05 PM",
  "content": "i recently installed electrum on my ubuntu machine. every time i opened the wallet i got the following error displayed:WARNING: CPU random generator seem to be failing, disabling hardware random number generationWARNING: RDRND generated: 0xffffffff 0xffffffff 0xffffffff 0xffffffffafter some research i found the problem. RDRND always returned the same \"random\" number. A BIOS update fixed the problem and i dont get this error anymoremy question:i have created a few wallets while the error was present. does this mean i have created unsecure privatekeys because RDRND was broken? When or for what does electrum use RDRND?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429749",
  "comments": [
    {
      "author": "nc50lc",
      "created_time": "December 17, 2022, 03:52:38 PM",
      "body": "It's good since Electrum uses your OS's RNG which has more sources than just your CPU's RNG.For reference, read this thread; the new replies are relevant as well: /index.php?topic=167276.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "December 18, 2022, 11:41:21 PM",
      "body": "Quote from: Coinflip256x on December 17, 2022, 02:24:05 PMi have created a few wallets while the error was present. does this mean i have created unsecure privatekeys because RDRND was broken? When or for what does electrum use RDRND?It depends on how you created your wallet even without the warning issue it should be secured unless your PC/Device is infected. I do recommend if you are generating a wallet with Electrum make sure your PC/device is disconnected from the internet to avoid leaks and make sure you have the backup seed for future recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 19, 2022, 09:28:31 AM",
      "body": "I remember coming across this bug before. Here's an interesting arstechnica article about it: https://arstechnica.com/gadgets/2019/10/how-a-months-old-amd-microcode-bug-destroyed-my-weekend/Quote from: BitMaxz on December 18, 2022, 11:41:21 PMI do recommend if you are generating a wallet with Electrum make sure your PC/device is disconnected from the internet to avoid leaksTurning off the internet for 5 minutes while you create a new wallet, on a machine which is otherwise connected to the internet all the time and will immediately be reconnected to the internet after the wallet is created, achieves next to nothing other than a false sense of security. Any malware which is capable of manipulating your entropy or seed phrase generation will work just fine with or without an internet connection, and any malware which is grabbing your screen or logging your key presses in order to steal your seed phrase will quite happily just store what it grabs in memory and transmit it home as soon as your internet connection is reestablished.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 20, 2022, 09:42:06 AM",
      "body": "Quote from: nc50lc on December 17, 2022, 03:52:38 PMIt's good since Electrum uses your OS's RNG which has more sources than just your CPU's RNG. Since Electrum relies on the OS's random number generator, why does the software even warn the user that there is a problem with the RNG of the CPU? Better yet, why would Electrum even check and care about my CPU's RNG if it isn't going to use it at least to some degree? Judging by what was explained previously by Abdussamad and others, Electrum can produce an unlimited number of RNs. But there most surely be a backup plan where the software has to use your hardware's RNG if it sees that something is wrong with your OS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "December 20, 2022, 11:35:08 AM",
      "body": "Quote from: Pmalek on December 20, 2022, 09:42:06 AMQuote from: nc50lc on December 17, 2022, 03:52:38 PMIt's good since Electrum uses your OS's RNG which has more sources than just your CPU's RNG. Since Electrum relies on the OS's random number generator, why does the software even warn the user that there is a problem with the RNG of the CPU? -snip-I believe the warning is announced by his OS, not Electrum since I can't find that error in Electrum's code.It's being displayed when opening Electrum because of Electrum's reliance on its RNG generator which may be affected by the CPU RNG issue if it's used as an entropy source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 20, 2022, 12:13:07 PM",
      "body": "Yeah - this is not an Electrum bug. It is a bug with the BIOS and the error message would appear directly in the terminal when you try to launch Electrum, not in Electrum itself. OP would have received this error message on launching lots of different software from the terminal, not just Electrum.Here is a screenshot from another user experiencing the same bug with entirely unrelated software - https://www.reddit.com/r/AMDHelp/comments/itfgf4/cpu_random_generator_seem_to_be_failing/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coinflip256x",
      "created_time": "December 30, 2022, 10:21:52 AM",
      "body": "Quote from: o_e_l_e_o on December 20, 2022, 12:13:07 PMYeah - this is not an Electrum bug. It is a bug with the BIOS and the error message would appear directly in the terminal when you try to launch Electrum, not in Electrum itself. OP would have received this error message on launching lots of different software from the terminal, not just Electrum.Here is a screenshot from another user experiencing the same bug with entirely unrelated software - https://www.reddit.com/r/AMDHelp/comments/itfgf4/cpu_random_generator_seem_to_be_failing/Thats correct, the message appeared directly in the terminal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}