{
  "id": "topic_5457839",
  "title": "uche6215",
  "author": "uche6215",
  "created_time": "June 28, 2023, 06:44:27 AM",
  "content": "Reviving Luna ClassicI am dropping it here because it is just for information to all the users. Mostly for those who not heard the return of Terra Luna. Terra Luna a token in the Cryptocurrency Ecosystem collapsed last year May and the co founders were jailed, the co founder was given 4 month jail term. In the month of April, the programmers came up with new idea to relaunched the coin and they call themselves  “Six Samurai.\" The rebranded name is \"Terra Classic\"Six Samurai: Anonymous Developers Seek to Revive Terra Classic Ecosystem",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457839",
  "comments": [
    {
      "author": "Cvetik56",
      "created_time": "June 28, 2023, 07:18:31 AM",
      "body": "Yeah, I've heard about it. I didn't think anyone cared, who would trust them after all that's happened?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "June 28, 2023, 07:23:46 AM",
      "body": "I don't believe in revivals. Sorry. And I also don't believe that investors will be back because the damage was already done. It's like a scar that won't heal that easily, trust rating is so down that they might not get a good investor to risk their money. And even if they try to hype it on social media, it will just be ignored especially those who really bought it before and put their trust in it. Another reality, in my experience, is that no cryptocurrency that once fell just like Luna did came back strong. It's better to just get over it and find another project in which you have a higher chance to gain profits. It sure has its potential and even hit the trend back when it was so hot in the market but it's gone and reviving it is \"pointless\" for me. My suggestion is they try to rebrand and create something fresh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "June 28, 2023, 07:34:31 AM",
      "body": "I'd advise you move this to the Altcoin board as it will be better suited there.  Personally, I've been expecting some of Do Kwon's faithfuls to come up with this idea for a while now and this group posing as the \"six samurai\" should just look for something else to do with their time. Granted, the token has a potential for survival with the burn mechanism proposed by the devs and also the attempt by whales to keep it's price above $0.0002 ,  but its market value is very low and is predicted to go lower since adoption is also low as well so it's best to just drop it all together.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "June 28, 2023, 07:46:12 AM",
      "body": "It was called Luna before, the coin had hard fuck and the fuck was called Luna while the original coin now called Lunc which is Luna Classic. I checked the marketcap for Lunc now and it has over $500 million marketcap which is not something small at all. So what are some people called Six Samurai trying to do with anything about Luna Classic again than a way to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "June 28, 2023, 08:00:58 AM",
      "body": "Do they want to restore the community they disappointed last year?Who will believe that they will not be dust anymore? And the point is who cares about the fraudsters?Sorry, maybe there is a frustration in me.Logically, when a company that is bankrupt and harming many parties then plans to grow back with all its renewal in its project it will be very difficult to gain trust, in the business world to develop good cooperation is to maintain trust, both partners and customers.Keep in mind that even though they present their project as well as their projects, if in history there are dark stains, stains remain stains, and it will not disappear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "June 28, 2023, 08:02:11 AM",
      "body": "Are they going to pump/dump them?This is not something I have much interest in in this market, it's really dead in my mind, however there are still some people/teams who still like the hype around it to create fomo and deliver. more liquidity for those who are holding it.Recently, if I remember correctly, Do Kwon was sentenced to prison, still the question people still believe him or not? And is this project worth investing in the pump/dump games in the market?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "June 28, 2023, 08:32:06 AM",
      "body": "The reason why the developer is really like to change the name is to make people forget about the failure of Luna and convince people to buy this coin. But it's not as easy as that because people aren't that stupid to buy the coin from failed project.We can check the price of Terra Classic USD [1] or Terra Classic [2] the price of both coins are still stay at the lowest, there's no such return.[1] https://coinmarketcap.com/currencies/terrausd/[2] https://coinmarketcap.com/currencies/terra-luna/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "June 28, 2023, 08:58:23 AM",
      "body": "Quote from: Cvetik56 on June 28, 2023, 07:18:31 AMYeah, I've heard about it. I didn't think anyone cared, who would trust them after all that's happened?Yeah, the old saying is very apt here, once bitten twice shy. I don’t think this will go well for people who decide to invest. There may be a fake pump, dead cat type situation but after what happened with the OG LUNA, where so many people lost so much money, this has no long term future of success & growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "June 28, 2023, 10:05:55 AM",
      "body": "I don't think it's really true if you want a new project that will gain a lot trust of people, you must keep away from the projects that got a history of fraud which is, for example, the Terra Luna things, we all know what happened.It will be difficult to gain the trust of people again. It's a bad move unless some of them are still associate with part of Terra Luna.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 28, 2023, 10:11:38 AM",
      "body": "When Terra Luna first emerged, the main idea was for it to be a currency to support the stability of its stablecoin by using Bitcoin. This project failed, and thus was the end of the idea and the end of Terra Luna. Terra Luna Classic was created as a solution to the problem, which is to be a stable currency away from the attempt to stabilize the stablecoin, and thus lost the main reason for the project and from which it became the same as any altcoin, and therefore the best thing you will get is a pump-and-dump currency.Whoever tries to promote the return of that coin is supporting a pump-and-dump scam coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "June 28, 2023, 12:17:41 PM",
      "body": "I think it's over for Terra, and every project that is associated with it.Although we might see some good price action, it's obvious that it is just for pure pump and dump. They have lost all the trust already, and it's supposedly leader is in jail right now.So why we should trust this project again, and why someone is shilling for it? obviously, we all know the answer to that.Sorry OP, I wouldn't put any investment regardless of what innovation they are supposedly going to offer in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "June 28, 2023, 03:08:03 PM",
      "body": "I am not sure why the “Six Samurai\" group is wasting time on this, why would anyone waste time on rebranding one big scam project? That sounds ridiculous. Except if they are working on some quick scam, that would make sense. Because Terra Luna Classic's fate is sealed, so what this group of programmers is doing is a bit confusing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 28, 2023, 03:35:40 PM",
      "body": "Should they still have the gods to return back to cryptocurrency and present us with another fake project in other to recover the most from their first incidenced consequences, if you think tou can afford the risk then you may go ahead investing but one thing i have learnt from this forum in this aspect is if you have ones broken the rules and gets banned, they will always ensure to avoid any related activities that had to do with you again on the forum, i don't expect people to accept them back again after their evil deeds, it will not be funny seeing them going crazy again should incase things turns out the unexpected way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "June 28, 2023, 03:52:45 PM",
      "body": "It's dead token. It doesn't even matter how hard any parties are trying to revive it and it will not happen. People have lost their trust on this shit. What's next? it's another garbage plan by anonymous developer to grab money. LunaLuna classicnew luna six samurai? Another garbage plan to rebrand shit scam token that have been scamming thousands of people in the world. It will not work. The best thing to tell do known to return all of money that already lost during the terra luna dump last year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "June 28, 2023, 03:54:31 PM",
      "body": "Nope. I don't think it will be a good comeback to them no matter what offer they will do to the public. Even if they fixed their old problem which cause the crash, I don't think that the public will still invest in it after the past incident happened. So many people lost their money on it and it is a very miserable trauma for someone. I believe that it is smarter to re-brand it and not be affiliated with tokens that are well known due to it's massive failure. I just don't think it's a good idea to invest or to revive a failed project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Magic-Money",
      "created_time": "June 28, 2023, 06:03:38 PM",
      "body": "These project has made many investor's to loose they heard earn money as a result of long term holding investment both the Luna stable coin clash at the same time, well it we take time for old investors to trust on this project, but nevertheless new investors can come in as well, because cryptocurrency market is the one of the largest market in the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "June 28, 2023, 07:33:14 PM",
      "body": "This is a long shot, luna reputation has been soiled so bad that I highly doubt there is anyway to revive it back to the way it was. This is a lost cause and a waste of time for those devs. They should rather focus on introducing a bang project that will make users forget all about luna.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "June 28, 2023, 09:01:51 PM",
      "body": "Quote from: Bitstar_coin on June 28, 2023, 07:33:14 PMThis is a long shot, luna reputation has been soiled so bad that I highly doubt there is anyway to revive it back to the way it was. This is a lost cause and a waste of time for those devs. They should rather focus on introducing a bang project that will make users forget all about luna.Trust will never be the same but if LUNA is able to create a better platform and a good one, most probably the hype will happen and investors will come again to them. Let’s not get hyped by this news, let’s see if they are more serious right now and whatever the name of the project is, they should focus more on making it a good one or else they will just be the dame old failed LUNA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "June 28, 2023, 09:28:02 PM",
      "body": "I don't think it catches attention again knowing its history of a big scam that the team does, nobody will be able to take the risk and lose their money. Instead, they will just ignore them no matter what they have offered. It was enough that the team give losses to the investors in the past and I believe that most of us have learned already which gives me confidence that nobody will fall into this project again. Perhaps, they don't have a reason to come back, I think if they want, then better to use another name for the project, not Terra Luna otherwise, they will still fail to convince people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}