{
  "id": "topic_5436340",
  "title": "TryNinja",
  "author": "TryNinja",
  "created_time": "January 22, 2023, 10:09:59 AM",
  "content": "A Silverbank foi a primeira parceira bancária da Binance e a única de várias exchanges para conectar o sistema bancário dos Estados Unidos (SWIFT) com o mercado crypto.Agora eles anunciaram que estão limitando as transações relacionadas a crypto, somente permitindo depósitos e saques acima de $100k. Isso quebra as pernas de várias exchanges que usavam o banco para processar os saques e depósitos de seus clientes via transferências bancárias.https://twitter.com/tier10k/status/1616953428466622466Entre os seus clientes estão: Binance, Kraken, Huobi, Bitstamp, Bithumb, OKX, Nexo, eToro…Se o Signature Bank, outro maior parceiro das exchanges, fizer o mesmo, é capaz do mercado ficar isolado do sistema do Dólar.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436340",
  "comments": [
    {
      "author": "Disruptivas",
      "created_time": "January 22, 2023, 10:38:06 AM",
      "body": "Quote from: TryNinja on January 22, 2023, 10:09:59 AMSomente permitindo depósitos e saques acima de $100k.Entre os seus clientes estão: Binance, Kraken, Huobi, Bitstamp, Bithumb, OKX, Nexo, eToro…Se o Signature Bank, outro maior parceiro das exchanges, fizer o mesmo, é capaz do mercado ficar isolado do sistema do Dólar.Acima de $100K? Caramba, será que isso não viola alguma lei de alguma forma? É um processo de favorecimento e prestação de serviço só pra quem é ''rico'' e completa limitação do serviço para grande parte das pessoas. Duas coisas que me vieram a mente, a primeira é que talvez - no longo prazo- seja bom isso, considerando que de qualquer forma, todos esses players  - que se somandos são o setor inteiro- seja um momento interessante para diversificação dos players, não? Acredito que vão existir outros parceiros comerciais interessados em ficar com o que o Silverbank não quer. É esse banco envolvido naquelas polemicas da lavagem de dinheiro bilionária?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexrossi",
      "created_time": "January 22, 2023, 12:02:03 PM",
      "body": "Quote from: Disruptivas on January 22, 2023, 10:38:06 AMDuas coisas que me vieram a mente, a primeira é que talvez - no longo prazo- seja bom isso, considerando que de qualquer forma, todos esses players  - que se somandos são o setor inteiro- seja um momento interessante para diversificação dos players, não? Acredito que vão existir outros parceiros comerciais interessados em ficar com o que o Silverbank não quer. Se nascerem outros players que vao abranger a galera de menos de 100k, acho que não vai ser um grande problema. Acredito que seja muito uma questão de diminuir o tamanho da risk Analysis e KYC, para, por ex. ter um so cliente que precisa ser analisado com deposito de 100k em vez de 50 pessoas que depositam 2k. O tempo gasto em alguns procedimentos è o mesmo independente do valor.Lembro que uma exchange italiana, The rock trading, no auge do pump de alguns anos atras limitou os novos cadastros, alegando uma razão desse tipo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "January 22, 2023, 09:02:24 PM",
      "body": "Eu só fico pensando que esses motivos não podem ser outros além de terem medo das criptos e não querem fortalecer o sistema todo, querendo dificultar ao máximo qualquer ponte.Os bancos sempre alegam que querem diminuir a exposição aos riscos das criptos, fraudes, lavagem de dinheiro etc, mas isso é resolvido com eles trabalhando somente com exchanges legalizadas, pois aí qualquer problema que possam alegar ou ser acusados, seria responsabilidade da exchange. Mas vejo nisso aí tudo a falta de vontade de querer facilitar com as criptos mesmo.Mas sempre podem surgir novas empresas que irão querer abocanhar a fatia deixada pelo mercado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "January 23, 2023, 02:10:34 PM",
      "body": "Quote from: Disruptivas on January 22, 2023, 10:38:06 AMAcima de $100K? Caramba, será que isso não viola alguma lei de alguma forma? É um processo de favorecimento e prestação de serviço só pra quem é ''rico'' e completa limitação do serviço para grande parte das pessoas. Deve ser possível mandar 100k ou 1 milhão para outra conta e depois só repassar. Nao me parece ser grande limitação, a principio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 25, 2023, 09:22:43 PM",
      "body": "Eu acho que isso é fruto da situação atual do mercado.Quando o Bitcoin começa a valorizar, todos querem entrar no barco e ganhar dinheiro. Porque também começa a envolver muito dinheiro. Por sua vez, quando o mercado desvaloriza, e entram aquelas ideias de esquemas, pirâmides e afins, todos se querem distanciar.Enfim, quando o Bitcoin voltar para os 60k ou mais, vão ver essa malta a voltar toda outra vez.No imediato, acho que haverão outras alternativas, que fazem com que estas medidas não criem um grande impacto no mercado. Claro que pode dificultar a vida algumas exchanges, mas as grandes não. A Binance e afins, tem muitas alternativas e não usavam só um banco.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 26, 2023, 09:22:00 PM",
      "body": "Quote from: joker_josue on January 25, 2023, 09:22:43 PMNo imediato, acho que haverão outras alternativas, que fazem com que estas medidas não criem um grande impacto no mercado. Claro que pode dificultar a vida algumas exchanges, mas as grandes não. A Binance e afins, tem muitas alternativas e não usavam só um banco.Na verdade a Binance já anunciou que os saques e depósitos em USD só serão processados com um mínimo de $100k. Foi exatamente ela que anunciou que o banco implementou essas limitações. Eles disseram que estão atrás de outro parceiro para burlar essa situação, então por ora é torcer para ter outro banco mais amigável no mercado.Se liga na mensagem: https://twitter.com/mikeburgersburg/status/1616901701927059457?s=46&t=V2iCrCSagc7CHqEsR3EhZw",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 27, 2023, 07:56:06 AM",
      "body": "Quote from: TryNinja on January 26, 2023, 09:22:00 PMNa verdade a Binance já anunciou que os saques e depósitos em USD só serão processados com um mínimo de $100k. Foi exatamente ela que anunciou que o banco implementou essas limitações. Eles disseram que estão atrás de outro parceiro para burlar essa situação, então por ora é torcer para ter outro banco mais amigável no mercado.Bem, pensava que eles já trabalhavam com vários bancos.  Eles já sofrerem varias situações parecidas em vários países, deviam ter aprendido. Assim que me lembre, foi no Reino Unido, foi no Brasil, e agora nos EUA/USD.Em vez de trabalhar só com um parceiro, terem vários parceiros. Claro que com vários parceiros, não vão ter presos tão bons, porque dividem o volume das transações por vários, mas ficam mais protegidos no caso de um parceiro sair.Com isto, quem negoceia P2P é que vai ganhar mais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "January 27, 2023, 12:48:13 PM",
      "body": "Quote from: joker_josue on January 27, 2023, 07:56:06 AMEm vez de trabalhar só com um parceiro, terem vários parceiros. Claro que com vários parceiros, não vão ter presos tão bons, porque dividem o volume das transações por vários, mas ficam mais protegidos no caso de um parceiro sair.Você fala como se eles quisessem ter só um parceiro, mas a verdade é que é dificil achar bancos que aceitem processar esses pagamentos envolvendo crypto sem impor uma chuva de demandas de controle. A Binance já deve ter lucrado bastante permitindo em silêncio que usuários mal intencionados e lavadores de dinheiro utilizem sua corretora como ponte para receber o dinheiro sujo, então é natural que eles busquem os parceiros mais crypto-friendlies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "January 27, 2023, 02:59:42 PM",
      "body": "Quote from: TryNinja on January 27, 2023, 12:48:13 PMVocê fala como se eles quisessem ter só um parceiro, mas a verdade é que é dificil achar bancos que aceitem processar esses pagamentos envolvendo crypto sem impor uma chuva de demandas de controle. A Binance já deve ter lucrado bastante permitindo em silêncio que usuários mal intencionados e lavadores de dinheiro utilizem sua corretora como ponte para receber o dinheiro sujo, então é natural que eles busquem os parceiros mais crypto-friendlies.Pois... também é verdade. A banca não tem facilitado, quer seja grande ou pequena.Mas, eles vão mesmo ter de criar uma solução, porque se a banca percebe que a Binance esta refém disso, ainda vai ser mais complicado.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "February 04, 2023, 01:55:36 PM",
      "body": "Hoje me deparei com outra notícia dessas:QuoteO Nationwide, um dos maiores bancos do Reino Unido, anunciou uma restrição aos pagamentos com cartão para a Binance, a maior corretora de criptomoedas do mundo.“Pagamentos para a empresa de criptomoedas Binance com cartões da Nationwide serão recusados”, disse o banco.“Mesmo com seu consentimento direto pessoalmente ou por telefone, não podemos remover a restrição e permitir que você faça um pagamento à Binance.”Os bancos sempre querem proteger os \"usuários\"  Fonte: https://livecoins.com.br/mais-um-banco-proibe-transferencias-para-a-binance/Essa é menos impactante que o Silverbank, sem dúvidas, além de ser no Reino Unido, parece que por lá as regras são bem mais rígidas do que os outros países.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "February 04, 2023, 02:59:27 PM",
      "body": "Quote from: rdluffy on February 04, 2023, 01:55:36 PMHoje me deparei com outra notícia dessas:QuoteO Nationwide, um dos maiores bancos do Reino Unido, anunciou uma restrição aos pagamentos com cartão para a Binance, a maior corretora de criptomoedas do mundo.“Pagamentos para a empresa de criptomoedas Binance com cartões da Nationwide serão recusados”, disse o banco.“Mesmo com seu consentimento direto pessoalmente ou por telefone, não podemos remover a restrição e permitir que você faça um pagamento à Binance.”Os bancos sempre querem proteger os \"usuários\"  Fonte: https://livecoins.com.br/mais-um-banco-proibe-transferencias-para-a-binance/Essa é menos impactante que o Silverbank, sem dúvidas, além de ser no Reino Unido, parece que por lá as regras são bem mais rígidas do que os outros países.Pois é. Por isso que o bitcoin existe. PermitionlessNesse caso, você precisa permissão do banco para gastar seu dinheiro.  E essa permissão pode ser negada, simplesmente pq o banco prefere que você não use seu dinheiro com isso.A adoção do bitcoin é inevitável.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 04, 2023, 04:36:24 PM",
      "body": "Quote from: rdluffy on February 04, 2023, 01:55:36 PMEssa é menos impactante que o Silverbank, sem dúvidas, além de ser no Reino Unido, parece que por lá as regras são bem mais rígidas do que os outros países.A guerra entre a Binance e o Reino Unido já vai longa.Já não é a primeira vez que eles tem problemas a operar no Reino Unido.A politica económica do Reino Unido sempre foi muito protecionais da sua moeda, agora ainda mais com o Brexit, que vez eles serem abalados como nunca tinham sido depois da segunda guerra mundial. Então, todo os modelos de negocio que possam por em causa a Libra, eles tentam restringir ou criar limitações. Até o Revolut já teve complicações no Reino Unido.Vamos ver até quando.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "February 04, 2023, 07:49:08 PM",
      "body": "Quote from: bitmover on February 04, 2023, 02:59:27 PMPois é. Por isso que o bitcoin existe. PermitionlessNesse caso, você precisa permissão do banco para gastar seu dinheiro.  E essa permissão pode ser negada, simplesmente pq o banco prefere que você não use seu dinheiro com isso.A adoção do bitcoin é inevitável. Verdade, no fim das contas essas medidas acabam ajudando a adoção do Bitcoin no longo prazo, esse papo de proteger os usuários já não cola mais.Torcer para mais pessoas acordarem e perceberem o quão necessário o BTC é e será se quisremos um dinheiro que seja de nossa propriedade.Quote from: joker_josue on February 04, 2023, 04:36:24 PMA guerra entre a Binance e o Reino Unido já vai longa.Já não é a primeira vez que eles tem problemas a operar no Reino Unido.A politica económica do Reino Unido sempre foi muito protecionais da sua moeda, agora ainda mais com o Brexit, que vez eles serem abalados como nunca tinham sido depois da segunda guerra mundial. Então, todo os modelos de negocio que possam por em causa a Libra, eles tentam restringir ou criar limitações. Até o Revolut já teve complicações no Reino Unido.Vamos ver até quando.O Reino Unido é um caso mais a parte mesmo, acredito que em breve eles lancem alguma \"regulação\" sobre as criptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "February 06, 2023, 05:29:13 PM",
      "body": "É oficial: a Binance está suspendendo as transferências bancárias com USD (depósitos e saques) enquanto procura por um novo parceiro. https://twitter.com/tier10k/status/1622631932101120001O que acontece se eles não acharem outro parceiro disposto a colocar o pé nesse mundo suspeito?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "February 06, 2023, 05:48:35 PM",
      "body": "Quote from: TryNinja on February 06, 2023, 05:29:13 PMÉ oficial: a Binance está suspendendo as transferências bancárias com USD (depósitos e saques) enquanto procura por um novo parceiro. https://twitter.com/tier10k/status/1622631932101120001O que acontece se eles não acharem outro parceiro disposto a colocar o pé nesse mundo suspeito?Impressionante a maior exchange do mundo, com tantos serviços e tendo que suspender saques em USD.Acredito que devam conseguir parceiros sim, mas toda esse terreno \"cinza\" da Binance não ajuda muito nesse sentido, sendo bem diferente de uma Coinbase por exemplo.Sem pesquisar no Google, alguém sabe responder onde é a sede da Binance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "February 06, 2023, 05:51:57 PM",
      "body": "Quote from: rdluffy on February 06, 2023, 05:48:35 PMSem pesquisar no Google, alguém sabe responder onde é a sede da Binance?    Acredito que eles não tenham uma sede. Só um aglomerado de funcionários em diversos países e escritorios ou divisões focadas em atender mercados locais (i.e suporte em pt e equipe para se regulamentar com foco no mercado brasileiro)Mas já ouvi que a Binance planejava fazer algo em Dubai devido às regulamentações mais amigáveis?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "February 06, 2023, 06:10:10 PM",
      "body": "Quote from: TryNinja on February 06, 2023, 05:29:13 PMO que acontece se eles não acharem outro parceiro disposto a colocar o pé nesse mundo suspeito?Se ficar assim durante algum tempo, vai motivar o aumento do valor Bitcoin, visto que a malta vai virar-se para o P2P.Alias foi isso o que aconteceu, quase ao mesmo tempo que foi feito o anuncio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "February 06, 2023, 07:16:51 PM",
      "body": "Quote from: TryNinja on February 06, 2023, 05:51:57 PMAcredito que eles não tenham uma sede. Só um aglomerado de funcionários em diversos países e escritorios ou divisões focadas em atender mercados locais (i.e suporte em pt e equipe para se regulamentar com foco no mercado brasileiro)Mas já ouvi que a Binance planejava fazer algo em Dubai devido às regulamentações mais amigáveis?Pois é, ninguém sabe  É tudo dividido nos escritórios locais.Se você pesquisar vai ver que tem menções para os \"headquarters\" sendo nas Ilhas Cayman, Seicheles ou Malta.Essa de Dubai eu não sabia e acho curioso nos dias de hoje com tanto acesso à informação, que não tenha um consenso ou um esclarecimento maior sobre.O CZ já falou algumas vezes que se o BTC não tem sede, a Binance também não precisa de uma",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}