{
  "id": "topic_5398344",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "May 12, 2022, 04:09:38 PM",
  "content": "En múltiples ocasiones, y sobre todo cuando el contravalor del BTC desciende notablemente, he observado que suele repetirse la frase de que \"un bitcoin es un bitcoin\". La frase se desprende de la idea de que, si tienes una cantidad de BTCs determinada, la seguirás teniendo, con independencia de lo que haga su contravalor en las distintas divisas fiat. Siendo literales, es cierto.Lo anterior, no obstante, en mi opinión, es una visión demasiado maximalista, que desatiende la vertiente fundamental: el poder de compra del bitcoin. Está claro que si BTC baja en picado (*), su poder de compra sea de manera directa, o a través de una conversión a fiat, se va a ver mermado, luego si introducimos la variable tiempo en la ecuación, deja de ser que un bitcoin es un bitcoin en el tiempo bajo este prisma, que creo que es el que cuenta. Al fin y al cabo, no nos conformamos con pensar que un dólar es un dólar (y no te digo un peso) …¿Cómo lo veis?(*) análogo en caso inverso de subida abrupta",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398344",
  "comments": [
    {
      "author": "womanderful",
      "created_time": "May 12, 2022, 04:37:01 PM",
      "body": "Quote from: DdmrDdmr on May 12, 2022, 04:09:38 PM\"un bitcoin es un bitcoin\"¿Cómo lo veis?Yo en estos casos pienso en la base de la pirámide de Maslow.Es cierto que un bitcoin es un bitcoin, y el mercado se descalabra y cada cual sigue teniendo su saldo en bitcoin intacto. También puedo tener manzanas en casa, y una cama, y el mercado ahí fuera puede sufrir turbulencias y mi saldo en manzanas y en camas queda intacto.Sin embargo, la manzana me quita el hambre y la cama me permite descansar cómodamente, pero el bitcoin no me da ni una cosa ni la otra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "May 12, 2022, 07:36:32 PM",
      "body": "Es relativo  Un bitcoin es un bitcoin de lunes a sábado, los domingos son una falacia.    -/en mi caso/-",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dominguero",
      "created_time": "May 13, 2022, 12:33:49 PM",
      "body": "Es una falacia o no, dependiendo de como entiendas la frase.En mi caso, lo que entiendo, es que en relación a la oferta monetaria total, un BTC, siempre será, a lo sumo, una veintiún millonésima parte del total. Es decir el valor del mismo en relación al total es invariable. No se ira devaluando debido a un aumento de la emisión, aunque si podrá hacerlo si lo comparas con otra divisa.Eso es algo muy evidente cuando se estudia el aumento de su precio después de cada halving, que es tanto por la menor emisión por cada bloque, como por la certeza que quedan menos BTC por \"repartir\".¿Entonces, se podría decir que un Monero es un Monero?... pues lo mismo... depende de como lo entiendas.Al tener una emisión \"infinita\" pues no se puede entender de la misma forma que con BTC, pero si se mira su fungibilidad pues sí... (cosa que el BTC en principio no cumple).Es decir, depende del contexto, y del sentido que quieras darle. Aunque a mi parecer, en tanto que hablemos de BTC, cuando se dice esa frase, se suele hacer referencia a lo limitada de su emisión para contraponerlo con la inflación brutal, generalizada, inconstante del Fiat, que empobrece a la población y penaliza el ahorro.En comparación la emisión de cola de Monero, o inclusa en una moneda como GRIN con emisión constante e infinita, es una bendición, pues a la larga no solo se va reduciendo (en proporción al total) sino que no es arbitraria u obedece a intereses... que es el gran problema del Fiat, y la razón (entro otras) de la creación y existencia del BTC y cia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danadc",
      "created_time": "May 15, 2022, 09:13:55 PM",
      "body": "Bueno falacia lo veo desde el punto de vista de cada persona como lo quiera interpretar,en un momento las personas que tienen BTC les gusta ver o escuchar esta afirmación,pues sienten algo de alivio al momento que el BTC cae de precio, lo veo como una forma de consolación.Basado en esto no me gusta ver el precio de BTC caer,no tengo BTC pero algun dia me gustaria tener uno para sentir ese gran poder.Esto es pasajero,se sobreentiende que el BTC subirá y cuando haga un buen movimiento al alza estoy segura que tendra el precio más alto que el máximo anterior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 15, 2022, 11:04:30 PM",
      "body": "Ese mantra lo he escuchado antes, sí.Pero yo personalmente le he dado una interpretación diferente:Recordemos que en la mayoría de los casos, cuando Bitcoin cae de forma considerable, le siguen las alt-coins detrás. En mercados bajistas es posible que los inversionistas más novatos cuestionen su inversión (en especial si no ha digerido los fundamentos detrás de la existencia de la mayoría de las criptomonedas serias), en ese caso, como consuelo o como \"cope\" surge el mantra:\"Un Bitcoin es un Bitcoin\"No para la comparación exclusiva contra las monedas FIAT, sino por el pensamiento de muchos de que unos pocos satoshis valen más de un millon de shitcoins (de forma filosófica y económica). Yo atribuyo esta forma de pensár a las ocasiones en los cuales debido a un fuerme mercado bajista, muchos proyectos murieron o no soportaron la presión de los mercados, quedando relegados como shitcoins permanentes, mientras de Bitcoin incluso de un mercado bajista de ese tipo, es muy poco probable, en comparación que sufra un destino similar.Esa es la intrepretación que le doy al mantre y personalmente no creo que sea erroneo, si se ve de esa manera.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darxiaomi",
      "created_time": "May 15, 2022, 11:15:25 PM",
      "body": "Yo creo que el problema viene desde que el hombre es hombre e hizo el primer trueque, realizo la primera comparacion y deseo algo.Cualquier cosa puede ser objetada desde ese punto de vista.De hecho aca(en Argentina) existe la famosa expresion , \"invertir en ladrillo\" (el comprar una propiedad) como la unica inversion segura y que siempre va estar por considerarlo una casa/propiedad. Porque un millon de dolares no es un millon de dolares.Pero el ladrillo es siempre ladrillo? y la realidad es que no tambien baja y sube de precio y tampoco se puede comer. Por eso digo que es un problema intrinseco al ser humano desde sus comienzos en el comercio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "womanderful",
      "created_time": "May 16, 2022, 03:07:17 PM",
      "body": "Quote from: darxiaomi on May 15, 2022, 11:15:25 PMDe hecho aca(en Argentina) existe la famosa expresion , \"invertir en ladrillo\" (el comprar una propiedad) como la unica inversion segura y que siempre va estar por considerarlo una casa/propiedad. Porque un millon de dolares no es un millon de dolares.Pero el ladrillo es siempre ladrillo? y la realidad es que no tambien baja y sube de precio y tampoco se puede comer.En España también \"invertimos en ladrillo\", un activo seguro que siempre vale más… hasta que llegó el 2008 A mi modo de verlo, un ladrillo también es siempre un ladrillo porque, aunque no se puede comer, sí cumple otra necesidad básica de la pirámide de Maslow. Lo dejé fuera en mi mensaje porque, obviamente, no es lo mismo comprar una manzana que una casa…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LUCKMCFLY",
      "created_time": "May 16, 2022, 04:31:39 PM",
      "body": "La última vez que vi una firmación como esta fué en el hilo de Campaña de Chipmixer, cuando un miembro ajeno a la campaña comenzó a decir que los participantes estaban ganando mucho en aquel momento, que por qué no hacían un reajuste,( Típico de los envidiosos y tóxicos que nos encontramos en el foro) por lo cual, hicieron mover tanto esto que tomaron el pago en Fiat y obviamente lo bajaron.Esto es algo así como tener la claridad de ver la diferencia entre precio y valor, para mi el BTC siempre tendrá un valor, que la diferencia radique con la Ley de Oferta y Demanda es otra cosa, porque cualquier persona que tenga un BTC puede darle un precio de acuerdo a su valor, por ejemplo:Si yo tengo 1BTC y le doy un valor en el mercado de $400k ese es para mi el valor de BTC más no es el precio a pesar que para mi ese es el valor, entonces podría decir que 1BTC=1BTC con ese precio..lo veo como un ejemplo simple de tasación.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "May 16, 2022, 04:53:12 PM",
      "body": "Quote from: LUCKMCFLY on May 16, 2022, 04:31:39 PM<…>Lo curioso es que el cambio en la citada campaña de CM se tornó efectivo el 18/01/2021, cuando BTC estaba en el rango de 35K $ - 36K $. No obstante, no espero un retorno a valores fijos en BTC como estaba antes, a pesar de estar debajo de ese umbral: un máximo de 0,0375 por semana si no recuerdo mal – casi cuatro veces más que ahora mismo.De hecho, pensaba añadir un corolario a la verdad/falacia:Un BTC (en un entorno) con KYC, es distinto a un BTC sin KYC …",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "May 17, 2022, 04:47:19 PMLast edit: May 17, 2022, 05:22:07 PM by Artemis3",
      "body": "Falacia.1 bitcoin son 100 millones de satoshis, el bitcoin no es mas que una unidad de medida, el código unicamente contempla el satoshi.Sobre el poder de compra de bitcoin, está diseñado para aumentar en el tiempo, simplemente por ser emisión limitada. A largo plazo, si que si, cada bitcoin podrá darte mas si lo cambias después. Por supuesto al ser libre de manipulaciones y anclajes (como acabamos de ver en el duo luna/ust) el precio de mercado es honesto y sin promesas vacías hechas por nadie, vale lo que al mundo le parezca, ni mas ni menos (el valor de las cosas es subjetivo, véase: escuela austríaca de economía).Así que si es por el futuro, ese bitcoin te va dar mas riqueza que hoy.También hay otra constante segura y conocida: El \"dinero\" que no es bitcoin va perder poder de compra, a menos que sea una copia fiel o muy cercana a bitcoin (que a su vez está imitando al oro). El dinero fiat es emisión ilimitada al igual que muchas altcoin, y ni hablemos de las \"stable\", les aguarda el mismo destino que luna/ust (ser ilimitada, y anclarse a fiat con reserva fraccionaria, ¿que podría salir mal?)Cosas como el oro que no se consigan mas, pues tienen un comportamiento similar de acumular valor en el tiempo. Pero el oro podría aparecer mas de un asteroide o algo, en cambio bitcoin ya por código está limitado.Cualquiera que ve \"defectos\" a bitcoin, generalmente le acompaña con ideas \"brillantes\" que le arruinan su valor, como la emisión ilimitada o la reversión/discriminación de transacciones cuando se nos antoje (Ethereum).La principal razón por la que el fiat (y lo que se ancle a eso) pierde valor tiene que ver con los pensamientos imperantes en economía, básicamente los monetaristas, keynesianistas y demás. La gente que te pinta un horror a la deflación, esa gente que no se lee a los austríacos y no entiende como funciona una economía en deflación.Lo he dicho muchas veces pero la principal diferencia es que no se endeuda para emprender, se ahorra. Hay mas, claro, hay que leer (o estudiar) la escuela \"austríaca\" para entender un mundo sin dinero chatarra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dominguero",
      "created_time": "May 18, 2022, 09:31:35 AM",
      "body": "Quote from: Artemis3 on May 17, 2022, 04:47:19 PMFalacia.1 bitcoin son 100 millones de satoshis, el bitcoin no es mas que una unidad de medida, el código unicamente contempla el satoshi.El código es la piedra angular de BTC pero que solo existan los satoshis en el mismo, no quiere decir que hablar de 1 BTC como entidad propia sea una falacia, pues al menos a escala humana, es una unidad que tiene mucho sentido, y al fin y al cabo hemos sido los humanos quienes lo hemos creado, y quienes lo usamos, por lo que en mi opinión, es totalmente lícito tratar a un BTC como la unidad básica, aunque el código no diga lo mismo... al fin y al cabo lo importante y lo que define un programa informático, no es su código (más o menos abstracto), sino el uso que le damos.En otro orden de cosas, otro factor que no se ha analizado, es el del POW.Independientemente, de su emisión, de su uso (como reserva de valor, para el comercio, o ambas), de su anonimato... un BTC, y cualquier cripto que nazca de un sistema POW (es decir que la creación de monedas sea exclusivamente por este sistema, sin preminados o leches), tiene un gasto energético asociado equivalente al costo de producción en el momento actual, y por tanto una flecha de tiempo.Es decir, todos los BTC se han producido, de la misma manera, por una prueba de trabajo, no han sido creados de la nada, ni hay nada en el código que permita generar intereses con ellos, aumentar su número o valor de otra manera que el POW.Y de esa forma, al ser todos creados de la misma manera, al tener todos asociadas una flecha de tiempo, y un esfuerzo físico (la electricidad es al fin y al cabo el movimiento de electrones) se puede entender la dichosa frase de \"Un bitcoin es un bitcoin\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "May 19, 2022, 02:26:38 PM",
      "body": "Buena discusión. El eje del \"problema\" creo que es la funcionalidad - existente o no - del Bitcoin como \"unidad de cuenta\" y \"conservación del valor\", dos de las funciones fundamentales del dinero.Mi opinión está más en línea con lo que comentó Artemis3. El sistema Bitcoin es un aglomerado o ecosistema de valor, cuyo valor total está subdividido en las unidades (Bitcoins, satoshis, bits etc.). En tanto una unidad siempre nos asegura un porcentaje igual de este valor total. Mientras que el ecosistema crezca a largo plazo, entonces \"1 bitcoin es 1 bitcoin!\" tiene sentido.En cuanto a la \"conservación del valor\", sin embargo, creo que no deberíamos basarnos solamente en el concepto de la \"escasez\" de los bitcoins. El valor del ecosistema total puede subir o bajar. Hay varios ejemplos de altcoins que son \"más escasos\" que Bitcoin (en el sentido que su oferta total aumenta más lentamente, o directamente es estática) pero su valor hoy en día es cero porque nunca fueron capaces de realmente crear un ecosistema con potencial de crecer. Por eso no creo que sea \"obligatorio\" que el Bitcoin aumente de valor en el largo plazo, como lo postula, por ejemplo, la conocida \"teoría del Stock-to-flow\".Sin embargo si observamos las tendencias reales a largo plazo sí se puede decir que hoy la \"conservación del valor\" funciona, siempre y cuando no nos dejamos llevar por los altibajos del mercado producto de la especulación.Es siempre muy reconfortante observar los Moving Averages con valores de 200 o más (en este caso: SMA-365 y SMA-1000):Se ve que el SMA-1000 siempre creció, por eso con un horizonte de 1000 días (algo menos de 3 años), el valor siempre se conservó. Y que con el horizonte de 365 días las variaciones son tan bajas que podrían provenir de una moneda fiat (ejemplo: las variaciones en la cotización EUR/USD).(Interesante observación: siempre que la cotización cayó debajo del MA-1000 se recuperó pronto.)Fuente: Bitcoincharts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}