{
  "id": "topic_5404322",
  "title": "FMCPAY_GLOBAL",
  "author": "FMCPAY_GLOBAL",
  "created_time": "June 28, 2022, 07:27:44 AM",
  "content": "United States Securities and Exchange Commission Chair Gary Gensler riled up Crypto Twitter on Monday after affirming that Bitcoin (BTC) is a commodity. Questions were raised about its impact on Grayscales’ proposed Bitcoin exchange-traded fund (ETF) and why Ether (ETH) wasn’t mentioned.Nevertheless, Gensler’s views on Bitcoin have been seen as a positive for the king of crypto.Bitcoin bull Michael Saylor shared the video to his 2.5 million Twitter followers, adding that Bitcoin is essential as a treasury reserve asset, which will allow governments and institutions to support it as a digital asset to grow the economy.Interestingly, the positive news for Bitcoin resulted in another price decline, falling from a 24-hour high of $21,478 to $20,635 at the time of writing.(Source: Cointelegraph)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5404322",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "June 28, 2022, 07:52:44 AM",
      "body": "Nice news to read. Btcoin is more of a commodity unlike stocks and bonds that are securities if we consider bitcoin qualities.https://www.blockchainconsultus.io/difference-between-security-commodity-tokensQuoteCommodities are assets, property or goods that can be bought or sold on an exchange. Some typical examples of this are raw materials or agricultural products.Unlike securities, commodities don’t generate a return from a common enterprise. Instead, they’re goods or property that get grown or mined where their value depends on the demand and supply of the market.Quote from: FMCPAY_GLOBAL on June 28, 2022, 07:27:44 AMInterestingly, the positive news for Bitcoin resulted in another price decline, falling from a 24-hour high of $21,478 to $20,635 at the time of writing.The positive news does not resulted to bitcoin price decline, we are in bear market and price decline is expected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 28, 2022, 08:02:52 AM",
      "body": "I suppose it's controversial because it moves away from the original idea of being a P2P currency, but we're seeing that it's become more like digital gold than a currency. Just as it is used today for payments to some extent, it will continue to be used but it is much better for saving than spending. Quote from: FMCPAY_GLOBAL on June 28, 2022, 07:27:44 AMInterestingly, the positive news for Bitcoin resulted in another price decline, falling from a 24-hour high of $21,478 to $20,635 at the time of writing.In the short term, anything can influence the price and this news is not so bullish either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 28, 2022, 08:13:20 AM",
      "body": "a commodity is a raw material used to create other products.. oil-> car fuel & plasticgold-> jewellery & electronicswheat -> bread & cakesdigital things are not usually commodities (patents, IP rights, videos, games, algorithms are not commodities)though gold sits on 2 markets.. both a commodity market and a asset market. thus depending on which market you are on its regulated by different agencies. both SEC and the CFTC have their rules and policies over gold.i think bitcoin is more of an asset(good/product) and should be treated more as a product that gets auctioned(bought/sold) off, as it then goes back to how things were exchanged before regulators grabbed onto it. because now its treated as a legal currency regulators get to grab onto it. heck even tax iti secretly understand that it could be seen as a digital commodity where bitcoin is a base raw unit (mined/farmed) that is used to make other products (sidechain tokens/altnet units/digital products). but the more definitions we start to give bitcoin legally. the more regulators and more agencies get to grab on and get too involved in.(technically its more of a derivative than a physical commodity. but now we are just playing more definition games trying to put bitcoin into a slot that fits old outdated terms)i would say with ethereum having the NFT stuff prominently. Ethereum is more of a base commodity and NFT is the product.( but now we are just playing more definition games trying to put ethereum into a slot that fits old outdated terms)though bitcoin acts more like an asset (a product in of itself) much like how one final product can then create other utility. EG a car can be a work commute vehicle or a leisure vehicle or a property investment with a key.... EG flour can be cake or bread. we need to rationalise things for the best of bitcoiners.EG wheat is regulated by the CFTC.. but flour is not. even if flour can make a cakeEG oil is a commodity.. but after its refined into car fuel its then a product thus not on the CFTC radarbitcoin should be treated as a refined product not a raw material(for the benefit of escaping most regulators clutch)do we really want to call bitcoin a currency and commodity and asset (like gold(CFTC&SEC regulated)) or just a commodity where it replaces SEC with CFTC or go full currency(like fiat) that gets treated differently in different markets. where there is certain tax on commodities like import/export duties, other taxes like capital gains on asset markets. and income/corporation tax on currency deposits from other sources to you. or do we try to find a new definition that just treats bitcoin like a piece of art or a cake where its treated like a retail/auction product that escapes most regulation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 28, 2022, 02:30:36 PM",
      "body": "Quote from: franky1 on June 28, 2022, 08:13:20 AMor go full currency(like fiat) that gets treated differently in different markets. where there is certain tax on commodities like import/export duties, other taxes like capital gains on asset markets. and income/corporation tax on currency deposits from other sources to you. or do we try to find a new definition that just treats bitcoin like a piece of art or a cake where its treated like a retail/auction product that escapes most regulationThe US has treated bitcoin as a commodity for a long time afaik, this is just reaffirming it is one (and might be what influenced them calling it one). Import and export duties might be hard to charge on crypto but perhaps the news surrounding large Russians and Chinese markets might have made the US seem like it has control over determining where they come from (it'd be logistically impossible and stupid though).Food also takes up a space of both commodities and food too (I can see cfd data on orange juice for example - I doubt you'd pay import taxes on a bottle if you took it on a plane).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 28, 2022, 03:15:59 PM",
      "body": "Quote from: jackg on June 28, 2022, 02:30:36 PMQuote from: franky1 on June 28, 2022, 08:13:20 AMor go full currency(like fiat) that gets treated differently in different markets. where there is certain tax on commodities like import/export duties, other taxes like capital gains on asset markets. and income/corporation tax on currency deposits from other sources to you. or do we try to find a new definition that just treats bitcoin like a piece of art or a cake where its treated like a retail/auction product that escapes most regulationThe US has treated bitcoin as a commodity for a long time afaik, this is just reaffirming it is one (and might be what influenced them calling it one). Import and export duties might be hard to charge on crypto but perhaps the news surrounding large Russians and Chinese markets might have made the US seem like it has control over determining where they come from (it'd be logistically impossible and stupid though).Food also takes up a space of both commodities and food too (I can see cfd data on orange juice for example - I doubt you'd pay import taxes on a bottle if you took it on a plane). orange concentrate.. is different that the small bottles of \"orange from concentrate\".much like the oil tanker crude oil is different to the engine oil you buy in little bottles at a gas station to lubricate an engineby the things like \"import taxes\" i dont mean the small bottle retail product stuff. i mean the actual market investment/trade stuff. EG if a russian was doing a blockchain peer to peer with an american friend for small amount. nothing.. but depositing large amount from a russian source into an american exchange business for the purpose of market trade order.. might be treated differently..my comments were more about should we really let governments add another legal recognition to allow another regulator in. it was about fungibility. where for instance (people doubt, but its true) money is not fungible. a $100 received from an employer(income tax) is treated for tax purposes differently than $100 received from an investment(cap gains), and different again if awarded from a lottery or friendly gift. and different again if received as a payment for goods(sales tax/corporation tax), and again differently than a commodity(import/export tax)orshould we try to establish a whole new regime of \"out of jurisdiction\" for things that dont involve converting to fiat so that it limits their scope of interferance. where by americans just treat bitcoin like a euro when its swapped (like getting travel/vacation money)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "June 28, 2022, 07:02:43 PM",
      "body": "Each country has its own way to see bitcoin. For the USA it's a commodity, for El Salvador is Money and for Mexico is a Virtual Asset.The problem with this is that if bitcoin isn't money, then you don't spend it, you trade it. Like the old times when people use to trade cereal for meat... And the real problem comes when you want to get an invoice for your payment or declare taxes.Bitcoins should be seen as money all over the globe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "June 28, 2022, 10:41:07 PM",
      "body": "Quote from: seoincorporation on June 28, 2022, 07:02:43 PMEach country has its own way to see bitcoin. For the USA it's a commodity, for El Salvador is Money and for Mexico is a Virtual Asset.The problem with this is that if bitcoin isn't money, then you don't spend it, you trade it. Like the old times when people use to trade cereal for meat... And the real problem comes when you want to get an invoice for your payment or declare taxes.Bitcoins should be seen as money all over the globe.The different perspectives towards bitcoin is really a factor how they will approach the btc market.People or each government have their own take when it comes to bitcoin. So they will formulate laws and protocols according to what they seem is necessary.Maybe, in time, we will have one approach towards btc but that's a long journey to take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 28, 2022, 10:56:08 PM",
      "body": "i see them just trying to jump in on more band waggons.the SEC regulating the btc<->fiat exchangesthe CFTC regulating the sidechains, altnets and pegged tokens to bitcoinexpect more licence requirements even if you already have a \"bitlicence\" and a \"money service business/money transmitter\" licence. especially if you offer both btc to fiat and btc to pegged chains/altnetsi see (guess) the next ploy they will treat it like forex for all the altcoin swaps. and get the NFA involved with their regulations and licences like what they do regulating forex",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "June 28, 2022, 11:09:11 PM",
      "body": "Well, the good news is that it won't have an immediate impact, maybe there is a lack of support from other institutions to push it.  Nor does it mean that the price decline has anything to do with the news. This is a good sign for others because of the positive news.  But we know the trend of the government, it has a replacement and it does not deviate from the regulations and the worst of it is the imposition of tax.We know that almost all parts of the world already know about Bitcoin and are already using it.  It's just different how to treat it.  Others think that it is money/currency because they can use it as a payment or receive payment in exchange for a product or service (eCommerce).  Others say it is similar to gold in that as time goes on it grows and increases in value.  I think the only important thing here is that they look at Bitcoin as having value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}