{
  "id": "topic_5397709",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "May 07, 2022, 04:24:56 PM",
  "content": "https://www.youtube.com/watch?v=qZwaDUBAPcEKhalil Rountree's Bitcoin AwakeningPowerfulJREUFC fighter Khalil Rountree attended the recent bitcoin convention in miami florida and shares his experiences on Joe Rogan's MMA show #124.QuoteFrancis Ngannou Will Take Half of His UFC 270 Purse in BitcoinJanuary 18, 2022https://www.yahoo.com/lifestyle/francis-ngannou-half-ufc-270-055724237.htmlBack in january of this year Francis Ngannou took 50% of his purse in bitcoin....It appears crypto is gaining traction in the sport of MMA.Although MMA fighters like Rory Macdonald and Chris Camozzi have been associated with crypto for years.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397709",
  "comments": [
    {
      "author": "STT",
      "created_time": "May 07, 2022, 07:40:41 PM",
      "body": "Good publicity to do so perhaps because of sponsors, I wonder the motivation personally could be its useful to him for investment via a business concern or his management company possibly.  I often think the best involvement is via a company because they can carry any losses over from prior tax years  vs profits and taxes where as people cannot.  BTC does vary alot so that'd be useful to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "7788bitcoin",
      "created_time": "May 07, 2022, 08:01:26 PM",
      "body": "Quote from: Hydrogen on May 07, 2022, 04:24:56 PMIt appears crypto is gaining traction in the sport of MMA.Although MMA fighters like Rory Macdonald and Chris Camozzi have been associated with crypto for years.Majority of the fighters look for reinvestment and Khalil Rountree is the latest in the cryptocurrency space. Many of the fighters are into the NFT space where they are launching their NFT for the past few months including Khabib Nurmagomedov and Darren Till and they are being sponsored by cryptocurrency projects and if i remember correctly Ben Askren was the first fighter who started talking about Bitcoin and the cryptocurrency space back in the day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "May 08, 2022, 07:46:30 AM",
      "body": "Quote from: Hydrogen on May 07, 2022, 04:24:56 PMIt appears crypto is gaining traction in the sport of MMA.Although MMA fighters like Rory Macdonald and Chris Camozzi have been associated with crypto for years.I think that CRYPTO.COM's initiative to sponsor MMA is a huge step towards more popularity of Cryptocurrency especially on a sport that has tons of viewers even in PPV. I think Khalil did this because Crypto.com has a 30,000USD bonus for the top voted fighter IN BITCOINS[1]. Hence, he just did this as he sees it to be an opportunity from that point on.[1] - UFC to Offer Bitcoin Bonus As Part of Record Crypto.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "May 08, 2022, 08:24:41 AM",
      "body": "Quote from: Hydrogen on May 07, 2022, 04:24:56 PMIt appears crypto is gaining traction in the sport of MMA.Although MMA fighters like Rory Macdonald and Chris Camozzi have been associated with crypto for years.Great news, it is always nice to see that professional athletes take the chance to be being paid in crypto currencies rather than fiat money. I already liked the move that bonuses in the MMA community would be paid in bitcoins. Crypto companies have been making a lot of deals in the sport industry this year, we saw quite a few new partnership and advertising deals for really big tournaments like the Football World Championship for example. This will bring in a lot of new investors into the crypto community, because sports has such a wide reach all around the world. To watch sports you don't need to speak the same language, and it doesn't focus on any particular age group. It's a good place to be in for advertising. MMA is taking a really big step in the sport world here. They are the first ones to go this way, I am sure there will be others to follow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "May 09, 2022, 06:18:42 PM",
      "body": "This is honestly helping fuel the adoption since players are right now accepting the bitcoins professionally and are also showing the support through their Twitter accounts and internet. It's been going on since long as well in 2021 NFL player Russell Okung also asked half of his salary to be paid in Bitcoins. There are so many pro Athletes also accepting their compensation in Bitcoins like : Aaron Rodgers. I also found a very interesting article on the players who are actually paid in Bitcoins right now :  https://www.buybitcoinworldwide.com/athletes/ The acceptance of Bitcoins in MMA has a lot to do with the evolution over the years and also the continuous support provided by other players from all the aspects as well. I think this is quite a good news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}