{
  "id": "topic_5410765",
  "title": "Buchi-88",
  "author": "Buchi-88",
  "created_time": "August 22, 2022, 08:49:12 AMLast edit: March 28, 2024, 12:47:07 PM by Buchi-88",
  "content": "Da hier immer wieder einige Fragen (komplett OffTopic) in einigen Bereichen des Forums auftreten eröffne ich hier einen Thread um allgemeines um die PV Anlage.Auf jedenfalls hier einmal wichtige oder nützliche Links zu einem mmn guten PV Forum.PV-Forum AllgemeinAllgemeine Anlagenplanung Bewertung Angebote PhotovoltaikanlageService Passwort KostalInstallateur Passwort SMAAlte Sunny Explorer VersionDachausrichung Rechner zur Bestimmung AzimutSpeicherrechnerQuotePV-Speicher Größe berechnen: FaustformelPro 1.000 kWh benötigen Sie 1,0 bis 1,5 kWh Speicherkapazität. Das heißt, für ein Einfamilienhaus mit einem Stromverbrauch von 5.000 kWh pro Jahr benötigen Sie einen Speicher mit einer Speicherkapazität zwischen 5 und 7,5 kWh. Diese Faustformel wird zur groben Auslegung genutzt.SonnenKlar PV-RechnerAuslegung eines PV-SpeichersEnergiespeicher Berechnungstool",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410765",
  "comments": [
    {
      "author": "Buchi-88",
      "created_time": "August 22, 2022, 08:50:09 AMLast edit: August 22, 2022, 11:30:20 AM by Buchi-88",
      "body": "Quote from: Buchi-88 on August 22, 2022, 08:46:49 AMQuote from: Rent_a_Ray on August 22, 2022, 08:00:29 AMEbay war die Rettung, allerdings warte ich jetzt bis Mitte September auf den Fachmann.Ich könnte es auch locker selbst machen, habe eine entsprechende Ausbildung, allerdings rückt Kostal das Master-Passwort für die Einstellungen nicht raus. Zwar komplett OffTopic, aber da kann ich dir einmal bei einem Freund nachfragen, bin mir nicht sicher ob er das nicht hat.Sonst kannst du auch einmal im PV-Forum nachfragen.https://www.photovoltaikforum.com/thread/134993-servicepasswort/https://www.photovoltaikforum.com/thread/151837-brauche-hilfe-masterpasswort-kostal-plenticore-fehleintrag-bei-erstinbetriebnahm/Ich werde einmal im OffTopic Bereich einen Thread eröffnen \"Alles rund um eine PV-Anlage\".Ich nehme das einmal hier mit rüber, eventuell @willi9974 reservierst du dir auch gleich ein Post am Anfang des neuen Threads, in punkto Speicher bist du einfach der Spezialist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "August 22, 2022, 11:48:48 AM",
      "body": "Interessantes Thema und betrifft mich auch bald Willi hatte bereits einen Thread mit vielen relevanten Infos eröffnet: Stromkosten einsparen / Mining mit PV Anlage und Tesla selbst betanken Müssen es nur bitte schaffen die Themen übersichtlich zu behalten - danke.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tux1975",
      "created_time": "August 22, 2022, 03:44:41 PM",
      "body": "Interessantes Thema ...bin auch gerade dabei meinen Speicher zu erweitern ...  jetzt werden natürlich gleich wieder einige sagen oh,oh Selbstbau mit 18650er Zellen das kann nicht gutgehen (die ersten 300Ah davon laufen problemlos seit 2019) -> doch kann es wenn man sich an einige Spielregeln wie Markenzellen,testen,einzel Absicherung richtig Pack zusammenstellung und ein gutes BMS hält !Und ja wenn ich heute einen Speicher bräuchte dann Lifepo4 vermutlich pylontech  Meine Empfehlung BMS  https://www.batrium.com/ Ist zwar teuer aber läuft stabil, ist sehr flexibel und man kann viel damit machen. Ich habe bis jetzt nix besseres gefunden .@Buchi-88 klär mich auf :Ist willi9974 ne Quelle für Speicher ?Gruß Jens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "August 22, 2022, 04:35:27 PM",
      "body": "Interessantes Setup tux1975.Und Buchi meint vermutlich auch den vorhin von mir verlinkten Thread… da zeigt Willi seine Anlage inkl. ein paar Infos //edit: hier nochmal damit du nicht suchen musst https://bitcointalk.org/index.php?topic=5395702.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rent_a_Ray",
      "created_time": "August 22, 2022, 05:23:34 PM",
      "body": "Quote from: Buchi-88 on August 22, 2022, 08:49:12 AMDa hier immer wieder einige Fragen (komplett OffTopic) in einigen Bereichen des Forums auftreten eröffne ich hier einen Thread um allgemeines um die PV Anlage.Auf jedenfalls hier einmal wichtige oder nützliche Links zu einem mmn guten PV Forum.PV-Forum AllgemeinAllgemeine Anlagenplanung Bewertung Angebote PhotovoltaikanlageService Passwort KostalInstallateur Passwort SMAAlte Sunny Explorer VersionVielleicht können wir selbst ein bissl was zusammentragen. Im Photovoltaikforum wird zwar immer über die Passwörter gemotzt, gepostet werden sie aber dennoch nicht.Ich kann das auch zu einem gewissen Grad nachvollziehen, die Straße ist schnell dunkel, aber was macht die Fachfirma anders als der Elektriker?Ich persönlich möchte eigentlich nur Config_alt > Config_neu übernehmen, da der alte WR abgeraucht ist und ein neuer (alter) via ebay geordert wurde.Bei mir ist es so, dass ich die Vorsicherung L3 (3Phasen WR), die ja gleichzeitig die Einspeisesicherungen sind, nicht mehr einschalten kann. Der Wechselrichter ist also noch für die Übernahme der Konfiguration zu gebrauchen, er läuft auch mit einer Phase hoch. Ich habe übrigens eine klassische Einspeisung ohne Akku. Das macht bei der Vergütung >45 cent nicht viel Sinn, es sei denn ich würde Blackouts fürchten.Hier muss man m.E. auch viel \"Denksport\" betreiben. Denn im Winter darf die Anlage eigentlich den Akku gar nicht voll nutzen. Sonst ist er beim Blackout vielleicht leer.Oder man nutzt nur 50%, danach Umschaltung auf Netz. Oder gibt es Anlagen mit einer Regelung, die je nach durchschnittlicher Sonneneinstrahlung agieren? Wie macht ihr das? Würde mich interessieren.Wenn ich die heutige Akkutechnik richtig verstehe müsste es eigentlich so ablaufen:20% minimum 80% maximum Ladung. Mit \"Blackoutregelung\" vielleicht 40% minimum? Dann habe ich im Ernstfall 35% bei Netzausfall. Das könnte der Akku ab und zu verkraften, oder?Cheers,Ray",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "August 23, 2022, 06:43:36 AM",
      "body": "Quote from: tux1975 on August 22, 2022, 03:44:41 PM@Buchi-88 klär mich auf :Ist willi9974 ne Quelle für Speicher ?Gruß JensAlso ich weiß nur das er sich beim Thema Speicher sehr gut auskennt und hat (glaube ich) seinen 7,5 kwh Speicher selbst gebaut. Willi ist aber jetzt noch in Urlaub, aber gehe davon aus das er sich bestimmt in alter frische hier auch melden wird.Zum Thema von deinen Akkus (ich habe davon keine Ahnung):Quote from: willi9974 on April 22, 2022, 04:27:27 PM--> fangt aber nicht an 18650er gebrauchte oder auch neue Akkus zu verbauen, viel zu gefährlich...Quote from: Rent_a_Ray on August 22, 2022, 05:23:34 PMVielleicht können wir selbst ein bissl was zusammentragen. Im Photovoltaikforum wird zwar immer über die Passwörter gemotzt, gepostet werden sie aber dennoch nicht.Ich kann das auch zu einem gewissen Grad nachvollziehen, die Straße ist schnell dunkel, aber was macht die Fachfirma anders als der Elektriker?Können wir auf jeden Fall machen und sobald etwas bekannt ist, kann ich sie im ersten oder im zweiten Post mit \"code\" einfügen, so sollte es für ein nicht angemeldetes Mitglied nicht möglich sein es zu lesen, wird da auch die google Suche ausgeschlossen?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tux1975",
      "created_time": "August 23, 2022, 05:21:59 PM",
      "body": "Quote from: Rent_a_Ray on August 22, 2022, 05:23:34 PMVielleicht können wir selbst ein bissl was zusammentragen. Im Photovoltaikforum wird zwar immer über die Passwörter gemotzt, gepostet werden sie aber dennoch nicht.Ich kann das auch zu einem gewissen Grad nachvollziehen, die Straße ist schnell dunkel, aber was macht die Fachfirma anders als der Elektriker?Ich persönlich möchte eigentlich nur Config_alt > Config_neu übernehmen, da der alte WR abgeraucht ist und ein neuer (alter) via ebay geordert wurde.Hallo Ray , Config_alt>Config_neu übernehmen ist nur bei gleichem Hardware / Firmware Stand sinnvoll. Einen Fabrikfrischen WR bekommt ein Elektriker problemlos parametriert ! Das wichtigste Gridseitig ist der richtige Ländercode -> für D ->VDE-AR-N 4105 . Damit hast Du dann erstmal die wichtigsten Netzparameter eingestellt die zum sicheren Betrieb notwendig sind, sonstige zusätzliche Parameter (70% Reglung usw.) hast Du eventuell mit der Anmeldebestätigung als Merkblatt bekommen. Solarseitig ist eigentlich nur wichtig den richtigen MPPT Bereich für die Solarzellen einzustellen und bei überbelegung eine eventuelle Strombegrenzung. Bei verbautem Speicher muss noch die min. max. Spannungsbegrenzung und der Lade / Entladestrom angeben werden und die Schnittstelle zum BMS (bei neueren Systemen wird es meist automaschisch erkannt)  bzw. must Du dem WR fürs Datalogging / Nulleispeisung noch mitteilen ob ein Smartmeter / extra. Zähler verbaut ist.  Eigentlich kein Hexenwerk und mit Handbuch machbar.@Buchi-8818650er sind nicht gefährlicher als LIFEPO4 Zellen bei sachgemäßer Handhabung!!! ist alles eine Glaubensfrage  Bei mir arbeiten seit dem Jahr 2018/19  2520 Zellen fehlerfrei und von den gekauften 3500 Stück waren bis jetzt 3 \"schlecht \" und 2 \"tod\" nach dem testen     Jede Batterie / Akku (Eneriespeicher) ist gefährlich das sollte man immer im Hinterkopf behalten , genauso sollte man sich gut informieren und auch mal den eignen Versicherer fragen was der so fordert bevor man sich einen Stromspeicher auf das Grundstück / Haus / Keller holt ...https://secondlifestorage.com/index.php auch ein interessantes Forum rund um Energiespeicher und Solar, zwar nur Englisch aber vielleicht doch für den einen oder anderen interessant.Gruß Jens",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rent_a_Ray",
      "created_time": "August 23, 2022, 10:16:25 PM",
      "body": "Quote from: tux1975 on August 23, 2022, 05:21:59 PMHallo Ray , Config_alt>Config_neu übernehmen ist nur bei gleichem Hardware / Firmware Stand sinnvoll. Einen Fabrikfrischen WR bekommt ein Elektriker problemlos parametriert ! Ich schrieb ja bereits, dass ich bei Ebay ein fast baugleiches, altes, gebrauchtes Gerät geschossen habe, dass nun wahrscheinlich erstmal eine andere Konfiguration hat und einen Werksreset benötigt. (Firmware ist erstmal unbekannt, mein Wechselrichter hat nicht mal Lüfter, der den ich ersteigert habe, hat schon welche.)Ok, nun die berechtigte Frage. Warum kauft der Idiot so ein altes Teil?Ganz einfach, es gibt gerade keine neuen. 1-2 Jahre warten ist halt keine Option.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "August 25, 2022, 12:49:56 PM",
      "body": "Quote from: tux1975 on August 23, 2022, 05:21:59 PM@Buchi-8818650er sind nicht gefährlicher als LIFEPO4 Zellen bei sachgemäßer Handhabung!!! ist alles eine Glaubensfrage  Bei mir arbeiten seit dem Jahr 2018/19  2520 Zellen fehlerfrei und von den gekauften 3500 Stück waren bis jetzt 3 \"schlecht \" und 2 \"tod\" nach dem testen     Jede Batterie / Akku (Eneriespeicher) ist gefährlich das sollte man immer im Hinterkopf behalten , genauso sollte man sich gut informieren und auch mal den eignen Versicherer fragen was der so fordert bevor man sich einen Stromspeicher auf das Grundstück / Haus / Keller holt ...Wie gesagt ich kann das nicht einschätzen und mich damit auch noch nicht beschäftigt da mir der Speicher derzeit sowieso noch zu teuer ist...Quote from: Rent_a_Ray on August 23, 2022, 10:16:25 PMIch schrieb ja bereits, dass ich bei Ebay ein fast baugleiches, altes, gebrauchtes Gerät geschossen habe, dass nun wahrscheinlich erstmal eine andere Konfiguration hat und einen Werksreset benötigt. (Firmware ist erstmal unbekannt, mein Wechselrichter hat nicht mal Lüfter, der den ich ersteigert habe, hat schon welche.)Ok, nun die berechtigte Frage. Warum kauft der Idiot so ein altes Teil?Ganz einfach, es gibt gerade keine neuen. 1-2 Jahre warten ist halt keine Option.Warum muss es unbedingt ein Kostal sein, wegen den alten Daten? Auch wenn es bei fast jedem Hersteller Lieferprobleme gibt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rent_a_Ray",
      "created_time": "August 25, 2022, 01:29:48 PM",
      "body": "Quote from: Buchi-88 on August 25, 2022, 12:49:56 PMWarum muss es unbedingt ein Kostal sein, wegen den alten Daten? Auch wenn es bei fast jedem Hersteller Lieferprobleme gibt.Er liegt ja jetzt nun da. Die Frage hätte ich mir vorher stellen müssen. Aber Neugeräte habe ich fast nirgends gefunden.Die alten Daten sind mir wurscht. Die Werte habe ich ausgelesen.Es hat was mit \"gleiche\" Größe, gleiche Anschlüsse auf der gleichen Seite, Bohrlöcher passen oder schlicht mit Faulheit zu tun.Für die 5 Jahre brauche ich kein anderes Gerät nur um mir dann wieder ein neues zu kaufen, weil ich Batteriespeicher haben möchte etc...Cheers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tux1975",
      "created_time": "August 25, 2022, 02:33:35 PM",
      "body": "Wo liegt eigentlich genau das Problem ?Werksreset sollte ohne Servicecode machbar sein und dann solltest Du eigentlich mit pvserver/pvwr wieder reinkommen und er mit der Ländereinstellung den Einrichtungsprozess neu starten ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rent_a_Ray",
      "created_time": "August 25, 2022, 04:01:45 PM",
      "body": "Quote from: tux1975 on August 25, 2022, 02:33:35 PMWo liegt eigentlich genau das Problem ?Werksreset sollte ohne Servicecode machbar sein und dann solltest Du eigentlich mit pvserver/pvwr wieder reinkommen und er mit der Ländereinstellung den Einrichtungsprozess neu starten ...Ich komme gar nicht in den Bereich wo ich so etwas machen könnte. Kostal hat mir ein Passwort zugeschickt (errechnet mit dem Mastercode), damit kann ich die aktuellen Leistungswerte via Web betrachten, die Portalausgabe umschalten und das Passwort ändern (was nicht funktioniert).Die Firmware ist auch so alt, dass ich keine Informationen über die Version finde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tux1975",
      "created_time": "August 25, 2022, 07:51:31 PM",
      "body": "Wir reden hier von einem Piko? Ist er mit dem Solarportal verbunden ? Hat das SCB Board schon die USB Schnittstelle oder ist es noch die Urversion mit RS232 ?Wie loggst du Dich ein ?Als Installer mit Maserkey & Servicecode oder als Betreiber mit pvserver &  dem zugesendeten Servicecode ? Die Version steht unter Info / und im Ereignissprotokoll -> Ui 1.xx",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rent_a_Ray",
      "created_time": "August 26, 2022, 10:30:23 AM",
      "body": "Ich habe ihn vom Vorbesitzer übernommen und in ein Portal geholt.Firmware ist ver 1.09.RS232Login mit User: convert und errechnetem Passwort.IP-Adresse ist die einzige Einstellmöglichkeit. Das geht auch schon im Display, wenn ich mich nicht irre.Cheers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "August 31, 2022, 10:57:52 AM",
      "body": "Bin gerade dabei meine zweite Anlage zu errichten, habe mein Angebot und Anlage hier eingestellt sollte es jemanden interessieren.  https://www.photovoltaikforum.com/thread/181470-3365-4-51kwp-1298-axitec/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rent_a_Ray",
      "created_time": "October 01, 2022, 05:09:29 PM",
      "body": "So, kurzes Feedback:Der Elektriker wollte den Wechselrichter erst nicht einbauen, weil ein paar Lötstellen dunkel waren und die Anschlüsse direkt auf Klemmen geführt wurden.\"Der ist zu 100% auch defekt\" - wurde mir gesagt. Ich bestand weiter auf den Einbau.Dann hat er es doch gewagt, seit ca. 1 Woche läuft alles wieder 1A.Cheers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Buchi-88",
      "created_time": "October 03, 2022, 07:35:09 AMLast edit: October 04, 2022, 01:52:36 PM by Buchi-88",
      "body": "Quote from: Rent_a_Ray on October 01, 2022, 05:09:29 PMSo, kurzes Feedback:Der Elektriker wollte den Wechselrichter erst nicht einbauen, weil ein paar Lötstellen dunkel waren und die Anschlüsse direkt auf Klemmen geführt wurden.\"Der ist zu 100% auch defekt\" - wurde mir gesagt. Ich bestand weiter auf den Einbau.Dann hat er es doch gewagt, seit ca. 1 Woche läuft alles wieder 1A.CheersWas hast du jetzt gemacht mit dem WR das alles wieder funktioniert?Im ersten Beitrag habe ich einen Dachausrichtung Rechner zur schnellen Bestimmung Azimut eingefügt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rent_a_Ray",
      "created_time": "October 05, 2022, 12:25:17 PM",
      "body": "Quote from: Buchi-88 on October 03, 2022, 07:35:09 AMWas hast du jetzt gemacht mit dem WR das alles wieder funktioniert?Das gebrauchte Austauschgerät von Ebay einbauen lassen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yxt",
      "created_time": "October 13, 2022, 05:54:53 PM",
      "body": "Quote from: Rent_a_Ray on August 25, 2022, 04:01:45 PMQuote from: tux1975 on August 25, 2022, 02:33:35 PMWo liegt eigentlich genau das Problem ?Werksreset sollte ohne Servicecode machbar sein und dann solltest Du eigentlich mit pvserver/pvwr wieder reinkommen und er mit der Ländereinstellung den Einrichtungsprozess neu starten ...Ich komme gar nicht in den Bereich wo ich so etwas machen könnte. Kostal hat mir ein Passwort zugeschickt (errechnet mit dem Mastercode), damit kann ich die aktuellen Leistungswerte via Web betrachten, die Portalausgabe umschalten und das Passwort ändern (was nicht funktioniert).Die Firmware ist auch so alt, dass ich keine Informationen über die Version finde.Echt krass wie die einen aus den eigenen Geräten aussperren, aber solange die Kunden das weiter kaufen wird sich da leider auch nichts ändern.@tux1975Naja die einen können halt thermisch durchgehen, die anderen nicht. Wobei ich jetzt rein wegen dem Aufwand nichts mehr mit 18650 machen würde. Aberwenn man das als abendliche Meditationsbastelei betreibt sieht es wieder anders aus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}