{
  "id": "topic_5401400",
  "title": "lil17th",
  "author": "lil17th",
  "created_time": "June 04, 2022, 10:29:53 PM",
  "content": "LINK: https://www.instagram.com/nftluck_/    After the purchase, you will receive your native mail     ready to work through a guarantor                                             the lowest price on the market                                                    payment only with cryptocurrency                                               PRICE: 649$                                                                             Write to telegram: @Lil17_th",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401400",
  "comments": [
    {
      "author": "calvinhull",
      "created_time": "July 01, 2022, 05:55:32 PMLast edit: July 04, 2022, 07:43:45 AM by calvinhull",
      "body": "I think it would be cheaper to buy a boost from some site that specializes in this, although I do not know exactly their rates. My friend just bought instagram smm panel services and he now has 341 thousand subscribers. Bought 300 and another 41,000 signed up for it themselves. Now he's making money from advertising. I think it was just a very cool and easy idea to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SayfoDias",
      "created_time": "July 31, 2022, 01:10:15 PM",
      "body": "Quote from: calvinhull on July 01, 2022, 05:55:32 PMI think it would be cheaper to buy a boost from some site that specializes in this, although I do not know exactly their rates. My friend just bought instagram smm panel services and he now has 341 thousand subscribers. Bought 300 and another 41,000 signed up for it themselves. Now he's making money from advertising. I think it was just a very cool and easy idea to make money.But before buying a boost I would recommend scanning the account. Just to be sure it does not have any kind of suspicious activity or if half of the subscribers are bots because it can be the issue why the user is selling it. I watched on youtube one blogger who decided to register an account and he subscribed a lot of bots on it. After that, he tried to sell it for 1k dollars. Can you imagine that? So I would recommend an OP to follow this link and scan the account before obtaining it. Just to be sure there are no \"traps\" inside.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}