{
  "id": "topic_5437557",
  "title": "Obari",
  "author": "Obari",
  "created_time": "January 31, 2023, 10:20:55 PM",
  "content": "Hello HousePlease I have been battling with trying to help a neighbor who i introduced into cryptocurrency and the forum and after registration, be was asked to pay for proxy ban which I also tried explaining to him but die to the very high charges involved in sending that very little proxy ban fee and I also don't want it to seem as if I have any connections with that account for trying to help pay proxy ban and I also want to use this opportunity to make a disclaimer that I have no relationship with that account and that I intend helping the neighbor pay for proxy ban and what ever actions he should be held responsible for it.So I wanted to ask if it's ok for me to pay for the proxy ban or not please  N/B: please pardon me if this is not tye right board for me to post this as I will be appreciate of my attention is drawn to the right place to post this.THANKS",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437557",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "January 31, 2023, 10:24:53 PM",
      "body": "Why don't you help in whitelisting:Remove Proxyban (evil fees) - email to get whitelisted for freeThere is no problem with helping a friend, tell your friend to email one of the people that can whitelist him or her, or just help in paying, no problem with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceMobile",
      "created_time": "January 31, 2023, 10:28:14 PM",
      "body": "Post your vouch in the topic mentioned above, and I'll whitelist him tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "January 31, 2023, 10:32:30 PM",
      "body": "Quote from: Charles-Tim on January 31, 2023, 10:24:53 PMWhy don't you help in whitelisting:Remove Proxyban (evil fees) - email to get whitelisted for freeThere is no problem with helping a friend, tell your friend to email one of the people that can whitelist him or her, or just help in paying, no problem with that.Thank you so much senior and I'm only just trying to be careful and not wanting to fail any regulations.Quote from: LoyceMobile on January 31, 2023, 10:28:14 PMPost your vouch in the topic mentioned above, and I'll whitelist him tomorrow.Thank you so much and I will be making the vouch in the right board and I will be grateful if it gets whitelisted.Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}