{
  "id": "topic_5412678",
  "title": "Ben Barubal",
  "author": "Ben Barubal",
  "created_time": "September 07, 2022, 05:49:59 AMLast edit: September 07, 2022, 11:49:12 AM by Ben Barubal",
  "content": "Good news from the BSP (Banko Sentral ng Pilipinas)The BSP (Banko Sentral ng Pilipinas) has announced thatIt has completed the issuance of certificates of authority (COA) to six companies that applied for digital banking licenses. This COA can prove that they are in the final step to being able to operate officially.Among the 6 digital banks that will be able to operate with approval from the BSP are the following:1. GO time bank - https://www.gotyme.com.ph/2. Union Digital bank - https://uniondigitalbank.io/3. Tonic digital bank - https://tonikbank.com/4. Maya digital bank - https://www.maya.ph/5. Overseas Filipino Bank Inc. - https://www.ofbank.com.ph/6. Uno digital bank - https://www.unobank.asia/The others here are fully operational and the others are limited operations. And for those who are confused about digital banks, basically, it is a type of bank that no longer has physical branches or locations like traditional banks.Besides that, their products and services can only be processed online. The BSP's issuance of licenses to digital banks especially during the pandemic is a campaign to digitize retail payment in the country.This BSP digital payment transformation roadmap also aims to onboard at least 70% of Filipino adults to the formal financial system by the year 2023.This is good news for us to have options to have a bank that is easy and not more hassle way.Sources:- https://www.pna.gov.ph/articles/1182068#:~:text=The%20BSP%20said%20OFBank%2C%20TONDB,second%20half%20of%20the%20year.- https://www.philstar.com/business/2022/08/24/2204826/bsp-6-digital-banks-may-start-full-operations- https://www.manilatimes.net/2022/08/25/business/top-business/bsp-allows-6-digital-banks-to-operate/1855852",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412678",
  "comments": [
    {
      "author": "Despairo",
      "created_time": "September 07, 2022, 09:34:11 AM",
      "body": "Does it's a new banks on Philippines ? I don't think digital banks are something new anymore. AFAIK Philippines also a friendly country about cryptocurrency, so it's not really surprising for me. The disadvantage of digital banks are hack incident and getting phished, so anyone should visit the right URL before giving any sensitive information.Although digital banks sound like more convenient than land based banks, but you could give a try and you will know the requirement to make a new account isn't easy that would take for few days or week to complete it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "September 07, 2022, 10:22:50 AM",
      "body": "it's great when these digital banks start integrating blockchain into their platform because then there will surely be more people getting to know crypto and blockchain.. hopefully they really care about blockchain technology instead of just following trends",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "September 07, 2022, 12:54:50 PM",
      "body": "Quote from: Despairo on September 07, 2022, 09:34:11 AMDoes it's a new banks on Philippines ? I don't think digital banks are something new anymore. AFAIK Philippines also a friendly country about cryptocurrency, so it's not really surprising for me. The disadvantage of digital banks are hack incident and getting phished, so anyone should visit the right URL before giving any sensitive information.Although digital banks sound like more convenient than land based banks, but you could give a try and you will know the requirement to make a new account isn't easy that would take for few days or week to complete it.Apart from being a hotbed for hackers who could change the financial system at digital banks, it is also a concern that the Philippines must be able to show accountability if at any time good intentions backfire. Because the level of bank theft that is not domiciled makes a lot of speculation where you need public services directly, it is difficult to reach a held account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "autumnleaf",
      "created_time": "September 07, 2022, 12:56:14 PM",
      "body": "Quote from: Ben Barubal on September 07, 2022, 05:49:59 AMAmong the 6 digital banks that will be able to operate with approval from the BSP are the following:1. GO time bank - https://www.gotyme.com.ph/2. Union Digital bank - https://uniondigitalbank.io/3. Tonic digital bank - https://tonikbank.com/4. Maya digital bank - https://www.maya.ph/5. Overseas Filipino Bank Inc. - https://www.ofbank.com.ph/6. Uno digital bank - https://www.unobank.asia/You can add hyperlink to your website name for better presentation using sample below code.Code:[url=https://www.ofbank.com.ph/]Overseas Filipino Bank Inc.[/url]Among the 6 digital banks that will be able to operate with approval from the BSP are the following:Overseas Filipino Bank Inc.Tonic Digital BankUNO Digital BankUnion Digital BankGO Time BankMaya Digital Bank",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worldofcoins",
      "created_time": "September 07, 2022, 01:05:42 PM",
      "body": "Quote from: Despairo on September 07, 2022, 09:34:11 AMDoes it's a new banks on Philippines ? I don't think digital banks are something new anymore. AFAIK Philippines also a friendly country about cryptocurrency, so it's not really surprising for me. The disadvantage of digital banks are hack incident and getting phished, so anyone should visit the right URL before giving any sensitive information.The banks will indeed be on the list of hackers to exploit; in any case, the banks should hire some cryptocurrency experts along with white hat hackers to prevent any damage from being done to the banks.Quote from: Despairo on September 07, 2022, 09:34:11 AMAlthough digital banks sound like more convenient than land based banks, but you could give a try and you will know the requirement to make a new account isn't easy that would take for few days or week to complete it.Well, digital banks will have ATMs for bitcoin transfers, and my guess for minimum account requirements for registering an account with them would be a lot of T&C.And those T&Cs will be skipped by many, as we know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "September 07, 2022, 01:39:41 PM",
      "body": "How many digital banks so far have been a victim of hack? am not sure I have heard of any though, perhaps their level of securing their website is much higher than most of the so-called defi platforms we have that get hacked so often.Digital banks are very handy and are more flexible than traditional banks. I have on some occasions used a couple of digital banks like kuda, flutterwave and the services are good. I think it is an added advantage to the constantly growing digital world we are in right now, even the traditional banking system is gradually moving into the digital system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "September 08, 2022, 07:34:45 AM",
      "body": "It is my first time visiting the Philippines, so I don't have a comprehensive understanding of this country, but I am aware from what I read on the news that it is a cryptocurrency-friendly country. There are many bitcoiners and cryptocurrency investors in the Philippines, and the government is also not against cryptocurrencies, so the presence of digital banks in the Philippines is not a shock and not something new in the world., but the fact that the government of the Philippines has six digital banks with the ability to participate in cryptocurrency can be an important step forward for the government of the Philippines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 08, 2022, 09:19:42 AM",
      "body": "In general, this is a welcome development. Not only does this mean that the country is open-minded enough to allow purely digital banks to operate, it also means the country is cognizant enough of the rising popularity and legitimacy of crypto especially Bitcoin. I'm genuinely happy with this latest development in terms of Bitcoin acceptance in my country. It makes me excited to open one. I just hope that they are not as strict as the traditional banks in terms of verification. And then, of course, there's always the 'not your keys, not your coins' reminder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "September 08, 2022, 12:46:32 PM",
      "body": "Overall great development if your country finds the need to give license to operate on digital banking system. They are great especially when registered with the government. It can be rest assured that your money can’t be stolen or run away with except in a case of security breach by hackers. There level of security measure against attackers make it more trustable while operating with them. A lot of digital banks have fall prey of attacks from hackers in the past, if at all you want to go into banking digitally, do your research well  especially on the level of  security against hackers that the back has put in place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "September 08, 2022, 01:57:42 PM",
      "body": "Quote from: Asiska02 on September 08, 2022, 12:46:32 PMOverall great development if your country finds the need to give license to operate on digital banking system. They are great especially when registered with the government. It can be rest assured that your money can’t be stolen or run away with except in a case of security breach by hackers. There level of security measure against attackers make it more trustable while operating with them. A lot of digital banks have fall prey of attacks from hackers in the past, if at all you want to go into banking digitally, do your research well  especially on the level of  security against hackers that the back has put in place.Like an ordinary bank or a \"digital\" one, they always have their own risks, and they depend only on the form of implementation of a set of banking services.In my country, the first digital bank (Monobank) appeared 5 years ago. And literally in the first year, in terms of the client base, he entered the top three. I myself have been using it since the inception of the company, and even took part in beta testing of the product. It is very convenient, very simple, and more profitable compared to other classical banks.All that this bank needs is, in fact, processing, and the biggest value is services. There is processing, there are many times more services than other banks, and everything is simple - all management is only in a mobile phone. Question - what to hack? Desktop app? He is not! Functional front office? He doesn't exist either! Servers/processing? Come on... There are no offices, no servers! And by reducing costs and expenses for offices, wages for branch employees, cash collection - they allow themselves to do a lot of pleasant \"little things\" - free cashback, for any selected groups (you can change it once a month), zero rates for transactions, as well as replenishment and cash withdrawal and more",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "September 08, 2022, 05:15:26 PM",
      "body": "I think I'm familiar with the concept of digital banks, and from what I know about them, while they are digital and cryptos are digital, digital banks aren't always allowing to use or store cryptos. So a digital bank and a crypto-friendly bank are different things. I opened a few links of the op and there were no mentions that these banks would allow sotring Bitcoin or other cryptos. So I'm a little confused what proves that these banks aren't just digital banks but are truly getting involved in cryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "September 09, 2022, 08:33:31 AM",
      "body": "Quote from: worldofcoins on September 07, 2022, 01:05:42 PMThe banks will indeed be on the list of hackers to exploit; in any case, the banks should hire some cryptocurrency experts along with white hat hackers to prevent any damage from being done to the banks.I think they have prepared for such things that can happen in their digital banks. Apart from that, I think research has been conducted first with digital bank owners in cryptocurrency.Then the country of the Philippines is really open to cryptocurrency adoption. And it cannot be denied that there are many crypto enthusiasts that can be said, but when it comes to merchants, it seems that there are only a few who accept Bitcoin as a mode of payment online.This is a good step taken by BSP, to be honest, and it will be in favor of crypto lovers here in the Philippines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "September 19, 2022, 07:31:22 PM",
      "body": "Quote from: Leviathan.007 on September 08, 2022, 07:34:45 AMIt is my first time visiting the Philippines, so I don't have a comprehensive understanding of this country, but I am aware from what I read on the news that it is a cryptocurrency-friendly country. There are many bitcoiners and cryptocurrency investors in the Philippines, and the government is also not against cryptocurrencies, so the presence of digital banks in the Philippines is not a shock and not something new in the world., but the fact that the government of the Philippines has six digital banks with the ability to participate in cryptocurrency can be an important step forward for the government of the Philippines. If you are in the Philippines you can visit the Bitcoin island which people call the island of Boracay, there any payment can use Bitcoin even more than 100+ outlets including small and large shops, restaurants, hotels, tourist entrance tickets, many people vacation there because want to enjoy its real payout on Bitcoin which is useful there.So with the government backing the Philippines cryptocurrency being a fast growing country towards Bitcoin, people there started to promote that this island is bitcoin that can be used like fiat money.Small shop that accepts Bitcoin payments. https://twitter.com/BitcoinIslandPH/status/1571834441961553920Someone is enjoying a vacation on the island of Boracay, Philippines.https://twitter.com/markendiego/status/1552915062804795393",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "September 19, 2022, 11:18:56 PM",
      "body": "Adoption is already happening in the Philippines, we are already on the top list for this year and hopefully it will continue until we reach rural areas to adopt cryptocurrency. Our BSP is very supportive though there’s no final regulations yet but we already feel the freedom to use it, it’s just that there’s KYC on every digital wallet and some wallet are still not crypto friendly since you can send or receive on those wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "September 19, 2022, 11:24:40 PM",
      "body": "Philippines is one among the Asian countries where the adoption of cryptocurrencies and the real-time usage keeps increasing with time. Now banks getting into the direct business of cryptocurrency related services adds value to the usage and gives positive thoughts over cryptocurrency for the users who have been with the fear of using bitcoin and other cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "September 19, 2022, 11:29:35 PM",
      "body": "Quote from: kryptqnick on September 08, 2022, 05:15:26 PMI think I'm familiar with the concept of digital banks, and from what I know about them, while they are digital and cryptos are digital, digital banks aren't always allowing to use or store cryptos. So a digital bank and a crypto-friendly bank are different things. I opened a few links of the op and there were no mentions that these banks would allow sotring Bitcoin or other cryptos. So I'm a little confused what proves that these banks aren't just digital banks but are truly getting involved in cryptos.We might have the same thoughts about this or it might be just a confusion since they call it as digital bank it might be an exchange or it might be just a digital bank for fiat. Anyway, some of the replies mentioned that these lists are prone to hackers or on the list of the hackers and I think it's not safe to trust your money on them since they were like a custodial wallet. We can't do anything to our funds if it gets hacked just like the rest of the exchange getting hacked on the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "September 19, 2022, 11:48:56 PM",
      "body": "Quote from: ajiz138 on September 19, 2022, 07:31:22 PMQuote from: Leviathan.007 on September 08, 2022, 07:34:45 AMIt is my first time visiting the Philippines, so I don't have a comprehensive understanding of this country, but I am aware from what I read on the news that it is a cryptocurrency-friendly country. There are many bitcoiners and cryptocurrency investors in the Philippines, and the government is also not against cryptocurrencies, so the presence of digital banks in the Philippines is not a shock and not something new in the world., but the fact that the government of the Philippines has six digital banks with the ability to participate in cryptocurrency can be an important step forward for the government of the Philippines. If you are in the Philippines you can visit the Bitcoin island which people call the island of Boracay, there any payment can use Bitcoin even more than 100+ outlets including small and large shops, restaurants, hotels, tourist entrance tickets, many people vacation there because want to enjoy its real payout on Bitcoin which is useful there.So with the government backing the Philippines cryptocurrency being a fast growing country towards Bitcoin, people there started to promote that this island is bitcoin that can be used like fiat money.Small shop that accepts Bitcoin payments. https://twitter.com/BitcoinIslandPH/status/1571834441961553920Someone is enjoying a vacation on the island of Boracay, Philippines.https://twitter.com/markendiego/status/1552915062804795393I'm from the Philippines but I didn't know such Bitcoin island in Boracay exist. As far as I know there are many small stores in Philippines right now that are accepting bitcoin and other cryptocurrency as a payment for their products and services. People in boracay I think is just taking advantage of their island of being a tourist site, Boracay often got foreign visitors and having bitcoin as a option to pay means giving foreigners additional payment method. I guess we are having a great adoption on Boracay Island.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "September 20, 2022, 01:27:59 AM",
      "body": "Quote from: kryptqnick on September 08, 2022, 05:15:26 PMI think I'm familiar with the concept of digital banks, and from what I know about them, while they are digital and cryptos are digital, digital banks aren't always allowing to use or store cryptos. So a digital bank and a crypto-friendly bank are different things. I opened a few links of the op and there were no mentions that these banks would allow sotring Bitcoin or other cryptos. So I'm a little confused what proves that these banks aren't just digital banks but are truly getting involved in cryptos.I also opened and read all the links OP gave as a reference and there was no mention of cryptocurrency. These banks were just given licenses or permission to make electronic payments using fiat, not cryptocurrencies. Hence I think the title of this thread is slightly different from the information these links are giving. Nevertheless, digital banking is a good preparatory phase for the inclusion and operation of cryptocurrency in these banks' transactions. Maybe in a few years, the news of banks getting fully involved would be heard in the Philippines. Although the government of the Philippines recently announced that it would stop accepting applications from cryptocurrency-related companies for the next three years, the country has really been friendly to cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gayong88",
      "created_time": "September 20, 2022, 04:01:24 AM",
      "body": "Quote from: Ben Barubal on September 07, 2022, 05:49:59 AMGood news from the BSP (Banko Sentral ng Pilipinas)Conceptually, it is still new to the country, which is why people are skeptical about its stability, but it can definitely provide comfort and security to everyone's life. I think the government there think fast and smart where Cryptocurrencies and digital bank accounts might be a revolution among Filipinos especially for those who do online work and online based business. It is a fast, decentralized and secure medium of exchange. It is not controlled by a single entity thus avoiding the possibility of inflation. The use of cryptocurrencies does not require transaction fees like when using a credit card. Hopefully other countries can take the same steps as the Pilipinas government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}