{
  "id": "topic_5468353",
  "title": "thecapital",
  "author": "thecapital",
  "created_time": "September 27, 2023, 09:34:47 PMLast edit: September 27, 2023, 09:54:25 PM by thecapital",
  "content": "Within our company, our bitcoin price is sold at a 17% discount. Currently, 16 bitcoins are offered for sale. Those who are interested can please apply with their binance address.Minumum sold : 0.01 Btc",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468353",
  "comments": [
    {
      "author": "alterra57",
      "created_time": "September 27, 2023, 10:29:51 PM",
      "body": "Quote from: thecapital on September 27, 2023, 09:34:47 PMWithin our company, our bitcoin price is sold at a 17% discount. Currently, 16 bitcoins are offered for sale. Those who are interested can please apply with their binance address.Minumum sold : 0.01 BtcI'll buy 5000 USDT worth of Bitcoin in this case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 27, 2023, 10:55:05 PM",
      "body": "What is your acceptable payment method?USDT? Or other altcoins?Also, why not just sell off the Bitcoins on Binance exchange at the market price rather than dispose it off here at a loss of 17%? It doesn't make sense at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecapital",
      "created_time": "September 27, 2023, 11:03:15 PM",
      "body": "Our system is an internationally licensed gambling company. We have the right to exchange with USDT for the legal status of our company.  Since we have reached our limits, we cannot make exchange transactions within the country.ThanksGrandpashabet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 27, 2023, 11:03:25 PM",
      "body": "I don't know rick, looks fake.Is there some minimum amount to buy? Explait a little better how the process will be, this is going to be inside or outside of binance page?I am interested in buy some of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecapital",
      "created_time": "September 27, 2023, 11:23:29 PM",
      "body": "Dear Sir;Yes. Binince WalletMinimum 0.01 BtcPlease Whatsaap ör email ?Thanks Grandpashabet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MadHatters",
      "created_time": "September 28, 2023, 11:01:22 AM",
      "body": "Im interested but i dont know how we can deal?Check PM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "September 28, 2023, 01:13:14 PM",
      "body": "Be careful everyone! This smells like a scam. If you reached limits in Binance then why not create accounts from the other top exchanges? It doesn't make any sense.To those who try to make deals with OP. Use the reliable escrows here in the forum to avoid getting scammed. You might think you can buy cheap in the end you are losing your funds. And do not trust newbies that might act as proofs that they made successful trades with OP.List of escrow services in the forum: https://bitcointalk.org/index.php?topic=2439910.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecapital",
      "created_time": "September 28, 2023, 06:58:18 PM",
      "body": "Please do not give us advice. We also know how to sell bitcoin at the current exchange rate on the stock exchanges. But since we have a gambling license, changing certain limits is prohibited in our country and we have to tax it. We do not have anything to do with the poor. Do you know the tax problems of gambling license companies? I think no. Don't waste your time.Thanks Grandpashabet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 28, 2023, 08:50:00 PM",
      "body": "Quote from: thecapital on September 28, 2023, 06:58:18 PMPlease do not give us advice. We also know how to sell bitcoin at the current exchange rate on the stock exchanges. But since we have a gambling license, changing certain limits is prohibited in our country and we have to tax it. We do not have anything to do with the poor. Do you know the tax problems of gambling license companies? I think no. Don't waste your time.Thanks GrandpashabetWell Well, Well, It seems like your so-called internationally licensed gambling company is shady. Probably a scam or a fraud according to the so many complaints I have seenlike here - https://www.sikayetvar.com/en/grand-pasha-bet-us (28 complaints and all are unresolved!)Perhaps you are trying to sell your stolen Bitcoins through other users, now that Binance and other exchanges may block your funds?Any one thinking of dealing with this guy. Think twice. The offer is too good to be true!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 28, 2023, 09:22:23 PM",
      "body": "Which payment method do you take?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "September 28, 2023, 09:41:49 PM",
      "body": "Quote from: TryNinja on September 28, 2023, 09:22:23 PMWhich payment method do you take?Apparently, he will be taking your USDT for his BTC at a discounted rate of 17%, and he seems to specifically want a binance Bitcoins address. Not sure why, maybe internal transfer. But personally, I will pass this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betfair23",
      "created_time": "September 28, 2023, 10:52:05 PM",
      "body": "Quote from: thecapital on September 27, 2023, 09:34:47 PMWithin our company, our bitcoin price is sold at a 17% discount. Currently, 16 bitcoins are offered for sale. Those who are interested can please apply with their binance address.Minumum sold : 0.01 Btcsénd me your WhatsApp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 28, 2023, 10:57:54 PM",
      "body": "Quote from: logfiles on September 28, 2023, 09:41:49 PMQuote from: TryNinja on September 28, 2023, 09:22:23 PMWhich payment method do you take?Apparently, he will be taking your USDT for his BTC at a discounted rate of 17%, and he seems to specifically want a binance Bitcoins address. Not sure why, maybe internal transfer. But personally, I will pass this one.Since OP is a Newbie with only 4 posts and no reputation whatsoever, I believe he will agree to send the 17% discounted BTC *first* (only to trusted users, of course), right OP? If that's the case, am I trusted enough? I'll send the USDT as soon as the BTC gets 6 confirmations on my wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "September 29, 2023, 08:30:04 AM",
      "body": "Quote from: thecapital on September 28, 2023, 06:58:18 PMPlease do not give us advice. We also know how to sell bitcoin at the current exchange rate on the stock exchanges. But since we have a gambling license, changing certain limits is prohibited in our country and we have to tax it. We do not have anything to do with the poor. Do you know the tax problems of gambling license companies? I think no. Don't waste your time.Thanks GrandpashabetYou create a business then you follow the rules. Smart people already knew the rules and conditions before entering this type of business. If you have high profits lately then it is just that you also need to pay higher taxes to your country as well. If you are legit then literally what you are trying to do is tax evasion which is illegal. Although I highly doubt you are legit.But you can prove yourself as legit by catering to TryNinja's offer. The guy is one of the most trusted people in this forum with lots of green trusts as proofs. You send first then the USDT will follow. If you do it I am pretty sure some people here will avail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "apogio",
      "created_time": "September 29, 2023, 10:51:46 AMLast edit: September 29, 2023, 11:16:14 AM by apogio",
      "body": "Quote from: thecapital on September 28, 2023, 06:58:18 PMPlease do not give us advice. We also know how to sell bitcoin at the current exchange rate on the stock exchanges. But since we have a gambling license, changing certain limits is prohibited in our country and we have to tax it. We do not have anything to do with the poor. Do you know the tax problems of gambling license companies? I think no. Don't waste your time.Thanks GrandpashabetIn this forum, advice is and always be acceptable. I don't claim you are a scammer. But people must be warned, because there are a lot of scammers out there. At the same time, you should be glad that he told other users to take precautions and use proper escrow tactics. Is there a problem with that? Escrows are mandatory in this kind of transactions.Quote from: thecapital on September 27, 2023, 09:34:47 PMWithin our company, our bitcoin price is sold at a 17% discount. Currently, 16 bitcoins are offered for sale. Those who are interested can please apply with their binance address.Minumum sold : 0.01 BtcHow exactly will you check if the address is indeed held by Binance? Why do you want Binance address specifically. Did you mean to say \"Bitcoin address\"?If not and you are willing to send first, then I am interested.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 29, 2023, 01:25:05 PM",
      "body": "Quote from: apogio on September 29, 2023, 10:51:46 AMHow exactly will you check if the address is indeed held by Binance? Why do you want Binance address specifically. Did you mean to say \"Bitcoin address\"?I am still confused how he will verify this. He may wait until the coins are withdrawn from Binance wallet to the cold storage, which is often registered by Binance and can easily checked.If you got bitcoin with +6 confirmations, this does not mean that you are safe, as your Binance account is linked to your KYC, and this person may be trying to link his bitcoins to another account to hide his crime. 17% discount is too good to be true.@op Have you thought about using a mixing service, if not, click UniJoin link in my signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 30, 2023, 06:42:17 AM",
      "body": "Quote from: thecapital on September 28, 2023, 06:58:18 PMPlease do not give us advice.The warning isn't for you, scammer! The warning is for your gullible victims.QuoteWe also know how to sell bitcoin at the current exchange rate on the stock exchanges. But since we have a gambling license, changing certain limits is prohibited in our countrySo, you're using \"I'm breaking the law\" to convince your scam victims. Nice try.Quoteand we have to tax it.Again: using tax evasion to convince your scam victims.QuoteWe do not have anything to do with the poor.You are poor! But feel free to prove me wrong: sign a message showing you own 16 Bitcoin.QuoteDo you know the tax problems of gambling license companies? I think no.Tax is not a problem for legit companies.QuoteDon't waste your time.Don't come here to scam people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Warcrafthero",
      "created_time": "October 16, 2023, 03:27:43 PM",
      "body": "Quote from: thecapital on September 27, 2023, 09:34:47 PMWithin our company, our bitcoin price is sold at a 17% discount. Currently, 16 bitcoins are offered for sale. Those who are interested can please apply with their binance address.Minumum sold : 0.01 BtcAre you open to send first to trusted members here as mentioned before? For ex TryNinja's suggestion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 30, 2023, 09:49:06 PM",
      "body": "This guy claims that he got scammed by OP, but then he quickly deleted the post. I am not sure why. But if he got scammed, it's a shame because this post has warnings from the word go. Here is the archived post - https://ninjastic.space/post/63075570QuoteHim scam send money no send acc : https://prnt.sc/2x9rkzXJDAHI",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}