{
  "id": "topic_5503461",
  "title": "Amadi x",
  "author": "Amadi x",
  "created_time": "July 19, 2024, 07:46:51 AM",
  "content": "What happened?As stated by former us president, Donald trump \"He believes That Digital currencies need to be made in the USA, in order to counter China's growing influence.He shifts align with a border strategy to position the US as a leader in Emerging technologies.Donald trump Is really drawing support from the crypto community , with some seeing this as some form of charade..And others as a kind of light at the tunnel..But whatever the case, we will keep showing our support for trump.We believe trump's administration may give hope to cryptoprenuers🌚",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5503461",
  "comments": [
    {
      "author": "fuguebtc",
      "created_time": "July 19, 2024, 09:34:46 AM",
      "body": "Topics about Trump are flooding forums, twitter...It is unknown what the results of the November election will be, but it seems he has succeeded in attracting everyone's attention, especially investing in cryptocurrency. I find it absurd that many people keep bringing up the past to evaluate his present because he is not the only person who changed his opinion about bitcoin after spending time researching it. It is true that we still cannot confirm 100% that he is serious about crypto or not , but with him, we are getting more hopeful when compared to what the Biden administration is. I would bet on him over Biden in this election.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "July 19, 2024, 10:03:20 AM",
      "body": "There’s already so many discussions about this. Whether he means it or not, no one can know unless he actually do something whether he is elected or not. Believe what you want to believe and support who you want to support. Further discussion about a topic that has been discussed many times in the forum isn’t gonna change the possible outcomes of the upcoming election.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 19, 2024, 10:15:38 AM",
      "body": "Trump currently seems very likely to win the US elections. Unless the Democrats come up with a very good replacement for Biden and manage to unite people around a figure that can appeal both to Democrats and to at least some Republicans, that is. His policy on cryptos has shifted, that much is true. But for now, it's still presidential campaign promises, nothing more. Also, the idea of creating cryptos in the US to counter the influence of China is not very pro-crypto because it's not a decentralization-driven approach and also since we don't need more altcoins. But perhaps the op is referring to the idea of Bitcoin being 'made in the USA', which is about being supportive of Bitcoin mining. In that case, it's good news for Bitcoin miners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "July 19, 2024, 05:47:28 PM",
      "body": "Quote from: Amadi x on July 19, 2024, 07:46:51 AMDonald trump Is really drawing support from the crypto community , with some seeing this as some form of charade..And others as a kind of light at the tunnel..But whatever the case, we will keep showing our support for trump.We believe trump's administration may give hope to cryptoprenuers🌚This is not about Trump in particular, but what we want is a presidential candidate who will stand by his words and support for bitcoin adoption in US, we are not even moved by Trump's past expression of displeasure towards bitcoin, what we know is that people change over time, that is not goin going to be a counter attack on his campaign to be the next president, but we can also consider the sincerity for all that he is saying to be in place regarding bitcoin if he emerges a winner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdbase",
      "created_time": "July 19, 2024, 06:39:39 PM",
      "body": "Trump doesn't care about things specifically. You must understand this of such a business man like this.He only cares about things that can make him money!With his hands in NFT & Memecoins such as this one:Whether he created them or not.They were made in his image and likeness.So don't be surprised one day when he goes after the so called creators of these projects and takes them to court on copyright laws and files to get compensation from them.It is America after all, where it is your right to sue someone if you feel your being taken advantage of for any reason whatsoever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "July 19, 2024, 07:55:18 PM",
      "body": "Quote from: Amadi x on July 19, 2024, 07:46:51 AMWhat happened?As stated by former us president, Donald trump \"He believes That Digital currencies need to be made in the USA, in order to counter China's growing influence.He shifts align with a border strategy to position the US as a leader in Emerging technologies.Donald trump Is really drawing support from the crypto community , with some seeing this as some form of charade..And others as a kind of light at the tunnel..But whatever the case, we will keep showing our support for trump.We believe trump's administration may give hope to cryptoprenuers🌚What isn’t to love about this? Trump embracing crypto seems like such a huge win for Bitcoin and believe me (in trump voice) there has never been a greater win for Bitcoin and crypto until I endorsed it, the bull market will be YUGE.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "July 19, 2024, 08:03:24 PM",
      "body": "Quote from: Amadi x on July 19, 2024, 07:46:51 AMBut whatever the case, we will keep showing our support for trump.We believe trump's administration may give hope to cryptoprenuersPolitics is a game of interest and does not mean the entire Bitcoin communities must have their supports for Trump's just on the fact that he is pushing an agitation towards the solidarities of the community.He has his personal interest in the political sector so we Bitcoin enthusiasts also do have our own interests individually as the interests in politics is concerned.I do wish him well though but every one of us must not take it too personal as compulsory of giving him our supports.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "July 19, 2024, 08:06:58 PM",
      "body": "He's a businessman and crypto is a big market to take over. If Fink is promoting it you can bet others will too. BlackRock works like a magnet for these rich people and you can see them being attracted every month. Musk suddenly supports Trump, Jamie Dimon seems to be changing his stance because he can't be anti bitcoin when Trump is not and there's a career in politics awaiting Jamie if Trump wins... It's funny how the whole animal kingdom sees the alpha and runs from Biden to Trump. Musk, who used to vote for Democrats is a good example of this great shift. I don't care who wins, but if you're a US citizen, you should. Biden is a weak old man who won't survive a whole term if elected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "July 19, 2024, 08:28:21 PM",
      "body": "Quote from: EluguHcman on July 19, 2024, 08:03:24 PMQuote from: Amadi x on July 19, 2024, 07:46:51 AMBut whatever the case, we will keep showing our support for trump.We believe trump's administration may give hope to cryptoprenuersPolitics is a game of interest and does not mean the entire Bitcoin communities must have their supports for Trump's just on the fact that he is pushing an agitation towards the solidarities of the community.Believe it or not but you can see that the name Trump has been on the media since he made mention of supporting Bitcoin if he is been elected as the next president of America.You need to believe this, the strategy that Trump is using so far has placed him as the favourite so far to win in the election because from the speech of Biden, he seems incapable of ruling again because he has made some unbelievable mistakes which a lot of his then supporters are not going to take likely with him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amadi x",
      "created_time": "July 19, 2024, 09:35:49 PM",
      "body": "Quote from: tread93 on July 19, 2024, 07:55:18 PMQuote from: Amadi x on July 19, 2024, 07:46:51 AMWhat happened?As stated by former us president, Donald trump \"He believes That Digital currencies need to be made in the USA, in order to counter China's growing influence.He shifts align with a border strategy to position the US as a leader in Emerging technologies.Donald trump Is really drawing support from the crypto community , with some seeing this as some form of charade..And others as a kind of light at the tunnel..But whatever the case, we will keep showing our support for trump.We believe trump's administration may give hope to cryptoprenuers🌚What isn’t to love about this? Trump embracing crypto seems like such a huge win for Bitcoin and believe me (in trump voice) there has never been a greater win for Bitcoin and crypto until I endorsed it, the bull market will be YUGE.”We cross our fingers 🤞..And expect the best of Trump",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "July 19, 2024, 10:01:26 PM",
      "body": "I am very curious to know what happens to Bitcoin myself if Trump is elected.  I did not hear of miracles during his last Presidency and historically speaking, I think it is a bad idea to propel an imaginary future based on what a Politician claims to do once they are elected.  I do not think I know of ANY President of the World that actually did what they promised they were going to do.So let the facts speak and not his words.  I honestly want Trump to win just so we can all confirm whether these were just words for influence or he is truly going to do what he promises and make Cryptocurrencies better.  Keep in mind however, I do not live in the United States.  This is why I do not really care whether it is Trump or Biden, they both seem unfit in my opinion anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "July 19, 2024, 10:14:20 PM",
      "body": "Quote from: Amadi x on July 19, 2024, 07:46:51 AMWhat happened?This is an example that somebody can change their opinions on something, even our mentors or role models. Can you just imagine the number of persons who did not invest in cryptocurrency earlier because Donald trump had a negative opinion about it then and these people consider Donald trump or role model who they take their opinions seriously. They will regret a lot, and be ashamed of themselves. Quote from: PrivacyG on July 19, 2024, 10:01:26 PMSo let the facts speak and not his words.  I honestly want Trump to win just so we can all confirm whether these were just words for influence or he is truly going to do what he promises and make Cryptocurrencies better.  I do not trust politicians so much as well, but we are watching again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "July 19, 2024, 10:16:36 PM",
      "body": "Quote from: fuguebtc on July 19, 2024, 09:34:46 AMTopics about Trump are flooding forums, twitter...It is unknown what the results of the November election will be, but it seems he has succeeded in attracting everyone's attention, especially investing in cryptocurrency. I find it absurd that many people keep bringing up the past to evaluate his present because he is not the only person who changed his opinion about bitcoin after spending time researching it. It is true that we still cannot confirm 100% that he is serious about crypto or not , but with him, we are getting more hopeful when compared to what the Biden administration is. I would bet on him over Biden in this election.If you think the forum is the only placer that people are talking about Trump's alignment with crypto, you'd be surprised. All over CT, even solana meme tokens have been created for it. To top it up, there is an active prediction market on polymarket with Trump currently leading the market with 66% of people betting on Trump to win the elections. The reason why everyone is talking about and is still skeptical about Trump's U-turn to crypto is because his government weren't any friendlier than this Biden administration. It was still all duct-tape like kind of regulations with no clarity. Whether he would make good on his crypto promises remains to be seen. Personally, I have my fingers crossed. Source: https://polymarket.com/event/presidential-election-winner-2024/will-donald-trump-win-the-2024-us-presidential-election?tid=1721427201314",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 19, 2024, 10:38:43 PM",
      "body": "If there is anything I keep telling myself every day, it is to never trust Governments and politicians. Politicians can literary look very down to earth and friendly until you hand them power through the ballot box. That's when the real circus begins. I have seen certain countries and their allies ask for Donations even through crypto payments and gladly receive the coins just because they are at war and need all the necessary funds to buy more weapons only for them to backstab crypto adoption later.So the news that so-and-so back Bitcoin doesn't excite my any bit. Those guys are just dealers and businessmen making calculated movements. Anything that can favor them to win will be welcomed in a mean time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "July 19, 2024, 10:45:00 PM",
      "body": "Quote from: logfiles on July 19, 2024, 10:38:43 PMI have seen certain countries and their allies ask for Donations even through crypto payments and gladly receive the coins just because they are at war and need all the necessary funds to buy more weapons only for them to backstab crypto adoption later.Pretty much so.  I have seen this weird behavior too.  Cryptocurrencies are seen as weapon of Criminals only when Politicians and Governments want to.  But when they need Money, they would do any thing.  Even accept 'tainted Currencies', not giving a damn all of a sudden where they come from and how much one person sends.  I do have a list in my mind of such countries.  And I really, really want to know what their stance on Bitcoin will be once they stop needing Donations.  Because I unfortunately expect the same, negative behavior we have previously seen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "July 20, 2024, 04:36:27 AM",
      "body": "Trump and his family have always been charlatans. They are not pro-crypto, they are pro making money and scamming people. Trump is only speaking at a Bitcoin conference because the CEO of Bitcoin Magazine promised to raise $15 million dollars for his campaign. Trump Jr. is on Twitter promoting a scam token that is sponsoring an event he’s doing. The idea their support for crypto is genuine is laughable, and the Trumps are laughing straight to the bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "July 20, 2024, 12:07:15 PM",
      "body": "Quote from: Amadi x on July 19, 2024, 07:46:51 AMWe believe trump's administration may give hope to cryptoprenuersThis is what I expected and decided to support him even though I don't like him any more than Biden because no American politician is a truly good person. The Biden administration is not friendly to the cryptocurrency market by imposing many harsh regulations, ordering the SEC to crack down on cryptocurrencies...So I don't think there is any reason to continue supporting the current government. Instead, I will support and pin my hopes on the new administration, and while there is no guarantee that Trump will do what he says, at least we have a better chance than we have now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 20, 2024, 12:12:55 PM",
      "body": "Trump will send bitcoin to the moon again.He will win the elections in November and before that he will probably say something huge at the bitcoin conference on 27/July. Even if he doesn’t say anything big, it is already awesome enough to see him talking there. Biden had its chance, he decided to be an enemy of crypto. Trump won’t repeat his mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "July 20, 2024, 01:22:57 PM",
      "body": "Quote from: fuguebtc on July 19, 2024, 09:34:46 AMTopics about Trump are flooding forums, twitter...It is unknown what the results of the November election will be, but it seems he has succeeded in attracting everyone's attention, especially investing in cryptocurrency. I find it absurd that many people keep bringing up the past to evaluate his present because he is not the only person who changed his opinion about bitcoin after spending time researching it. It is true that we still cannot confirm 100% that he is serious about crypto or not , but with him, we are getting more hopeful when compared to what the Biden administration is. I would bet on him over Biden in this election.Trump is a very influential person, he loves the media and as a one time president of the United States, news about him would always circulate the media, and let's not also forget that he's beginning to support the best Cryptocurrency which is Bitcoin, well whether he's using it as an agenda to win the election by trying to gain full support of the Bitcoin Community, it think it's a win for Cryptocurrency.Yeah, it shouldn't be a thing of suprise because at first people where scared of the project, me in person never believe it due to certain reasons, but when I saw the potential of the project, read about it and pictured Satoshi's vision, I noticed that the project gives hope to the common man and I believe trump must have discovered something spectacular about Bitcoin to have a change of mind, left for me I'll support anyone or anything that gives hope or tries to give hope to the common man. 😊",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}