{
  "id": "topic_5466108",
  "title": "216kedi",
  "author": "216kedi",
  "created_time": "September 08, 2023, 12:20:05 PM",
  "content": "Hello BitcoinTalk community,I've encountered a perplexing issue with a recent transaction and I'm hoping to get some insights or assistance from the knowledgeable members here.**Background:**I executed a series of transactions directly from a node using this script: https://github.com/codeunsolved/brc20tool I've used this script multiple times in the past without any hitches.**Details:**- **BTC Payment Address:** `bc1p8welxq7lx55ane5nhcwfe00k6k6c9m5lty3crnvhwlnalykz2srqhm38zr`.  - **Transaction ID:** https://mempool.space/tx/369a184f3e941a501b99a2865f6c1db09f39af379ef8c63fb52689e37e3376a7On mempool, the transaction seems to have over 300 confirmations. However, decoding the HEX indicates 0 confirmations, suggesting it hasn't been included in any block. I attempted to mint SATS tokens 500 times in one go, but only 20 reached my address. The intermediary BTC was transferred correctly, but it seems there's a hiccup in the processing.**HEX Snippet:** ```Code:],\"block_height\": -1,\"block_index\": -1,\"confirmations\": 0,\"double_spend\": false,\"fees\": 367829,\"hash\": \"369a184f3e941a501b99a2865f6c1db09f39af379ef8c63fb52689e37e3376a7\",\"inputs\": [```**Ordinals Link:**https://ordinals.com/tx/369a184f3e941a501b99a2865f6c1db09f39af379ef8c63fb52689e37e3376a7Has anyone experienced something similar or can shed some light on what might be happening? Any guidance or suggestions would be greatly appreciated.Thank you in advance for your time and assistance.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466108",
  "comments": [
    {
      "author": "Cricktor",
      "created_time": "September 09, 2023, 09:39:01 PM",
      "body": "I don't know of what kind of hex decoding you're talking about and how and why you come to the conclusion that the transaction is not yet confirmed when it is. The transaction 369a184f3e941a501b99a2865f6c1db09f39af379ef8c63fb52689e37e3376a7 has been mined into block 806372.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "September 12, 2023, 03:40:41 AM",
      "body": "Quote from: ETFbitcoin on September 10, 2023, 12:23:09 PMQuote from: 216kedi on September 08, 2023, 12:20:05 PM-snip-How did you get this data (at least i know it's not from Bitcoin Core and mempool.space API)? Anyway, it seems to be outdated information.Looks like a result from Blockcypher's decode raw transaction page. (the shown json output part has striking similarity)And for some reason, they currently show 0-confirmation on every decoded transaction even if it's mined already.Here's for reference: live.blockcypher.com/btc/decodetx/Quote from: 216kedi on September 08, 2023, 12:20:05 PMHas anyone experienced something similar or can shed some light on what might be happening? Any guidance or suggestions would be greatly appreciated.As far as Bitcoin is concerned, the transaction is already sent and included in the blockchain,any missing ordinal token issue is Altcoin territory and most people here may be unable to help,you can try their forum or the Altcoins board for more fitting support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}