{
  "id": "topic_5412899",
  "title": "Mitch212",
  "author": "Mitch212",
  "created_time": "September 08, 2022, 03:44:16 PM",
  "content": "So i feel generous and i would like to give someone 25 bucks in litecoin am I allowed to do that? No rules nothing to do",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412899",
  "comments": [
    {
      "author": "BitcoinHodler",
      "created_time": "September 08, 2022, 03:47:39 PM",
      "body": "the giveaway threads are posted in games and rounds board[1] but the sticky there[2] says that if your payment is in altcoins you have to post it in Bounties (Altcoins) board[3].[1] https://bitcointalk.org/index.php?board=71.0[2] https://bitcointalk.org/index.php?topic=5341846.0[3] https://bitcointalk.org/index.php?board=238.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 08, 2022, 04:26:52 PM",
      "body": "Quote from: Mitch212 on September 08, 2022, 03:44:16 PMSo i feel generous and i would like to give someone 25 bucks in litecoin am I allowed to do that? No rules nothing to doNo, unfortunately it is not allowed to do that on the forum. You can do giveaways off-site (for example, google form) and post a link in this thread, but you can't give people any incentive for replying to your thread.Quote from: theymos on January 27, 2014, 06:11:50 AMMost giveaway threads are no longer allowed in the Alternate cryptocurrencies sections. From now on, posting or replying to such threads could result in being banned. Existing threads will be locked.Specifically, you are not allowed to give people any incentive to post insubstantial posts in your threads. You can't offer to pay people who post their addresses, usernames, etc. You can do giveaways off-site and link to the giveaway page in a thread, but you can't give people any bonus for replying to your thread.Similar threads are already restricted to Games and Rounds in the non-altcoin sections, but the giveaway-related post volume is so high in the altcoin sections that I've decided to just ban them entirely here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mprep",
      "created_time": "September 08, 2022, 05:39:36 PM",
      "body": "If you're OK with accepting entries via PM or off-site (e.g. via Google Forms) as opposed to posting them in one or more threads (which isn't allowed), yeah, you are. Post it in Bounties (Altcoins).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 09, 2022, 09:35:11 AM",
      "body": "Quote from: mprep on September 08, 2022, 05:39:36 PMIf you're OK with accepting entries via PM or off-site (e.g. via Google Forms) as opposed to posting them in one or more threads (which isn't allowed), yeah, you are. Post it in Bounties (Altcoins).I've just looked it up and from what I see:* In Bounties (Altcoins) one of the pinned posts tells \"Giveaway threads are not allowed\"* OP has tried to start a giveaway, but** somebody has ignored OP request (for PM) and answered with address** the whole topic got removed (found topic 5412920 in modlog)While I understand that the rules are there to avoid mindless spam, I also feel for users like OP and maybe we can do something about it.I mean, look at the sheer number of (nice!) raffles in collectible section. Maybe we should somehow find a solution for this?Quote from: Mitch212 on September 08, 2022, 03:44:16 PMSo i feel generous and i would like to give someone 25 bucks in litecoin am I allowed to do that? No rules nothing to doGiveaway with no rules means some may create 100s of new accounts to participate. Maybe you want to do better",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mprep",
      "created_time": "September 09, 2022, 10:23:00 AM",
      "body": "Quote from: NeuroticFish on September 09, 2022, 09:35:11 AMQuote from: mprep on September 08, 2022, 05:39:36 PMIf you're OK with accepting entries via PM or off-site (e.g. via Google Forms) as opposed to posting them in one or more threads (which isn't allowed), yeah, you are. Post it in Bounties (Altcoins).I've just looked it up and from what I see:* In Bounties (Altcoins) one of the pinned posts tells \"Giveaway threads are not allowed\"* OP has tried to start a giveaway, but** somebody has ignored OP request (for PM) and answered with address** the whole topic got removed (found topic 5412920 in modlog)While I understand that the rules are there to avoid mindless spam, I also feel for users like OP and maybe we can do something about it.I mean, look at the sheer number of (nice!) raffles in collectible section. Maybe we should somehow find a solution for this?AFAIK I didn't remove that thread. If it were up to me, I would've just deleted the post with the address (as well as any subsequent posts of such nature).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 09, 2022, 10:39:02 AM",
      "body": "Quote from: mprep on September 09, 2022, 10:23:00 AMAFAIK I didn't remove that thread. If it were up to me, I would've just deleted the post with the address (as well as any subsequent posts of such nature).If this sounded like an attack or complaint, apologies for that, it's not intended.My intention is to give all the details, be constructive, see what we can do, since it's not the first request like this (although I also agree they're were very few), especially as I expect OP is disappointed by how the things have gone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "September 09, 2022, 09:27:03 PM",
      "body": "Quote from: Mitch212 on September 08, 2022, 03:44:16 PMSo i feel generous and i would like to give someone 25 bucks in litecoin am I allowed to do that? No rules nothing to doAt first I was thinking that it is merit giveaway promo that you are about do and when I checked your Merits. I confused but later I came to understand that it is coin giveaway. I believed you are allowes but Please do not throw it away. There are some people that 25 litecoins, even in this irfan_pak10 people are hustling to have that number to feed their stomach or family. although there a lot of giveaway threads in the forum but use it to help the most needies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "September 10, 2022, 06:00:47 AM",
      "body": "I feel that there should be a giveaway subforum under Bounties. Since that section doesn't sound appropriate for giveaways, many people who wrongly post them elsewhere might risk seeing their threads go poof or worse, get suspended. Also, those GAs might even be drowned out by other bounty threads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 10, 2022, 07:17:23 AM",
      "body": "Quote from: FatFork on September 08, 2022, 04:26:52 PMNo, unfortunately it is not allowed to do that on the forum. You can do giveaways off-site (for example, google form) and post a link in this thread, but you can't give people any incentive for replying to your thread.Alternatively, instead of giving away Litecoin, Mitch212 could use an instant exchanger (such as FixedFloat) and convert it to Bitcoin. That way, he's allows to make an on-forum giveaway in Games and Rounds.Quote from: NeuroticFish on September 09, 2022, 09:35:11 AMWhile I understand that the rules are there to avoid mindless spam, I also feel for users like OP and maybe we can do something about it.I tried: Suggestion: allow on-forum altcoin giveaways for established altcoins. It didn't happen.Quote from: FatFork on September 08, 2022, 04:26:52 PMyou can't give people any incentive for replying to your thread.Unless you ask them to post the same \"proof of authentication\" BS in dozens of threads, then it's totally fine Quote from: UserU on September 10, 2022, 06:00:47 AMI feel that there should be a giveaway subforum under Bounties.I get why on-forum altcoin giveaways were banned: it lead to huge spam. But considering the millions upon millions of useless bounty posts, I don't think giving away some actual value in any altcoin would be worse than that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "September 10, 2022, 07:39:41 AM",
      "body": "Quote from: LoyceV on September 10, 2022, 07:17:23 AMI get why on-forum altcoin giveaways were banned: it lead to huge spam. But considering the millions upon millions of useless bounty posts, I don't think giving away some actual value in any altcoin would be worse than that.Exactly. An altcoin like LTC is miles better than shitcoin XYZ anyday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yawa2020",
      "created_time": "September 10, 2022, 08:20:58 AM",
      "body": "Quote from: Mitch212 on September 08, 2022, 03:44:16 PMSo i feel generous and i would like to give someone 25 bucks in litecoin am I allowed to do that? No rules nothing to doIn as far as I commend your generosity, it's unwise to do giveaway without taking some criteria into consideration. Although it is your wish to do it in a way that suit you but I would advise you to set certain criteria in order to minimize spam and of course to allow the less privilege benefit from it. It will go a long way for people here also fund raising for flood disaster in Pakistan.The above is just a recommendation and not trying to make you act against your wish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 11, 2022, 08:33:30 AM",
      "body": "You can't do an altcoin giveaway and call it a giveaway, but you can call it a bounty, post it in the bounty section, and have the applicants complete a meaningless task like following you on Telegram/Twitter or something like that. Bounty reports are also allowed, so you can ask them to post proof in your bounty thread that the task was completed. After that, it's up to you to decide who gets the Litecoin bounty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mprep",
      "created_time": "September 11, 2022, 09:57:25 AM",
      "body": "Quote from: Pmalek on September 11, 2022, 08:33:30 AMYou can't do an altcoin giveaway and call it a giveaway, but you can call it a bounty, post it in the bounty section, and have the applicants complete a meaningless task like following you on Telegram/Twitter or something like that. Bounty reports are also allowed, so you can ask them to post proof in your bounty thread that the task was completed. After that, it's up to you to decide who gets the Litecoin bounty. Not really: https://bitcointalk.org/index.php?topic=3953664.0.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 11, 2022, 10:05:27 AM",
      "body": "Quote from: mprep on September 11, 2022, 09:57:25 AMNot really: https://bitcointalk.org/index.php?topic=3953664.0.So asking a single retweet isn't allowed, but spamming Twitter 50 times is okay? Maybe theymos just really hates Twitter and Facebook",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mprep",
      "created_time": "September 11, 2022, 10:10:21 AM",
      "body": "Quote from: LoyceV on September 11, 2022, 10:05:27 AMQuote from: mprep on September 11, 2022, 09:57:25 AMNot really: https://bitcointalk.org/index.php?topic=3953664.0.So asking a single retweet isn't allowed, but spamming Twitter 50 times is okay? Maybe theymos just really hates Twitter and Facebook The \"no low effort tasks\" thing is meant to prohibit attempts at bypassing the \"no altcoin giveaways\" rule. And, naturally, anything that's not prohibited or restricted is allowed so yeah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 11, 2022, 10:11:27 AM",
      "body": "Quote from: mprep on September 11, 2022, 10:10:21 AMThe \"no low effort tasks\" thing is meant to prohibit attempts at bypassing the \"no altcoin giveaways\" rule. And, naturally, anything that's not prohibited or restricted is allowed so yeah.Thinking out of the box here: how about 50 pushups?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mprep",
      "created_time": "September 11, 2022, 10:18:14 AM",
      "body": "Quote from: LoyceV on September 11, 2022, 10:11:27 AMQuote from: mprep on September 11, 2022, 10:10:21 AMThe \"no low effort tasks\" thing is meant to prohibit attempts at bypassing the \"no altcoin giveaways\" rule. And, naturally, anything that's not prohibited or restricted is allowed so yeah.Thinking out of the box here: how about 50 pushups?If the participant can prove he did it in his entry, sure. Couldn't really call doing 50 pushups AND creating as well as uploading proof for it low effort.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "September 11, 2022, 12:49:21 PM",
      "body": "Quote from: NeuroticFish on September 09, 2022, 09:35:11 AMWhile I understand that the rules are there to avoid mindless spam, I also feel for users like OP and maybe we can do something about it.I mean, look at the sheer number of (nice!) raffles in collectible section. Maybe we should somehow find a solution for this?Honestly, I don't understand why there's a rule against it. If someone has good intention to bless others with a raffle or freebies, it shouldn't be stopped. I guess something must've happened in the past that made theymos institute that restriction to forestall a further abuse of opening threads for giveaways but we should realize that times have changed and I think that ban should be revisited and reviewed.QuoteGiveaway with no rules means some may create 100s of new accounts to participate. Maybe you want to do better  Yes, there should be rules guiding such activity. We shouldn't throw the baby out with the bathwater. There should exist a mechanism to sieve through or punishment when offenders are caught just like what happens with those who abuse campaigns with alts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "September 11, 2022, 03:21:01 PM",
      "body": "Quote from: Mitch212 on September 08, 2022, 03:44:16 PMSo i feel generous and i would like to give someone 25 bucks in litecoin am I allowed to do that? No rules nothing to doYes, you have two options here.  I hope you think seriously on these two options and not just canel the idea of giving the giveaway to the community.Quote from: mprep on September 08, 2022, 05:39:36 PMIf you're OK with accepting entries via PM or off-site (e.g. via Google Forms) as opposed to posting them in one or more threads (which isn't allowed), yeah, you are. Post it in Bounties (Altcoins).Quote from: LoyceV on September 10, 2022, 07:17:23 AMAlternatively, instead of giving away Litecoin, Mitch212 could use an instant exchanger (such as FixedFloat) and convert it to Bitcoin. That way, he's allows to make an on-forum giveaway in Games and Rounds.If still, this does not suit you, you may donate the giveaway amount here [Donations] Fundraising for the Floods   This can be the best use of giveaway",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}