{
  "id": "topic_5475769",
  "title": "Justinopet",
  "author": "Justinopet",
  "created_time": "November 28, 2023, 10:53:05 AM",
  "content": "It is obvious that no good thing that come easy and when you are not lucky in gambling you are not lucky and a lucky person in everything he tries might still be a lucky person on gambling because i dont see what you know you do consistently and is not favourable to you yet you are still in it, that is stupidity to a reasonable man and even if your taking it to be for funs but definitely you are spending carelessly on it and truly the mindset of a gambler is to get not to loose and on a casino game a real gambler must wisely have a plan and adhere on rules to actualize it target and rich gamblers stake high in a low game which is possible to win but does not get addicted  because he analyse and strategize before staking so if it is not favourable to you does not mean is not favourable to some lucky persons and these are the mindset of rich person(mind)not of the poor person (mind).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475769",
  "comments": [
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 28, 2023, 11:01:56 AM",
      "body": "Quote from: Justinopet on November 28, 2023, 10:53:05 AMIt is obvious that no good thing that come easy and when you are not lucky in gambling you are not lucky and a lucky person in everything he tries might still be a lucky person on gamblingEven your post is like a mess and you must write it better.Gambling is for everyone, rich and poor, they are all welcome in gambling industry. Each person has different reasons to join gambling. It can be because they want to entertain but also try luck to win with money for more fun. It can be because they want to get rich with small money they have. The second type of gamblers will have more risk. Because they will likely gamble irresponsibly and will lose all money and assets they have.Gambling sites have their reminders like \"Gambling Responsibly\" but the second type of gamblers will nearly not mind about that reminder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "November 28, 2023, 11:05:08 AM",
      "body": "If you have money that you can afford to lose, you can use it to gamble and have in mind that you can lose it. It is not about gambling with huge amount of money, you can use little amount of money to gamble. Gambling with huge amount of money is not even advised.Like if you are collecting $100 weekly, you can gamble with 5% which is $5 weekly and enjoy yourself. I mean gambling budget is very important. Mine is just 5% of what I am earning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "angrybirdy",
      "created_time": "November 28, 2023, 11:19:50 AM",
      "body": "Quote from: Justinopet on November 28, 2023, 10:53:05 AMIt is obvious that no good thing that come easy and when you are not lucky in gambling you are not lucky and a lucky person in everything he tries might still be a lucky person on gambling because i dont see what you know you do consistently and is not favourable to you yet you are still in it, that is stupidity to a reasonable man and even if your taking it to be for funs but definitely you are spending carelessly on it and truly the mindset of a gambler is to get not to loose and on a casino game a real gambler must wisely have a plan and adhere on rules to actualize it target and rich gamblers stake high in a low game which is possible to win but does not get addicted  because he analyse and strategize before staking so if it is not favourable to you does not mean is not favourable to some lucky persons and these are the mindset of rich person(mind)not of the poor person (mind).Actually when it comes to gambling, there's no rich or poor as long as you have penny on your pocket, you are allowed to do it. you said that it's all about luck, maybe you're right on that part but you didn't know what a gambler's real reason why they choose to spend money on gambling rather that anything else like investment or such things that benefits them. for me, the mindset of a true gambler should be mind their own business, should gamble responsibly, stay discipline and understand the risks involve. take note that It's okay to lose money because it's a part of the game but always set a standard, budget limit and self limitation to avoid things that will regret in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "November 28, 2023, 11:21:13 AM",
      "body": "Gambling doesn't force everyone to gamble but it is our decision and desires. If you think that gambling is only for rich people and lucky people, then see your friends who are gambling if they are rich and are too lucky just to prove that your claim is right. Because I will tell you mate that gambling is not only it mentions for rich people and those who are willing to lose but is for those who can afford to gamble. But if you care much about your money and only thinking about money, then better not to think about gambling as this is not suit you OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "November 28, 2023, 11:26:27 AM",
      "body": "Paying some little amount to have fun is not stupidity mate, because you go to the cinema to watch movies and you also go to the stadium to watch football and I wouldn't see that as something bad or something not worth to pay for. So is gambling, some people gamble for fun and to make it more interesting they have to stake their bets with money that they can afford to lose, because they already know that the money wouldn't affect their daily expenses.It is when you see gambling as a means of income that you will be disappointed with the outcome of the game when you are not lucky. Gambling is open for everyone just like the way everyone has the right to drink alcohol and you wouldn't say that because some people spend all their bankroll on drinking, because they love drinking that they should stop drinking. What matters here is discipline, you can discipline yourself and make a gambling budget, so that you don't lose more than that amount that you have allocated to your gambling activities. Every gambler has their own lucky moment being it rich or poor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "November 28, 2023, 11:28:54 AM",
      "body": "Quote from: Justinopet on November 28, 2023, 10:53:05 AMIt is obvious that no good thing that come easy and when you are not lucky in gambling you are not lucky and a lucky person in everything he tries might still be a lucky person on gambling because i dont see what you know you do consistently and is not favourable to you yet you are still in it, that is stupidity to a reasonable man and even if your taking it to be for funs but definitely you are spending carelessly on it and truly the mindset of a gambler is to get not to loose and on a casino game a real gambler must wisely have a plan and adhere on rules to actualize it target and rich gamblers stake high in a low game which is possible to win but does not get addicted  because he analyse and strategize before staking so if it is not favourable to you does not mean is not favourable to some lucky persons and these are the mindset of rich person(mind)not of the poor person (mind).Let me tell you one thing that results in this your thoughts about not being profitable or getting positive results in gambling is, Majority of gamblers are gambling with greed. How do you expect to win millions of dollars just with staking a small amount of money and expect to get positive results?. You can't do the same thing over and over again and expect a different result, No way.Take you for instance, Majority of gamblers here in my country side stake games with #100, #200- #500 and with combination of games up 20, 30 and even 50 sometimes in a single slip and are expecting to win such slip, it can only happen with luck or in a rare case. Yes gambling involves luck and also involves knowledge or experience to get positive results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hirose UK",
      "created_time": "November 28, 2023, 11:33:10 AM",
      "body": "Honestly, I don't understand what you are saying because the language style in this writing is really confusing.If we talk about luck or profit, actually not all luck will be profitable especially in gambling.Maybe someone who is lucky can win bet, but it doesn't necessarily mean that the win will be profitable because before or even after the win there will definitely be bigger loss.I personally consider luck to be just about fate and think that the real real advantage belongs to the house edge or the casino owner is not gambler like us.But because with each bet we can win many times the amount wagered, we call it profitable win.By the way, I suggest that in the future you can use punctuation marks in every writing so that we can read and understand it more easily and relevantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "November 28, 2023, 12:00:21 PM",
      "body": "Quote from: Justinopet on November 28, 2023, 10:53:05 AMIt is obvious that no good thing that come easy and when you are not lucky in gambling you are not lucky and a lucky person in everything he tries might still be a lucky person on gambling because i dont see what you know you do consistently and is not favourable to you yet you are still in it, that is stupidity to a reasonable man and even if your taking it to be for funs but definitely you are spending carelessly on it and truly the mindset of a gambler is to get not to loose and on a casino game a real gambler must wisely have a plan and adhere on rules to actualize it target and rich gamblers stake high in a low game which is possible to win but does not get addicted  because he analyse and strategize before staking so if it is not favourable to you does not mean is not favourable to some lucky persons and these are the mindset of rich person(mind)not of the poor person (mind).I think in gambling, everything is equal as to what chances you are going to get in that particular games, regardless if you are a rich person (mindset) or the poor. Of course, you will want to be as positive as you can be, but it's not enough as luck really plays a big factor here.But then again, the title is somewhat misleading to me, even if you are rich and have the mindset of a rich person, it could not be apply to gambling as it is. Because every person has different luck to begin with and we don't have control of the results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "November 28, 2023, 12:08:40 PM",
      "body": "Gambling is not only for the rich because anyone can gamble with any amount of money they have for fun and a chance to win more. Gambling is not just for the lucky, It is also for the skillful.Quote from: Justinopet on November 28, 2023, 10:53:05 AMIt is obvious that no good thing that come easy and when you are not lucky in gambling you are not lucky and a lucky person in everything he tries might still be a lucky person on gambling Even with a lucky person, who clearly is very fortunate in many aspects of life, if they try gambling and lucky in their first game, they cannot continuously be lucky and keep winning forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "November 28, 2023, 12:13:19 PM",
      "body": "If you write it neatly it would be good for us to be able to read it and understand what you mean from this thread, I only caught a little of what you mean actually it all depends on our mindset when gambling, not just thinking about losing but thinking like like rich people where gambling is just for entertainment, a place to have fun, not a place for anything serious.We all know that gambling was created for entertainment, but people consider it as something that is profitable to get money and a source of income, but in fact they only get a small amount of it compared to the losses and defeats they receive, gambling must be able to control themselves with a healthier mindset so that keep playing like that as entertainment so you don't get addicted to gambling and that should be avoided.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "November 28, 2023, 12:16:17 PM",
      "body": "Quote from: Justinopet on November 28, 2023, 10:53:05 AMIt is obvious that no good thing that come easy and when you are not lucky in gambling you are not lucky and a lucky person in everything he tries might still be a lucky person on gambling because i dont see what you know you do consistently and is not favourable to you yet you are still in it, that is stupidity to a reasonable man and even if your taking it to be for funs but definitely you are spending carelessly on it and truly the mindset of a gambler is to get not to loose and on a casino game a real gambler must wisely have a plan and adhere on rules to actualize it target and rich gamblers stake high in a low game which is possible to win but does not get addicted  because he analyse and strategize before staking so if it is not favourable to you does not mean is not favourable to some lucky persons and these are the mindset of rich person(mind)not of the poor person (mind).Its not all about that but how you deal with gambling since if you are there thinking for passive profit then you can't get what you expect since we could provably lose everything if you messed up playing. Also its not about how lucky or rich you are since if you are just satisfied with any result comes since your main intention is to have fun for sure every result paid off as long as you enjoy a lot while gambling.People should know there intention and not think about close to impossible scene so that they could enjoy participating on any gambling games and could ignore such sentiments that doesn't help them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dexsport.io",
      "created_time": "November 28, 2023, 12:35:16 PM",
      "body": "Our Web3 Betting Dexsport platform is for users who have different levels of income and that means that you can bet with a minimum sum. Moreover, we often launch special promotions, that include cashbacks. For example, yesterday we launched Esports 10% cashback promotion that will last to December 22nd.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "November 28, 2023, 12:45:20 PM",
      "body": "Definitely not just for the rich, as they aren't the only ones who make the gambling industry successful. It's the average earners and the poor who are more desperate to gamble. Gambling belongs to the entertainment category, but it depends solely on the gambler's discretion on how he'll handle himself in gambling and what the goal will be. The only important thing that needs to be considered is to gamble responsibly, whether you are poor, a middle-income earner, or rich, as everyone deserves to enjoy gambling if we consider it as entertainment.About having a \"lucky mind,\" I don't get it. We gamblers always have a lucky mindset as we always aim to win, so it's pretty much a natural inclination for gamblers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nara1892",
      "created_time": "November 28, 2023, 01:00:30 PM",
      "body": "Quote from: angrybirdy on November 28, 2023, 11:19:50 AMQuote from: Justinopet on November 28, 2023, 10:53:05 AMIt is obvious that no good thing that come easy and when you are not lucky in gambling you are not lucky and a lucky person in everything he tries might still be a lucky person on gambling because i dont see what you know you do consistently and is not favourable to you yet you are still in it, that is stupidity to a reasonable man and even if your taking it to be for funs but definitely you are spending carelessly on it and truly the mindset of a gambler is to get not to loose and on a casino game a real gambler must wisely have a plan and adhere on rules to actualize it target and rich gamblers stake high in a low game which is possible to win but does not get addicted  because he analyse and strategize before staking so if it is not favourable to you does not mean is not favourable to some lucky persons and these are the mindset of rich person(mind)not of the poor person (mind).Actually when it comes to gambling, there's no rich or poor as long as you have penny on your pocket, you are allowed to do it. you said that it's all about luck, maybe you're right on that part but you didn't know what a gambler's real reason why they choose to spend money on gambling rather that anything else like investment or such things that benefits them. for me, the mindset of a true gambler should be mind their own business, should gamble responsibly, stay discipline and understand the risks involve. take note that It's okay to lose money because it's a part of the game but always set a standard, budget limit and self limitation to avoid things that will regret in the future. Yes that's right, everyone has the freedom to gamble, whether you are rich or poor you can still engage in gambling because casinos never give rules that gambling is only for the rich or vice versa, it's quite simple and the point is if you have any money you can gamble. Honestly, in my opinion, for the problem of the reasons why people prefer gambling over other things such as investment or whatever, I think the reasons they bring are less reasonable, if talking about which one has more good and positive returns then obviously the answer is investment or other things when compared to gambling, but the problem is that only a small percentage of people can think that way, all they think about is the chances of winning in gambling, they think that getting money by gambling is easy, when in fact the opposite is very difficult.And there is also another reason that some people bring in gambling which is entertainment, there are those who come with the aim of seeking entertainment and fun, honestly I would suggest this more than the first point above, because obviously gambling is always nothing more than an activity that relies heavily on luck alone, and for people who come only to seek pleasure then I'm sure they already understand the concept of luck. So like you said, it doesn't matter if they want to gamble as long as they have the right mindset and also don't expect too much in terms of results from gambling, besides applying discipline and taking full responsibility for whatever will happen, basically just taking a lot of precautions so that you stay safe even though you are involved in activities that have a high risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 28, 2023, 01:00:43 PM",
      "body": "Quote from: Justinopet on November 28, 2023, 10:53:05 AMi dont see what you know you do consistently and is not favourable to you yet you are still in it, that is stupidity to a reasonable man and even if your taking it to be for funs but definitely you are spending carelessly on it and truly the mindset of a gambler is to get not to loose and on a casino game a real gambler must wisely have a plan and adhere on rules to actualize it target and rich gamblers stake high in a low game which is possible to win but does not get addicted  because he analyse and strategize before stakingWell, I would like to know what could be the possible strategies that a rich lucky bustard can do that poor people is missing to win the game. There is none, apart from bankroll management, you can't do anything to get the desired results of you while gambling, it will happen only if its supposed to happen or else it will never happen irrespective you are rich or poor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "November 28, 2023, 01:08:55 PM",
      "body": "Bro, that's difficult to understand. Did you use Google Translate? Might as well create one in your own words because google translate is also shitty. Anyway, I think I know where you are getting at. Rich people analyze the game more, while the poor ones are just aiming for a lucky strike. One jackpot, one win and everything will be done. Well, that's because they don't have the means to bet at high amounts, they don't have the money. So, all they can do is use what little they have and maybe get lucky one time so that they can also be like that rich guy who will be careful on their next bets because bigger money will be on the line. The rich on the other hand have their financial resources and they will probably be careful about what bet they will make, most of them I see on sports betting putting bets on heavy favorites. The profits are indeed lower but the chance to win is higher. That's being safe as they don't want to waste money with high-risk bets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 28, 2023, 01:10:42 PM",
      "body": "You are just assuming, don't discriminate, there's nothing in terms of the casinos where they only allow the rich to play and there's no such thing as lucky in gambling when it comes to gambling everyone is equal in their chances the only thing that differs is the bankroll because the rich can have a huge bankroll and can take a huge risk, compared to others, but when it comes to chances all players have equal chances and you don't have to be rich to win but if you have a big bankroll you have a better chance but not a guaranteed chance.There is a  gambling platform where there are more poor winners than gamblers and this is the lottery, it's very popular here in our country because, for $0.40 per ticket, you can take a chance and win thousands of dollars equivalent, this is one proof that even the poorest can gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 28, 2023, 01:15:01 PM",
      "body": "Don't exaggerate like gambling is bad, gambling is one of many ways of entertain, so if you say gambling is only for the rich, it's actually entertainment is only the rich.If you want to smoke, you need to have money to buy cigarette.If you want to get drunk, you need to have money to buy alcohol.If you want to having sex, it's actually free but there's no woman want to fuck with a poor person, so you need to have money to dress up, have a car etc.It's only correct to say gambling is for the rich, if the poor is refer to someone who don't have an one cent to save.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "November 28, 2023, 01:19:30 PM",
      "body": "Quote from: Justinopet on November 28, 2023, 10:53:05 AMGambling are mainly for rich and lucky mind.Dude, the world of gambling doesn't look at poor and rich, no matter how much money a rich person has, if he is unlucky, it will all disappear as if the earth swallowed him up.There are interesting views for you to see here: Does gambling make people rich or poor?Basically people use money to gamble, just to hope for more money, regardless of their mindset of fun, entertainment and so on, no matter how wise a person's plans are and whatever rules you obey, does not guarantee that they will be successful in gambling, gambling is like a candle, the longer you burn it, the more it will be consumed by the flames, there is no view of rich or poor, the cruel fire of gambling is even crueler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}