{
  "id": "topic_5446675",
  "title": "Rabata",
  "author": "Rabata",
  "created_time": "March 28, 2023, 06:15:49 PMLast edit: March 28, 2023, 06:46:20 PM by Rabata",
  "content": "Coinbase's former CTO Balaji Srinivasan's prediction about bitcoin price is not realistic for most people(1 btc=1 million USD). Some consider such activities as a tactic for his personal campaign. Some others consider as a reflection of his long-held views on Bitcoin. However, it is easy to imagine Srinivasan's bold prediction of 1 million in 90 days made a big impact on the Bitcoin market. In my opinion, it is not important how much Bitcoin can increase in value in 90 days because people who believe in Bitcoin do not invest in it for a short period. Srinivasan's prediction has shown that Bitcoin is likely to reach new heights. Coinbase's former CTO Balaji Srinivasan should be respectful of his recent thought of bitcoin.Although Srinivasan's recent prediction may seem absurd to some, it is actually a very reliable prediction in the long term. He made this prediction based on the US banking system and hyperinflation, which makes it difficult to dismiss.Generally we know that what is capable of taking Bitcoin valuation to unprecedented heights is a market cap. Various institutional investments in Bitcoin have multiplied its market cap in recent times. Public companies like Tesla, Voyager Digital LTD, MicroStrategy are now investing billions of dollars in Bitcoin, which naturally adds to Bitcoin's adoption of legitimacy.If one bitcoin is seen as equal to 1 million according to the current price of bitcoin, then a market cap of about 20 trillion is required. While it may seem like more at the moment, it can also be covered if a crypto revolution happens.Another important reason why Bitcoin can reach higher in the coming days is its market dominance. Currently we can see that about 45 percent of the total investment in the market is in Bitcoin. When Bitcoin continues to rise above 65 percent or more, there will be a big change in the price of altcoins in the market and the market cap will also increase significantly.Finally, i will say that people are learning to value BTC so we will be able to achieve it in the near future even if not in 90 days.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446675",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "March 29, 2023, 07:38:14 AM",
      "body": "Wake up my friend, I just disregarded the guy when I read the news and verified it on his Twitter page. The guy is dreaming, nothing more. See, Bitcoin has a big name now, it can't behave haphazardly anymore, and his conspiracy theory and that of others that copied him afterwards are not what would sustain our beloved Bitcoin, the truth, fairness and market reality is what would sustain it.I own a sizable number of Bitcoin after joining BTT, but this will not stop me from facing the reality. As an investor, what Balaji iterated could only happen in his imagination and dreams.Bitcoin is now a well-accepted global asset, it can't behave crazily to sustain its status. And for the fact that there is more involvement of institutional investors would make it behave more like a market/asset, rather than what Balaji envisaged. It can never happen in that short time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FrozenBit",
      "created_time": "March 29, 2023, 07:47:01 AM",
      "body": "I've always been amused by the information related to the price prediction of supposed industry influencers first. Thanks to this, they are just like us, having beliefs and mistakes about market judgment as well as btc in particular, and I see stories like that just stopping at a funny story in the market. this, and there's no need to overcomplicate it and treat it like data for you or many others to bother with. In cyberspace there are many people with more interesting stories, sometimes I feel quite happy because they always like to write scripts for the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "March 29, 2023, 08:17:54 AM",
      "body": "When investing in bitcoin, we have the right to dream and expect, I like people who are always optimistic about investing but don't be too delusional but realistic. I don't see his prediction having any impact, and he's nobody in this market, he's just making an impact for himself. Let's be more realistic, bitcoin is growing very fast, but so far, its acceptance level and the number of people using it are negligible for the world population. We still have a lot of challenges, and it takes time for bitcoin to achieve greater achievements. Instead of thinking about $1 million per bitcoin, think about the $100k goal first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Supreemo",
      "created_time": "March 29, 2023, 09:54:39 AM",
      "body": "At first when bitcoin's price was low they thought it was impossible to reach $10,000. Then it reached $20,000, they said it is impossible to reach $50k. So when will they start trusting the price to reach $1M? I feel like they are one of those people who keeps disregarding bitcoin not because they want to, but because they have invested but wants to invite more people to invest just to pump the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "March 29, 2023, 10:55:56 AM",
      "body": "Quote from: Rabata on March 28, 2023, 06:15:49 PMIf one bitcoin is seen as equal to 1 million according to the current price of bitcoin, then a market cap of about 20 trillion is required. While it may seem like more at the moment, it can also be covered if a crypto revolution happens.Another important reason why Bitcoin can reach higher in the coming days is its market dominance. Currently we can see that about 45 percent of the total investment in the market is in Bitcoin. When Bitcoin continues to rise above 65 percent or more, there will be a big change in the price of altcoins in the market and the market cap will also increase significantly.Finally, i will say that people are learning to value BTC so we will be able to achieve it in the near future even if not in 90 days.Bitcoin is not a altcoin to hit 1 million dollars in 90 days, because i strongly have great doubt on that very statement of his, because had it been he mentioned values such as $50k to $100k per BTC, then those are likely to be possible, just like as in case of April - June 2021 when the value of Bitcoin started falling drastically from 63k to 31k per BTC just within the space of 2 months due to global economic crisis caused by Russia versus Ukraine war, of which now we have no concrete world event that could skyrocket Bitcoin that fast in 90 days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "March 29, 2023, 11:22:31 AM",
      "body": "Quote from: Supreemo on March 29, 2023, 09:54:39 AMAt first when bitcoin's price was low they thought it was impossible to reach $10,000. Then it reached $20,000, they said it is impossible to reach $50k. So when will they start trusting the price to reach $1M? I feel like they are one of those people who keeps disregarding bitcoin not because they want to, but because they have invested but wants to invite more people to invest just to pump the price.At early stages of bitcoin the doubters are probably people that didn’t believe in its potential but the current predictors and speculators are just too emphasizing on its future. Bitcoin to $1M in 90 days is doesn’t seems a reasonable prediction if we actually look at the previous past price movements. At the current market cap Bitcoin all time high has been $69k and a bigger market cap doesn’t seem to produce much of a higher gain than ones with smaller market caps. With 18+ million out of the total 21 million already mined and with mining getting a little bit harder this days due higher prices of mining tools then it’s logical that this $1m is just a long term prediction and anyone against Balaji’s prediction are not wrong",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "March 29, 2023, 11:30:15 AM",
      "body": "The problem with these price predictions is everyone eant to look like the expert in this firld especially if they had some job in the cryptospace,  but wants even astounding is that these guys are never speaking the same language...if all these predictions said 1million dollars per bitcoin we would all take them serious but unfortunately their numbers are everywhere. Quote from: Tony116 on March 29, 2023, 08:17:54 AMWhen investing in bitcoin, we have the right to dream and expect, I like people who are always optimistic about investing but don't be too delusional but realistic. I don't see his prediction having any impact, and he's nobody in this marketDont know about Balaji Srinivasan's prediction but I wonder what impact this would have if the likes of Elon Musk said the same because the man does have the influence to convince people to take a keen interest and the media will equally pick up the story and have a ripple effect  , though his not the type that loves to speculate about crypto related matters unfortunately...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "March 29, 2023, 11:50:42 AM",
      "body": "When Bitcoin was created, it's already a victory for us because we're have a choice to not trust government due to it's centralization and corruption, instead we can be own bank with Bitcoin. The victory of Bitcoin is because of the purpose and value, not only about the price. If price is the reason why Bitcoin is a victory, someone can create a new coin where the price is more expensive than Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "March 29, 2023, 11:57:49 AM",
      "body": "All work and no play make Jack a dull boy  That very statement of his that BTC to hit $1m within that short time shouldn't be taken seriously. That price prediction is nothing but an absolute joke. You just lured me to open this thread with your misleading title  How on earth is this unrealistic imagination (at least for now) a victory for Bitcoin? OP don't tell me you being optimistic is tempting you to see this as a victory for Bitcoin already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexkut987",
      "created_time": "March 29, 2023, 12:38:19 PM",
      "body": "One of the factors that could contribute to Bitcoin's rise is its market cap, which has been increasing due to various institutional investments in Bitcoin. If Bitcoin's market cap reaches about 20 trillion, then the prediction of 1 BTC equaling 1 million USD could become a reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kelechi",
      "created_time": "March 29, 2023, 12:43:59 PM",
      "body": "Looks like BTC is winning each day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "March 29, 2023, 01:08:08 PM",
      "body": "-   Do you really believe mate that within 90 days Bitcoin will be 1M$ each? we are not even at the date of Bitcoin halving in 2024 then with such an amount you are blinded that it will really happen.There's nothing wrong with believing in Bitcoin, but it's worth talking about how much it will be, since it was created until now no one has predicted the exact value of bitcoin on its date and day. Let's just be honest, it's his right to predict but that doesn't mean that's what will actually happen, that's why predictions are uncertain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "March 29, 2023, 02:27:31 PM",
      "body": "Quote from: Supreemo on March 29, 2023, 09:54:39 AMAt first when bitcoin's price was low they thought it was impossible to reach $10,000. Then it reached $20,000, they said it is impossible to reach $50k. So when will they start trusting the price to reach $1M? I feel like they are one of those people who keeps disregarding bitcoin not because they want to, but because they have invested but wants to invite more people to invest just to pump the price.I remember those days when many people didn't believe bitcoin could go up to $10k, reach $20k and come down again.And finally, the price can reach $ 50k, almost $ 60k, which many people can't believe. And they started buying bitcoins at a price that is still considered the peak price and it turns out that the price has dropped dramatically again, making many people lose their way in holding their bitcoins. And once this condition recovers, we will see the next high where it is possible to reach $100k. So keep holding on to bitcoins tightly and keep on accumulating bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "March 29, 2023, 02:41:00 PM",
      "body": "Quote from: Supreemo on March 29, 2023, 09:54:39 AMAt first when bitcoin's price was low they thought it was impossible to reach $10,000. Then it reached $20,000, they said it is impossible to reach $50k. So when will they start trusting the price to reach $1M? I feel like they are one of those people who keeps disregarding bitcoin not because they want to, but because they have invested but wants to invite more people to invest just to pump the price.The price of bitcoin will forever be unpredictable because it is influenced by many economic indicators. One million dollar price is very attainable but not in ninety days. It might take some years to achieve that feat. Many investors never believed that it will get to almost Twenty Eight thousand dollars currently because they thought the price will recover next year but Bitcoin has kept winning.  I will like bitcoin to hit the $1m mark but my prediction is that it will hit $100k by the end of next year. Regardless of the government's strategies to crash the bitcoin market, it will keep overcoming those roadblocks and breaking new grounds in terms of price. The best advice any bitcoiner should get now is keep accumulating and holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "utybbas2",
      "created_time": "March 29, 2023, 02:50:51 PM",
      "body": "I'm gonna be honest, I don't quite believe it will hit 1 Million dollar in such a short time, although I don't think it's impossible, but on the other side I think it will finally hit the so dreamed 100k, in 90 days, I truly believe it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "March 29, 2023, 03:16:51 PM",
      "body": "Prices will not hit 100k or 1 million in 90 days obviously but that is also not necessary at all. It is good enough to have a steady rise for the next 12 month to bring back the euphoria to Bitcoin and have new projects developed. If prices will go up to quick they will also go down quick and that’s never good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "March 29, 2023, 03:30:49 PM",
      "body": "For Bitcoin to reach 1 million dollars in 90 days is just some kind of crack joke, but in the Bitcoin space, people are full of speculation and can believe whatever they choose to about price movement. In the imagination of humans, it's possible for Bitcoin's price to go boom, but in reality, it may not even get to $60,000 this year. Still in the imagination of Balaji Srinivasan, if Bitcoin gets to $1 million, then a lot of Bitcoin holders would be tempted to sell, and I really wonder if not all the major Bitcoin holders will not be tempted to sell all their holdings. 😜😂",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "March 29, 2023, 03:44:17 PM",
      "body": "I think that $1 million is not completely out of question for Bitcoin in the future, but certainly not in any near future or the next bull run. That's just way too big of a jump, in my opinion, and 90 days is not enough time, I'm confident of that. It seems that the CTO is a very well-educated person who is experienced in investments. It might be a marketing thing, but if he really bet $2 million on this, it's a huge and risky bet as well. Maybe for him, though, it's not a big amount of money, and he figured that the hype it will bring him and perhaps Bitcoin itself (which he probably holds as an investment) will outweigh the lost bet. So maybe there's just more going on here than meets the eye.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "March 29, 2023, 03:59:27 PM",
      "body": "Balaji is betting on USD to inflate so high that US government will print tons of tons of money that even when 1BTC will have a value of $1M, the buying power of it may not be as $1M today. But obviously, he overdo it becuase it will not happen as instant as 90 days, it may not even happen in 10 years.His speculation is because of the bank crisis that is happening all over the world. It's not even reported in the media like France raiding a number of banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}