{
  "id": "topic_5456227",
  "title": "EarnOnVictor",
  "author": "EarnOnVictor",
  "created_time": "June 13, 2023, 01:24:44 PM",
  "content": "...A big Thank You from me...It's over a month since I've been looking for an answer on the internet but there was none, I guess it's time I ask my seniors in Bitcoin affairs about it. Recently, I noticed a Risk Warning from Blockchain Explorer on my transaction, and when I checked I discovered the warning was due to sending \"Everything\" in that wallet address to another one.See the warning below:Quote from: Blockchain ExplorerIf you are withdrawing funds from an exchange, it is okay. If you're moving funds to another wallet, do not transfer the whole amount to another address. It greatly compromises your privacy.The question is how? What is the security threat here?Note: The quote is not clickable because I don't want to reveal the transaction involved for privacy reasons.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456227",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "June 13, 2023, 01:33:50 PM",
      "body": "Quote from: EarnOnVictor on June 13, 2023, 01:24:44 PMThe question is how? What is the security threat here?The only problem is you didn't read the warning carefully there is no security threat mentioned in the warning but talks about privacy.Meaning if you send the whole BTC to your other wallet it compromises your privacy, not the security itself.However, if you send them to multiple addresses it increases your privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 13, 2023, 01:53:01 PM",
      "body": "The more you spilt your coins, the hard it becomes to trace all on blockchain explorer.Assuming you have 5 BTC and someone ask you to send him 0.0005 BTC, the person can easily know on blockchain explorer that you have 5 BTC. If you have splitted the 5 BTC in different transactions to different addresses, it gives you more privacy.If you withdraw from an exchange, I can easily know that on explorer too that it is from an exchange that do process multiple outputs at once. But if it is from your wallet, I can easily know and know the rest of your your balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "June 13, 2023, 02:02:54 PM",
      "body": "Although it's true, but it doesn't mean if you split your coins into 5 addresses, you will have a great privacy and no one can trace you. You can still get traced especially you link your coins with centralized exchange or casino which already recognized by the blockchain explorer.If you want to protect your privacy, you need to use mixer and split your coins, the blockchain explorer missed few important words.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 13, 2023, 02:20:11 PM",
      "body": "Quote from: Charles-Tim on June 13, 2023, 01:53:01 PMAssuming you have 5 BTC and someone ask you to send him 0.0005 BTC, the person can easily know on blockchain explorer that you have 5 BTC. If you have splitted the 5 BTC in different transactions to different addresses, it gives you more privacy.The warning mentioned by OP is displayed on blockchair.com when a transaction has exactly 1 output and it has nothing to do with the amount you send.In the case your transaction has only 1 output, you will see that warning, even if you send only 1000 sat. Blockchair.com suggests not sending the whole balance, so that the transaction has a change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 13, 2023, 02:37:21 PM",
      "body": "Quote from: hosseinimr93 on June 13, 2023, 02:20:11 PMBlockchair.com suggests not sending the whole balance, so that the transaction has a change. Oh! I get it now. But is that accurate enough? Assuming I use my procedure and split my coins to different addresses, is that not good too? Because if you check a transaction, there are sometimes you can differentiate between the change address and receivers address. Another is if I send bitcoin to Mr A and Mr A trace the transaction, he might also know my address balance. But if you split it back to many address of yours, the better the privacy too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "June 13, 2023, 02:54:52 PM",
      "body": "Quote from: Charles-Tim on June 13, 2023, 02:37:21 PMBut is that accurate enough? With using a change address, you can confuse blockchain analyzers to not know which of the receiving addresses is owned by the recipient and which of them is the change. That's why blockchair.com suggests having a change. But you don't really need to always do that and you are right. That's not accurate. If you make a transaction with only 1 output, it's more like sending the fund to yourself or making a deposit to an exchange.Quote from: Charles-Tim on June 13, 2023, 02:37:21 PMAssuming I use my procedure and split my coins to different addresses, is that not good too? You can surely improve your privacy in that way, but those addresses are still linked with each other somehow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 13, 2023, 02:57:41 PM",
      "body": "Quote from: EarnOnVictor on June 13, 2023, 01:24:44 PMSee the warning below:Quote from: Blockchain ExplorerIf you are withdrawing funds from an exchange, it is okay. If you're moving funds to another wallet, do not transfer the whole amount to another address. It greatly compromises your privacy.The question is how? What is the security threat here?Note: The quote is not clickable because I don't want to reveal the transaction involved for privacy reasons.It is about change address and UTXOs.If you notice, when you withdraw your bitcoin from your exchange account, that exchange will proceed your withdrawal request together with other users. They will make so-called batch payment to multiple users in one transaction. And they always have leftover amount of bitcoin in their wallet.Back to that warning. If you send bitcoin to yourself, you will move all your bitcoin from address A to address B. It's very likely you will move your bitcoin like this.You can use the two blockchain explorers to check some transactions and see their analysis results and warnings.https://blockchair.com/bitcoin/privacy-o-meterhttps://blockstream.info/They have some guides, articles about transaction privacy.Privacy o meterBitcoin Privacy Improves With BTCPay Server's P2EP Implementation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "June 13, 2023, 04:36:02 PM",
      "body": "Quote from: hosseinimr93 on June 13, 2023, 02:54:52 PMQuote from: Charles-Tim on June 13, 2023, 02:37:21 PMBut is that accurate enough? With using a change address, you can confuse blockchain analyzers to not know which of the receiving addresses is owned by the recipient and which of them is the change. That's why blockchair.com suggests having a change.Just adding a little more here- when we use a round amount in the change address and a random amount in the actual output, it's better because we always send a round amount and keep the rest as change which can be an easy sign to detect which address is the change address.QuoteYou can surely improve your privacy in that way, but those addresses are still linked with each other somehow. Yeah true unless you are splitting them through the help of a mixer. Splitting by mixer would be fine and with coin control, we can take care of the rest to ensure we aren't linking up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "June 14, 2023, 12:51:27 AM",
      "body": "Quote from: EarnOnVictor on June 13, 2023, 01:24:44 PMThe question is how? What is the security threat here?To me, whenever I encounter such a warning message, I always feel it's not because of how I send out the bitcoin. But it's because it's safer to send it out bit by bit. In the event of an error in the receiving address, the amount to be considered lost won't be that much. Or it detects an abnormality in sending out all at once, especially to one address, as it might seem like an error or suspicious to empty a walker entirely.Quote from: Charles-Tim on June 13, 2023, 01:53:01 PMAssuming you have 5 BTC and someone ask you to send him 0.0005 BTC, the person can easily know on blockchain explorer that you have 5 BTC. If you have splitted the 5 BTC in different transactions to different addresses, it gives you more privacy.What's the point of sending from one address to another when the sending address can easily be detected and still traced back to you, and the receiver will know you own all 5 BTC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "June 14, 2023, 01:49:36 AM",
      "body": "I think the warning relates to the previous sentence about how stalkers including investigators can usually more easily identify addresses connected to an exchange wallet (especially if it's KYCed). The large number of transactions from exchanges can be a conclusive reason that the coins are actually still under the same ownership.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "June 14, 2023, 06:37:40 AM",
      "body": "Quote from: EarnOnVictor on June 13, 2023, 01:24:44 PMQuote from: Blockchain ExplorerIf you are withdrawing funds from an exchange, it is okay. If you're moving funds to another wallet, do not transfer the whole amount to another address. It greatly compromises your privacy.The question is how? What is the security threat here?Note: The quote is not clickable because I don't want to reveal the transaction involved for privacy reasons.The coins you are withdrawing from a centralized exchange have already been associated with your identity: all the UTXOs used to construct a transaction have the \"KYCed\" status, which means they can freely be consolidated, merged, etc., without further compromising privacy. Privacy doesn't exist in this case, you can't make it worse. However, in your personal wallet (not an exchange account), you may have coins of different history, including coins coming from CoinJoin, mixing services, or centralized exchanges. Some of these UTXOs are not yet associated with your documents, so you probably will want to separate KYC and non-KYC bitcoins to prevent a potential observer from figuring out how many coins you have. Ideally, you should label your addresses, transactions, and UTXOs to keep track of sources that coins arrived in your wallet: when spending, it is important to know whether you make an anonymous payment or completely transparent one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "June 14, 2023, 07:13:17 AM",
      "body": "Quote from: EarnOnVictor on June 13, 2023, 01:24:44 PMQuote from: Blockchain ExplorerIf you are withdrawing funds from an exchange, it is okay. If you're moving funds to another wallet, do not transfer the whole amount to another address. It greatly compromises your privacy.The question is how? What is the security threat here?On a normal day the exchanges will prefer you have some amount of sats left for you to remain on your wallet aside that it also important to increase your privacy with splitting your coin, which means there's a bid for more privacy while using your bitcoin through the wallet type used ad another thing is to be security consciouss, but in this case, no threat to the security in sending the entire bitcoin, also for the privacy reasons, it only increases the chances but not 100% guarantee on privacy if you eventually split your coin on multiple transactions.It's just a tip and shouldn't be assumed for threat or warning because it's has nothing to do with the coin you're sending, afterall blockchain is an open distributed ledger which by default everything is meant to be open and seen by anyone except you choose not to allow that by going for more privacy measures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 14, 2023, 09:01:10 AM",
      "body": "@Earnonvictors, The title of your thread looks like you are making a promise that whoever gives you the best answer will receive some bitcoin from you😏.You have gotten great answers from BitMaxz, Charles-Tim, and Hosseinimr93. But anyway, I believe that might not be what you meant and since you have the answer to your question, I will suggest you lock this thread.Cheers 🥂, Dr.Bitcoin_Strange 👺👺",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jatiluhung",
      "created_time": "June 14, 2023, 10:44:55 AM",
      "body": "In my first experience in sending bitcoin, I also wondered about the warning message. But then I browsed and found out what the intent of the warning was, which really wasn't a warning to worry about because it was just a suggestion to increase privacy security for us. And usually the solution is to use a mixer, our privacy can be maintained.Even on Blockchair we can see our privacy security level from weak-medium-high. And when I tried to use the Mixer, I managed to get a high privacy level. To find out more details about increasing privacy, you can read here https://blockchair.com/bitcoin/privacy-o-meter/ But I personally very rarely use it except for shipping to my long-term investment wallet which of course I try to maintain its privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "June 14, 2023, 11:18:17 AM",
      "body": "Quote from: EarnOnVictor on June 13, 2023, 01:24:44 PM...A big Thank You from me...It's over a month since I've been looking for an answer on the internet but there was none, I guess it's time I ask my seniors in Bitcoin affairs about it. Recently, I noticed a Risk Warning from Blockchain Explorer on my transaction, and when I checked I discovered the warning was due to sending \"Everything\" in that wallet address to another one.See the warning below:Quote from: Blockchain ExplorerIf you are withdrawing funds from an exchange, it is okay. If you're moving funds to another wallet, do not transfer the whole amount to another address. It greatly compromises your privacy.The question is how? What is the security threat here?Note: The quote is not clickable because I don't want to reveal the transaction involved for privacy reasons.I don't think you have issues with your account or any security breach. Reasons why you're receiving the message above is because you're trying to empty your wallet to another one and the system is warning you to authenticate your wallet security so you don't get your account exposed to a scam. I think it's just a safety precautionary measures that the system practices to secure your privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "June 14, 2023, 05:42:41 PM",
      "body": "Quote from: EarnOnVictor on June 13, 2023, 01:24:44 PM...A big Thank You from me...It's over a month since I've been looking for an answer on the internet but there was none, I guess it's time I ask my seniors in Bitcoin affairs about it. Recently, I noticed a Risk Warning from Blockchain Explorer on my transaction, and when I checked I discovered the warning was due to sending \"Everything\" in that wallet address to another one.See the warning below:Quote from: Blockchain ExplorerIf you are withdrawing funds from an exchange, it is okay. If you're moving funds to another wallet, do not transfer the whole amount to another address. It greatly compromises your privacy.The question is how? What is the security threat here?Note: The quote is not clickable because I don't want to reveal the transaction involved for privacy reasons.No any threat to your security (security contents   differs from    privacy) but  so long as you use Blockchain Explorers (which are not yours) to examine   your own transactions there will be a treat to your privacy as most of them belong to   agencies ( or cooperate with them)  that do chain analysis in the service  of the state  surveillance bodies. Those Blockchain Explorers log your IP and keep records of transactions your are interested in.Regarding warning message.Take it as heuristic used by chain analysis (ChA) i.e if you move the whole of your stash from one address to another one  ChA will assume that both addresses are yours. If at least one of those two addresses is already linked somehow ( or will be linked) to your ID then transaction involved compromises your privacy. To not immolate your privacy when moving your fund from single address it is always better to split it  into  not round parts  and send those parts  to  two or three or even more addresses, sure,  one part to single address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "June 14, 2023, 07:14:34 PM",
      "body": "Quote from: noorman0 on June 14, 2023, 01:49:36 AMI think the warning relates to the previous sentence about how stalkers including investigators can usually more easily identify addresses connected to an exchange wallet (especially if it's KYCed). The large number of transactions from exchanges can be a conclusive reason that the coins are actually still under the same ownership.Kind of makes sense...But of the two transactions, that is sending coins all in one transaction or having to split your transaction in multiple of them, which one has a high chance of compromising one's identity I thought all have an equal chance of masking your identity and making it difficult for transaction stalkers to find ones identity, and especially  if wallet addy is a one time use only I strongly believe would have a tough time to make a successful tx analysis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "June 15, 2023, 10:19:32 AM",
      "body": "Quote from: EarnOnVictor on June 13, 2023, 01:24:44 PM...A big Thank You from me...It's over a month since I've been looking for an answer on the internet but there was none, I guess it's time I ask my seniors in Bitcoin affairs about it. Recently, I noticed a Risk Warning from Blockchain Explorer on my transaction, and when I checked I discovered the warning was due to sending \"Everything\" in that wallet address to another one.See the warning below:Quote from: Blockchain ExplorerIf you are withdrawing funds from an exchange, it is okay. If you're moving funds to another wallet, do not transfer the whole amount to another address. It greatly compromises your privacy.The question is how? What is the security threat here?Note: The quote is not clickable because I don't want to reveal the transaction involved for privacy reasons.Do you mean that if you tend to transfer large amount of funds, with the use of centralized exchange tracker you are concerned if someone might know your transaction details such as your address and information. So instead of transferring your funds on one big transaction, you will divide it into many. If this is the case, the whole balance transfer would still reflect. BUt don't be too wary because it's just most of the time the Transaction address is only information seen. Dividing your transfer might cost you fees but if it will ensure greater level of security and assurance, then it will be worth it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 15, 2023, 11:22:14 AM",
      "body": "This message is talking about transactions that have one input and output, because it is trivial for on-chain analysis to conclude that someone is simply moving around their funds, as opposed to sending it to someone. And actually, one-input and two-output transactions also have no privacy, as the second output is usually \"change\" that goes back to the sender's wallet.Transactions with multiple inputs and outputs are excellent as they are indistinguishable from coinjoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}