{
  "id": "topic_5402175",
  "title": "GiftedMAN",
  "author": "GiftedMAN",
  "created_time": "June 11, 2022, 09:23:04 AM",
  "content": "The real purpose of backwards glancing eye is to educate yourself constantly - looking at the past helps to learn from those who came before you,since they are personal experience,this is the most vital school one can learn from.Examining from the mistakes made in the past, the ones that have grievously held you back, share your experience,a newbie or anyone an analyze and extract a lesson.What has been your greatest challenge on Bitcointalk? And how did you go about it ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402175",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 11, 2022, 09:38:14 AM",
      "body": "Nothing. While I love Bitcointalk and I enjoy conversing here, I think some people take it a bit too seriously as if Bitcointalk is some company and that they need to climb the corporate ladder on.Be on Bitcointalk if you like talking about Bitcoin/crypto. The earning part should only be an extra; and try your best to make your Bitcointalk earnings not your main income to the point that we're talking about courage and believing in yourself and all that stuff concerning ranking up on Bitcointalk.^Probably a controversial take but yea lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "June 11, 2022, 09:51:21 AM",
      "body": "My greatest challenge is when I start knowing about crypto and Bitcointalk forum. I thought all crypto related sre very hard to learn but what I did to go about it is to enjoy Bitcointalk forum and learn step by step. I didn't let myself get offended or get angry when someone criticize me in an offensive way. Don't worry about positions and just enjoy conversing with other people like talking to a person race to face is what I do to get on with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "June 11, 2022, 10:16:43 AM",
      "body": "My challenge on this forum? nothing, there's no tough or uncommon rules that we really need to understand in depth. Plagiarism do make your account got banned, but when you're in school or university you're have been taught to not copy paste and that's must be in own mind to not do that in everywhere. If you're not a scammer or cheater, you're already good in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 11, 2022, 11:36:23 AM",
      "body": "My challenge about hanging out anonymously with a group of strangers who happen to be interested in a technology I'm also into? Surprisingly none.This is just an online forum, nothing too serious. Engage in conversations, learn and engage some more.If you've asked a question like what's my greatest challenge in learning Bitcoin, that would be a question that many here can relate to and for me it would be the technical aspect of it. It seems to be a never ending loop of calculations and algorithms, or maybe I have not really studied it enough. Good thing is I do not need to fully understand the technicalities, I just need to be able to verify the features in the technology and utilize it.Many share this same challenge, and it has limited some from getting into Bitcoin. But, they would use the internet without being able to write a line of code or understand what goes on behind the scene; Bitcoin is really no different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "June 11, 2022, 11:37:40 AM",
      "body": "Quote from: GiftedMAN on June 11, 2022, 09:23:04 AMThe real purpose of backwards glancing eye is to educate yourself constantly - looking at the past helps to learn from those who came before you,since they are personal experience,this is the most vital school one can learn from.Examining from the mistakes made in the past, the ones that have grievously held you back, share your experience,a newbie or anyone an analyze and extract a lesson.What has been your greatest challenge on Bitcointalk? And how did you go about it ?first of all bitcointalk  comes with discipline and lots of sacrifice and another major thing is if you not ready to learn from other people then you not ready to go far ,the major thing i notice is that our bosses are always ready to guide us. to earn you must put enough effort in doing more research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "June 11, 2022, 01:44:49 PM",
      "body": "Quote from: GiftedMAN on June 11, 2022, 09:23:04 AMWhat has been your greatest challenge on Bitcointalk? And how did you go about it ?It's step by step and I know how Bitcointalk helped me so much about this.Improving my English skills like writing with correct grammar, though isn't perfect but at least not like before since this isn't my mother language.Knowing forum rules which are Dos and Don'ts Exploring myself in cryptocurrencies, especially on Bitcoin and blockchain networks, and how to store them in a correct wallet.For now, IMO, I'm enjoying myself here in the forum reading updates and further information regarding activities and events on crypto despite having less time spent here due to my small business outside but I still can manage myself not to become into conflict with activities in my real life. Just encourage always yourself to learn knowledge here on Bitcointalk, it's just a sort of investment that you've gained at the end of the day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 11, 2022, 02:14:21 PM",
      "body": "My biggest challenge was to register on a forum that I visited as a guest for more than a year, and after that more or less it went its course. Since it never occurred to me to plagiarize or do some similar nonsense I can’t say I regret some things or did them wrong, although it’s good to be self-critical and admit that some things could have been done better.Apart from some general rules (plagiarism, spam, scam), I think that every beginner should choose their path and try to be a unique member of the forum, without copying anyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "June 11, 2022, 05:41:47 PM",
      "body": "As for me my greatest challenge on the forum is none, i have loved every moment I spend on the forum and if I could change anything it would be nothing, i have learnt so much from the forum, Crypto—currency related and even other wise, i believe the forum is friendly and once you build the right mentality in your mind, you would find it warming, i believe everyone can learn a lot from this forum and it doesn’t matter your level of knowledge you had or the purpose of you joining, make it right and your challenges would be gone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "June 11, 2022, 05:49:39 PM",
      "body": "Quote from: RockBell on June 11, 2022, 11:37:40 AMfirst of all bitcointalk  comes with discipline and lots of sacrifice and another major thing is if you not ready to learn from other people then you not ready to go far ,the major thing i notice is that our bosses are always ready to guide us. to earn you must put enough effort in doing more research. To be honest, bitcointalk does not teach you discipline or sacrifice, those are virtues one learns in RL, from their families, friends, the situation and people around them, bitcointalk is just a discussion forum, and you do not have to be disciplined or sacrifice anything to hold discussion with other users here, just do not plagiarise/spam. You're correct about the importance of research though, it is pertinent to do your own research in the network, and as for other users' willingness to help/answer questions, that is what is expected in a discussion forum, the desire to spread knowledge so others can garner some for themselves too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "June 11, 2022, 05:59:11 PM",
      "body": "Quote from: Coyster on June 11, 2022, 05:49:39 PMQuote from: RockBell on June 11, 2022, 11:37:40 AMfirst of all bitcointalk  comes with discipline and lots of sacrifice and another major thing is if you not ready to learn from other people then you not ready to go far ,the major thing i notice is that our bosses are always ready to guide us. to earn you must put enough effort in doing more research. To be honest, bitcointalk does not teach you discipline or sacrifice, those are virtues one learns in RL, from their families, friends, the situation and people around them, bitcointalk is just a discussion forum, and you do not have to be disciplined or sacrifice anything to hold discussion with other users here, just do not plagiarise/spam. You're correct about the importance of research though, it is pertinent to do your own research in the network, and as for other users' willingness to help/answer questions, that is what is expected in a discussion forum, the desire to spread knowledge so others can garner some for themselves too.Thanks for the advice and encouragement",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 11, 2022, 06:47:21 PM",
      "body": "The real challenge was at the beginning, I knew Bitcoin for the first time in the beginning of 2017 and I was reading about the forum where it appeared as the first search results in the first days, I tried to log in using my real name but the forum asked me for a fee (because I use VPN) I thought that The site is scam and I did not visit it until the month of 7 when I created this account and it did not ask me anything.Another challenge is that the merit system was set up when I was a full member and I thought it was impossible to rank up but I did it in less than 4 months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "June 11, 2022, 08:41:05 PM",
      "body": "For me, it's only one challenge, this forum has challenged and pushed me to become a better version of myself. I registered here in 2016, and in 2017, I abandoned the forum for some personal reasons, I came back in late 2020 and since then, it's been an awesome slow but steady ride, I enjoy every bit of my time on this forum, discussing and contributing to topics I find really interesting, as well as learning how to do new stuffs which ordinarily, I wouldn't have ever known.Some posts I came across on this forum has pushed me into doing research, and through those researches, Ive learnt to write a bit of HTML, CSS, and even a small amount of Javascript, there was a time I tried forcing myself to learn solidity, but I discovered it's very difficult when one doesn't know how to write any programming language first, I've been learning bit by bit, and I keep improving, all thanks to Bitcointalk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "June 11, 2022, 08:46:21 PM",
      "body": "Quote from: GiftedMAN on June 11, 2022, 09:23:04 AMThe real purpose of backwards glancing eye is to educate yourself constantly - looking at the past helps to learn from those who came before you,since they are personal experience,this is the most vital school one can learn from.Examining from the mistakes made in the past, the ones that have grievously held you back, share your experience,a newbie or anyone an analyze and extract a lesson.What has been your greatest challenge on Bitcointalk? And how did you go about it ?I just really wanted to hang out around here and would love to hear other's knowledge so maybe the nearest challenge that I was unconsciously pursuing was being able to learn, but in hindsight there is really none. If I was having difficulties speaking/writing English, then the challenge would be being able to join the discussion in here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Viscore",
      "created_time": "June 11, 2022, 09:00:12 PM",
      "body": "Quote from: GiftedMAN on June 11, 2022, 09:23:04 AMThe real purpose of backwards glancing eye is to educate yourself constantly - looking at the past helps to learn from those who came before you,since they are personal experience,this is the most vital school one can learn from.Examining from the mistakes made in the past, the ones that have grievously held you back, share your experience,a newbie or anyone an analyze and extract a lesson.What has been your greatest challenge on Bitcointalk? And how did you go about it ? It's definitely not a challenge but more on a necessity that i should keep learning in the forum so i can somehow share a good discussion that newbies can benefit and learned from it. And it's one thing that keeps my momentum here in the forum as more likely i'm enjoying every conversation that we made here. And not only that, bitcointalk forum also find me some good friends wherein i can rely on them even in times of uncertainties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "June 11, 2022, 09:02:21 PM",
      "body": "Quote from: GiftedMAN on June 11, 2022, 09:23:04 AMThe real purpose of backwards glancing eye is to educate yourself constantly - looking at the past helps to learn from those who came before you,since they are personal experience,this is the most vital school one can learn from.Examining from the mistakes made in the past, the ones that have grievously held you back, share your experience,a newbie or anyone an analyze and extract a lesson.What has been your greatest challenge on Bitcointalk? And how did you go about it ?Opening up to where I felt I could contribute to other subforums and bot just this. I just had to find my place first (where I felt comfortable) and then work my way from there on opening up and really having something worth wile to say, even if the topic at hand might be a bit out of my reach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "June 11, 2022, 09:21:26 PM",
      "body": "Quote from: GiftedMAN on June 11, 2022, 09:23:04 AMWhat has been your greatest challenge on Bitcointalk? And how did you go about it ?Actually, there was no particular challenge, this was just another forum community I joined, as I have done many times before on other online forums. Also there was no pressure at all; I just wanted to find a platform where I could learn more about the cryptocurrency and maybe reach out to like minded people.If I had to choose, my greatest challenge at Bitcointalk, would probably be the huge amount of knowledge and experience some members have on the subject. This gives them great power in the discussion, but at the same time limits your understanding of the subject. In the end I guess that everything is relative, as you have the right to be ignorant of almost any subject if you do want to.As to how I made my first post: I wrote a generic introduction in Beginners & Help and tried to get user feedback in the comments. That way I was able to get a clear idea of the general interest about the newbies who joined the community. As I was enjoying the Bitcointalk community, I continued to post here and there, providing various small ideas and general feedbacks to the people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "June 11, 2022, 09:42:05 PM",
      "body": "The biggest challenge in Bitcointalk is how we must always be active and be able to contribute to this forum. If you are just lazy and don't want to be active, of course there will be no progress. A few years ago, before the merit system was used, many newbies started arriving and became active in forums, but when the merit system was implemented, those who were not serious would be automatically selected. So, the challenge that really has to be overcome in bitcointalk is how to be useful and stay active on the forum. Bitcointalk is a forum that has a lot of knowledge and freedom of speech, it is the perfect forum for everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "June 11, 2022, 10:34:23 PM",
      "body": "Quote from: GiftedMAN on June 11, 2022, 09:23:04 AMWhat has been your greatest challenge on Bitcointalk? And how did you go about it ?I've found this become challenging during my early days in crypto. Being No-HOW to the forum and talking to anonymous people is quite challenging. But for now, it turns like just normal, We talk just like friends (indeed friends). Giving and taking ideas is just what we did here, and the more we interact with brilliant and experienced people, the more enhance ourselves to become better and be soon like them in the future. We don't think this was a challenge but rather think this is somewhat required as no healthy forum without informative discussions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "June 11, 2022, 11:16:33 PM",
      "body": "Quote from: mk4 on June 11, 2022, 09:38:14 AMNothing. While I love Bitcointalk and I enjoy conversing here, I think some people take it a bit too seriously as if Bitcointalk is some company and that they need to climb the corporate ladder on.Every second post on this board is in its core about farming merit and joining a sig campaign. It's being thinly veiled as \"learning about Bitcoin\", \"being a good poster\" etc., but the real motivation behind them is crystal clear. It's just the reality of this forum that people join it for bounties and sig campaigns, because they have heard about their friends or someone on the Internet earning coins here. And the only way to change it is to ban paid campaigns, which theymos is not inclined to do for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}