{
  "id": "topic_5450358",
  "title": "karabiber",
  "author": "karabiber",
  "created_time": "April 27, 2023, 10:49:54 AM",
  "content": "Ülkeler ekonomik gelişmişliklerine göre sıralanırlar. Bunun ölçümlerinde bir çok yöntem vardır. GSYH’nın (Gayri safi yurtiçi hasıla) dolar üzerinden hesaplanmasıyla elde edilen gelire göre yapılan sıralama en popüler olandır. Satın alım gücü paritesi ise ükeler arasındaki fiyat düzeyi farklılaşmasını ortadan kaldıran para birimi dönüştürme oranıdır. Aslında ülkenin zenginliğini ve refahını belirleyen en önemli etkenlerden birisi SAGP’dır. Big Mac endeksi ise farklı para birimlerinin satın alma gücünü farklı ülkelerdeki bir Big Mac'in fiyatlarıyla karşılaştıran bir göstergedir. Bu endeks bilimsel araştırmalarda ve ders kitaplarında yer almıştır. Big Mac burada bir para biriminin satın alma gücünün basit bir göstergesi olarak kullanılır, çünkü dünyanın birçok ülkesinde standart bir boyut, bileşim ve kalitede mevcuttur. Tek fiyat kanunu da araştırabilirsiniz konuyla ilgili. Konuyu uzatmamak için buna girmiyorum. Bu teori, iki ülkenin para birimleri arasındaki döviz kuru oranının, spesifik bir ürünün (veya ürün sepetinin) fiyatının uzun vadede iki ülkede eşitleneceği bir değere yakınsayacağını öngören bir teoridir. Big Mac endeksi aslında bir ülkenin ne kadar gelişmiş olduğunu göstermez sadece Döviz kuru teorisini anlatmak için kullanılan bir yöntemdir. Fakat bu Endeks para birimlerinin değerini ölçmede standart hale gelmiş yöntemlerden birisidir. Örnekle açıklamak gerekirse bir Big Mac’in Amerika fiyat ortalaması 5,20 Dolar ve Türkiye fiyat ortalaması 130 Türk Lirası’dır. Hiç kur çevrimi yapmadan Türkiye’de Big Mac fiyatıyla ABD arasında 6.7 katlık bir fark vardır. Türkiye’de güncel kur (19,43) ile ortalama bir Big Mac fiyatı 6.7 Dolardır. 130/5.2 = 25 Endekse göre kurun olması gereken yer 25 TL’dir. Ancak güncel USDTRY 19,43 TL’dir. Buradan hareketle Türk Lirası şu anda olması gereken yerden daha değerlidir. Big Mac endeksine göre kurun 25 Tl olması beklenmektedir. Ocak itibariyle ülkelerin Big Mac endeksleri. Nisan ayı itibariyle Türkiye’nin endeksi 6,17’dir ve oldukça pahalıdır. https://www.statista.com/statistics/274326/big-mac-index-global-prices-for-a-big-mac/Yardımcı olunan kaynaklar: https://evrimagaci.org/big-mac-endeksi-nedir-hamburger-fiyatlari-doviz-kurunun-olmasi-gereken-degerini-yansitabilir-mi-12180                                        https://tr.wikipedia.org/wiki/Big_Mac_Endeksi",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450358",
  "comments": [
    {
      "author": "Pierre 2",
      "created_time": "April 27, 2023, 01:26:30 PM",
      "body": "Güzel bir başlık olmuş hocam teşekkür ederim. Big mac endeksi genel olarak kıymeti çok anlaşılamayan ekonomik göstergelerden birisi. Dolar/lira ikilisinde adil değerin 25 çıkması beni hiç şaşırtmadı zaten kesin seçim sonuçlarını gördükten belki 3 belki 5 hafta sonra 24 lirayı göreceğimiz kesin. Bu yüzden çevremdekilere de dışarıdakilere ısrarla ve inatla düşük faizlerle borçlanıp dolar veya bitcoin almalarını tavsiye ediyordum. Alan insanlar borcu direkt olarak eritecekler. Devlet kuru en fazla seçime kadar tutabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l99l",
      "created_time": "April 27, 2023, 02:22:56 PM",
      "body": "Farklı para birimlerinin satın alma gücünü farklı ülkelerdeki bir Big Mac'in fiyatlarıyla karşılaştıran basit bir gösterge, para birimlerinin. İlk şu meşhur dergi çıkarmıştı Big mac endeksini diye hatırlıyorum. Ipod endeksi, Starbucks endeksi bir çok benzerini ortaya çıkardı insanlar daha sonra.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "April 27, 2023, 03:53:58 PM",
      "body": "Genelde Amerikada yapılan bir endeks türü, artık standartlaşmış orada, alım gücü gibi bir şeyi ifade ediyor.Ülkemizde haftalık veya aylık olarak değişebilir bu endeks çünkü devamlı fiyat artışları oluyor malum.Bu endekse göre 25 TL olması gerekiyor yazmışsınız, bu hükümetle devam edersek 25 TL olur çok rahat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "April 27, 2023, 05:45:04 PM",
      "body": "Hesaplamada beklenen fiyattan daha düşük seviyedeyiz. Böyle kalır ve daha da düşer temennisinde bulunuyorum ve devam ediyorum. Bu endeksteki hesaplamanın tek olumsuz yanı anlık olarak belirli olmamasıdır. Böyle bir şey de beklenmiyor ama yine de piyasa oluştuktan belirli zaman sonra kendini buluyor. Buna \"ben dememiş miydim\" endeksi demek de doğru olabilir. Geriden geliyor, belirli bir olayı işliyor ve sadece dolaylı yoldan reklam gibi çalışıyor. Bu çok basit bir eleştiri oldu tabi ama yine de farklı şekillerde piyasayla hareket eden böyle şeyler ekonomilerin karşılaştırılmaları açısından faydalı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "April 30, 2023, 07:35:14 PM",
      "body": "Bu arada Big Mac’de güzel değil benim damak tadıma göre   Bir şeyin fiyatı sabit olsun böyle endeks olarak kullanılabilir. Bir de o şeyin global çapta aynı kalması gerekiyor. Ayrıca Türkiye’deki Big Mac daha ucuz olsun diye daha az kaliteli ve ucuza mal ettikleri ürünleri koyuyor olamazlar mı? Bilinçli bir şekilde fiyatı düşürmek ve daha fazla satmak gibi düşünceleri de olabilir belki ani şekilde mantıklı gelen bir şeydi bu şimdi aklıma. Big Mac endeksi daha önce de duyduğum bir endeks. Alım gücü kıyasında dahi kullanılabilir. Türkiye’de hala dolar değerli görünmesinin bir sebebi var o da seçim. Seçimden sonra dolar beklenilen noktaya ani şekilde durmayarak gelecek bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "April 30, 2023, 11:23:29 PM",
      "body": "Quote from: Mustang Shelby on April 30, 2023, 07:35:14 PMBu arada Big Mac’de güzel değil benim damak tadıma göre   Bir şeyin fiyatı sabit olsun böyle endeks olarak kullanılabilir. Bir de o şeyin global çapta aynı kalması gerekiyor. Ayrıca Türkiye’deki Big Mac daha ucuz olsun diye daha az kaliteli ve ucuza mal ettikleri ürünleri koyuyor olamazlar mı? Bilinçli bir şekilde fiyatı düşürmek ve daha fazla satmak gibi düşünceleri de olabilir belki ani şekilde mantıklı gelen bir şeydi bu şimdi aklıma. Big Mac endeksi daha önce de duyduğum bir endeks. Alım gücü kıyasında dahi kullanılabilir. Türkiye’de hala dolar değerli görünmesinin bir sebebi var o da seçim. Seçimden sonra dolar beklenilen noktaya ani şekilde durmayarak gelecek bence. Sen bizim ülkede yediğin Big Mac'le yurt dışında yediğin Big Mac'ı içerik olarak kıyaslayamazsın zaten, arada dağlar kadar fark var, en kolayı örneği yurt dışında içinde et kullanılıyor bizde ne içeriği ne olduğu belli olmayan ete benzer bir şey.Şuan tekrar düşünüyorum da Türkiye'de bu endekse bakmak çok saçma, içerik olarak birebir aynı olsa kıyaslanabilir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RaltcoinsB",
      "created_time": "May 01, 2023, 05:51:27 AM",
      "body": "Quote from: MK-74 on April 30, 2023, 11:23:29 PMQuote from: Mustang Shelby on April 30, 2023, 07:35:14 PMBu arada Big Mac’de güzel değil benim damak tadıma göre   Bir şeyin fiyatı sabit olsun böyle endeks olarak kullanılabilir. Bir de o şeyin global çapta aynı kalması gerekiyor. Ayrıca Türkiye’deki Big Mac daha ucuz olsun diye daha az kaliteli ve ucuza mal ettikleri ürünleri koyuyor olamazlar mı? Bilinçli bir şekilde fiyatı düşürmek ve daha fazla satmak gibi düşünceleri de olabilir belki ani şekilde mantıklı gelen bir şeydi bu şimdi aklıma. Big Mac endeksi daha önce de duyduğum bir endeks. Alım gücü kıyasında dahi kullanılabilir. Türkiye’de hala dolar değerli görünmesinin bir sebebi var o da seçim. Seçimden sonra dolar beklenilen noktaya ani şekilde durmayarak gelecek bence. Sen bizim ülkede yediğin Big Mac'le yurt dışında yediğin Big Mac'ı içerik olarak kıyaslayamazsın zaten, arada dağlar kadar fark var, en kolayı örneği yurt dışında içinde et kullanılıyor bizde ne içeriği ne olduğu belli olmayan ete benzer bir şey.Şuan tekrar düşünüyorum da Türkiye'de bu endekse bakmak çok saçma, içerik olarak birebir aynı olsa kıyaslanabilir.Bence de hocam içerik olarak birebir aynı olan iki ürünü kıyaslamak doğru olur ama ekonomik endekste bunu baz almıyorlar tabi şeytan ayrıntıda gizli olduğu için de tam olarak doğru kıyaslamalara sebep olmuyor ayrıca big mac pazarlayan grupta bunu bahane edip saçma sapan içerikle alakası olmayan Türkiye’deki menülerin fiyatlarını yükselteceklerine adım gibi de eminim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "May 01, 2023, 11:01:50 PM",
      "body": "Quote from: RaltcoinsB on May 01, 2023, 05:51:27 AMQuote from: MK-74 on April 30, 2023, 11:23:29 PMQuote from: Mustang Shelby on April 30, 2023, 07:35:14 PMBu arada Big Mac’de güzel değil benim damak tadıma göre   Bir şeyin fiyatı sabit olsun böyle endeks olarak kullanılabilir. Bir de o şeyin global çapta aynı kalması gerekiyor. Ayrıca Türkiye’deki Big Mac daha ucuz olsun diye daha az kaliteli ve ucuza mal ettikleri ürünleri koyuyor olamazlar mı? Bilinçli bir şekilde fiyatı düşürmek ve daha fazla satmak gibi düşünceleri de olabilir belki ani şekilde mantıklı gelen bir şeydi bu şimdi aklıma. Big Mac endeksi daha önce de duyduğum bir endeks. Alım gücü kıyasında dahi kullanılabilir. Türkiye’de hala dolar değerli görünmesinin bir sebebi var o da seçim. Seçimden sonra dolar beklenilen noktaya ani şekilde durmayarak gelecek bence. Sen bizim ülkede yediğin Big Mac'le yurt dışında yediğin Big Mac'ı içerik olarak kıyaslayamazsın zaten, arada dağlar kadar fark var, en kolayı örneği yurt dışında içinde et kullanılıyor bizde ne içeriği ne olduğu belli olmayan ete benzer bir şey.Şuan tekrar düşünüyorum da Türkiye'de bu endekse bakmak çok saçma, içerik olarak birebir aynı olsa kıyaslanabilir.Bence de hocam içerik olarak birebir aynı olan iki ürünü kıyaslamak doğru olur ama ekonomik endekste bunu baz almıyorlar tabi şeytan ayrıntıda gizli olduğu için de tam olarak doğru kıyaslamalara sebep olmuyor ayrıca big mac pazarlayan grupta bunu bahane edip saçma sapan içerikle alakası olmayan Türkiye’deki menülerin fiyatlarını yükselteceklerine adım gibi de eminim Zaten durmadan zam geliyor hocam, iki gün arayla yerli bir burgerciden aldığım menü arasına 4 TL fark koymuşlar, 2 günde ne değiştide fark koydunuz Dolar mı uçtu yoo.Global markalar ne yaparsa çoğunluk onları izliyor maalesef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "May 02, 2023, 06:33:51 AM",
      "body": "Quote from: MK-74 on May 01, 2023, 11:01:50 PMQuote from: RaltcoinsB on May 01, 2023, 05:51:27 AMQuote from: MK-74 on April 30, 2023, 11:23:29 PMQuote from: Mustang Shelby on April 30, 2023, 07:35:14 PMBu arada Big Mac’de güzel değil benim damak tadıma göre   Bir şeyin fiyatı sabit olsun böyle endeks olarak kullanılabilir. Bir de o şeyin global çapta aynı kalması gerekiyor. Ayrıca Türkiye’deki Big Mac daha ucuz olsun diye daha az kaliteli ve ucuza mal ettikleri ürünleri koyuyor olamazlar mı? Bilinçli bir şekilde fiyatı düşürmek ve daha fazla satmak gibi düşünceleri de olabilir belki ani şekilde mantıklı gelen bir şeydi bu şimdi aklıma. Big Mac endeksi daha önce de duyduğum bir endeks. Alım gücü kıyasında dahi kullanılabilir. Türkiye’de hala dolar değerli görünmesinin bir sebebi var o da seçim. Seçimden sonra dolar beklenilen noktaya ani şekilde durmayarak gelecek bence. Sen bizim ülkede yediğin Big Mac'le yurt dışında yediğin Big Mac'ı içerik olarak kıyaslayamazsın zaten, arada dağlar kadar fark var, en kolayı örneği yurt dışında içinde et kullanılıyor bizde ne içeriği ne olduğu belli olmayan ete benzer bir şey.Şuan tekrar düşünüyorum da Türkiye'de bu endekse bakmak çok saçma, içerik olarak birebir aynı olsa kıyaslanabilir.Bence de hocam içerik olarak birebir aynı olan iki ürünü kıyaslamak doğru olur ama ekonomik endekste bunu baz almıyorlar tabi şeytan ayrıntıda gizli olduğu için de tam olarak doğru kıyaslamalara sebep olmuyor ayrıca big mac pazarlayan grupta bunu bahane edip saçma sapan içerikle alakası olmayan Türkiye’deki menülerin fiyatlarını yükselteceklerine adım gibi de eminim Zaten durmadan zam geliyor hocam, iki gün arayla yerli bir burgerciden aldığım menü arasına 4 TL fark koymuşlar, 2 günde ne değiştide fark koydunuz Dolar mı uçtu yoo.Global markalar ne yaparsa çoğunluk onları izliyor maalesef.Daha dün üç harfli marketlerin birinde, ara ara aldığım 3 in 1 kahvelerde 29.50 olan fiyat bir anda 36 liraya çekilmiş. Neye göre artış yaşandığı konusunda bir açıklama yapamıyorlar. %20’den fazla bir artışı laps diye geçirmişler. Vatandaşlar artık zamlara alıştı diye mi anlamıyorum. Dolar öyle astronomik %20 artış yaşamamışken, gıdalarda o kadar uçuk bir fark yokken bunun tek mantıklı yönü fırsatçılık değerlendirmesi. İnsanların zamlara alışması bunların iştahını daha çok kabartıyor. Kan emici hepsi maalesef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "May 02, 2023, 06:53:09 AM",
      "body": "Resim kaynağı : https://www.iwd.de/artikel/big-mac-index-der-etwas-andere-wechselkurs-399656/Resim kaynağından da gördüğümüz üzere Ocak ayındaki Big Mac Endeksleri ülkelerin ekonomik durumları hakkında bize bilgi verebiliyor. İsviçre’de, Uruguay ve Norveç’te yüksek fiyatlarda satılan Big Mac’lerin Türkiye’deki durumunu ise yukarıda OP paylaşmış. Geçmiş yıllarda ise devrin ekonomi bakanı Mehmet Şimşek’in Big Mac Endeksi ile TL/$ kıyası yaptığı zamanları de görebiliyoruz. 2017 yılında atılmış tweet sonrası çok sayıda tepki çekmişti sayın Şimşek. Ülkelerin ekonomileri Big Mac endeksi ile ölçülmez, bu bir ölçüt kabul edilmez hele ki bir bakan tarafından.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "May 22, 2023, 02:02:45 PM",
      "body": "Güzel bir post olmuş @karabiber hocama teşekkürler ilk olarak. Maalesef hangi ürünün endeksini alsak biz daha pahalı tüketiyoruz. Ama bigmac menü ile ilgili şöyle bir anım var. Biliyorsunuz bizdeki bigmacxxl bile o kadar küçük ki doymuyorsunuz. Bu sebeple yurtdışında da bigmacxxl menü söylemiştim ve yarısını ancak bitirebilmistim. Demem o ki hem fazla para veriyoruz hem de satın aldığımız ürün çok az. Kalitesi ve hijyen koşullarını söylemiyorum bile",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "May 23, 2023, 09:33:36 AM",
      "body": "Quote from: Gencecikmen on May 22, 2023, 02:02:45 PMGüzel bir post olmuş @karabiber hocama teşekkürler ilk olarak. Maalesef hangi ürünün endeksini alsak biz daha pahalı tüketiyoruz. Ama bigmac menü ile ilgili şöyle bir anım var. Biliyorsunuz bizdeki bigmacxxl bile o kadar küçük ki doymuyorsunuz. Bu sebeple yurtdışında da bigmacxxl menü söylemiştim ve yarısını ancak bitirebilmistim. Demem o ki hem fazla para veriyoruz hem de satın aldığımız ürün çok az. Kalitesi ve hijyen koşullarını söylemiyorum bileYurtdışına gidebilmek bile bugün bir ayrıcalık, yurtdışında kalmak daha fazla ayrıcalık, big mac endeksiyle bile alım gücümüze bakarsak nerelere geldiğimiz ortada hocam, konu bence de çok faydalı çünkü bir çok insan bundan bi haber, böyle bir ekonomik terim olmasa da en azından alım gücünü kıyaslamak adına bence önemli bir gösterge, elbette dediğiniz de var, yurtdışındaki ürünler ile Türkiye’deki ürünler aynı değil, yine de alım gücü kıstasında düşünülebilir,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "July 13, 2023, 08:57:24 AM",
      "body": "Quote from: kriminall on May 23, 2023, 09:33:36 AMQuote from: Gencecikmen on May 22, 2023, 02:02:45 PMGüzel bir post olmuş @karabiber hocama teşekkürler ilk olarak. Maalesef hangi ürünün endeksini alsak biz daha pahalı tüketiyoruz. Ama bigmac menü ile ilgili şöyle bir anım var. Biliyorsunuz bizdeki bigmacxxl bile o kadar küçük ki doymuyorsunuz. Bu sebeple yurtdışında da bigmacxxl menü söylemiştim ve yarısını ancak bitirebilmistim. Demem o ki hem fazla para veriyoruz hem de satın aldığımız ürün çok az. Kalitesi ve hijyen koşullarını söylemiyorum bileYurtdışına gidebilmek bile bugün bir ayrıcalık, yurtdışında kalmak daha fazla ayrıcalık, big mac endeksiyle bile alım gücümüze bakarsak nerelere geldiğimiz ortada hocam, konu bence de çok faydalı çünkü bir çok insan bundan bi haber, böyle bir ekonomik terim olmasa da en azından alım gücünü kıyaslamak adına bence önemli bir gösterge, elbette dediğiniz de var, yurtdışındaki ürünler ile Türkiye’deki ürünler aynı değil, yine de alım gücü kıstasında düşünülebilir, Kesinlikle çok haklısınız hocam. Bugün bir arkadaş grubu yurt dışı için plan yapıyorlardı daha doğrusu hayal kurdular. Sonra biz gidene kadar kur artar dediler. Vizeyi düşündüler, vize almak için banka hesaplarında bulunmasi gereken miktara ve sonrasında vazgeçmek zorunda kaldılar. Gerçekten yurt dışına çıkmak, farklı bir perspektif görmek büyük bir ayrıcalık oldu ülkemizde. Oralarda kalmak ise büyük bir şans veya mucize haline geldi. Bu beni gerçekten çok üzüyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "July 13, 2023, 09:07:48 AM",
      "body": "Quote from: kriminall on May 23, 2023, 09:33:36 AMQuote from: Gencecikmen on May 22, 2023, 02:02:45 PMGüzel bir post olmuş @karabiber hocama teşekkürler ilk olarak. Maalesef hangi ürünün endeksini alsak biz daha pahalı tüketiyoruz. Ama bigmac menü ile ilgili şöyle bir anım var. Biliyorsunuz bizdeki bigmacxxl bile o kadar küçük ki doymuyorsunuz. Bu sebeple yurtdışında da bigmacxxl menü söylemiştim ve yarısını ancak bitirebilmistim. Demem o ki hem fazla para veriyoruz hem de satın aldığımız ürün çok az. Kalitesi ve hijyen koşullarını söylemiyorum bileYurtdışına gidebilmek bile bugün bir ayrıcalık, yurtdışında kalmak daha fazla ayrıcalık, big mac endeksiyle bile alım gücümüze bakarsak nerelere geldiğimiz ortada hocam, konu bence de çok faydalı çünkü bir çok insan bundan bi haber, böyle bir ekonomik terim olmasa da en azından alım gücünü kıyaslamak adına bence önemli bir gösterge, elbette dediğiniz de var, yurtdışındaki ürünler ile Türkiye’deki ürünler aynı değil, yine de alım gücü kıstasında düşünülebilir, Yurtdışına gidebilmek günden güne daha da zorlaşıyor. Uçak biletlerine bakıyorum ara sıra ardından hayal kırıklığıyla siteyi kapatıyorum. Sadece gidiş, dönüş bileti binlerce lirayı geçiyor.. Haklısınız bu arada yurt dışındaki ürünlerle Türkiyede'ki ürünleri kıyaslamamız için ürünün aynı olması gerekiyor. İsim olarak aynı olsa da içerik aynı içerik değil asla.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "W Jr.",
      "created_time": "July 13, 2023, 10:09:19 AM",
      "body": "Quote from: SUPERSAIAN on July 13, 2023, 09:07:48 AMQuote from: kriminall on May 23, 2023, 09:33:36 AMQuote from: Gencecikmen on May 22, 2023, 02:02:45 PMGüzel bir post olmuş @karabiber hocama teşekkürler ilk olarak. Maalesef hangi ürünün endeksini alsak biz daha pahalı tüketiyoruz. Ama bigmac menü ile ilgili şöyle bir anım var. Biliyorsunuz bizdeki bigmacxxl bile o kadar küçük ki doymuyorsunuz. Bu sebeple yurtdışında da bigmacxxl menü söylemiştim ve yarısını ancak bitirebilmistim. Demem o ki hem fazla para veriyoruz hem de satın aldığımız ürün çok az. Kalitesi ve hijyen koşullarını söylemiyorum bileYurtdışına gidebilmek bile bugün bir ayrıcalık, yurtdışında kalmak daha fazla ayrıcalık, big mac endeksiyle bile alım gücümüze bakarsak nerelere geldiğimiz ortada hocam, konu bence de çok faydalı çünkü bir çok insan bundan bi haber, böyle bir ekonomik terim olmasa da en azından alım gücünü kıyaslamak adına bence önemli bir gösterge, elbette dediğiniz de var, yurtdışındaki ürünler ile Türkiye’deki ürünler aynı değil, yine de alım gücü kıstasında düşünülebilir, Yurtdışına gidebilmek günden güne daha da zorlaşıyor. Uçak biletlerine bakıyorum ara sıra ardından hayal kırıklığıyla siteyi kapatıyorum. Sadece gidiş, dönüş bileti binlerce lirayı geçiyor.. Haklısınız bu arada yurt dışındaki ürünlerle Türkiyede'ki ürünleri kıyaslamamız için ürünün aynı olması gerekiyor. İsim olarak aynı olsa da içerik aynı içerik değil asla.Yurt dışına giden ülkemizde yetişen Antep fıstığı, domates, turunçlar ile yurtiçinde pazarda satılanlar bile aynı değil.Türk çayı dediğimiz ve içtiğimiz şey aslında 2-3 kalite düşük.Kaliteli çayların hepsini yurtdışına gönderiyoruz.Böyle olunca artık kullandığımız şeylerin hepsi düşük kalite olduğu için yediklerimizin de düşük kalitede olduğunu anlar olduk.Bu durumu da yadırgamıyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gencecikmen",
      "created_time": "July 13, 2023, 10:38:30 AM",
      "body": "Quote from: W Jr. on July 13, 2023, 10:09:19 AMQuote from: SUPERSAIAN on July 13, 2023, 09:07:48 AMQuote from: kriminall on May 23, 2023, 09:33:36 AMQuote from: Gencecikmen on May 22, 2023, 02:02:45 PMGüzel bir post olmuş @karabiber hocama teşekkürler ilk olarak. Maalesef hangi ürünün endeksini alsak biz daha pahalı tüketiyoruz. Ama bigmac menü ile ilgili şöyle bir anım var. Biliyorsunuz bizdeki bigmacxxl bile o kadar küçük ki doymuyorsunuz. Bu sebeple yurtdışında da bigmacxxl menü söylemiştim ve yarısını ancak bitirebilmistim. Demem o ki hem fazla para veriyoruz hem de satın aldığımız ürün çok az. Kalitesi ve hijyen koşullarını söylemiyorum bileYurtdışına gidebilmek bile bugün bir ayrıcalık, yurtdışında kalmak daha fazla ayrıcalık, big mac endeksiyle bile alım gücümüze bakarsak nerelere geldiğimiz ortada hocam, konu bence de çok faydalı çünkü bir çok insan bundan bi haber, böyle bir ekonomik terim olmasa da en azından alım gücünü kıyaslamak adına bence önemli bir gösterge, elbette dediğiniz de var, yurtdışındaki ürünler ile Türkiye’deki ürünler aynı değil, yine de alım gücü kıstasında düşünülebilir, Yurtdışına gidebilmek günden güne daha da zorlaşıyor. Uçak biletlerine bakıyorum ara sıra ardından hayal kırıklığıyla siteyi kapatıyorum. Sadece gidiş, dönüş bileti binlerce lirayı geçiyor.. Haklısınız bu arada yurt dışındaki ürünlerle Türkiyede'ki ürünleri kıyaslamamız için ürünün aynı olması gerekiyor. İsim olarak aynı olsa da içerik aynı içerik değil asla.Yurt dışına giden ülkemizde yetişen Antep fıstığı, domates, turunçlar ile yurtiçinde pazarda satılanlar bile aynı değil.Türk çayı dediğimiz ve içtiğimiz şey aslında 2-3 kalite düşük.Kaliteli çayların hepsini yurtdışına gönderiyoruz.Böyle olunca artık kullandığımız şeylerin hepsi düşük kalite olduğu için yediklerimizin de düşük kalitede olduğunu anlar olduk.Bu durumu da yadırgamıyoruz. Çok doğru noktalara değinmişsiniz hocalarım.@SUPERSAIAN Bir kaç yıl önce 10.000 TL olan Japonya bileti geçen gün 30.000 TL idi. Japonya'da yüksek lisans yapan arkadaşım ailesini ziyarete gelemiyor. @W Jr. bir kaç yıl öncesine gidersek, bir bakteri yüzünden Rusların geri gönderdiği domatesleri iç piyasada satmislardi. Toplanan kaliteli ve sağlıklı olanları dış pazara, kalitesiz ve sağlıksız olanları iç pazara maalesef.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "January 26, 2024, 07:25:06 PMLast edit: January 26, 2024, 07:35:55 PM by eightdots",
      "body": "Quote from: karabiber on April 27, 2023, 10:49:54 AMÖrnekle açıklamak gerekirse bir Big Mac’in Amerika fiyat ortalaması 5,20 Dolar ve Türkiye fiyat ortalaması 130 Türk Lirası’dır. Hiç kur çevrimi yapmadan Türkiye’de Big Mac fiyatıyla ABD arasında 6.7 katlık bir fark vardır. Türkiye’de güncel kur (19,43) ile ortalama bir Big Mac fiyatı 6.7 Dolardır. 130/5.2 = 25 Endekse göre kurun olması gereken yer 25 TL’dir. Ancak güncel USDTRY 19,43 TL’dir. Buradan hareketle Türk Lirası şu anda olması gereken yerden daha değerlidir. Big Mac endeksine göre kurun 25 Tl olması beklenmektedir. Konu ilgi çekiciydi ve X'te gönderiyi gördüğümde konuya güncelleme eklemek istedim. 2 Temmuz 2023'te 120 TL olan Big Mac şu an tweete göre 180 TL. Bulunduğum bölgede fiyata baktığımda ise 150 TL. Aradaki fark fazla olduğu için hesaplama yapmak doğru tahmini vermeyebilir.Yine de merak edenler için grafiği ve bağlantıyı ekliyorum. Big Mac fiyatı 180 TL olarak hesaplandığında ortaya çıkan grafik;1Kaynak:1https://twitter.com/ali_hakan_kara/status/1750840454365466680",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ingiltere",
      "created_time": "January 26, 2024, 09:58:33 PM",
      "body": "Bu grafik ekonominin son durumu hakkında fikir veriyor. Yemek uygulamalarına ve restoranların menülerine baktığımız zaman Big Mac fiyatlarından durumu anlayabiliyoruz. Yeni yılda büyük zamlar yapıldı. Diğer firmalar aynı oranda zam yapmadı. Şu anda kamudaki ücret artışları yüksek olduğu için hissedilmemiş olabilir ancak ara zam yapılmazsa yıl sonuna doğru durumun ne kadar kötüye gittiğini görmüş olacağız. Quote from: eightdots on January 26, 2024, 07:25:06 PM2 Temmuz 2023'te 120 TL olan Big Mac şu an tweete göre 180 TL. Bulunduğum bölgede fiyata baktığımda ise 150 TL. Aradaki fark fazla olduğu için hesaplama yapmak doğru tahmini vermeyebilir.Yemek uygulamalarından tek Big Mac fiyatına bakabilirsiniz. Ben 150 TL gibi bir fiyat göremiyorum. Şu andaki fiyat 180 TL. Özellikle gençler Mcdonald's uygulamasından menü alıyor uyguna gelmesi için, ancak bu endekste tek burger satış fiyatı baz alınıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "January 27, 2024, 06:55:31 AM",
      "body": "Quote from: eightdots on January 26, 2024, 07:25:06 PMKonu ilgi çekiciydi ve X'te gönderiyi gördüğümde konuya güncelleme eklemek istedim. 2 Temmuz 2023'te 120 TL olan Big Mac şu an tweete göre 180 TL. Bulunduğum bölgede fiyata baktığımda ise 150 TL. Aradaki fark fazla olduğu için hesaplama yapmak doğru tahmini vermeyebilir.Yine de merak edenler için grafiği ve bağlantıyı ekliyorum. Big Mac fiyatı 180 TL olarak hesaplandığında ortaya çıkan grafik;1Kaynak:1https://twitter.com/ali_hakan_kara/status/1750840454365466680Türkiye, En düşük Bic Mac Endeksine sahip on ülke arasında yer alıyor. (-48.04%) https://worldpopulationreview.com/state-rankings/big-mac-index-by-state Güncel kurla TR’de 5,94 Dolara Big Mac alınıyor. 2024’te Amerika Birleşik Devletleri'ndeki Big Mac'ler sandviç başına yaklaşık 5,15 dolara mal oluyor. 180/5,15 = 34,95(TL’nin dolar karşısında olması gereken rakam) aslında konuyu ilk yazdığım zamana göre Türk Lirası Dolara karşı olması gereken yerden hala uzak ve değerli. Konuyu açalı bir yıl bile olmamış ve TL %50 değer kaybetmiş. Artık sadece döviz kurunu baz alarak yapılan ekonomi yorumlarını doğru bulmuyorum ve Türkiye’de maalesef fiyatlandırma konusunda işler rayından çıkmış vaziyette.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}