{
  "id": "topic_5408097",
  "title": "Ambire",
  "author": "Ambire",
  "created_time": "July 29, 2022, 10:29:05 PM",
  "content": "The Fed rate hike on Wednesday was a snooze fest. Just like everyone expected, the Fed raised rates by a quarter point. And just like everyone expected, the “dot plot” showed that the Fed expects rates to rise to 3.5% by the end of the yearThe only thing that wasn’t entirely expected was the market reaction. Cryptocurrencies, which are often seen as a safe haven asset, soared/The biggest winner was Ether (ETH), the native cryptocurrency of the Ethereum blockchain. ETH prices jumped 16% on the day. The rally was partly due to the fact that the Ethereum network successfully implemented a “shadow fork,” or test software update, two days earlier than expected. The test puts Ethereum a step closer to its much-anticipated shift from a proof-of-work network to a more environmentally friendly proof-of-stake one.Altcoins also did well after the announcement. MATIC rose by 9.3% (following the prior day’s 11% decline) and SOL jumped by 5%.Check out our newsletter at https://ambire-newsletter.beehiiv.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408097",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "July 30, 2022, 06:22:56 AM",
      "body": "Fed indeed increased the Federal Funds Rate on Wednesday by 0.75% and the US interest rate is now at 2.50%, the highest figure in over a decade.From my experience, I expected no one to know what the cryptocurrency would do due to the decision because it has always been like that for traditional assets. Interest rate decisions, whether hiked or cut might set assets in any direction as market sentiments might not always be the same.Nonetheless, the high rate hike of 0.75% is due to high inflation plaguing the US and the world at large, and the long-term effect of this hike should cause declines in the crypto market as Bitcoin and others are no more viewed as safe-haven currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GFDhd",
      "created_time": "July 30, 2022, 07:29:37 AM",
      "body": "Cryptocurrency prices edged higher after the Federal Reserve hiked interest rates, but markets are expected to remain volatile and bearish in the coming weeks. Aggressive rate hikes usually have a negative impact on cryptocurrency prices, and the market is likely to remain bearish in the short term. But Bitcoin has experienced many interest rate hikes since its emergence, so in the long run, the impact of interest rate hikes on Bitcoin's rise and fall is not the greatest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 30, 2022, 07:44:33 AM",
      "body": "Quote from: Ambire on July 29, 2022, 10:29:05 PMThe Fed rate hike on Wednesday was a snooze fest. Just like everyone expected, the Fed raised rates by a quarter point. And just like everyone expected, the “dot plot” showed that the Fed expects rates to rise to 3.5% by the end of the yearThe only thing that wasn’t entirely expected was the market reaction. Cryptocurrencies, which are often seen as a safe haven asset, soared/The biggest winner was Ether (ETH), the native cryptocurrency of the Ethereum blockchain. ETH prices jumped 16% on the day. The rally was partly due to the fact that the Ethereum network successfully implemented a “shadow fork,” or test software update, two days earlier than expected. The test puts Ethereum a step closer to its much-anticipated shift from a proof-of-work network to a more environmentally friendly proof-of-stake one.Altcoins also did well after the announcement. MATIC rose by 9.3% (following the prior day’s 11% decline) and SOL jumped by 5%.Check out our newsletter at https://ambire-newsletter.beehiiv.com/Ethereum soared only because of that successful test and I don't think it was impacted by the Fed increasing their rates.However what I have noticed as I have to keep a tab open in my work at some crypto sites sometimes I see that the cryptocurrencies are directly related to the power of the us dollar.When it goes up like it did lately the crypto prices stayed at the same level or even dropped some,when the us dollar goes down the crypto prices tend to go up.This is just what I see from keeping that tab open everyday.I don't think the Fed increasing rates will have a direct impact on the price of Bitcoin,Bitcoin is not impacted by these events as we have seen in the past history.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "July 30, 2022, 08:11:05 AM",
      "body": "Quote from: EarnOnVictor on July 30, 2022, 06:22:56 AMand the long-term effect of this hike should cause declines in the crypto market as Bitcoin and others are no more viewed as safe-haven currencies.Altcoins are not very reliable and i would not run to them during inflation or normal markets, but bitcoin is still very much considered to be a safe haven asset by many. I would comfortably hold bitcoin during global market regressionIf you look at the charts over the last couple of months and years, and compare that with other assets, bitcoin has held its price very well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "July 30, 2022, 08:42:46 AM",
      "body": "Even prior to the announcement though, the price of bitcoin is already going as high as $24k for several days. So yes, there are no huge impact on the market, Not just for crypto but even traditional financial markets have reacted positively.Maybe investors are already anticipating this news from Feds that no one was even surprised by the said news. And probably waiting for this news before they buy crypto again as hedge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "July 30, 2022, 09:26:05 AM",
      "body": "FED raises rate, crypto plummets as a result of it. FED raises rate, crypto consequently increases.Do you see any logic here? It's not. In fact, there are effects from increase or decrease of rate, of recession, inflation, etc. but most of times, people over react against news and fact. After FED tightened their policies a few months ago, we can imagine that interest rates will increase for a while before it will be stable again.What we see on the market are instant panic and lag effect of it. When instant emotional effects finish, the same news later will not show any big effect like what we see in the latest FOMC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gurunanakji777",
      "created_time": "July 31, 2022, 06:07:41 PM",
      "body": "Honestly speaking in the past years, I have never analyzed the market like this that FED rate affects the crypto market but in the last 1 year, I noticed many of the traders analyze the crypto market like a forex market but still I can't say with surety the rally occurs due to the fed rate hike but it's overall good for the crypto market. I have seen several charts and analyzed the live market also but I can say this market is different from the forex market where fed news affects the market I think we should not correlate this with the fed rate hike but might be I can be wrong also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "July 31, 2022, 07:50:22 PM",
      "body": "It is obvious some people just want to attribute every rise and fall to any particular event that happens during that period, the article wants people to believe this has a connection why btc price increases alongside several other alts. Am not an expert but i don't see the connection. I think the fear is reducing and investors are ready to come back in, those who were waiting for below 10k suddenly realize that it won't happen. the fear of missing out is coming back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "July 31, 2022, 08:56:37 PM",
      "body": "FED has shaped the markets by making hawkish statements before. Markets saw these statements long before and revised their prices accordingly. Thus, there seems to be an imbalance between descriptions and prices. In fact, there is no imbalance between the descriptions and the prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}