{
  "id": "topic_5499581",
  "title": "tabas",
  "author": "tabas",
  "created_time": "June 11, 2024, 10:41:35 AM",
  "content": "While scrolling on coinmarketcap, I've seen this post of watcher.guru that Bitcoin has a higher market capitalization compared to the three biggest banks in the world, even combining them all.X link source: https://x.com/WatcherGuru/status/1799853290538365141Based on: https://companiesmarketcap.com/assets-by-market-cap/Here are their current rankings:Bitcoin currently ranked at #9JP Morgan Chase ranked at #16Bank of America ranked at #35ICBC ranked at #45I do hope that people will realize the full the potential of Bitcoin. It has surpassed the combined market cap of these known banks globally and if they value their money, it's not too late to invest in Bitcoin. Everyone is also free to check out that link above about to see what are the other notable and top coporations that has surpassed by Bitcoin in terms of its market capitalization.PS: Ethereum ranked at #24 which is higher than the two above.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5499581",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "June 11, 2024, 10:50:41 AM",
      "body": "I saw this post yesterday when I visited CMC but I didn't pay much attention to it because it was not too important to me as I'm already invested in Bitcoin. I think the post is all about telling people to have faith in Bitcoin given how well it has performed and the potential it holds, being an asset with limited supply amidst growing demands. Indeed those who have not come to terms with the fact that Bitcoin is a huge opportunity can clearly see how the future might look like... a situation where Bitcoin will be the dominant topic in the financial world and those who are invested in it confident and proud as those controlling the shares of these famous banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avp2306",
      "created_time": "June 11, 2024, 11:03:28 AM",
      "body": "Not surprised about this since.Bitcoin global investors reach on any parts of the world.While the Businesses of those 3 giant companies are just operating in limited jurisdictions.So expect that Bitcoin would really dominate in terms of marketcap since its more accessible to a lot of investors that's why there are some entities want to disrupt it and push their personal interest since there's really huge money involve that might transfer to what they are promoting. That's why maybe they push CBDC since they know that its more beneficial for controlling bodies to operate this rather than bitcoin which they are totally out of control on this asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Felicity_Tide",
      "created_time": "June 11, 2024, 11:05:26 AM",
      "body": "Quote from: tabas on June 11, 2024, 10:41:35 AMI do hope that people will realize the full the potential of Bitcoin. It has surpassed the combined market cap of these known banks globally and if they value their money, it's not too late to invest in Bitcoin. Everyone is also free to check out that link above about to see what are the other notable and top coporations that has surpassed by Bitcoin in terms of its market capitalization.And what if some of these banks are making their investments behind the scene. Well, we can never tell. Seeing silver ahead of Bitcoin was quite surprising. I remembered how Bitcoin surpassed silver in it's last ATH break out. Seeing the entire list, Bitcoin has a better potential as there are more price discovery to be seen. As Bitcoin continue to break it's ATH with more investors coming on board, Bitcoin will unarguably climb to compete with the top 5 on the list. As Bitcoin continue to grow and break it's ATH, we won't even be competing with most of this banks and companies in terms of market capitalization. As for those of us here, HODL shouldn't be a debate again as the journey keeps getting interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 11, 2024, 11:33:14 AM",
      "body": "Quote from: tabas on June 11, 2024, 10:41:35 AMWhile scrolling on coinmarketcap, I've seen this post of watcher.guru that Bitcoin has a higher market capitalization compared to the three biggest banks in the world, even combining them all.I don't care about ranks of Bitcoin and three biggest banks especially banks but through your thread, I would like to say one thing.These banks have longer histories than Bitcoin, they are all centralized, while Bitcoin is decentralized and no government, no founder, no core team developers control Bitcoin protocol. No terminate button to freeze any Bitcoin wallet or address like with commercial banks, your account always has risk to be terminated, fund can be frozen.Similar risk with centralized cryptocurrency exchanges.Reminder: do not keep your money in online accounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "June 11, 2024, 11:40:59 AM",
      "body": "Quote from: tabas on June 11, 2024, 10:41:35 AMI do hope that people will realize the full the potential of Bitcoin. It has surpassed the combined market cap of these known banks globally and if they value their money, it's not too late to invest in Bitcoin. Everyone is also free to check out that link above about to see what are the other notable and top coporations that has surpassed by Bitcoin in terms of its market capitalization.It is possible that in the next 4 years Bitcoin will occupy the top 5 positions, with its worldwide popularity and can be adopted by anyone, the potential to encourage a larger market cap can no longer be stopped. After this year's halving, many institutions have opened up to Bitcoin and are no longer afraid of its volatility. Because with the remaining supply of bitcoin dwindling, people and institutions are increasingly fighting over the remaining bitcoin. Since this is a value issue, I think banks are eager to recognize that Bitcoin's market cap will shift them as adoption increases across a wide range of financial institutions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "June 11, 2024, 12:03:59 PM",
      "body": "Of course I am not surprised at this, because bitcoin is a commodity and whoever buys bitcoin is adding to the market cap. Bitcoin is bitcoin worldwide, but those banks are in various places and their operations is in fiat. Those banks can print more money but bitcoin has limited supply of 21 million. It will be impossible for centralized bank to have higher market cap than Bitcoin because gradually fiat is depreciating and bitcoin value appreciates, which is giving people more confidence to invest in bitcoin and abandon fiat because of lack of confidence in fiat. Banks are run by individuals but bitcoin is decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "June 11, 2024, 02:27:53 PM",
      "body": "Quote from: avp2306 on June 11, 2024, 11:03:28 AMWhile the Businesses of those 3 giant companies are just operating in limited jurisdictions.But, we can still able to buy US's company stock even we're not an American, I'm not sure in your country, but in my country I can use local broker to buy US's company stock. Although it's true Bitcoin is more widely since no one can stop people to own Bitcoin.Quote from: Frankolala on June 11, 2024, 12:03:59 PMIt will be impossible for centralized bank to have higher market cap than Bitcoin because gradually fiat is depreciating and bitcoin value appreciates, which is giving people more confidence to invest in bitcoin and abandon fiat because of lack of confidence in fiat. Banks are run by individuals but bitcoin is decentralized. If most people think like this, those three banks would be bankrupt or they have very low market cap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "June 11, 2024, 02:42:49 PM",
      "body": "Quote from: Plaguedeath on June 11, 2024, 02:27:53 PMBut, we can still able to buy US's company stock even we're not an American, I'm not sure in your country, but in my country I can use local broker to buy US's company stock. Although it's true Bitcoin is more widely since no one can stop people to own Bitcoin.You can buy bitcoin no matter where you are living and your nationality. You can do it legally if Bitcoin exchange is allowed by law in your country but if it is Alegal, you can buy it too without considerable potential problems by laws and with government.If Bitcoin exchange is prohibited (illegal) in your nation, you can still purchase it through non KYC exchanges but you surely must concern about legal issues potentially with government.https://newhedge.io/terminal/bitcoin/legality-map",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "June 11, 2024, 02:50:52 PM",
      "body": "Quote from: tabas on June 11, 2024, 10:41:35 AMI do hope that people will realize the full the potential of Bitcoin. It has surpassed the combined market cap of these known banks globally and if they value their money, it's not too late to invest in Bitcoin. Everyone is also free to check out that link above about to see what are the other notable and top coporations that has surpassed by Bitcoin in terms of its market capitalization.This is a great news. Bitcoin adoption is growing worldwide. Individuals are adopting Bitcoin, big financial institutions are adopting Bitcoin, families are adopting Bitcoin and this is because they have seen its future potentials. To keep takeaway for me is that my small efforts in my country to talk about Bitcoin online and offline so as many people who shows the slightest interest in Bitcoin is not in vain. Because it is having a ripple effect worldwide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "June 11, 2024, 02:54:20 PM",
      "body": "Comparing apples and hotdogs!It's like comparing the total value of gold with the assets Caterpillar has!And what are we even comparing here, all the money that Bitcoin is worth now with what?If we compare with the total assets JPMorgan for example is having under its control those alone are 3.9 trillion!Quote from: Frankolala on June 11, 2024, 12:03:59 PMIt will be impossible for centralized bank to have higher market cap than Bitcoin because gradually fiat is depreciating and bitcoin value appreciates, which is giving people more confidence to invest in bitcoin and abandon fiat because of lack of confidence in fiat. Banks are run by individuals but bitcoin is decentralized.Then how do explain the 3.9 trillion in assets JPMorgan has?There are 23! banks in the world each with more assets under control than the total marketcap of bitcoinhttps://en.wikipedia.org/wiki/List_of_largest_banks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "June 11, 2024, 03:02:25 PM",
      "body": "Quote from: Plaguedeath on June 11, 2024, 02:27:53 PMQuote from: avp2306 on June 11, 2024, 11:03:28 AMWhile the Businesses of those 3 giant companies are just operating in limited jurisdictions.But, we can still able to buy US's company stock even we're not an American, I'm not sure in your country, but in my country I can use local broker to buy US's company stock. Although it's true Bitcoin is more widely since no one can stop people to own Bitcoin.Quote from: Frankolala on June 11, 2024, 12:03:59 PMIt will be impossible for centralized bank to have higher market cap than Bitcoin because gradually fiat is depreciating and bitcoin value appreciates, which is giving people more confidence to invest in bitcoin and abandon fiat because of lack of confidence in fiat. Banks are run by individuals but bitcoin is decentralized. If most people think like this, those three banks would be bankrupt or they have very low market cap.I find this comparison lame and nothing worth celebrating. Why don't you try comparing bitcoin with corporations like Apple, Nvidia or Microsoft? All three of the above corporations are in the United States and if I remember correctly, all three have a capitalization of over $3 trillion, double the capitalization of bitcoin or even higher than the entire cryptocurrency market.In my opinion, bitcoin is an asset, an investment, and for a fairer comparison we should compare bitcoin with gold and silver, not with companies and corporations. As Odohu said, these interesting comparisons are only intended to strengthen people's faith in bitcoin and have no meaning. I will really celebrate if bitcoin's capitalization can surpass that of gold, that's something for us to be proud of.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0t3p0t",
      "created_time": "June 11, 2024, 03:03:29 PM",
      "body": "Does that clearly mean that more and more people are into Bitcoin investment than banks? I can also see a reason where banks are only limited to residents, investors and it's users if I am not mistaken while Bitcoin since it is a decentralized revolutionary asset it literally means that whoever you are, wherever we are in the planet as long as we embrace the idea of Bitcoin we can invest on it anytime and anywhere that is what I think the reason why it has that capitalization I could be wrong but who knows? 😅",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "June 11, 2024, 03:19:28 PM",
      "body": "Quote from: stompix on June 11, 2024, 02:54:20 PMQuote from: Frankolala on June 11, 2024, 12:03:59 PMIt will be impossible for centralized bank to have higher market cap than Bitcoin because gradually fiat is depreciating and bitcoin value appreciates, which is giving people more confidence to invest in bitcoin and abandon fiat because of lack of confidence in fiat. Banks are run by individuals but bitcoin is decentralized.Then how do explain the 3.9 trillion in assets JPMorgan has?There are 23! banks in the world each with more assets under control than the total marketcap of bitcoinhttps://en.wikipedia.org/wiki/List_of_largest_banksI agree with you, but don't you think that part JP Morgan assest was inherited and it means that those asset have been there from one generation to another generating profits which has increased the market cap of his asset. Bitcoin is still young and if as presumption, the price of bitcoin increases overtime, we might see bitcoin market cap above JP Morgan total asset market cap. Those banks have been in existence even before I was given birth to.Thanks for the list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BABY SHOES",
      "created_time": "June 11, 2024, 03:28:24 PM",
      "body": "Quote from: dzungmobile on June 11, 2024, 02:42:49 PMQuote from: Plaguedeath on June 11, 2024, 02:27:53 PMBut, we can still able to buy US's company stock even we're not an American, I'm not sure in your country, but in my country I can use local broker to buy US's company stock. Although it's true Bitcoin is more widely since no one can stop people to own Bitcoin.You can buy bitcoin no matter where you are living and your nationality. You can do it legally if Bitcoin exchange is allowed by law in your country but if it is Alegal, you can buy it too without considerable potential problems by laws and with government.If Bitcoin exchange is prohibited (illegal) in your nation, you can still purchase it through non KYC exchanges but you surely must concern about legal issues potentially with government.https://newhedge.io/terminal/bitcoin/legality-mapThat's what Bitcoin prefers because it can be bought easily in any country even with non-KYC as you said, but fortunately what I see now is that some countries have been friendly to bitcoin as a commodity asset and should never be used as a transaction tool except in countries that are already legal western countries for example.To buy foreign stocks such as the US then for me it is difficult to find a local broker on average that I know local stocks are more in demand because stocks from the US are too high.I'm not comparing but still bitcoin has a wider range with a large enough capitalist especially if the price reaches $100K it will be even higher MC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 11, 2024, 03:37:51 PM",
      "body": "Some big banks have already confirmed their exposure to Bitcoin ETFs. JPMorgan Chase holds positions in BlackRock's, Fidelity's, Grayscale's, and several other ETFs.  I haven't heard any news that Bank of American owns any Bitcoin ETFs, but some other US and European banks have smaller and bigger positions in various funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "June 11, 2024, 03:41:56 PM",
      "body": "Quote from: tabas on June 11, 2024, 10:41:35 AMWhile scrolling on coinmarketcap, I've seen this post of watcher.guru that Bitcoin has a higher market capitalization compared to the three biggest banks in the world, even combining them all.X link source: https://x.com/WatcherGuru/status/1799853290538365141Based on: https://companiesmarketcap.com/assets-by-market-cap/Here are their current rankings:Bitcoin currently ranked at #9JP Morgan Chase ranked at #16Bank of America ranked at #35ICBC ranked at #45I do hope that people will realize the full the potential of Bitcoin. It has surpassed the combined market cap of these known banks globally and if they value their money, it's not too late to invest in Bitcoin. Everyone is also free to check out that link above about to see what are the other notable and top coporations that has surpassed by Bitcoin in terms of its market capitalization.PS: Ethereum ranked at #24 which is higher than the two above.If we are to compare the worth and market cap of bitcoin to all other cryptocurrencies in the world, we are going to discover that bitcoin is still more far fetched than what they all constitute altogether in cryptocurrency, this tells us that bitcoin is the major global attraction on both the economic and financial regulatory part of the world and the government cannot do anything against it, all these were so because it provides the answer to every challenged situations regarding finances in the economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 11, 2024, 03:48:37 PM",
      "body": "Quote from: tabas on June 11, 2024, 10:41:35 AMI do hope that people will realize the full the potential of Bitcoin. It has surpassed the combined market cap of these known banks globally and if they value their money, it's not too late to invest in Bitcoin. Everyone is also free to check out that link above about to see what are the other notable and top coporations that has surpassed by Bitcoin in terms of its market capitalization.There was this video around 2014 which I saw a few days ago, in which the person was saying BTC is a good investment while another rich man was saying it is a bubble that can pop anytime. And the dude who said BTC is good, he says because there was around 1.3$ Billion market cap of it at that time. And now the market cap is in trillions. I mean it's 1.37 trillion dollars. That's insane. I am getting the vibe in a few years this trillion figure is going to be changed as it changes from billion to trillion. I hope I am not expecting a lot from BTC. Although I am not expecting or hoping it to do that I am still just in case.These banks are still considered safe by traditional people I wonder how will they behave after listening to this information. I hope they will at least start to consider it for investment but that's not my purpose in convincing them because with time as it will be adopted more by many countries left, they will auto be convinced to invest in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "June 11, 2024, 04:01:56 PM",
      "body": "Quote from: Frankolala on June 11, 2024, 12:03:59 PMOf course I am not surprised at this, because bitcoin is a commodity and whoever buys bitcoin is adding to the market cap. Bitcoin is bitcoin worldwide, but those banks are in various places and their operations is in fiat. Those banks can print more money, but bitcoin has limited supply of 21 million. It will be impossible for centralized bank to have higher market cap than Bitcoin because gradually fiat is depreciating and bitcoin value appreciates, which is giving people more confidence to invest in bitcoin and abandon fiat because of lack of confidence in fiat. Banks are run by individuals, but bitcoin is decentralized. I support this since bitcoin is being used globally, everywhere in the world. We can use Bitcoin, so we are not surprised if the market cap surpasses these banks. You know banks are using fiat, and the fact that there are some places where they will not accept fiat makes it easy for bitcoin to make it up to this market cap. The fact that I know bitcoin is digital also makes it obvious that bitcoin can definitely reach here. We all know how bitcoin started and see where it is now, so people believe that it will be more than this in the future, so before they miss out, that is why they are taking the necessary decision now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zakservers",
      "created_time": "June 11, 2024, 05:26:13 PM",
      "body": "Yes, seems very happy to see the growth of bitcoin, actually its a very good idea, with so much digitization around and constant upgraded internet reach and speed, also may be more future companies will invest in satellite based internet to cover the whole planet, we really needed this, we are always supporting it, and glad to see it surpassing big banks with fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}