{
  "id": "topic_5445158",
  "title": "SylasDarkmoon",
  "author": "SylasDarkmoon",
  "created_time": "March 16, 2023, 12:05:19 PM",
  "content": "Hey folks,I've recently resurrected ALFAquotes website with the new name: bitcoinfair.org which was calculating Bitcoin's Fair Value (Price) and was mentioned in CoinDesk: https://www.coindesk.com/markets/2015/03/02/is-518-the-fair-price-of-bitcoin/NASDAQ: https://www.nasdaq.com/articles/bitcoin-price-prediction-why-its-only-now-finding-true-value-2015-03-11The formula may be interesting for long-term investors and correlation is pretty interesting. Inspiration to create such formula and calculate for the whole period of Bitcoin's existence came after getting familiar with Ben Graham's works.Fair Value is fully based only on mining costs, price has no influence on it, but correlation between two is pretty interesting.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445158",
  "comments": [
    {
      "author": "franky1",
      "created_time": "March 17, 2023, 01:01:42 AM",
      "body": "value is below market. premium is above market it appears your numbers for 2022-23 are average not valueyour formulae numbers are subjective8 cent electric of a 12 month ROIhmmmy numbers are from efficient asic farming mining in low electric of $18k for this fortnights mining rateto an inefficient asic hobby mining in high electric of $118k for this fortnights mining ratewhich is an average of ~$68kvalue: 18kaverage: 68kpremium: 118kas for your numbers for 2018.. that is way above premium for that period even for high electric regionsmy math is based on a 2 year ROIbecause industrial mining farms buy hardware that lasts 2 years and electric contracts that are bought for upto 2 years so the number of coins earned over a 2 year period become the math. and industrial electric is cheaper then $0.08 at $0.04 and the hobbiest is electric is more then $0.08 at upto $0.48..that said you have a good bases of looking beyond the markets for underling value. but your math is a lil out, compared to rational expectations of what real mining farms doand another hint. the math you show saying how you are using 1 year measures of coins earned. and then 6 months and then fortnightly difficulty changes.. yet your charts changes daily so your not exactly sticking to the difficulty steps of one change a fortnight. using average hashrate of that fortnightmost miners dont account for costs on the daily. they take the monthly costs or the 2 yearly costs and compare it to coins earned over those averages",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "March 17, 2023, 03:17:24 AM",
      "body": "Quote from: SylasDarkmoon on March 16, 2023, 12:05:19 PMFair Value is fully based only on mining costs, price has no influence on it, but correlation between two is pretty interesting.Why is the mining cost the \"fair\" value? Also, I have some bitcoins from when it cost $5 to mine a bitcoin. Does that mean that those bitcoins are worth $5?BTW, the cost of mining and the price are correlated because the price acts as a ceiling on the cost of mining. In general, miners will not mine when the cost of mining exceeds the cost of buying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "March 17, 2023, 03:23:59 AM",
      "body": "Quote from: odolvlobo on March 17, 2023, 03:17:24 AMWhy is the mining cost the \"fair\" value? Also, I have some bitcoins from when it cost $5 to mine a bitcoin. Does that mean that those bitcoins are worth $5?It is true in nearest term not in too long term.People are fearful of dumps from people who will receive compensation from Mt. Gox case because they know those victims got their bitcoins at very cheaper price than price in 2023.Similar story for miners. Different miners have different entries and entry cost to mine Bitcoin so they will have different net profit or net loss at a time. Sometimes I saw whale alerts that very old bitcoins years ago were moved and people felt panic. Maybe it is a same fear as they thought that if a miner from 2011 moved their bitcoins, that can be a plan to sell it on exchanges.However I am aware that it is part of market manipulation game.This Realized price is useful for Bitcoin investors and their DCA plans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "March 17, 2023, 04:22:59 AM",
      "body": "Quote from: MusaMohamed on March 17, 2023, 03:23:59 AMQuote from: odolvlobo on March 17, 2023, 03:17:24 AMWhy is the mining cost the \"fair\" value? Also, I have some bitcoins from when it cost $5 to mine a bitcoin. Does that mean that those bitcoins are worth $5?It is true in nearest term not in too long term.What makes it \"true\"? Perhaps you could explain what you mean by \"fair\" and \"true\", and how they relate to mining cost.I'm still curious about my bitcoin. If it was mined for $5 in 2012 and I sell it today for $25000, is the buyer getting a fair price? Am I?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 17, 2023, 04:56:20 AMLast edit: March 17, 2023, 05:31:37 AM by franky1",
      "body": "good question from odolvlobo Quote from: odolvlobo on March 17, 2023, 03:17:24 AMWhy is the mining cost the \"fair\" value? Also, I have some bitcoins from when it cost $5 to mine a bitcoin. Does that mean that those bitcoins are worth $5?because i too have coins from that period toothere is a thing called REALISED price.. (and realised value)the price of the time of acquiring coini have realised price of $6 and also some in 2014,18,22(basically after each correction)this value measure the OP made, is a bit off.. by not using real world situation to decide ROI, or a base electric cost of the real world.. .. im not sure why he chose $0.08 as its not representing the lowest(value) costbut is supposed to be about the realised value of todays acquired coins. not estimating todays value of all coins of circulation based on past acquisition to set a value today for past coinalsoQuote from: odolvlobo on March 17, 2023, 03:17:24 AMBTW, the cost of mining and the price are correlated because the price acts as a ceiling on the cost of mining. In general, miners will not mine when the cost of mining exceeds the cost of buying.VALUE is not the cost of all miners. value is a BASE/cheapest cost of the most efficient miner. whereby its the cheapest(aka value)where everyone on the planet cannot mine cheaper than that point thus no one would want to sell coins acquired for more, to sell for less. thus becomes a great supportthere are many other potential miners that if they mined today they would make a loss. EG those living in japan and hawaii which would be a premium measurethose people are not miners today. they are buyers. after all why would you mine for $118k a coin when you can market buy for 21% of premiumtodays numbers are $18k value(cheap).. $118k premiumdont expect markets to want to go below value or speculate above premiumits why 2021 didnt top $75k because that was the premium then (value: $10k premium$75k)2022 was $15k value 95k premium but the market only speculated $15.5-$50kin 2012 it was $3-$40 (value-premium) at the start and then $7-$90 (value-premium)by winter .. it was a halving year ofcoursethe market of the time of the realised value only trades within that range but never exceeds itQuote from: odolvlobo on March 17, 2023, 03:17:24 AMI have some bitcoins from when it cost $5 to mine a bitcoin. your $5 and my $6 of 2012 were not at \"value\" (base cost) because our electric were not the cheapest for that year to be the most economic/efficient to be valuethe value of 2012 was start of year $3 value end of year $7 valuethe premium of 2012 was start of year $40 premium end of year $90 premiumthe market moved inside that value-premium windowmoving onso there is this other thing called \"store of value\" which is subjective to individual coins like realised value isEG lets say you mined in january 2012.. ($3 value)your $5 coin had a 60% store of value. where only $3 of your $5 was secured by value where no one would want to sell below value because no one could mine below $3and so you had a 40% risk of loss in januaryby summer your $5 was 100% store of value. by winter it was 140% store of value meaning you were making profit (and today in 2023. just like me, them coins from so far back are worth alot more now.aka mega profits)but to those buying coins today.. with mining at $18k-$118k dependant on location.. anything $18k is good value to them.. today   market      v    |||||||||||||||||||||  18                       118value                   premiumthey see bitcoin at $24k is in a GOOD value area. not AT value, but within range of good value. but no where near average or risky premium.so people are super happy to buy your coin at $24k because its not at todays premium.note:i am sceptical of using daily changes/measures of value. because miners accounting is not done daily. they measure their costs over a 6-24 month scale(industrial mining farms). so personally im sticking with a $15k base for now and saying its too soon to concrete state value will remain at/above $18k. but knowing the value window is moving forward on the daily where value is rising in the short term is a good sign.. but $15k is a concrete number that has been tested many times last yearthe only suggestion i could make to the OP is to use a fairer 2 year ROI. and using a proper base electric cost per KWH.. he could also use different countries electric rates. and then display multiple lines cost per region. but thats then getting more regionally speculative",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "March 17, 2023, 06:34:40 AM",
      "body": "Any calculation of fair value is pretty stupid and is just to get clicks on articles.Only value that matters is market value. Bitcoin's actual utility value to society is enormous and that would be the only way to get its \"fair value\" and the tool to get to that is the market value, but because few people understand Bitcoin's utility value the market value is currently many times under this value. \"Fair\" value, \"intrinsic\" value, these are just terms people use to get eyeballs to articles and they are meaningless. What matters is market value, and utility which will drive further increases in market value.And no cost of mining has nothing to do with Bitcoin's \"fair\" value. Mining is its own economy and that economy depends directly on the market value price, mining doesn't create a $ value for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 17, 2023, 01:01:42 PM",
      "body": "Quote from: thecodebear on March 17, 2023, 06:34:40 AMAny calculation of fair value is pretty stupid and is just to get clicks on articles.Only value that matters is market value. Bitcoin's actual utility value to society is enormous and that would be the only way to get its \"fair value\" and the tool to get to that is the market value, but because few people understand Bitcoin's utility value the market value is currently many times under this value. \"Fair\" value, \"intrinsic\" value, these are just terms people use to get eyeballs to articles and they are meaningless. What matters is market value, and utility which will drive further increases in market value.And no cost of mining has nothing to do with Bitcoin's \"fair\" value. Mining is its own economy and that economy depends directly on the market value price, mining doesn't create a $ value for Bitcoin.you might want to check on that..all products have an underlying value amount below the retail market rateno one wants to sell at a loss if actual cost. which is where bitcoin has a non-zero bottomits not just speculation of emotional values(sentiments) there is a bottom value that supports and underlays the speculationif the most economically efficient dairy farmer can only produce 1 pint of milk for $0.30. you will not ever see a retail store bought milk for $0.25 a pintretail milk would be more like $0.45-$1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Artemis3",
      "created_time": "March 17, 2023, 01:56:33 PM",
      "body": "The value of things is subjective (according to each person feelings), it changes with time (needs) and space (location); never static. Cost to make, doesn't matter, time to make, doesn't matter. There is no intrinsic value.This is one of the fundamentals from the Austrian School of Economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 17, 2023, 06:19:11 PM",
      "body": "Quote from: Artemis3 on March 17, 2023, 01:56:33 PMThe value of things is subjective (according to each person feelings), it changes with time (needs) and space (location); never static. Cost to make, doesn't matter, time to make, doesn't matter. There is no intrinsic value.This is one of the fundamentals from the Austrian School of Economy.individuals values(emotions desires) differas for people personal numeric value:premiumthats speculative and variablebut if you plot them on a chart.. you would then see a gap at the bottom. draw a line along the bottom and thats the networks VALUEbecause value is at the bottom. premium is at the topbitcoin does have intrinsic values and value. based on its own desires/features and costthe value bottom is the line where no one wants to sell below.. and no one can acquire(via any method) for less..this is the non-zero support aka VALUE",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "March 17, 2023, 10:56:39 PM",
      "body": "Quote from: franky1 on March 17, 2023, 01:01:42 PMQuote from: thecodebear on March 17, 2023, 06:34:40 AMAny calculation of fair value is pretty stupid and is just to get clicks on articles.Only value that matters is market value. Bitcoin's actual utility value to society is enormous and that would be the only way to get its \"fair value\" and the tool to get to that is the market value, but because few people understand Bitcoin's utility value the market value is currently many times under this value. \"Fair\" value, \"intrinsic\" value, these are just terms people use to get eyeballs to articles and they are meaningless. What matters is market value, and utility which will drive further increases in market value.And no cost of mining has nothing to do with Bitcoin's \"fair\" value. Mining is its own economy and that economy depends directly on the market value price, mining doesn't create a $ value for Bitcoin.you might want to check on that..all products have an underlying value amount below the retail market rateno one wants to sell at a loss if actual cost. which is where bitcoin has a non-zero bottomits not just speculation of emotional values(sentiments) there is a bottom value that supports and underlays the speculationif the most economically efficient dairy farmer can only produce 1 pint of milk for $0.30. you will not ever see a retail store bought milk for $0.25 a pintretail milk would be more like $0.45-$1You're confusing the types of products you're talking about. You're trying to apply an analogy that doesn't make sense.Products like milk are produced and sold and consumed, so yes of course the cost of production creates a basis for the market cost. But we're talking about Bitcoin here (a currency), not milk (a consumable).A currency is nothing like a consumable. The units of a currency stick around and are not consumed (used up) or degraded ('used' bitcoin don't sell for less) and the older units are not connected to the cost of producing the latest units. While the latest units are so small in quantity compared to the total supply that they have very little effect on the market. Mining only produces the latest few bitcoins each block, which is a tiny tiny fraction of the amount of bitcoin that are traded in the market while that block is being made. The cost of mining has nothing to do with the cost of the rest of the bitcoin on the market.So you're flipping this upside down in your mind. Miners rely on the market cost of Bitcoin - as in, if bitcoin goes too far below that miner's cost of production they may have to shut down. It doesn't work the other way. The market rate of Bitcoin DOES NOT rely on the cost of production for miners.You would be correct if every satoshi could only be used once, but of course that is not how currencies work.You're getting too narrowly focused on trying to come up with some base price of Bitcoin, when in reality, of course, there is none. By 'none' I of course don't mean $0, I just literally mean none. There is no value that can be given as a \"fair\" or \"base\" or \"intrinsic\" value. All those concepts are meaningless and are just used in subjective arguments. The only $ value Bitcoin has is the market value.Bitcoin has two types of values. One is its $ value, which is the market price. There is no other $ value for a bitcoin. The other is its utility value, which is of course based on its features, those features in comparison to similar things in existence, and people's desire to specifically use Bitcoin for its features. It is this value that drives the market to find a $ value, but no $ value can be specifically given to the utility value because utility is a concept, not a quantity. The overall movement of the market ($) value of Bitcoin is what we can call price discovery which is the market finding an accepted price for Bitcoin's conceptual utility value. Naturally, this changes, and as Bitcoin is more widely adopted it continues going up as part of its price discovery. But there is never any base value 'holding up' the market derived from some cost of production. What holds up the market is the market itself - the unwillingness of people to sell bitcoin for low prices when they know its utility demands a much higher market value in the future as price discovery continues. No where in this does the cost of mining matter. Only miners care about the cost of mining, the market does not (except in so far as it makes negative or positive news in the media when miners are doing really well or are having a hard time, but they are doing really well or having a hard time BECAUSE of the market value, not the other way around).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 18, 2023, 12:01:56 AMLast edit: March 18, 2023, 01:12:52 AM by franky1",
      "body": "price is not valuevalue sits below the marketthat why when you see the price go down people say the price becomes better value(cheap)learn the concept of value or premium(cheap or expensive)lets say we knew bitcoins price would be between 17k and say 100k this yearno imagine the price today was$20k$26k$50k$75k$100kare you saying that $100k is \"value\"nothats premium. thats the ATH. thats the topvalue sits at the bottom of the marketand if you can find the bottom of the bottom where no one wants to sell for less and no one can buy for less. thats the ultimate bottomline valueso if no one on the market can buy(acquire) for less than $20k in 2023. yet some people on the planet can mine(acquire) coin for $16k in 2023the ultimate bottomline value is $16kyes value is not seen on the retail spot market. its below the spot market.but it exists because its the bottomline no one on the planet goes below in 2023if you want to argue \"market price\" .. tell me this.. WHICH marketcoinbase, binance, bitfiniex, OTC? DEFI?all of those markets are speculative stuff ABOVE value. markets are suppose to be above value. thats the whole pointin all types of market for anything the price is alwaysvalue+speculative profit=priceno one sells at a loss unless they are doing silly thingsand the amount of people on the market not wanting to make a loss helps give the bottomline support value level a margin gap where the market sits above the value but never completely drops down to or below value..as for price discoverypeople do not just pick a random numberpeople look at their costs of acquiring and set a prefered profit margin ontop. and then refuse to sell for lessyes each persons personal amounts differ.. this is the market speculationbut again if you can find the bottom. the lowest someone can acquire for on the whole planet currently .. you have found the bottomline value of the whole network/worldeverything above that is speculative and volatile. EH japans market price is higher than coinbaseOTC can be less than spot marketbut the most cheapest way to acquire bitcoin in 2023 is efficient economic mining. so mining by the most efficient miner is the underlying acquiring costthe amount of coins a cheap miner can acquire for does not personally crash markets with their coin. but no one can mine for less then the lowest cost acquisition. so no one sells below that. again the retail spot market sits above valueplease put all the individual perceptions of individuals costs on a scatter chart of all methods of acquiring bitcoin in 2023.then notice there is a VOID below a certain amount. take that lowest number of all possible methods to acquire bitcoin. and you will see the bottomline value.. which is non zeroor view the number in another fashion|    |******************|or view the number in another fashion   value                        premium|||||||||||||||||||||||||||||||0                                   118hawaiian, japanese miners are in the red area for miningiceland/slavic/asian region miners are in the green area for miningamerica/europe residential miners are in the orangeamerica/europe industrial miners are in the green/orangespot/otc/futures/defi markets are in the green NO ONE is in the grey/blank void area",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gayong88",
      "created_time": "March 18, 2023, 03:10:43 AM",
      "body": "Quote from: franky1 on March 18, 2023, 12:01:56 AMprice is not valuevalue sits below the marketthat why when you see the price go down people say the price becomes better value(cheap)learn the concept of value or premium(cheap or expensive)lets say we knew bitcoins price would be between 17k and say 100k this yearno imagine the price today was$20k$26k$50k$75k$100kare you saying that $100k is \"value\"nothats premium. thats the ATH. thats the topvalue sits at the bottom of the marketand if you can find the bottom of the bottom where no one wants to sell for less and no one can buy for less. thats the ultimate bottomline valueso if no one on the market can buy(acquire) for less than $20k in 2023. yet some people on the planet can mine(acquire) coin for $16k in 2023the ultimate bottomline value is $16kyes value is not seen on the retail spot market. its below the spot market.but it exists because its the bottomline no one on the planet goes below in 2023if you want to argue \"market price\" .. tell me this.. WHICH marketcoinbase, binance, bitfiniex, OTC? DEFI?all of those markets are speculative stuff ABOVE value. markets are suppose to be above value. thats the whole pointin all types of market for anything the price is alwaysvalue+speculative profit=priceno one sells at a loss unless they are doing silly thingsand the amount of people on the market not wanting to make a loss helps give the bottomline support value level a margin gap where the market sits above the value but never completely drops down to or below value..as for price discoverypeople do not just pick a random numberpeople look at their costs of acquiring and set a prefered profit margin ontop. and then refuse to sell for lessyes each persons personal amounts differ.. this is the market speculationbut again if you can find the bottom. the lowest someone can acquire for on the whole planet currently .. you have found the bottomline value of the whole network/worldeverything above that is speculative and volatile. EH japans market price is higher than coinbaseOTC can be less than spot marketbut the most cheapest way to acquire bitcoin in 2023 is efficient economic mining. so mining by the most efficient miner is the underlying acquiring costthe amount of coins a cheap miner can acquire for does not personally crash markets with their coin. but no one can mine for less then the lowest cost acquisition. so no one sells below that. again the retail spot market sits above valueplease put all the individual perceptions of individuals costs on a scatter chart of all methods of acquiring bitcoin in 2023.then notice there is a VOID below a certain amount. take that lowest number of all possible methods to acquire bitcoin. and you will see the bottomline value.. which is non zeroor view the number in another fashion|    |******************|or view the number in another fashion   value                        premium|||||||||||||||||||||||||||||||0                                   118hawaiian, japanese miners are in the red area for miningiceland/slavic/asian region miners are in the green area for miningamerica/europe residential miners are in the orangeamerica/europe industrial miners are in the green/orangespot/otc/futures/defi markets are in the green NO ONE is in the grey/blank void areaYou are correct that the fair value of Bitcoin is not necessarily the same as its current market price. Fair value is determined by examining the underlying factors that contribute to the value of Bitcoin, such as its utility, scarcity, and demand.The market price of Bitcoin, on the other hand, is determined by the supply and demand for Bitcoin at any given time. This means that the price of Bitcoin can fluctuate significantly based on market sentiment, news events, and other factors that may not necessarily reflect its underlying value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SylasDarkmoon",
      "created_time": "March 18, 2023, 08:33:26 AM",
      "body": "Thanks for the feedback.I've updated electricity cost to $0.04/kW h and RIO to 730 days. It made value $20K less, but still above the price.Daily fluctuation happens because for the difficulty change, formula uses last 6 months, which is not fixed amount of periods to take into account (It may be 12,13,14).I may need to adjust formula to take fixed amount of periods to prevent those fluctuations.Value&Premium in your terms is something different from Graham/Warren's Value Investing.Also my idea not to calculate some figure to tell miners it's attractive or not to invest in mining, but to tell what's the current difference in production costs to current market price (as for commodity), which may be used a signal to buy/sell.Quote from: franky1 on March 17, 2023, 01:01:42 AMvalue is below market. premium is above market it appears your numbers for 2022-23 are average not valueyour formulae numbers are subjective8 cent electric of a 12 month ROIhmmmy numbers are from efficient asic farming mining in low electric of $18k for this fortnights mining rateto an inefficient asic hobby mining in high electric of $118k for this fortnights mining ratewhich is an average of ~$68kvalue: 18kaverage: 68kpremium: 118kas for your numbers for 2018.. that is way above premium for that period even for high electric regionsmy math is based on a 2 year ROIbecause industrial mining farms buy hardware that lasts 2 years and electric contracts that are bought for upto 2 years so the number of coins earned over a 2 year period become the math. and industrial electric is cheaper then $0.08 at $0.04 and the hobbiest is electric is more then $0.08 at upto $0.48..that said you have a good bases of looking beyond the markets for underling value. but your math is a lil out, compared to rational expectations of what real mining farms doand another hint. the math you show saying how you are using 1 year measures of coins earned. and then 6 months and then fortnightly difficulty changes.. yet your charts changes daily so your not exactly sticking to the difficulty steps of one change a fortnight. using average hashrate of that fortnightmost miners dont account for costs on the daily. they take the monthly costs or the 2 yearly costs and compare it to coins earned over those averages",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 18, 2023, 11:00:38 AM",
      "body": "Quote from: SylasDarkmoon on March 18, 2023, 08:33:26 AMThanks for the feedback.I've updated electricity cost to $0.04/kW h and RIO to 730 days. It made value $20K less, but still above the price.Daily fluctuation happens because for the difficulty change, formula uses last 6 months, which is not fixed amount of periods to take into account (It may be 12,13,14).I may need to adjust formula to take fixed amount of periods to prevent those fluctuations.Value&Premium in your terms is something different from Graham/Warren's Value Investing.Also my idea not to calculate some figure to tell miners it's attractive or not to invest in mining, but to tell what's the current difference in production costs to current market price (as for commodity), which may be used a signal to buy/sell.you are also not using the most efficient asic for your hardware cost measure, if the value you now measure is still higher then current priceif you are wanting a average of the world cost. then take the bottom efficient as value.. and then use 48 cents for the most expensive measure.. then do the middle of themhowever if you are looking for VALUE then thats the bottomthere is nothing wrong with having more then one metric. as long as you explain the methodology that matches the terminologyyou could also do region specific measure.. EG 4 cents is for the slavic/asian areathe 8cents is the industrial rate of mainland america. 35cent for UK48cent is for hawaii/japan",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SylasDarkmoon",
      "created_time": "March 18, 2023, 11:05:29 AM",
      "body": "Quote from: franky1 on March 18, 2023, 11:00:38 AMQuote from: SylasDarkmoon on March 18, 2023, 08:33:26 AMThanks for the feedback.I've updated electricity cost to $0.04/kW h and RIO to 730 days. It made value $20K less, but still above the price.Daily fluctuation happens because for the difficulty change, formula uses last 6 months, which is not fixed amount of periods to take into account (It may be 12,13,14).I may need to adjust formula to take fixed amount of periods to prevent those fluctuations.Value&Premium in your terms is something different from Graham/Warren's Value Investing.Also my idea not to calculate some figure to tell miners it's attractive or not to invest in mining, but to tell what's the current difference in production costs to current market price (as for commodity), which may be used a signal to buy/sell.you are also not using the most efficient asic for your hardware cost measure if the value you now measure is still higher then current priceif you are wanting a average of the world cost. then take the bottom efficient as value.. and then use 48 cents for the most expensive measure.. then do the middle of themhowever if you are looking for VALUE then thats the bottomthere is nothing wrong with having more then one metric. as long as you explain the methodology that matches the terminologyAntMiner S19   3230   95000000000000   3/1/2020Isn't this most efficient miner on the market?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 18, 2023, 11:07:45 AMLast edit: March 18, 2023, 11:22:03 AM by franky1",
      "body": "nope its notyour chosen asics19Specifications    95T 3250WPrice/Unit    $3,230is worse than thiss19 pro+hydSpecifications    191T 5252.5W Price/Unit    $3,629its a more recent 2022 generation of the s19 rangeheck there is even a s19proSpecifications    100T 2950W Price/Unit    $1,950which is lower in unit cost and offers more hash per kwhmathyour chosen s19 = $34/thash and 34watt per thashs19 pro+hyd = $19/thash and 27watt per thash   <- best cost efficients19pro = $19.50/thash and 29.5watt per thash",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SylasDarkmoon",
      "created_time": "March 18, 2023, 11:14:54 AM",
      "body": "Quote from: franky1 on March 18, 2023, 11:07:45 AMnope its not190thash for 5.2kwwhich in comparison would be like 2.6kw at 95thash(~20% more electric efficiency)its a more recent 2022 generation of the s19 rangeThanks, added AntMiner S19 XP since 12/01/2022, now Fair Value is $4K less.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 18, 2023, 11:24:17 AM",
      "body": "the XP is a $6k unit with a 46 price per thash ratingi just showed one that is half the price per thash.. .. why are you using inefficient metrics/measures if you are trying to claim \"value\".. i still dont get your methodology",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SylasDarkmoon",
      "created_time": "March 18, 2023, 11:36:15 AMLast edit: March 18, 2023, 11:50:28 AM by SylasDarkmoon",
      "body": "Quote from: franky1 on March 18, 2023, 11:24:17 AMthe XP is a $6k unit with a 46 price per thash ratingi just showed one that is half the price per thash.. .. why are you using inefficient metrics/measures if you are trying to claim \"value\".. i still dont get your methodologyYou're right, updated to Pro+ Hyd.UPD: Fair value got pretty close to market price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}