{
  "id": "topic_5447539",
  "title": "JamesBorn",
  "author": "JamesBorn",
  "created_time": "April 04, 2023, 11:35:55 AM",
  "content": "Costa Rica is trading on eggs market with bitcoin. The government of Costa Rica advise citizens to increase sales of eggs for nutrients and exchange of bitcoin should be allow to increase it demands in the country. This is good news despite the situation of bitcoin some country still believes in it and wish it to spread viral. If integration of nations can advance the value of bitcoin like Costa Rica, we can build a stronger economy",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447539",
  "comments": [
    {
      "author": "MeCsc",
      "created_time": "April 04, 2023, 11:53:49 AM",
      "body": "Soon South America will have highest number of countries legalising Bitcoin. El Salvador started it, Guatemala, Paraguay, Brazil, Costa Rica and others are moving well towards it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "April 04, 2023, 12:00:26 PM",
      "body": "Quote from: JamesBorn on April 04, 2023, 11:35:55 AMThis is good news despite the situation of bitcoin some country still believes in it and wish it to spread viral. If integration of nations can advance the value of bitcoin like Costa Rica, we can build a stronger economyYes it is a good news, but can you provide the link about this that we can read? I want to read more about it.Quote from: MeCsc on April 04, 2023, 11:53:49 AMSoon South America will have highest number of countries legalising Bitcoin. El Salvador started it, Guatemala, Paraguay, Brazil, Costa Rica and others are moving well towards itEl Salvador is in North America, not South America. Some countries only legalized bitcoin for it to become a taxable asset, I prefer to be in a country that do not completely ban it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 04, 2023, 12:27:03 PM",
      "body": "Quote from: _act_ on April 04, 2023, 12:00:26 PMYes it is a good news, but can you provide the link about this that we can read? I want to read more about it.The story is quite interesting, and if you were as curious as I was to have made a search, then you will discover there is no headline of such. I'm just curious where he got this information.OPs, please add more information about this headline to your thread or a link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "April 04, 2023, 12:29:14 PM",
      "body": "Quote from: JamesBorn on April 04, 2023, 11:35:55 AMCosta Rica is trading on eggs market with bitcoin. The government of Costa Rica advise citizens to increase sales of eggs for nutrients and exchange of bitcoin should be allow to increase it demands in the country. This is good news despite the situation of bitcoin some country still believes in it and wish it to spread viral. If integration of nations can advance the value of bitcoin like Costa Rica, we can build a stronger economyFor a few moments I thought about Easter eggs! But I didn't understand the connection between eggs and bitcoins: from what I understand it is a suggestion to increase subsistence agriculture, in which I doubt innovative currencies such as bitcoins will have space. Could you post the news?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "April 04, 2023, 12:30:08 PM",
      "body": "I saw a similar video tweet from Bitcoin Magazine on Twitter earlier today. https://mobile.twitter.com/BitcoinMagazine/status/1643012333235580928/mediaViewer?currentTweet=1643012333235580928&currentTweetUser=BitcoinMagazine Costa Rica is a Bitcoin-friendly nation; the country already has about five or more Bitcoin ATMs that are publicly accessible. They have been revolving around in a few ways trying to promote and adopt the Bitcoin currency in their possible ways, which I find interesting, and I think it will really be of great interest if they can allow that going with a bigger move like trying to impose the use of the currency on the people or using any means to regulate it within their jurisdiction, which will give them a way to tax all Bitcoin-related purchases in the country. Just as @_act_ said, it's really better for one to stay in an environment where its citizens are crypto-friendly but the government is neither against nor for crypto. That will really pave the way for freedom from tax law and other monitoring policies that might be incurred from that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "April 04, 2023, 12:37:45 PM",
      "body": "Quote from: JamesBorn on April 04, 2023, 11:35:55 AMCosta Rica is trading on eggs market with bitcoin. The government of Costa Rica advise citizens to increase sales of eggs for nutrients and exchange of bitcoin should be allow to increase it demands in the country. This is good news despite the situation of bitcoin some country still believes in it and wish it to spread viral. If integration of nations can advance the value of bitcoin like Costa Rica, we can build a stronger economyOP, everyone wants to get a link to the news so they can verify its authenticity. Such information about the global acceptance of bitcoin is extremely important and valuable to share. If the Costa Rican government wants to improve the use of bitcoin in the country through agriculture, it is a welcome and appreciable step, even if it is only through one sector of the country's economy. Having such acceptance gradually increases the likelihood of its global adoption occurring soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fathafraink",
      "created_time": "April 04, 2023, 12:43:50 PM",
      "body": "Quote from: MeCsc on April 04, 2023, 11:53:49 AMSoon South America will have highest number of countries legalising Bitcoin. El Salvador started it, Guatemala, Paraguay, Brazil, Costa Rica and others are moving well towards itEl Salvador isn't south american country, it's central american country region in north america, same as Costa Rica, so, they're not south american countries. But, well, hopefully we will see a high adoption of Bitcoin on the continent.Quote from: _act_ on April 04, 2023, 12:00:26 PMYes it is a good news, but can you provide the link about this that we can read? I want to read more about it.These are the sources:9Gag - https://9gag.com/gag/abvALWOYoutube - https://www.youtube.com/watch?v=_1QoHM9qLnkTwitter - https://twitter.com/BitcoinMagazine/status/1643012333235580928Twitter - https://twitter.com/BitcoinNewsCom/status/1630906674411126784It is a video that is on the Internet about a grandmother who accepts Bitcoin payments from someone who buys her eggs. Legally, Costa Rica has not made Bitcoin as legal tender there.[1] And maybe the grandma will get in trouble for accepting payments other than CRC (Costa Rica Colon).Reference:[1] https://en.wikipedia.org/wiki/Legality_of_cryptocurrency_by_country_or_territory",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 04, 2023, 01:03:47 PMLast edit: April 04, 2023, 02:19:55 PM by stompix",
      "body": "Quote from: JamesBorn on April 04, 2023, 11:35:55 AMThe government of Costa Rica advise citizens to increase sales of eggs for nutrients and exchange of bitcoin should be allow to increase it demands in the country. Bull*****This kind of clickbait fake headlines are destroying everything nice about what should be normal good news is making people not trust a thing anymore.It's one person in a market that has decided to accept bitcoin for her products.The government has nothing to do with it, there is no such government proposal, and how the hell would even be possible for the government to ask citizens to sell eggs for bitcoins? What would the benefit be in this since from their point of view since it's simple coins changing hands without taxation?This is one perfect example of LN doing its thing, despite all the fearmongering about mempool full, attacks, fees more expensive than a cup of coffee and it's great that we see it in practice but to go fully nutcase and think the government is demanding BTC for its citizens balls eggs is just nonsense.Quote from: _act_ on April 04, 2023, 12:00:26 PMQuote from: MeCsc on April 04, 2023, 11:53:49 AMSoon South America will have highest number of countries legalising Bitcoin. El Salvador started it, Guatemala, Paraguay, Brazil, Costa Rica and others are moving well towards itEl Salvador is in North America, not South America. Some countries only legalized bitcoin for it to become a taxable asset, I prefer to be in a country that do not completely ban it.So are Costa Rica and Guatemala, with just 12 countries on the continent it will be a wonder for South America to lead the pack in a number of counties legalizing Bitcoin but don't expect people to dwell that much on the subject, if the name sounds exotic then it must be somewhere in the Amazon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "April 04, 2023, 01:40:45 PM",
      "body": "Quote from: JamesBorn on April 04, 2023, 11:35:55 AMCosta Rica is trading on eggs market with bitcoin. The government of Costa Rica advise citizens to increase sales of eggs for nutrients and exchange of bitcoin should be allow to increase it demands in the country. It would have been more appropriate if you'd inserted the link to this nee development, this is actually going to be interesting because in doing so, the government also encourages using bitcoin for payment or as an exchange goods and services, and with this recent endorsement, we may conclude on adding Costa Rica among the list of countries where bitcoin is likely to be adopted this year base on this.Quote from: JamesBorn on April 04, 2023, 11:35:55 AMThis is good news despite the situation of bitcoin some country still believes in it and wish it to spread viralThere's no any bad situation attributed to the adoption of bitcoin, it has always been a preferred currency despite the challenges of different attacks as opposition against the decentralized network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Easteregg69",
      "created_time": "April 04, 2023, 01:48:34 PM",
      "body": "You can't eat your wallet can you? I admire your trading skills.Coming from a master trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Easteregg69",
      "created_time": "April 04, 2023, 01:48:54 PM",
      "body": "Admins and mods love me.Edit: The Avatar is a bread mixer and baker machine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "April 04, 2023, 02:01:50 PM",
      "body": "Quote from: JamesBornCosta Rica is trading on eggs market with bitcoin. The government of Costa Rica advise citizens to increase sales of eggs for nutrients and exchange of bitcoin should be allow to increase it demands in the country. This is good news despite the situation of bitcoin some country still believes in it and wish it to spread viral. If integration of nations can advance the value of bitcoin like Costa Rica, we can build a stronger economyI guess, other countries will like to follow the step of Costa Rica government to increase their economy too because, many countries that see BTC as a scam currency based on what they heard till they Carry out their personal research to discovered that BTC can do a lot of good things to the citizens. In five years time, I believe the citizens of Costa Rica will be doing massively well like citizens of El Salvador because, they are the first country that made BTC legal tender to help their citizens to grow their businesses.With time BTC will dominate global for other countries that banned BTC to unbanned it so that they will be free from this high inflation that is affecting many countries economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "April 04, 2023, 02:12:35 PM",
      "body": "Though might not happen soon, but my prediction is that bitcoin will sooner or later become the number one and the biggest internet money, it will become the number one means through which individuals can buy and sell, transact, send and receive money through the internet..Fiat might still be in use, especially for those who might not possess the level of knowledge needed to transact in bitcoin successfully, and also for those who might be making smaller payments like in cents or lesser, but in all, bitcoin will become a major means of sending and receiving, paying for goods and services through the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "April 04, 2023, 02:21:18 PM",
      "body": "I’m not really sure about the subject matter of this thread being eggs, but there is no doubt that facilitating trade in bitcoin opens new doors for merchants. It’s great to read that Costa Rica is becoming a place where Bitcoin trade is being normalized and I think as time goes on we’ll continue to see more adoption not just in small countries like Costa Rica, but also larger nations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "April 04, 2023, 02:26:40 PM",
      "body": "Quote from: JamesBorn on April 04, 2023, 11:35:55 AMCosta Rica is trading on eggs market with bitcoin. The government of Costa Rica advise citizens to increase sales of eggs for nutrients and exchange of bitcoin should be allow to increase it demands in the country. This is good news despite the situation of bitcoin some country still believes in it and wish it to spread viral. If integration of nations can advance the value of bitcoin like Costa Rica, we can build a stronger economyDo you mean eggs from a poultry farm? and the payment for the egg is bitcoin? is that right? If this is how the trade is happening in Costa Rica, this is another good development for bitcoin and another edge for bitcoin enthusiasts too of course.    It also means that bulk or bulk eggs are also ordered, so it's okay if you pay bitcoin to this egg seller. It's the first time I've heard this, and I haven't even read it in any article here in the crypto industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "April 04, 2023, 02:30:27 PM",
      "body": "Quote from: OgNasty on April 04, 2023, 02:21:18 PMI’m not really sure about the subject matter of this thread being eggs, but there is no doubt that facilitating trade in bitcoin opens new doors for merchants. It’s great to read that Costa Rica is becoming a place where Bitcoin trade is being normalized and I think as time goes on we’ll continue to see more adoption not just in small countries like Costa Rica, but also larger nations. I already thought about it that is the subject matter yhe egg we know about but when the topic creator said about increasing nutrients among the citizens of the country, I then believe that it is eggs that he actually mean. But how will they trade a physical products with bitcoin or is any code written to represent the eggs on the blockchain where it is traded and exchange or any other platform? Or is it simply paying for egg with bitcoin?I would also want to need a link to read more about this topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fadhilz123",
      "created_time": "April 04, 2023, 02:38:16 PM",
      "body": "Quote from: JamesBorn on April 04, 2023, 11:35:55 AMCosta Rica is trading on eggs market with bitcoin. The government of Costa Rica advise citizens to increase sales of eggs for nutrients and exchange of bitcoin should be allow to increase it demands in the country. This is good news despite the situation of bitcoin some country still believes in it and wish it to spread viral. If integration of nations can advance the value of bitcoin like Costa Rica, we can build a stronger economyThat is very good news for Bitcoin, but why don't you provide a little resource here so people can read it in plain view? Because I was just researching this and I found a bit of news related to what you're saying here on news.bitcoin.com where it's explained that Costa Rica May Be The Next Country To Designate Bitcoin As A Regulated Currency. However, I did not find any egg traders who have accepted Bitcoin as payment on the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "April 04, 2023, 02:48:57 PM",
      "body": "I think the topic of the op  is totally different from what is on the source of information as provided by@ fathafraink, am still trying to see where Costa Rica is mentioned as a country using bitcoin to make transactions in the egg market rather it's a clear picture of a grandmother accepting bitcoin in her egg business that is an individual thing not the Costa Rica as a Country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "April 04, 2023, 03:25:05 PM",
      "body": "news regarding Costa Rica introducing Bitcoin as legal tender dates back to the end of last year. it looks like the Costa Rica government is really serious about developing an update to the Bitcoin payment system in their country. they have studied a lot of existing problems, and it is hoped that the use of Bitcoin will attract many larger transactions in certain productive trade sectors of Costa Rica. this is a form of effort to strengthen their economy. the government of Costa Rica has good and forward-thinking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}