{
  "id": "topic_5415421",
  "title": "VaporumCoin",
  "author": "VaporumCoin",
  "created_time": "September 29, 2022, 10:43:59 PMLast edit: October 10, 2022, 01:08:34 PM by VaporumCoin",
  "content": "https://i.imgur.com/DJYu6pj.pngVaporum Coin (VPRM)PurposeVaporum Coin is an open-source, privacy currency that allows for UTXO smart contracts, dApps, Fungible and Non Fungible (NFT) tokens, 50/50 hybrid POW/POS with fast transactions. Its purpose is to bring the latest blockchain technology along with some common sense implementations to Peer-to-Peer transactions. Built on the Komodo platform, along with our in house developers we are working to implement many great ideas!September 29, 2022 Launch DateTech Specifications•   Max Supply: 500,000,000 VPRM•   Block Time: 30 seconds•   Block Reward: 50 VPRM (6 eras)•   Block Generation: 50% PoW | 50% PoS•   NO Premine, NO Developer fees•   Mining Algorithm: Equihash (200,9)•   RPC Port: 51609•   P2P Port: 51608ResourcesWebsitehttps://www.vaporumcoin.us/Block Explorer (additional explorers coming)http://explorer.vaporumcoin.us/Mining Poolhttp://www.vaporumpool.us/CommunityTwitter: www.twitter.com@VaporumCoinGithub: VaporumCoin (github.com)Discord:https://discord.gg/cvTwzbCyExchangesAtomicDex (coming soon) Additional exchanges to be announced!Question and AnswersWhy Komodo platform blockchain: Komodo platform is always evolving, from DPoW to smart contracts and NFT’s. The future development and inovation on the platform will be a springboard for future Vaporum Coin in-house technologies.Why Equihash (200,9): Solid, secure algorithm with a track record and great privacy. This will allow newcomers to mining with no knowledge of how to setup mining farms, or special rigs a chance to purchase older ASIC equiment and be part of a community. What is “Vaporum”: Vaporum ref’s Mare Vaporum “Sea of Vapors” a dark plain in the first quadrant and near the center of the face of the moon. In the top right of the mare is the crater of Manilius. For eternity mankind has looked up at the moon, focused on this bright spot, and wondered what the future will bring. DevelopmentSee website for developing roadmap, but in the works we have custom QT wallets, Atomic Dex, modern pool development, exchange listings, mobile wallets, message app, etc…..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415421",
  "comments": [
    {
      "author": "VaporumCoin",
      "created_time": "September 29, 2022, 10:54:24 PM",
      "body": "Reserved **",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FlaJa",
      "created_time": "September 30, 2022, 01:06:00 AM",
      "body": "no wallet to download and 11 miner are mining. Fair???",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VaporumCoin",
      "created_time": "September 30, 2022, 01:46:15 AM",
      "body": "Quote from: FlaJa on September 30, 2022, 01:06:00 AMno wallet to download and 11 miner are mining. Fair??? Pre-Beta wallets are posted on github, this is a fair launch. Miners at pool are all new miners and they all have wallets from same source. Many options to obtain wallets. There was no pre announcement for this coin, no premine, and zero dev fees. Cant get any more fair then that!Please visit the github link for wallet instructions. New wallets will be released in the coming days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VaporumCoin",
      "created_time": "September 30, 2022, 02:09:58 AM",
      "body": "2.5Msols at 2k block mark....WOW off to a great start. Glad to see the miners coming out to play. Make sure you grab those staking blocks as well, we are a 50/50 distribution coin. Exciting things are in development!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jiang2897",
      "created_time": "September 30, 2022, 09:21:40 AMLast edit: October 01, 2022, 12:52:00 AM by jiang2897",
      "body": "Chinese Course:https://youtu.be/TcMdL0CJjpADonation:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VaporumCoin",
      "created_time": "September 30, 2022, 01:35:12 PM",
      "body": "Quote from: jiang2897 on September 30, 2022, 09:21:40 AMChinese Course:https://youtu.be/rn86NnWqhg0Donation:vLXJc8Y5TStkLtHSR5VJNEyrcmXdi2SkJoThis project is not associated with us. We are a USA based project. Unfortunate the name is so close.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vladimir_P",
      "created_time": "September 30, 2022, 03:19:15 PM",
      "body": "Pow is working. And how to connect to POS?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VaporumCoin",
      "created_time": "September 30, 2022, 04:09:47 PM",
      "body": "Quote from: Vladimir_P on September 30, 2022, 03:19:15 PMPow is working. And how to connect to POS?if using qt wallet simply set in console setgenerate true 0if it returns{  \"staking\": true,  \"generate\": false,  \"numthreads\": 0}you are now staking. Wallet must remain open to stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vladimir_P",
      "created_time": "September 30, 2022, 04:25:16 PM",
      "body": "I use a QT beta wallet with Github.I don't understand how and where to write commands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VaporumCoin",
      "created_time": "September 30, 2022, 04:36:00 PM",
      "body": "Quote from: Vladimir_P on September 30, 2022, 04:25:16 PMI use a QT beta wallet with Github.I don't understand how and where to write commands.got to help>>debug>>consoletype above into console",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "r_victory",
      "created_time": "September 30, 2022, 06:28:11 PM",
      "body": "It’s nice to see projects that go beyond more “traditional” blockchains and platforms to bring your coins and tokens to life. There are ecosystems with great capabilities and resources available on the market, and Komodo is one of them. Good choice!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elkalioby",
      "created_time": "October 01, 2022, 12:01:35 AM",
      "body": "coin without a website, without a wallet, why launch?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vladimir_P",
      "created_time": "October 01, 2022, 04:39:59 AM",
      "body": "I do as you say - it turns out an invalid syntax error. Can you make an instruction with a picture on setting up staking and post it here or on the website, pool, github?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vladimir_P",
      "created_time": "October 01, 2022, 04:57:09 AM",
      "body": "the workers switched off. pool is not available.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vladimir_P",
      "created_time": "October 01, 2022, 01:28:56 PM",
      "body": "The network is working, but the coins earned before that have disappeared. Will they solve this problem somehow?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "r_victory",
      "created_time": "October 01, 2022, 03:39:47 PM",
      "body": "Quote from: elkalioby on October 01, 2022, 12:01:35 AMcoin without a website, without a wallet, why launch? According to the OP, the wallet is available on Github, the link is https://github.com/VaporumCoin.I tried to access explorer today to see transactions and it's not working.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Andrius_11G",
      "created_time": "October 02, 2022, 12:31:35 PM",
      "body": "Quote from: VaporumCoin on September 30, 2022, 04:09:47 PMQuote from: Vladimir_P on September 30, 2022, 03:19:15 PMPow is working. And how to connect to POS?if using qt wallet simply set in console setgenerate true 0if it returns{  \"staking\": true,  \"generate\": false,  \"numthreads\": 0}you are now staking. Wallet must remain open to stake.Stake With vaporumcoindWith vaporumcoind the commands will need to be used with vaporumcoin-cli.For staking to work the wallet needs to be unlocked. If you encrypted your wallet you will need to unlock it with the command walletpassphrase.Example: vaporumcoin-cli walletpassphrase \"your passphrase\" 36003600 is the time in seconds the wallet will stay unlocked before locking again. This means you will need to unlock it again after this specified amount of time to continue staking.The wallet must stay open and online to be able to stake.Instructions1.    Run vaporumcoind and let the blockchain fully sync.2.    Send coins to your wallet if you do not have any in your wallet already.3.    Run vaporumcoin-cli setgenerate true 0.You can check to make sure you are staking with vaporumcoin-cli getgenerate1.    Navigate to vaporumcoin-cli or Console depending on your wallet.2.    Enter the command getgenerate.It will return:{  \"staking\": true,  \"generate\": false,  \"numthreads\": 0}If you see \"staking\": true, then you are staking!If you see \"staking\": false, then you are not staking. Enable staking by entering the command setgenerate true 0. Stake With Vaporumcoin-QTWith Vaporumcoin-QT the commands will need to be entered in the console. This is accessible at Help -> Debug Window -> Console.For staking to work the wallet needs to be unlocked. If you encrypted your wallet you will need to unlock it with the command walletpassphrase.Example: walletpassphrase \"your passphrase\" 36003600is the time in seconds the wallet will stay unlocked before locking again. This means you will need to unlock it again after this specified amount of time to continue staking.The wallet must stay open and online to be able to stake.Instructions1.    Enter your vaporumcoin-qt folder.2.    Run vaporumcoin-qt and let the blockchain fully sync.3.    Send coins to your wallet if you do not have any in your wallet already.4.    Navigate to the Console.5.    Enter the command setgenerate true 0.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VaporumCoin",
      "created_time": "October 02, 2022, 01:27:13 PM",
      "body": "Quote from: elkalioby on October 01, 2022, 12:01:35 AMcoin without a website, without a wallet, why launch? The moment the pool was up for testing someone jumped on and started mining. In order to keep it a fair launch we announced. we needed to quickly put a wallet together and get underway. Today people are poised, used to be all you got at launch was the daemon.That said beta wallets are coming real soon that will replace the current one. Website will be posted and we will be underway as we had planned to be. We apologize to the community, but we wanted this to be a fair launch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VaporumCoin",
      "created_time": "October 02, 2022, 01:33:34 PM",
      "body": "Quote from: Vladimir_P on October 01, 2022, 04:57:09 AMthe workers switched off. pool is not available.pool was dealing with over 15 miners using wrong algo, creating a huge amount of traffic and garbage collection that needed to be delt with. Pool was restarted multi times because we had no other choice to dump the garbage data. Seems to have leveled off now and the algo thing the community has sorted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}