{
  "id": "topic_5415822",
  "title": "Hispo",
  "author": "Hispo",
  "created_time": "October 03, 2022, 07:09:39 PM",
  "content": "Good afternoon.I would like to know your opinion about this: the other night I found a YT channel where a guy bought a box of Yu-Gi-Oh cards, this box was of the first set released back in early 2000's called \"Legend of Blue Eyes White Dragon\". https://youtu.be/3_yCLmm2qOwThe exotic part of this video is the fact these boxes are sold for over 25,000$ and only one pack of the box can be worth about 1000$. You can some examples here: www.ebay.com/itm/115470621070www.ebay.com/itm/115505412383This guy bought and proceed to (painfully) open each of the packs inside the box, because there are chances to find cards worth thousands of dollars themselves:www.ebay.com/itm/334566973621www.ebay.com/itm/284845253155www.ebay.com/itm/165705601129www.ebay.com/itm/274989636523Do you consider doing this a form of gambling?Would you dare to do the same thing for the sake of earning money or do you think it would be a bad idea?I personally think it would be a bad idea since the chances of pulling out a good card is fairly small, one needs to really like the game/cards in order to open an unsealed box of such value.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415822",
  "comments": [
    {
      "author": "Jemzx00",
      "created_time": "October 03, 2022, 07:24:39 PM",
      "body": "Quote from: Hispo on October 03, 2022, 07:09:39 PMDo you consider doing this a form of gambling?Would you dare to do the same thing for the sake of earning money or do you think it would be a bad idea?I personally think it would be a bad idea since the chances of pulling out a good card is fairly small, one needs to really like the game/cards in order to open an unsealed box of such value.This is just the same on Pokémon cards opening where as each card set has a rare card inside that have a value of thousands however I won't classify it as Gambling per sé. I would rather lean more on Investment on assets as the value of each card either depreciate or appreciate on the card's rarity, condition and other qualities it has. But it still depends on each individual on how they'll see it just like Gacha games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boristhecat",
      "created_time": "October 03, 2022, 07:53:55 PM",
      "body": "Quote from: Hispo on October 03, 2022, 07:09:39 PMGood afternoon.I would like to know your opinion about this: the other night I found a YT channel where a guy bought a box of Yu-Gi-Oh cards, this box was of the first set released back in early 2000's called \"Legend of Blue Eyes White Dragon\". -skip-In fact, this is no different from loot boxes, and in many countries they are recognized as a form of gambling. I see no reason why these collectibles/boxes cannot be considered gambling.Probably, people still doubt whether it is right to consider such collecting mechanics as gambling only because of the strength of traditions. It used to be considered normal to buy such magic boxes with an indeterminate value, but now all this is relegated to gambling.I wonder when consumer extremism (sometimes it really takes inadequate forms) will make people consider fortune cookies and all that to be gambling? Hahaha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "October 03, 2022, 08:10:23 PM",
      "body": "I don't think it is called gambling because in gambling you enter to win more money and not to find rare items of a certain game.This can be compared more to spoiled children who use their mom or dad credit card to buy all the level up items of a character in their favorite RPG/Action game,it sure resembles more to this and to people playing online games fighting each other each spending a lot of money to fine tune their character.This for me is not gambling as gambling is continuous while these people once they get what they want they stop rather than finding a new game.Sure it has some elements of gambling which is spending money to entertain yourself which is every gambler's excuse to gambling but only this and nothing more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 03, 2022, 08:18:16 PM",
      "body": "Collectibles and collections are more in investments rather than gambling. Collecting doens't fall to any kind of gambling category where people bet and gain after a win from a certain events or sports.Since it was bought in 2000's the value of it for today is already too high considering there still a market for it which really falls in investment idea of \"buy low sell high\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "molsewid",
      "created_time": "October 03, 2022, 08:35:10 PM",
      "body": "Quote from: PX-Z on October 03, 2022, 08:18:16 PMCollectibles and collections are more in investments rather than gambling. Collecting doens't fall to any kind of gambling category where people bet and gain after a win from a certain events or sports.Since it was bought in 2000's the value of it for today is already too high considering there still a market for it which really falls in investment idea of \"buy low sell high\".Yes, maybe we can consider it as an investment, some of the collectibles collections are rare, people with collections collect item based on their preferences, it is not related to gambling, it is more of investment. And yes if it is bought last 2000 it is better to see or to research how much it will be cost now before opening, so that we can preserve the value of it. Collections needed more money since it is expensive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "October 03, 2022, 08:39:40 PM",
      "body": "Quote from: Jemzx00 on October 03, 2022, 07:24:39 PMQuote from: Hispo on October 03, 2022, 07:09:39 PMDo you consider doing this a form of gambling?Would you dare to do the same thing for the sake of earning money or do you think it would be a bad idea?I personally think it would be a bad idea since the chances of pulling out a good card is fairly small, one needs to really like the game/cards in order to open an unsealed box of such value.This is just the same on Pokémon cards opening where as each card set has a rare card inside that have a value of thousands however I won't classify it as Gambling per sé. I would rather lean more on Investment on assets as the value of each card either depreciate or appreciate on the card's rarity, condition and other qualities it has. But it still depends on each individual on how they'll see it just like Gacha games.I agree, just like what others collectibles cards in the past, you will have to spend some money but in return you will find some rare card inside that can be worth on what you originally pay for it. But it won't be classify as gambling as the card itself is already collectibles and you can trade it to someone. As opposed to gambling wherein you already lost your money already once you start to put your bet unless you're lucky and win. And then others will hold for this card in hope that one day the value will be worth more, you can't find that on gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "October 03, 2022, 08:58:27 PM",
      "body": "These are collectibles and some consider this as gambling since you can’t know if there’s a value for that or none at all but to collector they consider this as their investments since they believe that it has a value and other collectors might be interested to get that collectibles. We might consider this as inactive gambling since you are buying things with a hope that you might get precious item which we can also consider you depend on your luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 03, 2022, 09:03:21 PM",
      "body": "Quote from: Hispo on October 03, 2022, 07:09:39 PMDo you consider doing this a form of gambling?Would you dare to do the same thing for the sake of earning money or do you think it would be a bad idea?I personally think it would be a bad idea since the chances of pulling out a good card is fairly small, one needs to really like the game/cards in order to open an unsealed box of such value.This is where gambling and gaming become similar they invest or bet on something on gambling you bet on your favorite players or teams to win or bet on dice and other games, on gaming you bought something that will add value to your character in the hope that it will have edge over the other players and eventually win in this case he bought cards for a chance to find cards worth thousands of dollars, the saying and the advice only invest what you can afford to lose applies so I consider this gambling, there's not much difference after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "October 03, 2022, 09:08:06 PM",
      "body": "Quote from: Boristhecat on October 03, 2022, 07:53:55 PMQuote from: Hispo on October 03, 2022, 07:09:39 PMGood afternoon.I would like to know your opinion about this: the other night I found a YT channel where a guy bought a box of Yu-Gi-Oh cards, this box was of the first set released back in early 2000's called \"Legend of Blue Eyes White Dragon\". -skip-In fact, this is no different from loot boxes, and in many countries they are recognized as a form of gambling. Indeed it is the same as loot boxes but I do not think that the government considered that gambling.  I believe it has something to do about trading cards where rarer cards are getting more expensive.  The value of the cards depends on the demand, as far as I know, value of cards changes from time to time.  It is more like NFT loot boxes if we compare it to today's technological trend.Quote from: Boristhecat on October 03, 2022, 07:53:55 PMI see no reason why these collectibles/boxes cannot be considered gambling.The main reason is that people spend money and got an item in return, a person spending money doesn't lose anything.  That is the main concept of loot boxes that separate them from gambling.We may have a different point of view but the point here is the buyer doesn't lose money and have an item that is agreed upon purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "October 03, 2022, 09:08:34 PM",
      "body": "Well, looking at it from that point of view, I imagine this could look like a lottery, and the main prize in this case could be an extremely rare card.One of the differences is that in the lottery you will be able to choose the numbers you want to bet, unlike finding a rare card in a pack for example, in which you will have the chance to have found an extremely rare card or not.What you have to ask is... what is the possibility of you finding 1 extremely rare card in a card of pack? 1 in 1000? (0.1%) or 1 in 10000? (0.01%)Another interesting variable to analyze is the upside (of this possible bet)For example, making a simple buy/bet!1 pack of cards costs $100If I get an extremely rare card, like the one in the video ($40,000)I could make 39,900% profit!Regarding the lottery, let's assume the ticket will cost $10 and the jackpot is $100,000With this, we will have an appreciation/profit of ~999,900%PS: I quoted these numbers/values ​​only to clarify and perform some calculationsConclusion, I believe that both are similar types of bets, the main difference is that in the lottery you can bet on any number you want, unlike the cards.There is also a way for you to win the lottery, it would be necessary for you to bet on ALL possible numbers, even then it would not be worth it, because betting on all possible possibilities would be more expensive than the prize obtained in the lottery!Between \"losing\" money in the lottery or buying collectible cards, I would choose the cards, because if I don't get a rare card, I would still have the other cards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 03, 2022, 09:15:45 PM",
      "body": "Quote from: Hispo on October 03, 2022, 07:09:39 PMI personally think it would be a bad idea since the chances of pulling out a good card is fairly small...Very little chances of winning has never stopped or discouraged any serious gambler from gambling. And in this case, I will not really consider it gambling because of this Quote from: Hispo on October 03, 2022, 07:09:39 PMThis guy bought and proceed to (painfully) open each of the packs inside the box, because there are chances to find cards worth thousands of dollars themselvesalthough it has similarities with gambling but if you consider it, there is no potential estimate of what you can win like gambling that has estimates, but this just has the possibility of you winning without knowing what you will win even if you win.Some people will call it gambling, but i don't think it is in a proper and actual sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "October 03, 2022, 09:29:03 PM",
      "body": "Yes, it's a form of gambling, but then again, many things in life are a form of gambling. For example, we gamble every day when we get into a car or take a bus to get to work because there is a possibility of an accident on the road. However, we accept these risks because we know that the chances of this happening are very small. Personally, I would not do this if the chances of winning are very low. Instead, I might try to find a way to peek inside the package without opening it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "October 03, 2022, 09:30:41 PM",
      "body": "Quote from: Hispo on October 03, 2022, 07:09:39 PMGood afternoon.I would like to know your opinion about this: the other night I found a YT channel where a guy bought a box of Yu-Gi-Oh cards, this box was of the first set released back in early 2000's called \"Legend of Blue Eyes White Dragon\". The exotic part of this video is the fact these boxes are sold for over 25,000$ and only one pack of the box can be worth about 1000$. This guy bought and proceed to (painfully) open each of the packs inside the box, because there are chances to find cards worth thousands of dollars themselves:Do you consider doing this a form of gambling?Would you dare to do the same thing for the sake of earning money or do you think it would be a bad idea?I personally think it would be a bad idea since the chances of pulling out a good card is fairly small, one needs to really like the game/cards in order to open an unsealed box of such value.When you're buying/investing/betting something in the hope of gaining profit then you are gambling, gaming and gambling are very similar in so many ways both are a form of entertainment and you have to invest in both and your investment should be money that you can afford to lose, people who started as a gamer most of the times ended up as gambler, and if you've started as a player you'll have basic knowledge on how to play in a gambling site, so there's hardly any difference between the two.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "October 03, 2022, 09:42:04 PM",
      "body": "Nope that's not gambling but rather a hobby. Maybe there are scene that some of the collector open a pack then hoping to get a rare cards which have huge value but that doesn't mean we can categorize it as a gambling. People who are in this industry is just having fun since this create different vibes to them and for sure those collectors only can feel what they are into because for other people who don't understand what they are doing will just threat this as waste of money time and think about they are gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "October 03, 2022, 09:48:09 PM",
      "body": "Collectibles are not gambling despite of it’s risk since there’s no assurance about the value of the item you are collecting, there’s a lot of collector who love doing this not because they gamble but because they love to do it and they can afford to do that. Gambling is pure of luck while collectibles are not since you are buying with the things that is already have a value in the market, the risk is you can’t just sell it easily at a higher price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "October 03, 2022, 09:55:53 PM",
      "body": "Quote from: Hispo on October 03, 2022, 07:09:39 PMGood afternoon.I would like to know your opinion about this: the other night I found a YT channel where a guy bought a box of Yu-Gi-Oh cards, this box was of the first set released back in early 2000's called \"Legend of Blue Eyes White Dragon\". https://youtu.be/3_yCLmm2qOwThe exotic part of this video is the fact these boxes are sold for over 25,000$ and only one pack of the box can be worth about 1000$. You can some examples here: www.ebay.com/itm/115470621070www.ebay.com/itm/115505412383This guy bought and proceed to (painfully) open each of the packs inside the box, because there are chances to find cards worth thousands of dollars themselves:www.ebay.com/itm/334566973621www.ebay.com/itm/284845253155www.ebay.com/itm/165705601129www.ebay.com/itm/274989636523Do you consider doing this a form of gambling?Would you dare to do the same thing for the sake of earning money or do you think it would be a bad idea?I personally think it would be a bad idea since the chances of pulling out a good card is fairly small, one needs to really like the game/cards in order to open an unsealed box of such value.If you are buying purely for price appreciation then yes of course it is.  There is a chance it plummets or skyrockets.  It's just as much gambling as buying metals, stocks, anything that is bought for price appreciation.  It probably has a more limited downside than straight betting but it is still gambling with your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "October 03, 2022, 09:57:19 PM",
      "body": "That is a type of investment and I've seen that happening in some other known animes like Pokemon and a simple card collecting like the brand of cards that I've seen, bicycle. Quote from: Hispo on October 03, 2022, 07:09:39 PMDo you consider doing this a form of gambling?Would you dare to do the same thing for the sake of earning money or do you think it would be a bad idea?It isn't a type of gambling but there's risk that gambling has it too. I would like to do it and do it in some other forms and it's not a bad idea if you know what you're doing and understands the value of those.Quote from: Hispo on October 03, 2022, 07:09:39 PMI personally think it would be a bad idea since the chances of pulling out a good card is fairly small, one needs to really like the game/cards in order to open an unsealed box of such value.That's the risk and it's part of it but if an enthusiast or collector wants to have those badly, they'll just take it from someone who has the actual card/character that they're looking for and will just have to resell it with a higher price.Although, it's really costly if that's the thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "October 03, 2022, 09:57:35 PM",
      "body": "If buying boxes of collectible cards is gambling.Could going out in public without a mask, risking infection and illness might be considered gambling? Having sex without a condom also gambling? Eating day old fast food, gambling?An expansion of the term gambling could be applied to almost everything. Creating additional red tape and regulation. But would there be any tangible benefits to it?Purchasing boxes of (CCG) collectible card game packs is a straight buy. While some might hope to profit monetarily. The motive behind the purchase could also be for sentimental reasons or /other. Buying a box of CCG cards for sentimental reasons, wouldn't qualify as a gamble or speculation. The motive behind the purchase is relevant. There are games like Call of Duty (mobile) which have yet to ban loot boxes or regulate them as gambling afaik. It is possible that whatever movement there was to crackdown on things like lootboxes in video games has stalled and lost momentum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "October 03, 2022, 10:10:31 PM",
      "body": "I think it is in part, because you are banking on the possibility that any of these cards contain something of high value, kinda like the lottery which is more of a chance in getting a huge payout. Then again, if we go by that logic, a lot of things will be considered as gambling, as we always expect to net something positive on our choice to invest on something. Gambling by definition and in general covers a lot of things if we are pedantic about it, but others always beg to differ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}