{
  "id": "topic_5454813",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "June 02, 2023, 02:09:22 AM",
  "content": "Robert Kennedy Jr. has been making confident declarations about Bitcoin lately, endearing him to folks in the Bitcoin community. In a Twitter post he made on June 1st, \"Lightning opens up an exciting future with the guarantee of transactional freedom, which is as important as freedom of speech,\" in response to Samson Mow's tweet about the Lightning Network.Who is Robert Kennedy Jr(RFK Jr.)?RFK Jr. is a US Democratic Presidential Candidate. On March 3, 2023, Robert Kennedy Jr. declared his intention to run for president in 2024. In fact, the tweet he made was a response to Samson Mow's tweet on November 4th, 2021. I do not trust politicians. When they want to run for office, and they suddenly remember that they have to be in the good graces of the Bitcoin community. Suddenly he is all over the place tweeting and making speeches about Bitcoin and cryptocurrency.For those who can smell a rat, can you use your sixth sense to tell if this Democratic presidential candidate is a true Bitcoiner or a pseudo Bitcoin supporter?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454813",
  "comments": [
    {
      "author": "mk4",
      "created_time": "June 02, 2023, 03:14:03 AMLast edit: June 02, 2023, 04:11:08 AM by mk4",
      "body": "My take is just the fact that there are a lot of things to consider besides Bitcoin when choosing a presidential candidate; and after watching a few of his hour-long interviews, I'm (slightly) confident that he'd be a good pick.As for the Bitcoin-on-Twitter thing, it's probably more of marketing on his side despite him mostly having the libertarian view.He seems to be a very open-minded chap compared to his peers: https://www.youtube.com/watch?v=nA0OXZuaG0g",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "June 02, 2023, 03:32:53 AM",
      "body": "Quote from: alastantiger on June 02, 2023, 02:09:22 AMRobert Kennedy Jr. has been making confident declarations about Bitcoin lately, endearing him to folks in the Bitcoin community. For those who can smell a rat, can you use your sixth sense to tell if this Democratic presidential candidate is a true Bitcoiner or a pseudo Bitcoin supporter? It is politics-motivated statement and I believe he is not a true Bitcoiner or a Bitcoin maximalist.He can have love with Bitcoin, invest in Bitcoin but would be far from a Bitcoin Maximalist and his statement is more keen on politics than Bitcoin. He knows that there are majority of US. citizens invest in Bitcoin and cryptocurrency. If he can get votes from them, it will be helpful for this propaganda and President Election campaign. He does not have good political position in this race so he will try to use any possible channels to gain more supporters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "June 02, 2023, 03:42:46 AM",
      "body": "Politicians can't be trusted, of course. But, for me, a candidate taking sides is a lot better than one who prefers to stay neutral especially on certain timely issues like Bitcoin. I'm not sure if Robert Jr. even understands Bitcoin and its implications but at least he's aware of it and he stands with it. It means a lot. And while many think that this is just courting the Bitcoin community for potential votes, taking sides actually means gaining some and losing some. It has risks. He will probably lose the votes of Bitcoin critics. He'll probably lose potential donations coming from companies and rich elites who would have otherwise considered him but discouraged because of his stand on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sebas.tian",
      "created_time": "June 02, 2023, 03:45:34 AM",
      "body": "Based on his consistency speaking about Bitcoin and cryptocurrency, make me to believed that he will not play game with Bitcoiners supporters in this presidential campaign because there are many people in the country waiting to hear this speech from him before they will start following him on social media or anywhere which he did. I think, Robert Kennedy Jr is a bitcoiner and he will do everything possible to ensure he create a standard environment for the Bitcoiners in the US if he become the president, so that with time Bitcoin will become a legal tender in the country for the citizens to purchase goods and services and pay with Bitcoin at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 02, 2023, 03:48:59 AM",
      "body": "Nobody will know until he is elected and then we will see if he is pro Bitcoin or not. You need to understand that his campaign could of analyze voters and think they can buy more votes if he is pro Bitcoin and most candidates aren’t.A lot of people hold Bitcoin in the USA and the way the regulations are going now will make them want to vote for someone who will make sure it stays unbanned. So it’s a smart way to get people to start voting. However keep in mind that he might not even win the lead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "June 02, 2023, 03:50:44 AM",
      "body": "Well, in principle bitcoin fits more with a Republican ideology than a Democratic one but it does not preclude it. In this case from what I have seen it seems sincere, and I dream of the battle for the presidency being between DeSantis and Kennedy, although the likelihood of that happening is minuscule, but it would be a very good thing for all bitcoiners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "June 02, 2023, 05:58:13 AM",
      "body": "Quote from: alastantiger on June 02, 2023, 02:09:22 AMFor those who can smell a rat, can you use your sixth sense to tell if this Democratic presidential candidate is a true Bitcoiner or a pseudo Bitcoin supporter? The real question is not what a politician says but what they do. In other words you don't need to have sixth sense to know the answer, all you need to do is to look at his past and see what actions he has taken so far in favor of bitcoin!P.S. In the previous US election there were others (whom nobody remember today) that spoke positively about bitcoin trying to gather support. I don't see any difference here. After the regime chooses another 2 puppets (Biden 2.0 and 3.0) and introduces those two for Americans to be forced to choose between, these others are forgotten too. In other words it doesn't matter if Jr is really pro bitcoin or not",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "June 02, 2023, 07:47:05 AM",
      "body": "Nobody really know for sure what's the reasoning behind those politicians, they could be motivated by yes, politics itself maybe because they know that they can put voters to sway on them and it push becomes shoves, they need every vote they can to win and stay in the office.So for now, let's say every politician not just Robert Kennedy Jr will be on our radar but with a grain of salt. We still yet to see his true colors are far as his supposedly bitcoin support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "June 02, 2023, 08:24:21 AM",
      "body": "He might be a genuine Bitcoiner or probably just cozying up to the coin, I may not know, but for the fact that he's the first presidential candidate to accept campaign donations in Bitcoin tells us different. To him, the economy of the US would be done a huge favor if there's a diverse ecosystem of currencies. That looks like someone who's interested in the possibility Bitcoin can bring to the economy than just hoping to score some brownie points to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "June 02, 2023, 08:37:32 AM",
      "body": "I think most if not all politicians are liars and would say and do anything to get votes. Their words can never be fully trusted. Robert Kennedy Jnr may not be any different from the rest. Personally, I don’t think he gives any thought about bitcoin as he’s trying to portray and he may very well be kissing up to younger voters who are also bitcoin holders. I’m trying to be optimistic here but with politicians, I just can’t afford to have my hopes up only to be disappointed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "June 02, 2023, 09:03:50 AM",
      "body": "Are BTT users true Bitcoiners or pseudo Bitcoin supporters? If you can answer that objectively, and explain why it matters, yeah, then I'll get to random US politicians.Last time I checked, there was no prerequisites of character to use Bitcoin. Put your memes, use it for your political candidacy, motives pure or not, it all actually helps in the end.As pooya87 says, what monkey do is more important than what monkey says. Every use is proof of concept.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "June 02, 2023, 09:12:55 AM",
      "body": "If you don't trust him, that's your opinion, it's not the same with mine, because this man make some statements when he was present in a Bitcoin conference week back and it got me confused, he knew what he is talking about, unlike many popular people in the U.S that knows nothing about Crypto, Sir Robert is different. I know how conning many politicians are, but an open-minded man like Sir Robert? Nah you don't know what you are talking about, don't judge what you don't know, if US want the best shot with crypto in the future, Sir Robert is their best shot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 02, 2023, 09:20:47 AM",
      "body": "Quote from: alastantiger on June 02, 2023, 02:09:22 AMFor those who can smell a rat, can you use your sixth sense to tell if this Democratic presidential candidate is a true Bitcoiner or a pseudo Bitcoin supporter? This is strictly a political affairs and we cannot concluded on wether it's a reality experience or an illusion to deceive others in other for him to achieve his ambition, as far as I've known all this kind of elements used in politics whereby every representing candidate tries to get a qualitative area of focus of the people especially the youth as target and give a solution to their challenges experienced, bitcoin may be part of his own campaign strategies but being real for it is what we cannot tell, but it could also be a good consideration for the fact that bitcoin has been having serious regulatory encounters in US of recent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "June 02, 2023, 09:20:53 AM",
      "body": "Quote from: KiaKia on June 02, 2023, 09:12:55 AMIf you don't trust him, that's your opinion, it's not the same with mine, because this man make some statements when he was present in a Bitcoin conference week back and it got me confused, he knew what he is talking about, unlike many popular people in the U.S that knows nothing about Crypto, Sir Robert is different. I know how conning many politicians are, but an open-minded man like Sir Robert? Nah you don't know what you are talking about, don't judge what you don't know, if US want the best shot with crypto in the future, Sir Robert is their best shot. What if Robert Kennedy Jr. did his assignment and he studied other politicians who have talked promise about Bitcoin but as you've said, not know what they're talking about, pretty sure that can be a possibility right? That he knows enough that we believe him. I wouldn't really say that he is the future, until he's doing something that's notable right now when he's still at his current position. Politicians are snakes, never trust them because they're also puppet to the corporations who sponsors their campaigns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "June 02, 2023, 09:24:04 AM",
      "body": "Quote from: alastantiger on June 02, 2023, 02:09:22 AM I do not trust politicians. When they want to run for office, and they suddenly remember that they have to be in the good graces of the Bitcoin community. Suddenly he is all over the place tweeting and making speeches about Bitcoin and cryptocurrency.For those who can smell a rat, can you use your sixth sense to tell if this Democratic presidential candidate is a true Bitcoiner or a pseudo Bitcoin supporter? You will able to actually know his true standing with bitcoins just after he has assumed political office, that is if he does. Politicians to me are all the same, they can promise the things that they know people want to hear to get attention and get a political position they desire. When some get into office, they may act differently. In other thinking, If he has good intentions for bitcoins, and is not surrounded by other people in his government who share the same views on bitcoins, it will make it difficult for him to achieve whatever he has planned to do for bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "June 02, 2023, 02:46:54 PM",
      "body": "I believe that based on what John F. Kennedy stood for and his mission to put an end to the monetary system/banking system (or at least reform it) during his presidency, and arguably a large factor in his assassination, is something that (for me) validates very strongly that Robert Kennedy Jr is serious about his support for Bitcoin.It is true that Bitcoin will free the people, will curse and destroy banks, and put an end to the tyrannic money system. John F. Kennedy would have supported Bitcoin, so it only makes sense that Robert Kennedy Jr. does too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 02, 2023, 03:11:00 PM",
      "body": "What makes the United States gain political and economic strength is that it relies on three things, weapons, the dollar, and intellectual property, and it is a state of institutions. Therefore, even if the current or next president is supportive of Bitcoin, the dollar must be valuable, and therefore no candidate will go far in Bitcoin. And by far, I mean that Bitcoin will not be a legal tender, but the most that he can do is enact some positive legislation related to Bitcoin, which is something that has already happened.mentioned some of the mining legislation in the United States and the first clear regulatory framework for European Union countries as allies of the United States.Markets in Crypto Assets Regulation (MiCA) discussionsMississippi & Missouri lawmakers propose laws protecting bitcoin miningthe most Robert Kennedy Jr can do is to support Bitcoin ETF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "June 02, 2023, 06:51:44 PM",
      "body": "As every politician is trying to attract as many chickens as possible to gain consensus, he has probably seen a very large slice to take home and not only among citizens but could also have the support of many companies that are planning developments on Bitcoin or cryptocurrencies .  So I'm pretty sure it's just a media campaign about him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 02, 2023, 07:57:43 PM",
      "body": "Quote from: alastantiger on June 02, 2023, 02:09:22 AMI do not trust politicians. When they want to run for office, and they suddenly remember that they have to be in the good graces of the Bitcoin community. Suddenly he is all over the place tweeting and making speeches about Bitcoin and cryptocurrency.That's what politics is. Candidates that are contesting always look for what can possibly win the hearts of the people towards voting for them. But even if the people had to choose a leader, their choice would not be Just because the candidate is really a Bitcoiner, it should also be based on other characteristics to determine whether the person would be able to make some good decisions that can drive or boost the country's economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}