{
  "id": "topic_5473920",
  "title": "KiaKia",
  "author": "KiaKia",
  "created_time": "November 13, 2023, 02:26:40 PM",
  "content": "Whenever someone come asking me about Bitcoin I sometimes look at them as another victim to scammer, at least before they learn, and that's even if they choose to stay after they get scammed, such category of people only know how to quit, I think this way because people only what to hear the good side of investment and not the bad and risky side. Something happened to someone who is not very close, I remember he came to me asking me about Bitcoin and how to get involved, I remember it was a bad timing for me and I told him to go online and do his own research.Now he is a victim to a WhatsApp group that opened a exchange and told him to invest through them, I never knew he had up to $3000 for investment, he never sound like someone who is ready to invest a lot and secondly I thought he was a time waster, now he can't withdraw his Bitcoin from the fake exchange. I am thinking that leaving behind and not teaching people can make them a prey to scammers, if I have just thought him the right things about Bitcoin he might have not get scammed. No matter how much you tell others to do their research about Bitcoin some are not very good at it, call it illiteracy or other but it is what it is, should we start turning those who are not so good with finding answers away? Is that a right thing to do? I don't even know why I am feeling bad for this person, I could have saved him though.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473920",
  "comments": [
    {
      "author": "AbuBhakar",
      "created_time": "November 13, 2023, 02:34:27 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMI am thinking that leaving behind and not teaching people can make them a prey to scammers, if I have just thought him the right things about Bitcoin he might have not get scammed. No matter how much you tell others to do their research about Bitcoin some are not very good at it, call it illiteracy or other but it is what it is, should we start turning those who are not so good with finding answers away? Is that a right thing to do? I don't even know why I am feeling bad for this person, I could have saved him though.It’s not really bas teaching someone that approaches you voluntarily about Bitcoin because you can basic knowledge on how to use and acquire it safely. But also we should remember that we are not responsible to every person so we should stop feeling guilty for not teaching them especially if you knew to yourself that person is a natural high risk.I have a co-worker like this that keep asking me about Bitcoin but his main intention is just for quick profit and not the technology since he always joined on ponzi scheme in facebook. I tell him that Bitcoin is not a ponzi scheme that will give quick rich and then he stop having an interest. I tend to discourage someone that I knew the purpose is not by investing but rather by having a ponzi mindset which is just a big concern later on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "November 13, 2023, 02:35:09 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMWhenever someone come asking me about Bitcoin I sometimes look at them as another victim to scammer, at least before they learnIf someone ask you because trusting me, I don't consider the person is a victim to scammer. I would like to listen to him/ her about reasons why he or she needs me and my advice. If it is to enlighten something is unclear after own research, it is a good step to learn more.QuoteSomething happened to someone who is not very close, I remember he came to me asking me about Bitcoin and how to get involved, I remember it was a bad timing for me and I told him to go online and do his own research.Do own research before invest is very important. It is a first step to start and rely on anyone, any group for my money is not what I will do.QuoteNow he is a victim to a WhatsApp group that opened a exchange and told him to invest through them, I never knew he had up to $3000 for investment, he never sound like someone who is ready to invest a lot and secondly I thought he was a time waster, now he can't withdraw his Bitcoin from the fake exchange. It is like a Ponzi scheme.Even not Ponzi scheme, there are something bad like Trading, Signal groups which only play pump and dump games. Group members give group owners chance to get rich but many members will lose money. Because if they join a pump and dump game at later phase, they can not avoid loss by buying at top and selling at bottom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "November 13, 2023, 02:37:23 PM",
      "body": "the issue is that some people dont want mentors. they dont want to learn. they just want a fast track acknowledgementi personally spoke to lots of people, told them all the ins and outs, all the risks. all the scams.. and they still ended up throwing money into scams that offer 10x yield per montheven if you say how self custody bitcoin is safe. but watch out for services. the idiots will still throw suitcases of cash at strangers saying \"but X said its safe\"sometimes you cant teach the dumb. greed overrides their logic. you can literally tell someone they are buying into some MLM pyramid and they will reply \"it cant be a MLM pyramid because the world is flat\" due to them seeing some fluffy utopian promotion offering huge returns at little cost. their greed destroys their logic, and they become a victim of their own greed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "November 13, 2023, 02:43:10 PM",
      "body": "The title makes it sound like it is supposed to be our fault if other folks do not bother to do their own research.Bullshit. Their mistakes are theirs alone.Now if someone asks you about BTC then ja, one should do their best to explain it. Thing is - they have to ask - if they don't then it is not our fault if/when they get screwed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "November 13, 2023, 02:45:56 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMWhenever someone come asking me about Bitcoin I sometimes look at them as another victim to scammer, at least before they learn, and that's even if they choose to stay after they get scammed, such category of people only know how to quit, I think this way because people only what to hear the good side of investment and not the bad and risky side. An interesting observation. Very subtle point.Everyone wants to believe in a fairy tale and easy success. Like a lottery or a jackpot in a casino. In the same way, most people perceive bitcoin - as an opportunity to make easy and relaxed money, so that with the click of two fingers they can become millionaires. Once you learn the dark, risky side of the bitcoin, all that magic of naivety evaporates. Quote from: KiaKia on November 13, 2023, 02:26:40 PMSomething happened to someone who is not very close, I remember he came to me asking me about Bitcoin and how to get involved, I remember it was a bad timing for me and I told him to go online and do his own research.Most people are too lazy to do their own research and everyone wants ready-made answers, solutions that will lead them to wealth. It would seem that everyone has the Internet and all you need to do is take the first step towards learning. But no.Quote from: KiaKia on November 13, 2023, 02:26:40 PMNow he is a victim to a WhatsApp group that opened a exchange and told him to invest through them, I never knew he had up to $3000 for investment, he never sound like someone who is ready to invest a lot and secondly I thought he was a time waster, now he can't withdraw his Bitcoin from the fake exchange. Such is the fate of those who seek easy and spontaneous enrichment. This is the price to pay for not wanting to do your own research / study. It was his choice, which means the consequences are also his destiny.Quote from: KiaKia on November 13, 2023, 02:26:40 PMI am thinking that leaving behind and not teaching people can make them a prey to scammers, if I have just thought him the right things about Bitcoin he might have not get scammed. Scammers will always find victims. You can't save everyone. It has nothing to do with you.Quote from: KiaKia on November 13, 2023, 02:26:40 PMNo matter how much you tell others to do their research about Bitcoin some are not very good at it, call it illiteracy or other but it is what it is, should we start turning those who are not so good with finding answers away? Is that a right thing to do? I don't even know why I am feeling bad for this person, I could have saved him though.Nothing can be fixed and your regret can't change anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "November 13, 2023, 02:55:24 PM",
      "body": "If he asked you for help, and you refused him, then yes, there is a drop of your guilt. Why regret now what has already happened? Likewise, I'm always surprised by the very smart advice from users who create threads on how to protect themselves from scammers, but essentially tell newbies to do their research. How can beginners, without knowing anything, determine where is black and where is white?“Do your research” is equivalent to the answer, take all risks upon yourself. However, people who own large sums of money should not be so childish as to easily trust their funds anywhere. I always start discussing investments in Bitcoin from the worst side so that people are not fascinated by fairy tales of quick profits. This way, at least he will study the pitfalls that he is likely to fall into and make decisions on how to avoid trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "November 13, 2023, 03:00:19 PM",
      "body": "Not everyone that comes to seek a guide about Bitcoin is a victim of a scam; some of them want to start the right way, which is why they ask questions on where and how to start going about it.Not everyone knows how to teach others, while some people are naturally good teachers and know how to explain things in the best way to convince the listener. But when it comes to Bitcoin, you cannot force yourself to teach people that are not willing to learn; some people prefer to go to the internet and get everything themselves, and most of them get the wrong guidance online, which can be the reason this person you are making reference to falls victim to a fake WhatsApp exchange.Quote from: KiaKia on November 13, 2023, 02:26:40 PMNo matter how much you tell others to do their research about Bitcoin, some are not very good at it. Call it illiteracy or something else, but it is what it is. Should we start turning those who are not so good at finding answers away? Is that the right thing to do? I don't even know why I am feeling bad for this person; I could have saved him.To me, anyone that comes to me seeking a guide about Bitcoin, I will guide them in the right way. I can't tell them to go and do their own research without telling them the basic things they need to know and the risks involved in Bitcoin investment. After teaching them the basics and the right way to get good and proper information about Bitcoin like this forum and learnmeabitcoin.com, I will be free. If they go ahead and fall victim because of greed, that's their business and not mine, and I should not be responsible for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gormicsta",
      "created_time": "November 13, 2023, 03:00:45 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMI am thinking that leaving behind and not teaching people can make them a prey to scammers, if I have just thought him the right things about Bitcoin he might have not get scammed. Having basic knowledge about Bitcoin or being thought about Bitcoin investment isn't a guarantee of being completely safe from scammers. These scammer are smarter than you think and they have so many methods and techniques they employ every single day to make their lies sound and look real to you. These scammers do their own research and update their schemes every now and then, so even as a Bitcoin inclined person or one who already has knowledge of Bitcoin, you can still be victimized by those hoodlums if you're not careful. Bitcoin knowledge is way more vast than you could ever imagine, it would take a lifetime to know everything about Bitcoin because learning never stops, where your knowledge of Bitcoin ends is where another's begin. I have a friend who has been in the Crypto business for years, he knew so much about Bitcoin and also have few investments too, but in all his knowledge, he never knew there was something call a WATCH-ONLY-WALLET yeah I know you may be asking, who doesn't know about the watch only wallets? But as ridiculous as it may sound, my friend with years of experience didn't know about it and it cost me a few thousands. He lost over $6000 to scammers who told him  they were hackers and could help him generate random Bitcoin wallets that contained an amount of Bitcoin and all the Bitcoin inside could be his for just a small fee. I can't go into details but that was exactly how he lost over $6000 to them, he came and told me after he has already been swindled and it was at that point I explained what they did to him, so he paid $6000 for a knowledge he could have acquired for free. My point is that everyone should just be very careful out there and always remember to do a thorough research before going ahead to risk your money into something you're not sure of, especially something a stranger online introduces to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "November 13, 2023, 03:46:02 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMWhenever someone come asking me about Bitcoin I sometimes look at them as another victim to scammer, at least before they learn, and that's even if they choose to stay after they get scammed, such category of people only know how to quit, I think this way because people only what to hear the good side of investment and not the bad and risky side. Something happened to someone who is not very close, I remember he came to me asking me about Bitcoin and how to get involved, I remember it was a bad timing for me and I told him to go online and do his own research.Now he is a victim to a WhatsApp group that opened a exchange and told him to invest through them, I never knew he had up to $3000 for investment, he never sound like someone who is ready to invest a lot and secondly I thought he was a time waster, now he can't withdraw his Bitcoin from the fake exchange. I am thinking that leaving behind and not teaching people can make them a prey to scammers, if I have just thought him the right things about Bitcoin he might have not get scammed. No matter how much you tell others to do their research about Bitcoin some are not very good at it, call it illiteracy or other but it is what it is, should we start turning those who are not so good at finding answers away? Is that the right thing to do? I don't even know why I am feeling bad for this person, I could have saved him though. There is no better way to put this man! No matter how detailed an article is, it can't be compared to you learning from someone who is already in the field. Even if a text is recommended to you as a guide containing all the information you need to get before getting started in Bitcoin, it can't be compared to you learning it from a fellow in the field of Bitcoin. And the reality is that the majority of the groups you see both on Facebook and WhatsApp is filled with loads of scammer that are looking for unsuspecting and naive individual to take advantage of, and it's very easy to get newbies that are eager to invest funds into bitcoin most especially when de already have the fund and have read or watched some clips regarding Bitcoin investment.As long as the person is ready to learn and that you are able to teach the person, I don't see any big deal in guiding someone aright so he doesn't get into the wrong hands. And believe me, the person will always see you as a bad person whenever he remembers the money he lost because of your failure to put him through the basics of bitcoin. But it has happened and there is nothing you can do much about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "November 13, 2023, 03:57:27 PM",
      "body": "Many people see crypto as an opportunity to massive profits due to false portrayal in the media as well as a lot of false advertising by platforms and shitcoins. So when introducing anyone to cryptocurrenty, it's not just about helping them understand why bitcoin is the best, but also about providing some basic literacy in economics. For example, any yields advertised on centralized platforms risk even your initial. Anything offering yields is suspicious as if they had such stable profits they would have either remained a privately funded venture or become listed.Also that small capitalization coins are bound to be And such things. These really come in first than just learning about bitcoin. But frankly this is too much for most people, and going after dreams of fast wealth without having studied even the basics to be able to ask the right questions, makes them prone to scams such as shitcoins. Some might know what they're getting into, but frankly must that fall victims to rug pulls or altcoin scams cry foul later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 13, 2023, 03:59:29 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMWhenever someone come asking me about Bitcoin I sometimes look at them as another victim to scammer, at least before they learn, and that's even if they choose to stay after they get scammed, such category of people only know how to quit, I think this way because people only what to hear the good side of investment and not the bad and risky side. There is absolutely nobody that wants to hear anything negative about something they want to get into except they are against such thing from the beginning, so it is your responsibility to actually shape the narrative of those that comes to you for knowledge about it. If you see the person coming towards you to learn about bitcoin already has a narrative that it is a get rich quick scheme your first lesson should be how people have lost lots of money trying to get rich from it as scammers exploited them. This will give him a break and then you can start the teaching process of how he can protect himself with secure wallets and avoiding scam projects or phishing attacks and then tell him how bitcoin can actually generate ROI but not make you super rich. This will shape is narrative about the whole process. OP next time you are busy and someone comes to gain knowledge about bitcoin, the best is to just ask him to create an account here or send him links of guides from here and some relevant articles rather than asking him to randomly search online. Quote from: Gormicsta on November 13, 2023, 03:00:45 PM I have a friend who has been in the Crypto business for years, he knew so much about Bitcoin and also have few investments too, but in all his knowledge, he never knew there was something call a WATCH-ONLY-WALLET yeah I know you may be asking, who doesn't know about the watch only wallets? But as ridiculous as it may sound, my friend with years of experience didn't know about it and it cost me a few thousands. He lost over $6000 to scammers who told him  they were hackers and could help him generate random Bitcoin wallets that contained an amount of Bitcoin and all the Bitcoin inside could be his for just a small fee. When you stated that having basic knowledge about bitcoin doesn’t stops one from getting into falling into the hands of scammers I agree a bit because of cases like malware attacks or some phishing attack can’t be comprehend by just basic knowledge. But one thing I will always say is close to 60% scam victims were gotten Greed, your story confirms this. Had your friend not been greedy of getting a wallet with so much fund in it for little amount even with his limited knowledge he wouldn’t have fell to such scam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "November 13, 2023, 04:06:08 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMNo matter how much you tell others to do their research about Bitcoin some are not very good at it, call it illiteracy or other but it is what it is, should we start turning those who are not so good with finding answers away? Is that a right thing to do? I don't even know why I am feeling bad for this person, I could have saved him though.Listening should be an integral part of a Human being these days mostly as it concerns being ambassadors of Bitcoin and cryptocurrencies in general. It's about talking about the Bitcoin subject to anyone that hints on the subject somewhere during a conversation. Some people are generally lazy to do their research because they may not know or understand what to look out for. YouTube channels should be like a hub to be visited regularly if someone like the person in the story wants more knowledge on how to invest in Bitcoin or altcoins.On the other hand, talking or lecturing of any kind  to person these days that feign ignorance, can make the lecturer be an easy target for kidnappers, scammers, hackers and thieves.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "November 13, 2023, 04:19:24 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMWhenever someone come asking me about Bitcoin I sometimes look at them as another victim to scammer, at least before they learn, and that's even if they choose to stay after they get scammed, such category of people only know how to quit, I think this way because people only what to hear the good side of investment and not the bad and risky side. Something happened to someone who is not very close, I remember he came to me asking me about Bitcoin and how to get involved, I remember it was a bad timing for me and I told him to go online and do his own research.Now he is a victim to a WhatsApp group that opened a exchange and told him to invest through them, I never knew he had up to $3000 for investment, he never sound like someone who is ready to invest a lot and secondly I thought he was a time waster, now he can't withdraw his Bitcoin from the fake exchange. I am thinking that leaving behind and not teaching people can make them a prey to scammers, if I have just thought him the right things about Bitcoin he might have not get scammed. No matter how much you tell others to do their research about Bitcoin some are not very good at it, call it illiteracy or other but it is what it is, should we start turning those who are not so good with finding answers away? Is that a right thing to do? I don't even know why I am feeling bad for this person, I could have saved him though.The thing is that if anyone approaches you to teach him about bitcoin then it kinda becomes our responsibility to help him learn the basics about bitcoin and stay away from scam.If you don't have the time right now you can tell him to contact you later so that you can discuss on the same in detail.If he's fallen a victim to any scam then it's his fault but somewhere down the line you could have helped him avoid it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "November 13, 2023, 04:32:13 PM",
      "body": "Which is why I always go out of my way to let people know about what bitcoin and crypto is, whenever they are interested. It's not much to me, it wouldn't take a hot minute of my time anyway, but those few nuggets of knowledge that they would gain from what I tell them, would literally shield them from years of hacking and scam attacks. And I'm not one for theatrics and dramatic effects but it does make me feel good every time I know that I helped someone out there. So to the people in this forum that already made something for themselves, I implore you to actually be a little more proactive about telling the newbies about what crypto is, or at least those that show interest in crypto. You wouldn't know how much of a help you could be by just being generous with the knowledge you share.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "November 13, 2023, 04:32:39 PM",
      "body": "don't blame yourself if someone fails because you don't have any responsibility to them. what you did by telling him to find out first online and do his own research is right in my opinion, in the end he got scammed, it was his fault, that means his knowledge in crypto is still low.and why didn't he ask you first about the group? why did he immediately act without thinking about what the impact would be in the future? from here we can see that he is not really looking for information about crypto online and his mindset is also wrong about crypto. stop blaming yourself because it is completely his fault.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "November 13, 2023, 04:32:57 PM",
      "body": "Buy of BTC is not too hard for people to learn from online or through this platform like the way I learned through our local board platform because, there are many people that learned how to buy and sell BTC from this bitcointalk.org and they are good in trading their BTC in the exchange market. I guess, some of the people that fall victims to scammers are those looking for quick money from social media and, it will lead them to lose all their money to scammers like what happened to that your friend because we still have some people like that in our various places.Even though you call that your friend that you want to teach him how to buy and sell BTC, he will not listen to you because, he will be thinking that you want to teach him wrong thing about exchange market and, it can lead him to a wrong direction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "November 13, 2023, 05:00:22 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMNo matter how much you tell others to do their research about Bitcoin some are not very good at it, call it illiteracy or other but it is what it is, should we start turning those who are not so good at finding answers away? Is that the right thing to do? I don't even know why I am feeling bad for this person, I could have saved him though.Do your research, yes but a lot of newbies don't even know where to start their journeys let alone know areas of research focus, So they need this lecture and guidelines before they sort ways out on their own. I know how complicated some things used to be when you are getting to know something new and it is not that easy at the very beginning, So this is the situation in which most newbies find themselves starting their journey with Bitcoin and cryptocurrency, and in the course they end up in the hands of these scammers who even pretend to guide them online. No matter what we do there is always gonna be this newbie mistake, but proper lecturing of newbies in the space will reduce the rate of these scam victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "November 13, 2023, 05:58:03 PM",
      "body": "Quote from: KiaKia on November 13, 2023, 02:26:40 PMSomething happened to someone who is not very close, I remember he came to me asking me about Bitcoin and how to get involved, I remember it was a bad timing for me and I told him to go online and do his own research.I don't how busy you were but instead of telling him to do a google search you'd have referred him to the forum, maybe this would have been prevented. He was totally naive and the scammer took advantage of his naivety to scam him. Quote from: KiaKia on November 13, 2023, 02:26:40 PMI am thinking that leaving behind and not teaching people can make them a prey to scammers, if I have just thought him the right things about Bitcoin he might have not get scammed. In some way, yes. If you had taught him, he'd have bought from exchange and the Bitcoin would been seating right in his wallet. He might have done his research and probably waiting for funds to invest, then he receives a PM, and he thought to himself, let me take this route, not knowing that he's going to be a scam. That's why I don't entertain unsolicited PMs from strangers on social media. $3000 is a huge amount of money and I feel bad for him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "November 13, 2023, 06:17:52 PM",
      "body": "Well I think the only fault you can accrue to yourself is the fault of not letting him know the risky aspect of it even if you will not explain the technical aspect of it. I think the first thing to tell anyone seriously or jokingly is the aspect of it that is dangerous so that, the person can take caution. If the person now go and seek for information later, he or she can be selective",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}