{
  "id": "topic_5444600",
  "title": "cafter",
  "author": "cafter",
  "created_time": "March 12, 2023, 03:50:40 PM",
  "content": "I was watching a youtube video about blockchain and bitcoin,the guy explained it very well and most of the part of video i understood but i confused at this part \"coinbase transaction\"how the coins are generated from air ?are exchanges have another type of blockchain running?here is the video i watched at that time : https://www.youtube.com/watch?v=_160oMzblY8&t=876s",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444600",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "March 12, 2023, 04:05:47 PM",
      "body": "Quote from: cafter on March 12, 2023, 03:50:40 PMhow the coins are generated from air ?That's how bitcoin is designed. Miners get newly generated coins as reward for their work. Note that the coins generated on coinbase transactions don't come from thin air. Miners work for the newly generated coins.Quote from: cafter on March 12, 2023, 03:50:40 PMare exchanges have another type of blockchain running?What do you mean by running another type of blockchain? We have only one bitcoin blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "March 12, 2023, 04:40:52 PM",
      "body": "Quote from: hosseinimr93 on March 12, 2023, 04:05:47 PMQuote from: cafter on March 12, 2023, 03:50:40 PMare exchanges have another type of blockchain running?What do you mean by running another type of blockchain? We have only one bitcoin blockchain. I think OP has messed up Coinbase exchange and coinbase transaction.To OP, if my above assumption is correct, let me share with you that these two are different. There's an exchange namely \"Coinbase\" but the block reward generated by the miners in each block is also called coinbase transaction. Hope this explanation clears up your confusion. Many people get confused with these two terms lol,. you are not the only one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "March 12, 2023, 07:31:59 PM",
      "body": "Quote from: cafter on March 12, 2023, 03:50:40 PMhow the coins are generated from air ?It is not from air, but from proof of work algorithm,  i.e., from their computer power and energy.I made a summary here:Quote from: bitmover on April 13, 2018, 11:09:08 PMProof of WorkIn the Blockchain, all transactions are publicly announced to all nodes, as there is no central authority who validate transactions. Proof of Work is an algorithm that rewards participants who solve a cryptographic puzzle in order to validate transactions and create new blocks (this process in known as mining).This puzzle consists in scanning for a value (called Nonce) that when hashed together with thr block data, the hash begins with a number of zeros.In this  website  you can see how this process works. You can try to find a Nonce that when hashed generates a hash that start with 0000 on your own. You will see that it is hard, unless you are very lucky. And you are going to be lucky twice in row, if you do go to a casino or something like that lol.The difficult in finding that nonce increases exponentially as more zeros are required by the block. Difficult is adjusted every 2016 blocks, based on the average hashrate of those past 2016 blocks, so that 2016 blocks are mined every two weeks. (So a block is mined every 10 minutes)Miners only get their reward if they are mining the longest chain, as it has the greatest processing power invested. If the honest nodes control the majority processing power, the honest chain will always be the longest and will outpace attacker’s chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "March 12, 2023, 10:37:15 PM",
      "body": "Quote from: cafter on March 12, 2023, 03:50:40 PMthe guy explained it very well and most of the part of video i understood but i confused at this part \"coinbase transaction\"For your confusion, here's an article which comes from Telegraph that explained very well the \"coinbase transaction\" it's a different term on Coinbase exchange that has a domain name of \"coinbase.com\" if you're confused. Quotehow the coins are generated from air ?I tend to agree with the above said, that's how miners work through their proof of work algorithm and that's not generated from the air. There are too many terminologies in crypto that you might confuse about if you aren't familiar with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0nce",
      "created_time": "March 12, 2023, 10:40:30 PM",
      "body": "Quote from: cafter on March 12, 2023, 03:50:40 PMhow the coins are generated from air ?No, you are basically allowed to send yourself the 6.25BTC block reward + transaction fees from a block, if you solved the PoW problem for that block through mining.So yes, the coinbase transaction has no input, but 'out of thin air' would mean that you put nothing into it, while you did pay for energy & hardware to solve that PoW.Quote from: cafter on March 12, 2023, 03:50:40 PMare exchanges have another type of blockchain running?Everyone's running the same blockchain, otherwise it would not work.Do note that the 'Coinbase exchange' has nothing to do with 'coinbase transactions' besides having named themselves after these transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}