{
  "id": "topic_5475249",
  "title": "illetyus",
  "author": "illetyus",
  "created_time": "November 23, 2023, 07:29:15 PMLast edit: December 01, 2023, 06:44:59 PM by illetyus",
  "content": "Quote from: illetyus on August 07, 2023, 07:39:08 PM1.zkDogezksync ağının meme tokeni. 170k marketcap. token dağılımı güzel görünüyor. zksync airdrop yaptıktan sonra ağ üzerindeki kullanıcılar paralanacak. aktifliğin ve likiditenin artacağı ortamda nasibi alır diye düşünüyorum.https://coinmarketcap.com/currencies/zkdoge/ zksync ağından borsalara token çekmek istediğimde 21 saat sürebilir diye uyarı var. (hiç denemedim) Olası airdrop sonrası çoğu kişi bu süreden dolayı syncswap ve mute gibi dexlere yönelir ve ciddi bir hacim artış olabilir. Airdrop sonrası multiden para vuranlar özellikle meme tokenlerde illa biraz şımarır diye düşünüyorum. zksync ağındaki en temiz meme token şuan bence zkdoge. (300k güncel mcap) hem tahtadaki likiditesi güzel hemde uzunca bir süredir herkese ufak miktarla yayılmış görünüyor. Ağdaki herhangi bir meme tokenin +2mcap değerine ulaşması diğerlerini de tetikler.  cex listemesine sahip tek meme token ise pepera. (20k microcap) pepera tokenlerin yarısı mexc borsasının elinde kendisi pumplayabilir yada rug atabilir. Edit: Mexc'den delist olabilir. Uyarısı var. Delist olursa çöp olur tamamen. Şuan tabi airdrop gibi bir durum söz konusu değil. Sadece piyasa iyiken böyle bir durum gelirse olabilecek bir senaryo. hype olursa zaten giriş yapmak için uygun bir ortam olmuyor iş işten geçmiş olur. Bugün zaten kafayı dikmişler yeterince çanta yapamadan gidiyorlar gibi..",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475249",
  "comments": [
    {
      "author": "mandown",
      "created_time": "November 27, 2023, 09:04:17 PM",
      "body": "Zkdoge yi cüzdana zaten atmıştım bunun yanında ağda aktif olmak için mcap i düşük ne kadar cer çöp varsa aldim bu yükseliş trendinde 2x yapanı satıp ana parayı alıyorum hem ileride gelecek airdrop için hacim yapmış oluyorum hem tx hemde bedavadan token biriktiriyorum.Bu hafta zk tarafına iyi para akti",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}