{
  "id": "topic_5465553",
  "title": "aoluain",
  "author": "aoluain",
  "created_time": "September 03, 2023, 08:56:30 PM",
  "content": "Z_MBFM's thread about his/her first collectible HERE and the generosity of some members has sparked an idea which we could all partake in, a kind of \"Pay it Forward\" sort of collaboration.I wonder if something like this has been done here before?I was thinking that one member starts off the collab by nominating another memberand send them something Bitcoin, Crypto or even FIAT collectible related - large, small,valuable or not, rare or abundant or even a one off self made specifically for the collab.The key to it is to not expect anything in return and if it works out further down the project that you get something back well thats Karma!I remember doing something like this on a photography forum many moons ago,It was a postcard collaboration type project like this.Anyway what do you all think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465553",
  "comments": [
    {
      "author": "Bullion-n-BTC",
      "created_time": "September 03, 2023, 09:37:22 PM",
      "body": "I would be down for this. I think it’s a great idea and would be a good chance to take a chance and maybe mix some stuff up in the collections",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JanEmil",
      "created_time": "September 04, 2023, 05:57:06 AM",
      "body": "Will say we already have that. I got so much from people here - physical things, help and BTC. Loaded coin with 0.1 BTC and at least 50 other items along the way. This forum have many layers. The more you give the deeper you get connected. Heroes work behind the scenes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rybako",
      "created_time": "September 06, 2023, 08:51:21 AM",
      "body": "I'm game, let's do this! It's a wonderful idea to foster a sense of community and generosity. Paying it forward in the crypto world could lead to some exciting surprises and connections. Count me in for spreading some positive vibes!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "September 10, 2023, 11:33:16 PM",
      "body": "I remembered something Geo did a while back and finally found it, but it's probably irrelevant thanks to CK-Scam.  https://bitcointalk.org/index.php?topic=5276794.msg55221276#msg55221276",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "September 15, 2023, 12:49:10 PM",
      "body": "Thanks for the replies everyone, looks like there isnt much appetite for this and probably apity the thread got moved from the collectibles board to Off Topic.Anyway thanks owlcatz, I remember that thread by geo, it was a great idea and like he saidI also wasnt looking to feather my own nest.Anyway I'll leave the thread open and see if there is any more interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}