{
  "id": "topic_5446154",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "March 24, 2023, 12:14:55 PMLast edit: March 24, 2023, 12:42:38 PM by NotATether",
  "content": "In case you don't know (more) about me, I'm the guy behind BitcoinCleanup. So successful this awareness campaign has been, that I even successfully lobbied theymos for a factoid spot for it.In case you haven't been following Twitter - and why would you after Mr. DogeLord bought it - Greenpeace has been launching new FUD against Proof of Work mining.They call it a \"skeleton in the closet\" and stuff with emojis.They even hired a graphic designer to make some art for them:In what comes as a great surprise to nobody, Greenpeace was promptly destroyed in that thread:Ironically, even the person who designed the art for them agrees that PoS will never work on Bitcoin!And I just noticed I fudged the spelling in the last tweet there, and I wasn't even on Autocorrect",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446154",
  "comments": [
    {
      "author": "Artemis3",
      "created_time": "March 24, 2023, 03:05:32 PM",
      "body": "Of course, that banker from Ripple pocket them with some leftovers. Back then he announced 5 million to FUD Bitcoin, maybe he just continued feeding their new acquired parrot?, especially now that their system is in panic...Who burns more energy? The traditional banking/financial system or Bitcoin? The traditional system burns so much more energy the comparison isn't even funny. Just imagine a world without banks, credit/debit cards, exchanges, none of it is needed with Bitcoin.So it is clear that no matter what they say, they are just a tool for banker's agenda, who oppose Bitcoin because it has render them obsolete.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 24, 2023, 03:31:51 PM",
      "body": "Quote from: Artemis3 on March 24, 2023, 03:05:32 PMWho burns more energy? The traditional banking/financial system or Bitcoin? Of course we all know that their traditional old ways of administration of both financially and economic aspects is a total waste of energies because a larger percentage of them were left ineffective, they can't as well compare bitcoin mining to the castrophe left their local mining of natural resources through human activities.Quote from: Artemis3 on March 24, 2023, 03:05:32 PMThe traditional system burns so much more energy the comparison isn't even funny.How many banks make use of green energy in supplying the electricity they utilize.Quote from: Artemis3 on March 24, 2023, 03:05:32 PMSo it is clear that no matter what they say, they are just a tool for banker's agenda, who oppose Bitcoin because it has render them obsolete.This is just the perfect idealogy of the things going on with governments and every other agent of antagonist they raise to oppose bitcoin mining energy utilization, thanks @NotATether for the awareness campaign on bitcoin cleanup, we continue altogether in symphony that bitcoin mining is not a waste of energy but rather a solution to the vulnerability created from all central authorities through their various environmental polluting activities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gayong88",
      "created_time": "March 24, 2023, 04:07:44 PM",
      "body": "Quote from: Aanuoluwatofunmi on March 24, 2023, 03:31:51 PMQuote from: Artemis3 on March 24, 2023, 03:05:32 PMWho burns more energy? The traditional banking/financial system or Bitcoin? Of course we all know that their traditional old ways of administration of both financially and economic aspects is a total waste of energies because a larger percentage of them were left ineffective, they can't as well compare bitcoin mining to the castrophe left their local mining of natural resources through human activities.Quote from: Artemis3 on March 24, 2023, 03:05:32 PMThe traditional system burns so much more energy the comparison isn't even funny.How many banks make use of green energy in supplying the electricity they utilize.Quote from: Artemis3 on March 24, 2023, 03:05:32 PMSo it is clear that no matter what they say, they are just a tool for banker's agenda, who oppose Bitcoin because it has render them obsolete.On the topic of green energy and the electricity industry. At least 50% of customers in the US have the option to purchase renewable electricity directly from their power supplier, which is sometimes referred to as \"green power\" or \"clean power\". Green power is available from a variety of suppliers, including utilities, competitive power suppliers, renewable energy certified (REC) marketers, project developers, and nonprofits.Regarding the number of banks using green energy, it shows that there is increasing availability and interest in renewable energy options in the electricity industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "March 24, 2023, 04:54:04 PM",
      "body": "Is Ripple still actively donating funds to Greenpeace? If so, I fear the higher the price of Ripple, the more attacks that Bitcoin will face from Greenpeace and likely other organizations will to take a stand against Bitcoin to receive donations from the Ripple team. I think Ripple truly has been one of the worst products to come from this crypto experiment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "March 24, 2023, 05:12:24 PM",
      "body": "Lol! Greenpeace has vested interest in spreading such FUDs. Not sure if Ripple is still funding then, but surely some banking organization is doing the funding here. Only bad part is that, common people might also believe in their FUD. But surely the crypto market will remain unaffected. We have become truly immune from such FUDs. Even Mr. Warren Buffett and Jemie Dimon won't be able to make a dent on the stability of the market. When the crypto prices go up, a lot of people feel jealous because they have missed the boat already. We can safely ignore such FUDs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "March 24, 2023, 05:15:59 PM",
      "body": "Quote from: OgNasty on March 24, 2023, 04:54:04 PMIs Ripple still actively donating funds to Greenpeace? If so, I fear the higher the price of Ripple, the more attacks that Bitcoin will face from Greenpeace and likely other organizations will to take a stand against Bitcoin to receive donations from the Ripple team. I think Ripple truly has been one of the worst products to come from this crypto experiment. Ripple uses more energy on lawsuits and lobbying than Bitcoin uses on (all types of) mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nimogsm",
      "created_time": "March 24, 2023, 08:45:36 PM",
      "body": "Yes, I read this news today and especially liked the comments on twitter.I liked that many people quickly reacted to the news and answered under their post.I also want to thank you for your site, t contains a lot of useful information for those who are poorly versed in the principle of Bitcoin, you did a great job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 25, 2023, 11:28:25 AM",
      "body": "I don't know what exactly happened to those people who once fought for things that made sense, but when they first appeared in public with their ideas that Bitcoin is bad for the environment, it was more than obvious that they had become an organization that sold out to the one who pays more. But this is nothing new to the world of various organizations that fight for peace or the preservation of the environment, most of them are actually corrupt and apart from talking a lot, they do nothing in the real world.It's just not clear to me how someone can publicly come out in such a way without checking whether the information about something they represent is correct or if it's a bunch of lies. Anyone want to bet what their next target is - maybe Christmas lights decoration",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mbitr",
      "created_time": "March 25, 2023, 12:42:15 PM",
      "body": "Check out this thread  over in collectibles https://bitcointalk.org/index.php?topic=5446176.0Order some stickers !As one member said in this thread …“ My thought is every sticker hoarded by a collector and believer of BTC avoids the chance of someone getting tricked by the propaganda.  I ordered ones for several relatives...lol”US a only I’m afraid",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "March 25, 2023, 05:55:29 PM",
      "body": "i always remember this news,QuoteGreenpeace accepted Bitcoin donations for seven years between 2014 and May 2021 before announcing it was halting the acceptance of Bitcoin donations, citing environmental concerns. Around the same time, Tesla CEO Elon Musk stopped accepting Bitcoin payments for Tesla vehicles.[1] https://cointelegraph.com/news/greenpeace-ripple-co-founder-campaigning-to-change-bitcoin-codetheir campaign \"change the code: not the climate\" is a campaign that they claims so that bitcoin developers want to change the initial code but what they are doing is a bad thing for bitcoin in the future because if the initial code is changed, then there is no difference between bitcoin and altcoins besides that the campaign also seeks to increase the prestige of ripple.greenpeace will not give up on the Bitcoin FUD attacks that they will issue because from the start they are just an organization looking for profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "March 25, 2023, 06:55:05 PM",
      "body": "Ahh if not Greenpeace accidentally outing themselves as funded by the other cryptocurrency. In any case, I firmly believe that we still have ways to go to make bitcoin as clean as it can be, because let's face it, there are millions if not hundreds of millions of small-time miners out there mining bitcoin with their residential electricity, which comes from the burning of fossil fuels. But the efforts that this industry did in order to combat pollution is something that I've never seen any other company or industry do in their decades of runtime. I think eco-protest groups should stop looking at bitcoin and throwing dirt at its name and actually go for big companies that are obviously the grave offenders of deteriorating the environment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AndyGryffindor",
      "created_time": "March 25, 2023, 07:20:44 PM",
      "body": "Enjoying some spaghetti code...Greenpeace? If only Richard Heart's Poof Of Twerk was a viable alternative?  Besides someone (calling themselves Satoshi) already offset all of the energy the miners use in the world. Just not many people are using it yet. I've been saving about half on my diesel bill for months now. Close to a thousand dollars saved already! Even treated a few neighbors vehicles and some earth moving equipment. Mineral miners, trucking businesses and farmers are all missing out on a breakthrough that can be built by a grade school-er.  Once people actually figure out that it works...https://bitcointalk.org/index.php?topic=5403404.0Feel free to ask me any questions about building one for yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "March 26, 2023, 12:19:28 AM",
      "body": "The sad and ironic thing of course is that Bitcoin is GREAT for the environment. People just don't understand how it works and its incentives. If environmentalists, Greenpeace included, understood how the market for Bitcoin mining works and what the PoW technology of Bitcoin can do for the energy industry they'd be singing the praises of mining and demanding more support for bitcoin mining. Instead they are attacking bitcoin out of ignorance.I can't really bad mad at them. It's just misinformation and lack of education on a subject very few people are educated on. Given the standard information that goes around on the internet about bitcoin mining this is the reaction I would expect of anyone. But we NEED to start getting people educated on how great bitcoin mining is for the world. Politicians are starting to actively attack Bitcoin mining now and we need to educate them before they actually start making bad anti-bitcoin laws out of ignorance and lack of education.The people who care about the environment would be more supportive of bitcoin than even the s**t people who don't care about the world, they just don't have the bitcoin education to know that their goals and bitcoin mining are aligned with one another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 26, 2023, 12:50:17 AMLast edit: March 26, 2023, 01:03:17 AM by franky1",
      "body": "Quote from: Lucius on March 25, 2023, 11:28:25 AMa big issue i always see in these debates are:1. the bitcoin hashing electric estimates in the examples like the one i quoted.. are extremely high compared to reality, its like they think majority of network are still using bad inefficient hardware made in 2016 but used in 2021-23.. (facepalm)2. nothing is mentioned about how much electric would have been used if there was no asic evolution. EG how much electric would be needed if the network was still ~320exa but done via CPU..not many people mention how asics have saved alot of electric3. altcoins like ethereum only have a crowd of 400,000 thus their CPU validation costs give a ethereum minting value at $35/coinimagine if ethereum have 100million users.. (250x electric cost)yep the cpu usage power of validators would exceed the 2mill bitcoin asic usage.. if ethereum ever got as popular as bitcoin. but stuck at CPU IN-EFFICIENCY ethereum would waste more electric per eth of their 'validator' stake system",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "March 26, 2023, 04:27:50 PM",
      "body": "The Skull of Satoshi is now a PoW defender!Artwork (copyright) by me.#EndTheFUD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lassdas",
      "created_time": "March 26, 2023, 04:56:30 PM",
      "body": "Quote from: macson on March 25, 2023, 05:55:29 PM.. what they are doing is a bad thing for bitcoin in the future because if the initial code is changed, ..There's no such thing as IF.People already changed the code, there are POS-versions of bitcoin out there,it's just that noone uses them, cuz...well, they suck.Greenpeace is asking for a change that already happened years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "March 28, 2023, 02:25:25 PM",
      "body": "Quote from: lassdas on March 26, 2023, 04:56:30 PMQuote from: macson on March 25, 2023, 05:55:29 PM.. what they are doing is a bad thing for bitcoin in the future because if the initial code is changed, ..There's no such thing as IF.People already changed the code, there are POS-versions of bitcoin out there,it's just that noone uses them, cuz...well, they suck.Greenpeace is asking for a change that already happened years ago.then we can all predict that Greenpeace is the party paid by a group to attack bitcoin on the grounds that bitcoin is not environmentally friendly and bad for the future of the environment because it has not changed the code.the skull campaign made by Greenpeace seems to have failed and instead, it became a counterattack for them lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 28, 2023, 03:31:38 PM",
      "body": "Quote from: macson on March 25, 2023, 05:55:29 PMi always remember this news,---QuoteGreenpeace accepted Bitcoin donations for seven years between 2014 and May 2021 before announcing it was halting the acceptance of Bitcoin donations, citing environmental concerns. Around the same time, Tesla CEO Elon Musk stopped accepting Bitcoin payments for Tesla vehicles.So it only took them 7 years to realize that they were wrong, and I sincerely doubt that they came to that conclusion on their own - because all those who still think that Mr. Mars did something good for Bitcoin, well look at how much damage he actually did with his idiotic statements about how bad Bitcoin is for the environment. I'm sure that at that time, under the influence of his statements, many people came to believe that Bitcoin is actually something bad, and unfortunately most still think so today.And all this came from a man who fights for a \"green planet\" while at the same time buying cobalt from African mines where children work for $1 or $2 a day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "March 29, 2023, 06:21:37 AM",
      "body": "Quote from: Lucius on March 28, 2023, 03:31:38 PMQuote from: macson on March 25, 2023, 05:55:29 PMi always remember this news,---QuoteGreenpeace accepted Bitcoin donations for seven years between 2014 and May 2021 before announcing it was halting the acceptance of Bitcoin donations, citing environmental concerns. Around the same time, Tesla CEO Elon Musk stopped accepting Bitcoin payments for Tesla vehicles.So it only took them 7 years to realize that they were wrong, and I sincerely doubt that they came to that conclusion on their own - because all those who still think that Mr. Mars did something good for Bitcoin, well look at how much damage he actually did with his idiotic statements about how bad Bitcoin is for the environment. I'm sure that at that time, under the influence of his statements, many people came to believe that Bitcoin is actually something bad, and unfortunately most still think so today.And all this came from a man who fights for a \"green planet\" while at the same time buying cobalt from African mines where children work for $1 or $2 a day. mr. mars joined the green planet campaign so that the battery cars he sells are selling well in the market lolpaid group greepeace continues to claim that bitcoin mining is one of the causes of the worst environmental damage on this planet but what about nickel and cobalt mining (as you say) don't these mines destroy the environment and give heavy pollution.QuoteNickel mining: the hidden environmental cost of electric carsNickel is a key element of electric vehicles — but mining it takes an environmental tollCobalt Mining: The dark side of the renewable energy transitionThe Dark Side of Congo’s Cobalt Rushhey greenpeace do you close your eyes to all this shit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}