{
  "id": "topic_5453300",
  "title": "Bureau",
  "author": "Bureau",
  "created_time": "May 19, 2023, 02:16:36 PMLast edit: May 19, 2023, 02:28:13 PM by Bureau",
  "content": "Today's downtime which according to me was for a few hours, created a panic among a lot of users. Considering how a famous Bitcoin Mixer was shut down suddenly and next, we read that MODS are not supposed to join the Bitcoin mixture signature campaign. This panic is justified, don't you think so? What happened in the past doesnot matter. What happened today after a sudden closure of a campaign promted me to check the official Twitter handle. After 2018 there were none as in tweets from the official handle. Considering the amount of time, the  forum was down. Rather, keeping users questioning, who are active, engaged, and were concerned of this situation. I think it is the right time to activate the Twitter handle active. That will relax a lot of members. If the handle does not get activated then according to Mr. Doge Twit who owns the platform, inactive users will now get their accounts disabled. The last tweet from the official Twitter handle of Bitcointalk was in 2018. If another tweet does not come up then the only official handle will get disabled. Can @theymos look into reactivating Twitter?Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453300",
  "comments": [
    {
      "author": "Fiatless",
      "created_time": "May 19, 2023, 02:33:51 PM",
      "body": "I just went through the Twitter page of the forum and I discovered that most of the tweets there are related to denial-of-service attacks. Maybe what we experience today is not a DDoS attack but another kind of network problem, so nothing to worry about. I also guess that this forum is not social media savvy which is why it's Twitter and other social media account is not bubbling with activities. I was also concerned about today's downtime because it lasted for a long time. If the administrators are not comfortable with social media, it will not be a bad idea to devise other means of reaching out to members in times of emergencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 19, 2023, 02:35:50 PM",
      "body": "You arose good point here mate. In fact i was not even aware of a twitter handle of bitcointalk as there is no activity since 2018 maybe that's why. I was writing a post and when i refreshes another page, website was down, well, i was able to copy the post so that I don't have to write it again. Well, then i waited for it's retrieval. Point is, if we have another way to get notifications of such incidents we will remain calm as today show has really scared me, (for a reason).I hope the moderators of this platform still have access to this twitter handle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 19, 2023, 02:50:44 PM",
      "body": "All he has to do is regularly use Twitter while signed in with the Bitcointalk twitter handle. He doesn't necessarily have to tweet regularly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "May 19, 2023, 03:10:20 PM",
      "body": "Quote from: Bureau on May 19, 2023, 02:16:36 PMCan @theymos look into reactivating Twitter?Thanks.I remember I had seen a similar topic a couple of months ago. It was BlackBoss_ who tried to get attention from theymos and created this thread; theymos! Please use the forum account on Twitter to tweet. I don't think theymos is interested in reacting the Twitter account anymore. Or maybe he logged in to the account and did not write anything. Quote from: NotATether on May 19, 2023, 02:50:44 PMAll he has to do is regularly use Twitter while signed in with the Bitcointalk twitter handle. He doesn't necessarily have to tweet regularly. Is it possible to see the last online of a Twitter account? I don't know. I am not familiar with Twitter. However, some prominent members deleted their Twitter account instead of keeping it active, and they don't see it as an essential thing to keep the forums Twitter account active.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 19, 2023, 04:46:41 PM",
      "body": "Quote from: Learn Bitcoin on May 19, 2023, 03:10:20 PMQuote from: NotATether on May 19, 2023, 02:50:44 PMAll he has to do is regularly use Twitter while signed in with the Bitcointalk twitter handle. He doesn't necessarily have to tweet regularly. Is it possible to see the last online of a Twitter account? I don't know. I am not familiar with Twitter. However, some prominent members deleted their Twitter account instead of keeping it active, and they don't see it as an essential thing to keep the forums Twitter account active. You can't see the last login date at all, period.The concern is not so much of the handle getting deleted as it is the capability fora bad actor to use the handle for malicious purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theymos",
      "created_time": "May 19, 2023, 05:33:12 PM",
      "body": "I logged into the account about a week ago to keep it active. If I have to keep doing this all the time, then I'll probably just let it expire, since it hasn't been used in a long time anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RickDeckard",
      "created_time": "May 19, 2023, 05:43:10 PM",
      "body": "Quote from: theymos on May 19, 2023, 05:33:12 PMI logged into the account about a week ago to keep it active. If I have to keep doing this all the time, then I'll probably just let it expire, since it hasn't been used in a long time anyway.I might be thinking this wrong, but considering how good the alias is (@bitcointalk), wouldn't it be considered a smart move to just keep signing in the account just to prevent for it to fall in the wrong hands in the future? I don't know how Twitter considers dealing with these accounts, but if they disable the accounts, won't the alias be available to be used after some time?My only concern is having this alias available in some years from now and eventually someone ill-intentioned will start using it to trick some unaware twitter users, while using our forum as a bait. It's true that we can't prevent that today - with alias such as @bitcointalkorg or something like that - but if we could avoid this one to fall in the wrong hands, that would be great from my perspective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "May 19, 2023, 05:55:17 PM",
      "body": "Because social media like Twitter is not bigger and wider than the bitcointalk.org forum regarding the benefits that a newbie like me can get in learning bitcoin through the discussions that occur.theymos right. If there were voting to choose, I would choose the bitcointalk forum instead of having to activate a twitter account.The point of discussing bitcoin in forums is not on platforms like Twitter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "May 19, 2023, 07:06:21 PM",
      "body": "Quote from: theymos on May 19, 2023, 05:33:12 PMI logged into the account about a week ago to keep it active. If I have to keep doing this all the time, then I'll probably just let it expire, since it hasn't been used in a long time anyway.Uhhh, sir Theymos... We don't need to let things be - for the fact that we can't change them - atleast, alot could be done since we can control them too.Is it not necessary for the forum growth and some subsequential enablement?? C'monnnn, I'm seeing Twitter the same way I see 'em lame social platforms,.. the likes of FB and the rest. It could rehabilitate a part of the forum's Treasury in time to come and also, make prevalent, the happenings in here.Sandra 🧑‍🦰",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "May 19, 2023, 07:43:12 PM",
      "body": "Quote from: theymos on May 19, 2023, 05:33:12 PMI logged into the account about a week ago to keep it active. If I have to keep doing this all the time, then I'll probably just let it expire, since it hasn't been used in a long time anyway.I guess letting it die away but securely protected against hackers' access with 2AF security will serve the best in keeping the account secured while being inactivee,  until it get disabled if Twitter operators deemed it necessary. I am not sure it worth it keeping the handle active considering how centralized the platform have become lately. Quote from: NotATether on May 19, 2023, 04:46:41 PMYou can't see the last login date at all, period.The concern is not so much of the handle getting deleted as it is the capability fora bad actors to use the handle for malicious purposes.I guess a good number of forum members are careless about whether or not the forum Twitter handle gets deleted or not,  not as if most forum user used that as a source of information anyways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "May 19, 2023, 09:49:49 PM",
      "body": "Quote from: Bureau on May 19, 2023, 02:16:36 PMCan @theymos look into reactivating Twitter?Thanks.We just experienced downtime hours ago so we still need other platforms to give the latest updates about downtime or attack, I understand there's a privacy concern but one of the staff can handle this on behalf of Theymos we all know that Twitter is application-based and users can set up a notification coming from a Twitter handle that he's following, not that we need Twitter but we can use it for notifications for important events or updates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "May 20, 2023, 12:08:56 AM",
      "body": "Quote from: theymos on May 19, 2023, 05:33:12 PMI logged into the account about a week ago to keep it active. If I have to keep doing this all the time, then I'll probably just let it expire, since it hasn't been used in a long time anyway.Please don't let it expire; instead, give it to me to manage for free. I'll pay for Twitter Blue out of my own pocket to keep it active; simply logging in without posting anything will not prevent it from being deleted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "May 20, 2023, 04:06:41 AM",
      "body": "theymos! Please use the forum account on Twitter to tweetThe forum hosts some contests like Pizza Baking, Cake Baking, Halving contests. I think those contests are great chances to tweets.It will help with many benefit: forum account on Twitter won't be expired. Forum can attract new users, gain traffics. Not all new members will be cool but we can turn some of them to forum assets.Chance to make Bitcointalk.org great again.Like yesterday downtime, that Twitter account can make a tweet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "May 20, 2023, 07:17:51 AMLast edit: May 20, 2023, 07:28:41 AM by un_rank",
      "body": "Quote from: Josefjix on May 20, 2023, 12:08:56 AMsimply logging in without posting anything will not prevent it from being deleted.It will. Being logged in counts as an active account and you do not even need to do that too frequently, logging on every 3-6 months is enough to prevent the account from being deleted.Quote from: theymos on May 19, 2023, 05:33:12 PMI logged into the account about a week ago to keep it active. If I have to keep doing this all the time, then I'll probably just let it expire, since it hasn't been used in a long time anyway.Are there any plans for the twitter account or do you consider giving it to someone else to manage at any time in the future? There are users with enough time to spare and experience to manage the twitter account and that would make one less thing for the admin to think about.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "May 20, 2023, 10:22:42 AM",
      "body": "Quote from: un_rank on May 20, 2023, 07:17:51 AM~snip~Are there any plans for the twitter account or do you consider giving it to someone else to manage at any time in the future? There are users with enough time to spare and experience to manage the twitter account and that would make one less thing for the admin to think about.This could indeed be a good idea, but I don't think theymos would let anyone else get access to that account. I think it would be beneficial if theymos logged in occasionally to keep the Bitcointalk Twitter account active and prevent it from being deleted. Since the account has the original name it would be unfortunate if it were to be deleted and someone else took advantage of the name for malicious purposes. imho, it is advisable to ensure the account remains active and protected from deletion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "May 20, 2023, 10:27:45 AM",
      "body": "Quote from: theymos on May 19, 2023, 05:33:12 PMI logged into the account about a week ago to keep it active. If I have to keep doing this all the time, then I'll probably just let it expire, since it hasn't been used in a long time anyway.Instead of letting it expire, handover the credentials to one or two trusted members who will be interested to keep the account active always and perhaps makes regular updated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "May 20, 2023, 10:37:50 AM",
      "body": "Quote from: theymos on May 19, 2023, 05:33:12 PMI logged into the account about a week ago to keep it active. If I have to keep doing this all the time, then I'll probably just let it expire, since it hasn't been used in a long time anyway.I do not think it is a good idea to let the only official Twitter handle to get deleted. A tweet once in while will be considered as active. Keep it only to inform the community if any serious issue arises like the downtime that happened yesterday. You do have the option of giving it's credentials to someone you trust. That person can keep it active by tweeting once in a while.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 20, 2023, 10:56:29 AM",
      "body": "Honestly, this is the first time I visit the forum's Twitter, there doesn't seem to be any activity since 2018.Of course, it is necessary for an important forum to have an official Twitter account to publish important announcements and updates, but for problems related to the work of the forum, I remember that in other forums there are system notifications in the event of any emergency problem or the like.I think it's good to have a system like this that pops up for users to let them know about forum related issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 20, 2023, 02:14:18 PM",
      "body": "Quote from: un_rank on May 20, 2023, 07:17:51 AMQuote from: Josefjix on May 20, 2023, 12:08:56 AMsimply logging in without posting anything will not prevent it from being deleted.It will. Being logged in counts as an active account and you do not even need to do that too frequently, logging on every 3-6 months is enough to prevent the account from being deleted.It has to be done every 30 days because that's the expiration period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}