{
  "id": "topic_5441252",
  "title": "dewilliams",
  "author": "dewilliams",
  "created_time": "February 25, 2023, 07:59:36 PM",
  "content": "How is our environment??Some sickness we get aren't because of spiritual problems,but the kind of environment we live inIn some places it's a crime to keep our environments unkept ,you will hardly see the environment disorganized,why because some people or authorities made it a ruleWe should take time and check our environment let me name some disadvantages of unkept and dirty environment1_ you know what they call snakes 🐍?? We don't want to get visited by them ,2_illness like I mentioned at first, always falling iLL for no good reason, you see the air we breathe,it means alot ,we shouldn't live at polluted areas too,our health counts ☺️, the air you breathe is very important, expectially pregnant women ,perhaps the reason why some children has bad odour is because of the kind of environment the parents live and breath too,😅😅😅Let's vibe and talk 😊 I need ur opinion too",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441252",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "February 28, 2023, 10:20:53 PM",
      "body": "I mean, I am kind of sure there must be some studies which indeed shows that the state of our surroundings can have both positive and negative effects onto our mental and physical well-being.However, it would be easier to talk about this matter if you explained it from a political/societal, otherwise, it feels rather off-topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 01, 2023, 03:00:14 PM",
      "body": "How will you expect someone who is not neat to himself to live in a neat and tidy environment, we have to understand that this all begins with our personal hygiene, some people were so dirty that they cannot take their bath a day or brush their teeth not to talk of changing their dirty clothes they always put on, how will their environment be, i dirty environment will definitely abhor dangerous animals like snakes and scorpion, we have to inculcate a good environmental sanitation for the well-being of the living lives that dwell in the environment we lived in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "March 01, 2023, 03:43:15 PM",
      "body": "Quote from: dewilliams on February 25, 2023, 07:59:36 PMHow is our environment??Some sickness we get aren't because of spiritual problems,but the kind of environment we live inIn some places it's a crime to keep our environments unkept ,you will hardly see the environment disorganized,why because some people or authorities made it a ruleWe should take time and check our environment let me name some disadvantages of unkept and dirty environment1_ you know what they call snakes 🐍?? We don't want to get visited by them ,2_illness like I mentioned at first, always falling iLL for no good reason, you see the air we breathe,it means alot ,we shouldn't live at polluted areas too,our health counts ☺️, the air you breathe is very important, expectially pregnant women ,perhaps the reason why some children has bad odour is because of the kind of environment the parents live and breath too,😅😅😅Let's vibe and talk 😊 I need ur opinion tooI am concerned about air pollution because it affects me negatively. Some persons smoke cigarettes indiscriminately without considering the environmental consequences or the harm it cause to the next person. I was in a meeting and the chairman of the council smoked up to three sticks of cigarettes and I was almost suffocating but I couldn't complain because others kept silent. The next meeting he wanted to do the same thing and I told him to step outside and smoke his cigarettes which he gladly did.My country is a dumping ground for outdated cars and electronic devices that pollutes the environment. Most fumes produced by these old model and unserviced vehicles is having negative effect on the environment. Instable power supply has also led to an increase in the use of generators, thereby harming the environment.These environmental pollutants have contributed to increase in health issues like cancer, respiratory problems, heart infection and child mortality rate. I wish to relocate to a more environmentally friendly country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flydolphine",
      "created_time": "March 02, 2023, 10:01:54 AM",
      "body": "The first step to help our environment is \"taking action\".let's together fight global warming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "March 02, 2023, 12:07:38 PM",
      "body": "Quote from: Hispo on February 28, 2023, 10:20:53 PMI mean, I am kind of sure there must be some studies which indeed show that the state of our surroundings can have both positive and negative effects  on our mental and physical well-being.However, it would be easier to talk about this matter if you explained it from a political/societal, otherwise, it feels rather off-topic. What kind of positive effect does an unkept environment or we are just being sarcastic: But then if we can give it a scientific analysis of the danger of an unkept environment we will discover that the need to establish a political institution to deal with environmental pollution at the national and global level can not be over-emphasized at the moment. There is a need to develop a scientific mechanism that will allow for the easy conversion of this waste into other profitable products. The above-mentioned and bolded reason is the only positive use of waste materials and other human pollution activities that affect the environment, but then there is other pollution that is totally waste, take oil exploration and it resultant environmental polluting in some palaces around the world where crude oil is drilled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 02, 2023, 01:50:32 PM",
      "body": "Quote from: Flydolphine on March 02, 2023, 10:01:54 AMThe first step to help our environment is \"taking action\".let's together fight global warming.Lot of human activities constitute to tue effect of global warming, we need to caution how we engage the use of polluting agent in rendering the environment unfit for living, especially through the release of toxic chemicals like carbon monoxide and other harzards from human activities such as incomplete fuel combustion, refinery waste, degraded chemical waste and so on, they all affect the ozone layer and environmental safety because they can cause loss of life on a short or long term effect when introduced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "March 02, 2023, 04:41:27 PM",
      "body": "Yes, everything around us in our environment is polluted, water, air, soil, food and everything, but what should be done?This is what they call the tax of civilization, progress and technology, because of the quality of life and modern luxury in which we live, we are forced to bear these pollutants that fill our environment.Even the countryside which was previously innocent of pollution and had clean air and water is now polluted because of the manure, hormones and other things that they use to get abundant agricultural products in a short time.In short, our whole life is polluted and it is difficult to get out of this circle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}