{
  "id": "topic_5459300",
  "title": "waybesuricata",
  "author": "waybesuricata",
  "created_time": "July 10, 2023, 10:28:50 AM",
  "content": "Sevgili Binancians,Binance, Binance Launchpad'deki 32. proje olan Arkham (ARKM)'ı duyurmaktan heyecan duyuyor (Web sayfasının tahmini olarak 4 saat içinde kullanılabilir olacağı beklenmektedir). Arkham için token satışı, Launchpad abonelik formatını takip edecek ve kullanıcı BNB bakiyelerinin kaydedilmesi 2023-07-11 00:00 (UTC) tarihinde başlayacak.Binance, kullanıcı BNB bakiyelerini 2023-07-11 00:00 (UTC) ile 2023-07-17 00:00 (UTC) arasında altı gün boyunca kaydedecektir. Her kullanıcının son BNB tutarı, altı günün ortalaması olarak belirlenecek ve daha önce burada duyurulan Günlük Ortalama BNB Bakiye hesaplaması kullanılacaktır.ARKM Token Satışı Detayları:Token Adı: Arkham (ARKM)Launchpad Hard Cap: 2,500,000 USDKullanıcı Başına Hard Cap: 15,000 USD (300,000 ARKM)Toplam Token Arzı: 1,000,000,000 ARKMBinance Launchpad'e Tahsis Edilen Toplam Token: 50,000,000 ARKM (Toplam Token Arzının %5'i)Halka Arz Token Fiyatı: 1 ARKM = 0.05 USD (BNB fiyatı abonelik öncesinde belirlenecektir)Token Satış Formatı: AbonelikDesteklenen Oturumlar: Sadece BNBAbonelik Zaman Çizelgesi:Hazırlık Dönemi 2023-07-11 00:00 (UTC) ile 2023-07-17 00:00 (UTC): Bu süre boyunca, kullanıcı BNB bakiyeleri altı günlük bir dönem için saatlik anlık görüntülerle hesaplanacaktır. Bu altı gün boyunca ortalama günlük BNB bakiyeniz, daha sonra taahhüt edebileceğiniz maksimum BNB miktarını belirleyecektir.Abonelik Dönemi 2023-07-17 06:00 (UTC) ile 2023-07-18 06:00 (UTC): Bu saatte tüm uygun kullanıcılar için abonelik açılacak. Kullanıcılar, BNB taahhüt etmeden önce Token Satın Alma Sözleşmesini imzalamalıdır. Lütfen taahhüt ettikten sonra BNB'niz kilitlenecek ve son token dağıtımına kadar transferler, çekimler veya ticaret gibi başka işlemlere erişim veya bunları geri alamayacağınızı unutmayın.Hesaplama Dönemi 2023-07-18 06:00 (UTC) ile 2023-07-18 07:00 (UTC): Abonelik kapanır ve token tahsis hesaplaması başlar.Son Token Dağıtımı 2023-07-18 07:00 (UTC): Son token tahsisi hesaplanacak ve ilgili BNB miktarı kilitli BNB bakiyenizden düşülecektir. Düşüldükten sonra ARKM ve BNB token'ları spot cüzdanınıza aktarılacaktır.Arkham (ARKM) hakkında daha fazla bilgi edinmek için, Binance Research'in detaylı raporunu buradan okuyabilirsiniz.Kaynak: https://www.binance.com/tr/support/announcement/introducing-the-arkham-arkm-token-sale-on-binance-launchpad-6ad1921b56fb4b369f9cf3e4449e62e2",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459300",
  "comments": [
    {
      "author": "kriminall",
      "created_time": "July 10, 2023, 08:55:01 PM",
      "body": "Herkese bol kazançlar dilerim, umarım Arkham herkes için kaliteli olur ama böyle satışlarda BNB’yi götürenler, balinalar kazanıyor, küçük yatırımcının hiç şansı yok, bu açıdan düşünürsek sistemin bazı yerlerde yanlışlarını tespit edip değişime gitmesi gerekiyor bence, balinalara gitmesi CZ’yi rahatsız etmiyorsa elbette böyle bir çalışma yapmazlar,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriptobaron",
      "created_time": "July 10, 2023, 09:45:34 PM",
      "body": "Sanırım Airdrop atacak bu proje.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "July 11, 2023, 09:05:08 PM",
      "body": "Quote from: kriminall on July 10, 2023, 08:55:01 PMHerkese bol kazançlar dilerim, umarım Arkham herkes için kaliteli olur ama böyle satışlarda BNB’yi götürenler, balinalar kazanıyor, küçük yatırımcının hiç şansı yok, bu açıdan düşünürsek sistemin bazı yerlerde yanlışlarını tespit edip değişime gitmesi gerekiyor bence, balinalara gitmesi CZ’yi rahatsız etmiyorsa elbette böyle bir çalışma yapmazlar, 3 BNB ile girdiğim Launchpadlerden ortalama olarak 20 dolarlık token kazandım ama BNB dalgalanmalarından dolayı bakiyem dolar bazında hep azaldı. BNB'yi ucuzken alıp tutanlar kazanmış. Tabii şimdi BNB alanlar da kazanabilir ama riski daha çok benim hesaplamalarıma göre. Mesela ilk risk değerlendirmeme göre diğer coinler kadar değer kaybetmemiş ayı sezonunda. Diğer coinler kadar değer kaybederse daha fazla dip fiyatları görebiliriz. İkinci olarak, SEC ve Binance arasında bazı sorunların olduğunu biliyoruz. Ani ve olumsuz gelişmeler yaşanabilir bu konuda. Binance borsasını sevenler çok ama BNB coin ve Binance Launchpadler bana çok mantıklı gelmiyor. Yüklü BNB'si olanlar ve daha ucuz alanlar için öyle değildir tabii.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "July 11, 2023, 09:13:39 PM",
      "body": "Quote from: kriptobaron on July 10, 2023, 09:45:34 PMSanırım Airdrop atacak bu proje.Büyük ihtimalle airdrop olacak.. Twitter'da ki airdrop kovalayan epey kişi twit attı proje ile alakalı. Arkm daha önce mail bırakanlara airdrop ile alakalı mail göndermis galiba. Ben öyle anladım.Şahsi fikrim piyasalar bu halde iken BNB'nin değeri artacak. Launch olaylarında kişi başı düşen tokenin çok olacağını zannetmiyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gramble",
      "created_time": "July 12, 2023, 07:01:42 AM",
      "body": "Alımın sadece bnb ile olması bnbde yukarı yönlü bir fiyat hareketi oluşturacaktır. 12 hazirandan beri 3. Kez dirençten dönmüş belki de bu token satışı için bnb alımlarıyla direnci aşarak yukarı gider. Ama işin özünde yine ballı kaynağı balinalar yiyor. Sana bana da kazanın dibinden sıyırabildiğimiz kadar kalıyor. Herkes için hayırlı olsun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "waybesuricata",
      "created_time": "July 12, 2023, 08:33:26 AM",
      "body": "Bir kaç gündür Arkham (ARKM) airdrop'u konuşuluyor twitter'da, herkes link paylaşımı yapıyor  sanırım 8 temmuzda snapshot alınmış, ben girmemişim kaçırmışız. Bakalım ne kadarlık bir airdrop olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 14, 2023, 08:17:47 AM",
      "body": "Eskiden üye olanlara airdrop atacaklar ve airdrop için adres istiyorlardı en son. 0 puanlı eski kayıtlı hesaplar OTC'de 500 dolardan satılıyormuş",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "waybesuricata",
      "created_time": "July 14, 2023, 11:21:28 AM",
      "body": "@mandown çok iyi ya 500 dolar hocam   dediğim gibi kaçırmışım ben üye oldum diye hatırlıyordum ama olmamışım. Bir kaç mailden girmeyi denedim giremedim  neyse bakalım nasıl bir airdrop gelecek",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 14, 2023, 12:38:36 PM",
      "body": "Quote from: mandown on July 14, 2023, 08:17:47 AMEskiden üye olanlara airdrop atacaklar ve airdrop için adres istiyorlardı en son. 0 puanlı eski kayıtlı hesaplar OTC'de 500 dolardan satılıyormuş8 temmuzdan önce üye olanlara airdrop atılacağı söylentisi var evet. Fakat ben bir türlü adres ekleme bölümünü bulamadım. Adresin nereye ekleneceğini veya, gönderileceğini bilen arkadaşlar açıklama yaparsa sevinirim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "July 14, 2023, 07:01:51 PM",
      "body": "Quote from: zonefloor on July 14, 2023, 12:38:36 PMQuote from: mandown on July 14, 2023, 08:17:47 AMEskiden üye olanlara airdrop atacaklar ve airdrop için adres istiyorlardı en son. 0 puanlı eski kayıtlı hesaplar OTC'de 500 dolardan satılıyormuş8 temmuzdan önce üye olanlara airdrop atılacağı söylentisi var evet. Fakat ben bir türlü adres ekleme bölümünü bulamadım. Adresin nereye ekleneceğini veya, gönderileceğini bilen arkadaşlar açıklama yaparsa sevinirim. Bu sayfaya https://platform.arkhamintelligence.com/invite girince  \"INVITE DASHBOARD\" yazan yerin hemen altında \"YOUR AIRDROP ADRESS\" bir kutucuk var. Oraya eth adresinizi yazıp kayıt etmelisiniz. Yalnız şu var. Bekleme listesine kaydolup mail doğrulayanlara + invite linkinden üye yapıp puanı olanlara çıkıyor bu kutu. Maalesef herkese açık değil.@Jossque arkadaşımız 26 Şubat'ta paylaşmıştı. İlgili link: https://bitcointalk.org/index.php?topic=5407962.msg61822041#msg61822041Sadece bekleme listesine katılmışım. Puanım 0. Airdropdan bir şeyler kazanırsak çok mutlu olurum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 14, 2023, 07:46:44 PM",
      "body": "Quote from: Cacabey_40 on July 14, 2023, 07:01:51 PMQuote from: zonefloor on July 14, 2023, 12:38:36 PMQuote from: mandown on July 14, 2023, 08:17:47 AMEskiden üye olanlara airdrop atacaklar ve airdrop için adres istiyorlardı en son. 0 puanlı eski kayıtlı hesaplar OTC'de 500 dolardan satılıyormuş8 temmuzdan önce üye olanlara airdrop atılacağı söylentisi var evet. Fakat ben bir türlü adres ekleme bölümünü bulamadım. Adresin nereye ekleneceğini veya, gönderileceğini bilen arkadaşlar açıklama yaparsa sevinirim. Bu sayfaya https://platform.arkhamintelligence.com/invite girince  \"INVITE DASHBOARD\" yazan yerin hemen altında \"YOUR AIRDROP ADRESS\" bir kutucuk var. Oraya eth adresinizi yazıp kayıt etmelisiniz. Yalnız şu var. Bekleme listesine kaydolup mail doğrulayanlara + invite linkinden üye yapıp puanı olanlara çıkıyor bu kutu. Maalesef herkese açık değil.@Jossque arkadaşımız 26 Şubat'ta paylaşmıştı. İlgili link: https://bitcointalk.org/index.php?topic=5407962.msg61822041#msg61822041Sadece bekleme listesine katılmışım. Puanım 0. Airdropdan bir şeyler kazanırsak çok mutlu olurum. Ben bekleme listesinden üye olmadım arkadaş doğrudan mail olarak üye yaptı beni. Puan var fakst o eksik bize sıkıjtı çıkarmaz umarım. Çünkü bende adres ekleme seçeneği görünmüyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 14, 2023, 07:53:49 PM",
      "body": "@Cacabey_40 sıfır puanım vardı ve bana açıktı sonra refle doldurduk tabikide .Sonradan üye olanlara adres kaydetme seçeneği malesef gelmiyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "July 14, 2023, 07:57:41 PM",
      "body": "Quote from: mandown on July 14, 2023, 07:53:49 PM@Cacabey_40 sıfır puanım vardı ve bana açıktı sonra refle doldurduk tabikide .Sonradan üye olanlara adres kaydetme seçeneği malesef gelmiyor.Evet sonradan katılanlara cüzdan kaydetme bölümü çıkmıyor. 8 temmuz öncesi kaydolanlara çıkıyor diye okumuştum. 0 puanı olanlara bir şeyler atarlarsa iyi olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 18, 2023, 08:28:02 AMLast edit: July 18, 2023, 09:26:27 AM by mandown",
      "body": "0 Puanı olanlar 197 arkham almış oldu şuan 11 dolar fee ile claim edilebilir durumda bakalım 0.5'den satabilirsek sadece kayıt olarak 100 dolara yakın bir para kazanmış olacagız.Not: Mexc'de listelendi ve 0.62 den gönderdim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "velbet",
      "created_time": "July 18, 2023, 02:56:33 PM",
      "body": "Ufak da olsa çorba parası çıktı. Teşekkürler bilgilendirme için.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}