{
  "id": "topic_5476967",
  "title": "jerry0",
  "author": "jerry0",
  "created_time": "December 07, 2023, 09:35:11 PM",
  "content": "So I'm curious.  Are there people here who bought btc or altcoins... but mainly the big altcoins like eth etc... that bought these coins years ago... let say at least 5 years ago or more and still haven't cashed any real profit at all?  Or is someone like that very rare?  Now let's say they might have cashed a few hundred dollars in profit at the most or 1000 dollars profit which isn't that much for at least 5 years.  Thus they haven't cashed out real big profit.  Are there many people that have say at least 3 or 5 or 10 btc or even more where they haven't cashed out profit at all and been in this for at least 5 years?  So if you bought that much btc back at least 5 years ago, you are in profit with the current prices today pretty much no matter what unless you bought at the peak.  And if so, what is the reasoning for these people?  Is it because they want enough to retire?  Enough to buy a house? They don't want to dip into their btc unless they absolutely have to? Now my other question is are there people that have say 10 btc or more even and are living paycheck to paycheck and have close to little in the bank but just pays their bills every month but just keep their btc as their life savings and rarely touch it unless you absolutely have to?  I got to assume very few people are like this right if they have say 10 btc or more?  Let's say whatever amount of money that person make a year and after taxes, they barely have enough to pay their living expenses and they are lucky to save even $1000 a year to put in the bank.  Let say this person has $5,000 in the bank only which isn't much for most Americans but then again, a good portion of Americans don't even have $1000 in the bank.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476967",
  "comments": [
    {
      "author": "jerry0",
      "created_time": "December 07, 2023, 09:36:05 PM",
      "body": "I could imagine there are people that are like this but almost all the majority of these are those who have a good or very well or high paying job and can pay their living expenses just fine?  Thus the same people that can put a lot of money in the stock market so these 3 or 5 or 10 or more btc isn't that big of a deal for them and it's basically a long term investment?But there has to be very little people that hasn't cashed out any decent profits if they have low income right and small amount of money in the bank?  Like are there people that have a low paying job and barely can pay their life expenses and what they make cover their expenses only and say they have $5,000 in the bank but this person might have something ridiculous like 10 btc or so?  Such that this person have 400k plus worth of btc but only 5k in the bank and their job only covers their life expenses and they might dip into their bank account savings a few hundred dollars a month maybe once or twice a year?  And say this person is still living in a cheap apartment and cheap with everything else.  Is someone like this rare?  However, I got to assume there are some long term btc holders that are like this?  Such that their goal might be okay they have 10 btc, they will cashout once btc is say 300k or so and cashout 1 or a few btc at once and then buy property and put some in banks for interest?  Thus they want to cashout only when they have enough to retire and don't even want to spend even 10% of their profits for a new car or to move to a nicer apartment for a year?  Do people like that exist?Now to take it to an extreme case, I got to assume that are very few people that are like what I described above but have more btc than that?  Let say a person has 25 btc and they also have 5000 dollars in the bank and their low paying job covers their life expenses only so they can't save much at all, say $1000 max a year.  Also this person lives in a cheap apartment and lives cheaply.  I got to assume someone like that rarely if ever exist or there are some people like that?  The thing is I heard many millionaires out there are very cheap.  But are there people that might have bought a total of 25 btc at 2k each for 50k total back years ago and have over a million dollars worth of btc and never cashed out any profiut or at most 1000 dollars profit and just have 5k in the bank while barely getting by with their low paying job?  I got to assume almost no one or know if anyone that would be like this if they were a long term btc holder?  The only way this would make sense is if this person already has a lot of money in the bank and in stocks and real estate and/or high paying job.  But if low income and owning no stocks or rental property and barely getting by, there are very few people like this?  Like imagine someone who lives in a van but has a lot of btc and just living as cheap as they can until btc hits the amount where they would then buy a house and just put all their money into savings account and live off the interest?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2023, 09:46:19 PM",
      "body": "i have coins from 1-11years agoi dont starve,.. instead i travel, i enjoy, i spend, i entertain, i dont need to spend huge amounts of coin, so why sell whole hoard earlyi have many stashes over time i keep separate and just use/spend/play with small amounts of a small stash for my lifestyleim comfy.. i dont struggle, worry or stress over finances",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "December 07, 2023, 11:27:35 PM",
      "body": "Quote from: franky1 on December 07, 2023, 09:46:19 PMi have coins from 1-11years agoi dont starve,.. instead i travel, i enjoy, i spend, i entertain, i dont need to spend huge amounts of coin, so why sell whole hoard earlyi have many stashes over time i keep separate and just use/spend/play with small amounts of a small stash for my lifestyleim comfy.. i dont struggle, worry or stress over financesThat's really great and I think you've made the right prediction about the growth of the bitcoin and other altcoins in a better way. Most of us used to be wrong and the same had made us not to hoard. Myself bought Ethereum when it was around $100, but I hadn't predicted well about the future. Sold it when it was around $220 and now how it had grown.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 07, 2023, 11:39:46 PM",
      "body": "Quote from: jerry0 on December 07, 2023, 09:35:11 PMAnd if so, what is the reasoning for these people?  Is it because they want enough to retire?  Enough to buy a house? They don't want to dip into their btc unless they absolutely have to? i think it depends on the age group if one is a bit on the older side, they might see bitcoin as a retirement plan these people mostly lived their life working and the money they earned from that were used to pay living expenses and maybe half of it went to bitcoin they now see bitcoin as the money they’re gonna use to live life after they stopped working however there are a wide range of investors even young adults are starting to invest early maybe they haven’t started working yet but investing in bitcoin is making them hope that they would not have to or maybe they would use the profit to pay for their education",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 07, 2023, 11:51:22 PM",
      "body": "Okay so you have coins from a while back.  You spend it but wouldn't need to if you didn't right?  Could you go into your bank savings for that or you don't want to do that?  You want to use some profits right?  The way you are talking, I assume you spent at least 1/3rd of your profits at least?But do you think there are people that might have a lot of btc but live real poor and just dip into their bank savings only when they have to?  I mean imagine someone with 5k in bank savings and low paying job where they make just enough to make their bills.  They also live in a cheap apartment and cheap with everything else.  But someone they might have say 10 btc or more saved up?  That would be a very extreme case right?  However, I think some people like this probably do exist?  I recall there was a show on tv named real cheapskates and you had millionaires who live like they are poor.  However, are there long term btc holders that have a good amount of btc now but still decide to live in a cheap apartment and have a low paying job where iot basically covers their life expenses?  Or that has to be very rare?  Imagine someone with 10 btc for many years but only cashed out maybe 1000 dollars profit total or less so basically almost nothing.  Would it be stupid for not cashing out anything because besides being able to say rent a better apartment, they could use a good portion and just put it in the bank to earn interest?  Then again you have people that say don't sell btc and selling it for fiat is bad since fiat is losing value?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "December 07, 2023, 11:54:07 PM",
      "body": "Quote from: jerry0 on December 07, 2023, 09:35:11 PMAre there many people that have say at least 3 or 5 or 10 btc or even more where they haven't cashed out profit at all and been in this for at least 5 years?  So if you bought that much btc back at least 5 years ago, you are in profit with the current prices today pretty much no matter what unless you bought at the peak.  And if so, what is the reasoning for these people?  Is it because they want enough to retire?  Enough to buy a house? They don't want to dip into their btc unless they absolutely have to? If there have been anyone who has kept holding his/her Bitcoin for quite this long period now without selling, I'm sure they should be on really good profit of their bitcoin investment. Because for example, if someone had invested in Bitcoin by this time last 3years (i.e December 2020) when the value of Bitcoin was still around $28k, while Bitcoin is currently $43k per BTC, he/she should have made $15k in profit.Likewise with someone might have invested in it 5 years ago (i.e December 2018) when BTC was still around $4k, and now Bitcoin is currently $43k per BTC, he/she would have made $39k In profit.Same as anybody who might have invested in it 10 years ago (i.e December 2013) when it's price was still $700 per BTC, by now he/she would have made a whopping $42,300 in profit for just mere buying BTC at this different time frames.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "December 07, 2023, 11:58:31 PM",
      "body": "There are still people who are not pulling out their Bitcoin investments even with the previous All time High. One reason I guess is believing that the price could still go higher which is really possible in the first place. In the long run, the direction still of its price is in upward motion which makes sense to think of such thing. There are just price corrections on smaller time frames and that is a normal thing to happen especially to an asset which market price' is controlled and dependent on demand. They would still be in profit for sure, it will just vary whether it would be smaller or bigger depending on when will they want to exit already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "December 08, 2023, 12:25:53 AMLast edit: December 08, 2023, 12:37:16 AM by famososMuertos",
      "body": "It is not feasible to want to change the thoughts of others, it is useless, but if you can change your actions, hence, generalizing the idea of what others do with their belongings (e.g. bitcoin), you only have to have a circumstantial reference; e.g.  there are people who love art and spend millions on a painting, some say \"I will never sell it\", perhaps as long as I live, but someone actually will, and that is the point, the individual behind their bitcoin does with your bitcoin.Then, that attitude will have its effect in the individual to his finances, whether in the short, medium or long term, but fortunately as we do not \"wait in line\" to know what decision this individual makes (in the case of owning bitcoin), we can make our decisions.Well, this is the case with bitcoin, the decisions depend on yourself, and it is not necessary to wait for anyone, it is not that you have to wait years as could happen with the painting mentioned in the previous example, to sell by... due to economic crisis, death, etc. consequently it finally It is for sale and you can access itFinally, the individual decisions of those holders do not matter, their decisions will not affect you unless, as sometimes happens, important movements are made by certain holders, but it does not matter in your context, since you want to discover why someone having 10 BTC,  they live like a salaryman.Seriously, that doesn't matter, the rest doesn't interest me, not to mention that with your personal financial life you can do whatever you want. What really involves us is the sale, the purchase, the hodl, what happens financially afterward with each of those actions is irrelevant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 08, 2023, 12:56:52 AM",
      "body": "Quote from: jerry0 on December 07, 2023, 11:51:22 PMOkay so you have coins from a while back.  You spend it but wouldn't need to if you didn't right?  Could you go into your bank savings for that or you don't want to do that?  You want to use some profits right?  The way you are talking, I assume you spent at least 1/3rd of your profits at least?Would it be stupid for not cashing out anything because besides being able to say rent a better apartment, they could use a good portion and just put it in the bank to earn interest?  Then again you have people that say don't sell btc and selling it for fiat is bad since fiat is losing value?  a third? nah i got more coin than your scenarios quote so no need to cash out so much to live on.. less than 1% is all i need to cover my lifestyle of early(very) retirement travel and entertainmenti dont cave dwell and just eat beans either.. i enjoy lifesince the invention of wireless internet decades ago. there is no reason to stay home. i can converse, commerce, commute and criticise from anywhere as for cashing out to earn bank interest pfft (facepalm) have you seen how crap bank interest isin just this last month bitcoin has seen a 36k -> 43k (19%) in one month.. try finding any bank that can do that even for 3 years.. let alone 1 monthas for your other scenarios of $5k in bank and living like a caveman.. i got more cash than your scenario suggests. and yes even with a large hoard. i would still buy in more coin every price dump(buy low, sell high).. (far better investment than bank interest)buying real estate or luxury cars is bad economics. my apartment/house is more then you envision. but i dont need a castle. id rather enjoy luxury travel of seeing new views instead of the same four walls, i spend more time away from home to not need a castle gathering dusti used to day trade to accumulate alot, taking low risk small profits repeatedly/rapidly and compound them. but now i just ride the longer waves to sell on the 1-4 year highs/ATH and taking small % for my lifestyle expense and then buy on following correction down to value(sell high buy low)i dont need to throw my whole hoard into an exchange i just use small % play money amounts per wave ridei am frugal. as i said there is no point buying a mansion or a lambo.. as thats just dumb money just to impress others.. then dumber to then need to waste dumb time to maintain and keep aesthetically pleasing to please others.. just dumb all round however i am excessive about the things i do care about like travel and entertainment, things that give me good experiences, memories and peace of mind enjoymentthey key to peaceful mindset, is to know you can afford anything you like, but not need or want to buy it. its actually more enjoyable this wayits actually fun going into a car dealership knowing you can buy a few cars in full upfront no finance.. but just browse and walk away knowing you dont need to buy it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "December 08, 2023, 01:38:11 AM",
      "body": "Quote from: jerry0 on December 07, 2023, 11:51:22 PMBut do you think there are people that might have a lot of btc but live real poor and just dip into their bank savings only when they have to?  I mean imagine someone with 5k in bank savings and low paying job where they make just enough to make their bills.  They also live in a cheap apartment and cheap with everything else.  But someone they might have say 10 btc or more saved up?  That would be a very extreme case right?  However, I think some people like this probably do exist?  I recall there was a show on tv named real cheapskates and you had millionaires who live like they are poor.  However, are there long term btc holders that have a good amount of btc now but still decide to live in a cheap apartment and have a low paying job where iot basically covers their life expenses?  Or that has to be very rare?  Imagine someone with 10 btc for many years but only cashed out maybe 1000 dollars profit total or less so basically almost nothing.  Of course there are people like that. I'm one. Most of the bitcoin I currently have was from when I loaded up at the bottom of the market in early 2019. So nearly all of the bitcoin I currently have was bought at about $3500/btc. Don't have my 2013/2014 bitcoin anymore, but still have a little bit of my 2017/2018 bitcoin. I only sold a few of my 2019 bitcoin, I think 3 or 4 btc, in 2021 to diversify into altcoins which well didn't work out lol, but most of the 2019 BTC I still have.I did sell some bitcoin twice this year to pay for a huge unexpected expense this summer and to pay for a vacation I'm going on in two days (woohoo!) because my bank account was only at ~$5000 but I needed a tropical island winter vacation haha. But those two bitcoin sales this year were taken from the bitcoin I bought earlier this year, not from the bitcoin I've been holding for years.And I live frugally. Some months I spend under $1000. In fact Sept, Oct, and Nov this year were all easily under $1000 spending if you don't count last month me buying the tickets and stuff for my upcoming vacation. I specifically chose to live a frugal but full-time traveling life for a while (I've always been frugal though) after I retired in my 30's in 2019 off of my Bitcoin so that I could allow my Bitcoin to grow immensely in value over time cuz well that was kinda needed since I was retiring so my bitcoin has gotta last me the rest of my life.I'm sure there are loads of people who have a lot of bitcoin, which may or may not have been considering a lot when they bought it, that they've been holding for years and have barely touched it. We all know bitcoin is going into 6 digits and eventually, perhaps in like 15-20 years, 7 digits. So unless you need the money or have a specific purpose for it (like say buying a house or selling during the bull market to buy back on the crash or whatever) it'd be pretty silly to sell bitcoin when it's only in the 5 digits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "December 08, 2023, 01:47:57 AM",
      "body": "Quote from: jerry0 on December 07, 2023, 09:35:11 PMSo I'm curious.  Are there people here who bought btc or altcoins... but mainly the big altcoins like eth etc... that bought these coins years ago... let say at least 5 years ago or more and still haven't cashed any real profit at all?  Or is someone like that very rare?  Now let's say they might have cashed a few hundred dollars in profit at the most or 1000 dollars profit which isn't that much for at least 5 years.  Thus they haven't cashed out real big profit.  They can have very strong belief and diamond hands with lot of patience to hold their coins for many years without selling. Another possibility is they lost access to those coins, lost forever. It can happen with both bitcoin and altcoins.You can see the HODL waves chart and make your estimations of those inactive coins that can be lost forever, part of those inactive ones.Bitcoin: Addresses Holding > X BTC by Year provides some more information too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 08, 2023, 02:08:15 AM",
      "body": "Quote from: CryptoHeadlineNews on December 07, 2023, 11:54:07 PMQuote from: jerry0 on December 07, 2023, 09:35:11 PMAre there many people that have say at least 3 or 5 or 10 btc or even more where they haven't cashed out profit at all and been in this for at least 5 years?  So if you bought that much btc back at least 5 years ago, you are in profit with the current prices today pretty much no matter what unless you bought at the peak.  And if so, what is the reasoning for these people?  Is it because they want enough to retire?  Enough to buy a house? They don't want to dip into their btc unless they absolutely have to? If there have been anyone who has kept holding his/her Bitcoin for quite this long period now without selling, I'm sure they should be on really good profit of their bitcoin investment. Because for example, if someone had invested in Bitcoin by this time last 3years (i.e December 2020) when the value of Bitcoin was still around $28k, while Bitcoin is currently $43k per BTC, he/she should have made $15k in profit.Likewise with someone might have invested in it 5 years ago (i.e December 2018) when BTC was still around $4k, and now Bitcoin is currently $43k per BTC, he/she would have made $39k In profit.Same as anybody who might have invested in it 10 years ago (i.e December 2013) when it's price was still $700 per BTC, by now he/she would have made a whopping $42,300 in profit for just mere buying BTC at this different time frames.Yes this is the examples I mean.  So imagine someone who bought a few btc like in the 3 examples you gave.  So it would be 15k per coin profit or 39k per coin profit or 42k per coin profit.  But let say they owned like 10 btc so you multiply it per coin.  So this person could have like 300k plus profit in btc or more.  However, let say this person didn't even cash out any of this 300k profit or maybe like 1k so not even 1% profit because they want to have the btc grow.  However... this same person have 5k in the bank total, low paying job and that job barely pays his living expenses such as rent and food and everything and live in a cheap apartment.  Are there people that are like this with the living conditions and the small amount of money in the bank account or not?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 08, 2023, 02:20:54 AM",
      "body": "Quote from: franky1 on December 08, 2023, 12:56:52 AMQuote from: jerry0 on December 07, 2023, 11:51:22 PMOkay so you have coins from a while back.  You spend it but wouldn't need to if you didn't right?  Could you go into your bank savings for that or you don't want to do that?  You want to use some profits right?  The way you are talking, I assume you spent at least 1/3rd of your profits at least?Would it be stupid for not cashing out anything because besides being able to say rent a better apartment, they could use a good portion and just put it in the bank to earn interest?  Then again you have people that say don't sell btc and selling it for fiat is bad since fiat is losing value?  a third? nah i got more coin than your scenarios quote so no need to cash out so much to live on.. less than 1% is all i need to cover my lifestyle of early(very) retirement travel and entertainmenti dont cave dwell and just eat beans either.. i enjoy lifesince the invention of wireless internet decades ago. there is no reason to stay home. i can converse, commerce, commute and criticise from anywhere as for cashing out to earn bank interest pfft (facepalm) have you seen how crap bank interest isin just this last month bitcoin has seen a 36k -> 43k (19%) in one month.. try finding any bank that can do that even for 3 years.. let alone 1 monthas for your other scenarios of $5k in bank and living like a caveman.. i got more cash than your scenario suggests. and yes even with a large hoard. i would still buy in more coin every price dump(buy low, sell high).. (far better investment than bank interest)buying real estate or luxury cars is bad economics. my apartment/house is more then you envision. but i dont need a castle. id rather enjoy luxury travel of seeing new views instead of the same four walls, i spend more time away from home to not need a castle gathering dusti used to day trade to accumulate alot, taking low risk small profits repeatedly/rapidly and compound them. but now i just ride the longer waves to sell on the 1-4 year highs/ATH and taking small % for my lifestyle expense and then buy on following correction down to value(sell high buy low)i dont need to throw my whole hoard into an exchange i just use small % play money amounts per wave ridei am frugal. as i said there is no point buying a mansion or a lambo.. as thats just dumb money just to impress others.. then dumber to then need to waste dumb time to maintain and keep aesthetically pleasing to please others.. just dumb all round however i am excessive about the things i do care about like travel and entertainment, things that give me good experiences, memories and peace of mind enjoymentthey key to peaceful mindset, is to know you can afford anything you like, but not need or want to buy it. its actually more enjoyable this wayits actually fun going into a car dealership knowing you can buy a few cars in full upfront no finance.. but just browse and walk away knowing you dont need to buy itOkay so you are one of those long term btc holders from way back in the day.  Okay so you didn't spend 1/3rd of your cryptocurrency profits but maybe 5%?  I'm confused when you say you only spent 1% of your profits and that is more than enough for you to spend on everything.  So that mean you own a lot of btc since you are older btc buyer and holder but you cashed out at least 5% of your current btc profit from your initial investment right?The thing is do you have a high paying job though?  Do you have a lot of income coming in that is not your job?  So if you had no btc, you have no problem paying your bills and everything and can still save?  You invest in stocks?  But how did you got the money to buy the stocks?  Was it from selling a tiny portion of your btc or was it from your job?  So profits spend on your tiny btc sell is entirely on vacations and things like that?  You say you use to daytrade a lot... you mean stocks?  Or you mean crypto or both?  Why you say cashing out some btc and putting it in the bank to earn interest is bad?  I get what you mean with well btc went up almost 19% in one month but that is rare.  Well if you cash out btc, let say someone cashed out say $13,000 worth of btc.  Let say after taxes, it's worth $10,000.  Well put that in the bank and you earn 5% or $500.  That isn't bad.  Of course you have to pay tax on that $500.  But say you cashout $130,000 worth of btc and say have $100,000 after taxes.  You would earn $5,000 a year in interest which is decent.  But if someone had say over $1 million dollars worth of crypto and say after taxes they get say $700,000.  Well if they put that in the bank and earn 5%, that's $35,000.  That same person's income could be easily less than that and with that, well they can move to a better apartment or buy a house.  The issue is if they cashout everything, well they have no btc left.  So you say nobody should cashout all their btc unless they have to right?  So it would make sense for people who are long term btc holders and haven't cashed out any real profit to keep holding and live like a caveman that has 5k in their bank account and a low paying job that pays just enough for their apartment and living expenses and thus they are in their cheap apartment etc?  Or you say for people like that, they should definitely cash out a little bit so they could at least have some extra spending money or be able to move to a better apartment where they pay say $500 or $1000 more in rent to enjoy that for a year or two with the anticipation that bitcoin will go higher as time goes up?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "December 08, 2023, 02:30:52 AM",
      "body": "I envy those who still haven't cashed out since they bought their Bitcoin or other altcoins that made it big like Ethereum, but if cashing out is what it takes to live a more beautiful life, why not? What's the point of hodling anyway if you remain working from 8 to 5 from Monday to Friday to be able to support your basic needs? That would be ridiculous. I still have my Bitcoin that I earned from years ago, even before Bitcoin reached its ATH. I have no plan to cash out for now, but it might come one day when Bitcoin reaches a certain price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 08, 2023, 02:34:52 AM",
      "body": "Quote from: thecodebear on December 08, 2023, 01:38:11 AMQuote from: jerry0 on December 07, 2023, 11:51:22 PMBut do you think there are people that might have a lot of btc but live real poor and just dip into their bank savings only when they have to?  I mean imagine someone with 5k in bank savings and low paying job where they make just enough to make their bills.  They also live in a cheap apartment and cheap with everything else.  But someone they might have say 10 btc or more saved up?  That would be a very extreme case right?  However, I think some people like this probably do exist?  I recall there was a show on tv named real cheapskates and you had millionaires who live like they are poor.  However, are there long term btc holders that have a good amount of btc now but still decide to live in a cheap apartment and have a low paying job where iot basically covers their life expenses?  Or that has to be very rare?  Imagine someone with 10 btc for many years but only cashed out maybe 1000 dollars profit total or less so basically almost nothing.  Of course there are people like that. I'm one. Most of the bitcoin I currently have was from when I loaded up at the bottom of the market in early 2019. So nearly all of the bitcoin I currently have was bought at about $3500/btc. Don't have my 2013/2014 bitcoin anymore, but still have a little bit of my 2017/2018 bitcoin. I only sold a few of my 2019 bitcoin, I think 3 or 4 btc, in 2021 to diversify into altcoins which well didn't work out lol, but most of the 2019 BTC I still have.I did sell some bitcoin twice this year to pay for a huge unexpected expense this summer and to pay for a vacation I'm going on in two days (woohoo!) because my bank account was only at ~$5000 but I needed a tropical island winter vacation haha. But those two bitcoin sales this year were taken from the bitcoin I bought earlier this year, not from the bitcoin I've been holding for years.And I live frugally. Some months I spend under $1000. In fact Sept, Oct, and Nov this year were all easily under $1000 spending if you don't count last month me buying the tickets and stuff for my upcoming vacation. I specifically chose to live a frugal but full-time traveling life for a while (I've always been frugal though) after I retired in my 30's in 2019 off of my Bitcoin so that I could allow my Bitcoin to grow immensely in value over time cuz well that was kinda needed since I was retiring so my bitcoin has gotta last me the rest of my life.I'm sure there are loads of people who have a lot of bitcoin, which may or may not have been considering a lot when they bought it, that they've been holding for years and have barely touched it. We all know bitcoin is going into 6 digits and eventually, perhaps in like 15-20 years, 7 digits. So unless you need the money or have a specific purpose for it (like say buying a house or selling during the bull market to buy back on the crash or whatever) it'd be pretty silly to sell bitcoin when it's only in the 5 digits.Okay so you are one of these people.  So you are a long term btc holder but not very long.  To me 5 years or more would be a long term holder.  Okay so you did sell btc to sell for a huge unexpected expense and for a vacation.  So is that a huge portion of the btc you have or not?  I mean I got to assume these two things is at least 10% of your life time btc profits total then?  Certainly 5% at least right?  So in other words, you wouldn't really fit into the category I am talking about because you spent more than $1,000 total profit from your btc right?  Okay so you say these two btc sales were taken from the btc you bought earlier this year and not from the ones from years ago.  Okay so those older btc you haven't spend much profit on it so you fit this criteria.You don't believe in cashing out a portion of your btc into cash and then putting a portion into the bank and earning 5% interest?  Do you also feel like the other poster that is stupid?  I'm curious but are you from the US or not?The thing is during this time entire, do you have a high paying job though?  Or you have medium income or low income playing job?  You sound like you have at least a medium income right where if you had no btc at all, you have no issues paying your living expenses without any issue?  By that, I mean paying your rent and food etc and not talking about vacations.  Thus you don't have like only 5k usd in the bank right and a cheap apartment and have to live cheaply?  Because if not, your situation is different than the situation I'm talking about.  I'm talking about like someone having 5k in the bank and a low paying job where it barely covers their rent and food and living expenses.  But this person could have 5 btc or 10 btc or even more.Yes there are lot of people that have a lot of btc.  However, I can't imagine someone who has lot of btc and still work a low paying job and only have 5k in the bank and live in cheap apartment and does everything cheap like a caveman right?  Like very few if any at all?  I mean I can imagine one with 1 btc doing that or 2 btc maybe... but anyone with 5 btc or more certainly isn't doing something like that right?The thing is the lot of people who have a lot of btc but also have a lot of money in the bank and lot of money in stocks and real estate, well they could have a ton of btc and never cashed out anything and it wouldn't affect these people because they are already rich without btc.  Like they are living in a nice apartment or house already and living pretty well.  So these people could dip into their bank account or sell some of their stocks and that is more than enough and don't even need to sell any btc.  I mean people who like a caveman with 5k and a job that barely pays their living expenses but just keeping their btc and not selling any.  That type of person is rare right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "December 08, 2023, 02:43:05 AM",
      "body": "Quote from: jerry0 on December 08, 2023, 02:34:52 AMI mean people who like a caveman with 5k and a job that barely pays their living expenses but just keeping their btc and not selling any.  That type of person is rare right?  That's not surprising. Almost everyone focuses on short-term problems instead of long-term profits that may or may not happen. Just think about it, why would somebody care if they can cash out $10k in 2 years or so if they can't even eat this month?Obviously, a smart person would not sell every BTC they have regardless of how difficult their life is, but survival comes first most of the time. I know some people use the money from selling BTC to get a better job or buy better working tools, so they can earn more and buy BTC again. But not everyone has this kind of tenacity and opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 08, 2023, 02:49:52 AMLast edit: December 08, 2023, 03:03:33 AM by franky1",
      "body": "Quote from: jerry0 on December 08, 2023, 02:34:52 AMyou are comparing bitcoin rate to bank interest......do you even do math2011-2013 (high to high) $30-$1200 =4000% / 2 years =2000% a year2013-2017 (high to high) $1.2k-$20k =1600% / 4 years = 400% a year2017-2021 (high to high) $20k-$70k =350% / 48month = 87% a yearand you want to compare it to bank interest of 5% PER YEARi have a lump of cash, but i dont think much for the bank interest.. yea its free money but when bitcoin dips to a nice price nearer to value, i prefer to put money in bitcoin on the low and take out on the rise (even though i have coin hoarded. i still like to take opportunities when the price is drop is right)i have spare play money amounts of coins i enjoy selling on a highi have spare play money amounts of fiat i enjoy buying on a lowi have hoards of coin i dont touch for longer periodsi have fiat holdings i dont touch for longer periodsas for advice for people on low incomes wanting to investif you are single (no spouse, no kids) so no dependants relying on your income. i would still not advice becoming a caveman living in squalor, just to invest everything..  but you would obviously have less dependants so have more excess/disposable income to invest without negatively affecting your lifeyes be frugal, by replacing some luxury brands with cheaper brands. but dont suffer, be more conscious of your spending. EG dont buy brand new cars to impress people. just buy a car that can get you from a-b.ask yourself will you really enjoy fast food delivery that just turns into a bowel movement tomorrow. or can you make something at home better and cheaperand yes keep enough bank balance to cover any emergency such as any home appliances that stop functioning or covering bills for a few months if suddenly unemployed, but dont cash out investments or save up enough cash just to hope you can get nice bank interest.. Quote from: jerry0 on December 08, 2023, 02:34:52 AM I mean people who like a caveman with 5k and a job that barely pays their living expenses but just keeping their btc and not selling any.  That type of person is rare right?  if they have been accumulating for many years. i see no sense in the binary(2 option) mindset of always hoard or always cash out.. personally i play the middle, of hoarding majority and cash out some to cover enjoyable life..i do see many people that do the extremes of the 2 options. some cash it all out and waste it on lavish lifestyle.. and their money is gonesome hoard and caveman live never cashing out even at a ATHbut smart people dont do the extremeshowever those that do hoard for plans of retirement when they get old. are no different then those who invest in pension plans.. but you shoud not suffer and live like a caveman while waiting to get old",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jerry0",
      "created_time": "December 08, 2023, 03:02:39 AM",
      "body": "Quote from: franky1 on December 08, 2023, 02:49:52 AMyou are comparing bitcoin rate to bank interest......do you even do math2011-2013 (high to high) $30-$1200 =4000% / 2 years =2000% a year2013-2017 (high to high) $1.2k-$20k =1600% / 4 years = 400% a year2017-2021 (high to high) $20k-$70k =350% / 48month = 87% a yearand you want to compare it to bank interest of 5% PER YEARi have a lump of cash, but i dont think much for the bank interest.. yea its free money but when bitcoin dips to a nice price nearer to value, i prefer to put money in bitcoin on the low and take out on the rise (even though i have coin hoarded. i still like to take opportunities when the price is drop is right)as for advice for people on low incomes wanting to investif you are single (no spouse, no kids) so no dependants relying on your income. i would still not advice becoming a caveman living in squalor, just to invest everything..  but you would obviously have less dependants so have more excess/disposable income to invest without negatively affecting your lifeyes be frugal, by replacing some luxury brands with cheaper brands. but dont suffer, be more conscious of your spending. EG dont buy brand new cars to impress people. just buy a car that can get you from a-b.ask yourself will you really enjoy fast food delivery that just turns into a bowel movement tomorrow. or can you make something at home better and cheaperand yes keep enough bank balance to cover any emergency such as any home appliances that stop functioning or covering bills for a few months if suddenly unemployed, but dont cash out investments or save up enough cash just to hope you can get nice bank interest.. So how much percent a year would a bank offer you in interest where you would say it's worth for you to take the interest?  At least 20% minimum?  You say you a lot of cash.  So you keep all that cash in a bank account right?  A checking account or a savings account?  I can't imagine you have a huge amount in checking account as oppose to savings account?  How much interest you get for it?  Okay so you now are still buying btc when it goes to a low price according to you?  Then you sell some of that once it hits a high price?  So you are trading btc now by on btc you buy recently and not your older btc right?I actually mean if someone is single and is living like a caveman and this same person bought btc years ago.  So imagine this person still has the same low income job where he barely pays his rent and living expenses but the amount of btc he bought back then years ago is worth a lot now where he could have 6 figures of btc in terms of fiat.  And say this caveman is still doing the same thing with his his low income job and cheap apartment etc.  And say this person probably sold maybe 1k worth of his btc profit at the most where he could have 6 figures in btc profit if he were to sell now.  Would you say this person a person like this with only 5k in the bank which isn't even going to cover any emergency would be foolish to not sell any btc at all from the btc he bought years ago.  Thus this same person wants to hold the btc where his total btc balance goes to 7 figures first or would you say that is beyond stupid for someone like that?  Most importantly, could you imagine there being people like thie extreme example or not?  Imagine 5k in the bank, low paying job where they can barely pay their rent and food and expenses.  They also live in a cheap apartment.  But this person could have say 5 or 10 btc or even more and they are just holding it and not cashing out anything and living like a caveman.  What you say about that and do people like thie exist?  I mean... like this person could cash out some btc and well move to a nice apartment to live for at least a year or two to enjoy it right?  Or you say that is stupid?  Say they also continue their low income job but at least they move to a better apartment.  What are your thoughts on this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 08, 2023, 03:07:25 AMLast edit: December 08, 2023, 03:20:36 AM by franky1",
      "body": "id say to that person.. stick to economic logic..buy low sell highwe are at mid point of 4 year ATH cycle. its a little too early to cash out even $1k just to then sit in a bank account earning 5%best thing is to only cash out if you are in profit. and only if you have true emergency need if it is not a ATH cycle yearwhen a ATH happens. then evaluate how much you want to cash out to live onand then when the price corrects decide how much to stick back in for the next cyclesometimes selling all coin just to buy back in x months is not worth the effort in selling all per cycle. because selling all ends up triggering a tax event. so best do math and calculate the pro-con of cashing it all out or just a percentageas for the apartment questioneach person is different as are their apartment optionsmake a judgement. is it the size of the apartment feeling like a prisonif so ask 2 questionsis it the size of the apartment? or lack of things to do outside near(walking distance of) apartment that is the problem?(dont go out as there is nothing to do)if you searched for what you deem as a better apartment/location with more local activities. look at the cost difference between the rents/mortgages. and ask 2 questionsis paying the extra for better apartment going to improve life. or can that \"difference between\" amount pay for more regular outdoor activities to improve your lifeis it really the apartment or the lack of vacations the real problem.can the \"difference between\" allow you to work a few less hours while still sustaining cost of living, to allow you more rest/recreation time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}