{
  "id": "topic_5450181",
  "title": "MK-74",
  "author": "MK-74",
  "created_time": "April 25, 2023, 11:39:50 PM",
  "content": "Yeni bir şeyler araştırırken bu projeyi buldum, gizlilik odaklı veri paylaşımı yapmayı planlayan bir proje.Dikkatimi çeken kısmı ise Binance Labs'ın bu projeye yatırım yapması, bundan dolayı sizlerle de paylaşmak istedim.İlgisinizi çekerse takip edersiniz, size kalmış.https://www.privasea.ai/Adamların başka bir projeleri daha var linkten bakabilirsiniz ona da.https://www.nulink.org/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450181",
  "comments": [
    {
      "author": "MK-74",
      "created_time": "January 09, 2024, 08:04:05 PM",
      "body": "Beyler uzun zaman önce açtığım bir konuydu şimdi QuestN'de görev yapmışlar ve takas edilemez Early NFT var, görevler çok kolay nolur nolmaz diye yapın ileride işimize yarayabilir.Linki aşağıya bırakıyorum, eğer refli link isterseniz dm'den atabilirim.Şuan itibariyle 1 gün 18 saati kaldı görevin bitmesine biraz acele edin.https://app.questn.com/quest/847449220813869204",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "January 10, 2024, 06:36:27 AM",
      "body": "Hocam bana hâlâ vakit varsa eğer link at. Sen emek verip buraya getirmişsin neden boşa gitsin ki.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "January 10, 2024, 08:51:49 AM",
      "body": "Quote from: ajanwalker on January 10, 2024, 06:36:27 AMHocam bana hâlâ vakit varsa eğer link at. Sen emek verip buraya getirmişsin neden boşa gitsin ki. Tamamdır hocam ve geçince akşam 7 gibi atarım o zamana kadar yapmamışsan yaparsın, yaptıysan da artık düşünmen yeter, sağlık olsun.Bence herkesin yapması gerekiyor, arkasında Binance var, büyük ihtimalle listeler diye düşünüyorum bunu Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "January 10, 2024, 08:54:07 AM",
      "body": "Quote from: MK-74 on January 10, 2024, 08:51:49 AMQuote from: ajanwalker on January 10, 2024, 06:36:27 AMHocam bana hâlâ vakit varsa eğer link at. Sen emek verip buraya getirmişsin neden boşa gitsin ki. Tamamdır hocam ve geçince akşam 7 gibi atarım o zamana kadar yapmamışsan yaparsın, yaptıysan da artık düşünmen yeter, sağlık olsun.Bence herkesin yapması gerekiyor, arkasında Binance var, büyük ihtimalle listeler diye düşünüyorum bunu Binance.Yarım 18.00 e kadar vakit var galiba. Sen akşam at hocam ben senin linkten kayıt olayım niye boşa gitsin. Küçükte olsa desteğimiz olsun.Teşekkürler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xpi",
      "created_time": "January 10, 2024, 10:37:43 AMLast edit: January 10, 2024, 11:25:15 AM by xpi",
      "body": "Quote from: MK-74 on January 09, 2024, 08:04:05 PMBeyler uzun zaman önce açtığım bir konuydu şimdi QuestN'de görev yapmışlar ve takas edilemez Early NFT var, görevler çok kolay nolur nolmaz diye yapın ileride işimize yarayabilir.Linki aşağıya bırakıyorum, eğer refli link isterseniz dm'den atabilirim.Şuan itibariyle 1 gün 18 saati kaldı görevin bitmesine biraz acele edin.https://app.questn.com/quest/847449220813869204Merhabalar, görevleri tamamladım NFT claim ettim. Benim metamask cüzdanıma herhangi bir şey -Token veya NFT olarak- gelecek mi? Aynı zamanda göreve ait NFT'nin orada 70 puan yazan bir ibare bulunmakta bu nedir? edit:Alıntı eklendi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yenilmez86",
      "created_time": "January 10, 2024, 11:30:06 AM",
      "body": "Ref linkini bana da pm atar mısın hocam sana zahmet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "January 10, 2024, 06:46:14 PM",
      "body": "Quote from: xpi on January 10, 2024, 10:37:43 AMQuote from: MK-74 on January 09, 2024, 08:04:05 PMBeyler uzun zaman önce açtığım bir konuydu şimdi QuestN'de görev yapmışlar ve takas edilemez Early NFT var, görevler çok kolay nolur nolmaz diye yapın ileride işimize yarayabilir.Linki aşağıya bırakıyorum, eğer refli link isterseniz dm'den atabilirim.Şuan itibariyle 1 gün 18 saati kaldı görevin bitmesine biraz acele edin.https://app.questn.com/quest/847449220813869204Merhabalar, görevleri tamamladım NFT claim ettim. Benim metamask cüzdanıma herhangi bir şey -Token veya NFT olarak- gelecek mi? Aynı zamanda göreve ait NFT'nin orada 70 puan yazan bir ibare bulunmakta bu nedir? edit:Alıntı eklendi.Hocam NFT daha claim edilebilir değil, NFT'yi görevleri yapanlara gönderecekler. 70 Puan QuestN'in puanı oluyor, herhangi bir görev yaptığında sana puan geliyor, onun çok alakası yok bu Privasea ile.@ajanwalker ve @yenilmez86 hocam sizlere dm'den ilettim refli linki, çok teşekkürler umarım güzel paralar kazanırız buralardan. Şimdiden bol kazançlar dilerim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xpi",
      "created_time": "January 10, 2024, 09:03:33 PM",
      "body": "Quote from: MK-74 on January 10, 2024, 06:46:14 PMHocam NFT daha claim edilebilir değil, NFT'yi görevleri yapanlara gönderecekler. 70 Puan QuestN'in puanı oluyor, herhangi bir görev yaptığında sana puan geliyor, onun çok alakası yok bu Privasea ile.Anladım, NFT'yi gönderdiklerinde tarafımıza bir bildirim vesaire geliyor mu yoksa takip mi etmemiz gerekiyor, bilginiz var mıydı? Desteğiniz için teşekkür ederim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "January 14, 2024, 12:02:47 AM",
      "body": "Evet beyler, görevlerini yapmış olduğumuz Privasea'nin sonuçlar açıklanmış, Questn'den kontrol edebilirsiniz.41K kişi NFT mintlemeye hak kazanmış, ben mintledim, sizlerde mintleyin görevleri yaptıysanız. İleride airdrop falan olursa artı olarak yazacaktır bize diye düşünüyorum.https://app.questn.com/quest/847449220813869204",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "March 04, 2024, 12:40:07 PM",
      "body": "Beyler bayanlar yeni bir haber geldi ve Privasea ekibi 5 milyon dolar daha yatırım aldığını açıkladı, yatırım turuna Binance Labs, Gate Labs, MH Ventures, K300, QB Ventures, Crypto Times gibi firmalar katıldı.Zamanında NFT mintlemiştik çok basit görevlerle umuarım yapmışsınızdır ve umarım o NFT'yi mintleyenlere airdrop atarlar.https://twitter.com/Privasea_ai/status/1764630198408872388",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "March 04, 2024, 04:35:50 PM",
      "body": "ufak bir miktar bu shitten aldım ben de. almamın sebebi binance labs'ın yatırım yapması ve adının içinde ai geçmesi. yoksa bir sike derman olacak değiller ama işte insanı bu iki nokta ufak da olsa almaya yöneltiyor. vestingi de oldukça uzun bir proje.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "March 07, 2024, 09:48:23 AM",
      "body": "Quote from: gospodin on March 04, 2024, 04:35:50 PMufak bir miktar bu shitten aldım ben de. almamın sebebi binance labs'ın yatırım yapması ve adının içinde ai geçmesi. yoksa bir sike derman olacak değiller ama işte insanı bu iki nokta ufak da olsa almaya yöneltiyor. vestingi de oldukça uzun bir proje.Nereden aldınız hocam, bende takipteyim ama satışını falan görmedim acaba gözümden mi kaçırdım, kaçırdıysam kötü oldu iyi getiri sağlayacak bir proje diye düşünüyorum. Umarım çok iyi kazanırsın.Satış falan olursa kesinlikle girmeye çalışırım buna.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "April 05, 2024, 01:58:30 PM",
      "body": "Privasea'den gün içerisinde bir duyuru geldi, Stratejik Finansman turu gerçekleştirmişler.OKX Ventures, Nomura Group's Laser Digital, ve SoftBank gibi yatırımcılardan toplamda 5 Milyon Dolarlık bir yatırım almışlar.https://www.coindesk.com/press-release/2024/04/03/privasea-securely-leads-ai-data-revolution-with-strategic-funding-and-fhe-technology/Takip eden başka arkadaşlar varsa bu projeyi bildiklerini yazabilirler, ben takip ediyorum ama çok detaylı bakmıyorum.Güzel kazandıracak bir proje.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}