{
  "id": "topic_5419013",
  "title": "udayantha11",
  "author": "udayantha11",
  "created_time": "November 01, 2022, 04:57:17 AMLast edit: November 01, 2022, 07:27:45 AM by udayantha11",
  "content": "Most are saying that PoW is decentralized and PoS is more centralized. how PoS more centralized ? my question is most are now PoS so it will be bad if centralized.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419013",
  "comments": [
    {
      "author": "LegendaryK",
      "created_time": "November 01, 2022, 05:11:38 AMLast edit: November 01, 2022, 05:33:31 AM by LegendaryK",
      "body": "Quote from: udayantha11 on November 01, 2022, 04:57:17 AMMost are saying that PoW is decentralized and PoS is more centralized. how PoS more centralized ? my question is most are now PoS so it will be bad if centralized.BTC PoW is centralized to a mere 4 mining pools with just 4 colluding mining pool operators able to 51% attack btc at a moment's notice. (For Years)Anyone that claims 4 people is decentralized is a moron. PoS coins such as Cardano have over 3000 staking pools, with program code design to prevent centralization.https://docs.cardano.org/explore-cardano/cardano-design-rationaleQuoteAnother major aim in the design of Cardano is to reduce centralization while actively working against economic incentives that would drive the system towards centralization. As soon as you have stake pools, you have an economic incentive for these pools to grow, so it was important to make it less attractive for a stake pool to become too big. It is more cost-efficient to have a small number of large pools, than a large number of small pools. Cardano was designed to work against the economic incentive where large pools dominate the system, by making it less attractive for a pool to become too big. This was achieved by changing the reward formula. In a naive system, the total rewards for a pool would be proportional to its stake, so the bigger it gets, the better. In Cardano, if a pool attracts more stake than a certain threshold (1/k, where k is a configurable parameter), its reward will no longer increase. So, if everyone acts in their own self-interest to maximize their rewards, you expect k pools of roughly equal size.https://www.yahoo.com/lifestyle/cardano-blockchain-achieves-100-decentralization-220615285.htmlQuoteCardano Blockchain Achieves 100% Decentralization BTC failed PoW design has nothing to match Cardano superior PoS code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 01, 2022, 07:16:17 AM",
      "body": "I am a little confused in your question and in your tittle. What are you talking about POS or POW ? As pos is centralized reason is there just a few number network Supporters you can say Validators and they are chosen by project team as the case in BSC. So to control whole chain you need to control these few Validators and yes it is centralized.POW is far more Decentralized as anyone with any some Specs can be a network Supporter and the whole network is distributed in branches you need to cut all of them to control network.If you want to check the POS vs PoW then learn about their few details asWorkingSecurityRewardsEnergyDecentralizationThis is the base idea of the POW and POS as POS refferes to the shit projects and Pow to the Market King Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "November 01, 2022, 07:18:30 AM",
      "body": "You should edit to your topic to \"How PoS becomes more centralized?\"In POS cryptocurrencies, for validating transactions, you must stake your coins and unlike bitcoin, you don't have to do any work. Therefore, in a POS cryptocurrency, the more coins you have, the more control you have over the network. Since a significant percentage of POS coins are usually owned by the developers, they can have big control over the network. You may be interested in the the useful thread started by BlackHatCoiner.[Megathread] The long-known PoW vs. PoS debate",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "udayantha11",
      "created_time": "November 01, 2022, 07:28:38 AM",
      "body": "Quote from: hosseinimr93 on November 01, 2022, 07:18:30 AMYou should edit to your topic to \"How PoS becomes more centralized?\"In POS cryptocurrencies, for validating transactions, you must stake your coins and unlike bitcoin, you don't have to do any work. Therefore, in a POS cryptocurrency, the more coins you have, the more control you have over the network. Since a significant percentage of POS coins are usually owned by the developers, they can have big control over the network. You may be interested in the the useful thread started by BlackHatCoiner.[Megathread] The long-known PoW vs. PoS debateNow i got that i have written the topic as wrong. Thanks for letting me know. your explanation is quite good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "November 01, 2022, 08:28:46 AM",
      "body": "Quote from: udayantha11 on November 01, 2022, 04:57:17 AMMost are saying that PoW is decentralized and PoS is more centralized. how PoS more centralized ? my question is most are now PoS so it will be bad if centralized.You couldn't have raise this question if you had the better understanding of what PoS is, this is something that need the concession of other stake holders to determine the reward for miming unlike PoW that each miner is independently busy solving series of mathematical equations to earn a reward, PoS is centralized and PoW is decentralized, and right from their definition you will understand what each of them mean.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "November 01, 2022, 08:36:37 AM",
      "body": "its the validators that will make it centralize because its them who will decide what happens in the network. the validators includes exchanges who also stake huge amount of tokens (e.g. ETH)  such as binance and there are institutions as well like Blackrock. while we see nothing is wrong about it because they are also part of the network, the SEC considers POS tokens as security which SEC can grab the necks of the validators to do something stupid like choosing which transactions to validate or worse freeze wallets making the network Centralized. see what will happen if BTC is POS?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "November 01, 2022, 09:28:39 AM",
      "body": "PoS is extremely limiting. PoS proponents claimed that not everyone can mine because you need a place to keep your miners at, while staking can be done without as much as a PC. All you need is a phone and doesn't require power. This accessibility and lack of power bills were the main arguments for PoS, but that's not everything. The reality is a bit different.PoS requires a very large amount of money to start staking, much larger than you'd need to mine a PoW coin, even bitcoin. A top level bitcoin miner S19XP costs $7k. To stake ETH you need 32x$1600 = $51k That's 7x more!This makes ETH staking concentrated around 2 big pools Lido and Coinbase that have almost 50% of all staked ETH. Also, nothing stops these pools from striking a deal and merging into one, just as companies get bought, one of them can buy out the other. As you can see it's much more difficult to start staking ETH than mining it and miners did not stop when ETH switched to PoS, but moved to other coins, while control over the network was given to the whales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 01, 2022, 12:10:59 PM",
      "body": "POS is centralized since the validators are only depends on few people and only the developer or the team can create the token. The developer have a control over their token, they can burn and add the supply, also they can freeze their token. Technically centralized is very bad since we're using fiat which is centralized and we don't have full control over our money. But most people who're newbie in cryptocurrency doesn't care with decentralized and centralized, since their purpose is to make money from shitcoins pump and dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "November 01, 2022, 12:22:41 PM",
      "body": "Quote from: udayantha11 on November 01, 2022, 04:57:17 AMMost are saying that PoW is decentralized and PoS is more centralized. how PoS more centralized ? my question is most are now PoS so it will be bad if centralized.Because with Proof of Stake, developers can mint their coins from air, at genesis block and they even have a mint function which allows them to mint more tokens later if they want. If you need an example, it is Terra (now is Terra Classic)About centralization, it can be explained by minting and the dominating coins or tokens owned by developers and founder team. With such huge coins or tokens, they will have very big staking weights that can manipulate the network even in community vote for important decisions.The halt of Terra Classic network in May and the half of Binance Smart Chain last month are good examples about centralized networks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}