{
  "id": "topic_5417547",
  "title": "House7house",
  "author": "House7house",
  "created_time": "October 18, 2022, 01:08:06 PM",
  "content": "UK Bond Market Has problem.UK cant print money If they do it Will be Zero value.They cant just not print money and letting the economy fall ITS a bad For USA and the elite bankers If people around the world see that UK the BIG one Has fallen it Will couse panic all around the world and people in Western countries Will start asking Will they Gona be next ones ?There is not many options what the UK can do now one thing they Will try to give out Loans but nobody dont want from them this is Also occupied by the USA so USA is the Loan and money printing cartel.For UK IS only solution to borrow from USA china or russia Eu cant give out Loans becouse eu Has same problem that UK Has Bond Market Crisis.The power of the world remains USA russia and china eu and UK Are out of the power For now.But UK IS special one UK IS too BIG to fall anything happens UK markets or finances the whole world is watching.So they cant just fall becouse of the moneytary policiy and boe Has no more asssets or good collateral to back UK currency.The options Are For UK quite obvous: 1.Full scale war maybe with russia.2.start immediately crypto currency Taking the btc as collateral using For transactions temporary foreign currency such us usdt, usdc.Either way it can go in war or Crisis and adopt crypto or adopt crypto after war.They cant create CBDC out of nothing becouse to create CBDC u need to have solid Asset to back up the currency.They can only start new currency with btc or gold AS the world going in to digital system then gold is out of occasion.There is Also option that Putin Will attack UK and whole world Will try to give money to UK and pound sterling can restart again.There is no other options For UK those what i did mentioned Are only options left For the UK and the sake of surviving of the Western Nations.In chess game the Queen IS powerful piece but sometimes u got to sacrafice Queen to save king.Anyone who say different dont know how the finances and world is working.If you understood my point it means u got enough education and knowledge.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417547",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "October 20, 2022, 02:34:27 PM",
      "body": "UK has a lot more problems than its bond market. They can't even form a government. The previous prime minister (the guy with the hair) resigned not so long ago and the new one (Liz Truss) just resigned after she messed up the economy even more than it was messed up. Only in 6 weeks!!!Funny how they thought they could exit the European Union (ie. Brexit) and then after the EU got ruined (due to the war they knew they were going to start with Russia) they could come back as the savior of Europe and get back the position they once had a century ago",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "October 21, 2022, 08:20:48 AM",
      "body": "Quote from: pooya87 on October 20, 2022, 02:34:27 PMUK has a lot more problems than its bond market. They can't even form a government. The previous prime minister (the guy with the hair) resigned not so long ago and the new one (Liz Truss) just resigned after she messed up the economy even more than it was messed up. Only in 6 weeks!!!The British newspaper Daily Star launched a stream a week ago asking which would last longer: British Prime Minister Liz Truss or a head of lettuce that had a ten-day shelf life.Well, the head of lettuce won.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "woez",
      "created_time": "October 21, 2022, 09:25:27 AM",
      "body": "Quote from: House7house on October 18, 2022, 01:08:06 PMBut UK IS special one UK IS too BIG to fall anything happens UK markets or finances the whole world is watching.So they cant just fall becouse of the moneytary policiy and boe Has no more asssets or good collateral to back UK currency.The options Are For UK quite obvous: 2.start immediately crypto currency Taking the btc as collateral using For transactions temporary foreign currency such us usdt, usdc.There is no chance that any other currency Will worth more than btc in next few weeks or months Only big chances That bitcoin will stay under pressure and down trend Will continue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "October 21, 2022, 09:38:33 AM",
      "body": "The US and the UK are both fucked because of their high debt. They can't raise the rates, they can't print more FIAT. One of them crashes the markets, the other brings hyperinflation. They are both cornered. There is no easy way out of this shitty situation. One way or another somebody will suffer and pay for that debt. And when these 2 countries start suffering, it will be a problem for everyone because their economies (especially the US) are pretty big.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "October 21, 2022, 10:01:41 AM",
      "body": "Quote from: pooya87 on October 20, 2022, 02:34:27 PMUK has a lot more problems than its bond market. They can't even form a government. The previous prime minister (the guy with the hair) resigned not so long ago and the new one (Liz Truss) just resigned after she messed up the economy even more than it was messed up. Only in 6 weeks!!!Funny how they thought they could exit the European Union (ie. Brexit) and then after the EU got ruined (due to the war they knew they were going to start with Russia) they could come back as the savior of Europe and get back the position they once had a century ago The United Kingdom is becoming chaotic and becoming a joke for the whole world with unusual leaders. I just read the latest information that former Prime Minister Johnson, was said to quickly return to England while on vacation after listening to Liz Truss resigned. This is a power struggle in a chaotic internal government of the UK government, a prime minister has been deposed and is currently trying to return to politics after an unemployed day. It will be very interesting to follow who will be the next Prime Minister in the UK and who can resolve this crisis when the inflation in the UK has reached 2 digits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 21, 2022, 12:23:14 PM",
      "body": "The recent resignation of Liz Truss will reassure the economy a little, and the central bank may be able to control the market for several more weeks, but the problem has now turned into a political par excellence. The failure to choose the government for the next week may cause a lot of economic problems, which means that Britain dispenses with it.The appointment of the new government may solve many problems, but most of the costs will be paid by the citizen, which will accelerate early elections that may further complicate the situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "October 21, 2022, 01:02:03 PM",
      "body": "Quote from: hugeblack on October 21, 2022, 12:23:14 PMThe recent resignation of Liz Truss will reassure the economy a little, and the central bank may be able to control the market for several more weeks, but the problem has now turned into a political par excellence. The failure to choose the government for the next week may cause a lot of economic problems, which means that Britain dispenses with it.The appointment of the new government may solve many problems, but most of the costs will be paid by the citizen, which will accelerate early elections that may further complicate the situation.They are dealing with many problems already, with this recent resignation it will bring a lot of change but expect not much.UK should be more aggressive on getting a good government that will address all the problem especially with the threat of recession and higher inflation rate. I'm not familiar about how their political political policy will be but I know UK is already suffering economically. UK bond market is not doing good along with the other countries in Europe, the only way to solve this is to seek help from their allies and talk about the possible deal and solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}