{
  "id": "topic_5470701",
  "title": "PayWithAnon",
  "author": "PayWithAnon",
  "created_time": "October 17, 2023, 03:59:38 PM",
  "content": "Hello fellow bitcoiners!   Welcome to the official PayWithAnon Bitcointalk Thread!      Today we introduce the world to the Anon Virtual Visa® Card.     The Anon virtual card lets you spend over 5+ cryptocurrencies like cash online, worldwide.   Purchase an Anon Virtual Visa® Card with crypto to pay online worldwide anywhere Visa® cards are accepted,   cards are immediately available to spend.    Key Features:    Private: We will never ask for any identification or personal information    Unlimited: You can create as many Anon Virtual Cards you need to match your spending needs    High load limit: Send funds or receive funds from other Anon users, instantly    Send and Receive: You can load an Anon Card up to $1.000 USD each.    How it works    Create an account: Create an account with only your email, no additional information required.    Fund your balance: Fund your credit balance with over 5+ cryptocurrencies, crypto will be automatically converted to USD.    Create A Card & Pay: Create a card in one click, cards are immediately available to spend. Use Anon cards to pay everywhere Visa cards are accepted, worldwide.   Check it out today: www.paywithanon.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470701",
  "comments": [
    {
      "author": "AB de Royse777",
      "created_time": "October 17, 2023, 04:13:22 PM",
      "body": "Quote from: PayWithAnon on October 17, 2023, 03:59:38 PM   Check it out today: www.paywithanon.comWelcome to the forum. I see you tried your best to format the post :-)Normally an announcement thread like this are better effective if you are able to post image. Buying a copper membership will enable you to have that. You can try it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 17, 2023, 04:50:00 PM",
      "body": "Before creating more ANN threads, care to respond on a scam accusation that you are allegedly trying to dodge the payment for the guy who created your website? Here is the link https://bitcointalk.org/index.php?topic=5470574.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PayWithAnon",
      "created_time": "October 17, 2023, 04:52:44 PM",
      "body": "Quote from: Rikafip on October 17, 2023, 04:50:00 PMBefore creating more ANN threads, care to respond on a scam accusation that you are allegedly trying to dodge the payment for the guy who created your website? Here is the link https://bitcointalk.org/index.php?topic=5470574.0Hi, we have received several messages about his. Unfortunately, this is a dispute between the developer and the company he works with, not with us. We paid our dues. But nevertheless we are trying to mediate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "October 17, 2023, 08:14:17 PM",
      "body": "Quote from: PayWithAnon on October 17, 2023, 04:52:44 PMQuote from: Rikafip on October 17, 2023, 04:50:00 PMBefore creating more ANN threads, care to respond on a scam accusation that you are allegedly trying to dodge the payment for the guy who created your website? Here is the link https://bitcointalk.org/index.php?topic=5470574.0Hi, we have received several messages about his. Unfortunately, this is a dispute between the developer and the company he works with, not with us. We paid our dues. But nevertheless we are trying to mediate. But the developer does not know the company but the person who introduced or asked him to create the website is responsible and you were mentioned in the scam accusation thread and you have not cleared yourself in the thread. To create website is very different and if the service is not appropriated is very painful. So I also advise you to settle the developer and enjoy your stay in the forum and build your good reputation. And you have good services to render. Do well to build your reputation in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "October 17, 2023, 10:58:36 PM",
      "body": "OP, why are you opening up multiple Announcement threads of the same service? Are you aware this is not allowedI noticed in the other thread, there is a dispute that hasn't been resolved, and it seems to me that you are trying to wipe the slate clean by creating a new threadQuote from: PayWithAnon on October 17, 2023, 04:52:44 PMWe paid our dues. Can you provide us proof that you indeed made payment because your accuser says you didn't pay anything?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jonaedbd",
      "created_time": "October 18, 2023, 09:59:36 AMLast edit: October 18, 2023, 10:38:43 AM by jonaedbd",
      "body": "Quote from: Bitcoin_Arena on October 17, 2023, 10:58:36 PMOP, why are you opening up multiple Announcement threads of the same service? Are you aware this is not allowedI noticed in the other thread, there is a dispute that hasn't been resolved, and it seems to me that you are trying to wipe the slate clean by creating a new threadQuote from: PayWithAnon on October 17, 2023, 04:52:44 PMWe paid our dues. Can you provide us proof that you indeed made the payment because your accuser says you didn't pay anything?Nope, he didn't pay anything. Instead, I got threats from him. Here is the screenshot from yesterday's conversation. https://prnt.sc/ZuDP2gLZdSu8And I don't think I should work on this project anymore because even if he pays me there is no guarantee that he will not scam anyone else.Quote from: PayWithAnon on October 17, 2023, 04:52:44 PMUnfortunately, this is a dispute between the developer and the company he works with, not with us. We paid our dues. I was a freelance developer. So basically he contacts me directly, there is no company in between. All the WhatsApp messages you've seen is the message between him and me. No third person or company was involved.If anybody wants proof please mail me at: jonaed.com.bd@gmail.com I'd love to show you all the conversations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cyrus",
      "created_time": "October 18, 2023, 01:07:29 PM",
      "body": "Duplicate thread, locked. Continue here: https://bitcointalk.org/index.php?topic=5468591",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}