{
  "id": "topic_5504639",
  "title": "Question:",
  "author": "d5000",
  "created_time": "July 30, 2024, 06:31:52 PM",
  "content": "Some Bitcoiners seem to be enthusiastic about plans by politicians to buy or hold big amounts of Bitcoin as part of a \"strategic reserve\". In particular, Kennedy's announcement that in the (extremely unlikely) case he wins the US election he could buy up to four million Bitcoins as a strategic reserve.I don't like this idea for the following reason:States holding such a big amount could interfere too much into Bitcoin's power equilibrium.Let's see the following hypothetical scenario:- The US buys 1-2 million BTC, other states/central banks like the ECB, China and India follow, and together they hold let's say 5-7 million (about 25%-35% of all existing Bitcoins).- Now the FATF sets up a new \"recommendation\" that a blacklist for \"sanctioned\" Bitcoin addresses (like those already implemented in Tether and other stablecoins) would be desirable.- As almost all states obey the FATF's guidelines, together they pressure Bitcoin Core team to implement a blacklist for \"sanctioned\" Bitcoin addresses which miners have to obey, or alternatively build an own Bitcoin client with a modified protocol.- This would of course need a hard fork. But they have a lot of coins, so they can increase pressure by threatening to sell all Bitcoins on the chain which does not follow the hard fork. This has a precedent: it's what Ethereum did when they pressured for the hard fork rewinding the TheDAO hack in 2016.A similar scenario was already discussed for ETFs. But ETFs would never hold so many coins as some are desiring for states/governments to hold, and also their customers could react, so for ETFs I don't see this danger. Up to 1 million, even 2 millions of BTC hold be states/governments/central banks would still not be something to be worried about. But if all bigger states try to buy millions, then it could become really dangerous.I don't think Bitcoin would \"die\" in such a scenario, but I think it could lose a lot of value and confidence. And the scenario is not that unlikely to be ignored.What do you think? I added a poll also with an intermediate scenario like the one announced by Trump, which would lead to a couple of hundred thousands of BTC hold by states, but not millions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5504639",
  "comments": [
    {
      "author": "Mia Chloe",
      "created_time": "July 30, 2024, 06:44:45 PM",
      "body": "Quote from: d5000 on July 30, 2024, 06:31:52 PMStates holding such a big amount could interfere too much into Bitcoin's power equilibrium.Thank Goodness you raised this topic was starting to think like didn't no one notice it? Infact emphasis of that statement being In bold. Bitcoin is a decentralised currency yeah we all know but let's  not forget the fact that the decentralisation of the bitcoin network is based on majority meaning chances have it that bitcoin can be forcefully centralised.Starting from mining which runs on a 51% rule to fees  which is dependent on average transaction fees in that block to even then whole bitcoin price which depends on selling and buying rates that in turn is dependent on major holders and whales.Take for example Bitcion crossing over $70k with bitcioners cheering about it then boom the German incident happened and since then bitcoin has been struggling back to $70k which was almost a new low. The fact is what really can anyone do???The only thing is bitcioners can try to hold as much as they can hopefully the government doesn't get hold of enough coins to violently shake the market.Hopefully bitcoin doesn't turn out like diamond that was over time accumulated and is currently run by a single body.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 30, 2024, 07:00:19 PM",
      "body": "Quote from: d5000 on July 30, 2024, 06:31:52 PMSome Bitcoiners seem to be enthusiastic about plans by politicians to buy or hold big amounts of Bitcoin as part of a \"strategic reserve\". In particular, Kennedy's announcement that in the (extremely unlikely) case he wins the US election he could buy up to four million Bitcoins as a strategic reserve.I don't like this idea for the following reason:States holding such a big amount could interfere too much into Bitcoin's power equilibrium.Let's see the following hypothetical scenario:- The US buys 1-2 million BTC, other states/central banks like the ECB, China and India follow, and together they hold let's say 5-7 million (about 25%-35% of all existing Bitcoins).- Now the FATF sets up a new \"recommendation\" that a blacklist for \"sanctioned\" Bitcoin addresses (like those already implemented in Tether and other stablecoins) would be desirable.- As almost all states obey the FATF's guidelines, together they pressure Bitcoin Core team to implement a blacklist for \"sanctioned\" Bitcoin addresses which miners have to obey, or alternatively build an own Bitcoin client with a modified protocol.- This would of course need a hard fork. But they have a lot of coins, so they can increase pressure by threatening to sell all Bitcoins on the chain which does not follow the hard fork. This has a precedent: it's what Ethereum did when they pressured for the hard fork rewinding the TheDAO hack in 2016.A similar scenario was already discussed for ETFs. But ETFs would never hold so many coins as some are desiring for states/governments to hold, and also their customers could react, so for ETFs I don't see this danger. Up to 1 million, even 2 millions of BTC hold be states/governments/central banks would still not be something to be worried about. But if all bigger states try to buy millions, then it could become really dangerous.I don't think Bitcoin would \"die\" in such a scenario, but I think it could lose a lot of value and confidence. And the scenario is not that unlikely to be ignored.What do you think? I added a poll also with an intermediate scenario like the one announced by Trump, which would lead to a couple of hundred thousands of BTC hold by states, but not millions.Well, you are seeing this from one angle and failing to see it from another angle, the dangers you talked about are there just as you have described it, but did you even bother a bit to ask yourself, what it will take to buy up to 2 million or more bitcoin from the open market? Even buying 50,000 bitcoin can drive the price of bitcoin up high to the roof, not to talk of buying up to 1 or 2 million bitcoins, buying up to this mentioned about of bitcoin, I can tell you will drive the price of bitcoin to nothing less than a million Dollar, now think about what will happen when one have to spend up to a million dollars just to own 1 bitcoin, and you need like 1 million bitcoins, and remember the more you buying, the more expensive it gets.This is why I think it's not really all that easy for any individual or governments to own up to 2 million bitcoins without them emptying their reserve or treasury.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Amphenomenon",
      "created_time": "July 30, 2024, 07:28:12 PM",
      "body": "Quote from: Fivestar4everMVP on July 30, 2024, 07:00:19 PMWell, you are seeing this from one angle and failing to see it from another angle, the dangers you talked about are there just as you have described it, but did you even bother a bit to ask yourself, what it will take to buy up to 2 million or more bitcoin from the open market? Even buying 50,000 bitcoin can drive the price of bitcoin up high to the roof, not to talk of buying up to 1 or 2 million bitcoins, buying up to this mentioned about of bitcoin, I can tell you will drive the price of bitcoin to nothing less than a million Dollar, now think about what will happen when one have to spend up to a million dollars just to own 1 bitcoin, and you need like 1 million bitcoins, and remember the more you buying, the more expensive it gets.This is why I think it's not really all that easy for any individual or governments to own up to 2 million bitcoins without them emptying their reserve or treasury. Actually it`s possible with time and according to what Kennedy's planned if elected as presidents is something that is really feasible for them and with time his plans would be accomplished.Quote from: https://www.theblock.co/post/307884/u-s-presidential-candidate-robert-f-kennedy-jr-promises-to-issue-bitcoin-related-executive-orders-if-electedKennedy, who is running as an independent, said he would direct the U.S. Department of Justice and the U.S. Marshals Sevice to transfer about 200,000 Bitcoin held by the U.S. government to the Department of Treasury to be held as a \"strategic asset.\"Kennedy also told participants at Bitcoin 2024 in Nashville on Friday that he plans to sign a separate executive order directing the U.S. Treasury to buy 550 bitcoin daily until the U.S. has a reserve of 4 million BTC. There are about 21 million bitcoin in circulation.This is a big issue from the fact that it could bring centralization and market manipulation which are things we Bitcoiners also not ought to ignore, which will make the government finally having somehow the ultimate say on Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "July 30, 2024, 07:38:19 PM",
      "body": "Quote from: d5000 on July 30, 2024, 06:31:52 PM-What do you think? I added a poll also with an intermediate scenario like the one announced by Trump, which would lead to a couple of hundred thousands of BTC hold by states, but not millions.I stand in the same point of view as you regarding the dislike of the government's ideas holding millions of Bitcoin because in my opinion they can do with the strength they have. For parties outside the government will feel difficult. An imbalance will also be the thing that will be felt with the amount of Bitcoin remaining from the total.But if I think long, this is not an obstacle that will make Bitcoin road in other words will not 'die' even though the scenario is like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "July 30, 2024, 07:38:33 PM",
      "body": "Quote from: Amphenomenon on July 30, 2024, 07:28:12 PMQuote from: Fivestar4everMVP on July 30, 2024, 07:00:19 PMWell, you are seeing this from one angle and failing to see it from another angle, the dangers you talked about are there just as you have described it, but did you even bother a bit to ask yourself, what it will take to buy up to 2 million or more bitcoin from the open market? Even buying 50,000 bitcoin can drive the price of bitcoin up high to the roof, not to talk of buying up to 1 or 2 million bitcoins, buying up to this mentioned about of bitcoin, I can tell you will drive the price of bitcoin to nothing less than a million Dollar, now think about what will happen when one have to spend up to a million dollars just to own 1 bitcoin, and you need like 1 million bitcoins, and remember the more you buying, the more expensive it gets.This is why I think it's not really all that easy for any individual or governments to own up to 2 million bitcoins without them emptying their reserve or treasury. Actually it`s possible with time and according to what Kennedy's planned if elected as presidents is something that is really feasible for them and with time his plans would be accomplished.Quote from: https://www.theblock.co/post/307884/u-s-presidential-candidate-robert-f-kennedy-jr-promises-to-issue-bitcoin-related-executive-orders-if-electedKennedy, who is running as an independent, said he would direct the U.S. Department of Justice and the U.S. Marshals Sevice to transfer about 200,000 Bitcoin held by the U.S. government to the Department of Treasury to be held as a \"strategic asset.\"Kennedy also told participants at Bitcoin 2024 in Nashville on Friday that he plans to sign a separate executive order directing the U.S. Treasury to buy 550 bitcoin daily until the U.S. has a reserve of 4 million BTC. There are about 21 million bitcoin in circulation.This is a big issue from the fact that it could bring centralization and market manipulation which are things we Bitcoiners also not ought to ignore, which will make the government finally having somehow the ultimate say on Bitcoin.Government had been long time made out those kind of warnings about Bitcoin or cryptocurrencies but it seems that they cant really be able to stop the crypto community not only on the sense on making them stop on investing into crypto but also they cant be able to crack down those projects since these things are decentralized and couldnt be possibly be able to stop it technically on which they've decided instead on dealing or making involvement into it. They might not really be that capable on stopping things but they are really that good when it comes to manipulation aspect on which if someone could really be able to acquire coins then of course they could also do that. We do know that government funding is really that huge if they would really be that tending to purchase up something.This is why its not really that shocking that one day they would really be owning that significant amount of coins on which it could really be causing up that kind of manipulation that could happen in the future.Somehow basing up on the numbers that they are on possesion then it isnt really that still big basing up on the total amount of supply but pretty sure that sooner or later on the moment that they had accumulated enough, then they do have that advantage on moving out markets basing up into their interest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 30, 2024, 07:50:11 PM",
      "body": "I don't think this would be that bad as it looks because if the govenmments decide to hold bitcoins the it means govenmments will support the markets and the amount of money or capital on the markets will have a huge increment. So, if we see the govs trying to do it then we should buy cryptos and ride the way because the bump should be huge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "July 30, 2024, 08:04:27 PM",
      "body": "I did voted for \"don't know\" as well, because I really don't know. There are two things that make me question this, one is the fact that if USA type of nations buy a lot of bitcoins, they would make the price go up and they are rich enough that they do not have to sell, they don't need to sell and get back dollars considering they can just print dollars, so they will never have to sell, that's the point, \"have to\", they can just print the outcome anyway so why sell. However, they can buy so much that, if they ever decide for any political reason to sell, not for financial but for preference reasons, they would crash the market so badly that it may take many years before we can fix it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "July 30, 2024, 08:07:00 PM",
      "body": "Quote from: Mia Chloe on July 30, 2024, 06:44:45 PMQuote from: d5000 on July 30, 2024, 06:31:52 PMStates holding such a big amount could interfere too much into Bitcoin's power equilibrium.The fact is what really can anyone do???The only thing is bitcioners can try to hold as much as they can hopefully the government doesn't get hold of enough coins to violently shake the market.Hopefully bitcoin doesn't turn out like diamond that was over time accumulated and is currently run by a single body. Yeah, but who owns the majority of the money? The government, institutions, Asset managers and the Billionaires own the majority of money in the world, and guess what, Which people are majorly into Bitcoin before we start witnessing the current institutional adoption, well, is the average people like you and I, and some percentage of millionaires.Now if you talk about people holding of their Bitcoin without selling, well, the sad news is that you don't control what the other person wants to do with his or her Bitcoin sell or hodl, and furthermore if the government wishes to acquire more BTC they will always have a way of getting a hold of larger amount of Bitcoin into their portfolios, similar to the way we have seen Bitcoin get into the hands of the US and the German government.And if that is not enough they can equally find a way of shorting the Bitcoin market through their regulatory policies or via institutional Asset managers to forcefully make people sell their Bitcoins, So who knows other reason behind BlackRock steady buying of Bitcoin through ETFs, that could possibly be a way to try to get a larger share of it so they can move the market whichever way they want to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 30, 2024, 08:09:25 PM",
      "body": "Quote from: Amphenomenon on July 30, 2024, 07:28:12 PMQuote from: Fivestar4everMVP on July 30, 2024, 07:00:19 PMWell, you are seeing this from one angle and failing to see it from another angle, the dangers you talked about are there just as you have described it, but did you even bother a bit to ask yourself, what it will take to buy up to 2 million or more bitcoin from the open market? Even buying 50,000 bitcoin can drive the price of bitcoin up high to the roof, not to talk of buying up to 1 or 2 million bitcoins, buying up to this mentioned about of bitcoin, I can tell you will drive the price of bitcoin to nothing less than a million Dollar, now think about what will happen when one have to spend up to a million dollars just to own 1 bitcoin, and you need like 1 million bitcoins, and remember the more you buying, the more expensive it gets.This is why I think it's not really all that easy for any individual or governments to own up to 2 million bitcoins without them emptying their reserve or treasury. Actually it`s possible with time and according to what Kennedy's planned if elected as presidents is something that is really feasible for them and with time his plans would be accomplished.Quote from: https://www.theblock.co/post/307884/u-s-presidential-candidate-robert-f-kennedy-jr-promises-to-issue-bitcoin-related-executive-orders-if-electedKennedy, who is running as an independent, said he would direct the U.S. Department of Justice and the U.S. Marshals Sevice to transfer about 200,000 Bitcoin held by the U.S. government to the Department of Treasury to be held as a \"strategic asset.\"Kennedy also told participants at Bitcoin 2024 in Nashville on Friday that he plans to sign a separate executive order directing the U.S. Treasury to buy 550 bitcoin daily until the U.S. has a reserve of 4 million BTC. There are about 21 million bitcoin in circulation.This is a big issue from the fact that it could bring centralization and market manipulation which are things we Bitcoiners also not ought to ignore, which will make the government finally having somehow the ultimate say on Bitcoin.OK, i think now I understand better, but still, i say this is nothing to be afraid of, specaily with the fact that what ever Will be, will surely be, 550 bitcoin everyday with a target of 4 million bitcoin, simply means that it will take the government about 19 to 20 years to achieve their goal of acquiring 4 million bitcoins, and this is if they continue to buy 550 bitcoins every blessed day without missing a single day, else, every day missed will futher extend this time period.And also think about what every day purchase of 550 bitcoin will do to the price of bitcoin in the short, medium and long term, minus the fact that 20 years is a very long time, do you think Kenedy will still be on power as US president in 20 years from now if he wins? Unlikely if you ask me, and there is no absolute guarantee that the government that will come after Kenedy will buy into same idea as Kenedy is proposing now.The long and short of all that I am saying here is that, there is absolutely no reason to panic, specially with the fact that what ever will be will surely be, and if this is meant to be, I don't see anything you and I can do about it, so why worry?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "July 30, 2024, 08:18:36 PM",
      "body": "Even if we all agree with you that governments should not store millions of BTC, who is going to stop them if they want to, the BTC network is decentralized and censorship resistant, so anyone and any institution is free to accumulate as they like. However, i don't think BTC will be popular amongst countries, neither will they desire to have BTC in millions as part of their reserves, most of what is said in the U.S these days is just campaign strategy.Quote from: d5000 on July 30, 2024, 06:31:52 PM- The US buys 1-2 million BTC, other states/central banks like the ECB, China and India follow, and together they hold let's say 5-7 million (about 25%-35% of all existing Bitcoins).So if we hypothetically agree that different governments accumulate this much, it would still be almost impossible for all of them to collaborate to 'hurt' the network, they don't collaborate on so many things, so why this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "July 30, 2024, 09:34:12 PM",
      "body": "Quote from: Mia Chloe on July 30, 2024, 06:44:45 PMTake for example Bitcion crossing over $70k with bitcioners cheering about it then boom the German incident happened and since then bitcoin has been struggling back to $70k which was almost a new low. Here I disagree a bit. The \"German incident\" wasn't really the reason for the drop down from 70k to 53ish. At least the \"government coins\" sales themselves didn't impact much in price. I have followed the drop and it was mainly caused by panicking after the announcements of the LKA (\"Germany\") and Mt.Gox. When the LKA finally dumped their coins (mostly OTC) the price rose again But a few millions would be a completely different story than 50000 or 150000 coins.Quote from: Mia Chloe on July 30, 2024, 06:44:45 PMThe fact is what really can anyone do???Actually a lot. Why are politicians like Kennedy proposing these things? Because they know that some Bitcoin speculators like the idea, so they can dump their coins once the \"government pump\" took the price to extreme heights.So what you can do is to not vote people who propose that, and clearly signalise that many Bitcoiners aren't interested in a government-controlled Bitcoin.Of course in countries like China this isn't possible that easy. But even there, you can raise your voice to some extent.Quote from: Fivestar4everMVP on July 30, 2024, 07:00:19 PM[...] did you even bother a bit to ask yourself, what it will take to buy up to 2 million or more bitcoin from the open market? Even buying 50,000 bitcoin can drive the price of bitcoin up high to the roof, not to talk of buying up to 1 or 2 million bitcoins, [...] it's not really all that easy for any individual or governments to own up to 2 million bitcoins without them emptying their reserve or treasury. I'm not so sure about that. If a government does it well and uses OTC and limit orders intelligently, it could buy several hundreds of thousands slowly without moving the price much. The Bitcoin trading volume on the main markets (see Coingecko for example) is currently of several hundreds of thousands per day. So for example if you buy 1000 BTC a day (365k a year), you barely move the market.  You can always wait for the price to dip a bit and then buy, nobody forces you to do market orders. You can even buy your coins during the next bear market. And of course your authorities would continuously seize coins from criminal proceedings so you can acquire coins \"for free\" without having even to touch the market for that.The other way around unfortunately that's not that clear. If the goal of a \"FATF coalition\" is to impose a censorship mechanism, they would probably sell fast and not care much about how much they move the price.Quote from: Z-tight on July 30, 2024, 08:18:36 PMEven if we all agree with you that governments should not store millions of BTC, who is going to stop them if they want to, the BTC network is decentralized and censorship resistant, so anyone and any institution is free to accumulate as they like.See my answer to Mia Chloe above.Quote from: Z-tight on July 30, 2024, 08:18:36 PMHowever, i don't think BTC will be popular amongst countries, neither will they desire to have BTC in millions as part of their reserves, most of what is said in the U.S these days is just campaign strategy.It's likely you're right here, and I hope it. For example, the strategy to accumulate only seized coins is still ok for me, it would probably lead to US holdings of half a million in 10 years or so, which is still not critical.Quote from: Z-tight on July 30, 2024, 08:18:36 PMSo if we hypothetically agree that different governments accumulate this much, it would still be almost impossible for all of them to collaborate to 'hurt' the network, they don't collaborate on so many things, so why this?Areas like the combat of money laundering are where they cooperate a lot. Even a \"libertarian\" government like Argentina was eager to implement the latest FATF recommendations, imposing tight regulations for crypto service providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "July 30, 2024, 11:11:06 PM",
      "body": "Quote from: Fivestar4everMVP on July 30, 2024, 07:00:19 PMQuote from: d5000 on July 30, 2024, 06:31:52 PMSome Bitcoiners seem to be enthusiastic about plans by politicians to buy or hold big amounts of Bitcoin as part of a \"strategic reserve\". In particular, Kennedy's announcement that in the (extremely unlikely) case he wins the US election he could buy up to four million Bitcoins as a strategic reserve.I don't like this idea for the following reason:States holding such a big amount could interfere too much into Bitcoin's power equilibrium.Let's see the following hypothetical scenario:- The US buys 1-2 million BTC, other states/central banks like the ECB, China and India follow, and together they hold let's say 5-7 million (about 25%-35% of all existing Bitcoins).- Now the FATF sets up a new \"recommendation\" that a blacklist for \"sanctioned\" Bitcoin addresses (like those already implemented in Tether and other stablecoins) would be desirable.- As almost all states obey the FATF's guidelines, together they pressure Bitcoin Core team to implement a blacklist for \"sanctioned\" Bitcoin addresses which miners have to obey, or alternatively build an own Bitcoin client with a modified protocol.- This would of course need a hard fork. But they have a lot of coins, so they can increase pressure by threatening to sell all Bitcoins on the chain which does not follow the hard fork. This has a precedent: it's what Ethereum did when they pressured for the hard fork rewinding the TheDAO hack in 2016.A similar scenario was already discussed for ETFs. But ETFs would never hold so many coins as some are desiring for states/governments to hold, and also their customers could react, so for ETFs I don't see this danger. Up to 1 million, even 2 millions of BTC hold be states/governments/central banks would still not be something to be worried about. But if all bigger states try to buy millions, then it could become really dangerous.I don't think Bitcoin would \"die\" in such a scenario, but I think it could lose a lot of value and confidence. And the scenario is not that unlikely to be ignored.What do you think? I added a poll also with an intermediate scenario like the one announced by Trump, which would lead to a couple of hundred thousands of BTC hold by states, but not millions.Well, you are seeing this from one angle and failing to see it from another angle, the dangers you talked about are there just as you have described it, but did you even bother a bit to ask yourself, what it will take to buy up to 2 million or more bitcoin from the open market? Even buying 50,000 bitcoin can drive the price of bitcoin up high to the roof, not to talk of buying up to 1 or 2 million bitcoins, buying up to this mentioned about of bitcoin, I can tell you will drive the price of bitcoin to nothing less than a million Dollar, now think about what will happen when one have to spend up to a million dollars just to own 1 bitcoin, and you need like 1 million bitcoins, and remember the more you buying, the more expensive it gets.This is why I think it's not really all that easy for any individual or governments to own up to 2 million bitcoins without them emptying their reserve or treasury. At this point we take every speech as poitical strategy and ways to gain bitcoinairs trust and support, because the real game will start when they eventually win the election, because buying such huge amount of bitcoin with tax payers money will raise alot controversies because this is public funds we are talking about, but if say it about individual buying, that can be understood, but spending such huge amount in buying bitcoin from the state coffers will not work, at least not as easy as he make it sound, take for example the case with El Salvador bitcoin adoption and holding, when the president spent some money in buying bitcoin as a reserve for the government, it citizens and section of the country kicked against, and that slowed down the rate at which the president could buy bitcoin for state reserved.So for sure no matter what be the political candidates interest and motivation towards bitcoin when it comes to state own reserved in bitcoin, it will go through alot of regulations and debate before such huge amount of bitcoin buying can be approved and executed by the president, so the president does not have the unilateral right to make decisions as he seem fit not in volitile topics like bitcoin investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mrmacintosh",
      "created_time": "July 30, 2024, 11:21:13 PM",
      "body": "Quote from: Odusko on July 30, 2024, 11:11:06 PMQuote from: Fivestar4everMVP on July 30, 2024, 07:00:19 PMQuote from: d5000 on July 30, 2024, 06:31:52 PMSome Bitcoiners seem to be enthusiastic about plans by politicians to buy or hold big amounts of Bitcoin as part of a \"strategic reserve\". In particular, Kennedy's announcement that in the (extremely unlikely) case he wins the US election he could buy up to four million Bitcoins as a strategic reserve.I don't like this idea for the following reason:States holding such a big amount could interfere too much into Bitcoin's power equilibrium.Let's see the following hypothetical scenario:- The US buys 1-2 million BTC, other states/central banks like the ECB, China and India follow, and together they hold let's say 5-7 million (about 25%-35% of all existing Bitcoins).- Now the FATF sets up a new \"recommendation\" that a blacklist for \"sanctioned\" Bitcoin addresses (like those already implemented in Tether and other stablecoins) would be desirable.- As almost all states obey the FATF's guidelines, together they pressure Bitcoin Core team to implement a blacklist for \"sanctioned\" Bitcoin addresses which miners have to obey, or alternatively build an own Bitcoin client with a modified protocol.- This would of course need a hard fork. But they have a lot of coins, so they can increase pressure by threatening to sell all Bitcoins on the chain which does not follow the hard fork. This has a precedent: it's what Ethereum did when they pressured for the hard fork rewinding the TheDAO hack in 2016.A similar scenario was already discussed for ETFs. But ETFs would never hold so many coins as some are desiring for states/governments to hold, and also their customers could react, so for ETFs I don't see this danger. Up to 1 million, even 2 millions of BTC hold be states/governments/central banks would still not be something to be worried about. But if all bigger states try to buy millions, then it could become really dangerous.I don't think Bitcoin would \"die\" in such a scenario, but I think it could lose a lot of value and confidence. And the scenario is not that unlikely to be ignored.What do you think? I added a poll also with an intermediate scenario like the one announced by Trump, which would lead to a couple of hundred thousands of BTC hold by states, but not millions.Well, you are seeing this from one angle and failing to see it from another angle, the dangers you talked about are there just as you have described it, but did you even bother a bit to ask yourself, what it will take to buy up to 2 million or more bitcoin from the open market? Even buying 50,000 bitcoin can drive the price of bitcoin up high to the roof, not to talk of buying up to 1 or 2 million bitcoins, buying up to this mentioned about of bitcoin, I can tell you will drive the price of bitcoin to nothing less than a million Dollar, now think about what will happen when one have to spend up to a million dollars just to own 1 bitcoin, and you need like 1 million bitcoins, and remember the more you buying, the more expensive it gets.This is why I think it's not really all that easy for any individual or governments to own up to 2 million bitcoins without them emptying their reserve or treasury. At this point we take every speech as poitical strategy and ways to gain bitcoinairs trust and support, because the real game will start when they eventually win the election, because buying such huge amount of bitcoin with tax payers money will raise alot controversies because this is public funds we are talking about, but if say it about individual buying, that can be understood, but spending such huge amount in buying bitcoin from the state coffers will not work, at least not as easy as he make it sound, take for example the case with El Salvador bitcoin adoption and holding, when the president spent some money in buying bitcoin as a reserve for the government, it citizens and section of the country kicked against, and that slowed down the rate at which the president could buy bitcoin for state reserved.So for sure no matter what be the political candidates interest and motivation towards bitcoin when it comes to state own reserved in bitcoin, it will go through alot of regulations and debate before such huge amount of bitcoin buying can be approved and executed by the president, so the president does not have the unilateral right to make decisions as he seem fit not in volitile topics like bitcoin investment.Speaking of tax money, Im curious how strong of a push for retirement funds and IRAs with BTC investment or people asking their brokers to buy up bitcoin for them to help turn a profit. I know that happens already, but that's going to be even a bigger impact if strong support for BTC arrives.However I am also like OP where I do not 100% trust governments touching this tech. They have access to many ways to control our use of it (such as limited or cutting off the internet). We already saw goverments try to control things like gold with gold buybacks and clipping. But at least it was harder back then for them to confiscate. BTC is even harder, but it's not very difficult to obstruct its use or leverage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "July 30, 2024, 11:53:52 PM",
      "body": "Quote from: d5000 on July 30, 2024, 09:34:12 PMActually a lot. Why are politicians like Kennedy proposing these things? Because they know that some Bitcoin speculators like the idea, so they can dump their coins once the \"government pump\" took the price to extreme heights.So what you can do is to not vote people who propose that, and clearly signalise that many Bitcoiners aren't interested in a government-controlled Bitcoin.Of course in countries like China this isn't possible that easy. But even there, you can raise your voice to some extent.I was not talking about stopping them through a political process such as an election. Election is a 'scam' in so many places in the world and the most popular or incumbent candidate always find a way to win, mostly through corruption i should add, so there is still a high chance that even if most of the bitcoin community don't vote for such candidates, they would still be victorious in their different countries.I don't even think the bitcoin community is that large yet, so their votes cannot decide the outcome of an election, and there is no way for bitcoiners to stop a presidential candidate who has decided to accumulate so much BTC's when in power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "July 31, 2024, 01:07:36 AM",
      "body": "Quote from: Z-tight on July 30, 2024, 11:53:52 PMI don't even think the bitcoin community is that large yet, so their votes cannot decide the outcome of an election, and there is no way for bitcoiners to stop a presidential candidate who has decided to accumulate so much BTC's when in power.I understand what you mean and I partly agree, but I meant actually something slightly different.If a candidate like Kennedy proposes to accumulate lots of Bitcoins, he does this mainly because he has some target voters in mind: a part of the Bitcoiners.If the Bitcoiners however signal him that they aren't interested in that proposal, then he probably will see that he doesn't benefit from more voters if he proposes such a thing. And he probably won't go ahead with this proposal.Ways to signal this could be for example a Bitcoin Magazine op-ed with a similar argumentation like mine in the OP, or even Satoshi appearing again like when some media suspected Dorian Nakamoto to be him, saying that the day governments own more than a million coins, he sells his 3 (?) millions.  (well, the last one was a joke but I hope you get what I mean)Of course if for example a government initiates a study and the result is that Bitcoin will increase in value and it's rational for their Central Bank to buy and hold a large amount, then it's different. Then there's not much you can do (perhaps a mass protest, in some countries it helps). But in the current situation we have candidates trying to get Bitcoiners on board with supposedly uber-bullish proposals, and in this situation, I believe Bitcoiners do have power to change these politicians' mind. If they wanted (and that's the problem ... most are probably more interested in the pump such an announcement could trigger).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "July 31, 2024, 02:58:50 AM",
      "body": "Quote from: d5000 on July 30, 2024, 06:31:52 PMI don't think Bitcoin would \"die\" in such a scenario, but I think it could lose a lot of value and confidence. And the scenario is not that unlikely to be ignored.What do you think? I added a poll also with an intermediate scenario like the one announced by Trump, which would lead to a couple of hundred thousands of BTC hold by states, but not millions.Bitcoin won't die if the network still works with good hashrates and decentralization.I am concerning more on risk of decentralization damage, decrease on Bitcoin network hash rate distribution. Governments can use their money, national treasury to purchase bitcoin if they want. Bitcoin is for everyone and it's not good to prohibit or dislike of anyone or any entity if they have money and use money to buy bitcoin.I agree that if bitcoin distribution becomes more centralized in hands of some dominant owners, it's risk of more vulnerable of Bitcoin on manipulations on the market, manipulation through policies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chigo",
      "created_time": "July 31, 2024, 03:07:55 AM",
      "body": "Quote from: d5000 on July 30, 2024, 06:31:52 PMWhat do you think? I added a poll also with an intermediate scenario like the one announced by Trump, which would lead to a couple of hundred thousands of BTC hold by states, but not millions.When an entity holds a large amount of bitcoin, it means they have a sizable portion of that limited amount of bitcoin holdings. When they have more bitcoins, it means their influence can be greater in line with the amount of bitcoins they hold, and that is something we need to be aware of because the increasing number of bitcoins they hold means they can influence the market more and that will disturbing the psychology of investors, especially retail investors.We have seen how when the German government sold their bitcoins, even though it had a little impact, but it was only 10k, we have not discussed the 100k or 1 million bitcoins that the government might sell if they had a large enough portion of bitcoin ownership. And for that reason I don't really like it when governments hold more bitcoins in their \"reserves\", because they are able to manipulate the market with how much bitcoin they hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 31, 2024, 05:18:32 AM",
      "body": "Not just governments but any centralized entity should not own a large amount of bitcoin which includes all these \"investment companies\" that have been growing like mushrooms. They all can affect the Bitcoin world in a negative way, some more than others like governments.I agree with your scenario, things like that will bring a lot more restrictions.Quote from: d5000 on July 30, 2024, 06:31:52 PM- Now the FATF sets up a new \"recommendation\" that a blacklist for \"sanctioned\" Bitcoin addresses (like those already implemented in Tether and other stablecoins) would be desirable.OFAC already does that. They have a list of \"sanctioned\" addresses that they are forcing the American miners to \"censor\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "July 31, 2024, 05:42:26 AM",
      "body": "No, everything they seize should be soldMajority who do took the poll have chosen this one on which those seized coins should really be sold but we do know that they wont really be that foolish enough on making such action but rather they would really be accumulating all of those coins that they have seized from illegal things and would be owned by them and having those plans on buying more to have that kind of stashing those coins and having that manipulative approach when time comes. They have seen that they cant be able stop Bitcoin then their plan is to accumulate as much as they could instead.They've seen that its unstoppable so their plan is what we are seeing now.Whether we do like it or not, then they would really be holding coins as much as they could. Government do really love on controlling everything and i doubt that their main target now is to accumulate to have such centralization on which its not really that shocking actually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}