{
  "id": "topic_5413919",
  "title": "meser#",
  "author": "meser#",
  "created_time": "September 17, 2022, 09:48:32 PMLast edit: September 20, 2022, 04:58:20 PM by meser#",
  "content": "Bu içerik meser# tarafından düzenlenen \"Bir yeteneğin varsa, onu kullanacağız-2 / YARIŞMA\" etkinliği için hazırlanmıştır. Sizlerinde bu etkinliğe teşriflerini ısrarla beklemekteyiz efenim Bu forumda birçok bounty kampanyası oluyor ve genellikle signature ve sosyal medya kampanyalarına mı katılıyorsunuz. Makale yazayım diyorsunuz kafanız mı mı kaldırmıyor. Video çekeyim ama yüzüm görünmesin gizliliğim baki kalsın mı istiyorsunuz? Ya da bu işlemleri halledebileceğiniz sağlam bir bilgisayarınız yoktur! O zaman bu konu belki de sizlere göredir  Sosyal medya için içerik hazırlarken genellikle Canva uygulamasını kullanıyorum. Adobe'nin after effects uygulamasında hazırlamak renderlemek birazcık yavaş oluyor malum sağlam bir bilgisayar toplama taraftarı değilim ülkemizde. Ancak son zamanlarda neden olmasın diyerek farklı bir şekilde video hazırlamayı denedim ve gayet güzel ve işlevsel oldu. O da powerpoint ve movie maker uygulaması ile oldu. İşlevsel olmasının en büyük sebebi öğrencilik yıllarımda belkide 100lerce kez slayt hazırlamış olmamın sebebiyle aşırı aşinalığım olmasıydı. Ayrıca movie maker uygulaması senelerce windows işletim sisteminin default bir uygulaması olup bilgisayarı çok yormayan ama işlevsel bir uygulama. Videolarda kesme, ekleme, birleştirme ve müzik ekleme gibi kısımlarda kullanıyorum. Tek başına powerpointte yeterli olabilmekte. 1)Öncelikle hazırlamak istediğim içeriğin genel bir şablonunu oluşturuyorum. - Kaç sayfa- Başlıklar- İçerik- Yazı fontu ( https://fonts.google.com )- İkonlar ( https://fonts.google.com/icons )- Geçişler ve animasyonlar- Fon müziği ( Elements envato ve google araması  )2) Hangi platformda nasıl bir içerik paylaşılacaksa boyutunu ayarlıyorum. Buradan slayt sayfalarının boyutunu ayarlamasını yapabilirsiniz. Örnekteki ayarlar instagram story için gerekli olan ayarlardır. 1080x1920 px'in cm'ye çevirilmiş halidir. İçeriklerde kullandığım fontları ve ikonları google sayesinde ücretsizce ediniyorum. Bazen bunların dışında yerlerden ücreti mukabilinde temin ettiğimde oluyor. İşe hazırladığım şablonu slayta ekleyerek başlıyorum. Akabinde sayfalar arasındaki geçişleri ve animasyonları içeriklere ekleyerek devam devam ediyorum. Geçişlerde zamanlamaya ve after previous ya da with previous olayına dikkat etmek gerekiyor. Videonun anlamsal bütünlüğünü bozmamak için  Örnek olarak şöyle bir video şablonunu slayt haline getirdim. Zamanlama, geçişler ve animasyonlar eklenmiş vaziyette. Tabi seslendirmeli yapmak istersenizde her slayta kendi kaydınızı program içerisinde alabilir, hazır fon müziklerini ekleyebilirsiniz.Eğer fon müziği eklediniz tüm video boyunca çalsın dersenizde. Animasyon panelinden müzik dosyasına sağ tıklayıp efekt ayarından şu ayarları yapmanız lazım  Hazırladığımız slaytı video olarak kaydetmek için şu adımları izlememiz gerekiyor. Burada kırmızı olan kısımdaki saniye ayarı size kalmış. Tadaaaa videomuz hazır. Çok hızlı bir şekilde göstermelik yaptığım bir video oldu sizde hayal gücünüzü kullanarak çok güzel slaytlar hazırlayıp bunları videoya çevirebilirsiniz. Ayrıca elements envato gibi sitelerden ücretli bir şekilde ( Keza webmaster forumlarından buraların üyeliğini çok uyguna da alabilirsiniz  ) templateler alarak bunları editleyerek çok güzel videolar hazırlayabilirsiniz  Örneğimsi videonun son hali  https://disk.yandex.com.tr/i/iY32Z67lOudPNQ",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413919",
  "comments": [
    {
      "author": "yenerbatmaz",
      "created_time": "September 18, 2022, 07:56:42 AM",
      "body": "Hocam eline emeğine sağlık adım adım anlatmışsın. Ben şimdiye kadar böyle bir şey hiç yapmadım. Yemek tarifi gibi bakıp bakıp yapmayı deneyeceğim.Teşekkürler...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "September 18, 2022, 08:00:38 AM",
      "body": "Hocam sağolun bilgiler çok aydınlatıcı oluyor, powerpoint ile böyle bir şey olduğunu da yeni öğreniyorum, öğrencilik hayatımda sıkça kullanırdım sunum için tabi biz basit şekilde kullanırdık, programı aç, resimleri kopyala yapıştır altına metin kopyala yapıştır, derste oku şeklindeydi, siz bu şekilde video hazırlanacağını öğrettiğiniz için büyük sevaba girmiş olabilirsiniz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "September 18, 2022, 03:45:59 PM",
      "body": "Ekleyeceğim konular arasından bunu çıkartıyorum belki bir kaç ekleme yaparım, elinize sağlık çok güzel olmuş  Eğitimle ilgili konulara başlamayı düşünüyorum ama bu ara pc başında olamıyorum bu tip konular her zaman yardımcı olacak ve adım adım anlatıldığı için de işleri kolaylaştırıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "September 18, 2022, 03:55:01 PM",
      "body": "Quote from: eightdots on September 18, 2022, 03:45:59 PMEkleyeceğim konular arasından bunu çıkartıyorum belki bir kaç ekleme yaparım, elinize sağlık çok güzel olmuş  Eğitimle ilgili konulara başlamayı düşünüyorum ama bu ara pc başında olamıyorum bu tip konular her zaman yardımcı olacak ve adım adım anlatıldığı için de işleri kolaylaştırıyor. Çıkartmayın hocam sizde geçişler ve animasyonlar üzerine bir kısım yazın detaylı ben burada o kısımları basit tuttum misal. Gerçektende animasyon ve geçişlerde yetenekli olmak güzel işler çıkartmayı sağlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "September 18, 2022, 04:53:32 PM",
      "body": "Elinize sağlık meser# hocam güzel paylaşım olmuş. Herkes video hazırlamaya hakim olmayabilir. Biraz basit ve pratik kullanımla böyle iş kurtarır videolar hazırlanabiliyormuş demek. Örnek videoya baktım benim telefonda sorun olabilir belki. Yer yer geçişler çok kısa sürüyor. Eğer o geçiş araları da ayarlanabilirse güzel bir sistem olmuş oluyor. Tabi asıl video teknik cihazlar ve renderlama gibi işlemlerle profesyonel olarak oluyor o ayrı bir şey ama bu da günü kurtarır sağolun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}