{
  "id": "topic_5463644",
  "title": "Justin999",
  "author": "Justin999",
  "created_time": "August 17, 2023, 10:51:40 PM",
  "content": "Next bull run is getting so close and so it won't be bad if buy some low cap altcoins for it. I know that is risky step but what to do? Btc ether already pump a lot and my budget is low. I manage extra budget for buy those altcoins.so can you suggest some low cap altcoins name? Quote  Please don't throw btc, Ether, bnb, doge, xrp names blindly (some people always suggest btc eth bnb xrp everywhere)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463644",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 17, 2023, 11:02:56 PM",
      "body": "Bitcoin is the best that I can advice someone to buy. For altcoins: ADA, DOT, QTUM, SOL, SAND, GALA, MATIC are some good ones. But the first I can recommend is not an altcoin which is bitcoin.Be careful with altcoins, they are more volatile and risky.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "August 18, 2023, 03:58:51 AM",
      "body": "Quote from: _act_ on August 17, 2023, 11:02:56 PMFor altcoins: ADA, DOT, QTUM, SOL, SAND, GALA, MATIC are some good ones. But the first I can recommend is not an altcoin which is bitcoin.These currencies have been removed from some exchanges due to the new regulatory restrictions, and therefore access to liquidity in them is low and their price may not increase much.I recommend all the non-staking currencies in addition to Monero Tezos, Zcash, PancakeSwap and CEXs Coins.Altcoins are good for short-term trading, but buying them now and storing them for a long time is not profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FahriZah",
      "created_time": "August 18, 2023, 05:21:03 AM",
      "body": "Low cap altcoins for next bull run it’s finding very difficult for everyone because when start next bull run anybody don,t know about that next bull run and we just expected next bull run start 2024 It's just our dreams so if your need good coins for next bull run than do your own Research (DYOR) IT'S better and you can buy some.- RARI,DOT,MATIC,ZCASH,ZIL,MYRA,DOGE,ICP Etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jocuserious",
      "created_time": "August 18, 2023, 05:51:18 AM",
      "body": "You are now living in a sea of ​​bull market dreams so buying weak altcoins on impulse can drown you. Moreover, the coins you are refraining from mentioning may storm the bull market at some point.I think you are thinking of buying more coins with less capital like meme coin! Your idea is that you want to get rich quick!Very few people got rich quick from crypto so put them away and meme coin is very dangerous at this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "August 18, 2023, 07:02:08 AM",
      "body": "Quote from: Justin999 on August 17, 2023, 10:51:40 PM(...)The problem is that OP has accepted to take risks with high returns, I have observed the market about some recently launched projects such as HOOK, ID,... and they can be considered completely. and accumulate to the next bull cycle in the market.Perhaps you also need to do more research on the issue of unlocking tokens of different projects to observe when and have a strategy to buy them. I still want to advise newcomers to start with basic investment first to come to bitcoin, don't just look at the profit imaginary but imagine the risks involved even if that amount of money you can also ready to lose. Low capital does not mean that it is impossible to accumulate great value cryptos, because they will still increase in price, and things that bring quick profits like you just want to buy a lottery ticket in this market and that's for sure not investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "August 18, 2023, 08:22:23 AM",
      "body": "Quote from: Justin999 on August 17, 2023, 10:51:40 PMNext bull run is getting so close and so it won't be bad if buy some low cap altcoins for it. I know that is risky step but what to do? Btc ether already pump a lot and my budget is low. I manage extra budget for buy those altcoins.so can you suggest some low cap altcoins name? I want to ask you one thing first, how do you define low cap altcoins? would it be altcoins with a market cap under $100K? If so, then the answer is degen tokens that appear almost every time.But these altcoins are very very risky and I doubt you will be strong enough to hold them. My advice, it would be better if you invest in blue chip altcoins like new start-ups like $SEI and $CYBER. Don't you know that these few days they are getting hype in the market?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 18, 2023, 08:45:02 AM",
      "body": "Its gonna be a lot of low marketcap potential coins such as injective, chromia, mina, icp, and many more. But if I were you might want to look on strong L1 projects and new L2 such as arbitrum and optimism. We can say that these projects wont do any recovery on bull run. First we should monitor big ones like bitcoin and eth and make sure they pump so alts can follow cause if not theres no possibility of mrga bull run like last time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "August 18, 2023, 10:05:56 AM",
      "body": "I never recommend you to choose a project that still has a low market capitalization. Because usually such projects have a lot of flaws. Like very potentially a scam. I know you say that your budget is small but isn't it better to make a little profit than to lose it all?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "August 18, 2023, 10:19:31 AM",
      "body": "Quote from: cryptoaddictchie on August 18, 2023, 08:45:02 AMIts gonna be a lot of low marketcap potential coins such as injective, chromia, mina, icp, and many more. But if I were you might want to look on strong L1 projects and new L2 such as arbitrum and optimism. We can say that these projects wont do any recovery on bull run. First we should monitor big ones like bitcoin and eth and make sure they pump so alts can follow cause if not theres no possibility of mrga bull run like last time. How can Injective and Internet Computer be included in the low cap category? they already have a sizeable market cap and it's going to be difficult to get x2 or x3 of the investment if we do it now. I understand the intent and purpose of the OP, he wants maximum return from the small investment he wants to make, therefore I suggest looking at new projects that are at L1 or L2, because of course they still have a low market capitalization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gurunanakji777",
      "created_time": "August 18, 2023, 10:25:36 AM",
      "body": "If you ask me, I always recommend Bitcoin or Ethereum as the top choices for investment with minimal risk. However, if someone isn't inclined toward these high-potential cryptocurrencies, I suggest considering Ada, Doge, Matic, XRP, Rndr, Dot, Solana, and FTM.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 18, 2023, 10:25:42 AM",
      "body": "Quote from: MAAManda on August 18, 2023, 10:19:31 AMHow can Injective and Internet Computer be included in the low cap category? they already have a sizeable market cap and it's going to be difficult to get x2 or x3 of the investment if we do it now. If you are gonna for short term then pick a much riskier and lower marketcap. But if you aim to have a moderate one with full potential, I think injective can go beyond 5x or more on the bull market. With its 100m supply, this size means nothing. Even bnb have bigger circulating supply and look on its price? When talking about triggering the bull run we wont gonna look for 10k mcap or 100k mcap and goes $1billion mcap suddenly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "August 18, 2023, 10:48:05 AM",
      "body": "Quote from: cryptoaddictchie on August 18, 2023, 10:25:42 AMIf you are gonna for short term then pick a much riskier and lower marketcap. But if you aim to have a moderate one with full potential, I think injective can go beyond 5x or more on the bull market. With its 100m supply, this size means nothing. Even bnb have bigger circulating supply and look on its price?A large amount of circulating supply is not a core factor for a project to be the public's choice in crypto, $BNB is where they are now due to the various utilities offered by their token, so they deserve to be where they are today. But what about Injective? what do they offer? you even said that they can get x5 during the bullrun.Image Source: MarketcapofI've checked through Marketcapof, Injective will get at least x5 if they manage to be on the MC of the Avalanche project. Avalanche is a project that has an ecosystem, are you sure about your words that Injective can get x5 later?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 18, 2023, 11:48:28 AM",
      "body": "Quote from: Justin999 on August 17, 2023, 10:51:40 PMNext bull run is getting so close and so it won't be bad if buy some low cap altcoins for it. I know that is risky step but what to do? Btc ether already pump a lot and my budget is low. I manage extra budget for buy those altcoins.so can you suggest some low cap altcoins name? Quote  Please don't throw btc, Ether, bnb, doge, xrp names blindly (some people always suggest btc eth bnb xrp everywhere)  If you don't want those typical cryptos that are always being suggested, no matter if you don't want to hear them then you'll just keep on hearing them being suggested by everybody. And that is because they've been the best-performing cryptos in the market. If the choice you want to have are those low cap altcoins, look at those recently added on the list of coinmarketcap, usually they're the new coins that have been added that has a very low market cap. See the link for your reference;(https://coinmarketcap.com/new/)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "August 18, 2023, 07:23:49 PM",
      "body": "I don't get why btc, eth, bnb and so forth shouldn't be said, because they are great. But if we are going to talk only about lower cap ones, I would suggest checking only top 100 and not anything lower. If you look at anything outside of top 100 then you are going to get screwed eventually, it just doesn't work at all on the long run.ARB is a new good one, aave is fine, axie used to be amazing and maybe they will make a come back with the new bull run, tezos is huge in funding part, eos is loved by certain communities, dash, wave, mina, chz, neo are all names that used to be a lot better. I mean I still would prefer the top ones, but if you insist on lower ones then these are the ones that could make a lot more sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oneandpure",
      "created_time": "August 18, 2023, 08:01:28 PM",
      "body": "Quote from: Justin999 on August 17, 2023, 10:51:40 PMNext bull run is getting so close and so it won't be bad if buy some low cap altcoins for it. I know that is risky step but what to do? Btc ether already pump a lot and my budget is low. I manage extra budget for buy those altcoins.so can you suggest some low cap altcoins name? Quote  Please don't throw btc, Ether, bnb, doge, xrp names blindly (some people always suggest btc eth bnb xrp everywhere)  No doubt with many people suggest for investing in Bitcoin, ETH, BNB and XRP coin because they want recommended the best coins for investing, but you was right in cryptocurrency have many kinds of coins and not always priority with investing in Bitcoin or Ethereum as profitable coins only. You could try to buy LTC current price have been drop to $64, its good moment right now after bitcoin crashing have opportunity for investing in many kinds of altcoin have been dropped today. Not only with LTC or Litecoin but also Matic is seems good choose coins for investing because drop drastically from All time high price raise last year. Both coins between LTC and Matic I think the best option for investing right based on you not agree with suggest to invest in BTC, ETH or BNB coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victorik",
      "created_time": "August 18, 2023, 08:02:55 PM",
      "body": "With the way the market is, it will take sheer luck to get a low cap altcoins that will not rug you eventually, because the scams out there is just crazy. So, for now i will stick to the already established coins and increase my bags.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "August 18, 2023, 08:13:08 PM",
      "body": "Quote from: Justin999 on August 17, 2023, 10:51:40 PMNext bull run is getting so close and so it won't be bad if buy some low cap altcoins for it. I know that is risky step but what to do? Btc ether already pump a lot and my budget is low. I manage extra budget for buy those altcoins.so can you suggest some low cap altcoins name? Quote  Please don't throw btc, Ether, bnb, doge, xrp names blindly (some people always suggest btc eth bnb xrp everywhere)  At the end of the day you have to realize why people recommend being in bitcoin or altcoins like ETH because the odds are greater and there is more chance for returns.Your low budget actually cannot be used as a concrete reason for this because we can still buy even if our budget is small. It's just that you are expecting a much bigger return which makes you rule out some good coins. On the other hand IMO this also encourages a lot of people who expect about shitcoin which indirectly your goal is more directed there.I don't want to suggest anything if indeed the context is more directed towards shitcoin because it's the same as inviting new people to schemes that are actually far more dangerous than being in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "miruha333",
      "created_time": "August 19, 2023, 08:08:59 AM",
      "body": "Quote from: Victorik on August 18, 2023, 08:02:55 PMWith the way the market is, it will take sheer luck to get a low cap altcoins that will not rug you eventually, because the scams out there is just crazy. So, for now i will stick to the already established coins and increase my bags.I am not knowledgeable on altcoins. I refuse to take risks as I am aware it would not bring any profit. My practice has shown me the importance of holding investments, which is why I am still a holder at present.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rupok",
      "created_time": "August 19, 2023, 01:56:31 PM",
      "body": "Projects that are priced too low do not generate very good profits, and may not last long in the market.  I never suggest you to choose a project which still has low market capitalization because they create hype for few days and go down easily.  Such projects have very little utility and many flaws, very likely a scam. I think not all coins storm in a bull market.  You should do some more market research.  Because even with small capital good profit can be achieved if you invest right coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}