{
  "id": "topic_5465852",
  "title": "steeev",
  "author": "steeev",
  "created_time": "September 06, 2023, 12:15:28 PM",
  "content": "I have recently been in contact with a developer (Craig Raw) on Github regarding my inability to import an old keystore type electrum.dat file into Sparrow wallet.https://github.com/sparrowwallet/sparrow/issues/1080He has been looking into the problem and i have been attempting to inform him of the nature of the keystore aspects of the wallet that fails to import.Looking through previous releases of Electrum (1.8 - 1.9.8 ) which date from around the time (2013) i created the wallet, has shown the seed type in the wallet files to be of an 'old' type, shown as a 32 character alphanumeric string,and the 'seed version' to be 4 in all releases.However, the wallet i have has a wildly different type of seed in the keystore section of the wallet file - with a varied set of strings joined by plus signs, with an equals sign at the end of it, in a much longer overall string.The 'seed version' number is also different, being 18.I'm interested if anyone here can advise as to why my seed and version are so different.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465852",
  "comments": [
    {
      "author": "Findingnemo",
      "created_time": "September 06, 2023, 02:27:52 PM",
      "body": "Quote from: steeev on September 06, 2023, 12:15:28 PMinability to import an old keystore type electrum.dat file into Sparrow wallet.Electrum wallet.dat files are different from qt wallet.dat files and you cannot use the Electrum wallet.dat file to import into another wallet (correct me if I am wrong).Quote from: steeev on September 06, 2023, 12:15:28 PMLooking through previous releases of Electrum (1.8 - 1.9.8 ) which date from around the time (2013) i created the wallet, has shown the seed type in the wallet files to be of an 'old' type, shown as a 32 character alphanumeric string,and the 'seed version' to be 4 in all releases.However, the wallet i have has a wildly different type of seed in the keystore section of the wallet file - with a varied set of strings joined by plus signs, with an equals sign at the end of it, in a much longer overall string.The 'seed version' number is also different, being 18.I'm interested if anyone here can advise as to why my seed and version are so different.So you have two different seed phrases that entirely belong to different wallets but did you try to import the wallet using the seed alone?Just forgot the Sparrow wallet, try importing the wallet in the Electrum itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 06, 2023, 04:37:55 PM",
      "body": "Why are you trying to import the old version of the Electrum keystore to the Sparrow wallet that was just released recently.The Electrum.dat file generated from the old version of Electrum has a different structure and it might not work to import to Sparrow wallet. To fix this issue you will need to update the wallet to a new wallet structure to get the right seed or to extract the private key and import it to the Sparrow wallet.If you want to update the Electrum.dat structure you will need to import it to the latest version of Electrum it should be automatically updating to the new wallet structure which is a default_wallet file with no file extension. Once it's than you can use the console to extract private keys and then import it to Sparrow wallet.Take note before you do it make sure you have a backup copy of the old electrum.dat file in case you fail to update the wallet structure.Also, read this old thread below from pages 1 to 2 so you can maybe get some idea of how to update the wallet structure of Electrum wallet.- https://bitcointalk.org/index.php?topic=325364.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "steeev",
      "created_time": "September 07, 2023, 04:49:17 PM",
      "body": "The replies to my question here, however well intentioned, do not address the actual problem i am attempting to solve.Perhaps i wasn't clear enough in my description of the situation.The electrum.dat wallet file i have is from around the 2013 period - however, in comparing the seed structure of my wallet to other electrum.dat wallets i have created using older releases of the electrum client from the same period, it appears that the seed structure of the wallet i have is markedly different to the 32 character alphanumeric strings that the other wallets i have been creating present in their wallet files, despite them also being of the electrum.dat type.The developer of Sparrow is attempting to support importing old keystore type electrum wallets into his project, and has been asking me to examine the structure of my wallet to ascertain how he can go about doing this.As i have mentioned, the older releases of Electrum i have downloaded (from the 'Previous Releases' Index on Electrum.org ) and created wallets with use a 32 character structure for defining the seed in the electrum.dat wallet file, with a seed version defined as 4, BUT mine, despite being from the same period, does not.The seed structure of my wallet file is defined by a much longer string, containing several groups of alphanumeric data joined together by plus signs, with an equals sign at it's end - and the 'seed version' of the wallet is defined as 18. I am attempting to discover why my wallet is so different in it's wallet seed structure and seed version number to the other electrum.dat wallets i am able to create using the older releases of the client.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 08, 2023, 11:18:22 AM",
      "body": "No idea but a few questions and a couple of possibilities:Does the wallet actually open in electrum?Did you ask in the electrum github?Was it created in a machine that was defaulted to a different language / character sets? I have had issues where other things got weird when other languages were defaulted.Could someone have tampered with the file? Had you ever looked at the files before this? 10+ years is a long time, going from machine to machine and electrum version to electrum version something might have gotten changed.Sorry that I can't help more, it's an odd one but having more info always helps figuring out an issue.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Joeyp",
      "created_time": "September 13, 2023, 05:49:18 PM",
      "body": "You could ask thomas or ghost on the #electrum irc chat channel about old wallet versions/keystore problem via Electrum webpage. If it will not help, then wallet is lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ghost43",
      "created_time": "September 13, 2023, 06:13:26 PM",
      "body": "Quote from: steeev on September 07, 2023, 04:49:17 PMThe seed structure of my wallet file is defined by a much longer string, containing several groups of alphanumeric data joined together by plus signs, with an equals sign at it's end - and the 'seed version' of the wallet is defined as 18. I am attempting to discover why my wallet is so different in it's wallet seed structure and seed version number to the other electrum.dat wallets i am able to create using the older releases of the client.That sounds like base64 encoding, which suggests the seed is encrypted. Are you by any chance comparing a wallet file that has a password set with one that does not?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "September 14, 2023, 09:25:54 AM",
      "body": "Quote from: steeev on September 07, 2023, 04:49:17 PMI am attempting to discover why my wallet is so different in it's wallet seed structure and seed version number to the other electrum.dat wallets i am able to create using the older releases of the client.Is there a chance that you've opened your old electrum.dat file with version 3.3.x at least once?Because if you did, that'll upgrade the wallet structure and the seed version indicated there.Here's one example wallet file that I created with version 1.8 (with password = encrypted seed):Code:... 'master_public_key': '6d3e5a438a3732eac63424e7bf8d5a62976a443358f65cf7ec3e1e526c716addbdb738d83903e94d825152a8aedf8bb284170339a77eca1e21264bbd889ec78d', 'auto_cycle': False, 'use_encryption': True, 'server': 'electrum.bitcoins.sk:50002:s', 'blockchain_headers_path': 'M:\\\\ExtraLaunchers\\\\Electrum_1.8_installed', 'seed': '+7veyasvUYvJh/+mk6cD0zaEsulHmRP6VahtMqYIjeZgcm/85fsnvttCwOu5Wfy4+4ogc3aVL/n9A4l1XnPuhA==', 'accounts': {0: {0: ['1ChT8dU8FKZcwBTuQeJjhqaHs7oQLkY64e', '1MYH6WYXos8bbvvfzHKhayac9WZi5bavjx', '1P2CvojvqA9qtwU55diVMct2G5wwWdV6Dx', '1Jxes2KfiZfK7vXaQav8mDQXBEw3DH6FbL', '1mqG9nfCMezHe9snaC5fVdXEL7hWbGkx9'], 1: ['13BKoS6nQ1rN14esPSHt5ZYE7mZfJX9aaM', '1Ar2ZwK7NEAhUBgKQ4BNCwA1T3hfUQr2rK', '1DMrSLSDX8B1WwkkNSy3VUFqfcSS8pJHtY'], 'name': 'Main account'}}, 'proxy': None, 'imported_keys': {}, 'seed_version': 4, ...Then after loading it with Electrum v3.3.4 (upgrading it in the process), here's what it looks like:Code:...    \"keystore\": {        \"mpk\": \"6d3e5a438a3732eac63424e7bf8d5a62976a443358f65cf7ec3e1e526c716addbdb738d83903e94d825152a8aedf8bb284170339a77eca1e21264bbd889ec78d\",        \"seed\": \"+7veyasvUYvJh/+mk6cD0zaEsulHmRP6VahtMqYIjeZgcm/85fsnvttCwOu5Wfy4+4ogc3aVL/n9A4l1XnPuhA==\",        \"type\": \"old\"    },    \"proxy\": null,    \"seed_version\": 18,...In your use-case, you'll need intact backups that weren't opened yet by any other versions of Electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}