{
  "id": "topic_5455689",
  "title": "Aforhok",
  "author": "Aforhok",
  "created_time": "June 07, 2023, 10:10:51 PM",
  "content": "Border opening can either be harmful or be helpful to a country, it works vice versa. It can be harmful in the sense that bad goods and services can be brought in,weapons can be smuggled in, illegal migration of non citizens can have quick access to a country when the border officials are corrupt.      It can also be helpful due to the price of goods and services because there will be competition in the market place there by making goods cheaper, it also strengthen international relationship.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455689",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "June 07, 2023, 11:32:43 PM",
      "body": "It is a sensitive topic, actually. Specially in the United States and Europe.On one hand, there should be clear and strong immigration laws and legal path for those who seek to move into a new country in the correct way, on the other hand those who are desperate enough to risk their life and freedom also are supposed to be considered, they are human beings after all. A Border is not only about drug smuggling or illegal activity, there are also cultural and human barriers which should not let us forget we all bleed and suffer the same way as human beings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aforhok",
      "created_time": "June 08, 2023, 08:38:44 PM",
      "body": "Quote from: Hispo on June 07, 2023, 11:32:43 PMIt is a sensitive topic, actually. Specially in the United States and Europe.On one hand, there should be clear and strong immigration laws and legal path for those who seek to move into a new country in the correct way, on the other hand those who are desperate enough to risk their life and freedom also are supposed to be considered, they are human beings after all. A Border is not only about drug smuggling or illegal activity, there are also cultural and human barriers which should not let us forget we all bleed and suffer the same way as human beings.No country is stopping immigrants but it has to be done the right way, those who are desperate due to no documents or financial constrain should remain in their country because going  into another country you don't know anybody can lead to different crime just to survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 08, 2023, 11:22:19 PM",
      "body": "Quote from: Hispo on June 07, 2023, 11:32:43 PMIt is a sensitive topic, actually. Specially in the United States and Europe.On one hand, there should be clear and strong immigration laws and legal path for those who seek to move into a new country in the correct way, on the other hand those who are desperate enough to risk their life and freedom also are supposed to be considered, they are human beings after all. A Border is not only about drug smuggling or illegal activity, there are also cultural and human barriers which should not let us forget we all bleed and suffer the same way as human beings.I agree with you the problem is not in the border being opened or closed, the problem is what are the laws and regulations that have been put in place to regulate the activities and check both entry and exit of a country's border to checkmate if everything follows governments policy and laws, border mean a lot to a country since that is the door to the country it must be safe guided if not a country can lose their freedom through Unchecked access in some borders, like in my country where the land border has been freely accessed by foreigners from other close countries and thahas affecteded the security situations here as the is a high rate of arms smuggling for illegal use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 08, 2023, 11:45:50 PM",
      "body": "Quote from: Wiwo on June 08, 2023, 11:22:19 PMQuote from: Hispo on June 07, 2023, 11:32:43 PMIt is a sensitive topic, actually. Specially in the United States and Europe.On one hand, there should be clear and strong immigration laws and legal path for those who seek to move into a new country in the correct way, on the other hand those who are desperate enough to risk their life and freedom also are supposed to be considered, they are human beings after all. A Border is not only about drug smuggling or illegal activity, there are also cultural and human barriers which should not let us forget we all bleed and suffer the same way as human beings.I agree with you the problem is not in the border being opened or closed, the problem is what are the laws and regulations that have been put in place to regulate the activities and check both entry and exit of a country's border to checkmate if everything follows governments policy and laws, border mean a lot to a country since that is the door to the country it must be safe guided if not a country can lose their freedom through Unchecked access in some borders, like in my country where the land border has been freely accessed by foreigners from other close countries and thahas affecteded the security situations here as the is a high rate of arms smuggling for illegal use. Besides the smuggling and the illegal stuff which can happen because bad people take advantage of the desperation of others, there is also the theory about the cultural impact the massive immigration can have on a country, some people say the impact can be possitive or negative. I personally think it can be both, because immigration bring both bad and good people, but we should never discriminate based on skin color,.religion or nationality. We are all human, after all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "June 09, 2023, 10:27:26 AM",
      "body": "Quote from: Hispo on June 08, 2023, 11:45:50 PMQuote from: Wiwo on June 08, 2023, 11:22:19 PMQuote from: Hispo on June 07, 2023, 11:32:43 PMIt is a sensitive topic, actually. Specially in the United States and Europe.On one hand, there should be clear and strong immigration laws and legal path for those who seek to move into a new country in the correct way, on the other hand those who are desperate enough to risk their life and freedom also are supposed to be considered, they are human beings after all. A Border is not only about drug smuggling or illegal activity, there are also cultural and human barriers which should not let us forget we all bleed and suffer the same way as human beings.I agree with you the problem is not in the border being opened or closed, the problem is what are the laws and regulations that have been put in place to regulate the activities and check both entry and exit of a country's border to checkmate if everything follows governments policy and laws, border mean a lot to a country since that is the door to the country it must be safe guided if not a country can lose their freedom through Unchecked access in some borders, like in my country where the land border has been freely accessed by foreigners from other close countries and thahas affecteded the security situations here as the is a high rate of arms smuggling for illegal use. Besides the smuggling and the illegal stuff which can happen because bad people take advantage of the desperation of others, there is also the theory about the cultural impact the massive immigration can have on a country, some people say the impact can be possitive or negative. I personally think it can be both, because immigration bring both bad and good people, but we should never discriminate based on skin color,.religion or nationality. We are all human, after all. You are right Hispo, boarders have both their positive and negative impact to a country. Illegal activities is part of human nature due to the way we find ourselves in the other side of life. It is not everyone that will enter a house through the front door, some will follow the back door and some from the window. What I mean is that all fingers are not equal and therefore migrants migrate not have the legal access to a neighboring country but through the boarders, these migrants can have easy access to such country to add labour force to that country's economy. Smuggling is what is mostly common within boarders,I don't know if am correct with this statement because in my country this is what happens in our boarders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "June 09, 2023, 11:02:26 AM",
      "body": "Quote from: Aforhok on June 07, 2023, 10:10:51 PMBorder opening can either be harmful or be helpful to a country, it works vice versa. It can be harmful in the sense that bad goods and services can be brought in,weapons can be smuggled in, illegal migration of non citizens can have quick access to a country when the border officials are corrupt.      It can also be helpful due to the price of goods and services because there will be competition in the market place there by making goods cheaper, it also strengthen international relationship. One of the dangers of opening a country's border is that it affects local industries negatively. If imported goods are cheaper people will buy more foreign goods and fewer goods produced by indigenous industries which makes them lose market share. When they don't make a profit it will lead to a decline or fall of the industries thereby encouraging unemployment. Donald Trump once shut the American borders against Chinese goods to boast the local industry of the US. Just recently some countries in Europe had to control their borders to reduce the inflow of cheap Ukrainian grains because the local farmer needs to be protected from losses.But it could lead to the transfer of technology and ideas. People can migrate to a country with skills and technology. When goods and services freely flow in and out of different countries there is always a transfer of investment, financing, skills, and technology. The best carpenters in my country are from a neighboring nation and they have gradually transferred their skills to the local carpenters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "June 09, 2023, 01:21:26 PM",
      "body": "Quote from: Aforhok on June 07, 2023, 10:10:51 PMBorder opening can either be harmful or be helpful to a country, it works vice versa. It can be harmful in the sense that bad goods and services can be brought in,weapons can be smuggled in, illegal migration of non citizens can have quick access to a country when the border officials are corrupt.      It can also be helpful due to the price of goods and services because there will be competition in the market place there by making goods cheaper, it also strengthen international relationship. What happens to the culture of a country when you systematically import immigrants into a country, illegally or not, who don't conform to the values of said country?Just recently -- Syrian refugee goes on mass stabbing attack targeting children and women: https://news.sky.com/story/syrian-refugee-who-stabbed-british-child-and-five-others-in-annecy-knife-attack-was-denied-asylum-in-france-12899146Turns out many of these Syrian refugees don't adapt to westernized culture very well.The crime increases, and more cultural fragmentation within society leads to weaker social capital and structure. Sure, if you want cheap labor just bring in cheap workers from other countries. But there are long term impacts that go beyond the economic benefits. Culture can be lost in less than a generation -- a country is not a country without closed borders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 09, 2023, 02:37:56 PM",
      "body": "Opening of boarders has advantages and it disadvantages but provided that the government officials and leaders will be upto task by not being bias in their role and discharge of duties, the reopening is worth encouraging for because many illicit entries will be apprehended at he boarder entrance to curb all forms of infiltrations and importations of illegal weapons, drugs and other materials for use which could serve a big danger in transmission of illegal items to ones country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "June 09, 2023, 09:10:02 PM",
      "body": "If there is an effort to control what goes through the border and it is working fine, there should be need to consider closing the border in the first place. Countries close their borders mainly when it has become an Access point for things and people not needed in a country to enter. Although closing the borders will not stop these activities completely, it will make things more difficult for people involved and will have the effect of reducing the number of these things or people not needed. Countries that want to border to be opened and what to control the activities need to be prepared, because it is always a big task. Officials there are always more likely to become corrupt after a while because of the constant bribes that is offered to them to let some things pass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "June 09, 2023, 11:16:41 PM",
      "body": "Quote from: Queentoshi on June 09, 2023, 09:10:02 PMIf there is an effort to control what goes through the border and it is working fine, there should be need to consider closing the border in the first place. Countries close their borders mainly when it has become an Access point for things and people not needed in a country to enter. Although closing the borders will not stop these activities completely, it will make things more difficult for people involved and will have the effect of reducing the number of these things or people not needed. Countries that want to border to be opened and what to control the activities need to be prepared, because it is always a big task. Officials there are always more likely to become corrupt after a while because of the constant bribes that is offered to them to let some things pass.It is easier in some countries than in others, let us not forget that.In the case of the United States, the border is such a long line that in my opinion is a titanic work to even try to control the influx of people and smuggling.That is the most obvious case and the one that appears more on news.In the case of the other countries like those in the European continent they have natural barriers which can prevent the flux to be as big as into the USA, the Mediterranean sea and the mountains of central Europe.  I have seen people on internet calling to let immigrants to die to those natural obstacles instead of helping them to survive. It is simply heartbreaking how society can be sometimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "June 09, 2023, 11:55:35 PM",
      "body": "Quote from: Aforhok on June 07, 2023, 10:10:51 PMweapons can be smuggled inWhen you talk about smuggling, whether or not border is closed, smuggling takes place. So, rather than a government trying to close bother totally, they should instead try to reinforce the agencies in charge of checking the Inter country movement of goods and people.If you because of bad eggs and shut the whole border against a country, it will bounce back to your people when your business will begin to cripple. The world is connected, everyone country needs another's help to survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "montaga",
      "created_time": "June 10, 2023, 05:11:41 AM",
      "body": "Fact every country is a company. Without benefits very few refugees would reside in places where money miraculously arrives in bank account for doing nothing. The residents of a company (country) are part of the assets. You may support any company or become a  sovereign individual.The bribery system in place of supporting a particular company only works with freely printed money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "June 10, 2023, 07:59:21 AM",
      "body": "Quote from: Gyfts on June 09, 2023, 01:21:26 PMWhat happens to the culture of a country when you systematically import immigrants into a country, illegally or not, who don't conform to the values of said country?Just recently -- Syrian refugee goes on mass stabbing attack targeting children and women: https://news.sky.com/story/syrian-refugee-who-stabbed-british-child-and-five-others-in-annecy-knife-attack-was-denied-asylum-in-france-12899146Turns out many of these Syrian refugees don't adapt to westernized culture very well.The crime increases, and more cultural fragmentation within society leads to weaker social capital and structure. Sure, if you want cheap labor just bring in cheap workers from other countries. But there are long term impacts that go beyond the economic benefits. Culture can be lost in less than a generation -- a country is not a country without closed borders.When these refugees entered Europe many of them were already radicalized and some were also radicalized in European nations they just can't stand or tolerate Western culture. It was disheartening to see a fully grown up sane man stabbing children. What did that innocent child do to you? Children that are peaceful and open-minded are the ones he wants to kill. Some people say it is because of religion and I tell them that it is not totally the truth because the Islam I know is a peaceful religion. It doesn't promote violence and the killing of innocent people. There are still many Syrians living peacefully and productively in Europe. Some of them have integrated so much socially, some own good businesses and work in reputable organizations. So you cannot shut your borders because you might also shut out the productive human resources. There will always be changes or alterations of cultural heritage, there are some cultures that have disappeared. Like in Africa, many cultures have been diluted with the European lifestyle, my local language is been replaced with French and English words.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "June 11, 2023, 08:27:39 AM",
      "body": "Quote from: Aforhok on June 07, 2023, 10:10:51 PMBorder opening can either be harmful or be helpful to a country, it works vice versa. It can be harmful in the sense that bad goods and services can be brought in,weapons can be smuggled in, illegal migration of non citizens can have quick access to a country when the border officials are corrupt.      It can also be helpful due to the price of goods and services because there will be competition in the market place there by making goods cheaper, it also strengthen international relationship. Don't you know what's border and it effects when is open and when is close, if border is close in any country they will not be importation and exportation of goods and services and that will result a hardship because the country will be using what they generate in their country and no goods will be coming to the country and any goods that enters the country will pay higher amount of fees to smuggle goods and it will result as high price of commodity because of the money paid in border to let in the goods, border opening will create more advantages to the country because price of goods and services will be cheap",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ebede",
      "created_time": "June 12, 2023, 08:12:16 PM",
      "body": "Border opening has both good and bad effect, the good effect is the inflow of most consumed goods to the country that has low production of such goods, some country do not produce cars so the easiest way to bring in this cars is through the border, but the border need scrutiny in other to check the inflow of adulterated and contraband goods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 12, 2023, 09:12:09 PM",
      "body": "As human beings as a whole fail to meet basic reproduction needs to sustain the population going forward, immigration will likely be viewed by politicians as a way to keep the boat afloat and keep tax revenue coming in while society begins to collapse. The downside being that the immigrants will likely be relocating because they want a better life, and this are likely a less wealthy class so more prone to crime, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "June 12, 2023, 09:18:57 PM",
      "body": "In this aspect what I have to say in this particular issue is that closing of border have a lot of effects in a society because the cause of commodities would be high than the normal so it is good for a government to open a border for the citizen for easy importation and exportation of goods from another country to come in in the country and also their own product to go outside their country that is the benefit and advantages of opening and closing of border",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "June 12, 2023, 10:51:04 PM",
      "body": "Quote from: Aforhok on June 07, 2023, 10:10:51 PMBorder opening can either be harmful or be helpful to a country, it works vice versa. It can be harmful in the sense that bad goods and services can be brought in,weapons can be smuggled in, illegal migration of non citizens can have quick access to a country when the border officials are corrupt. The bad side is they'll never know the immigrants/refugees if they've got bad intentions or bad habits so it will eventually out when they are already there. Like this news in France, an immigrant attacked children. (https://www.foxnews.com/world/syrian-refugee-injures-4-children-adult-knife-attack-french-alps-annecy-report)Quote from: Aforhok on June 07, 2023, 10:10:51 PMIt can also be helpful due to the price of goods and services because there will be competition in the market place there by making goods cheaper, it also strengthen international relationship. Yeah, that's the good side of it. There will be more people working and there will be more taxation for them as it will contribute to the economy of the country where they'll go. Thus, it should be weighed properly if a country really needs them or not. Most citizens don't want to see immigrants in their country and that's one reality.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mu_enrico",
      "created_time": "June 13, 2023, 04:32:42 AM",
      "body": "Open border policy, if the name implies that it's free to enter and reside in the country, simply doesn't work. Human has always needed a border. Look at your house, do you have a fence surrounding your house? Most of us have it for various reasons for protection/security and privacy. We are the same human being as our neighbor but they should also respect our property.If we zoom out to the nation's level, there is so much wealth, education, and cultural disparity that will make regular \"aliens\" unable to assimilate with the locals. Hence, the selection (and education) process is strictly conducted to make sure these people can live better with the locals. It doesn't mean the \"aliens\" have bad intentions or bad behavior. They simply have so many differences and are unable to adjust/adapt, and then create a problem in society.However, often, \"open border policy\" still includes selection processes and education to select the most suitable candidate to become a citizen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}