{
  "id": "topic_5402256",
  "title": "RockBell",
  "author": "RockBell",
  "created_time": "June 12, 2022, 07:47:41 AM",
  "content": "I was wondering and this question as been bothering me will there be any possibility or like an upgrade in the feature if your private is lost there will be another way to get access to your funds?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402256",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "June 12, 2022, 08:16:59 AMLast edit: June 12, 2022, 10:17:12 AM by OmegaStarScream",
      "body": "If you're referring to bitcoin core, then what you would need is the wallet.dat file (which contains the private keys for your addresses). For some other wallets like Electrum, you've got a 12-24 seed instead which you must write down in order to be able to access your funds later. If you lose these things, there's no way to your funds back.This shouldn't however tempt you to use online wallets and exchanges. Rather, you should learn how to store your seed safely[1][1] https://www.makeuseof.com/store-crypto-seed-phrases/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 12, 2022, 08:49:40 AM",
      "body": "If you have bitcoin on noncustododial wallet, you have the full responsibility to backup your seed phrase, private key or any other thing necessary for backup like passphrase (but backup passphrase in different location away from seed phrase). If the backup is lost, then your coin is lost forever. No such proposal and I do not think there would be such proposal in the future, but nothing is impossible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "June 12, 2022, 09:12:10 AM",
      "body": "Quote from: RockBell on June 12, 2022, 07:47:41 AMI was wondering and this question as been bothering me will there be any possibility or like an upgrade in the feature if your private is lost there will be another way to get access to your funds?If you've lost your wallet or private key(s), then you should recover from one of your back ups, which will usually either be a wallet.dat file or a seed phrase depending on which wallet software you used. If you've also lost all your back ups, then your coins are lost forever.There will never be a proposal to allow someone not in possession of the necessary private key to move the bitcoin protected by those keys. Such a thing would be entirely antithetical to several of the core tenets of bitcoin, namely decentralization and self custody. If the developers start implementing methods to allow them to move bitcoin which does not belong to them, then bitcoin is no better than a centralized altcoin scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "June 12, 2022, 09:35:10 AMLast edit: June 12, 2022, 05:26:56 PM by LoyceV",
      "body": "Quote from: RockBell on June 12, 2022, 07:47:41 AMan upgrade ~ to get access to your funds?What you're asking is not an upgrade, but the destruction of Bitcoin. There's one and only one way to get access to your Bitcoins: by signing a transaction using the private key. So make sure not to lose your keys, and make sure nobody else can access them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kaggie",
      "created_time": "June 12, 2022, 01:25:00 PMLast edit: June 12, 2022, 02:34:06 PM by kaggie",
      "body": "Quote from: RockBell on June 12, 2022, 07:47:41 AMI was wondering and this question as been bothering me will there be any possibility or like an upgrade in the feature if your private is lost there will be another way to get access to your funds?For reversing transactions, we have banks or stocks, or performing transactions with a service like paypal, venmo, or with a credit card.If you are interested in an uncensorable peer to peer distributed ledger, then you should consider bitcoin. However with bitcoin, if you lose your keys, then the transactions related to that key are irreversible. This has always been a key feature of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "June 12, 2022, 02:46:06 PM",
      "body": "Quote from: OmegaStarScream on June 12, 2022, 08:16:59 AMIf you're referring to bitcoin core, then what you would need is the wallet.dat file (which contains the private keys for your addresses). For some other wallets like Electrum, you've got a 12-24 seed instead which you must write down in order to be able to access your funds later. If you lose these things, there's no way to your funds back.This shouldn't however tempt you to use online wallets and exchanges. Rather, you should learn how to store your seed safely[1][1] https://www.makeuseof.com/store-crypto-seed-phrases/Thanks  my seed phrase is safely kept",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 12, 2022, 04:16:29 PM",
      "body": "Quote from: LoyceV on June 12, 2022, 09:35:10 AMQuote from: RockBell on June 12, 2022, 07:47:41 AMan upgrade ~ to get access to your funds?What you're asking is not an upgrade, but the destruction of Bitcoin. There's one and only one way to get access your Bitcoins: by signing a transaction using the private key. So make sure not to lose your keys, and make sure nobody else can access them.And to elaborate on this: Such a feature would be misused by criminals and government agencies to extort or threaten you for your private keys/bitcoin using the alternate means of recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "June 12, 2022, 04:20:48 PM",
      "body": "Quote from: RockBell on June 12, 2022, 02:46:06 PMThanks  my seed phrase is safely kept I believe the Bitcoin wallet you're talking about is not bitcoin core because it has never used seed phrases and the only way to back it up is through the use of the wallet.dat file but if the wallet is like Electrum seed phrase is enough.When you said the seed phrase is kept safely, I hope you don't keep it in an online device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "June 13, 2022, 06:02:45 AM",
      "body": "Quote from: suzanne5223 on June 12, 2022, 04:20:48 PMQuote from: RockBell on June 12, 2022, 02:46:06 PMThanks  my seed phrase is safely kept I believe the Bitcoin wallet you're talking about is not bitcoin core because it has never used seed phrases and the only way to back it up is through the use of the wallet.dat file but if the wallet is like Electrum seed phrase is enough.When you said the seed phrase is kept safely, I hope you don't keep it in an online device.Definitely not Bitcoin Core because of the obvious reason you have stated, Bitcoin Core is HD wallet but has no seed phrase that can someone can backup than the wallet file (wallet.dat). Maybe RockBell is just using a seed phrase wallet that starts with the name bitcoin and calling it Bitcoin Core. @RockBell, if you have your seed phrase, you have your coins, that is just how it works because you can always use your seed phrase to recover your wallet and your coin at any time and as many times as possible as it will recover you the keys needed to access your coins. If your seed phrase is lost, that is all, your coins are lost.Just backup your seed phrase on a paper, or steel sheet which is more safer to environmental damage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "June 21, 2022, 07:46:22 PM",
      "body": "Quote from: RockBell on June 12, 2022, 07:47:41 AMI was wondering and this question as been bothering me will there be any possibility or like an upgrade in the feature if your private is lost there will be another way to get access to your funds?If you update your wallet you have to secure your wallet.dat backup file or your seed first. If this private keys are lost then you have 0 chance to restore your funds, since otherwise everyone could restore them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "June 23, 2022, 10:05:31 PM",
      "body": "Quote from: RockBell on June 12, 2022, 02:46:06 PMThanks  my seed phrase is safely kept This is all you need. If you have the seed safe then what is the problem you are having now. I do not understand the tension. Upgrade, private is lost, another way of accessing fund, you are overthinking it too much LOLUsing the seed you can restore wallet any time. But do not share it to anyone and do not lose it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}