{
  "id": "topic_5474615",
  "title": "Dewiana",
  "author": "Dewiana",
  "created_time": "November 19, 2023, 03:45:38 AM",
  "content": "Larangan pemasangan alat peraga kampaye!Pasal 71 PKPU No. 15 Tahun 2023(1) Alat Peraga Kampanye Pemilu dilarang dipasang pada tempatumum sebagai berikut:1.tempat ibadah;2.rumah sakit atau tempat pelayanan kesehatan;3.tempat   pendidikan,   meliputi   gedung   dan/atausekolah dan/atau perguruan tinggi;4. gedung atau fasilitas milik pemerintah;  5.Fasilitas tertentu milik pemeirntah; danFasilitas lainnya yang dapat mengganggu ketertiban umum Sebenarnya secara undang-undang atau PKPU sudah jelas diatur dan kenapa juga tempat larangan di lakukan, dan apakah sanksi yang harus dilakukan saat pelangaran itu dilakukan?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474615",
  "comments": [
    {
      "author": "SaepulMT",
      "created_time": "November 19, 2023, 06:29:19 AM",
      "body": "Quote from: Dewiana on November 19, 2023, 03:45:38 AM~snip Sebenarnya secara undang-undang atau PKPU sudah jelas diatur dan kenapa juga tempat larangan di lakukan, dan apakah sanksi yang harus dilakukan saat pelangaran itu dilakukan?Mungkin karena mereka yang memasang alat peraga tersebut salah satunya karena tidak membaca dulu aturan-aturan pemasangan atau bisa saja karena mereka ingin menang dengan cara-cara yang tidak baik melakukan berbagai cara supaya menang. Sebenarnya sanksi untuk pemasang alat peraga kampanye tersebut sudah ada ,berupa tindak pidana ringan (tipiring) dengan kurungan 3 bulan dan denda Rp 50 juta. Sementara untuk perusakan alat peraga kampanye merupakan tindak pidana pemilu. Karena hal tersebut sudah diatur dalam UU Nomor 7 Tahun 2017 tentang Pemilu ,pelakunya bisa kena sanksi pidana juga.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arufox",
      "created_time": "November 19, 2023, 01:17:57 PM",
      "body": "Quote from: Dewiana on November 19, 2023, 03:45:38 AMSebenarnya secara undang-undang atau PKPU sudah jelas diatur dan kenapa juga tempat larangan di lakukan, dan apakah sanksi yang harus dilakukan saat pelangaran itu dilakukan?Bagi mereka yang dengan sengaja melakukan memasang alat peraga kampanye di tempat yang dilarang oleh KPU bukan tidak tahu adanya sanksi tetapi dinegara kita ini terkadang KPU pun tidak netral terutama di daerah. Seperti yang kita ketahui bahwa proses pemilihan anggota KPU kan melalui DPR dan dari situ sudah dimulai dengan deal-deal politik sehingga anggota KPU terkadang tidak bekerja secara netral karena ada kepentingan berbagai anggota partai yang menekannya dibelakang layar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ferida504",
      "created_time": "November 19, 2023, 05:24:33 PM",
      "body": "Quote from: arufox on November 19, 2023, 01:17:57 PMQuote from: Dewiana on November 19, 2023, 03:45:38 AMSebenarnya secara undang-undang atau PKPU sudah jelas diatur dan kenapa juga tempat larangan di lakukan, dan apakah sanksi yang harus dilakukan saat pelangaran itu dilakukan?Bagi mereka yang dengan sengaja melakukan memasang alat peraga kampanye di tempat yang dilarang oleh KPU bukan tidak tahu adanya sanksi tetapi dinegara kita ini terkadang KPU pun tidak netral terutama di daerah. Seperti yang kita ketahui bahwa proses pemilihan anggota KPU kan melalui DPR dan dari situ sudah dimulai dengan deal-deal politik sehingga anggota KPU terkadang tidak bekerja secara netral karena ada kepentingan berbagai anggota partai yang menekannya dibelakang layar. Bagi yang melangar tersbut wajib memberikan Sanksi kepda peserta pemilu sesuai aturan dan mekanisme yang berlaku,  berupa sanksi kategori sanksi sedang,  yaitu sanksi yang bersifat psikologis sebagai terapi Sanksi yaitu :Pernyataan secara tertulis, Peringatan keras. kepda penyelengara jika tidak bertindak tegas juga harus diberikan sanksi dari atasan berupa tidak boleh menghadiri kegiatan selama waktu yang ditentukan dandiberikan jika tidak mampu bekerja berupa Sanksi yang direkomendasikan jika dianggap tidak mampu bekerja bawahan tersebut",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "November 19, 2023, 09:56:59 PM",
      "body": "Quote from: SaepulMT on November 19, 2023, 06:29:19 AMMungkin karena mereka yang memasang alat peraga tersebut salah satunya karena tidak membaca dulu aturan-aturan pemasangan atau bisa saja karena mereka ingin menang dengan cara-cara yang tidak baik melakukan berbagai cara supaya menang. Dan saya pikir itu adalah hal yang tidak mungkin, karena bagaiamapun sebelum mereka berkampanye, para calon dan timsesnya itu sudah mendapatkan arahan tentang aturan main berkampanye, baik itu dari KPU maupun Bawaslu. Hanya saja mereka para partai-partai besar yang berkuasa di pemerintahan dan di Parlemen, mereka itu seringkali mengabaikan akan aturan main berkampanye. dan dalam hal ini seharusnya baik DKPP, KPU dan Bawaslu, itu harus memiliki integeritas yang kuat dan berprilaku netral kepada semua calon dan partai peserta pemilu. Karena baik KPU ataupun Bawaslu itu seringkali dilemahkan ketika mereka dihadapkan dengan kesalahan yang dilakukan oleh partai-partai besar. yang membuat mereka enggan untuk bertindak dan membiarkan kesalahan yang ada didepan mata.\"Alat praga kemapanye adalah sampah visual dan polusi mata, dan jika tidak ditertibakan dengan segera, maka ini akan seperti jamur yang bertebaran dimana-mana dan dapat merusak keindahan kota.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SaepulMT",
      "created_time": "November 25, 2023, 07:41:38 AM",
      "body": "Quote from: topbitcoin on November 19, 2023, 09:56:59 PMQuote from: SaepulMT on November 19, 2023, 06:29:19 AMMungkin karena mereka yang memasang alat peraga tersebut salah satunya karena tidak membaca dulu aturan-aturan pemasangan atau bisa saja karena mereka ingin menang dengan cara-cara yang tidak baik melakukan berbagai cara supaya menang. ~snip\"Alat praga kemapanye adalah sampah visual dan polusi mata, dan jika tidak ditertibakan dengan segera, maka ini akan seperti jamur yang bertebaran dimana-mana dan dapat merusak keindahan kota.\"Dalam hal ini saya setuju dengan agan topbitcoin .Disetiap pinggir jalan banyak sekali alat peraga kampanye ini, apalagi yang di pasang setiap pohon pinggir jalan benar-benar mengganggu keindahan. Janji-janji di isi alat peraga tersebut bukanya saya ingin bersimpati dan ingin memilih terhadap calon tersebut, malah itu menjadi guyonan setiap orang-orang lewat yang membaca alat peraga kampanye tersebut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "November 26, 2023, 02:02:41 AM",
      "body": "Quote from: SaepulMT on November 25, 2023, 07:41:38 AMQuote from: topbitcoin on November 19, 2023, 09:56:59 PMQuote from: SaepulMT on November 19, 2023, 06:29:19 AMMungkin karena mereka yang memasang alat peraga tersebut salah satunya karena tidak membaca dulu aturan-aturan pemasangan atau bisa saja karena mereka ingin menang dengan cara-cara yang tidak baik melakukan berbagai cara supaya menang. ~snip\"Alat praga kemapanye adalah sampah visual dan polusi mata, dan jika tidak ditertibakan dengan segera, maka ini akan seperti jamur yang bertebaran dimana-mana dan dapat merusak keindahan kota.\"Dalam hal ini saya setuju dengan agan topbitcoin .Disetiap pinggir jalan banyak sekali alat peraga kampanye ini, apalagi yang di pasang setiap pohon pinggir jalan benar-benar mengganggu keindahan. Janji-janji di isi alat peraga tersebut bukanya saya ingin bersimpati dan ingin memilih terhadap calon tersebut, malah itu menjadi guyonan setiap orang-orang lewat yang membaca alat peraga kampanye tersebut.Saya akan lebih setuju jika pemasangan APK (Alat Peraga Kampanye) ini hanya dipasang ditempat khusus yang telah disediakan oleh pemerintah ataupun perusahaan swasta seperti di billboard atau papan reklame, sehingga akan telihat lebih elok dan lebih enak untuk dipandang. Atau mungkin karena parpol atau calonnya tidak memiliki cukup anggaran untuk menyewa papan reklame, sehingga mereka lebih memlih untuk memasang baliho dipinggir jalan dengan menggunakan bambu sebagai penyangganya... wkwkwkKarena pada saat ini, terkait dari pada alat peraga kampanye ini cukup menggelikan dan sedikit menjijikan, karena selain daripada baliho yang terpasang dimana-mana, akan tetapi terkait dari pada penempenempelan sticker caleg tanpa seijin pemilik rumah juga, ini masing seringkali terjadi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dediadi",
      "created_time": "November 29, 2023, 03:18:57 AM",
      "body": "Quote from: topbitcoin on November 26, 2023, 02:02:41 AMQuote from: SaepulMT on November 25, 2023, 07:41:38 AMQuote from: topbitcoin on November 19, 2023, 09:56:59 PMQuote from: SaepulMT on November 19, 2023, 06:29:19 AMMungkin karena mereka yang memasang alat peraga tersebut salah satunya karena tidak membaca dulu aturan-aturan pemasangan atau bisa saja karena mereka ingin menang dengan cara-cara yang tidak baik melakukan berbagai cara supaya menang. ~snip\"Alat praga kemapanye adalah sampah visual dan polusi mata, dan jika tidak ditertibakan dengan segera, maka ini akan seperti jamur yang bertebaran dimana-mana dan dapat merusak keindahan kota.\"Dalam hal ini saya setuju dengan agan topbitcoin .Disetiap pinggir jalan banyak sekali alat peraga kampanye ini, apalagi yang di pasang setiap pohon pinggir jalan benar-benar mengganggu keindahan. Janji-janji di isi alat peraga tersebut bukanya saya ingin bersimpati dan ingin memilih terhadap calon tersebut, malah itu menjadi guyonan setiap orang-orang lewat yang membaca alat peraga kampanye tersebut.Saya akan lebih setuju jika pemasangan APK (Alat Peraga Kampanye) ini hanya dipasang ditempat khusus yang telah disediakan oleh pemerintah ataupun perusahaan swasta seperti di billboard atau papan reklame, sehingga akan telihat lebih elok dan lebih enak untuk dipandang. Atau mungkin karena parpol atau calonnya tidak memiliki cukup anggaran untuk menyewa papan reklame, sehingga mereka lebih memlih untuk memasang baliho dipinggir jalan dengan menggunakan bambu sebagai penyangganya... wkwkwkKarena pada saat ini, terkait dari pada alat peraga kampanye ini cukup menggelikan dan sedikit menjijikan, karena selain daripada baliho yang terpasang dimana-mana, akan tetapi terkait dari pada penempenempelan sticker caleg tanpa seijin pemilik rumah juga, ini masing seringkali terjadi.Tempat pemasangan alat peraga kampanye dan tempat kampanye sebenarnya sudah disediakan oleh KPU sampai berjenjang ke tingkat PPK dan PPS namun masih ada pelangaran-pelangaran dilakukan itu semua kondisi para parpol dengan timses kurang komunikasi, akan tetapi semua itu bisa dicegah lewat pengawasan dibawah BAWASLU, yang perlu digaris bawahi sekarang ketegasan dari pihak peyelengara selaku mempunyai legitimasi hukum yang kuat, ada pkpu ada perbawaslu",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "November 29, 2023, 05:15:31 AM",
      "body": "peraturan tersebut dibuat oleh KPU untuk bisa membebaskan tempat-tempat netral tersebut dari atribut-atribut kampanye yang sering kali dipasang secara sembarangan. dan sesuai dengan sanksi yang sudah diatur oleh pemerintah ketika ada salah satu calon legislatif/presiden yang memasang alat peraga kampaye di tempat yang sudah dilarang pada pasal 71 PKPU tsb akan dikenai sanksi peringatan tertulis dan penurunan alat peraga kampaye https://www.hukumonline.com/klinik/a/bolehkah-memasang-baliho-kampanye-di-rumah-dinas-lt5f8a778ad1907memang sangat disayangkan bahwa sanksi yang diberikan kepada para pelanggar PKPU cukup ringan hanya sebatas peringatan tertulis dan penurunan alat peraga kampanye. harusnya mereka dikenai sanksi denda uang tunai untuk pelanggaran yang mereka lakukan karena hanya pada pemilu ini kita bisa menguras uang-uang para caleg dan capres ini, dan uang denda tersebut bisa digunakan untuk pemasukan ke daerah untuk kemudian digunakan untuk kebutuhan masyarakat luas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "November 29, 2023, 01:51:11 PM",
      "body": "Alat peraga kampanye bagus dibatasi, tapi kenyataannya banyak guru yang menjadi jurkam dan berkampanye secara terselubung di sekolah. Ada beberapa sekolah yang saya ketahui sendiri (beda kecamatan dengan saya, tapi saya pernah datang dalam rapat). Intinya, waktu itu sekolah mengadakan rapat dengan wali murid kemudian membahas ini itu tentang siswa, dan kemudian membahas pembangunan sekolah, agar tidak membebani wali murid, diminta untuk mencoblos calon DPR sebut saja Bunga. Lain lagi di sekolah dasar, calon sebut saja Melati, memberikan susu kepada murid-murid, kemudian setelah siswa megang itu susu, disuruh membuat yel-yel \"Susu segar untuk anak sehat, terima kasih Bu Melati\". jelas ini sudah melanggar kan. Jadi, larangan pemasangan alat peraga ini akan percuma kalau pada akhirnya masih ada kampanye terselubung yang menyasar instansi yang harusnya netral. Mungkin, larangannya juga perlu diperketat lagi agar tidak ada kampanye di instansi pendidikan. kira-kira kalau dilaporkan, ga bahaya ta?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 30, 2023, 06:01:18 AM",
      "body": "Quote from: moneystery on November 29, 2023, 05:15:31 AMharusnya mereka dikenai sanksi denda uang tunai untuk pelanggaran yang mereka lakukan karena hanya pada pemilu ini kita bisa menguras uang-uang para caleg dan capres ini, dan uang denda tersebut bisa digunakan untuk pemasukan ke daerah untuk kemudian digunakan untuk kebutuhan masyarakat luas.Mantap, ane setuju usulan ente, dengan memungut denda kepada caleg dan capres ini bisa buat nambah pendapatan daerah membangun insfrastruktur, dan memperbaiki ketahanan pangan. Tapi itu sulit terealisaksikan bro, apa lagi jika kepala daerahnya masih terafiliasi dengan partai pendukung dari para calon ini. Malah ada kepala daerahnya sendiri juga ikut pasang wajah dia bersama para calon, apa gak makin kebelinger negeri ini?. mungkin saja lagi nyari muka, biar nanti calon pilihannya jadi, dia dapat nama atau mungkin diusulkan untuk jadi menteri kayak yang sudah-sudah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topbitcoin",
      "created_time": "November 30, 2023, 09:21:11 PM",
      "body": "Quote from: dediadi on November 29, 2023, 03:18:57 AMQuote from: topbitcoin on November 26, 2023, 02:02:41 AM~Tempat pemasangan alat peraga kampanye dan tempat kampanye sebenarnya sudah disediakan oleh KPU sampai berjenjang ke tingkat PPK dan PPS namun masih ada pelangaran-pelangaran dilakukan itu semua kondisi para parpol dengan timses kurang komunikasi, akan tetapi semua itu bisa dicegah lewat pengawasan dibawah BAWASLU, yang perlu digaris bawahi sekarang ketegasan dari pihak peyelengara selaku mempunyai legitimasi hukum yang kuat, ada pkpu ada perbawasluKalau kita berbicara tentang legitimasi hukum, hukum dinegara kita sudah cukup luar biasa. Namun dalam hal pelaksanaanya ataupun penengakan hukum tentang PKPU ataupun Per-Bawaslu, ini masihlah terdapat sebuah kesalahan dan dalam penengakanyapun masih terdapat ketimpangan. Sementara suatu hukum itu bisa dikatakan kuat, itu tergantung pada proses pelaksanaan dan penegakan yang dilakukan itu seperti apa.? Apakah sudah ditegakan, setagak-tegaknya dan dilakukan dengan seadil, adilnya.?Karena dalam permasalahan hukum saya melihatnya dari sudut pandang keadilan. dan Sudahkah penegakan hukum yang dilakukan oleh KPU dan Bawaslu sesuai dengan PKPU dan Per-Bawaslu.? Nyatanya dalam hal penengakan ini masih timpang sebelah, dimana Partai-Partai besar yang berkuasa itu masih bisa berprilaku sesukanya, termasuk dalam hal berkampanye. Sementara partai menengah kebawah, itu dibabad habis karena dianggap akan menganggu konstalasi politik.Negara kita ini bukanlah negara hukum, melainkan negara lobi. Karena segala sesuatunya itu masih bisa dibicarakan dan di transaksikan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Juse14",
      "created_time": "November 30, 2023, 09:46:38 PM",
      "body": "Quote from: blue Snow on November 30, 2023, 06:01:18 AMQuote from: moneystery on November 29, 2023, 05:15:31 AMharusnya mereka dikenai sanksi denda uang tunai untuk pelanggaran yang mereka lakukan karena hanya pada pemilu ini kita bisa menguras uang-uang para caleg dan capres ini, dan uang denda tersebut bisa digunakan untuk pemasukan ke daerah untuk kemudian digunakan untuk kebutuhan masyarakat luas.Mantap, ane setuju usulan ente, dengan memungut denda kepada caleg dan capres ini bisa buat nambah pendapatan daerah membangun insfrastruktur, dan memperbaiki ketahanan pangan. Tapi itu sulit terealisaksikan bro, apa lagi jika kepala daerahnya masih terafiliasi dengan partai pendukung dari para calon ini. Malah ada kepala daerahnya sendiri juga ikut pasang wajah dia bersama para calon, apa gak makin kebelinger negeri ini?. mungkin saja lagi nyari muka, biar nanti calon pilihannya jadi, dia dapat nama atau mungkin diusulkan untuk jadi menteri kayak yang sudah-sudah.Sebetulnya tanpa ada sanksi berupa denda dengan nilai tertentu, jika pada prakteknya kampanye para caleg maupun capres ini berlangsung dengan tertib dan KPU dan Bawaslu mampu menekan para Parpol ini untuk hanya memasang APK (Alat peraga Kampanye) ini hanya bisa dipasang ditempat-tempat tertentu, seperti papan reklame. Tentunya ini merupakan sebuah langkah yang solutif, karena selain daripada pendapatan daerah akan meningkat memalui pajak papan reklame, akan tetapi keberadaan poster ataupun baliho para caleg maupun capres akan terlihat lebih enak untuk dipandang dan tidak menganggu ke-estetikan suatu kota maupun daerah karena dilakukan secara tertib. Sehingga dapat memecahkan tentang peramasalahan Keberadaan APK yang seperti jamur yang bertebaran dimana-mana dan menjadi polusi visual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GoldMagic",
      "created_time": "December 01, 2023, 03:55:50 AM",
      "body": "Quote from: Dewiana on November 19, 2023, 03:45:38 AM Sebenarnya secara undang-undang atau PKPU sudah jelas diatur dan kenapa juga tempat larangan di lakukan, dan apakah sanksi yang harus dilakukan saat pelangaran itu dilakukan?Mereka yang memasang alat peraga kampanye ditempat yang benar-benar dilarang tapi masih dilakukan menurut saya bukan mereka tidak tau tapi meraka tidak mau ribet dan juga tempat-tempat yang dilarang itu lebih rame dan banyak orang yang lalu lalang di tempat tersebut,mereka juga sudah tau jika melanggar sudah jelas ada sanksinya(yang jelas ini kan politik yang dimana didalamnya banyak melibatkan banyak pihak,mau pihak polisi bahkan pihak yang berwenang sekalian seperti pengadilan),jadi sampai saat ini belum ada pembuktian tentang orang yang melangar yang dihukum(mau itu hukum berat atau pun hukuman ringan).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FiliOrangGila",
      "created_time": "December 31, 2023, 06:56:16 PM",
      "body": "Quote from: Dewiana on November 19, 2023, 03:45:38 AM Sebenarnya secara undang-undang atau PKPU sudah jelas diatur dan kenapa juga tempat larangan di lakukan, dan apakah sanksi yang harus dilakukan saat pelangaran itu dilakukan?tidak di beri sanksi hanya d tertibkan saja pada teriak2 pencitraan curang ini curang itupemerintah mirip orde baru dll, apa lagi di beri sanksi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raflesia",
      "created_time": "January 01, 2024, 06:52:08 PM",
      "body": "Quote from: SaepulMT on November 19, 2023, 06:29:19 AMQuote from: Dewiana on November 19, 2023, 03:45:38 AM~snip Sebenarnya secara undang-undang atau PKPU sudah jelas diatur dan kenapa juga tempat larangan di lakukan, dan apakah sanksi yang harus dilakukan saat pelangaran itu dilakukan?Mungkin karena mereka yang memasang alat peraga tersebut salah satunya karena tidak membaca dulu aturan-aturan pemasangan atau bisa saja karena mereka ingin menang dengan cara-cara yang tidak baik melakukan berbagai cara supaya menang. Sekalipun yang memasang tidak membaca tetapi seharusnya mereka faham beberapa aturan yang ada dalam kampanye karena bagaimanapun juga hal itu bisa membuat caleg yang mereka usung atau alat peraga yang mereka pasangkan itu mendapat imbas sehingga dalam hal ini pasti ada yang mengingatkan karena mengatakan tidak tahu tentang aturan seperti ini saya rasa itu hanya alasan naif.Masalahnya adalah mereka tidak terlalu peduli dengan aturan karena konsep yang selalu ada saat ini adalah \"aturan hanya ada untuk dilanggar\" yang membuat ini menjadi sedikit rumit karena ketika ditanya alasan pasti jawabannya simple dengan mengaku salah dan melakukan nya lagi di tempat lain.Harus ada pengertian sebenarnya dari para calon juga dalam hal ini karena bagaimanapun juga ketika memang merugikan orang lain ini juga berimbas kepada elektabilitas mereka dan kita tahu saat ini adalah segalanya mudah sekali untuk viral sehingga daripada mencoreng nama sendiri seperti yang terjadi untuk beberapa kasus baliho, pamplet atau alat peraga lainnya yang sudah viral di media sosial maka akan lebih bagus jika memang anggota atau para timses lebih memperhatikan hal ini jangan hanya bertumpu kepada uang saja sehingga segalanya mereka lakukan sekalipun itu adalah sebuah kesalahan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "January 02, 2024, 10:36:36 AM",
      "body": "Quote from: FiliOrangGila on December 31, 2023, 06:56:16 PMQuote from: Dewiana on November 19, 2023, 03:45:38 AM Sebenarnya secara undang-undang atau PKPU sudah jelas diatur dan kenapa juga tempat larangan di lakukan, dan apakah sanksi yang harus dilakukan saat pelangaran itu dilakukan?tidak di beri sanksi hanya d tertibkan saja pada teriak2 pencitraan curang ini curang itupemerintah mirip orde baru dll, apa lagi di beri sanksiMereka semua pada mau nyari muka di depan rakyat biar dikatakan dizolimi oleh pemerintah. Kalau mau buka data lebih real, mereka-mereka yang teriak dicurangi itu malah lebih banyak lagi pasang alat peraga kampanye yang tidak sesuai tempatnya. Ya sama-sama tahulah mereka-mereka ini juga ada beberapa orang yang ada di pemerintahan dan cakarnya masih menancap di institusi pemerintahan, artinya mereka ini tidak ketahuan saja dan hanya bermain politik untuk supaya suaranya di pemilu nanti diperhatikan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "January 05, 2024, 03:45:27 AM",
      "body": "Kebanyakan Kasus pelanggaran pemasangan APK tidak dilakukan oleh caleg terkait, larangan tersebut dilakukan oleh timses atau orang yang dibayar timses untuk memasang APK. Temuan pelanggan ini akan ditindaklanjuti Bawaslu dengan menurunkan APK yang dianggap melanggar Pasal 71 PKPU No 15 Tahun 2023. KPU juga bisa langsung memberikan sanksi terkait pelanggaran APK kepada Caleg atau Paslon, penertiban APK bisa melalui KPU dan Bawaslu, tetapi yang berhak memberikan sanksi adalah KPU. Sanksi tersebut bisa berupa peringatan tertulis maupun sanksi penurunan APK dalam waktu 1×24 jam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cengsuwuei",
      "created_time": "January 22, 2024, 01:00:51 AM",
      "body": "Quote from: SaepulMT on November 19, 2023, 06:29:19 AMQuote from: Dewiana on November 19, 2023, 03:45:38 AM~snip Sebenarnya secara undang-undang atau PKPU sudah jelas diatur dan kenapa juga tempat larangan di lakukan, dan apakah sanksi yang harus dilakukan saat pelangaran itu dilakukan?Mungkin karena mereka yang memasang alat peraga tersebut salah satunya karena tidak membaca dulu aturan-aturan pemasangan atau bisa saja karena mereka ingin menang dengan cara-cara yang tidak baik melakukan berbagai cara supaya menang. Sebenarnya sanksi untuk pemasang alat peraga kampanye tersebut sudah ada ,berupa tindak pidana ringan (tipiring) dengan kurungan 3 bulan dan denda Rp 50 juta. Sementara untuk perusakan alat peraga kampanye merupakan tindak pidana pemilu. Karena hal tersebut sudah diatur dalam UU Nomor 7 Tahun 2017 tentang Pemilu ,pelakunya bisa kena sanksi pidana juga.sebelum pemilu tahapan kampanye di mulai KPU tentu sudah mengumpulkan peserta pemilu baik capres partai dan tim sukses nyamengenai aturan nya yang tidak boleh di langgar.jadi kalau bawaslu dan aparat satpol pp mengamankan mencopot alat peraga kampanye ya sudah sesuai aturan bukan pelanggaran apa lagi pidana.dan peserta pemilu ketika di copot malah bilang di dzolimi aparat tidak adil dll",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingDome",
      "created_time": "January 22, 2024, 03:28:10 AM",
      "body": "Quote from: cengsuwuei on January 22, 2024, 01:00:51 AMsebelum pemilu tahapan kampanye di mulai KPU tentu sudah mengumpulkan peserta pemilu baik capres partai dan tim sukses nyamengenai aturan nya yang tidak boleh di langgar.jadi kalau bawaslu dan aparat satpol pp mengamankan mencopot alat peraga kampanye ya sudah sesuai aturan bukan pelanggaran apa lagi pidana.dan peserta pemilu ketika di copot malah bilang di dzolimi aparat tidak adil dllbenar sekali namun itu peraturan berlaku buat yang berkampanye juga. kalo aparat satpol pp yg nyopot ya gamasalah, kalo itu emang mengganggu banget. toh juga akhir akhir ini ada yang meninggal tertimpa baliho, uda gila emang kampanye kampanye di 2024 ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}