{
  "id": "topic_5457977",
  "title": "jokers10",
  "author": "jokers10",
  "created_time": "June 29, 2023, 08:17:14 AM",
  "content": "Ещё совсем недавно мы теоретизировали, может ли биткойн стать мировой резервной валютой. На фоне постоянных запретов, ограничений и жёстких высказываний представителей разных экономических ведомств разных стран казалось, что вряд ли это будет происходить в ближайшее время.Однако вчера парламент Северной Каролины принял билль о том, чтобы местное казначейство изучило вопрос возможности хранения части золотовалютных запасов в криптовалютах «вроде биткойна».В принципе, уже довольно давно известно, что государства хранят существенные количества биткойнов на своих кошельках. Те же США считаются одним из крупнейших государственных владельцев биткойнов. По данным Форбс, на контролируемым правительством этой страны находится 207 189 биткойнов. Но все эти монеты были изъяты в ходе разбирательств по различным преступлениям, так что вряд ли назовёшь это инвестированием. То же самое относится и к, возможно, крупнейшему владельцу биткойнов из государств — Болгарии, которая может владеть порядка 213 тысячами изъятых биткойнов, но об этих биткойнах нет публичных данных.Однако последнее время мы всё чаще узнаём, что различные государства либо уже давно тайно инвестируют в биткойн, либо, как Северная Каролина, собираются в ближайшее время делать это открыто. Здесь очевиден пример Сальвадора, который сосредоточил на своих адресах уже, по официальным данным, свыше 2 тысяч биткойнов, но это более широкая тема, потому что Сальвадору биткойны нужны не только для инвестирования, но и для обеспечения движения средств, поскольку для страны биткойн является законным платёжным средством.Кто ещё? Бутан! В этом году неожиданно выяснилось, что государственная компания Druk Holding & Investments уже несколько лет занимается майнингом биткойна. Часть намайненных монет компания продаёт для обеспечения собственно расходов на майнинг, а часть сохраняется как инвестиция в биткойн. Сколько конкретно накопила биткойнов страна, неизвестно. Неизвестно также, как много государств уже делает тайком то же самое.Также есть страны, которые всё ещё не спешат делиться информацией о том, владеют ли они биткойнами и в каких объёмах. Та же Венесуэла несколько лет назад в качестве инструмента обхода санкций думала об использовании биткойна, однако официальных подробностей нет. Аналогичная ситуация и с КНДР: не является большим секретом, что страна использует криптовалюты для обхода санкций, но публичных достоверных подробностей нет.По некоторым оценкам, различные государства в сумме уже сейчас могут контролировать до 8% биткойнов.При этом постепенно растёт число стран с глубоким регулированием обращения криптовалют, поэтому я бы ожидал, что мы всё чаще будем слышать новости о том, что различные государства инвестируют в биткойны тем или иным способом. А с ростом различных финансовых инструментов типа ETF делать это правительствам станет ещё удобнее.Как думаете, какие преимущества и угрозы для нас, для биткойна, для самих государств несёт возможное дальнейшее использование биткойна государствами в качестве одного из вариантов золотовалютных резервов?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457977",
  "comments": [
    {
      "author": "delfastTions",
      "created_time": "June 29, 2023, 09:04:40 AM",
      "body": "А вот в африканских странах похоже совсем чехарда по этой части. Там как придёт какой то прогрессивный президент, так легализуют крипту. Придёт хунта, все отменит, биткоины отберут. Все запретят. Так что в Африке адопшен очень смешной и  разнообразный.   Неплохо все идёт в Латинской Америке. Бурление правительств про крипту вовсю и во многих странах типа Парагвая и Эквадора. Строгие запреты да ещё и с уголовкой, например в Афганистане. А в соседнем Иране все нормально и под контролем государства.Так что по миру все вразнобой.Нихрена не поймёшь куда двинут государства по части владения битком.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "June 29, 2023, 09:16:07 AM",
      "body": "Quote from: delfastTions on June 29, 2023, 09:04:40 AMТак что по миру все вразнобой.Нихрена не поймёшь куда двинут государства по части владения битком. Так в том же Бутане, насколько я понимаю, они и близко гражданам ничего не позволили в плане использования и оперирования биткойнами. Там только некоторая закорючка в законах как раз для того, чтобы обеспечить государственной компании право на майнинг.Нет, использование биткойнов в качестве резервной валюты в перспективе это отдельный процесс, с принятием для широких масс не связанный. Причём, наиболее вероятно, немало где будет по принципе «что дозволено Юпитеру, то не дозволено быку». Да и во многих местах, где гражданам сейчас никто не мешает пользоваться биткойнами, сами государства, насколько известно, их в корзинку резервов не складывают.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inwestour",
      "created_time": "June 29, 2023, 11:30:11 AM",
      "body": "Каждый инвестирует как умеет, кто то покупает, кто то майнит, а кто то просто конфискует.  Да за Болгарию тоже как то читал, что у них есть очень прилично битка, в свое время для меня этот момент, когда биткоином заинтересовались государства, стал показательным, слишком высокий уровень что бы он просто так соскамился. Хотя это конечно же не однозначный показатель, или гарантия, но все же. У меня тоже были мысли о том, что не все государства готовы афишировать свои инвестиции в биткоин, и тем более легализировать как это сделал Сальвадор. Вполне возможно что некоторые страны, более лояльные к биткоину, уже в ближайшее время будут рассматривать его как один из вариантов резервов, наряду с золотом. Кто способен понять преимущества ограниченной эмиссии биткоина, тот будет не против иметь в своих резервах биткоин.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "June 29, 2023, 11:50:31 AM",
      "body": "Quote from: Inwestour on June 29, 2023, 11:30:11 AMКаждый инвестирует как умеет, кто то покупает, кто то майнит, а кто то просто конфискует.  Конфискацию, конечно, тоже можно рассматривать как форму инвестирования, но тут мы сталкиваемся с тем, что конфискованные биткойны продают нередко не в наиболее благоприятные для этого моменты, а когда будут соответствующие юридические основания. Скажем, у Финляднии было порядка 2 тысяч конфискованных биткойнов, но в прошлом году она почти всё продала, оставив только около 90 биткойнов, по которым не завершились суды. США тоже уже продавали часть конфискованных биткойнов, и время от времени запускается FUD с тем, что они якобы сейчас вот-вот ещё начнут большую распродажу. Без чёткого плана инвестирования все эти конфискованные биткойны могут быть проданы совсем без учёта рынка, а вот купленные и намайненные, скорее всего, будут либо ожидать каких-нибудь хаёв, либо храниться для обеспечения устойчивости финансовой системы, но и тогда вряд ли будут проданы на дне.Но, в общем, конечно, любопытно наблюдать и со стороны конфискации, как государства оказываются владельцами биткойнов, и как они в итоге к этому своему имуществу относятся, как развивают инвестирование или схлопывают, как Финляндия.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inwestour",
      "created_time": "June 30, 2023, 09:38:52 AM",
      "body": "Quote from: jokers10 on June 29, 2023, 11:50:31 AMКонфискацию, конечно, тоже можно рассматривать как форму инвестирования, но тут мы сталкиваемся с тем, что конфискованные биткойны продают нередко не в наиболее благоприятные для этого моменты, а когда будут соответствующие юридические основания. Скажем, у Финляднии было порядка 2 тысяч конфискованных биткойнов, но в прошлом году она почти всё продала, оставив только около 90 биткойнов, по которым не завершились суды. США тоже уже продавали часть конфискованных биткойнов, и время от времени запускается FUD с тем, что они якобы сейчас вот-вот ещё начнут большую распродажу. Без чёткого плана инвестирования все эти конфискованные биткойны могут быть проданы совсем без учёта рынка, а вот купленные и намайненные, скорее всего, будут либо ожидать каких-нибудь хаёв, либо храниться для обеспечения устойчивости финансовой системы, но и тогда вряд ли будут проданы на дне.Но, в общем, конечно, любопытно наблюдать и со стороны конфискации, как государства оказываются владельцами биткойнов, и как они в итоге к этому своему имуществу относятся, как развивают инвестирование или схлопывают, как Финляндия. Есть такое, когда ты не заморачивался, а оно само пришло, то в итоге такое и отношение, \"как пришло, так и ушло\".  Ситуации разные бывают, даже Microstrategy которые казалось бы покупают на долгосрок, и на любом рынке, не важно он медвежий или бычий, но и у них была ситуация, когда им пришлось продать часть биткоина на низах. Если как в случае с Финляндией, то возможно там правительство не лояльное к крипте и они изначально не планировали инвестировать в биткоин, не знаю как сейчас, но подозреваю что инвестиций в биткоин у них так и нету. США с их долгами, тоже берут из заначки когда очень надо, но если бы они все верили в биток как Сейлор, или Букеле, то скорее всего нашли бы способы его придержать.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "delfastTions",
      "created_time": "June 30, 2023, 11:45:10 AM",
      "body": "Quote from: Inwestour on June 30, 2023, 09:38:52 AMЕсть такое, когда ты не заморачивался, а оно само пришло, то в итоге такое и отношение, \"как пришло, так и ушло\".  Ситуации разные бывают, даже Microstrategy которые казалось бы покупают на долгосрок, и на любом рынке, не важно он медвежий или бычий, но и у них была ситуация, когда им пришлось продать часть биткоина на низах. Если как в случае с Финляндией, то возможно там правительство не лояльное к крипте и они изначально не планировали инвестировать в биткоин, не знаю как сейчас, но подозреваю что инвестиций в биткоин у них так и нету. США с их долгами, тоже берут из заначки когда очень надо, но если бы они все верили в биток как Сейлор, или Букеле, то скорее всего нашли бы способы его придержать. Это как раз как индикатор того, что правительства уверены на все 100%, что все что связано с финансовой экосистемой биткоина и криптовалют вполне может взять под контроль государства.Точно они все уверены что примут законы, или например как китайцы изгонят майнеров долой с территории и все порешается.Очевидно что для PoS монет это вообще нечего делать, просто \"поговорили\" с крупными валидаторами плюс девы и все тип топ.Для PoW пожалуй посложнее с учётом мирового распределения нод и пулов. Но тут тоже можно через пулы воздействовать и контролировать.Так что решающим фактором здесь могут быть противоречия между государствами и соответственно миграции майнеров и применимость платежей криптовалют  на разных территориях.  И в этом смысле Сальвадор очень интересный эксперимент.Кстати, если BTC это официальная валюта страны, то соответственно вроде как нужно и Центробанкам других странам устанавливать обменные курсы, и кто ж устанавливает обмен с Сальвадорcкой официальной деньгой.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "epidemia",
      "created_time": "July 01, 2023, 04:41:42 PM",
      "body": "jokers10, дружище, держат 100%.Ты еще про Китай забыл. CryptoQuant в прошлом году писали, что Китай владеет: 194 775 BTC, 833 083 ETH, а также прочей альтой. Всю крипту отжали у пирамиды PlusToken в 2019 году. На минуточку, даже эти 194 775 BTC (если Китай самостоятельно не покупает) — больше чем Сэйлор своей компашке накупил)Имхо, многие держат. Просто это все скрытно. Мы же видим как МВФ и прочая шантропа набросилась на Сальвадор? А все почему? Да всем пофиг что кто-то там закупает Биток, их бесит, что делают это официально))Кстати, всегда тащился от научно-фантастического произведения Луки Маньотта «Я пришел к вам из будущего с просьбой прекратить вашу деятельность»...да, с датами погорячились, все не так быстро. Но идея прям огонь. Если кто не в курсе, кратко:— Наступил полный Bitcoin-апокалипсис, в результате чего фиатные деньги обесценились— 2025 ценность существует в двух основных формах: земля и криптовалюта—Тот, у кого 0.001 BTC — богатый— Большинство правительств перестали существовать, поскольку из-за анонимных BTC транзакций не могли продолжать эффективно взимать с граждан налоги.— Наибольшие запасы BTC содержат четыре организации: ASICminer (50 000 BTC), «Фонд стабилизации валюты» МВФ (70 000 BTC), Правительство Саудовской Аравии (110 000 BTC) и Правительство Северной Кореи (180 000 BTC).— Есть «Bitcoin-Цитадели», куда прячутся все, кто имеет минимум 0.001 BTC— Автор письма вместе со сторонниками хочет полностью уничтожить Интернет.Сказка, но прикольная)Оригинал — https://www.reddit.com/r/Bitcoin/comments/1lfobc/i_am_a_timetraveler_from_the_future_here_to_beg/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "July 05, 2023, 02:03:00 AM",
      "body": "QuoteКонфискацию, конечно, тоже можно рассматривать как форму инвестирования, но тут мы сталкиваемся с тем, что конфискованные биткойны продают нередко не в наиболее благоприятные для этого моменты, а когда будут соответствующие юридические основания. Скажем, у Финляднии было порядка 2 тысяч конфискованных биткойнов, но в прошлом году она почти всё продала, оставив только около 90 биткойнов, по которым не завершились суды. США тоже уже продавали часть конфискованных биткойнов, и время от времени запускается FUD с тем, что они якобы сейчас вот-вот ещё начнут большую распродажу. Без чёткого плана инвестирования все эти конфискованные биткойны могут быть проданы совсем без учёта рынка, а вот купленные и намайненные, скорее всего, будут либо ожидать каких-нибудь хаёв, либо храниться для обеспечения устойчивости финансовой системы, но и тогда вряд ли будут проданы на дне.Для того, чтобы государству продавать крипту по самым выгодным ценам нужно иметь утверждённую на самом высоком уровне (де факто) торговую систему, не меньше. Хотя бы систему прогностики хаёв и , соответственно, лоёв. При этом должен быть консенсус в отношении  того, какие метрики, индикаторы и системы прогнозирования использовать. Ну или должен быть пул экспертов, так сказать, которым можно доверять и которые показывали бы высокое качество предсказаний по статистике.     По целому ряду причин это или невозможно или очень затруднительно. Начнём с широко распространённого мнения о том хотя бы, что будущее предсказать невозможно. Есть и другие причины, но одной этой уже достаточно.Quote— Наступил полный Bitcoin-апокалипсис, в результате чего фиатные деньги обесценились— 2025 ценность существует в двух основных формах: земля и криптовалюта—Тот, у кого 0.001 BTC — богатыйСупервлажные мечты криптана).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inwestour",
      "created_time": "July 05, 2023, 11:47:40 AM",
      "body": "Quote from: Julien_Olynpic on July 05, 2023, 02:03:00 AMДля того, чтобы государству продавать крипту по самым выгодным ценам нужно иметь утверждённую на самом высоком уровне (де факто) торговую систему, не меньше. Хотя бы систему прогностики хаёв и , соответственно, лоёв. При этом должен быть консенсус в отношении  того, какие метрики, индикаторы и системы прогнозирования использовать. Ну или должен быть пул экспертов, так сказать, которым можно доверять и которые показывали бы высокое качество предсказаний по статистике.     По целому ряду причин это или невозможно или очень затруднительно. Начнём с широко распространённого мнения о том хотя бы, что будущее предсказать невозможно. Есть и другие причины, но одной этой уже достаточно.Государство любит все усложнять, они начнут создавать целые отдели, которые будут заниматься аналитикой и мониторингом, ставить директора, начальника. заместителя, секретаря и еще непонятного, а в итоге будет сидеть один или несколько рабочих, которые будут вычислять благоприятное время для продажи, но на этот отдел придется выделить столько денег, что может это все не имеет смысла.  Для них это просто средства, которые пришли к ним и при необходимости они ними воспользуются, а по какой цене они продают, там вообще никого не волнует.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "July 05, 2023, 08:52:26 PM",
      "body": "Quote from: Julien_Olynpic on July 05, 2023, 02:03:00 AMQuoteКонфискацию, конечно, тоже можно рассматривать как форму инвестирования, но тут мы сталкиваемся с тем, что конфискованные биткойны продают нередко не в наиболее благоприятные для этого моменты, а когда будут соответствующие юридические основания. Скажем, у Финляднии было порядка 2 тысяч конфискованных биткойнов, но в прошлом году она почти всё продала, оставив только около 90 биткойнов, по которым не завершились суды. США тоже уже продавали часть конфискованных биткойнов, и время от времени запускается FUD с тем, что они якобы сейчас вот-вот ещё начнут большую распродажу. Без чёткого плана инвестирования все эти конфискованные биткойны могут быть проданы совсем без учёта рынка, а вот купленные и намайненные, скорее всего, будут либо ожидать каких-нибудь хаёв, либо храниться для обеспечения устойчивости финансовой системы, но и тогда вряд ли будут проданы на дне.Для того, чтобы государству продавать крипту по самым выгодным ценам нужно иметь утверждённую на самом высоком уровне (де факто) торговую систему, не меньше. Хотя бы систему прогностики хаёв и , соответственно, лоёв. При этом должен быть консенсус в отношении  того, какие метрики, индикаторы и системы прогнозирования использовать. Ну или должен быть пул экспертов, так сказать, которым можно доверять и которые показывали бы высокое качество предсказаний по статистике.     По целому ряду причин это или невозможно или очень затруднительно. Начнём с широко распространённого мнения о том хотя бы, что будущее предсказать невозможно. Есть и другие причины, но одной этой уже достаточно.Quote— Наступил полный Bitcoin-апокалипсис, в результате чего фиатные деньги обесценились— 2025 ценность существует в двух основных формах: земля и криптовалюта—Тот, у кого 0.001 BTC — богатыйСупервлажные мечты криптана).Тут нужно всё-таки отметить, что 2025 год пока не наступил. Может я со своими 0.001 BTC уже богатый, просто пока не знаю об этом. Может мне уже пора Цитадель строить, вокруг заброшенного мыловаренного завода.Государства, конечно не должны торговать Биткоином. У них вообще таких функций нет. Это невозможно на уровне должностных инструкций и нормативных правил.А вот Центральные Банки, на мой взгляд, со временем начнут иметь дело с Биткоином.Для этого тоже нужно внести соответствующие изменения в  документы базельского комитета. Но владеть, это не значит торговать. Да, на мой взгляд торговать биткоином и не нужно. У него другое предназначение.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "July 06, 2023, 01:43:16 AM",
      "body": "Quote from: Inwestour on July 05, 2023, 11:47:40 AMQuote from: Julien_Olynpic on July 05, 2023, 02:03:00 AMДля того, чтобы государству продавать крипту по самым выгодным ценам нужно иметь утверждённую на самом высоком уровне (де факто) торговую систему, не меньше. Хотя бы систему прогностики хаёв и , соответственно, лоёв. При этом должен быть консенсус в отношении  того, какие метрики, индикаторы и системы прогнозирования использовать. Ну или должен быть пул экспертов, так сказать, которым можно доверять и которые показывали бы высокое качество предсказаний по статистике.     По целому ряду причин это или невозможно или очень затруднительно. Начнём с широко распространённого мнения о том хотя бы, что будущее предсказать невозможно. Есть и другие причины, но одной этой уже достаточно.Государство любит все усложнять, они начнут создавать целые отдели, которые будут заниматься аналитикой и мониторингом, ставить директора, начальника. заместителя, секретаря и еще непонятного, а в итоге будет сидеть один или несколько рабочих, которые будут вычислять благоприятное время для продажи, но на этот отдел придется выделить столько денег, что может это все не имеет смысла.  Для них это просто средства, которые пришли к ним и при необходимости они ними воспользуются, а по какой цене они продают, там вообще никого не волнует. Ну а как же без этого? Государство - это же не частная лавочка, а солидный институт. И тут всё должно быть максимально упорядоченно. Ведь всегда могут найтись некие политические активисты, которые могут задать провокационные вопросы, типа, а на каком основании вы продали биткойны из казны в 2018-м, а не в 2021-м? Какими системами прогнозирования вы пользовались?  Это в случае неудачного прогноза цены, положенного в основу продажи. А если система окажется удачной в плане прогнозов и ей будут широко пользоваться, то рано или поздно произойдёт её утечка и ей захотят воспользоваться сначала узкие прослойки инсайдеров, а потом и все неленивые. В какой-то момент много игроков начнут торговать против системы и она перестанет работать.  А так-то, представьте, если бы государство могло бы продавать на хаях и покупать биток на лоях, то и нефть не нужна была бы? Торгуй себе и получай торговую ренту! И пополняй бюджет!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inwestour",
      "created_time": "July 06, 2023, 09:48:02 AM",
      "body": "Quote from: Julien_Olynpic on July 06, 2023, 01:43:16 AM  Это в случае неудачного прогноза цены, положенного в основу продажи. А если система окажется удачной в плане прогнозов и ей будут широко пользоваться, то рано или поздно произойдёт её утечка и ей захотят воспользоваться сначала узкие прослойки инсайдеров, а потом и все неленивые. В какой-то момент много игроков начнут торговать против системы и она перестанет работать.  А так-то, представьте, если бы государство могло бы продавать на хаях и покупать биток на лоях, то и нефть не нужна была бы? Торгуй себе и получай торговую ренту! И пополняй бюджет!Возможно, но поскольку это конфискованный биток, а не купленный за деньги налогоплательщиков, то и отчитывать ни перед кем не нужно, просто продал, когда с финансами напряг и все ок, все довольны. А вот если бы государство уже всерьез взялось за такое направление, то тут спрос был бы максимальный, и за то когда купил и почему купил и за то когда и почему продал. Но мне кажется это слишком рискованное направление, чтобы государство решилось на такие инвестиции.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "July 06, 2023, 11:11:02 AM",
      "body": "Quote from: Inwestour on July 06, 2023, 09:48:02 AMА вот если бы государство уже всерьез взялось за такое направление, то тут спрос был бы максимальный, и за то когда купил и почему купил и за то когда и почему продал. Но мне кажется это слишком рискованное направление, чтобы государство решилось на такие инвестиции. Ну, примеры Сальвадора и Бутана нам показывают, что не со всякого государства так уж легко спросишь за то, чего, когда и почём. Мы по-прежнему не знаем ни кто, ни в сколько подписей, ни как хранит тамошние биткойны, не говоря уже о контроле граждан за процессами развития добывающей биткойны инфраструктуры, а также интенсивности инвестирования. Да я бы сказал, что и по традиционным резервным активам общество не очень детально выясняет, насколько всё разумно и правильно, смотрят больше на общий фон. Так что ИМХО будут инвестировать и в биткойны, и стратегии расписывать, и не особо убоятся народного гнева.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Inwestour",
      "created_time": "July 06, 2023, 01:35:22 PM",
      "body": "Quote from: jokers10 on July 06, 2023, 11:11:02 AMНу, примеры Сальвадора и Бутана нам показывают, что не со всякого государства так уж легко спросишь за то, чего, когда и почём. Мы по-прежнему не знаем ни кто, ни в сколько подписей, ни как хранит тамошние биткойны, не говоря уже о контроле граждан за процессами развития добывающей биткойны инфраструктуры, а также интенсивности инвестирования. Да я бы сказал, что и по традиционным резервным активам общество не очень детально выясняет, насколько всё разумно и правильно, смотрят больше на общий фон. Так что ИМХО будут инвестировать и в биткойны, и стратегии расписывать, и не особо убоятся народного гнева. Пример Бутана не подходит потому что они майнят биток используя зеленую энергию, то есть по сути они получают биткоин используя природные ресурсы страны, тут отсутствует фактор покупки биткоина за деньги налогоплатильщиков.А за Сальвадор говорить еще слишком рано, поскольку Букеле покупает, но еще не продавал. Да и тут как говорится результат на лицо, преступность снизил, туризм развивается, планирует построить аэропорт, поэтому в данном случае даже с промахом с случае неудачных продаж гнев будет не очень сильным. А так то да, каждый кормилец думает о своих проблемах, о своей семье, так что от населения проблем не будет много, тут нужно больше думать об оппозиции, я не только о Сальвадоре сейчас а в целом.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "October 18, 2023, 09:54:37 AM",
      "body": "Quote from: jokers10 on June 29, 2023, 08:17:14 AMТе же США считаются одним из крупнейших государственных владельцев биткойнов. По данным Форбс, на контролируемым правительством этой страны находится 207 189 биткойнов. Но все эти монеты были изъяты в ходе разбирательств по различным преступлениям, так что вряд ли назовёшь это инвестированием.CNBC выпустили длинную статью с историей конфискации у Джимми Чжуна 50 тысяч биткойнов, украденных у Silk Road. По заявлению адвоката Джимми Чжуна Майкла Бахнера, эти 50к монет правительство США уже продало. Вину Джимми признал, и ему ещё около года предстоит провести в тюрьме.Вообще, довольно увлекательная история о том, как к поимке Чжуна отчасти привело то, что он заявил о краже у него самого полуторы сотен биткойнов (физической кражи, со взломом и проникновением в жилище). Представители правоохранительных органов полагают, что Джимми был из ранних биткойнеров и даже принимал участие в его разработке на первых этапах. В итоге, основные биткойны хранились на одноплатном миникомпьютере, который лежал в банке из-под попкорна в подвале.Но, в общем-то, сгубило Джимми именно то, что он украл эти 50к монет Silk Road. Если бы он пользовался только тем, что сам намайнил, возможно, он не мог бы вести настолько роскошный образ жизни, какой вёл, но, вероятно, ему должно было бы хватить и своих: раз он ухитрился не разбазарить полностью за года украденное, значит, и намайненное тратил бы с какой-то осмотрительностью...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unsoldier",
      "created_time": "October 18, 2023, 01:04:07 PM",
      "body": "Не думаю, что государства будут инвестировать в биткоин. Просто если вдруг какая-то из больших стран решит вложить десяток-другой охулиардов долларов в майнинг битка для осуществления атаки 51 и дедецентрализации первой криптовалюты, то финансы других стран вложившихся в биткоин будут по угрозой. Конечно какой-нибудь Албании или Судану это не под силу, но вот страна контролирующая энергетические, технологические и производственные мощности вполне может такое осуществить.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "October 18, 2023, 08:50:52 PM",
      "body": "Quote from: Unsoldier on October 18, 2023, 01:04:07 PMНе думаю, что государства будут инвестировать в биткоин. Просто если вдруг какая-то из больших стран решит вложить десяток-другой охулиардов долларов в майнинг битка для осуществления атаки 51 и дедецентрализации первой криптовалюты, то финансы других стран вложившихся в биткоин будут по угрозой. Конечно какой-нибудь Албании или Судану это не под силу, но вот страна контролирующая энергетические, технологические и производственные мощности вполне может такое осуществить. В том-то и дело, что энергетические мощности достаточно равномерно распределены по миру. Всем странам, так или иначе, нужна энергия для обогрева своих жилищ, для для промышленных предприятий, вообще для жизни и для развития экономики. В некоторых странах построены атомные электростанции, в некоторых странах есть бурные реки и поэтому и существуют гидроэлектростанции, где то используют солнечную энергию, или ветровую.Но такой страны, чтобы была монополистом в области производства электроэнергии -  её наверное и нет ... Поэтому государствам выгодно майнить Bitcoin. Биткоин это фактически стратегический ресурс, а со временем это будет ещё и мера успешности каждой конкретной страны (я в это верю).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "October 19, 2023, 02:55:09 AM",
      "body": "Quote from: Smartprofit on October 18, 2023, 08:50:52 PMQuote from: Unsoldier on October 18, 2023, 01:04:07 PMНе думаю, что государства будут инвестировать в биткоин. Просто если вдруг какая-то из больших стран решит вложить десяток-другой охулиардов долларов в майнинг битка для осуществления атаки 51 и дедецентрализации первой криптовалюты, то финансы других стран вложившихся в биткоин будут по угрозой. Конечно какой-нибудь Албании или Судану это не под силу, но вот страна контролирующая энергетические, технологические и производственные мощности вполне может такое осуществить. В том-то и дело, что энергетические мощности достаточно равномерно распределены по миру. Всем странам, так или иначе, нужна энергия для обогрева своих жилищ, для для промышленных предприятий, вообще для жизни и для развития экономики. В некоторых странах построены атомные электростанции, в некоторых странах есть бурные реки и поэтому и существуют гидроэлектростанции, где то используют солнечную энергию, или ветровую.Но такой страны, чтобы была монополистом в области производства электроэнергии -  её наверное и нет ... Поэтому государствам выгодно майнить Bitcoin. Биткоин это фактически стратегический ресурс, а со временем это будет ещё и мера успешности каждой конкретной страны (я в это верю).Вряд ли самому государству выгодно майнить биток. Скорее выгодно создавать комфортные условия для майнеров (в пределах разумного, конечно, без фанатизма, а то дело может кончится ограничительными тарифами для майнеров). А уж с прибыли майнеров, если те, конечно, не найдут способов её скрывать, удобно брать налоги.Но выгоднее и налоги брать и специальные тарифы на электроэнергию устанавливать.   А просто брать себе на баланс битки чревато. Государству трудно будет хранить битки так, чтобы приватные ключи не были дискредитированы. Разве что бумажные битки на Койнбазе покупать, но тогда ты становишься зависимым от институтов другого государства, может быть не всегда дружественного.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptmuster",
      "created_time": "October 19, 2023, 07:55:36 AM",
      "body": "Quote from: Julien_Olynpic on October 19, 2023, 02:55:09 AMВряд ли самому государству выгодно майнить биток. Скорее выгодно создавать комфортные условия для майнеров (в пределах разумного, конечно, без фанатизма, а то дело может кончится ограничительными тарифами для майнеров). А уж с прибыли майнеров, если те, конечно, не найдут способов её скрывать, удобно брать налоги.Но выгоднее и налоги брать и специальные тарифы на электроэнергию устанавливать.   А просто брать себе на баланс битки чревато. Государству трудно будет хранить битки так, чтобы приватные ключи не были дискредитированы. Разве что бумажные битки на Койнбазе покупать, но тогда ты становишься зависимым от институтов другого государства, может быть не всегда дружественного.Государство с давних времен научилось облагать все налогами, вот и в данном случае их основная цель будет получать с майнеров хорошие налоги. Недавно Токаев поднял тарифы для майнеров, сейчас тоже самое планируется в рф, правительства не сильно хотят заморачиваться кто чего там заработал, используешь электроэнергию и хорошо на этом зарабатываешь, плати высокие доходы, а предлог повышение всегда можно придумать, главное что они понимают что для майнера это все.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}