{
  "id": "topic_5433775",
  "title": "XEN_Protocol",
  "author": "XEN_Protocol",
  "created_time": "January 10, 2023, 01:29:06 PM",
  "content": "If I am trading on a centralised exchange and I decide to close an order that's not executed yet will fees be deducted?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433775",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "January 10, 2023, 01:31:13 PM",
      "body": "No, not as far as I know. If you cancel the order before its filled, then you shouldn't be charged anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "January 10, 2023, 01:35:04 PM",
      "body": "If the trade is not filled, no fee will be deducted as far as I know. If you are using an exchange that your money is deducted, do not use it again. I have used more than 6 exchanges and no one will deduct money if I cancel an open order that is not yet filled at all. If you have $100 and you cancel the order without any been filled, you will still have $100, nothing will be deducted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "January 10, 2023, 01:50:22 PM",
      "body": "Quote from: XEN_Protocol on January 10, 2023, 01:29:06 PMIf I am trading on a centralised exchange and I decide to close an order that's not executed yet will fees be deducted? No just as everyone has suggested as long as the trade is not assigned on the later end and transaction not been completed, you can easily oress the back button and close the order, but once the order has been assigned to a particular buyer which means he is already on the move to make payment or has already done that, then you can't go back than to confirm the reception and same way if you're the buyer, your topic talks more about bitcoin trades and i will suggest you move the thread to trading discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "January 11, 2023, 03:00:09 AM",
      "body": "I don't know if there is a centralized exchange that operates otherwise, but as far as my understanding and experience are concerned, trading fees are only paid when your order gets filled. It is usually deducted from what you receive. And I think that's the fair way of doing things. Why should a trader who cancelled an order pay for it? Nothing happened, after all. Perhaps a fee is rightly charged even if an order is cancelled if it is already partially filled.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 11, 2023, 05:49:09 PM",
      "body": "Quote from: XEN_Protocol on January 10, 2023, 01:29:06 PMIf I am trading on a centralised exchange and I decide to close an order that's not executed yet will fees be deducted? What platform are you trading on and what type of trading? If you mean to close is that you \"cancel\" the order before it is executed, then most likely no fees will be requested from you.Either if the order is executed or you close a position, a fee will be deducted from you.To avoid all of this, read the fees page of the platform and avoid any platform that does not explain to you how to deduct the fees accurately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}