{
  "id": "topic_5472719",
  "title": "FP91G",
  "author": "FP91G",
  "created_time": "November 03, 2023, 02:17:53 PM",
  "content": "Marathon Digital will use landfill methane to mine Bitcoin in Utah pilot projectThe BTC miner has partnered with startup Nodal Power for a green, off-grid project that is a small start for a potentially big advancement.Marathon Digital has begun mining Bitcoin  using power generated from methane gas siphoned off a landfill. The 280-kW off-grid pilot project is operating in Utah.Marathon teamed up with Nodal Power on the project. Nodal Power was launched in November 2022 and produces energy from landfill gas in the southeastern United States and Texas. It raised $13 million in a seed round in August to operate two sites, one of which includes a data center.https://cointelegraph.com/news/marathon-digital-landfill-methane-mine-bitcoin-utah-pilot-projectIs this a working technology or is it a reason to get permission to mine under the pretext of doing useful work by burning methane?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472719",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "November 03, 2023, 03:37:03 PM",
      "body": "Landfill methane has been used for a while to generate powerhttps://www.energy.ca.gov/data-reports/california-power-generation-and-power-sources/biomass/landfill-gas-power-plantshttps://inoplex.com.au/information/how-is-landfill-gas-turned-into-electricity/https://www.energy.gov/eere/amo/articles/tapping-landfill-gas-provide-significant-energy-savings-and-greenhouse-gasUsing it to power miners is just marketing. Either the power goes to the grid and then to the miners or it just goes to the miners.Not a big deal except it's 'crypto' so they are putting it out there.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 03, 2023, 03:58:51 PM",
      "body": "Quote from: DaveF on November 03, 2023, 03:37:03 PMUsing it to power miners is just marketing. Either the power goes to the grid and then to the miners or it just goes to the miners.Not a big deal except it's 'crypto' so they are putting it out there.-DaveGreenwashing at its best and Mara trying to save face with the army of skeletons in their closet!They make a lot of fuss over a 200kw pilot program and in the background they just build a whole damn 200MW gas powerplant!Just like when saying we mine with hydroelectricity, we're all green, blame the pollution on coal, no shit Sherlock if you wouldn't be mining with that green electricity then all it would go to those that are using coal-powered electricity and there won't be a reason for the coal plant running in the first place!The same BS as being green with an electric car that is filled with electricity generated via fossil, the only way to actually be green and help the environment would be to lock down that car, and even if you have solar panels direct that energy to the grid so less dirty electricity is being used!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "November 03, 2023, 04:14:47 PM",
      "body": "In terms of environmental impact, it's always better to burn methane than let it go to the atmosphere raw. Methane has a higher impact on the greenhouse effect than if it was burned, which turns it into CO2 and water. The issue with this is that it's very hard to capture methane en masse and therefore it wasn't considered economically feasible to capture methane at large scale for energy production.The other issue is that even if we manage to capture methane and burn it on the spot it would require large upgrades to the electric grid's infrastructure in order for the grid to be able to distribute this power for consumption so we could actually utilize savings. So installing bitcoin mines in places that produce methane sounds like a good idea because the extra monetization acts as good incentive to continue the activity of capturing and burning methane (instead of letting it escape and harm the environment) at times of low electricity demand. TL;DR, this COULD work. But only time will tell. Yes, maybe it's greenwashing because it's hard to orchestrate such experimental things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 03, 2023, 08:30:26 PM",
      "body": "Quote from: stompix on November 03, 2023, 03:58:51 PMQuote from: DaveF on November 03, 2023, 03:37:03 PMUsing it to power miners is just marketing. Either the power goes to the grid and then to the miners or it just goes to the miners.Not a big deal except it's 'crypto' so they are putting it out there.-DaveGreenwashing at its best and Mara trying to save face with the army of skeletons in their closet!They make a lot of fuss over a 200kw pilot program and in the background they just build a whole damn 200MW gas powerplant!Just like when saying we mine with hydroelectricity, we're all green, blame the pollution on coal, no shit Sherlock if you wouldn't be mining with that green electricity then all it would go to those that are using coal-powered electricity and there won't be a reason for the coal plant running in the first place!The same BS as being green with an electric car that is filled with electricity generated via fossil, the only way to actually be green and help the environment would be to lock down that car, and even if you have solar panels direct that energy to the grid so less dirty electricity is being used!It really depends on where you are. In the US there is a lot more hydro power then can be used in certain areas. And this is the crap part there is not enough power transmission infrastructure to move it to where you would be able to offset coal / oil plants. Being able to generate an extra xxMW of power is great. But if you don't have a way of getting it someplace it's pointless.Back to mining & methane. Yes, burning methane is better then releasing it and if you can set it up near the local landfill (where nobody wants to be anyway) and still make it profitable then why not.But if there is a way to economically feed it back into the grid then that might be a better option. But I can see local power utilities not wanting to have to deal with a bunch of small methane plants for very little upside in terms of additional power.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "November 04, 2023, 03:00:15 PM",
      "body": "Quote from: alani123 on November 03, 2023, 04:14:47 PMIn terms of environmental impact, it's always better to burn methane than let it go to the atmosphere raw. Methane has a higher impact on the greenhouse effect than if it was burned, which turns it into CO2 and water. The issue with this is that it's very hard to capture methane en masse and therefore it wasn't considered economically feasible to capture methane at large scale for energy production.The other issue is that even if we manage to capture methane and burn it on the spot it would require large upgrades to the electric grid's infrastructure in order for the grid to be able to distribute this power for consumption so we could actually utilize savings. So installing bitcoin mines in places that produce methane sounds like a good idea because the extra monetization acts as good incentive to continue the activity of capturing and burning methane (instead of letting it escape and harm the environment) at times of low electricity demand. TL;DR, this COULD work. But only time will tell. Yes, maybe it's greenwashing because it's hard to orchestrate such experimental things. I also assumed so, because a lot of money is tedious for a powerful generator to generate electricity, and making a non-polluting project because of the small power for mining bitcoins is not profitable, unless this is a reason to take up space or build an additional power plant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "November 15, 2023, 04:52:44 AM",
      "body": "The question is, is the methane gonna be enough to fill up with the demand if so the trash that we produce is unbelievable a lot. But what I hear is country like Singapore is burning trash to generate power \"A waste incineration plant in southwestern Singapore's Tuas district can process about 35% of the garbage that the city-state generates daily. About 500 to 600 garbage trucks carry in waste around the clock to the plant, whose power production capacity reaches 120 megawatts.\" - https://asia.nikkei.com/Business/Energy/Southeast-Asia-looks-to-its-growing-piles-of-trash-as-new-energy-sourceand also in my country, there is a region that \"PLTSa Surakarta, Long Term Waste Management SolutionThe Surakarta Waste Power Plant began full operation in Surakarta City, Central Java, Monday (30/10/2023). The presence of this technology is a long-term waste management solution for the region.\" - https://www.kompas.id/baca/english/2023/10/30/en-pltsa-surakarta-solusi-jangka-panjang-pengelolaan-sampahand in my opinion that would be great if we can burn methane and plastic trash at the same time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "November 15, 2023, 10:20:06 AM",
      "body": "Quote from: dansus021 on November 15, 2023, 04:52:44 AMThe question is, is the methane gonna be enough to fill up with the demand if so the trash that we produce is unbelievable a lot. But what I hear is country like Singapore is burning trash to generate power \"A waste incineration plant in southwestern Singapore's Tuas district can process about 35% of the garbage that the city-state generates daily. About 500 to 600 garbage trucks carry in waste around the clock to the plant, whose power production capacity reaches 120 megawatts.\" - https://asia.nikkei.com/Business/Energy/Southeast-Asia-looks-to-its-growing-piles-of-trash-as-new-energy-sourceSo a plant with 120MW capacity!!! burns 1/3 of the garbage the city generates.Let's ingore that is the maximum capacity and not continous oen and do the math.120MW running full year, 1,051 TWh, increase by 3 you have a maximum capacity of 3TWh.Singapore generated 57.1 TWh of electricity in 2022.At best 5%, but in reality is nowhere around that number, the plant actually produced only 54 GWh instead of one TWh, so more like 0.25%.Quote from: dansus021 on November 15, 2023, 04:52:44 AMand in my opinion that would be great if we can burn methane and plastic trash at the same time Burning plastic is worse than just burying it, have you ever been around a fire burning plastic or have you had something of plastic catching fire? There are a ton of different chemicals in every single plastic thing, some things that would be released in a fire are deadly, we have a ton of them banned in Europe, as the fumes of those things would kill you 100 times faster than the fire itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "November 17, 2023, 02:32:30 AM",
      "body": "Quote from: stompix on November 15, 2023, 10:20:06 AMBurning plastic is worse than just burying it, have you ever been around a fire burning plastic or have you had something of plastic catching fire? There are a ton of different chemicals in every single plastic thing, some things that would be released in a fire are deadly, we have a ton of them banned in Europe, as the fumes of those things would kill you 100 times faster than the fire itself.I know but in Asia especially in my country plastic has become a big problem and the material has been widely used in Asia because is cheap and robust. Plastic Straws, food utensils, and plastic bags usually cannot be recycled again since they are small. Plastic bottles might be recycled. Cardboard/Paper, Glass bottles, aluminum, Steel, and organic materials are recyclable but the only ones left are small plastic and small paper that can be burned and turned into energy. There is no option left I think because burying it needs a massive landfill over time but burning is also a not pretty good solution.Oh and I watch this videos as well - https://www.youtube.com/watch?v=RN0vvKxKNzo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "November 17, 2023, 02:55:39 AM",
      "body": "I don't know if this an American initiative. I haven't read about any gases powering bitcoin miners before what the OP's saying about Utah. I'd say it's a gimmick if they can't power plants specifically to power mining farms. If they're putting turbine power in the grid it's going to be used for commercial and domestic use not only for mining.Methane, hydrogen, solar, hydro electric they've all been used in the past as options but did the power plants use them?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 17, 2023, 02:59:26 PM",
      "body": "As I pointed out above one of the biggest problem is delivery.For a home using solar to have it put power back into the grid when needed is not a big deal.For a larger operation to put a larger amount of power back into the grid a lot more engineering and planning is needed.If you can use the power by the generation point or close to the generation point or at least within it's own substation so to speak it's a lot easier and cost effective.Not to mention, that if it does not work or has issues the local energy company is really not bothered about it.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "November 17, 2023, 05:06:10 PM",
      "body": "Quote from: arabspaceship123 on November 17, 2023, 02:55:39 AMI don't know if this an American initiative. I haven't read about any gases powering bitcoin miners before what the OP's saying about Utah. I'd say it's a gimmick if they can't power plants specifically to power mining farms. If they're putting turbine power in the grid it's going to be used for commercial and domestic use not only for mining.Methane, hydrogen, solar, hydro electric they've all been used in the past as options but did the power plants use them?1000's of  solar megawatts are grid tied in the USA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arabspaceship123",
      "created_time": "November 17, 2023, 10:24:54 PM",
      "body": "Thanks. Solar's green power so it's clean energy being pumped in to the grids without damaging the planet. If it's environmentally friendly it's going to have the backing of ordinary ppl but are methane, hydrogen & hydro electric powering the grids in America? Quote from: philipma1957 on November 17, 2023, 05:06:10 PMQuote from: arabspaceship123 on November 17, 2023, 02:55:39 AMI don't know if this an American initiative. I haven't read about any gases powering bitcoin miners before what the OP's saying about Utah. I'd say it's a gimmick if they can't power plants specifically to power mining farms. If they're putting turbine power in the grid it's going to be used for commercial and domestic use not only for mining.Methane, hydrogen, solar, hydro electric they've all been used in the past as options but did the power plants use them?1000's of  solar megawatts are grid tied in the USA",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotFuzzyWarm",
      "created_time": "November 18, 2023, 01:55:57 AMLast edit: November 18, 2023, 03:12:07 AM by NotFuzzyWarm",
      "body": "To some extent yes. At least in Michigan most of the larger landfills are required to have methane capture/monitoring piping already in place so it's a no-brainer for many of them them to use that gas to power turbines to feed a few MW or even 10's of MW into the local grids.edit: turns out that in the US,QuoteThe EPA has established rules which require monitoring and installation of gas collection and control systems if emissions exceed a certain threshold. Thus, many large landfills are legally obligated to capture the gas, but have a variety of opportunities when it comes to how to use it.Gas can be flared (rendering it less potent by conversion to carbon dioxide and water), used directly on site or nearby, or upgraded for sale as renewable natural gas, among other uses, according to the EPA's Landfill Methane Outreach Program (LMOP).Electricity generation is the most common use by far: according to the NWRA, 74% of U.S. LFG projects generate electricity. Nationwide, about 2.44 GW of capacity are currently installed, enough to power more than a million homes. Good article about it here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "November 18, 2023, 03:39:09 AM",
      "body": "While I have also heard of methane being used to generate electricity (which can of course be used to mine Bitcoin), I have never heard of landfill methane being anything other than an anecdotal energy source. There is not enough raw material for the concept to scale up to something bigger. And good for that, because we would need to produce a lot of organic trash. And that sounds like a whole other problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "November 20, 2023, 06:25:21 PM",
      "body": "Last year, there was a White House report that acknowledged the potential positive impact of crypto mining operations, especially those capturing vented methane to produce electricity. Also, it was sometime in 2021 when ExxonMobil launched a pilot project, the goal was to mine Bitcoin in North Dakota's Bakken oil fields with all their surplus coal seam gas. The way they wanted to do it was instead of sending leftover gas up a stack and flared to  atmosphere, they re-routed the hydrocarbons to a gas turbine connected to a bank of mining rigs. There was also a plan to do the same thing in other countries like Argentina, Nigeria.* ExxonMobil Running Pilot Project to Supply Flared Gas for Bitcoin Mining: Report (coindesk.com)- https://www.coindesk.com/business/2022/03/24/exxonmobil-running-pilot-project-to-supply-flared-gas-for-bitcoin-mining-report/* White House Crypto Mining Report Draws Praise From Advocates and Critics Alike (coindesk.com)https://www.coindesk.com/policy/2022/09/12/white-house-crypto-mining-report-draws-praise-from-advocates-and-critics-alike/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}