{
  "id": "topic_5455578",
  "title": "BitGoba",
  "author": "BitGoba",
  "created_time": "June 07, 2023, 08:48:39 AMLast edit: June 07, 2023, 05:57:18 PM by hilariousandco",
  "content": "Robosats je novi P2P za trgovanje Bitcoinom kao sto je bio localbitcoin i slicni P2P servisi samo sto ovde ne treba otvarati racun i prolaziti KYCMoze se dodati i trgovati bilo kojim metodom placanja  Revolut,Paypal,Stripe itd jako brzo , jednostavno i sigurno a moze se i zaraditi  dodatno  kao p2p trgovac par postotaka na trejdovima ko ima volje i vremena da se ovim bavi https://learn.robosats.com/Video tutorijal https://www.youtube.com/watch?v=52snf3x2KKAClanak o Robosats u Bitcoinmagazinu https://bitcoinmagazine.com/business/robosats-private-bitcoin-exchange",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455578",
  "comments": [
    {
      "author": "Pmalek",
      "created_time": "June 07, 2023, 04:01:02 PM",
      "body": "Dobra stvar je naravno to da se ne mora prolaziti kroz bespotrebne KYC procedure i da se sve odvija preko TOR browsera što je dodatni benefit za anonimnost korisnika.Ono što se meni osobno ne sviđa a možda i drugima je što se mora koristiti Lightning Network. Volio bi da postoji opcija da korisnik izabere ili tradicionalni BTC ili bitcoin preko LN mreže.Mnogim novajlijama je bitcoin sam po sebi dovoljno komplikovan a kamoli još da ga povežete sa LN mrežom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "June 08, 2023, 04:12:23 PM",
      "body": "Quote from: Pmalek on June 07, 2023, 04:01:02 PMDobra stvar je naravno to da se ne mora prolaziti kroz bespotrebne KYC procedure i da se sve odvija preko TOR browsera što je dodatni benefit za anonimnost korisnika.Ono što se meni osobno ne sviđa a možda i drugima je što se mora koristiti Lightning Network. Volio bi da postoji opcija da korisnik izabere ili tradicionalni BTC ili bitcoin preko LN mreže.Mnogim novajlijama je bitcoin sam po sebi dovoljno komplikovan a kamoli još da ga povežete sa LN mrežom.  Mozes uvjek da vratis Bitcoin sa  Lightning mreze na glavni lanac Sada skoro svi Bitcoin LN novcanici podrzavaju i LN i on chain istovremeno  kao naprimjer https://www.walletofsatoshi.com/Bitcoin LN transakcije su jeftinije ,brze a LN novcanici za mobilne su dosta jednostavni nema puno opcija samo send i recive Ovaj momak u videu je koristio Bicoin LN novcanik Alby koji je ekstenazija za web preglednike ali moze da se koristi bilo koji drugi LN novcanik koji istovremeno  podrzava on chain",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 08, 2023, 06:13:01 PM",
      "body": "Slanje preko Lightning mreže jeste jeftinije u poređenju sa on-chain transakcijama ali tek onda kad svoje coine preneseš off-chain. Ako stalno trguješ sa jednim korisnikom, onda je LN dobar izbor. Ali ako se ja i ti sad dogovorimo da ti meni prodaš nešto bitcoina u zamjenu za fiat, a ni ja ni ti nemamo LN kanal jedan do drugog, korištenje LN mreže će nam biti čak i skuplje.Bez LN mreže:Ti pošalješ BTC sa svog novčanika na moj. Platiš standardne on-chain naknade.Sa LN mrežom:Ti platiš standarne on-chain naknade da bi kreirao platni kanal sa mnom. Zatim plačaš LN naknade da bi coine prebacio meni.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "June 09, 2023, 08:20:15 AM",
      "body": "Nema potrebe da obicni korisnik otvara LN  kanale i podize LN nodSkine samo wallet of satoshi na svoj telefon ili muun wallet https://www.walletofsatoshi.com/https://muun.com/I mozete jednostavno kupiti BTC na LN i dalje moze da koristi taj BTC preko LN ili da ga prosljedi na neku svoju ili tudju wallet  adresu i plati onchain fee za onchain transakciju Oba novcanika podrzavaju LN i onchain istovremeno sa istim racunomLN transakcije kostaju obicno svega nekoliko satosija i trenutne su dok je on chain malo skuplje i treba cekati 10-30 minuta za konfirmaciju LN se obicno koristi za neka sitnija placnja i transakcjeMoguce su cak i mikrotrasakcije kao kao slanje i primanje 1 ili 2 satosijaNaravno ko zeli moze da podigne svoj ln nod i otvori kanale sto moze da kosta 200 - 300 evra pisao sam o tome vec ovde https://bitcointalk.org/index.php?topic=5409772.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 09, 2023, 06:05:10 PM",
      "body": "Quote from: BitGoba on June 09, 2023, 08:20:15 AMNema potrebe da obicni korisnik otvara LN  kanale i podize LN nodSkine samo wallet of satoshi na svoj telefon ili muun wallet https://www.walletofsatoshi.com/https://muun.com/I mozete jednostavno kupiti BTC na LN i dalje moze da koristi taj BTC preko LN ili da ga prosljedi na neku svoju ili tudju wallet  adresu i plati onchain fee za onchain transakciju Oba novcanika podrzavaju LN i onchain istovremeno sa istim racunom Zanimljivo. Nisam ni razmišljao o toj opciji i ima smisla da je se neko sjetio da je uvede. Preko kojih servisa/mjenačnica se kupuje LN BTC sa ta dva novčanika? Jel može kupovina i za fiat i kripto? Ima li KYC-a? Šta ti se više sviđa, Muun ili Wallet of Satoshi i zašto? Ako sam dobro zapamtio, ovaj Muun ima neki svoj sustav u kojem korisnicima ne prikazuje seed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "June 10, 2023, 09:40:02 AM",
      "body": "Quote from: Pmalek on June 09, 2023, 06:05:10 PM Preko kojih servisa/mjenačnica se kupuje LN BTC sa ta dva novčanika? Jel može kupovina i za fiat i kripto? Ima li KYC-a? Šta ti se više sviđa, Muun ili Wallet of Satoshi i zašto? Ako sam dobro zapamtio, ovaj Muun ima neki svoj sustav u kojem korisnicima ne prikazuje seed.Ne kupuje se Oba novcanika podrzavaju Bitcoin LN i onchain sa istim racunomMozes da koristis Bitcoin LN i on chain istovremeno Mozes sam sebi sa svog hardwer novcanika da posljes onchain BTC u svoj Muun ili Wallet of Satoshi i da ga posle koristis kao LN ili da primas LN i da ga  povuces na neku drugu onchain adresu ili nazad u svoj hardweski novcanikMuun nije  kastodi novcanik  ali  Wallet of Satoshi jeste ali oba su ok za neka sitnija svakodnevna  placanja",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 10, 2023, 01:14:24 PM",
      "body": "Quote from: BitGoba on June 10, 2023, 09:40:02 AMNe kupuje se Oba novcanika podrzavaju Bitcoin LN i onchain sa istim racunomMozes da koristis Bitcoin LN i on chain istovremeno Onda se nismo razumjeli. Učinilo mi se da si u prošlom postu napisao da možeš da kupiš LN BTC preko ta dva novčanika.Quote from: BitGoba on June 10, 2023, 09:40:02 AMMozes sam sebi sa svog hardwer novcanika da posljes onchain BTC u svoj Muun ili Wallet of Satoshi i da ga posle koristis kao LN ili da primas LN i da ga  povuces na neku drugu onchain adresu ili nazad u svoj hardweski novcanik Onda se vračamo na ono što sam ja napisao u zadnjem postu. Opet praviš on-chain transakciju i plačaš standardne mrežne naknade da bi došao u situaciju da svoj BTC koristiš na LN mreži. Kod čestog korištenja LN mreže to onda ima smisla ali jedno korištenje baš i nema.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "June 10, 2023, 07:11:21 PM",
      "body": "BTC onchain transakcije nisu skupe narocito ako se koristi noviji format adresa mada u zadnje vrijeme kako su uveli NFT i tokene na Bitcoin blokcejn je dosta skuplje nego ranije ,ima dosta transakcija na cekanju ako zelis da prodje brze moras da malo vise platisEvo ja sam juce testirao ovaj servis na kome se mogu Bitcoinom kupiti gift kartice  o kome sam pisao na drugoj temi i posalao sam sebi 25 usd BTC onchain na moj Wallet of Satoshi i onchain transakcija me je izasla 3 usd i odmah sam upao u prvom bloku kasnije LN transakcije su mozda kostale skroz nesto sitno  100 ili 200 satosija",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "June 11, 2023, 07:15:20 PM",
      "body": "Jesi li probao Peach Bitcoin app za P2P trading?Meni je Peach bolji od Robosats, ali oba se mogu koristiti u kombinaciji.Najbolja stvar u ''Breskvi'' je Meetups za cash trading, ali u Hrvatskoj još nema ponuda za to (sve ostalo radi).Još je negativno da nije open source code (najavili kod kod kao Coldcard novčanika MIT+CC), ali zato ima referrale  https://peachbitcoin.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slackovic",
      "created_time": "June 12, 2023, 08:42:38 AM",
      "body": "Quote from: BitGoba on June 10, 2023, 07:11:21 PMBTC onchain transakcije nisu skupe narocito ako se koristi noviji format adresa mada u zadnje vrijeme kako su uveli NFT i tokene na Bitcoin blokcejn je dosta skuplje nego ranije ,ima dosta transakcija na cekanju ako zelis da prodje brze moras da malo vise platisEvo ja sam juce testirao ovaj servis na kome se mogu Bitcoinom kupiti gift kartice  o kome sam pisao na drugoj temi i posalao sam sebi 25 usd BTC onchain na moj Wallet of Satoshi i onchain transakcija me je izasla 3 usd i odmah sam upao u prvom bloku kasnije LN transakcije su mozda kostale skroz nesto sitno  100 ili 200 satosija A čuj... Plaćanje transakcije 3 USD nije skupo ako se šalje više BTC. Ali za slanje tvojih 25 USD cijena transakcija od 3 USD je stvarno puno (preko 10%). Znam da je to bilo samo testiranje i da transakcija košta koliko košta neovisno o iznosu koji se šalje. Zato je dobro koristiti LN za takva sitna plaćanja, a za veće iznose ipak koristiti Bitcoin mrežu.Jedno pitanje pošto nisam baš \"na ti\" s Ligtning mrežom. Ako nekome (npr. u dućanu koji prima BTC) želim platiti 10 dolara, mogu li to platiti s LN walleta neovisno je li adresa koju sam dobio u dućanu LN wallet ili klasični BTC wallet? Ima li za mene kao osobe koja kupuje špeceraj u dućanu ikakve razlike?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 12, 2023, 05:00:39 PM",
      "body": "Quote from: slackovic on June 12, 2023, 08:42:38 AMJedno pitanje pošto nisam baš \"na ti\" s Ligtning mrežom. Ako nekome (npr. u dućanu koji prima BTC) želim platiti 10 dolara, mogu li to platiti s LN walleta neovisno je li adresa koju sam dobio u dućanu LN wallet ili klasični BTC wallet? Ima li za mene kao osobe koja kupuje špeceraj u dućanu ikakve razlike? Kako je BitGoba opisao u ovoj temi, ako imaš Muun wallet ili Wallet of Satoshi, isti saldo možeš trošiti on-chain i off-chain. Drugim riječima, možeš plačati ili preko LN mreže ili slati standardne BTC transakcije.Kod drugih novčanika koji nemaju tu mogućnost to nećeš moći.Sve zavisi da li dućan u kojem kupuješ prima BTC preko LN mreže ili ne. LN mreža nema standardne adrese kakve koristimo on-chain. Na LN mreži plačaš pomoću Lightning Invoice-a. Ili moraš kopirati i zaljepiti invoice ili skenirati QR kod. Ako ti dućan na raspolaganje stavi samo običnu BTC adresu, onda tu ne možeš slati LN BTC.Evo kako izgleda jedan LN invoice:Code:lnbc20m1pvjluezpp5qqqsyqcyq5rqwzqfqqqsyqcyq5rqwzqfqqqsyqcyq5rqwzqfqypqhp58yjmdan79s6qqdhdzgynm4zwqd5d7xmw5fk98klysy043l2ahrqsfpp3qjmp7lwpagxun9pygexvgpjdc4jdj85fr9yq20q82gphp2nflc7jtzrcazrra7wwgzxqc8u7754cdlpfrmccae92qgzqvzq2ps8pqqqqqqpqqqqq9qqqvpeuqafqxu92d8lr6fvg0r5gv0heeeqgcrqlnm6jhphu9y00rrhy4grqszsvpcgpy9qqqqqqgqqqqq7qqzqj9n4evl6mr5aj9f58zp6fyjzup6ywn3x6sk8akg5v4tgn2q8g4fhx05wf6juaxu9760yp46454gpg5mtzgerlzezqcqvjnhjh8z3g2qqdhhwkjIzvor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slackovic",
      "created_time": "June 13, 2023, 06:21:55 AM",
      "body": "Quote from: Pmalek on June 12, 2023, 05:00:39 PMKako je BitGoba opisao u ovoj temi, ako imaš Muun wallet ili Wallet of Satoshi, isti saldo možeš trošiti on-chain i off-chain. Drugim riječima, možeš plačati ili preko LN mreže ili slati standardne BTC transakcije.Kod drugih novčanika koji nemaju tu mogućnost to nećeš moći.Sve zavisi da li dućan u kojem kupuješ prima BTC preko LN mreže ili ne. LN mreža nema standardne adrese kakve koristimo on-chain. Na LN mreži plačaš pomoću Lightning Invoice-a. Ili moraš kopirati i zaljepiti invoice ili skenirati QR kod. Ako ti dućan na raspolaganje stavi samo običnu BTC adresu, onda tu ne možeš slati LN BTC.Evo kako izgleda jedan LN invoice:Code:lnbc20m1pvjluezpp5qqqsyqcyq5rqwzqfqqqsyqcyq5rqwzqfqqqsyqcyq5rqwzqfqypqhp58yjmdan79s6qqdhdzgynm4zwqd5d7xmw5fk98klysy043l2ahrqsfpp3qjmp7lwpagxun9pygexvgpjdc4jdj85fr9yq20q82gphp2nflc7jtzrcazrra7wwgzxqc8u7754cdlpfrmccae92qgzqvzq2ps8pqqqqqqpqqqqq9qqqvpeuqafqxu92d8lr6fvg0r5gv0heeeqgcrqlnm6jhphu9y00rrhy4grqszsvpcgpy9qqqqqqgqqqqq7qqzqj9n4evl6mr5aj9f58zp6fyjzup6ywn3x6sk8akg5v4tgn2q8g4fhx05wf6juaxu9760yp46454gpg5mtzgerlzezqcqvjnhjh8z3g2qqdhhwkjIzvorZnači ako sam dobro shvatio, Ligtning Network je za Bitcoin nešto kao Arbitrum prema Ethereumu - neka vrsta L2 rješenja napravljena za brže i jeftinije transakcije.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 13, 2023, 05:50:05 PM",
      "body": "Quote from: slackovic on June 13, 2023, 06:21:55 AMZnači ako sam dobro shvatio, Ligtning Network je za Bitcoin nešto kao Arbitrum prema Ethereumu - neka vrsta L2 rješenja napravljena za brže i jeftinije transakcije. Za Arbitrum sam samo čuo i ne znam iskreno kako funkcioniše. Što se Ligtning mreže tiče, da, to je layer 2 rješenje napravljeno da se pomogne zagušenju koje često nastaje na Bitcoin mreži i omoguči brže transakcije tamo gdje je to moguće i ima smisla. Naknade su također značajno niže nego na glavnoj mreži.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trofo",
      "created_time": "June 14, 2023, 09:39:40 AM",
      "body": "Quote from: Pmalek on June 13, 2023, 05:50:05 PMQuote from: slackovic on June 13, 2023, 06:21:55 AMZnači ako sam dobro shvatio, Ligtning Network je za Bitcoin nešto kao Arbitrum prema Ethereumu - neka vrsta L2 rješenja napravljena za brže i jeftinije transakcije. Za Arbitrum sam samo čuo i ne znam iskreno kako funkcioniše. Što se Ligtning mreže tiče, da, to je layer 2 rješenje napravljeno da se pomogne zagušenju koje često nastaje na Bitcoin mreži i omoguči brže transakcije tamo gdje je to moguće i ima smisla. Naknade su također značajno niže nego na glavnoj mreži.I ono šta ti pitaš slackovic, nisam još vidio nikoga od dućana, bankomata ili mjenjačnica da prima LN transakcije. Možda sam u krivu jer recimo nisam nikada ni pitao u BTC store da li to prolazi ali meni osobno lighting nije vrijedan truda. Dovoljno je komplicrano naći nekoga ko prima kripto a kamoli se još mučiti sa LN kanalima.Imam instaliran Wallet of Satoshi na mobu i koristam ga tu i tamo ali uglavnom samo za demostraciju brzine LN transakcija. Kažeš nekome da skine wallet, ti skeniraš qr kod i on instant ima BTC kod sebe. Ali onda kreće problem, ta osoba koju si upravo onboardao nema šta napraviti s njime bez da izgubiš jako puno vremna na objašnjavanje. Dok sa običnim BTCom to odradiš uz bankomat i pustiš ga digne EUR par minuta kasnije i imaš puno bolji efekt kada skuže da je to prava lova.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 14, 2023, 03:56:53 PM",
      "body": "Quote from: Trofo on June 14, 2023, 09:39:40 AMImam instaliran Wallet of Satoshi na mobu i koristam ga tu i tamo ali uglavnom samo za demostraciju brzine LN transakcija. Kažeš nekome da skine wallet, ti skeniraš qr kod i on instant ima BTC kod sebe. Ali onda kreće problem, ta osoba koju si upravo onboardao nema šta napraviti s njime bez da izgubiš jako puno vremna na objašnjavanje. Dok sa običnim BTCom to odradiš uz bankomat i pustiš ga digne EUR par minuta kasnije i imaš puno bolji efekt kada skuže da je to prava lova. Ali ako Wallet of Satoshi funkcioniše onako kako je BitGoba objasnio, onda ta osoba koja na njega primi BTC na LN mreži može da ga koristi ili na Lightning mreži ili preko regularne layer 1 mreže. Osobno ne znam kako je to moguće ali tako BitGoba tvrdi. Ispada onda da ti coini idu u novčanike koje kontroliše Wallet of Satoshi, pa onda zavisno od tvoje želje, oni ti isplate ili na layer 1 ili na layer 2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casperBGD",
      "created_time": "June 14, 2023, 07:59:56 PM",
      "body": "Quote from: Pmalek on June 14, 2023, 03:56:53 PM~snipAli ako Wallet of Satoshi funkcioniše onako kako je BitGoba objasnio, onda ta osoba koja na njega primi BTC na LN mreži može da ga koristi ili na Lightning mreži ili preko regularne layer 1 mreže.koliko sam ja upoznat, to nije takoWoS je custodial novčanik, pre svegapostoji mogucnost da das adresu kao LN ili BTC da ti uplate sredstva (ili sam posaljes), ali ce ti balans svakako biti na LN, sta god da je poslato (BTC se automatski prebacuje na LN, i to radi servis koji stoji iza novcanika)ali kad saljes, mozes slati samo na LN adresu, ne na BTC adresu (tako da za off-ramp ka BTC trebas neki drugi novcanik), ili bar ja to ne znam da uradim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitGoba",
      "created_time": "June 14, 2023, 09:36:07 PM",
      "body": "Quote from: casperBGD on June 14, 2023, 07:59:56 PMQuote from: Pmalek on June 14, 2023, 03:56:53 PM~snipAli ako Wallet of Satoshi funkcioniše onako kako je BitGoba objasnio, onda ta osoba koja na njega primi BTC na LN mreži može da ga koristi ili na Lightning mreži ili preko regularne layer 1 mreže.koliko sam ja upoznat, to nije takoWoS je custodial novčanik, pre svegapostoji mogucnost da das adresu kao LN ili BTC da ti uplate sredstva (ili sam posaljes), ali ce ti balans svakako biti na LN, sta god da je poslato (BTC se automatski prebacuje na LN, i to radi servis koji stoji iza novcanika)ali kad saljes, mozes slati samo na LN adresu, ne na BTC adresu (tako da za off-ramp ka BTC trebas neki drugi novcanik), ili bar ja to ne znam da uradimWallet of Satoshi je kastodi novcnik i podrzava onchain i ln transakcije sve sa jednim racunomAko primis LN transakciju mozes taj BTC koji ti je na stanju  prosljediti kako  zelis on cain ili ln Muun radi na isti nacin podrzava  obe mreze ,imas isto stanje i za ln i onchain  ,kad kliknes send biras  kuda saljes  ln ili onchain Kazu da nije kastodi samo nije mi bas najajsnije kako to funkcionise ali LN je svakko za sitnije transakcije pa moze biti i kastodi ,necete  u njemu drzati puno BTC Ako bas hocete non kastodi za LN podignete svoj LN nod otvorite kanale povezete BlueWalletOd velikih mjenjacnica Kraken prihvata LN U SAD je dosta vise rasiren LN prihvataju ga Cash App i Strike kao i Robin Hood jedna od najvecih finansijskih app u SAD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trofo",
      "created_time": "June 15, 2023, 08:22:55 AM",
      "body": "Quote from: BitGoba on June 14, 2023, 09:36:07 PMWallet of Satoshi je kastodi novcnik i podrzava onchain i ln transakcije sve sa jednim racunomAko primis LN transakciju mozes taj BTC koji ti je na stanju  prosljediti kako  zelis on cain ili ln Prilično sam siguran da nije bio kada sam ga ja zadnji put koristio. Ali to je vjerojatno bilo za vrijeme prošlog bulla tako da lako moguće da se puno toga promijenilo Barem znam da me nije nikada pitao kako želim slati ali i to je opet moguće posljedica jer sam ga uvijek koristio preko QR koda. A onda po adresi zna kako želim slati.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "June 15, 2023, 05:56:48 PM",
      "body": "Quote from: BitGoba on June 14, 2023, 09:36:07 PMWallet of Satoshi je kastodi novcnik i podrzava onchain i ln transakcije sve sa jednim racunom. Pa da, to sam i mislio. Custodial servis kao i centralizovane mjenačnice i lako im je onda uzeti jedan coin a poslati drugi. Naplačuju li nekakvu naknadu za tu \"zamjenu\" iz layer 1 u layer 2 ili imaju naknada za povlačenje sredstava sa walleta?Quote from: Trofo on June 15, 2023, 08:22:55 AMPrilično sam siguran da nije bio kada sam ga ja zadnji put koristio. Ali to je vjerojatno bilo za vrijeme prošlog bulla tako da lako moguće da se puno toga promijenilo  Prošli veliki bull run je bio 2018. LN je predstavljen 2016 ako se ne varam. Još je vjerovatno bilo rano za neko ozbiljnije korištenje LN mreže.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}