{
  "id": "topic_5463360",
  "title": "mandown",
  "author": "mandown",
  "created_time": "August 15, 2023, 11:31:09 AM",
  "content": "Konusunu göremedim airdrop başlığı içerisinde birkaçtane test paylaşılmış daha önceden görevlerini yapan varsa airdrop'unu saat 15:00'da claim edebilecek Cexlerin tamamında listelenen bir proje sebepsiz bir hype var bakalım listelemede neler olacak ekosistem içerisine para girmediği taktirde fiyatı doğrusal düşüş gösterebilir.claim sayfası : https://app.sei.io/Claim için cüzdanda sei olmasına gerek yokKriterler",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463360",
  "comments": [
    {
      "author": "kriptobaron",
      "created_time": "August 15, 2023, 12:15:30 PM",
      "body": "Ayar oluyorum şu arz durumunu açık açık göstermeyen saklayan projelere bir türlü arz durumu hakkında bilgi bulamadım.Edit : Binance Şimdi göstermeye başladı 1.8 milyar dolaşımda Max arz 10 milyar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "torrentco",
      "created_time": "August 15, 2023, 01:20:20 PM",
      "body": "iki launchpad de sacmasapan ucuk fiyattan acıldı.agır cakılacak bence ikside.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 15, 2023, 03:26:49 PM",
      "body": "Adamlar güzel trolledi aylarca testnetlerini yapıp tek tek görev yap puan topla üzerine ok nft mintle airdrop yapıyoruz de saati gelsin  airdrop sayfası ortada yok  bunlardan bir cacık olmaz 3 kuruş airdrop atacaklardı ellerine yüzlerne bulaştırdılar topluluğa değer vermeyenlerin ne hale geldiğini daha önceden defalarca gördük.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "August 15, 2023, 04:14:37 PM",
      "body": "Quote from: mandown on August 15, 2023, 03:26:49 PMAdamlar güzel trolledi aylarca testnetlerini yapıp tek tek görev yap puan topla üzerine ok nft mintle airdrop yapıyoruz de saati gelsin  airdrop sayfası ortada yok  bunlardan bir cacık olmaz 3 kuruş airdrop atacaklardı ellerine yüzlerne bulaştırdılar topluluğa değer vermeyenlerin ne hale geldiğini daha önceden defalarca gördük.Hocam Twitter'da acayip airdrop kovalayanlar var ve ben iddia ediyorum u gibi projeler para vermez. Zaten milletten airdop gelecek diye epey para alıyorlar. Saçma sapan nft minti fee derken zaten epey para gidiyor. Hatta bazı kişiler bir sürü cüzdan ile Multi peşinde koşuyor. Sei de de sui de aynı durum oldu. Airdrop olayı sürpriz bence. İş yaptıran görev yaptıran fee kesen nft mintleten projeler iş yapmaz. Bu da çok yüksek açtı. Büyük ihtimalle çok geriye gelecektir",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "August 20, 2023, 03:50:02 PM",
      "body": "Sei böyle bir form açmış.İsteyen doldurabilirhttps://docs.google.com/forms/d/e/1FAIpQLSc2jYpvDslXMEklWJVdLeLHlx0ZawO8s1TiBaKpcH1gfb3j9w/viewformSei'nin twitter üzerinden paylaştığı projeleri kullanmaya çalışalım.Bir airdrop olması halinde fayda sağlayabilir mainnet üzerinde.https://twitter.com/Levana_protocolhttps://trade.levana.finance/https://twitter.com/astroport_fihttps://app.astroport.fi/swaphttps://twitter.com/FuzioNetworkhttps://app.fuzio.network/https://twitter.com/PulsarFinancehttps://app.pulsar.finance/portfoliohttps://twitter.com/flipsidecryptohttps://flipsidecrypto.xyz/https://twitter.com/Pallet_Exchangehttps://pallet.exchange/https://twitter.com/SeilorsNFThttps://seilors.io/https://twitter.com/DoubleJumpWTFhttps://www.doublejump.wtf/Ekosistem projelerini tanıttığı twitter flooduhttps://twitter.com/SeiNetwork/status/1692960258824531998",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "waybesuricata",
      "created_time": "August 20, 2023, 05:55:05 PM",
      "body": "SEI'de bir sürü şey yaptık doğru düzgün ödül vermediler. Node kurduğum cüzdana hele hiç bir şey vermediler tamamen 0. Bir çok işlem yapmıştım oysaki. İtiraz edebileceğimiz bir form var mı ki? Yukarıdaki form değil sanırım itiraz için.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "August 20, 2023, 06:25:52 PM",
      "body": "Sei proje ekibi ne yaptığını anlamadım baya testnet süreci geçirttiler insanlara. Listelenmeden önce onlarca görev yaptık sürekli yeni görev çıkarıyorlardı mintlemeler falan karşılığı ne oldu hiç bir şey topluluğu gram önem göstermediler o kadar fazla iş isterken topluluktan bu yüzden baştan kaybeden bir proje olarak görüyor çoğu kripto yatırımcısı ekosistem ne kadar geliştirebilirler gene de belli olmaz bu işler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "August 20, 2023, 11:32:38 PM",
      "body": "Quote from: SUPERSAIAN on August 20, 2023, 06:25:52 PMSei proje ekibi ne yaptığını anlamadım baya testnet süreci geçirttiler insanlara. Listelenmeden önce onlarca görev yaptık sürekli yeni görev çıkarıyorlardı mintlemeler falan karşılığı ne oldu hiç bir şey topluluğu gram önem göstermediler o kadar fazla iş isterken topluluktan bu yüzden baştan kaybeden bir proje olarak görüyor çoğu kripto yatırımcısı ekosistem ne kadar geliştirebilirler gene de belli olmaz bu işler.Projeler airdrop olayını artık kullanıcıları ırgat gibi çalıştırmak için kullanıyor. Muhtemelen bu tipte airdropların kazançlı olabileceği son dönemleri yaşıyoruz. İlk başta siteye gir direkt claim et şeklindeydi. Sonra bir form doldurma furyası geldi. Bitcointalk, face, twitter gibi yerlerde çeşitli görevleri yerine getirme geldi. En son şeklinde uniswap ile kullanıcıyı ödüllendirme mantığı ve sonrasında sybill önleme furyası. Sürekli olarak şekil değiştiriyor ama şu an olan en iğrenci. Airdrop lafını ağızlarından düşürmeden kullanıcıy şevke getirip bedava tanıtım yapıyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 21, 2023, 09:26:32 AM",
      "body": "Quote from: SUPERSAIAN on August 20, 2023, 06:25:52 PMSei proje ekibi ne yaptığını anlamadım baya testnet süreci geçirttiler insanlara. Listelenmeden önce onlarca görev yaptık sürekli yeni görev çıkarıyorlardı mintlemeler falan karşılığı ne oldu hiç bir şey topluluğu gram önem göstermediler o kadar fazla iş isterken topluluktan bu yüzden baştan kaybeden bir proje olarak görüyor çoğu kripto yatırımcısı ekosistem ne kadar geliştirebilirler gene de belli olmaz bu işler.Valla milleti eşek gibi airdrop atacağız ayağına test ettirdiler. Ağda ne var ne yok çıkmadan denenmiş oldu al sana 10-50 sei hadi eyvallah dediler ama kimse kusura bakmasın topluluk dediğin şey varsa ürün para ediyor yoksa yok. En ağır testler sei'deydi yok site çalışmaz çok bilmem ne yok discordda kimlik doğrula. Kardeşim discordda kimlik doğruladıkta ne oldu? Adamlar bedava veri toplamış oldu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "waybesuricata",
      "created_time": "August 21, 2023, 09:32:44 AM",
      "body": "Kesinlikle haklısınız hocalarım saçma sapan bir süreç yönetti sei, herkese bir sürü testnet yaptırdı, dediğiniz gibi kimlik doğrulama bile yaptırdı ama sonuç kocaman bir sıfır. Bu tarz projelere birlik olup sağlam tepki göstermek gerekiyor aslında.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "August 21, 2023, 08:04:10 PM",
      "body": "Quote from: Bthd on August 20, 2023, 11:32:38 PMQuote from: SUPERSAIAN on August 20, 2023, 06:25:52 PMSei proje ekibi ne yaptığını anlamadım baya testnet süreci geçirttiler insanlara. Listelenmeden önce onlarca görev yaptık sürekli yeni görev çıkarıyorlardı mintlemeler falan karşılığı ne oldu hiç bir şey topluluğu gram önem göstermediler o kadar fazla iş isterken topluluktan bu yüzden baştan kaybeden bir proje olarak görüyor çoğu kripto yatırımcısı ekosistem ne kadar geliştirebilirler gene de belli olmaz bu işler.Projeler airdrop olayını artık kullanıcıları ırgat gibi çalıştırmak için kullanıyor. Muhtemelen bu tipte airdropların kazançlı olabileceği son dönemleri yaşıyoruz. İlk başta siteye gir direkt claim et şeklindeydi. Sonra bir form doldurma furyası geldi. Bitcointalk, face, twitter gibi yerlerde çeşitli görevleri yerine getirme geldi. En son şeklinde uniswap ile kullanıcıyı ödüllendirme mantığı ve sonrasında sybill önleme furyası. Sürekli olarak şekil değiştiriyor ama şu an olan en iğrenci. Airdrop lafını ağızlarından düşürmeden kullanıcıy şevke getirip bedava tanıtım yapıyorlar.Aynen öyle hocam. Ben bazı fenomenler ile anlaşıp onların gazlaması ile 1-2 dolara mint, fee gibi ücretler alıp proje ayağına iyi para topladıklarını düşünüyorum. Sei airdrobu bile iş yapmamış iken hala başka airdroplar için şunu mint ettim buraya köprü kurdum vs diyip fee harcamaya sebep oluyor olabilir. Airdrop sürpriz olmalı ve bu kadar işlem vs yapılmamalı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "August 21, 2023, 09:47:39 PM",
      "body": "Son birkaç gün içerisinde adını sık sık duymuş olduğum fakat hiç ilgimi çekmemesi nedeni ile hakkında araştırma ve yatırım yapmadığım bir coin oldu SEI. Oldukça güzel bir hype olmasına rağmen maalesef pek ilgimi çekmedi ve sonrasında da nasıl bir performans sergilediğini pek fazla incelemedim açıkçası. Tek bildiğim, Twitter'dan gördüğüm kadarı ile yapılan airdrop o kadar bir düşük oldu ki maalesef hiç kimse bundan memnun kalmadı. Maalesef bu tarz durumlar yaşanabiliyor ve insanlarla dalga geçercesine airdroplar gerçekleşebiliyor. Potansiyeli olsa da her projeye güvenilmemesi gerektiğini ve her airdrop kampanaysından çok bir beklenti içerisinde olmamamız gerektiğini bu proje ile bir kere daha hatırlamış olduk. Fenomenler tarafından şişirilmiş bir proje olduğunu düşünüyorum.Ayrıca, NFT tarafında da bu ağı kullanacak bazı projelerde hype olduğunu görmüştüm fakat hem NFT piyasasında durgunluk olması hem de projenin dikkatimi çekmemiş olması sebebi ile bu projelere de ilgi göstermedim. Açıkçası bu durumdan pişman da değilim ve büyük bir fırsatı kaçırdığımı da düşünmüyorum. Umarım gerek airdrop gerekse NFT alanında aramızda bu projeye ilgi gösteren ve sonucunda hüsran ile karşılaşan birisi olmamıştır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cacabey_40",
      "created_time": "August 22, 2023, 08:41:14 AM",
      "body": "O kadar ilginç bir piyasadayız ki. Bir form doldurmakla, birkaç basit işlem yapmakla binlerce dolar para kazandığın da oluyor. Tam tersi günlerce, haftalarda ve bazen aylarca emek harcayıp da avucunu yaladığın da oluyor. Garip bir piyasa. Sei de bu sahte projeden biriydi. Çok can yakarlar boğada. #seiscam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 22, 2023, 06:58:56 PM",
      "body": "canto ilk çıktığında twitter'da basit bir twit ile binlerce dolarlık canto'yu bildiğin bedava verdi. o geceyi hiç unutamıyorum 0.03 lere kadar düşmüş köprüden birşeyler atsammı dedim vazgeçtim sabahına 0.3 oldu millet 0.1 altına düşünce çılgınlar gibi düşüyor diye elindeki malı satmaya koştu. sei resmen topluluğu ile dalga geçti tamam hiçbir proje airdrop yapmak zorunda değil ancak benim sei discord kanalındaki tag'larımı görseniz projenin ilk gününden beri neredeyse yanlarındaydım ama vermediler. İşin kötüsü uzun zamandır ilk defa hypelanıp güzelce özendiğim bir projeydi ne zaman bir projeye özeniyorum o sıçıyor anlamış değilim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 29, 2023, 06:45:42 AM",
      "body": "Sei için ortaya çıkan proje seilors wepad satmış ve ico fiyatının altında kalmıştı. Piyasa değeri olarak o kadar ucuz kaldı ki birkaç gündür yükseliş trendinde ancak ben bunun çok ucuz kaldigini düşünüyorum 3-5x yaparsa sasirmayacagim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinTurk",
      "created_time": "December 05, 2023, 10:35:23 AM",
      "body": "Quote from: Cacabey_40 on August 22, 2023, 08:41:14 AMO kadar ilginç bir piyasadayız ki. Bir form doldurmakla, birkaç basit işlem yapmakla binlerce dolar para kazandığın da oluyor. Tam tersi günlerce, haftalarda ve bazen aylarca emek harcayıp da avucunu yaladığın da oluyor. Garip bir piyasa. Sei de bu sahte projeden biriydi. Çok can yakarlar boğada. #seiscamKesinlikle katılıyorum, o kadar değişik bir piyasa yapısı oluştu ki çok basit form doldurma ve benzeri işlemler ile hatta bazen hiçbir şey yapmaksızın denk gelebileceğimiz airdroplar ile yüzlerce ve binlerce dolar kazanç elde etmek mümkün olabiliyor fakat çok ciddi emek harcanan bazı projeler tarafından yapılan airdroplar ise maalesef dalga geçiliyormuş gibi bir tutar ile gerçekleşebiliyor. Her ne kadar SEI projesini en başından beridir pek sevmediğim ve bu projeye ısınamadığım için pek takip etmemiş olsam da maalesef airdrop süreci içerisinde emek veren kimsenin mutlu olamadığını gördüm. Özellikle bu durumu da öğrenmem sonrasında çok mantıklı bir karar ile bu projenin airdropuna katılmadığımı ve ne kadar güven kırıcı bir proje olduğunu fark etmiş oldum. Boğa dönemi içerisinde olası fake hareketler ile çok can yakabileceğini düşünüyorum ve kesinlikle uzak durulması gerektiğini düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "demir77",
      "created_time": "December 05, 2023, 11:03:59 AM",
      "body": "You are not eligible.This address has not won any rewards from a giveaway. If you believe this is an error, please reach out to us on Discord.Çekilişe hak kazanamamışım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "December 05, 2023, 06:46:18 PM",
      "body": "Quote from: demir77 on December 05, 2023, 11:03:59 AMYou are not eligible.This address has not won any rewards from a giveaway. If you believe this is an error, please reach out to us on Discord.Çekilişe hak kazanamamışım.bırakın hocam şu sei çakallarını. üç kuruş para verecekler diye millete yaptırmadıkları iş kalmadı. şu piyasada en uyuz olduğu kripto nedir sorsanız birincisi aptos, ikincisini de bu hıyarları derim. mk sui'nin adını almış çakma çinliler gibi ortalıkta dolaşıyorlar valla.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "December 05, 2023, 06:49:18 PM",
      "body": "Quote from: gospodin on December 05, 2023, 06:46:18 PMQuote from: demir77 on December 05, 2023, 11:03:59 AMYou are not eligible.This address has not won any rewards from a giveaway. If you believe this is an error, please reach out to us on Discord.Çekilişe hak kazanamamışım.bırakın hocam şu sei çakallarını. üç kuruş para verecekler diye millete yaptırmadıkları iş kalmadı. şu piyasada en uyuz olduğu kripto nedir sorsanız birincisi aptos, ikincisini de bu hıyarları derim. mk sui'nin adını almış çakma çinliler gibi ortalıkta dolaşıyorlar valla.Bir kamyon görev yaptı millet vere vere çerez parası bile vermediler.Şimdi de geckoda bir şeyler verecekler ama değmez.Sei boş iş bence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}