{
  "id": "topic_5438330",
  "title": "kiddex",
  "author": "kiddex",
  "created_time": "February 06, 2023, 08:42:02 AM",
  "content": "Ok so i am always looking for ways to earn on my idle bitcoin, i was lucky enough to pull out of celsius a month before disaster and they closed up shop. I know that i will never trust a cefi platform again for earning on my bitcoin. I could go the the other route which is defi. But with defi i am not interested in converting my bitcoin into something like wrapped bitcoin. So if i am not interested in cefi or really much of the defi way what else is out there? I am not really an expert on crypto but i ve been around it since 2017 but like i said i am always looking for ways to earn with the bitcoin i have. If there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger. But if any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438330",
  "comments": [
    {
      "author": "Plaguedeath",
      "created_time": "February 06, 2023, 08:53:59 AM",
      "body": "Anything related about generate more Bitcoin by staking is a complete scam because Bitcoin isn't Proof of Stake, so you're just trusting your money with stranger that anytime can become a scammer or get hacked. Wrapped Bitcoin is a fake Bitcoin, any Bitcoin run in other network is also a fake Bitcoin.There are a lot sites offer Bitcoin staking, from small company to big company. In the end, these companies doesn't have any guarantee to protect or refund all of customers money, so the risk is same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "February 06, 2023, 09:36:27 AM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMIf there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger.This is the best option to profit from Bitcoin. Trying ways to make passive income from holding would invariably lead you to risk your funds with a third party, exposing you to the possibility of losses of funds as well as compromise of your personal data.Buy the dip and hodl.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "February 06, 2023, 09:57:28 AM",
      "body": "Bitcoins will only be safe in your noncustodial wallet. In the idle way of fiat, bitcoin will not proliferate there. If you want management that makes the numbers grow, then you have to trade your trust for lucrative schemes on services that requires you to give up your bitcoins. As much as they make offers, there is still no guarantee even close to 50% safe after the recent incidents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "February 06, 2023, 10:37:00 AM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMIf there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger. But if any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.If I dodged the bullet with Celsius like you did, I definitely wouldn't push my luck for the 2nd time.Another thing, even if there's something relatively safe (which I don't think that there is atm), APY will be so low Ilike maybe few %) that it won't even be worth the risk. By far the best thing that you can do is to keep your bitcoin in Ledger and let it to its thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GideonGono",
      "created_time": "February 06, 2023, 11:11:46 AM",
      "body": "Quote from: Plaguedeath on February 06, 2023, 08:53:59 AMAnything related about generate more Bitcoin by staking is a complete scam because Bitcoin isn't Proof of Stake, so you're just trusting your money with stranger that anytime can become a scammer or get hacked. Wrapped Bitcoin is a fake Bitcoin, any Bitcoin run in other network is also a fake Bitcoin.Exactly what I was thinking when I read the title,You could only earn while with your idle crypto if it is staking or POS.I tried POS tokens before but sad to say the POS token that I've invested are new projects at that time and they are just being hyped for a short period of time,So to cut the story short I've lost money from those investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "February 06, 2023, 11:25:51 AM",
      "body": "I believe lending is your only option to get profit out of your idle Bitcoin. This way you can choose who to lend and you can safely do this by allowing only high trust score borrower to borrow your money and charge interest for a certain period of time. Forum lending section and some DeFi offer this kind of service but I highly suggest the forum lending section since many reputable that regularly availing loan for a minimum of 10% interest rate per month. Just be vigilant on who you will lend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "February 06, 2023, 11:50:32 AM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AM~snip~If there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger. But if any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.If we know that the only correct way is for everyone to be their own bank, that is, to control their private keys - then all ideas of lending Bitcoin for the purpose of making money are completely wrong. If you just look at what happened in January this year, ask yourself the question - where else could you have profited as much as 40% in just 30 days and all that without risking and doing practically nothing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "February 06, 2023, 11:55:39 AM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMIf there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger. But if any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.The best option is to continue holding your Bitcoin and wait for the bull market. I am sure you might have a figure in your mind and if the next bull run gets you to that amount then go ahead and sell it and wait for the bear market to return to make another purchase. I would not recommend investing Bitcoin in any platform as none can guarantee its safety as you can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "February 06, 2023, 11:58:44 AM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMSo if i am not interested in cefi or really much of the defi way what else is out there?You can use your bitcoin and engage with trading in other to finds it not been idle as you've mentioned, trading will help you make some quick but little profits provided you know how to do so, it's not something too hard but you need to develop a strategy that could best suit your trading, which is something far better to engage your bitcoin on than looking around for defi project to invest with.Quote from: kiddex on February 06, 2023, 08:42:02 AMIf there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger.If you don't know about trading, you're not still going to be missing out and all that is needed is to hodl, holding as well is an investment on itself, because at the end of it all you will still make profits with time.Quote from: kiddex on February 06, 2023, 08:42:02 AMif any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.Nothing new to be taught than the ones already in place, you're the one who will find time to make good discovery of the aspect that can serves you the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "February 06, 2023, 12:02:55 PM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMSo if i am not interested in cefi or really much of the defi way what else is out there? I am not really an expert on crypto but i ve been around it since 2017 but like i said i am always looking for ways to earn with the bitcoin i have. You know that bitcoin is not using PoS, it uses PoW, which means you know already that those coins like wBTC are pegged with bitcoin, they are not bitcoin. But if you want to earn a passive income, you have to stake those pegged bitcoin and you know the risk of not holding the real bitcoin yourself. It is not a bad idea if you know the risk already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "February 06, 2023, 12:05:59 PM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMOk so i am always looking for ways to earn on my idle bitcoin, i was lucky enough to pull out of celsius a month before disaster and they closed up shop. I know that i will never trust a cefi platform again for earning on my bitcoin. I could go the the other route which is defi. But with defi i am not interested in converting my bitcoin into something like wrapped bitcoin. So if i am not interested in cefi or really much of the defi way what else is out there? I am not really an expert on crypto but i ve been around it since 2017 but like i said i am always looking for ways to earn with the bitcoin i have. If there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger. But if any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.There is no such option to earn from your idle bitcoin. At least nothing is risk-free. As long as you are not controlling your own bitcoin, you will not come across any opportunity that is risk-free. Even if you invest in the gambling business, that comes with a risk. Even if you trade in the market, that has a significant risk as well. I can think of only one option - Buy small amounts of bitcoin at every dip and HODL for a long time. That is the best thing you can do with your bitcoins. Sell off when the time is right. But never entrust another business with your bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kiddex",
      "created_time": "February 06, 2023, 12:20:19 PM",
      "body": "Quote from: Beparanf on February 06, 2023, 11:25:51 AMI believe lending is your only option to get profit out of your idle Bitcoin. This way you can choose who to lend and you can safely do this by allowing only high trust score borrower to borrow your money and charge interest for a certain period of time. Forum lending section and some DeFi offer this kind of service but I highly suggest the forum lending section since many reputable that regularly availing loan for a minimum of 10% interest rate per month. Just be vigilant on who you will lend.Yes this sounds interesting i would like to learn more. I guess i ll go over to the lending section to take a peak. You mentioned also some defi offer this kind of service, can you think of any off the top of you head? Iam not saying ill jump all in right away but i am curious about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "February 06, 2023, 12:56:15 PM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMOk so i am always looking for ways to earn on my idle bitcoin, i was lucky enough to pull out of celsius a month before disaster and they closed up shop. I know that i will never trust a cefi platform again for earning on my bitcoin. I could go the the other route which is defi. But with defi i am not interested in converting my bitcoin into something like wrapped bitcoin. So if i am not interested in cefi or really much of the defi way what else is out there? I am not really an expert on crypto but i ve been around it since 2017 but like i said i am always looking for ways to earn with the bitcoin i have. If there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger. But if any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.If you don't believe in CEX and don't want to use them, there will be no way for you to profit from your bitcoins, most forms of short term profit are provided by CEX. But you should also be careful with DEX as it is also not necessarily safer than CEX, everything is risky.You should continue to keep your bitcoins in a non-custodial wallet, it is the safest and also possibly the most profitable way. Don't try to look for short-term profit, and don't despise holding bitcoin, it can also bring you a huge profit in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "February 06, 2023, 01:19:21 PM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMIf there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger. But if any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.This is the best option right now. To just hold.I'm holding Bitcoin for 2 years already and until now, I didn't think of my Bitcoins being used to lend out to these platforms that offers lending where you can earn somewhere around 5% or more per year. Kind of attractive, but I won't risk it.You already said that you're lucky that you dodge the bullet against Celsius, and there are some who are lucky as well when Gemini ended their Earn feature. Sometimes, just idling your Bitcoin is a better and safer decision because I don't see any way either for my Bitcoins to earn more Bitcoins aside from it being lend to somebody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S A KHAIR",
      "created_time": "February 06, 2023, 01:55:08 PM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMOk so i am always looking for ways to earn on my idle bitcoin, i was lucky enough to pull out of celsius a month before disaster and they closed up shop. I know that i will never trust a cefi platform again for earning on my bitcoin. I could go the the other route which is defi. But with defi i am not interested in converting my bitcoin into something like wrapped bitcoin. So if i am not interested in cefi or really much of the defi way what else is out there? I am not really an expert on crypto but i ve been around it since 2017 but like i said i am always looking for ways to earn with the bitcoin i have. If there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger. But if any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.If you have been in this market since 2017, then you are a seasoned person then you should know that even defi is not much safer than cefi, it is an investment with risk. Even if you keep bitcoins in your wallet, there is no 100% guarantee that it will be absolutely safe. There is no safe way to profit from your idle bitcoins, it is best to continue to keep bitcoins in a non-custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "February 06, 2023, 02:14:35 PM",
      "body": "Instead of looking for those passive staking products, I suggest you either try to find another job that pays in Bitcoin or allocate some of your salaries to buy Bitcoin regularly. That is arguably more secure than any centralized product right now and you have control over how much you spend. Obviously don't overspend on your investment, even $10 a month is fine as long as you can take the risk if anything went wrong. Some people also suggest value cost averaging instead of doing DCA, you can check them out if you're interested in more investment alternatives.Quote from: S A KHAIR on February 06, 2023, 01:55:08 PMEven if you keep bitcoins in your wallet, there is no 100% guarantee that it will be absolutely safe. There is no safe way to profit from your idle bitcoins, it is best to continue to keep bitcoins in a non-custodial wallet.I think you're referring to protecting the seed itself, which might be different from the risk most people are talking about here. Using a cold wallet (not necessarily a hardware one) and good security practice to protect your seed/private key is probably one of the safest methods to guarantee that you don't lose your coins. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "February 06, 2023, 04:46:00 PM",
      "body": "You really shouldn't be trying to earn with your bitcoin.I earned a little bit on BlockFi in 2021 for about 6 months with only a little bit of my bitcoin. But it just wasn't worth the risk. Plus right after I started using it they started dropping the earning rate just about every single month until the rate was only a fraction of what it was when I started. At that point what I was earning was a joke and so I got out, then a year later they went bankrupt lol.Just in general it is not worth the risk to give someone else control of your bitcoin just to earn a few percent on it. Bitcoin goes up by hundreds of percent every four years - that should be enough for anyone!Bitcoin is the ultimate safe haven asset, the ultimate long term store of value, arguably the best wealth creation tool in the world (the only things that compete I guess would be Ethereum or starting a very successful business). Given these three things, putting your Bitcoin at risk by giving it to a third party just to earn a little bit extra just does not make sense. Bitcoin is what you want to accumulate as much as you can, and then you can start gradually spending it later when you feel happy about how much it has appreciated. There are other things to put your money in if you want income: Ethereum, real estate rental property, stocks (dividends), etc. Bitcoin is not one of those things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RealMalatesta",
      "created_time": "February 06, 2023, 09:24:34 PM",
      "body": "Quote from: LogitechMouse on February 06, 2023, 01:19:21 PMQuote from: kiddex on February 06, 2023, 08:42:02 AMIf there isnt really anything out that is relatively safe i am happy to continue hodling it on my ledger. But if any of you guys are aware of something new that i havnt heard of please feel free to let me know thanks.This is the best option right now. To just hold.I'm holding Bitcoin for 2 years already and until now, I didn't think of my Bitcoins being used to lend out to these platforms that offers lending where you can earn somewhere around 5% or more per year. Kind of attractive, but I won't risk it.You already said that you're lucky that you dodge the bullet against Celsius, and there are some who are lucky as well when Gemini ended their Earn feature. Sometimes, just idling your Bitcoin is a better and safer decision because I don't see any way either for my Bitcoins to earn more Bitcoins aside from it being lend to somebody.5% looks small but if more than that (above 10 or 20%) then that might be tempting already, yet I will think really hard if I will do it or not because I already heard horrible stories about how lending platforms can collapse. It will be hard to sleep at night thinking that your Bitcoins are not in our control anymore and at any moment you can potentially lose it. If we want to earn more then the key is to buy more Bitcoins.The most effective way of doing it is when the market is crashing really hard. Investing in our own using a trusted wallet brand (preferably offline) can be the best way to earn because the risk of doing it is only small but the return is high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "February 06, 2023, 11:59:43 PM",
      "body": "Quote from: kiddex on February 06, 2023, 08:42:02 AMSo if i am not interested in cefi or really much of the defi way what else is out there? I am not really an expert on crypto but i ve been around it since 2017 but like i said i am always looking for ways to earn with the bitcoin i have. We're the same, I've been here around since 2017 but until now, I'm still in a learning process towards Bitcoin.The best thing that you can do is to accumulate Bitcoin as much as you can so that you'll gain profit from it.  It might good also if you'll try to purchase Bitcoin in a DCA way, buying in a low position. Defi and Cefi are different things if you want to hold your coins without an intermediary go Defi.I never used any Cefi platform because I hate using a centralized platform due to KYC, the thing that you must always remember if you have a coin/asset, you must store it under your control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}