{
  "id": "topic_5462644",
  "title": "D1PL0M4T",
  "author": "D1PL0M4T",
  "created_time": "August 09, 2023, 12:14:17 PM",
  "content": "Greetings!My client ready to buy Bitcoin in large quantities at a discount. Payment is made under contract by bank transfer in advance.Ready to discuss issues with intermediaries!Contact Telegram: @D1PL0M4T",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462644",
  "comments": [
    {
      "author": "rat03gopoh",
      "created_time": "August 09, 2023, 01:47:29 PM",
      "body": "You mean face to face? I think you need to mention your base which hopefully you'll get some OTC services around your city.Or if your clients are also fine with P2P exchanges, check out some of the services here https://kycnot.me. I rather suggest you go with Bisq.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "August 09, 2023, 11:11:48 PM",
      "body": "You must be kiddingWho is going to sell you large quantities of their Bitcoins at a discount?  The only person who will probably do that is one who has obtained the Bitcoins illegally such as hacking and wants to get rid of them as quickly as possible. If you want large quantities of Bitcoins, use an exchange. There are so many.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RewFrew",
      "created_time": "August 13, 2023, 01:59:56 PM",
      "body": "Actually i am confused, i think no one can sell large amount of Bitcoin at discount. Why he will losser. He can sell his Bitcoin on exchanger easily. He can also sell on Binance by using p2p. I think this information has some mistake. Because there are huge Exchanger available and there he can easily sell bitcoin there without any hassle. I am thinking about another risk, like scam risk. Please be more careful about this kinds of transaction. And my strong advice please use exchanger which will more secure to buy and sell this kinds of big transaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "August 13, 2023, 02:06:12 PM",
      "body": "Quote from: RewFrew on August 13, 2023, 01:59:56 PMActually i am confused, i think no one can sell large amount of Bitcoin at discount. Why he will losser. He can sell his Bitcoin on exchanger easily. He can also sell on Binance by using p2p. I think this information has some mistake. Because there are huge Exchanger available and there he can easily sell bitcoin there without any hassle. I am thinking about another risk, like scam risk. Please be more careful about this kinds of transaction. And my strong advice please use exchanger which will more secure to buy and sell this kinds of big transaction. I think he is pertaining to an OTC transaction which typically the buyer offers a bulk purchase on a slightly discounted price. I believe Binance has this kind of feature for institutional investors that wants to enter the crypto market without pumping the market price. This kind of transaction are for institutional and not for the normal whales. We are talking about multi million to billion investment here. But I doubt that the OP client is one of them since institutional investors will surely purchased on exchange OTC to make ti legal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}