{
  "id": "topic_5461394",
  "title": "cryptogeniusdice",
  "author": "cryptogeniusdice",
  "created_time": "July 29, 2023, 11:35:36 AM",
  "content": "so after doubting the genuinity of stake.com , i started keeping track of the bets which i placed. I started recording my gameplay session also keeping note of the bet on a spreadsheet for mines. in that i came to know few if the bet where i got losses were missing . so inquired to support team , they stated that missing bets were archived as stake.com cannot store data of so many billion bets. i questioned them , ok but how come previous bets than archived are not archived nor the bets after. why only specific bets are archived .they provided me the details with back end , with wrong entry , while i had the recorded bet with me. Full Details on the Video Video 1 :https://youtu.be/mBF4aWTmi4kand after that i met the dumbest engineer for stake.com alias meebitVideo 2 : https://youtu.be/I2CRY7MwlwUI asked them to compensate for the scam they are running as their exposed in reality. Any questions you would like, i would happy to answer stake.com asslickers.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461394",
  "comments": [
    {
      "author": "AHOYBRAUSE",
      "created_time": "July 29, 2023, 02:41:36 PM",
      "body": "Quote from: cryptogeniusdice on July 29, 2023, 11:35:36 AMso after doubting the genuinity of stake.com , i started keeping track of the bets which i placed. I started recording my gameplay session also keeping note of the bet on a spreadsheet for mines. in that i came to know few if the bet where i got losses were missing . so inquired to support team , they stated that missing bets were archived as stake.com cannot store data of so many billion bets. i questioned them , ok but how come previous bets than archived are not archived nor the bets after. why only specific bets are archived .they provided me the details with back end , with wrong entry , while i had the recorded bet with me. Full Details on the Video Video 1 :https://youtu.be/mBF4aWTmi4kand after that i met the dumbest engineer for stake.com alias meebitVideo 2 : https://youtu.be/I2CRY7MwlwUI asked them to compensate for the scam they are running as their exposed in reality. Any questions you would like, i would happy to answer stake.com asslickers.You asked them to compensate for the scam, aha. And you think 1 million $ is the right amount for that?  Come on man, you call yourself genius, at least make a video where people can understand what you are talking. This is so random and fast paced, just scrolling up and down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptogeniusdice",
      "created_time": "July 29, 2023, 04:21:26 PM",
      "body": "download it make it slow and watch. the topic gives clarity how stake cheats on mines.you can take a screenshot , but you cant find the bet that i am talking about it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "July 29, 2023, 04:59:44 PM",
      "body": "I’m not Stake player nor asslicker   but it’s very hard to get your point here since you are claiming that result varies on the bets that you recorded and their backup while there’s no way for us to verify easily the difference. Also please lock your first thread https://bitcointalk.org/index.php?topic=5459921.msg62554169#msg62554169 before starting new one because you are already spamming the forum if you open multiple thread with same content. You are using the forum to pressure Stake to pay you for your discovery while they can easily admit that its just a bug a kick you out of the system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "July 29, 2023, 08:20:47 PM",
      "body": "I also watched the video, it was very fast and does not clearly state the ground where the stake cheated on the mine session he is talking about, he shows some codes and bet numbers then some images of mine game but I still can't figure out the cheat in there.  @OP could have highlighted the most important details and put more time on emphasizing it making the viewer understand where stake.com cheat in one view.No one will dissect the video to dig deeper into the information since there are no links whatsoever to the data shown on the video.  Other streamers give a link to screenshots or record of the important data but @OP just don't have anything on the description of the video.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 29, 2023, 09:26:04 PMLast edit: July 29, 2023, 09:53:31 PM by ryzaadit",
      "body": "First: You are retarted.Second: You have a gambling problem.Third: You want to blackmail.Four: You don't know anything.Five: Get a real job!Stake archive all the data for not storing really heavy, you got by notepad. You don't even know and understand about the data, in the video you are tell why cannot view the bet history. Because you are stupid, don't know anything. To get a better data view, upload the archive (JSON/Notepad) data) to Excel: https://stakecommunity.com/topic/43259-how-to-readfind-your-old-bets-in-a-easy-way/ so you understand more easy view for data like (Bet ID, Client Seed, and other)In the video, you cant see the view old bet by-archive: because you don't know!- You should go to chat- Type: /bet casino or sport bet-id- Example: /bet casino 170353608351- Then, will show you: https://stake.ac/?iid=casino%2C170353608351&modal=betAll bet can be view, all you need to just do to the things I explained in the top. Even my self can see my old bet over 2 old month: https://stake.ac/transactions/archive?page=5&iid=casino%2C153776159606&modal=betYou keep asking these bet fucking numbers: 166479682096 Here the link: https://stake.ac/?iid=casino%2C166479682096&modal=betHere the result on provably fairThe result are some, mine on box (9, 12). GET THE FUCKING JOBS ! You want 1,000,000$ ? GET THE JOBS. Stop spamming for blaickmailed all the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}