{
  "id": "topic_5476417",
  "title": "Rruchi man",
  "author": "Rruchi man",
  "created_time": "December 03, 2023, 10:26:10 PM",
  "content": "Since mixers will be soon be rejected on the forum due to the heat they are bringing from the government, do you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476417",
  "comments": [
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "December 03, 2023, 10:31:18 PM",
      "body": "Quote from: Rruchi man on December 03, 2023, 10:26:10 PMSince mixers will be soon be rejected on the forum due to the heat they are bringing from the government, do you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?It will not. If this forum is the only place that those mixers get more exposure and attract more traffic, then it's going to be a little challenge for them since they will be ban from the forum but will not make them to stop. There's a saying that when one door closes, another will open. So, definitely they will find another way to advertise their service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "December 03, 2023, 10:31:46 PM",
      "body": "Mixers are just going to get a little more innovative and find different ways to advertise. There's a ton of dirty money out there that apparently is worth risking prison over. The forum isn't the only place to advertise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "December 03, 2023, 10:36:34 PM",
      "body": "Quote from: Rruchi man on December 03, 2023, 10:26:10 PMSince mixers will be soon be rejected on the forum due to the heat they are bringing from the government, do you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?How do you think they can change the way they mix the coins? They dont have much of an option.  Mixing coins is their core business, and that part will never be able to comply with government requirements. Unless you think they should do some sort of KYC verification of their users or something?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "December 03, 2023, 10:38:42 PM",
      "body": "By changing the way of mixing, what do you mean? Isn't it still mixing, which the Government will continue to hate and ban?The Bitcointalk forum is not the only place they can advertise from. Not a very similar topic, but you can read through the replies (Where the mixers will promote their projects?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "December 03, 2023, 10:42:57 PM",
      "body": "Quote from: Rruchi man on December 03, 2023, 10:26:10 PMSince mixers will be soon be rejected on the forum due to the heat they are bringing from the government, do you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?The forum is an advertising platform and just one of the advertising platforms, it's very rare for a platform to change its model so it can be accommodated by an advertising platform, in the first place they are not created for any platform but for the market they serve, they are a mixer so they are created for people who use a mixer, it's the advertising platform that should change their stance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "December 03, 2023, 10:44:25 PM",
      "body": "Quote from: Rruchi man on December 03, 2023, 10:26:10 PMdo you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?How can they change the way they mix their coins, their \"job\" is to obfuscate the source of your coins and they are definitely not going to request for KYC before mixing, because that defeats the purpose of a mixer and thus nobody is going to use that service. Mind you that mixers aren't doing anything inherently wrong, i am surprised that majority of users here aren't seeing the crackdown on mixers as an attack on Bitcoin, but instead that mixers are the problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "December 04, 2023, 04:19:23 AM",
      "body": "Quote from: yahoo62278 on December 03, 2023, 10:31:46 PMMixers are just going to get a little more innovative and find different ways to advertise. There's a ton of dirty money out there that apparently is worth risking prison over. The forum isn't the only place to advertise.Quote from: robelneo on December 03, 2023, 10:42:57 PMThe forum is an advertising platform and just one of the advertising platforms...They will find other places to advertise for sure. They would prefer to continue on this one because it is the largest Bitcoin forum and the one founded by Satoshi but at the end of the day there is a lot of money at stake and they will move their advertising elsewhere. Quote from: Coyster on December 03, 2023, 10:44:25 PMHow can they change the way they mix their coins, their \"job\" is to obfuscate the source of your coins and they are definitely not going to request for KYC before mixing, because that defeats the purpose of a mixer and thus nobody is going to use that service. Mind you that mixers aren't doing anything inherently wrong, i am surprised that majority of users here aren't seeing the crackdown on mixers as an attack on Bitcoin, but instead that mixers are the problem. Right. Mixers will continue to work as they do now until there is legislation that prohibits them, which between the slowness of the administration and the steps that the laws have to follow to be approved can take years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BabyBandit",
      "created_time": "December 04, 2023, 04:43:33 AM",
      "body": "Quote from: Rruchi man on December 03, 2023, 10:26:10 PMSince mixers will be soon be rejected on the forum due to the heat they are bringing from the government, do you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?I can assure you that users on this forum have zero power to affect anything outside this forums door. Absolutely nothing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 04, 2023, 04:54:39 AM",
      "body": "If the mixer not earn as much as before when they were still in this forum: they might change their project or rebrand to new one into Coinjoin or P2P/Swap exchange.If the mixer earn as much as before: nothing will affect them, they might promote using other ways.So the question is, does the mixer make a lot money by promoting their project in this forum? we will see it later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "December 04, 2023, 08:56:24 AM",
      "body": "Quote from: Rruchi man on December 03, 2023, 10:26:10 PMSince mixers will be soon be rejected on the forum due to the heat they are bringing from the government, do you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?there is no way to change the way the mixer works to be more government friendly.what happens is that mixers won't advertise on forums, but there are still other places for them to continue to innovate in offering their services. of course, this is for mixers that have not been phased out by the government.even for those that have been discontinued, they can simply start with a new business name and other means of advertising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "December 04, 2023, 09:06:19 AM",
      "body": "BitcoinTalk is not the only market from where they get visitors. Indeed, this is one of the places where many Bitcoiners belong. Some mixers won't change their brand and will continue advertising outside Bitcointalk. Some of them may rebrand and come back to the forum. We never know what is going to happen. But mixers will be banned, and we are sure about it. However, I cannot convince myself that they will rebrand or change how they use their service because BitcoinTalk censors them. If they change the system, they won't remain as mixers anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 04, 2023, 09:26:30 AM",
      "body": "There are various options, and even Google will advertise these services without problems, but the problem, in my opinion, lies in the payments method. They will need a bank account to make payments, and it is easy to track them down or move to dark web forums, and then hackers may find it difficult to use a central service that can sell their data in exchange for More decentralized solutions.The forum is the most appropriate place to announce but it will not be the only one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "December 04, 2023, 10:43:31 AM",
      "body": "Quote from: Rruchi man on December 03, 2023, 10:26:10 PMSince mixers will be soon be rejected on the forum due to the heat they are bringing from the government, do you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?The answer is yes, they can redress with some certain transactions, some of the mixing companies do some certain things knowingly and also some transact unknowingly too, but when government pressure come in they don't have a cogent reason to defend themselves, so this pressure of law enforcement agencies can make some of the mixing companies to be extremely careful if their intension is to participate in money laundering.What a forum is avoiding is the reputation of bitcointalk not a reputation of any mixer, mixers is someone business or a joint business anybody can use mixer if you want really make use of mixers, the instructions is nobody to promote mixers in this platform, if you want promote you can look for elsewhere to promote them, and secondly not all the mixing companies that government is after, they are after the ones they detected that they are into money laundering, look at mixin, they are also a branch of mixers but government is not after them because they have no find any faults of money laundering with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "December 04, 2023, 10:52:50 AM",
      "body": "Quote from: GeorgeJohn on December 04, 2023, 10:43:31 AMThe answer is yes, they can redress with some certain transactions, some of the mixing companies do some certain knowingly and some transact unknowingly too, but when government pressure come in they don't have a cogent reason to defend themselves.What do you mean by \"redress with some certain transactions\", are you insinuating that mixers, which by the way are privacy tools should scrutinize addresses and transactions before deciding who they are going to allow to mix their coins in their platform, how are they then a privacy tool if they do that, that defeats the purpose of a mixer.Quote from: GeorgeJohn on December 04, 2023, 10:43:31 AMand secondly not all the mixing companies that government is after, they are after the ones they detected that they are into money launderingThe government is indirectly after the Bitcoin, they do not want anybody to be able to use Bitcoin privately. Very soon their agenda of \"clean\" and \"dirty\" Bitcoins would be so strong that Bitcoins fungibility would take a huge hit.Quote from: GeorgeJohn on December 04, 2023, 10:43:31 AMlook at mixin, they are also a branch of mixers but government is not after them because they have no find any faults of money laundering with them.Are you talking about \"mixin network\"? They are not a mixer if you do not know, but what they managed to do was lose over $200m of people's money because they kept the keys in the cloud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 04, 2023, 10:53:52 AM",
      "body": "Quote from: Rruchi man on December 03, 2023, 10:26:10 PMSince mixers will be soon be rejected on the forum due to the heat they are bringing from the government, do you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?If I understand correctly what you mean, then my question would be, is there any other way a mixer can mix coins that it won't involve hiding the traces of where the coins came from and where it is going?If anything will utter this, then it's no longer a mixer, and I guess people will not want to pay for a service that a normal crypto wallet does for absolutely free of charge.And to directly answer your question now, the reputation of this forum is definitely a good influence on mixers, that is possibly why we see alot of them promoting their services here. But then, I don't think there is any other way to mix coins they can switch or change to for them to be given the green light from the government, as well as this forum, anything they do now that utters how they mix coins maybe likely destroy their real purpose, which is to make coins untraceable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "December 04, 2023, 11:23:44 AM",
      "body": "I don't think the mixers will change much just to adapt to the nonsensical conditions on this forum. A service that has been working for years, and in the name of which there is a word that indicates mixing, will certainly not ignore the previous efforts and move from the beginning as a new brand.In addition, they have enough money to advertise on other channels, they will certainly find other ways to reach clients.I'm more concerned about Bitcointalk and where decisions like this will take us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "December 04, 2023, 11:34:49 AM",
      "body": "Quote from: Coyster on December 04, 2023, 10:52:50 AMQuote from: GeorgeJohn on December 04, 2023, 10:43:31 AMThe answer is yes, they can redress with some certain transactions, some of the mixing companies do some certain knowingly and some transact unknowingly too, but when government pressure come in they don't have a cogent reason to defend themselves.What do you mean by \"redress with some certain transactions\", are you insinuating that mixers, which by the way are privacy tools should scrutinize addresses and transactions before deciding who they are going to allow to mix their coins in their platform, how are they then a privacy tool if they do that, that defeats the purpose of a mixer.Only that everyone consider a mixer a privacy, I know that if KYC should done in mixer they will no be any problem of seizing their website always, the privacy we are talking about, as cryptocurrency chief, from your understanding do you think everything about cryptocurrency transactions and about mixers we claim that they are into privacy transactions is real..if whatever we do with all this mixers is private so while is that FBI still track and also know any transactions of this large amount been done in this particular mixing platform. So noting is secret with mixer since is a technology..if they want to function and last, let them involve for KYC verification, many coins we mix that worth million dollars all are stealing funds and that's while they only look for privacy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "December 04, 2023, 12:35:25 PM",
      "body": "Quote from: Rruchi man on December 03, 2023, 10:26:10 PMSince mixers will be soon be rejected on the forum due to the heat they are bringing from the government, do you think that the reputation of the forum and the rejection of these mixers from the forum will be enough to force them to change the way they mix their coins?Yes. They are not stupid. There are a thousand and more ways for mixers to go about with their adverts some in very subtle ways and others in newer and less suspicious ways. My stance is that mixers are not bad in itself but the bad elements using them gives them the bad reputation.They'll change the way they mix their coins and how they tell people about what they do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BABY SHOES",
      "created_time": "December 04, 2023, 12:59:01 PM",
      "body": "Quote from: Solosanz on December 04, 2023, 04:54:39 AMIf the mixer not earn as much as before when they were still in this forum: they might change their project or rebrand to new one into Coinjoin or P2P/Swap exchange.I see from the mixer representative's statement that they will not change their vision from the beginning, so they say they will not change the beginning of the mixer to P2P / SWAP or similar, of course this is only one that I see while the others have not given any response. - https://bitcointalk.org/index.php?topic=5448710.msg63266936#msg63266936Quote from: Solosanz on December 04, 2023, 04:54:39 AMIf the mixer earn as much as before: nothing will affect them, they might promote using other ways.So the question is, does the mixer make a lot money by promoting their project in this forum? we will see it later.Yes as it is, with the Sin***d case the funds coming into their service are increasing which means this indicates that the forum is important for them to keep advertising on their own project.Quote from: PureMixerio on December 04, 2023, 10:56:25 AMSince after this incident, the amount of funds coming into our service has increased.But I'm sure there are other ways not necessarily on forums to advertise their mixer services, maybe they haven't found the right platform like bitcointalk, that's all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}