{
  "id": "topic_5472905",
  "title": "Z390",
  "author": "Z390",
  "created_time": "November 05, 2023, 08:41:58 AM",
  "content": "I can't say much about the past Bitcoin bear market but I was present and aware of the 2018 bear market and also it's bull market, the black swan event that happened in 2020 was because of CoVID, and no one was expecting this to happen, Bitcoin was slowly on it's way to recovery in 2019 November and December until 2020 hits hard.Fast forward to this bear market, many people really believe that we haven't seen the bottom yet, and some believe that the next black swan event will bring the last bottom for Bitcoin, I do have some questions about all this. 1. In the past Bitcoin bear market, how many black swan event happened at the time? 2. I did my own research and black swan event started in 2020 and it's also in the chart history, I could be wrong but correct me if I am, but the black swan event happens cos of COVID in 2020, what makes you believe that another will happen? 3. What if the Black Swan event of this present bear market was the FTX Collapse? What if the first one ( 2020 crash ) was an unexpected crash to manipulate the masses and the Second one is to make people keep waiting and waiting for something that's not coming until it's too late?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472905",
  "comments": [
    {
      "author": "Cryptmuster",
      "created_time": "November 05, 2023, 08:50:32 AM",
      "body": "The Covid dump had a much greater impact on the market than the FTX collapse, so it seems to me that comparing these events in terms of significance is not very correct. Frankly, I expect that we have yet to encounter a black swan in this cycle and this will be the last major dump before the bull market begins. It’s difficult for me to say what this could be, perhaps some kind of new pandemic, or a significant escalation of the military conflict, but so far Bitcoin is not very responsive to any negative news, which means it’s not time yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "November 05, 2023, 08:54:21 AM",
      "body": "The market is very unpredictable, black swan or no black swan, but traces in the past have proved many times that the market always follows the same pattern as prior years and events of the halvings and bull run. This is why many people are still waiting for it to drop to its lowest price. Nobody knows what will happen tomorrow; history may or may not repeat itself. others who are still waiting for the black swan believe it will occur based on their personal experience or future projections, while others who feel it may have occurred after the FTX collapse are fine. It is everyone's predicted choice, and you can't change it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "November 05, 2023, 09:01:35 AM",
      "body": "History repeating itself is common scenario in crypto market in both bullrun and bearish market since there’s always a correction after a pump and a recovery after dump. There’s nothing wrong to think about that. It’s only wrong if you just keep thinking on it that result you to unable to purchase crypto just because you wait for that bottom.I believe people that think like this are those who will purchase at the top when they are already FOM O when Bitcoin pump hard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "November 05, 2023, 09:09:43 AM",
      "body": "Quote from: Cryptmuster on November 05, 2023, 08:50:32 AMThe Covid dump had a much greater impact on the market than the FTX collapse, so it seems to me that comparing these events in terms of significance is not very correct. Frankly, I expect that we have yet to encounter a black swan in this cycle and this will be the last major dump before the bull market begins. It’s difficult for me to say what this could be, perhaps some kind of new pandemic, or a significant escalation of the military conflict, but so far Bitcoin is not very responsive to any negative news, which means it’s not time yet.The peculiarities of next year's events are undeniable. Those still expecting another dump before the anticipated bull market might be left behind.  As we approach next year, it is becoming increasingly clear that we will see many positive news that will make next year's halving the greatest we have seen so far. Just imagine Bitcoin ETF approval by Jabuaty 2024 following Bitcoin halving by April, we don't need to think deep to realise that this will be exceptionally explosive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "November 05, 2023, 09:11:23 AM",
      "body": "When analyzing the market and history one should look at the reasons for every event.That's because history doesn't repeat itself, instead the same events have the same results. For example in the first 10 years of bitcoin, the global economy was not the same as in the second decade (ie. today). So something like halving, some positive adoption news, etc. had a similar and positive effect.Now the same thing happens again meaning something like halving, some positive adoption news, etc. will have a similar and positive effect.However, that is not the only thing affecting the market. As I said the global economy is different and it significantly affects bitcoin market.Now you have to also consider the recession accompanied by inflation and the effects all that is going to have on bitcoin.That is why in 2020 with the Pandemic and the recession we saw the strong bull run that were supposed to get bitcoin into 6 digits realm stopped abruptly and gave its place to a bear market.BTW I don't put too much thought into something like FTX collapse. These things never have any long term effects on the overall trends. They only create chaos in short term.The upcoming halving is going to be the same as before. However we should now consider the effects of the ongoing recession. Without interest rates coming down we can only see a small bull run. With lower interest rates on the other hand, we can see a massive rise unlike any previous rallies because of the accumulated potential.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Texac",
      "created_time": "November 05, 2023, 09:26:45 AM",
      "body": "Quote from: Cryptmuster on November 05, 2023, 08:50:32 AMThe Covid dump had a much greater impact on the market than the FTX collapse, so it seems to me that comparing these events in terms of significance is not very correct. Frankly, I expect that we have yet to encounter a black swan in this cycle and this will be the last major dump before the bull market begins. It’s difficult for me to say what this could be, perhaps some kind of new pandemic, or a significant escalation of the military conflict, but so far Bitcoin is not very responsive to any negative news, which means it’s not time yet.Do you mean we haven't hit the bottom of this bear season yet?  if you don't consider FTX, the war between Russia and Ukraine, peak inflation as black swans, then what do you think black swans are?  I think in contrast to you, the lowest bottom was $15k and it was done in 2021, we won't have any more strong dumping in the market.  of course, the market will not easily enter the bull season from now on, there will be a lot of adjustments until the bull season really comes.  but if there is a strong dump, I don't think it will happen, those who missed the opportunity to buy at 15k USD, they missed the bottom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "November 05, 2023, 10:07:33 AM",
      "body": "Bitcoin's Bottom has nothing to do with the Black Swan events, such events happen while moving in free space, I'm sure more are on the way, they just push or pull the market temporarily, As a fundamental analyst (Hehe not praising myself at least able to read something based on my little journey), What I've experienced in the market, and what I understood about the physiology of the Bitcoins cycle, I can say that Black swap events really don't impact that much if you increase your view from short term to long term. The market (Bitcoin) recovers keeping the narrative, and potential in consideration.So OP, the Bottom is confirmed at least in my view and I'm sure most Onchain analysts & market experts will agree with me, we are on the ending edge of the Accumulation zone of this cycle and the way ahead is highly Bullish. Those who are waiting for black swan events to accumulate on the bottom are in a big mess, becasue there can be a black swan event, and may not be there gambling at the rare opportunity because we cant be even sure about the next cycle's bottom will it be that lower on which point we are standing right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 05, 2023, 11:18:34 AM",
      "body": "The black swan event in 2020 was one of the events that caused the price to make a rapid correction, but the price was able to rise again due to subsequent economic policies that approved stimulus packages and it was easy to obtain loans with an interest rate close to zero, and this matter may happen again if the Federal Reserve begins to reduce interest rates initially. From the second quarter of next year.Therefore, during the period of 2020, I think that the price dealt poorly with one event, which was the collapse of Luna more than FTX.if things go well, history will repeat itself, but it will be closer to what happened in 2016/2017.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "November 05, 2023, 11:30:54 AM",
      "body": "Huh? People are expecting a black swan event to repeat itself??Would be very weird is people are actually thinking that. Since, ya know, black swan events like the Covid crash are literally the opposite of things that repeat themselves.Anyone who still thinks bitcoin is heading back into the bear market just doesn't understand the basics of Bitcoin's four year market cycle. Jan/Feb/Mar very clearly broke out of the FTX super bottom of the bear market, and March broke out of the whole bottom range. Bear market ended in March. Outside of a black swan event, which of course not repeatable and not something expected, by that point there was little to no chance of revisiting lows. Anyone still talking about Bitcoin going back into a bear market is just a beginner who doesn't understand the market cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "November 05, 2023, 11:56:46 AM",
      "body": "The next black swan event, more bitcoin will re-enter market circulation. Do you still remember that the bitcoin in the MtGox hack was in the stage of being repaid to creditors? While I doubt it will ever come, I just think it could potentially factor into the next price crash as will the impact of the covid19 pandemic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kentrolla",
      "created_time": "November 05, 2023, 11:59:41 AM",
      "body": "There will always be fuds who would not even mind to say there will be a Black swan event every year because they don't have basic understanding and Black swan events are not something which every year or in every few years. It's a common thing people should buckle up and ready for upcoming bull run rather than fearing for one more bear market. Already there has been too much of negativity in the market and thanks to recent Bitcoin pump they are silenced and I am afraid even if Bitcoin drops to $30k they will come back with they fuds",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 05, 2023, 12:09:16 PM",
      "body": "You are speaking as if 2020 was a bad year for Bitcoin. It wasn't. There was COVID, yeah, but it was a fantastic year for Bitcoin. It was as though there wasn't a global pandemic happening, wreaking havoc in every country's economy. The year opened with the price of Bitcoin at around $6,000. By the time the year closed, the price had already risen more than $20,000. And then the rise continued the following year even though it was still a pandemic year. Although the price corrected around the middle of 2021, it quickly recovered and registered an ATH by the last quarter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "November 05, 2023, 12:25:19 PM",
      "body": "Quote from: Darker45 on November 05, 2023, 12:09:16 PMYou are speaking as if 2020 was a bad year for Bitcoin. It wasn't. There was COVID, yeah, but it was a fantastic year for Bitcoin. It was as though there wasn't a global pandemic happening, wreaking havoc in every country's economy. The year opened with the price of Bitcoin at around $6,000. By the time the year closed, the price had already risen more than $20,000. And then the rise continued the following year even though it was still a pandemic year. Although the price corrected around the middle of 2021, it quickly recovered and registered an ATH by the last quarter. Exactly, bitcoin and the market have had a very good year during the Covid pandemic. Simply because the government has printed money and injected it into the economy to save the economy, and people have also taken advantage of the time quarantined at home to participate in online investment. Therefore, online investment channels at that time had a boom year, not as bad as the OP assumed. The Covid pandemic was a black swan for the world but it wasn't exactly a black swan for our markets at the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kingvirtus09",
      "created_time": "November 05, 2023, 12:32:12 PM",
      "body": "In my opinion and just seeing, not all crypto communities are focused on the past, because most of those who believe in Bitcoin or cryptocurrency are still looking to the future and not the past.That's why many believe and do dca in any crypto assets they believe in because most people know that they won't get any profit in the past, but in the future, that hasn't happened yet. That's what's being prepared, including me, who is also preparing for the upcoming halving next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "November 05, 2023, 12:37:54 PM",
      "body": "Quote from: Darker45 on November 05, 2023, 12:09:16 PMYou are speaking as if 2020 was a bad year for Bitcoin. It wasn't. There was COVID, yeah, but it was a fantastic year for Bitcoin. It was as though there wasn't a global pandemic happening, wreaking havoc in every country's economy. The year opened with the price of Bitcoin at around $6,000. By the time the year closed, the price had already risen more than $20,000. And then the rise continued the following year even though it was still a pandemic year. Although the price corrected around the middle of 2021, it quickly recovered and registered an ATH by the last quarter. That's probably because OP has some bad experience at that time and OP surrounded himself with people that has experienced the same thing so OP concluded that 2020 was a bad year. I guess it depends on how you look at it, if you're a bearish investor at that time, you're probably creaming your pants during the black swan event but if you're not one then you're probably having a different reaction. In regards to the title, I guess that people are way too focused on the repetition in history is by the fact that bitcoin's pattern throughout it's Genesis is almost close to being the same, a halving being followed by a huge pump that resulted in a new ATH, if that's the pattern that keeps on repeating, you can't really blame the people if they're focused on that alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "November 05, 2023, 12:40:18 PM",
      "body": "Quote from: Z390 on November 05, 2023, 08:41:58 AMFast forward to this bear market, many people really believe that we haven't seen the bottom yet, and some believe that the next black swan event will bring the last bottom for Bitcoin, I do have some questions about all this.We can not find the bottom but we can find bottom area where we can do accumulation and wait for a bottom confirmation then a bull run starts from it.Quote1. In the past Bitcoin bear market, how many black swan event happened at the time? I don't care but you can find black swan events or fud attempts that affected the market in previous bear markets.https://99bitcoins.com/bitcoin-obituaries/https://buybitcoinworldwide.com/bitcoin-is-dead/How to find?Use the Bitcoin chart, find big daily red candle and search for information about possible black swan events, fuds around that day with two above websites.The Bitcoin Crash of 2021 Compared to Past Sell-Offs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Drawesome",
      "created_time": "November 05, 2023, 12:44:51 PM",
      "body": "Quote from: Z390 on November 05, 2023, 08:41:58 AM3. What if the Black Swan event of this present bear market was the FTX Collapse? I guess Taleb would insult you for calling that a Black Swan event  . I mean, because in this space at that time, everyone was swimming naked (maybe except for Binance, who was the FTX killer).I tend to think that we haven't touched the bottom, especially because there are still many projects overpriced, not just shits, but legitimate projects that are just projects not worth the billions shown by the Market Cap.Anyways, I love the subject: People are too focused on history repeating itself. There are so many new variables in the equation now compared to four years ago: all the DeFi with collaterals, agents with resources arbitrating, etc. I have no idea what would happen, but I know for a fact that nobody does (except for the ones who could pull some triggers, although they won't know the end impact).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Russlenat",
      "created_time": "November 05, 2023, 12:45:23 PM",
      "body": "Sometimes, we tend to overthink things. If we look at the history of the Bitcoin market, we see a simple pattern: the bear market and the bull market. It doesn't matter if people think a bear market or a price drop is coming because those are usually temporary. Eventually, the bull market returns, and people start to get excited, leading to FOMO and making the market more bullish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "November 05, 2023, 12:45:59 PM",
      "body": "I don't think that there will be any black swan anymore as bitcoin price has seen the worst in this circle and the market has gotten to the minimal bear price when we had the crash of FTX and Luna. I don't also believe that bitcoin price can dip to 20k again in this circle as we are expecting the approval of Bitcoin ETF by next year January. If this is done successful, we will witness the price of bitcoin pumping because a lot of people will adopt bitcoin.History repeating itself, doesn't mean that catastrophes are bound to happen at the same time in bitcoin circle, what it means is that bitcoin price will always have an ATH at every four years and there are events that will always lead to high demand of bitcoin and low demand of bitcoin since it is a commodity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}