{
  "id": "topic_5476033",
  "title": "Hewlet",
  "author": "Hewlet",
  "created_time": "November 30, 2023, 08:57:19 AM",
  "content": "So I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?What's even the scientific explanation to the different languages we have in the world?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476033",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "November 30, 2023, 09:38:07 AM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMSo I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?What's even the scientific explanation to the different languages we have in the world?Lots of cultures don’t want to be the ones to give up their native language. How would you propose that the one true human language is chosen? More likely, over time AI will improve to the point that it will be able to translate languages on the fly and an implant will allow you to hear any language in your native tongue. Not as far off as you’d think….",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "November 30, 2023, 10:19:39 AM",
      "body": "Well. I don't think talking only one language would solve all cultural problems and conflicts we currently have, but it may certainly help to improve them, after all, it is easier to feel empathy by someone who is closer to us and speaks the same way we do. Currently the world has been moving towards adopting the English language as auxiliary language, so in the future it may be even more common to listen all people around speaking it and being proefficient enough to talk to natives at anytime. Though, it is true many countries would rather not to go through it, Germany and Japan are two examples of societies where they value their language very much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JackMazzoni",
      "created_time": "November 30, 2023, 10:24:39 AM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMSo I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?What's even the scientific explanation to the different languages we have in the world?There will be no peace because war is part of human nature. There were always someone who want more than they need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 30, 2023, 10:44:08 AM",
      "body": "It’s quite impossible to even imagine this different parts of the world developed differently over time languages are a reflection of culture and i don’t think culture is something that could be grouped into one mainly because of geographical location for example tropical countries might not have a word for hailstorms because they never experience it therefore they have no use for a word like that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "November 30, 2023, 11:36:21 AM",
      "body": "If the world had only one language it could potentially promote better communication & understanding among nations. Achieving peace & unity solely through a common language is complex as linguistic diversity is deeply rooted in culture and identity. The scientific explanation for different languages lies in the historical & cultural development of communities. Language evolves through social interactions, geographical isolation & cultural influences. Factors such as migration, colonization & trade also contribute to linguistic diversity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "November 30, 2023, 12:45:47 PM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMSo I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?What's even the scientific explanation to the different languages we have in the world?I have thought of the learnings that I've learned about this in the bible, they have explanations for this but I am not forcing people to believe in it. I just remember it since it's about one language and how it spread into many languages. So first of all, I know that many are atheists here but I just find it interesting that there's also this subject in the bible.First about the one language: Genesis 11:1 says that we've got one language in the whole world before. And then the spread of the language happened because of the Tower of Babel (Genesis 11:8-9). I did my research and saw some good points about those people who are saying that the Tower of Babel is just a myth. I've read some explanations on it in quora and that's also intriguing and interesting to me. You see, I'm learning both sides of believers and non-believers.And as we go about having one language, I don't think that we'll still be in peace and unity with that. Because it's determined that there will be people that's assigned and born to do bad and good. And that's like having one religion in theory to make a peaceful world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "November 30, 2023, 03:57:28 PM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMSo I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?What's even the scientific explanation to the different languages we have in the world?According to the Christianity practice, it was believed that there was only one spoken language before men begin to make plans on building a tower to reach the topmost height and then their language was scattered in other for them to misunderstood each other, having a single language all over the world could have been the best idea to safe humanity and it's unity, maybe their wouldn't have been diversity in language, colour or race, men may not have hatred over each other as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "November 30, 2023, 05:15:31 PMLast edit: November 30, 2023, 05:51:31 PM by BADecker",
      "body": "The language confusion at the time of the Tower of Babel was the best thing that could have happened. Here's why.When God created man - Adam - God breathed into his nostrils the breath of life. Man became a living soul.In other words, mankind has the Spirit of God living within himself. This means that man can 'create' all kinds of things. And we see it in the art and the sciences that man has developed.The problem with man is the lack of experience as well as the corruption that was done by the wicked, fallen angel, Satan. Such lack of experience and corruption would have destroyed mankind if we had been allowed to expand without limit. Why? Because the corruption has to do with destruction, and if God or man becomes corrupt in a limitless way, it ultimately means self-destruction.God confused the languages at Babel because He wanted to slow the advancement of mankind down, so that man wouldn't create the self-destruction of the race of man and the whole world. Creating mankind just to have the creation self-destroyed wasn't God's idea at all. So, he confused the language so that the people couldn't work together to destroy the race of mankind through corrupt advancement.But people die all the time. How is there NOT destruction when they are all destroyed in death? God sent His son, Jesus, into the world to take the punishment of destruction for all people. God raised Jesus from death after Jesus had died in the punishment - on the cross. Since Jesus has been raised from death by God, He can no longer die. He is like God (not corruption), and being God's Son, really is God. Now, everyone who believes in Jesus for life, will receive from God the eternal life that God had in mind for all people at the Beginning.Since the world is getting together again, in communications, and the learning of the various languages of the various nations - and especially through the computerization of language that is coming about today - and since the corruption hasn't been removed, you can expect that God will, again, shortly make a new 'confusion of the languages' so to speak. This time things will be done by the return of Jesus to straighten out the corruption in the hearts and souls of all people who are willing to be straightened out. The others will be destroyed. It will have to be this way, because God isn't going to put up with everlasting corruption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CRAIC",
      "created_time": "November 30, 2023, 05:53:25 PM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMWhat if all the countries of the world speaks just one language, would it have brought peace and unity in the world?If everyone spoke the same language, there would be peace in the worldQuote from: Hewlet on November 30, 2023, 08:57:19 AMWhat's even the scientific explanation to the different languages we have in the world?Geographical division into continents and state lines",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "November 30, 2023, 07:41:56 PM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMSo I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?It would be impossible because people live so far from each other that they'd eventually form dialects and then unattached languages. You should read about the evolution of languages and that would answer a lot of your questions. Language is just a part of the whole culture and it's not one thing that makes people feel related to each other and allows them to find common ground. If that was a thing there would never be a single civil war.Quote from: CRAIC on November 30, 2023, 05:53:25 PMIf everyone spoke the same language, there would be peace in the worldTell that to Russians and Ukrainians. Their languages are almost the same and they were even one country for a time. QuoteWhat's even the scientific explanation to the different languages we have in the world?In short, distance. Language evolved simultaneously in many parts of the world when there was no way to travel that far. Getting from South Africa to Central Europe would take you years, so people stayed in one place their whole lives and had to communicate somehow. They begun to name basic items, sun, earth, forest, and these things evolved from simple sounds into more complex words, as we became smarter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "November 30, 2023, 08:48:16 PM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMSo I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?What's even the scientific explanation to the different languages we have in the world?In my opinion if the world speaks one language it will be inappropriate, talking about peace and unity, peace and unity has nothing to do with language, tribe and culture even people from the same tribe who speaks the same language still have disunity and agruement so having one language will even promote disagreement and it will be very difficult to handle.Your last question got me wondering, what really happened how did the world have different languages and culture and the interesting fact is if every tribe with different languages come together and learn how to love each other it will be perfect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "November 30, 2023, 10:13:43 PM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMSo I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?Well, that's just not possible. Even people with same language family varies them with different dialects over time.Quote from: Hewlet on November 30, 2023, 08:57:19 AMWhat's even the scientific explanation to the different languages we have in the world?Is this a serious question? Because there are different cultures and because people didn't used to travel as much. Language reflects different cultures, and people find different words for different things. When these groups of people live in isolation, they form slightly different dialekt from neighbourg settlements and further you go, further apart the languages are. If there's an ocean between them, or any other hard to travel thing seperating them, they can be totally different.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KonstantinosM",
      "created_time": "December 01, 2023, 04:50:20 AM",
      "body": "We practically do and it's English, there always seemed to be a language for trade, it used to be a version of Greek in the past and now it's English.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "December 01, 2023, 05:34:29 AM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMSo I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?What's even the scientific explanation to the different languages we have in the world?Actually, I don't think that language is a problem of conflict in the world, see it as a tool to bring people together, and language differences are not a challenge for people to become peaceful.The main factor causing conflict is opposing views, stubbornness becomes conflict and causes unwanted things.If you think scientists need to use a single language, understand that scientific interpretation does not depend only on conventional theories, its logic is always conveyed so the recipient can understand it.So if we want more peace, it's not about unifying the language, we need to change human morality first, eliminating greed - hatred - selfishness - confusion - doubt. I believe we will naturally find that peace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Essential10",
      "created_time": "December 01, 2023, 08:12:42 AM",
      "body": "I fully agree that the absence of peace and unity in the world is largely due to conflicts arising from power struggles, and language is only one of many factors contributing to this problem. While a common language can facilitate communication, understanding and cooperation, it is not a panacea for solving the world's problems. Indeed, language diversity reflects global culture and protecting and respecting linguistic diversity is crucial for mutual understanding and unity. Each language carries with it a unique heritage, knowledge and identity, which can serve as a bridge to connect and enrich our global community. Therefore, while language plays a role in shaping our world, achieving peace and unity requires addressing a complex array of social, political, economic and cultural factors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 01, 2023, 08:58:36 AM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMWhat if all the countries of the world speaks just one language, would it have brought peace and unity in the world?It will not change anything at all, let's give you a better example the USA is an English-speaking nation where both white and coloured speak English as their native so why does racism still exist?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "December 01, 2023, 12:37:02 PM",
      "body": "Quote from: Hewlet on November 30, 2023, 08:57:19 AMSo I have been wondering what if we had only one language? What if all the countries of the world speaks just one language, would it have brought peace and unity in the world?What's even the scientific explanation to the different languages we have in the world?Having one language is not something that is possible. Languages keep increasing everyday as new ones are being discovered on a yearly basis.Speaking one language generally won’t bring about peace and unity. Peace and unity is something within the heart of a man, having humanity. Even within countries that share the same language, peace does not still exist. So this is not something that can be achieved by using one language globally.There’s no scientific explanation to it, it happens and so we came to see it existed. Different culture brought about different ways of speaking and understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "December 01, 2023, 03:07:16 PM",
      "body": "^^^ But the world is rapidly getting one language. It isn't the language of one of the nations. Rather it is the super-language of combining all the computer languages into one between computers of the whole world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 01, 2023, 03:16:33 PM",
      "body": "Quote from: Jegileman on December 01, 2023, 12:37:02 PMHaving one language is not something that is possible. Languages keep increasing everyday as new ones are being discovered on a yearly basis.Is it?How many languages were formed in the last 10 years?The language decreases over time and it happens because the native speakers adopt to a different language for survival like how English captured most of the places but only few manage to keep their native above English and also adopts English better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}