{
  "id": "topic_5417717",
  "title": "GxSTxV",
  "author": "GxSTxV",
  "created_time": "October 20, 2022, 05:07:21 AM",
  "content": "ماستركارد تزود البنوك ببرنامج تجريبي للتداول بالعملات المشفرةهذه احد عناوين أخبار العملات الرقمية أين قامت ماستركارد تزود البنوك ببرنامج تجريبي للتداول بالعملات المشفرة شركة ماستركارد بخطوة الى قبول العملات المشفرة وأضن انها لأول مرة وليس لدي معلومات كثيرة حول هذه الشركة لكنها قامت بالفعل باطلاق برنامج تجريبي يسمى كريبتو سورس والذي سوف يسمح لعملائها بتداول العملات الرقمية وهذا أمر جيد لانه عاجلا ام اجلا فانه لا مفر من البلوكشين وخصائصه التي لا تتوفرها أي انظمة بنكية وانا اتحدث عن الخدمات التي سوف تساعد الشخص كمواطن وتسهل عليه أمورا كثيرة عكس أشخاص وشخصيات نعرف مبتغاها مع البنوك بكل أسف خاصة دولنا العربيةوأضاف في المقال أيضا بأن  “ مؤشر ماستركارد للمدفوعات الجديدة 2022 قد كشف أن 29% من المستهلكين حول العالم يمتلكون بالفعل عملات مشفرة بغرض الاستثمار، وأن 65% من المستهلكين يفضلون قيام مؤسساتهم المالية الحالية، التي يثقون بالتعامل معها، بتقديم خدمات العملات المشفرة مباشرة.”وهذا إذا دل على شيء يدل أن العالم قد إكتفى من الخدمات البنكية التي لم تعد تنفع او تلبي حاجيات المواطن ونرى الكثير من الأشخاص في يومنا هذا يعيش فقط على العملات الرقمية فهي تمثل مهنة وأسلوب عيش افضل بكثير من البنوكوالشيء الاخر هو “ إدارة الأمن والموثوقية، وتشمل الحلول التي تقدمها ماستركارد في مجالات التحقق من الهوية، وتحليل العملات المشفرة، ومراقبة التعاملات بها، ومكافحة غسيل الأموال، والدعم خلال عملية التحقق من العملاء “اعرف عميلك”، والأمن السيبراني، وحلول المصادقة البيومترية. “والذي ربما سوف يشكل مشاكل في المستقبل ويقدم محدودية للعملات الرقمية هي عن طريق الحصول على معلوماتك كاملة بغرض الاشتراك في هذا البرنامج والكثير لن يعجبه الامر لانه يعطل واحدة من افضل الخصائص في العملات الرقمية. لكن ربما ايضا هو امر نوعا ما اجباري على ماستركارد لكي تحصل على قبول من حكومات اخرى ونعلم جيدا ان غسيل الاموال سوف يسهل عليهم كثيرا بهذا الشكل ونحن نعلم على من اتحدث والخاسر الاكبر دائما هو المواطن البسيط عندما يتم تقييده أيضا وفرض شروط عليه حتى في التداولوانا شخصيا لا ارى أني سوف اتقدم للحصول على حساب في ماستركارد أبدا لكي اتداول أو اخزن عملات مشفرة في ذلك الحساب. علما ان جميع المستخدمين الان احرار في استخدام العملات المشفرة بدون اي قيود وبشكل مخفي تماما والسؤال المطروح لماذا سوف تظن هذه الشركة انها سوف تربح عملاء للاشتراك في برنامجهم ؟ ومثلا اذا تعرض شخص للاختراق أو نصب هل سوف تكون قابلة على تتبع المجرم اعادة اموال العميل ؟مصدر الخبر اريبيان بزنس",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417717",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "October 20, 2022, 04:05:24 PM",
      "body": "لقد قرأت الخبر في تويتر اليومأعتقد أن الخبر يمكن أن يكون له جانب إيجابي وآخر سلبي، كما تفضلت أخي لن يرغب الكثير ممن يرغبون بالمحافظة على خصوصيتهم بالتداول عن طريق ماستر كارد لأنهم سيكونون مكشوفون تماما وأموالهم في أيدي شركة مركزية يمكن أن تقوم بحظرهم واحتجاز أموالهم في أي وقت وكذلك يمكن للحكومة تتبع كل تحركاتهم المالية بكل سهولة عن طريق بطاقتهم. لكن من ناحية أخرى سيكون من السهل جدا على أي شخص يملك البطاقة أن يشتري البيتكوين والعملات المشفرة من بطاقته بشكل مباشر ويتداول فيها وعندما يريد تحويلها لكاش سيكون ذلك أيضا بمنتهى السهولة وفي جميع دول العالم التي تدعمها البطاقة وهذه تعتبر ميزة كبيرة جدا نظرا لكون البطاقة منتشرة على مستوى العالم. الخبر إيجابي بشكل عام وعاجلا أم آجلا ستضطر جميع الشركات والخدمات العالمية لقبول البيتكوين والعملات المشفرة كجزء أساسي من نظامها المالي.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "October 21, 2022, 10:27:45 AM",
      "body": "Quote from: yhiaali3 on October 20, 2022, 04:05:24 PMلقد قرأت الخبر في تويتر اليومأعتقد أن الخبر يمكن أن يكون له جانب إيجابي وآخر سلبي، كما تفضلت أخي لن يرغب الكثير ممن يرغبون بالمحافظة على خصوصيتهم بالتداول عن طريق ماستر كارد لأنهم سيكونون مكشوفون تماما وأموالهم في أيدي شركة مركزية يمكن أن تقوم بحظرهم واحتجاز أموالهم في أي وقت وكذلك يمكن للحكومة تتبع كل تحركاتهم المالية بكل سهولة عن طريق بطاقتهم. لكن من ناحية أخرى سيكون من السهل جدا على أي شخص يملك البطاقة أن يشتري البيتكوين والعملات المشفرة من بطاقته بشكل مباشر ويتداول فيها وعندما يريد تحويلها لكاش سيكون ذلك أيضا بمنتهى السهولة وفي جميع دول العالم التي تدعمها البطاقة وهذه تعتبر ميزة كبيرة جدا نظرا لكون البطاقة منتشرة على مستوى العالم. الخبر إيجابي بشكل عام وعاجلا أم آجلا ستضطر جميع الشركات والخدمات العالمية لقبول البيتكوين والعملات المشفرة كجزء أساسي من نظامها المالي. بالضبط في اخر الامر الجميع سوف يرضخ للارض الواقع ولايمكن للبنوك والحكومات تجاهل اهمية العملات الرقمية و البلوك شين في تسهيل جميع الامور ويبقى الامر الذي لا يمكن التحكم فيه هو الخصوصية لانه من اجل ضمان حق كل الاطراف و حماية المستخدم يجب عليك ان تقوم بالتعريف عن نفسك واخذ وثائقك من طرف البنوك و اذا لم يتم ذلك ايضا فلا يمكن ان ننكر انه امر سوف يسهل على الكثير من المجرمين و التعاملات الغير قانونية ولا احد يمكن السيطرة على ذلك",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "October 21, 2022, 11:21:21 PM",
      "body": "لا أعرف صراحة لكن ما ذكره الأخ يحيى يدعو للتأمل و الضحك في نفس الوقت..عديد المنصات تدعم شراء العملات الرقمية ببطاقات الدفع مثل ماستر كارد و غيرها بدون اي مشاكل و بدون عمولة كبيرة!!بصراحة، أعتقد أن هذه المؤسسات البنكية او المالية قد تجاوزها الزمن و لن اعلق اكثر من هذا...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}