{
  "id": "topic_5443887",
  "title": "cafter",
  "author": "cafter",
  "created_time": "March 07, 2023, 01:06:59 PM",
  "content": "i uploaded an awesome bitcoin profile picture on instagram, 3 days ago,but today a lady contacted me by Dm \"hi\" - \"you know about bitcoin?\" - \"I am new to bitcoin\", \"can you guide me to make money from it \"she don't want to learn anything just wanted to make money out of bitcoin, her knowledge about bitcoin is very very less, she only knew the name \"bitcoin\" she was talking like \"bitcoin=money\" I said i can guide you to learn about bitcoin, i said bitcoin is like digital money, you can buy it at a specific price and sell it at higher price when price will rise , this is how the money made from it .i said this because she only wanted to make money, i don't talked about much stuff.she said \"i am following a bitcoin expert\" , just a instagram account holder with some trading charts  posted ,i said ,you have an exchange account she said 'what is meant by exchange\",i said exchange where you can buy cryptocurrency, exchanges like binance,kucoin, etc.she said \"oh, i am with binance \"she does not know anything about binance and basic terms just made an account following her mentor.she is so dumb to scam her.https://ibb.co/Y3cf3TThttps://ibb.co/yNJ0qqmhttps://ibb.co/Y3cf3TTi sometime think why people do this type of dumb mistakes , now i knew there knowledge about technology ,they just come to make money and get scammed.ignore my terrible english",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443887",
  "comments": [
    {
      "author": "rat03gopoh",
      "created_time": "March 07, 2023, 01:39:14 PM",
      "body": "Quote from: cafter on March 07, 2023, 01:06:59 PMshe does not know anything about binance and basic terms just made an account following her mentor.she is so dumb to scam her.Why don't you think otherwise? He's actually trying to trick you. He's trying to direct you to someone who offers you 90% of the return on investment.There is no real woman if she is some random girl who starts a profitable investing conversation. So stay careful, and don't assume you're smarter than \"beginners\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "March 07, 2023, 01:43:45 PM",
      "body": "Quote from: rat03gopoh on March 07, 2023, 01:39:14 PMQuote from: cafter on March 07, 2023, 01:06:59 PMshe does not know anything about binance and basic terms just made an account following her mentor.she is so dumb to scam her.Why don't you think otherwise? He's actually trying to trick you. He's trying to direct you to someone who offers you 90% of the return on investment.There is no real woman if she is some random girl who starts a profitable investing conversation. So stay careful, and don't assume you're smarter than \"beginners\".oh, yes this can happen, but , by conversation she really doesn't know anything about it,she is telling me to guide her, which is a clear sign to not selling me course or guidancethis is just an example i found on instagram,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "March 07, 2023, 01:48:53 PM",
      "body": "Based on the conversations it seems someone who ask you about Bitcoin is the scammer since she is ask you to follow the account which offer to make money via trading, but since you're aware with this scam, she doesn't want to continue the conversations.She might only act dumb, who knows if she's a scammer and someone who control the self pro claimed Bitcoin trader's account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "March 07, 2023, 01:58:20 PM",
      "body": "Quote from: rat03gopoh on March 07, 2023, 01:39:14 PMQuote from: cafter on March 07, 2023, 01:06:59 PMshe does not know anything about binance and basic terms just made an account following her mentor.she is so dumb to scam her.Why don't you think otherwise? He's actually trying to trick you. He's trying to direct you to someone who offers you 90% of the return on investment.There is no real woman if she is some random girl who starts a profitable investing conversation. So stay careful, and don't assume you're smarter than \"beginners\".You obviously understand, it really showed that he does not understand how scammers operate. Several approaches have been sent to my Telegram account. First, I check if we shared a group, if not, then I get careful. My name, location, and gender are all I can tell an intruder in my PM, aside from that, I try to keep my identity private. Messages sent privately are suspicious, so don't be fooled by any approach.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "March 07, 2023, 02:04:07 PM",
      "body": "No rational, honest human being asks for investment or financial assistance in social media. And even if there is one, it's really not worth the risk to guide. You're most likely going to lose your time, because they'll be scammers. Also, don't reveal on social media that you own bitcoin, because you're an immediate target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slashz9",
      "created_time": "March 07, 2023, 02:06:08 PM",
      "body": "oh really that reminds me to conversation few years ago, when i first in crypto some people tell like that.i almost got trapped but my friend say me that a scam, so i leave him and never affected by it again..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 07, 2023, 02:07:07 PM",
      "body": "That's an obvious way to promote her friend's accounts but the fact is it's also her account there are lots of them on telegram with the same strategy pretending as a newbie. They try to convince you and gives you suggestion or link and then they are going to force you to deposit.Many newbies out there still fall into this kind of strategy. So always be aware and ask trusted people if they are legit or not or better discuss it here so that trusted people here will advise you what to do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "March 07, 2023, 02:21:43 PM",
      "body": "Quote from: cafter on March 07, 2023, 01:06:59 PMshe was talking like \"bitcoin=money\" She is like most of newbies and new comers in cryptocurrency. They are attractive by stories like Bitcoin Pizza but then they believe in Altcoin pizza stories that are not realistic. Very few altcoins can survive after many years and can help them to gain good profit like Ethereum, BNB, Dogecoin. They are barely seen altcoins. Other altcoins only make them poorer.Quotei said exchange where you can buy cryptocurrency, exchanges like binance,kucoin, etc.she said \"oh, i am with binance \"she does not know anything about binance and basic terms just made an account following her mentor.she is so dumb to scam her.Nothing is wrong to believe in your mentor until a moment your mentor asks you to send him or her money. If my mentor asks me to do so, I am out immediately.It is a common method in life and not only exist in cryptocurrency. So I don't feel strange if anyone tries to scam me with this method.A good mentor will teach you do do things by yourself, not doing things on behalf of you and if it is related directly to your money, it sounds like too good to be true mentor, more like a scammer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "March 07, 2023, 02:22:23 PM",
      "body": "Quote from: BitMaxz on March 07, 2023, 02:07:07 PMThat's an obvious way to promote her friend's accounts but the fact is it's also her account there are lots of them on telegram with the same strategy pretending as a newbie. They try to convince you and gives you suggestion or link and then they are going to force you to deposit.Many newbies out there still fall into this kind of strategy. So always be aware and ask trusted people if they are legit or not or better discuss it here so that trusted people here will advise you what to do.yes,but the lady was hooked up with her mentor whose account was seems like scammer posting just irrelevant charts and luxury lifestyle,may these type of person with very less knowledge are less but this was my conversation , may she was trying to scam me who knows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "March 07, 2023, 02:22:48 PM",
      "body": "Oga from what I read from you and the lady's conversation, you cannot scam that lady, she only asked you to guide her how to make money from bitcoin and you are thinking of scamming who needs help from you. Your thought is very bad even though you were not having the intention to do that and by thinking such is bad, if the bad mindset manifest you might do it to other people. I have thought a lot of novice on WhatsApp, Facebook and other social media platforms and I have never thought of even collecting money for the service I rendered to them. And also you have to be careful on Telegram. That lady that was asking to guide her might be an imposter. So you might even be scammed. Be clean in all ramifications of life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "March 07, 2023, 02:35:06 PM",
      "body": "Quote from: Agbe on March 07, 2023, 02:22:48 PMOga from what I read from you and the lady's conversation, you cannot scam that lady, she only asked you to guide her how to make money from bitcoin and you are thinking of scamming who needs help from you. Your thought is very bad even though you were not having the intention to do that and by thinking such is bad, if the bad mindset manifest you might do it to other people. I have thought a lot of novice on WhatsApp, Facebook and other social media platforms and I have never thought of even collecting money for the service I rendered to them. And also you have to be careful on Telegram. That lady that was asking to guide her might be an imposter. So you might even be scammed. Be clean in all ramifications of life. you didn't read conversation properly and talking about me scamming her, i am just giving you example of people's mindi didn't try or scam anyone , you seems like rushed to give reply",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "March 07, 2023, 02:52:29 PM",
      "body": "But basically, when you first want to know how to get bitcoins, someone will always ask anyone, even if we randomly know them, because maybe they don't know who to ask to tell them.Yes, even though this condition is prone to fraud, when you meet someone who is honest and willing to help, he will be a lucky person. Yes, even though today there are lots of tutorials on YouTube or other social media that can be used as guides, sometimes we are confused by the explanations of content creators.I hope you don't trick him",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "March 07, 2023, 03:32:40 PM",
      "body": "I understand OP is trying to explain how easy it is to scam people using the woman as an example. Looking at his explanation in both sides, we can't clearly state who will become the victim. It could be OP or the shiller claiming to be a novice. Op's topic is still in line, because a person who is not experienced may fall for the shiller's con by joining the other account where they'll be ripped off their money. On the other flip, if the woman wasn't a shiller but genuine seeker of what bitcoin is about, Op is trying to inform us how easily she could get scammed. We are all in the cryptocurrency niche together and when we spot a scam we'll know, yet others may not be opportune to detect a fishy investment conversations that's where people perish because they lack information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "March 07, 2023, 03:41:52 PM",
      "body": "Quote from: Accardo on March 07, 2023, 03:32:40 PMI understand OP is trying to explain how easy it is to scam people using the woman as an example. Looking at his explanation in both sides, we can't clearly state who will become the victim. It could be OP or the shiller claiming to be a novice. Op's topic is still in line, because a person who is not experienced may fall for the shiller's con by joining the other account where they'll be ripped off their money. On the other flip, if the woman wasn't a shiller but genuine seeker of what bitcoin is about, Op is trying to inform us how easily she could get scammed. We are all in the cryptocurrency niche together and when we spot a scam we'll know, yet others may not be opportune to detect a fishy investment conversations that's where people perish because they lack information.I understand what you meant and it is possible this might be the case, but after reading Op, I think I can guess what scenario actually happened. The woman is a novice following someone's advice and directions, but at a time she wasn't too comfortable with her mentor and she decided to contact random people to seek their opinion if it really agrees or differs from what her teacher teaches her to do.But in all, this could be leading to scam. Be careful dealing with random people on the internet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 07, 2023, 03:45:37 PM",
      "body": "Quote from: cafter on March 07, 2023, 01:06:59 PMi uploaded an awesome bitcoin profile picture on instagram, 3 days ago,but today a lady contacted me by Dm \"hi\" - \"you know about bitcoin?\" - \"I am new to bitcoin\", \"can you guide me to make money from it \"she don't want to learn anything just wanted to make money out of bitcoinYou also needs to be careful because nowadays scammers are using this kind of technique to decieve people and eventually ended up scamming them, when tou first receives a mail or DM from unknown sources it's a call to be at alert and be careful, you may be tricked and set up, also being a newbie in this category that all you do is to find anything attractive and doubtlessly got into it without proper orientation is a perfect submission to getting scammed, newbies should be aware that it's very risky in making deals with unfamiliar persons or organizations, those you just meet on the social media and got feelings for, they may turn to be what you never expect tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "March 07, 2023, 03:47:20 PM",
      "body": "The user is just acting like he is a complete newbie to fool you to recruit for his so called mentor service which we all know that lead to scam. This scam scheme is old  but still widely use on social media especially on comment section. They are everywhere and newbie will really fall for it if they don’t have any experience or not aware on how this scammer work.I read a post on social media that he became a victim of this scheme. Scammer will ask you to fund your trading account which they are the one who will provide and trade for you. They will show you profit at first then they will keep asking you for more  before you can withdraw until you don’t have enough cash they disappear instantly. This is an obvious scam but still there are a lot of newbie out there that being scammed by this poor scam trick.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vickysagar",
      "created_time": "March 07, 2023, 03:57:04 PM",
      "body": "I heard a lot of stories about people being scammed in crypto, and all of them are newbies or didn't even have it until they saw a big \"opportunity\". To be honest, it amazes me how people can be so naive, even tho they can be older than me. It's not about crypto knowledge, it's about goddamn common sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "March 07, 2023, 04:15:04 PM",
      "body": "Op, she's not a newbie it's either she's trying to look for an opportunity to invite you to a pump and dumb group chat where they can make money of you when you truly buy whatever coin they might predict the price but the way the conversation went it seems like she was truly a newbie but I'm suspecting that she has an ulterior motive behind her Convo because it's quite rare to see someone message you just because you have Bitcoin logo on your profile pics and truly wants to learn more about Bitcoin. But Op one thing you should take note of; no matter how amateur they may sound please try as much as possible not to click any link sent to you or maybe she ask you to download some file that contains a problem she's currently trying to fix or what word she might use to mask it. Don't click, don't be cocky and then you do something stupid make sure you're very cautious because you can not tell what's going through some random strangers mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "March 07, 2023, 04:32:04 PM",
      "body": "Quote from: Cantsay on March 07, 2023, 04:15:04 PMOp, she's not a newbie it's either she's trying to look for an opportunity to invite you to a pump and dumb group chat where they can make money of you when you truly buy whatever coin they might predict the price but the way the conversation went it seems like she was truly a newbie but I'm suspecting that she has an ulterior motive behind her Convo because it's quite rare to see someone message you just because you have Bitcoin logo on your profile pics and truly wants to learn more about Bitcoin. But Op one thing you should take note of; no matter how amateur they may sound please try as much as possible not to click any link sent to you or maybe she ask you to download some file that contains a problem she's currently trying to fix or what word she might use to mask it. Don't click, don't be cocky and then you do something stupid make sure you're very cautious because you can not tell what's going through some random strangers mind. nice advice,newbie should avoid this mistaketo do something unusual a link is enough for themmany threads are there in gambling and fraud section of this forum, there lot of threads are discussed like i clicked the link and my funds are gone",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}