{
  "id": "topic_5462190",
  "title": "Beparanf",
  "author": "Beparanf",
  "created_time": "August 05, 2023, 04:29:03 PM",
  "content": "This board has a lot of topic that comprises with the negativity about gambling addiction. Let’s change it for now to support the casino we are promoting here.Gambling is important to the society because it provides huge taxes that government use on hospitals, infrastructure and other projects to help its citizens. Monacco country is popular with their casino but they don't allow its citizen to play. This shows how important gambling in their country because they still allowed to operate it even though they don't want citizens to be involved.In our country, Our lottery use the proceeds to donate on the health center that provides free health service to our citizens.Even if gambling commonly view as negative by commoner. Many didn't notice how big is the contribution of gambling to the society.Reference for this topic: https://harbert.auburn.edu/binaries/documents/center-for-ethical-organizational-cultures/debate_issues/gambling.pdfWhat is the benefits of gambling to your society?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462190",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "August 05, 2023, 04:39:23 PM",
      "body": "This is not new to us on this forum. We talked about gambling addiction, but also we know very well that the government in the countries that we are gambling are making money from gambling tax.Quote from: Beparanf on August 05, 2023, 04:29:03 PMGambling is important to the society because it provides huge taxes that government use on hospitals, infrastructure and other projects to help its citizens. Monacco country is popular with their casino but they don't allow its citizen to play. This shows how important gambling in their country because they still allowed to operate it even though they don't want citizens to be involved.Even countries like China is another example. People should know one thing, countries that gambling is not legal, there are still many people offering gambling in the countries, and also that there are many people in the countries that find means to gamble online. But if a country is not supporting gambling, no tax would be taken by the government.Quote from: Beparanf on August 05, 2023, 04:29:03 PMWhat is the benefits of gambling to your society?In countries that gambling is legal, it benefit the government and It also provides employment. At least, it helps the economy. But we should not be addicted, because the addiction will make us see the bad side of gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 05, 2023, 04:43:10 PM",
      "body": "Sadly I cannot mention much about positive impacts of gambling within my society. In the past, some years ago, the biggest lottery of this country had some programs and charities which provided relief to communities and people in need. But Nowadays it seems that lotteries just pay their taxes to the government and since the government is quite corrupt, much of the money does not end up where it is supposed to. If there was a lottery which was affordable enough and proved itself to use a percentage of its gains for the common good, I would not mind to buy tickets every now and then. Just my opinion, as someone living on South America.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "August 05, 2023, 05:04:22 PM",
      "body": "Quote from: Beparanf on August 05, 2023, 04:29:03 PMWhat is the benefits of gambling to your society?Aside from those mentioned above like providing employment for physical betting agents and also for those online that are part of the team or help them in one way or the other I don’t really see much positive impact.Gambling in my society are mostly done for personal gain so things like donating some parts of the money won in betting to some orphanages or physically challenged individuals. Another thing, most people in my society are not that friendly when it comes to gambling they generally do not see it as something that a responsible person should engage in so once they see you in any physical store you’re automatically wayward to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 05, 2023, 05:16:06 PM",
      "body": "Crowd gathers when theres a casino house in the area/city. Only means people are socializing and casino houses is a place to meet people from higher places and meet friends. Thats one benefit besides entertainment.Just take MGM grand as an example in Vegas where big boxing matches usually are held. The city becomes a tourist spot also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "August 05, 2023, 05:45:18 PM",
      "body": "Gambling can bring great revenue to the governments but I don't see any benefits to the societies,in fact it can only bring really bad things,like in the country where I live from some years where at a certain time a lot of people became addicted in the sense that they could not stay without gambling and they were spending money they could not afford to lose like money they get for food and other important money.At a certain point the government intervened and ban all of the offline gambling while letting only online ones,a few to play,so I don't see any other benefits except taxes to the government while for society can have more harm than benefit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "molsewid",
      "created_time": "August 05, 2023, 05:49:02 PM",
      "body": "Quote from: Hispo on August 05, 2023, 04:43:10 PMSadly I cannot mention much about positive impacts of gambling within my society. In the past, some years ago, the biggest lottery of this country had some programs and charities which provided relief to communities and people in need. But Nowadays it seems that lotteries just pay their taxes to the government and since the government is quite corrupt, much of the money does not end up where it is supposed to. If there was a lottery which was affordable enough and proved itself to use a percentage of its gains for the common good, I would not mind to buy tickets every now and then. Just my opinion, as someone living on South America. That's too sad. Hmm, here in us lottery still help people to the money they are deducting to the winner but then they only select few which is kinda low they need to add more since they are earning a lot of money they should at least send it back to people so that they can help more and more people who are needy especially those people in here who needs money for medications.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Westinhome",
      "created_time": "August 05, 2023, 06:00:33 PM",
      "body": "Quote from: Beparanf on August 05, 2023, 04:29:03 PMThis board has a lot of topic that comprises with the negativity about gambling addiction. Let’s change it for now to support the casino we are promoting here.Gambling is important to the society because it provides huge taxes that government use on hospitals, infrastructure and other projects to help its citizens. Monacco country is popular with their casino but they don't allow its citizen to play. This shows how important gambling in their country because they still allowed to operate it even though they don't want citizens to be involved.In our country, Our lottery use the proceeds to donate on the health center that provides free health service to our citizens.Even if gambling commonly view as negative by commoner. Many didn't notice how big is the contribution of gambling to the society.Reference for this topic: https://harbert.auburn.edu/binaries/documents/center-for-ethical-organizational-cultures/debate_issues/gambling.pdfWhat is the benefits of gambling to your society?It's true,gambling is the good to the society by giving some winning money to the poor person randomly.We already come across many thread about the huge winning of the particular person.The lottery game play huge difference in the individual life of many people.Even the government of  Monacco doesn't allow their citizen to play the gambling,the country generating certain revenue from the gambling which can be used by the government for the people welfare scheme.So finally the people from the Monacco was getting benefit from the gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "August 05, 2023, 06:04:09 PM",
      "body": "it can have an initial impact on employment. Opening a structure help some people to earn with a corner, the company and more....but, personally, I can't see all these positive effects on society and above all I don't find the \"taxes\" aspect positive. we could tax murders, hard drugs, violence... or just think about the cigarette smoking taxes bring... this not means is something \"healthy\" for a society...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "August 05, 2023, 06:08:28 PM",
      "body": "Quote from: bittraffic on August 05, 2023, 05:16:06 PMCrowd gathers when theres a casino house in the area/city. Only means people are socializing and casino houses is a place to meet people from higher places and meet friends. Thats one benefit besides entertainment.I’m not sure if people wants to socialize when they to the casino because I personally doesn’t care to others while gambling because I’m focus on my own game. It’s very hard to communicate when there’s money involved because the person might experiencing bad day on gambling while my words might trugger his anger.Quote from: bittraffic on August 05, 2023, 05:16:06 PMJust take MGM grand as an example in Vegas where big boxing matches usually are held. The city becomes a tourist spot also.Boxing is sports although most of the viewers is placing bets on the match.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "August 05, 2023, 06:25:04 PM",
      "body": "Quote from: Beparanf on August 05, 2023, 04:29:03 PMWhat is the benefits of gambling to your society?There isn't really much to say about this because gambling is not considered normal in my community. Instead, it is viewed as an immoral conduct, and those that gamble are viewed as lazy and jobless people. Not that gambling is prohibited, but the majority of gamblers like online gambling to visiting a casino. Many people in this country have benefited from gambling; in particular, young people who are unemployed, it has provided them with a means of livelihood. Although it has more beneficial impact than negative effects on society but many people are unable to see how it actually benefits society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "August 05, 2023, 06:29:31 PM",
      "body": "Gambling industry is one of the most lucrative industry for both operators and the authorities whoes jurisdiction this casinos operating,  and for the fact that i-gaming is the hype of the moment couple with the recent popularity in the online gaming,  many citizens can now have access to casinos even those that are restricted in they jurisdictions by use of VPN, so the accessibility rate to gambling have increased lately due due the increasing positive development in the I-gaming industry. Gambling as source of revenue for the government,  it's true that the government have generated millions of dollars in revenue from casinos and even those countries that have some restrictions on gambling and operations of casinos within their jurisdictions still get taxes from the income tax of gambling from they citizens who still gamble anonymously. So gambling is indeed beneficial to both the citizens and the government and even the casino itself and this is why gambling despite it negative effects of addiction it still make up for the largest industry that accommodate a lot of people in the society and there is no doubt about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "August 05, 2023, 06:33:33 PM",
      "body": "Quote from: Beparanf on August 05, 2023, 04:29:03 PMThis board has a lot of topic that comprises with the negativity about gambling addiction. Let’s change it for now to support the casino we are promoting here.Gambling is important to the society because it provides huge taxes that government use on hospitals, infrastructure and other projects to help its citizens. Monacco country is popular with their casino but they don't allow its citizen to play. This shows how important gambling in their country because they still allowed to operate it even though they don't want citizens to be involved.In our country, Our lottery use the proceeds to donate on the health center that provides free health service to our citizens.Even if gambling commonly view as negative by commoner. Many didn't notice how big is the contribution of gambling to the society.Reference for this topic: https://harbert.auburn.edu/binaries/documents/center-for-ethical-organizational-cultures/debate_issues/gambling.pdfWhat is the benefits of gambling to your society?Entertainment.  People pay $500 to go to a sporting event for entertainment.  I feel like gambling is the same thing.  If you enjoy it than it's worth the run even if you lose.  It's when gambling doesn't become fun but rather a need is when it slides into negativity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "August 05, 2023, 06:37:09 PM",
      "body": "Quote from: Nheer on August 05, 2023, 06:25:04 PMQuote from: Beparanf on August 05, 2023, 04:29:03 PMWhat is the benefits of gambling to your society?There isn't really much to say about this because gambling is not considered normal in my community. Instead, it is viewed as an immoral conduct, and those that gamble are viewed as lazy and jobless people. Not that gambling is prohibited, but the majority of gamblers like online gambling to visiting a casino. Many people in this country have benefited from gambling; in particular, young people who are unemployed, it has provided them with a means of livelihood. Although it has more beneficial impact than negative effects on society but many people are unable to see how it actually benefits society. What country do you live? I think gambling is typically viewed like this by religious country or family that has a strong religious background just like mine. My country typically view gambling like that but still many people here love to gamble and doesn’t care what’s the opinion of the religion.Gambling provides a lot of jobs here in both our casinos and lotto outlet. The gambling industry here is booming despite it was being discouraged by normal adults because most of us here doesn’t care what other said as long as they get satisfaction they need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 05, 2023, 06:50:31 PM",
      "body": "Gambling casinos in the society does help bring development to such society, but for the place where I live, it is kind of hard to really point to the benefits the society have gained through gambling casinos aside it being one of the means through which we entertain ourselves, makes sports seasons in our society very lively and interesting, gambling casino might be paying tax to the government, but the truth is that, that government of other cities are using such taxes to develop their country does not mean its same for other governments, with the kind of corrupt leaders we have in the herm of affairs in Nigeria, I doubt if they are building anything with money they make from taxes, which if this be true, it simply means that the tax gambling casinos are paying to the government is a waste to the masses.Anyways, aside tax, I've mentioned other ways the masses in my society are benefiting from gambling casinos , and gambling in general.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "August 05, 2023, 06:54:03 PM",
      "body": "Quote from: Beparanf on August 05, 2023, 04:29:03 PMIn our country, Our lottery use the proceeds to donate on the health center that provides free health service to our citizens.Even if gambling commonly view as negative by commoner. Many didn't notice how big is the contribution of gambling to the society.Lottery and Gambling are close but there are still differences between them. Asides taxes paid by gambling operators and casino owners to the government which benefits them, there is little benefit. In gambling mostly, the gambler plays against the gambling house who hope to make profit from their loss. But in lottery, it is not as regular as gambling and people compete against themselves for a price, that is why the proceeds from it can be invested into the country. You can hear government lottery, but not government gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "August 05, 2023, 07:06:26 PM",
      "body": "Quote from: Stepstowealth on August 05, 2023, 06:54:03 PMLottery and Gambling are close but there are still differences between them. Asides taxes paid by gambling operators and casino owners to the government which benefits them, there is little benefit. In gambling mostly, the gambler plays against the gambling house who hope to make profit from their loss. But in lottery, it is not as regular as gambling and people compete against themselves for a price, that is why the proceeds from it can be invested into the country. You can hear government lottery, but not government gambling. It seems that in your statement, there is an opinion that the lottery benefits society more, as its proceeds can be invested in the country, while gambling might have less benefit beyond taxes. Right? However, could factors like social consequences and potential issues associated with gambling be taken into account when comparing these two forms of entertainment?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "August 05, 2023, 07:14:10 PM",
      "body": "Quote from: internetional on August 05, 2023, 07:06:26 PMQuote from: Stepstowealth on August 05, 2023, 06:54:03 PMLottery and Gambling are close but there are still differences between them. Asides taxes paid by gambling operators and casino owners to the government which benefits them, there is little benefit. In gambling mostly, the gambler plays against the gambling house who hope to make profit from their loss. But in lottery, it is not as regular as gambling and people compete against themselves for a price, that is why the proceeds from it can be invested into the country. You can hear government lottery, but not government gambling. It seems that in your statement, there is an opinion that the lottery benefits society more, as its proceeds can be invested in the country, while gambling might have less benefit beyond taxes. Right? However, could factors like social consequences and potential issues associated with gambling be taken into account when comparing these two forms of entertainment?They are both under the gambling category and I think he is pertaining to the casino instead of gambling to compared on lottery by means of tax benefits. Lottery is being played national so there’s really a huge difference with the revenue and benefits but still both are same purpose of entertainment and they are not different to each other because both involved betting of money. They only differs on who operates it and whatythe coverage audience of the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "August 05, 2023, 07:44:32 PM",
      "body": "Quote from: Beparanf on August 05, 2023, 04:29:03 PMEven if gambling commonly view as negative by commoner. Many didn't notice how big is the contribution of gambling to the society.What is the benefits of gambling to your society?Despite the negative aspect that contributions have been on gambling addiction, I see it as guide or suggestions to help each other on the forum regards to people over budgeting on it and having irresponsible ways of going on it. Most contributions have been on gambling responsibly.However, I can't say vividly what the government where I domicile do with gambling proceed or tax collected but I know few people that have benefited alot from gambling. Apart from big wins like $15,000 from someone who used part of it to buy land, car, other youths do benefit from time to time even though part of the money is used to gamble when they don't manage it well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cling18",
      "created_time": "August 05, 2023, 07:57:58 PM",
      "body": "Gambling specifically charity sweepstakes has been playing a big role in our society for a long time now. Since I was a little kid, it's already known for helping the poorest of the poor sector especially in the medication and scholarship program for the less fortunate members of the community.Many might see gambling as a negative thing but it has also been helping a lot of people in other ways too. Not all gambling companies do the same but I'm glad that there are still a few especially local companies that share a small portion for charities. We know that it isn't their responsibility but it shows that gambling could still be a helping hand to less fortunate in some other ways.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}