{
  "id": "topic_5447717",
  "title": "CryptoHFs",
  "author": "CryptoHFs",
  "created_time": "April 05, 2023, 08:15:31 PM",
  "content": "if the bitcoin transaction didn't get approved in two weeks for example what happens?if you don't need to pay more fees to make it fasterin terms of your side you can wait only?in terms of miners, can they refuse to process the transaction? forever? what happens in that case?would unconfirmed transactions still appear on blockchain explorers? https://cointelegraph.com/explained/why-is-my-bitcoin-transaction-unconfirmed",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447717",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "April 05, 2023, 08:27:21 PM",
      "body": "Do not let your transaction to remian unconfirmed if you do not want to, make use of wallets that support opt-in RBF to pump the fee. You can read this: Bitcoin open source wallets that support replace-by-fee (RBF)By default, on Bitcoin Core, the transaction should leave the mempool in two weeks. But some nodes can differ, while node runners can change the days by themselves. So likely expect the transaction to leave the mempool in a way that you can rebroadcast the transaction. But I would not totally agree on that because your wallet may be rebroadcasting the transaction, or the transaction do not leave all nodes.You may just have to wait until the mempool is no more congested and the fee priority decreases, or you can use CPFP, but the best to unstuck such transaction is to pump the fee if flagged to support RBF.Quote from: CryptoHFs on April 05, 2023, 08:15:31 PMwould unconfirmed transactions still appear on blockchain explorers? https://cointelegraph.com/explained/why-is-my-bitcoin-transaction-unconfirmedBlockchain explorers are like nodes run by third parties, so if the transaction leave the node that the blockchain explorer uses, you will no more see the transaction on the particular blockchain explorer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "April 05, 2023, 08:29:43 PM",
      "body": "Quote from: Charles-Tim on April 05, 2023, 08:27:21 PMDo not let your transaction to remian unconfirmed if you do not want to, make use of wallets that support opt-in RBF to pump the fee. You can read this: Bitcoin open source wallets that support replace-by-fee (RBF)By default, on Bitcoin Core, the transaction should leave the mempool in two weeks. But some nodes can differ, while node runners can change the days by themselves. So likely expect the transaction to leave the mempool in a way that you can rebroadcast the transaction. But I would not totally agree on that because you wallet may be rebroadcasting the transaction, or the transaction do not leave all nodes.You may just have to wait until the mempool is no more congested and the fee decrease, or you can use CPFP, but the best to unstuck such transaction is to pump the fee.Quote from: CryptoHFs on April 05, 2023, 08:15:31 PMwould unconfirmed transactions still appear on blockchain explorers? https://cointelegraph.com/explained/why-is-my-bitcoin-transaction-unconfirmedBlockchain explorers are nodes, so if the transaction leave the node that the blockchain explorer uses, you will no more see the transaction on the particular blockchain explorer.the main goal is to never pump the feein that case I should launch a mining machine and mine my own transactions?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "April 05, 2023, 08:34:06 PM",
      "body": "Quote from: CryptoHFs on April 05, 2023, 08:29:43 PMthe main goal is to never pump the feein that case I should launch a mining machine and mine my own transactions?Miners can include the transaction of their choice regardless of the fee used, but this is pertaining to solo miners or if you control a mining pool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "April 05, 2023, 08:35:44 PM",
      "body": "Quote from: Charles-Tim on April 05, 2023, 08:34:06 PMQuote from: CryptoHFs on April 05, 2023, 08:29:43 PMthe main goal is to never pump the feein that case I should launch a mining machine and mine my own transactions?Miners can include the transaction of their choice regardless of the fee used, but this is pertaining to solo miners or if you control a mining pool.thanks a lotif a transaction amount is 1 sat and fee is set to 1 sat how long would my miner take to process it?is the maximum daily transactions 400k or what's the current blockchain capability?https://www.statista.com/statistics/730806/daily-number-of-bitcoin-transactions/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "April 05, 2023, 09:01:07 PM",
      "body": "Quote from: CryptoHFs on April 05, 2023, 08:35:44 PMif a transaction amount is 1 sat and fee is set to 1 sat how long would my miner take to process it?First of all note that you can't make a bitcoin transaction sending 1 satoshi. Such an output would be considered as dust and nodes would reject your transaction. For a legacy output, the dust limit is 546 satoshi and for a segwit output, the dust limit is 294 satoshi.Secondly, the confirmation time doesn't depend on the amount your set at all. Miners prioritize transactions based on their fee rate (sat/vbyte). So, the confirmation time depends on the fee rate you used for your transaction and how congested the network is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "April 05, 2023, 09:19:08 PM",
      "body": "Quote from: hosseinimr93 on April 05, 2023, 09:01:07 PMQuote from: CryptoHFs on April 05, 2023, 08:35:44 PMif a transaction amount is 1 sat and fee is set to 1 sat how long would my miner take to process it?First of all note that you can't make a bitcoin transaction sending 1 satoshi. Such an output would be considered as dust and nodes would reject your transaction. For a legacy output, the dust limit is 546 satoshi and for a segwit output, the dust limit is 294 satoshi.Secondly, the confirmation time doesn't depend on the amount your set at all. Miners prioritize transactions based on their fee rate (sat/vbyte). So, the confirmation time depends on the fee rate you used for your transaction and how congested the network is. the scenario we are talking about here is: I own the mining machine.Do you mean that even if I own the mining machine I still can't process my 1 satoshi transaction with 1 sat fees? and the transaction minimum is as you mentioned?if I can process as I own the mining pool, can explorers hide the transaction or would still appear?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "April 05, 2023, 10:28:49 PM",
      "body": "Quote from: CryptoHFs on April 05, 2023, 09:19:08 PMDo you mean that even if I own the mining machine I still can't process my 1 satoshi transaction with 1 sat fees? and the transaction minimum is as you mentioned?If you are miner and you can mine a block, you can include such a transaction and there is nothing preventing you from doing that. Dust limit is not a consensus rule and any node can have its own dust limit. The amount I mentioned above are set by default. Note that miners are free even to include transactions not paying any fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "April 05, 2023, 10:30:01 PM",
      "body": "perfecto! thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}