{
  "id": "topic_5471598",
  "title": "Yamane_Keto",
  "author": "Yamane_Keto",
  "created_time": "October 25, 2023, 10:43:19 AM",
  "content": "Anti-money laundering (AML) regulations play a vital role in financial systems and combating organized crime, which has led to the emergence of advances in learning algorithms show great promise for the AML toolkitsThe data showed that the volume of illegal transactions:source https://amlcrypto.ioHowever, I find that the AML score gives different and varied results from one service to another. Are these results accurate, especially since most of them are generated by artificial intelligence? Can it be relied upon to bring charges or acquit people, since they may lead to criminal charges, or is this not possible as they are based on random results or inaccurate.Some experimental results:https://arxiv.org/pdf/1908.02591.pdf (It is true that the results of the experiment are from 2019, and artificial intelligence algorithms have evolved, but I did not find a more recent experiment)",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471598",
  "comments": [
    {
      "author": "Dunamisx",
      "created_time": "October 25, 2023, 12:01:57 PM",
      "body": "Can individuals fight against the government and be successful, even if the answer is yes then it takes grace and lots of efforts, if you think you're not interested in having any AML issues then try to go for your best privacy practice with your bitcoin or organization, it's only when one knows about your worth and personal informations that they can use such in tracking you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 25, 2023, 12:17:22 PM",
      "body": "The AML reports on bitcoin address are ambiguous, i requested some days ago a report over my public address:  AML report This address has only received incomes from the Campain of Yo! mixThere are two exchange records, one with 58.3 marked as trusted source and other with 15.5% marked as suspicious. Maybe the second doesn't have implemented KYC or something like that.So at this point i don't know if cash that balance through a CEX or not.By the way why is this topic on Service Board?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "October 25, 2023, 12:41:04 PM",
      "body": "Quote from: Yamane_Keto on October 25, 2023, 10:43:19 AMHowever, I find that the AML score gives different and varied results from one service to another. Are these results accurate, especially since most of them are generated by artificial intelligence? Can it be relied upon to bring charges or acquit people, since they may lead to criminal charges, or is this not possible as they are based on random results or inaccurate.When dealing with the law they should not just be satisfied with AI results, because law enforcement will ask for details and accuracy will be assessed in court.I saw their preferences on other pages, they claim many times to be a certified company and have specialists (human) in the field of investigations.Quote from: albert0bsd on October 25, 2023, 12:17:22 PMBy the way why is this topic on Service Board?They're paid intelligence services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "October 25, 2023, 07:44:12 PM",
      "body": "Nobody can give us the accurate number cause this involves unaccounted funds for transactions so since the emergence they will never go into any books the officials may find traces here and there but nobody knows how deep the rat hole is.I can list some of the names but I never know their accuracy level too so will track this thread if someone related to that field can make a comment on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "October 25, 2023, 09:58:54 PM",
      "body": "The Risk/AML score is just bullshitIt's a tool used by Governments and centralized exchanges to attempt to bring censorship to Bitcoin and try to control how you spend your coins.The US Dollar and other fiat currencies around the world have been used for far worse crimes even to this date. Why haven't we seen this AML score service been used for such currencies even after all that time? Because they simple just hate Bitcoin and want to discourage people from using it, so they start labeling it in different forms \"risky Bitcoin\" \"clean Bitcoin\" etc",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 25, 2023, 11:27:38 PM",
      "body": "Quote from: Yamane_Keto on October 25, 2023, 10:43:19 AMHowever, I find that the AML score gives different and varied results from one service to another. Are these results accurate, especially since most of them are generated by artificial intelligence? Can it be relied upon to bring charges or acquit people, since they may lead to criminal charges, or is this not possible as they are based on random results or inaccurate.Here is a proposal to make senseless of these AML bots, specially created with the help of AI.It is necessary to create several Anti-AML bots (with the help of AI, of course). Their basic function would be to check the validity of the results of AML bots and the algorithms by which they make calculations. And based on that they give them a score rating.Then, for example, AMLbot gets a rating of 2.6 out of 10 or amlcrypto.io get 4.2 out of 10.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 26, 2023, 12:34:33 AM",
      "body": "Quote from: JeromeTash on October 25, 2023, 09:58:54 PMThe Risk/AML score is just bullshitIt's a tool used by Governments and centralized exchangesI totally agree with you, but just think in this, there are member in this forum on signature campaigns that need some income and they need to cashout that money to use in a daily basic spends. I hope none of them have problems by sending  their balances to those CEX.I've reading a lot histories of people who get their balance frozen for months.In conclution if yuo aren't going to cashout your crypo then you don't need to worried about AML reports, but if you need to cash it out badly then you need to try to check that balance before get it frozen on those Exchanges",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 26, 2023, 01:57:59 AM",
      "body": "No, this isn't accurate, but I don't think such data provided by bots are acceptable in courts to either indict individuals or acquit them. What I find extremely unfair and troubling though is when centralized exchanges lock accounts, disable functions, or freeze funds citing AML reasons but not providing details because of confidentiality of information. These are automated actions triggered by whatever is detected by these unreliable bots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 26, 2023, 04:24:10 AM",
      "body": "Quote from: JeromeTash on October 25, 2023, 09:58:54 PMThe Risk/AML score is just bullshitIt's a tool used by Governments and centralized exchanges to attempt to bring censorship to Bitcoin and try to control how you spend your coins.I totally agree with you, but what would happen if I had a “tainted” currency? I would definitely try either using a mixing service to try to make it better, and this would lead to two values for the same Bitcoin, which means that people would be more committed to clean Bitcoins, which they would definitely get from a central party, and they would try to avoid doing P2P transactions, which means Although Bitcoin is decentralized, the value of centralized clean currencies is higher.It completely destroys the entire philosophy of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 26, 2023, 07:33:07 AM",
      "body": "You should try to avoid putting your own addresses inside these kind of AML checkers, because who knows what the website is going to do with the data you give them. They can collect the address and also your IP, possibly correlate them together, and send them to another server farm for monitoring. It's not a position you want to put yourself in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 26, 2023, 07:38:05 AM",
      "body": "Quote from: albert0bsd on October 25, 2023, 12:17:22 PMSo at this point i don't know if cash that balance through a CEX or not.By the way why is this topic on Service Board?Because I am talking about it as a service and its accuracy. If governments decide to establish a comprehensive and deep regulation, unfortunately, they will depend on these companies that use AI algorithms and employees (I doubt that they have sufficient resources) that decide whether the CEX will accept your currencies or not.So far, I think that its results are random and it is better to avoid any service that relies on such indicators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 26, 2023, 10:17:11 AM",
      "body": "Quote from: Yamane_Keto on October 25, 2023, 10:43:19 AMAre these results accurate, especially since most of them are generated by artificial intelligence? Can it be relied upon to bring charges or acquit people, since they may lead to criminal charges, or is this not possible as they are based on random results or inaccurate.No, they are not accurate at all, and no, they should not be relied on as evidence in any court.Have a read of this thread: https://bitcointalk.org/index.php?topic=5464886.0One of the biggest blockchain analysis companies in existence - Chainalysis - has had to say in court multiple times that they have absolutely zero scientific evidence to back up any of their analysis techniques, and has absolutely no data on the accuracy of their techniques, how many false positives they identify, or indeed any proof whatsoever that their results are anything beyond guesswork. Blockchain analysis is a sham, and they've admitted it in court. It is not evidence based. See this post of mine from the above thread:Quote from: o_e_l_e_o on August 29, 2023, 08:11:21 AMI did a small experiment some time ago regarding blockchain analysis: https://bitcointalk.org/index.php?topic=5395035.msg59905002#msg59905002One particular piece of blockchain analysis software put a significant amount of coins in the wallet of various centralized exchanges in one of the categories of scams, hacks, or blacklists. Obviously the blockchain analysis software being used by these exchanges did not classify these coins in this manner, otherwise they wouldn't have accepted those coins. The fact that two different pieces of software can come to completely different conclusions about the exact same coins should be more than enough to tell you that blockchain analysis is made up trash.One of the core principles of any piece of science is that its results are repeatable and independently verifiable. If I come up with a process to say, isolate gold from an alloy, then I publish my methods and other people perform the same steps, end up with the same results, and verify my process works. If I come up with a process to say some coins are tainted, and other people do the same thing and end up with completely different results, then my process is bullshit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "October 26, 2023, 10:25:57 AM",
      "body": "Quote from: Yamane_Keto on October 25, 2023, 10:43:19 AMHowever, I find that the AML score gives different and varied results from one service to another. Are these results accurate, especially since most of them are generated by artificial intelligence? Can it be relied upon to bring charges or acquit people, since they may lead to criminal charges, or is this not possible as they are based on random results or inaccurate.I doubt it's accurate when big company such as Chainanalysis known to never review/analyze how accurate is their service. Anyway not only the AI is different, each company have it's own way to find and collect additional data to be fed on their AI. Without any explanation or proof how certain address is, IMO nobody should rely on them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "October 26, 2023, 02:26:01 PM",
      "body": "I think if you file a fake report about Bitcoin address related to scam or any illegal activity in any sites e.g. bitcoinabusep, bitcoinwhoswho etc. Then you try to search the risk/AML score using that address, you would see the result of address is associated with the reason that you created the fake report. So it's easy to manipulate it, I don't think we need to check the risk/AML score when we're want to receive or trade, especially using P2P no KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 27, 2023, 06:27:45 AM",
      "body": "Steps to control the populace:Create a company that claims they can analyze and de-anonymize the blockchain.Include their software in centralized exchanges.Make their work even more convincing now that they possess KYC data. Pay the exchange operators to rely on that software.Spread the notion that coins are categorized to \"clean\" and \"tainted\".Portray yourself as the gatekeeper to naming coins like that.Currently we're at ingenious step 7 which is issuing a bill that forces everyone to use a KYC, regulated centralized exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "October 27, 2023, 05:30:24 PMLast edit: October 27, 2023, 06:52:39 PM by albert0bsd",
      "body": "Quote from: BlackHatCoiner on October 27, 2023, 06:27:45 AMCurrently we're at ingenious step 7 which is issuing a bill that forces everyone to use a KYC, regulated centralized exchange. damn, we need to urge to our acquaintances to start to use its own non-custodial wallet.The last weekend i teach to my brothers to use electrum, I send them some mBTC we play a little with it, also we start to playing cards and make some bets with amounts of 10000 sats, that was a little funnyQuote from: Apocollapse on October 26, 2023, 02:26:01 PMI don't think we need to check the risk/AML score when we're want to receive or trade, especially using P2P no KYC.Agree with you, as i write before that maybe only be necessary if you want to cash out that balance through some CEX, but only if you have some suspicious about the source of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "October 27, 2023, 07:09:03 PM",
      "body": "This statistics is so funny. So, almost 98 coins from 100 are used to either scam, steal or are used on darknets? And those 2 coins are either sanctioned or victim of malware.This is pure bullshit! Blockchain analysis companies are pure bullshit! Bitcoin is used mostly by normal people but problem is that criminals, bad businessmen and government elites have a lot of money and more money is used in illegal activities because of that, simply, they own more money than the rest of the society.Blockchain analyses companies want to eliminate bitcoin, that's why they are implementing AML scores. We know that blockchain analyses companies aren't capable to detect whether transaction comes from criminals or not, they only speculate it and are far from reality. Blockchain analyses give green light to every bitcoin transaction that comes and goes from centralized exchanges and financial institutes, they treat many other transactions with unfair judgement. This is all done to eliminate bitcoin usage and make their shitcoins popular and more widespread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 28, 2023, 02:57:32 AM",
      "body": "Quote from: shield132 on October 27, 2023, 07:09:03 PMThis statistics is so funny. So, almost 98 coins from 100 are used to either scam, steal or are used on darknets? And those 2 coins are either sanctioned or victim of malware.This is pure bullshit! Blockchain analysis companies are pure bullshit! Bitcoin is used mostly by normal people but problem is that criminals, bad businessmen and government elites have a lot of money and more money is used in illegal activities because of that, simply, they own more money than the rest of the society.I'm afraid this is even wrong and unfair. This is almost agreeing to the wrong analyses. It's like saying there are more good people than bad people who use Bitcoin, but most Bitcoin are used by bad people. Or the majority of Bitcoin transactions are good transactions but the majority of Bitcoin are used in illicit transactions. I suppose these are both false. Incidentally, a similar issue about false blockchain analyses data regarding the use of crypto by terrorist Hamas have become a topic since Angus Berwick and Ian Talley of the Wall Street Journal wrote a couple of articles, Hamas Militants Behind Israel Attack Raised Millions in Crypto and Why Hamas Uses Crypto to Raise Money, which irresponsibly, or rather ignorantly, used and misinterpreted blockchain figures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "October 30, 2023, 12:29:33 PM",
      "body": "Quote from: Darker45 on October 28, 2023, 02:57:32 AMThis is almost agreeing to the wrong analyses. It's like saying there are more good people than bad people who use Bitcoin, but most Bitcoin are used by bad people.I haven't said that I agree with analyses but I'm really mean it when I say that there are more good people than bad people who use bitcoin. Don't you really think that's real? I don't think their calculation of number of coins used for bad activity is correct, that's probably wrong because they often fail with the correctness of their AML score and we don't exactly know how they mark coins bad and wrong. Probably, every coin that went through mixer is marked as bad by them and that gives us a very unfair result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}