{
  "id": "topic_5420188",
  "title": "stompix",
  "author": "stompix",
  "created_time": "November 09, 2022, 05:16:43 PMLast edit: May 20, 2023, 07:25:07 PM by stompix",
  "content": "I probably don't have to make a recap of the events, we all know, shit hit the fan again just like Celsius, just like Terra, just like Mt Gox, and just like the not yet launched CEX that will run out of your money in ten years from now.I know we have tons of topics about \"not your keys, not your coins\" but I want to point out that not only do some forget this, but they also fall for tricks with guarantees about their funds and just look how gullible some people are, and how some are clapping and liking this crap:Terra tried a token that was backed by printing more money to buy coins that will back their coins, now CZ, the master liar when it comes to volume, regulation, or where Binance is licensed (if at all) tries to reassure you that your funds are SAFU, your Bitcoins and $ are SAFU because he has 700 million of tokens he has printed himself! To make people understand, just BNB has lost in a matter of hours 4 billion in valuation, yet he guarantees all your funds, all your stable coins are safe because he has 1 billion in shit tokens to prop it up!A coin backed by a token that is backed by a tweet claiming that those are indeed available funds is not a stablecoin.252,597 BTC backed by 16,277 BTC are not SAFU!Deposits claimed to be in the tens of billion can't be backed by 1 billion in shitcoins! Trusting these guys with your coins is just giving them more power and nothing else, this is no FDIC, just tweets!I know that for traders it's impossible to use anything other than CEX, if you want to trade every second every hour, set up trades 2 days from now or at certain prices that's the only way to do it, but for the others, CEX are not meant to be your bank! You are!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420188",
  "comments": []
}