{
  "id": "topic_5484549",
  "title": "headingnorth",
  "author": "headingnorth",
  "created_time": "February 08, 2024, 07:46:40 PM",
  "content": "In the US you always see stories in the media about people having their accounts frozen for no reason, or people losing money to bank fraud and scams, etc. The 2008 financial crisis involved the biggest banks in the United States going under or getting bailed out with taxpayer dollars.In more recent times major regional banks like Silicon Valley Bank and others have imploded and there appears to be another serious banking crisis on the horizon according to many.But I never heard anything about credit unions having such problems. Why is that? I do not trust the big banks but still use Chase for much of my day to day banking only because it is more convenient. But most of my savings are in my credit union or invested in bitcoin.I will be using my credit union much more in the future. Seeing literally hundreds of media reports on Youtube in the last few months about people losing money at their bank from fraud or having their accounts frozen for no reason is scaring me. Why are the big banks so corrupt and incompetent?https://cointelegraph.com/news/saturday-night-live-pokes-fun-trump-debanking-no-joke",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5484549",
  "comments": [
    {
      "author": "thecodebear",
      "created_time": "February 08, 2024, 08:35:23 PM",
      "body": "I believe credit unions are actually non-profit organizations, while banks are for-profit corporations.  So banks are gonna take bigger risks with people's money because their goal is profit.Basically credit unions' goal is to provide the best financial services for customers, while banks goal is to make as much money off their customers as they can. Thus banks are far more likely to do risky things with people's money and end up collapsing in their pursuit of profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "February 08, 2024, 09:35:01 PM",
      "body": "That makes sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ArikeTobi",
      "created_time": "February 08, 2024, 09:55:54 PM",
      "body": "Quote from: headingnorth on February 08, 2024, 07:46:40 PM Why are the big banks so corrupt and incompetent?And why do we think that the small credit unions as you called them aren't corrupt also as the financial banks, is it because they often take it slow and steady on us regarding kyc or because the are more user friendly to us than the complex financial institutions, most of these fintechs, money creditors and borrowers we are seeing charges more than the big coperate financial institutions bill on us, but we we seems to be more focused on one side forgetting to relate them together with each other to know which pays.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "February 08, 2024, 10:08:54 PM",
      "body": "In my country, banks are suffering greatly, and several banks may declare bankruptcy at any time. But I haven't heard any credit unions suffer in my country either. So far, I know there aren't many credit unions in my area. So we were forced to use banking services. From the investigation, law enforcement found that a lot of corruption is responsible for the distress. So in credit unions, there is likely not much corruption since they are nonprofit organizations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "February 08, 2024, 10:35:06 PM",
      "body": "Quote from: thecodebear on February 08, 2024, 08:35:23 PMI believe credit unions are actually non-profit organizations, while banks are for-profit corporations.  So banks are gonna take bigger risks with people's money because their goal is profit.Credit unions have better respect for their customers and their deposits, they have their customers benefit as their first priority not profit hence will ensure that the safety of their customers is not second guessed. If you take a loan from a credit union, it is safer for you because they actually give you the loan to help you not to make profit really from it, so their interest rates is very low, why not free? ( someone may ask) and why are their services not entirely fee free,  it is because they still require some money to settle operational cost.Credit unions are recommended but the drawback is that they are not everywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "February 09, 2024, 06:34:45 AM",
      "body": "Quote from: headingnorth on February 08, 2024, 07:46:40 PM Why are the big banks so corrupt and incompetent?This is a big question that ordinary guys like us maybe hard to answer. I would guess that big banks can be so corrupt is because they are just working for money...the more money they can get the better it would be for them and their stakeholders. In other words, there is no involvement with the people or those they are servicing, in the firs place. They are allowing greed to come in and be the center of them all. As shown in the past, the government is very much willing to bail them out so they are now taking excessive risks because they are sure of support once something can really go wrong big time. Now, the mindset can be so different for credit unions. Here in my country, we don't have credit unions but we have credit cooperatives which have similarities in concept, design and implementation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "February 09, 2024, 08:22:56 AM",
      "body": "It doesn't mean credit unions can't fail, read this article https://www.bankrate.com/banking/credit-unions/list-of-failed-credit-unions/Either it's non profit or profit organizations, regardless it's controlled by one person or few people, it's still centralized. You need to hope the whales in your credit union didn't cancel or close their membership, it will cause a big problem, just like banks that don't allow the whales to withdraw a big amount of money in short time.To overcome the risk of centralization, the answer is Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "February 09, 2024, 08:43:50 AM",
      "body": "Because credit union tend to be risk averse than Banks While Banks are profit oriented which makes them enter relatively risky investment but credit union as a non profit organization are not pressured to make huge profit thus their low risk rate in investing. Issues still arise in credit union since at the end it's still centralized Members can lost their funds due to the incompetence or stealing of the Head (Chairman). Is not that Banks are incompetent, their investments like government bonds are the like are usually affected by Government policy. This can be seen by Silicon Valley bankruptcy where government increased rate and people migrated from their old bond to a newer one. This affected their asset in relation to liability and had to file for bankruptcy. In summary, Like banks they have their element of risk since they are centralized but unlike banks their drive to make profit is lower.So using Bitcoin and a credit union account is good since Fiat is still needed in our current centralized system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "February 09, 2024, 09:21:38 AM",
      "body": "Quote from: The Cryptovator on February 08, 2024, 10:08:54 PMIn my country, banks are suffering greatly, and several banks may declare bankruptcy at any time. But I haven't heard any credit unions suffer in my country either. So far, I know there aren't many credit unions in my area. So we were forced to use banking services. From the investigation, law enforcement found that a lot of corruption is responsible for the distress. So in credit unions, there is likely not much corruption since they are nonprofit organizations.Banks and credit unions offer different services, therefore one might have to use both services. Although banks charge higher for services and give lesser interest for deposits or savings accounts and higher interest for loans, they provide more services, have more branches and give multiple payment options. Credit Unions cannot replace banks because the former is limited in its services. You are correct that there will be less corruption in credit unions because members have access to the financial standings of the union.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "February 09, 2024, 09:43:44 AM",
      "body": "Quote from: headingnorth on February 08, 2024, 07:46:40 PMIn the US you always see stories in the media about people having their accounts frozen for no reason, or people losing money to bank fraud and scams, etc. The 2008 financial crisis involved the biggest banks in the United States going under or getting bailed out with taxpayer dollars.In more recent times major regional banks like Silicon Valley Bank and others have imploded and there appears to be another serious banking crisis on the horizon according to many.To be honest with you. The issue of a serious bank crisis just started and there's more to come so brace yourself for safety alternatives.Many people may seem not to understand the reason why BlackRock, Fidelity, and others file for spot ETF was the purpose of moving to alternative safety which is a cryptocurrency because they know the issue with banks in the future is inevitable and it will get worse.Quote from: headingnorth on February 08, 2024, 07:46:40 PMBut I never heard anything about credit unions having such problems. Why is that? You will never issue like that with Credit Unions due to their mode of operations. Credit Unions always reinvest almost all their profit back into the product they offer to make flourish while Banks only focus on making a profit and sharing with their shareholders and all the parties involved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 09, 2024, 10:38:40 AM",
      "body": "Quote from: headingnorth on February 08, 2024, 07:46:40 PMBut I never heard anything about credit unions having such problems. Why is that? credit unions are not big businesses with large customers. so you dont hear about it in media.... but (5 second google search later)Quote from: https://www.fca.org.uk/news/news-stories/6-towns-credit-union-enters-administration6 Towns Credit Union Limited was placed into administration on 5 September 2023 and has now stopped trading. James Sleight and Peter Hart of PKF Geoffrey Martin & Co have been appointed as joint administrators.Quote from: https://www.bankrate.com/banking/credit-unions/list-of-failed-credit-unions/Inter-American Federal Credit Union, Brooklyn, NY    03/08/2023    ClosedO. F. Toalston Federal Credit Union, Logan, WV    11/15/2022    ClosedMingo County Education Federal Credit Union, Williamson, WV    11/15/2022    ClosedPaducah Teachers Federal Credit Union, Paducah, KY    09/30/2022    ClosedEmpire Financial Federal Credit Union, New York, NY    03/04/2022    ClosedPortsmouth Schools Federal Credit Union, Portsmouth, VA    12/30/2021    ClosedC O Federal Credit Union, Charleston, SC    09/17/2021    ClosedDefense Logistics Federal Credit Union, Dover, NJ    07/01/2021    ClosedIndianapolis Newspaper Federal Credit Union, Indianapolis, IN    03/31/2021    ClosedIBEW Local Union 712 Federal Credit Union, Beaver, PA    05/29/2020    ClosedCBS Employees Federal Credit Union, Studio City, CA    03/29/2019    ClosedRadio, Television and Communication Federal Credit Union, Staten Island, NY    10/12/2018    ClosedLOMTO Federal Credit Union, Woodside, NY    09/30/2018    ClosedMelrose Credit Union, Briarwood, NY    08/31/2018    ClosedGreater Christ Baptist Church Credit Union, Detroit    07/31/2018    ClosedLouisville Metro Police Officers Credit Union, Louisville, Kentucky    06/29/2018    ClosedFirst Jersey Credit Union, Wayne, NJ    02/28/2018    ClosedSt. Elizabeth’s Credit Union, Chicago    01/30/2018    ClosedRiverdale Credit Union, Selma, AL    12/04/2017    ClosedNew York State Employees Federal Credit Union, NY    10/27/2017    ClosedShreveport Federal Credit Union, Shreveport, LA    10/02/2017    ClosedValley State Credit Union, Saginaw, MI    03/31/2017    ClosedFlorida Conference AME Church (FCAMEC) Federal Credit Union, Tallahassee, FL    03/17/2017    ClosedFirst African Baptist Church Federal Credit Union, Sharon Hill, PA    11/29/2016    ClosedServco Federal Credit Union, Bensalem, PA    04/05/2016    ClosedCardozo Lodge Federal Credit Union, Bensalem, PA    04/05/2016    ClosedChester Upland School Employees Federal Credit Union, Chester, PA    04/05/2016    ClosedTriangle Interests % Service Center Federal Credit Union, Bensalem, PA    04/05/2016    ClosedElectrical Inspectors Federal Credit Union, Bensalem, PA    04/05/2016    ClosedO P S EMP Federal Credit Union, Bensalem, PA    04/05/2016    ClosedVeterans Health Administration Credit Union, Detroit    03/29/2016    ClosedEducation Associations Federal Credit Union, Washington, DC    03/04/2016    ClosedMildred Mitchell-Bateman Hospital Federal Credit Union, Huntington, WV    02/24/2016    ClosedCTK Credit Union, Milwaukee    02/05/2016    ClosedFirst Hawaiian Homes Federal Credit Union, Hoolehua, HI    12/29/2015    ClosedBethex Federal Credit Union, Bronx, New York    12/18/2015    ClosedGreater Abyssinia Federal Credit Union, Cleveland    12/01/2015    ClosedHelping Other People Excel Federal Credit Union, Jackson, NJ    11/20/2015    ClosedSWC Credit Union, Tampa, FL    09/24/2015    ClosedSCICAP Credit Union, Chariton, IA    08/28/2015    ClosedLakeside Federal Credit Union, Hammond, IN    07/16/2015    ClosedTrailblazer Federal Credit Union, Washington, PA    07/10/2015    ClosedTLC Federal Credit Union, Tillamook, OR    04/30/2015    ClosedNorth Dade Community Development Federal Credit Union, Miami Gardens, FL    03/31/2015    ClosedAmerican Bakery Workers Federal Credit Union, Philadelphia    01/30/2015    ClosedHealth One Credit Union, Detroit    12/12/2014    ClosedMetropolitan Church of God Credit Union, Detroit    12/03/2014    ClosedCounty & Municipal Employees Credit Union, Edinburg, TX    10/10/2014    ClosedRepublic Hose Employees Federal Credit Union, Youngstown, OH    09/30/2014    ClosedLouden Depot Community Credit Union, Fairfield, IA    09/05/2014    ClosedIBEW Local 816 Federal Credit Union, Paducah, KY    07/10/2014    ClosedLife Line Credit Union, Richmond, VA    05/23/2014    ClosedMayfair Federal Credit Union, Philadelphia    03/31/2014    ClosedParsons Pittsburg Credit Union, Parsons, KA    03/21/2014    ClosedSt. Francis Campus Credit Union, Little Falls, MI    02/14/2014    ClosedPolish Combatants Credit Union, Bedford, OH    11/22/2013    ClosedCraftsman Credit Union, Detroit    09/06/2013    ClosedTaupa Lithuanian Credit Union, Cleveland. OH    07/15/2013    ClosedPEF Federal Credit Union, Highland Heights, OH    07/01/2013    ClosedOchsner Clinic Federal Credit Union, New Orleans    06/28/2013    ClosedNCP Community Development Federal Credit Union, Norfolk, VA    05/31/2013    ClosedElectrical Workers #527 Federal Credit Union, Texas City, TX    05/23/2013    ClosedLynrocten Federal Credit Union, Lynchburg, VA    05/03/2013    ClosedShiloh of Alexandria Federal Credit Union, Alexandria, VA    04/12/2013    ClosedI.C.E. Federal Credit Union, Inglewood, CA    03/15/2013    ClosedPepsi Cola Federal Credit Union, Buena Park, CA    03/15/2013    ClosedAmez United Credit Union, Detroit    02/19/2013    ClosedNew Covenant Missionary Baptist Church Credit Union, Milwaukee    01/07/2013    ClosedChetco Federal Credit Union, Harbor, OR    12/31/2012    ClosedOlean Federal Credit Union, Olean, NY    12/17/2012    ClosedG.I.C. Federal Credit Union, Euclid, OH    12/13/2012    ClosedBorder Lodge Credit Union, Derby, VT    11/30/2012    ClosedWomen’s Southwest Federal Credit Union, Dallas    10/31/2012    ClosedU.S. Central Bridge Corporate Federal Credit Union, Lenexa, KS    10/29/2012    ClosedEl Paso’s Federal Credit Union, El Paso, TX    09/28/2012    ClosedUnited Catholic Credit Union, Temperance, MI    08/09/2012    ClosedA M Community Credit Union, Kenosha, WI    08/01/2012    ClosedWestern Bridge Corporate Federal Credit Union, San Dimas, CA    07/06/2012    ClosedTelesis Community Credit Union, Chatsworth, CA    06/01/2012    ClosedWausau Postal Employees Credit Union, Wausau, WI    05/18/2012    ClosedShepherd’s Federal Credit Union, Charlotte, NC    03/26/2012    ClosedSaguache County Credit Union, Moffat, CO    03/23/2012    ClosedPeople for People Community Development Credit Union (CDCU), Philadelphia    02/19/2012    ClosedEastern New York Federal Credit Union, Napanoch, NY    01/27/2012    Closed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "February 09, 2024, 11:28:28 AM",
      "body": "Big banks often get a bad rap due to their size and involvement in complicated financial stuff which sometimes leads to issues like freezing accounts or being part of financial crises. Media loves to shine a light on their problems, making them seem corrupt or incompetent but credit unions usually steer clear of such messes. Everyone's experience is different so choosing where to bank depends on what matters to you, like trust and convenience",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "February 09, 2024, 07:16:43 PM",
      "body": "The biggest advantage with the major banks is having branches everywhere.But for me that wasn't such a big deal because there are many credit unions in my area and most of them are in the co-op networkwhere you can walk into any credit union regardless of the name and receive services as long as they are in the network.The biggest problem I had was with the ATM machines having limits of how many cash bills you can deposit at a time, usually about 30.Which was a problem for me because I run a business that requires me to deposit a lot more than 30 bills at a time.Not sure why the deposit limits are so low. Every ATM machine I used at a credit union had this restriction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 09, 2024, 07:58:14 PMLast edit: February 09, 2024, 08:09:22 PM by franky1",
      "body": "Quote from: headingnorth on February 09, 2024, 07:16:43 PMNot sure why the deposit limits are so low. Every ATM machine I used at a credit union had this restriction. everything has a costfor a security guy in a secure van to come and empty an ATM costs money, if they have to empty it daily then cost is 7x a weekly emptying visit. which by doing only X bills per customer means that they can control how fast the machine fills up thus reduce cost of emptying is as regularlyif normal people only take out 5 bills and there is a withdrawer 6:1depositor ratio.they dont want more filling up then withdrawing. they want to find the golden ratio to limit securtiy van visits and have a ATM self sustain deposited bills vs withdrawing bills to not need security van visits(there is also some other limitation policies. like risks that some deposit notes might be counterfeit. so limiting deposits limits amounts of fake bills an ATM may end up holding.. ) which can cost the ATM franchise if they hand in fake bills to a bankits the same in retailretailers limit people paying for produce using lots of coinage(nickels&dimes) because a cashier register has a float it has to control to give change but there are costs involved in handling too much coinage. where by if too much coins are in the register and they have to go to a bank to deposit coins. it costs them(there is also some other limitation policies. like risks that some coinage might be counterfeit. so limiting coinage accepted limits amounts of fake coins a cashier may end up holding.. ) which can cost the retailer if they hand in fake coins to a bank",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "February 09, 2024, 10:30:53 PM",
      "body": "Interesting info. Well I guess limiting deposits and having less money on hand makes them a much less attractive target for bank robbers.That explains why the tellers don't work behind plexiglass at most CUs I have been to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "February 09, 2024, 10:47:48 PM",
      "body": "It’s not that big banks are necessarily incompetent but rather the risk they hold is just much higher. Since they are handling multiple accounts in different locations, it might be hard to cater to all of their customers’ needs on a snap of a finger.Meanwhile I am not yet quite convinced about credit unions. Yes, their services are much more personalized and you can easily converse or communicate with them regarding your money however security remains one of my concerns. Credit unions can easily be a fraud. Besides, credit unions are not accesible. Cryptocurrency will be my best bet. It does not involve any third party yet I can access it anywhere depending on the wallet I chose to have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "February 09, 2024, 11:19:46 PM",
      "body": "I was just having this conversation with a client earlier today.  As an advisor I'm constantly telling my clients to use Credit Unions over the big banks (JP Morgan Chase/Bank of America/Wells Fargo etc).  Credit Unions are owned by their own members, therefor they aren't controlled by public stock boards (overlords) and the management team trying to make them happy at any cost.If you're looking for a bank go credit unions and online banks such as Ally.com.  Ally has a 4.35% interest rate on its savings account (no minimums etc).  Chase and Bank of Americas interest rate on savings accounts... .01%.  FUCK big banks.So if you want to buy bitcoin through an ETF and looking to set up an IRA or brokerage account through an advisor, go to an independent firm like Raymond James or Edward Jones (at least here in the United states).If anyone ever has questions regarding finance, I'm happy to help.  It's what I do for a living and enjoy helping others (I will never ask for anything in return).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "February 10, 2024, 12:44:49 AM",
      "body": "Quote from: ChiBitCTy on February 09, 2024, 11:19:46 PMI was just having this conversation with a client earlier today.  As an advisor I'm constantly telling my clients to use Credit Unions over the big banks (JP Morgan Chase/Bank of America/Wells Fargo etc).  Credit Unions are owned by their own members, therefor they aren't controlled by public stock boards (overlords) and the management team trying to make them happy at any cost.If you're looking for a bank go credit unions and online banks such as Ally.com.  Ally has a 4.35% interest rate on its savings account (no minimums etc).  Chase and Bank of Americas interest rate on savings accounts... .01%.  FUCK big banks.So if you want to buy bitcoin through an ETF and looking to set up an IRA or brokerage account through an advisor, go to an independent firm like Raymond James or Edward Jones (at least here in the United states).If anyone ever has questions regarding finance, I'm happy to help.  It's what I do for a living and enjoy helping others (I will never ask for anything in return).I have a high yield savings account with my credit union that pays over 4%. My high yield American Express savings account also pays over 4%.Both have been good at facilitating my bitcoin transactions. No problem with Chase either in terms of funding my bitcoin purchases despite Jamie Dimon's public hostility to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 10, 2024, 04:16:45 AM",
      "body": "4% is not high yield.. unless your a toddler thats only experienced saving/investing in the last 3 yearsfor decades.. a min of 2-3% was just FLAT-RATE to meet inflation. and 4% was like min savings expectation. where 5%-6% was preferred rate.. high yield was more than that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}