{
  "id": "topic_5413333",
  "title": "Majestic-milf",
  "author": "Majestic-milf",
  "created_time": "September 12, 2022, 09:49:17 PM",
  "content": "Dubai, one of the cities in the world renowned for it's luxurious and exotic places and also known to be Bitcoin friendly have opened another exotic resort , Palazzo Versace Dubai, in the upscale part of the Emirates have joined the chain of businesses who now accepts BTC as payment for goods and services. Partnering with the world's largest cryptocurrency exchange, Binance, customers can now pay with BTC and this took effect from Sept 7th and Monther Darwish, MD of Palazzo Versace Dubai believes this act points them in the right direction of being future ready. This move to accepting BTC as payment was influenced by Financial institutions like FTX exchange and Komains which began operations in Dubai and the resort hope to become a hub for digital innovation in the future and this is just a step towards it. https://www.nasdaq.com/articles/luxury-resort-palazzo-versace-dubai-now-accepts-bitcoin",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413333",
  "comments": [
    {
      "author": "KennyR",
      "created_time": "September 12, 2022, 10:25:03 PM",
      "body": "Nowadays similar news are getting to be common, because from the low end of the business have begun to accept cryptocurrencies. From a country like Dubai such an effort is an easy thing, because the government is in support of cryptocurrency usage. Compared to the past the acceptance level have increased and so is the users. The spending have got limited, because people prefer spending when the market is bullish and now it is time to accumulate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "September 13, 2022, 02:38:52 AM",
      "body": "This is another business company that embraces Bitcoin as a payment alternative. We are seeing all kinds of businesses big, medium, and small from all parts of the world that are now realizing Bitcoin's potential. Just days ago, there are posts here of businesses in some parts of Africa that are also accepting Bitcoin payment. Asia, like this one in Dubai, is also where a rising number of businesses are already opening up for Bitcoin. There is clear progress in terms of adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "September 13, 2022, 03:17:59 AM",
      "body": "Quote from: Majestic-milf on September 12, 2022, 09:49:17 PM-snip- This move to accepting BTC as payment was influenced by Financial institutions like FTX exchange and Komains which began operations in Dubai They are partnered with Binance, so the adoption initiative is actually a form of competition between Exchanges. Quote from: https://www.nasdaq.com/articles/luxury-resort-palazzo-versace-dubai-now-accepts-bitcoinThe resort has partnered with Binance, the world’s largest cryptocurrency exchange, enabling its customers to pay with bitcoin. As long as Binance guarantees that bitcoin earnings remain liquid, they will take this adoption even if they don't really care.After all, they have to pay with the binance app, I'm not sure that the payments will be limited to bitcoin only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 13, 2022, 03:28:49 AM",
      "body": "Do we have any data on bitcoin adoption based on industry? I'm going to guess that resorts, hotels, and such are going to get the most bitcoin adoption initially due to the fact that it's the industry with one of the highest amounts of foreign customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "September 13, 2022, 05:32:50 AM",
      "body": "there may be a lot of news like this, it's just that maybe this is one of them that has been exposed, so at least we need good news like this to slowly recover the bitcoin market from adversity",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "P2PECS",
      "created_time": "September 13, 2022, 05:44:44 AM",
      "body": "Quote from: KennyR on September 12, 2022, 10:25:03 PMNowadays similar news are getting to be common, because from the low end of the business have begun to accept cryptocurrencies. Maybe I'm wrong but a priori I would say that the percentage of BTC payments in these luxury sites will be higher than those of the coffee shops, for example, because people with middle and low incomes, if they buy BTC do it as an investment and should not be very likely to partially undo their investment for day to day payments.But in luxury places like Dubai where very rich people can have dozens of BTC just as they have kilos of gold, I think they will be more likely to to pay, especially in a bull market, to realize profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "September 13, 2022, 06:10:49 AM",
      "body": "They are accepting bitcoin as payment to be in talks and attract new customers especially the crypto community because they know the percentage is big so this is their business marketing techniques but it's really good for bitcoin adoption as big hotels do make a impact even if it's little.So this is just the beginning and we will see lot more into this adoption.Quote from: mk4 on September 13, 2022, 03:28:49 AMDo we have any data on bitcoin adoption based on industry? I'm going to guess that resorts, hotels, and such are going to get the most bitcoin adoption initially due to the fact that it's the industry with one of the highest amounts of foreign customers.As per  reports in 2019 there were around 15k businesses accepting bitcoin so the rise in three years would be high as many have jumped into accepting btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "September 13, 2022, 06:17:48 AM",
      "body": "Good news, so, it's going to be a combination of looking for an airline that accepts btc and go to Dubai and also stay on that resort paying with btc if you want to.But honestly, I wouldn't want to spend that much of my bitcoin on extravagant vacation as I just want to hold more of it. And since it has mentioned cryptocurrencies and they will adopt more in the future, if ever I want to spend it, that's what I'll use but not bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 13, 2022, 07:17:52 AM",
      "body": "Quote from: Majestic-milf on September 12, 2022, 09:49:17 PMDubai, one of the cities in the world renowned for it's luxurious and exotic places and also known to be Bitcoin friendly have opened another exotic resort , Palazzo Versace Dubai, in the upscale part of the Emirates have joined the chain of businesses who now accepts BTC as payment for goods and services.I love hearing this kind of news, bitcoin adoption just continues. We have been hearing of this kind of good news some years after bitcoin was created, this is another good one that is pleasing to hear. Also bitcoin utility continues to increase.Quote from: Majestic-milf on September 12, 2022, 09:49:17 PMPartnering with the world's largest cryptocurrency exchange, Binance, customers can now pay with BTC and this took effect from Sept 7th and Monther Darwish, MD of Palazzo Versace Dubai believes this act points them in the right direction of being future ready.But why only Binance? Why the payment in bitcoin is only available for Binance customers? Maybe more options would later be included.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 13, 2022, 07:58:32 AM",
      "body": "Quote from: Majestic-milf on September 12, 2022, 09:49:17 PM Dubai, one of the cities in the world renowned for it's luxurious and exotic places and also known to be Bitcoin friendly have opened another exotic resort , Palazzo Versace Dubai, in the upscale part of the Emirates have joined the chain of businesses who now accepts BTC as payment for goods and services.Noted. That will be useful if I ever go to the UAE.Is there any info on what payment processor they use, like if it's BitPay, Coinbase Commerce or something like that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "September 13, 2022, 04:49:46 PM",
      "body": "Quote from: worle1bm on September 13, 2022, 06:10:49 AMAs per  reports in 2019 there were around 15k businesses accepting bitcoin so the rise in three years would be high as many have jumped into accepting btc.Re-read my response. I was looking for industry-specific data to know which specific industry has more bitcoin adoption, not general business adoption metrics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "September 13, 2022, 06:32:29 PM",
      "body": "As far as I know, Dubai is one of the most powerful countries that allow cryptocurrency and issue licenses as well. Some big exchanges doing business in Dubai by getting a license there. So this isn't surprising to me to allow Bitcoin payment in the resort. No matter whether they are accepting Binance customers lately, it would expand anytime for all crypto users. We can say it's beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dezoel",
      "created_time": "September 14, 2022, 06:14:36 PM",
      "body": "I agree that these places accepting bitcoin is probably a bit more marketing oriented than anything else. I am not saying that they do not care about bitcoin at all, they probably like it and the managers are all in for it, but that doesn't change the fact that 99% of their customers will keep on paying with fiat instead of bitcoin, which leaves that 1% which won't be big enough to change their future. They could have stayed in pure fiat and still do as good as they would normally do.Instead, I believe they started to accept bitcoin because they ended up with something that is news worthy, because if they didn't take bitcoin, how would they be on the news all the way here? It is good marketing if you ask me, gets their name heard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "September 14, 2022, 10:21:17 PM",
      "body": "Quote from: dezoel on September 14, 2022, 06:14:36 PMI agree that these places accepting bitcoin is probably a bit more marketing oriented than anything else. I am not saying that they do not care about bitcoin at all, they probably like it and the managers are all in for it, but that doesn't change the fact that 99% of their customers will keep on paying with fiat instead of bitcoin, which leaves that 1% which won't be big enough to change their future. They could have stayed in pure fiat and still do as good as they would normally do.Instead, I believe they started to accept bitcoin because they ended up with something that is news worthy, because if they didn't take bitcoin, how would they be on the news all the way here? It is good marketing if you ask me, gets their name heard.if nothing else, other than marketing purposes, they are also encouraging locals as well as tourists to use btc as payment method. for sure, at one point someone is willing to pay btc to this establishment. right now, it hits the news stand when a certain institution is deploying btc or crypto in their payment method. so for me, this is a discrete marketing tactic to promote their place other than promoting btc as payment method.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "September 14, 2022, 11:32:34 PM",
      "body": "Quote from: AmoreJaz on September 14, 2022, 10:21:17 PMQuote from: dezoel on September 14, 2022, 06:14:36 PMI agree that these places accepting bitcoin is probably a bit more marketing oriented than anything else. I am not saying that they do not care about bitcoin at all, they probably like it and the managers are all in for it, but that doesn't change the fact that 99% of their customers will keep on paying with fiat instead of bitcoin, which leaves that 1% which won't be big enough to change their future. They could have stayed in pure fiat and still do as good as they would normally do.Instead, I believe they started to accept bitcoin because they ended up with something that is news worthy, because if they didn't take bitcoin, how would they be on the news all the way here? It is good marketing if you ask me, gets their name heard.if nothing else, other than marketing purposes, they are also encouraging locals as well as tourists to use btc as payment method. for sure, at one point someone is willing to pay btc to this establishment. right now, it hits the news stand when a certain institution is deploying btc or crypto in their payment method. so for me, this is a discrete marketing tactic to promote their place other than promoting btc as payment method.For sure its for marketing because maybe they see the demands of the users for this and also a little bit it help for the locals because this will give them another choice where they can use their btc on their locality. Although we know that this is another marketing tactics but for sure it will also caught the attention of other businesses since most provably it can gather more businessmen who's exploring the crypto industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "September 15, 2022, 05:49:08 PM",
      "body": "An addition to the already existing ones, Dubai is known to be crypto-friendly so the news doesn't come as a surprise. The type of place the affluent people would like to spend their btc and get value for it.There is an urgent need for more of this type of place to increase btc usage and spread awareness. I think when people have enough choice on where to spend their btc, it will be beneficial for its growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "September 15, 2022, 11:40:12 PM",
      "body": "These luxury businesses adding cryptocurrency acceptance is a kind of marketing. The company will look to generate some good volume of bitcoin through the acceptance. In the past we've seen many such examples. One major acceptance and soon they ended the service happened with Expedia. Maybe here such scenario won't take place, because Expedia took the decision when the market was very young.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "8rch7",
      "created_time": "September 15, 2022, 11:50:06 PM",
      "body": "Quote from: amishmanish on September 13, 2022, 02:45:20 AMAnother feather in the cap of Bitcoin. While naysayers have been rejecting Bitcoin since inception, Bitcoin is going strong. The next phase of growth of Bitcoin will come from its mass adoption. That's the journey of bitcoin even though there are certain parties who drop bitcoin and post negative things about bitcoin, but bitcoin is still alive and will never die, even though the price is now down but people who understand bitcoin will never be afraid and will invest in bitcoin, because they are still many large companies accept bitcoin and there are also many cafes and restaurants that accept bitcoin payments, so don't be afraid to adopt bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 16, 2022, 09:25:50 AM",
      "body": "Another step of Bitcoin toward global adoption. Time will come we won't anymore be amazed that a resort, coffee shop, grocery store, hotel, and so on is already accepting Bitcoin. On the contrary, it would be confusing if a business is not accepting Bitcoin. And this is the kind of adoption that acknowledges Bitcoin's role as a currency or a payment alternative. To a certain extent, this is better than a private company adding Bitcoin to its balance sheet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}