{
  "id": "topic_5462780",
  "title": "getCryptoAddress",
  "author": "getCryptoAddress",
  "created_time": "August 10, 2023, 10:45:58 AM",
  "content": "Greetings everyone!Get Crypto Address allows you to generate cryptocurrency addresses and create paper wallets. Free. Offline. Open source. We are announcing a beta version and invite you to test it out.Link: https://getcryptoaddress.github.io/ Github: https://github.com/getCryptoAddress/getCryptoAddress.github.ioHere is a fresh alternative to bitaddress> What sets us apart?1. Additional Bitcoin address formats can be produced using this platform:P2PKHP2WPKHTaproot2. We also support Ethereum3. Enables you to craft your own unique design for Paper Wallet> How to make address and Paper Wallet?Below you can find short instructions on how to generate addresses and create Paper Wallet.1. Generate crypto address (Bitcoin or Ethereum)2. Click \"Paper wallet\" if you want to generate image for print3. Click \"Edit\" in \"Paper wallet\" if you want to edit designIn the additional part, before generating a crypto address and paper wallets:- Ensure your computer is secure and free from potential threats- Open the web application in an incognito tab, without browser extensions- Turn off the internet> In the future- Provide an even more range of designs Paper Wallets- More user-friendly editing process- Planning to extend the list of supported currencies- 100% cover testsThis project is open source, and all the code is available for review on GitHub. We warmly welcome you to support the project by contributing to the code or making a donation.Looking forward to your feedback and support.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462780",
  "comments": [
    {
      "author": "getCryptoAddress",
      "created_time": "September 09, 2023, 07:27:48 PM",
      "body": "Sorry guys. I created new topic because I can't remove \"self-moderated topic\" flag in the previous topicUPDATES:- Fixed image generation for IOS and SafariP.s. Eh. Safari is the new modern IE",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "getCryptoAddress",
      "created_time": "November 08, 2024, 10:18:12 PM",
      "body": "Hello everyone!Let me tell you a bit about how this project came to be. Initially, I wanted to understand how crypto works, and, at the same time, I was looking for a unique gift idea for someone. I thought a paper wallet could be a cool, personal way to introduce them to crypto. I came across a site called bitaddress.org, but it used an legacy format, P2PKH, which has higher transaction fees and is somewhat outdated. So, I decided to build my own version — getcryptoaddress.github.io, which supports the newer Taproot standard. Later on, I added support for Ethereum, and even an editor feature… and you know. The project kept growing. And here we are — it works!Right now, this project is just for me. I occasionally use it for my own needs, and about once a month, I log in to check on activity and then log back out. So, if there’s something you’d like to see added, just let me know — I’m open to implementing new features. It will be nice to know that I am not alone Recently, I added a Content Security Policy to the site as a precaution, so that the browser will block any unauthorized requests, scripts, or styles. You never know when something could sneak in through a library. I rarely touch the code, so I also boosted test coverage to make updates less nerve-wracking (I have to admit, I get a bit anxious making changes since I’m a regular user too, haha). I also updated the libraries to the latest versions — well, most of them, anyway!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}