{
  "id": "topic_5531228",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "February 16, 2025, 06:54:40 AM",
  "content": "Where you can click a button on your wallet and place the Btc on hold with regard to a certin currency. Something like a stablecoin without an actual transfer. Then toggle the button back according to the amount of Bitcoin the fiat is worth at that time.Click the button and get a USD connection right in the wallet. Click it again and get Btc at the current price of USD. All based on the funds in your wallet, without a transfer to a USD stablecoin.Save on transfer funds that way.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5531228",
  "comments": [
    {
      "author": "Ambatman",
      "created_time": "February 16, 2025, 07:19:15 AM",
      "body": "Quote from: BADecker on February 16, 2025, 06:54:40 AMWhere you can click a button on your wallet and place the Btc on hold with regard to a certin currency. The only thing I think that comes close to holding  is the Bitcoin script OP _CHECKLOCKTIMEVERIFY that helps a user lock their coins till a certain time in the future or a block height is reached. QuoteWhere you can click a button on your wallet and place the Btc on hold with regard to a certin currency. Something like a stablecoin without an actual transfer. Then toggle the button back according to the amount of Bitcoin the fiat is worth at that time. I don't understand it's there any wallet that don't have this function. Your Bitcoins are showed in both their number of units as well as their corresponding value in a stablecoin usually usdt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "February 16, 2025, 07:23:25 AM",
      "body": "It's kind of similar to staking your BTC but using your holding wallet. Such features would be sick as it would make it easy for a lot of users to swap their coins back and forth without the need of a centralized exchange.Though the reason why I still won't prefer this is that, if we are Bitcoin holders and wish to make more profit on the long-term base, we might miss out on the market. You know how volatile the market is.Let's take for instance, when BTC broke the 90-100k mark, it was so surprising as it happened overnight. Imagine using such features and end up not gaining in the bull? Let's say you had BTC when the price was $48k and you use such features to hold your coin in USDT. Then the price moved from $48k to $100k, you would have missed out on the bull and if you finally unlock your coins back to BTC at $100k, you would have less BTC because it's going to convert back to you at the current market price.Then the reverse would be the case if you use the same feature and the price breaks down on a bear, from $48k to $30k, when you finally convert it back, you would have more BTC worth than you have held. But what's the probability of BTC going down to such a price than moving forward? It might be a nice feature, but I don't think it would be profitable the way you think of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "February 16, 2025, 07:30:35 AM",
      "body": "May I know the relevance? If I were to put my BTC on hold with regard to a certain currency, why wouldn't I hold the amount in that currency instead? If that is for convenience, the ability to shift back and forth to Bitcoin and a certain fiat, I guess we might have regulatory problems in the process. Using a centralized exchange doesn't mean I can use all available fiat it is supporting. If it's simply a toggle function, is that comparable to a swap? At least with a swap function, you have the freedom to choose the specific amount you wish to convert. If you're talking about an instant toggle between fiat and BTC, that sounds a bit disadvantageous for users because (1) you'll have to involve your entire wallet balance and (2) there will surely be a certain spread, which means you just can't shift between the two anytime without possible losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 16, 2025, 08:34:13 AM",
      "body": "Quote from: Darker45 on February 16, 2025, 07:30:35 AMMay I know the relevance? If I were to put my BTC on hold with regard to a certain currency, why wouldn't I hold the amount in that currency instead? If that is for convenience, the ability to shift back and forth to Bitcoin and a certain fiat, I guess we might have regulatory problems in the process. Using a centralized exchange doesn't mean I can use all available fiat it is supporting. If it's simply a toggle function, is that comparable to a swap? At least with a swap function, you have the freedom to choose the specific amount you wish to convert. If you're talking about an instant toggle between fiat and BTC, that sounds a bit disadvantageous for users because (1) you'll have to involve your entire wallet balance and (2) there will surely be a certain spread, which means you just can't shift between the two anytime without possible losses. No transfer fees. Hold the wallet on your desktop. Fast moves. Complete control.Bitcoin only goes up or down. This only moves Bitcoin in or out as you desire.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "February 16, 2025, 08:45:27 AM",
      "body": "Sparrow Wallet partially fit your criteria since it have feature to freeze UTXO. It's not part of Bitcoin protocol, so you can freeze and unfreeze it anytime you want. And FYI, there's no thing such as no transfer/TX fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "promise444c5",
      "created_time": "February 16, 2025, 09:02:55 AM",
      "body": "I still don’t get your point OP, if you don’t want to see the balance of your wallet go down maybe when there’s a dip in the Bitcoin market,then you can just turn off the fiat equivalent display for the UI, almost every wallet should have the feature and if it’s back to a satisfactory level then you can turn it back on..Quote from: ABCbits on February 16, 2025, 08:45:27 AMSparrow Wallet partially fit your criteria since it have feature to freeze UTXO..I think almost every wallet that supports multiple input address can freeze UTXOs, I’m sure of Electrum and Blue-wallet as well..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SilverCryptoBullet",
      "created_time": "February 16, 2025, 10:12:22 AM",
      "body": "Locktime can be used but it is risky and you have to be kind of master technically and have very clear idea on how long you want to lock your bitcoin. It requires you to prepare your finance so good that you will surely not need to sale your bitcoin during lock time.Using Locktime for inheritance planning, backups or gifts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "February 16, 2025, 10:23:48 AM",
      "body": "Quote from: BADecker on February 16, 2025, 08:34:13 AMQuote from: Darker45 on February 16, 2025, 07:30:35 AM~snip~No transfer fees. Hold the wallet on your desktop. Fast moves. Complete control.Bitcoin only goes up or down. This only moves Bitcoin in or out as you desire.It would be nice to have this, but I don't know if this is possible. In the first place, will there ever be a wallet which supports fiat that's completely under your control? I doubt it. At most, you'll have to use a stablecoin. Secondly, will there ever be a crypto-to-fiat conversion and vice versa without any fees to pay or spread to cover? In certain centralized exchanges, there are P2P crypto-to-fiat and vice versa exchange features that have zero fees, except perhaps those that your banks charge you. But you can't have complete control in this setup. In decentralized setups like Bisq, you will pay fees. I guess the function you have in mind isn't existent, at least not yet. But it seems you oversimplify Bitcoin's movements. Even if certain wallets or exchanges support this, it doesn't mean you'll make profit out of Bitcoin's ups and downs and your ability to instantly get in or out of Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 16, 2025, 10:05:19 PM",
      "body": "How does Changelly do their transfers coin to different coin? Can we get it in a desktop wallet... BTC to USDC and back again?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "February 16, 2025, 10:35:44 PM",
      "body": "Quote from: BADecker on February 16, 2025, 10:05:19 PMHow does Changelly do their transfers coin to different coin? Can we get it in a desktop wallet... BTC to USDC and back again? Changelly serve more like a bridge between the wallet and the exchange. It finds the best rate and after converting send to your account. Its possible but not worth the risk because it's the same as having a third party access to your coins.Complexities most times bring about vulnerabilities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "February 16, 2025, 11:16:32 PM",
      "body": "If I understood you right, I think it's not possible on a noncustodial wallet. There has to be a buyer/seller at the other end or a custodial/centralized exchange service integrated in the wallet. So at the end of it all you would have to incur fees (transaction, slippage rates due to spreed and service/trading fees)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "February 16, 2025, 11:23:23 PM",
      "body": "Quote from: BADecker on February 16, 2025, 10:05:19 PMHow does Changelly do their transfers coin to different coin? Can we get it in a desktop wallet... BTC to USDC and back again?You should avoid Changelly, it's KYC exchanger, there have been a lot of scam accusations against them, I wouldn't consider them trustworthy for anything.However, for trading, I would prefer to choose exchange platforms, and wallets are for holding coins. As ABCbits said, you can't avoid the TX fee. Use an application or widget that will send you notifications when Bitcoin reaches a certain value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 17, 2025, 01:48:32 AM",
      "body": "Quote from: examplens on February 16, 2025, 11:23:23 PMQuote from: BADecker on February 16, 2025, 10:05:19 PMHow does Changelly do their transfers coin to different coin? Can we get it in a desktop wallet... BTC to USDC and back again?You should avoid Changelly, it's KYC exchanger, there have been a lot of scam accusations against them, I wouldn't consider them trustworthy for anything.However, for trading, I would prefer to choose exchange platforms, and wallets are for holding coins. As ABCbits said, you can't avoid the TX fee. Use an application or widget that will send you notifications when Bitcoin reaches a certain value.The fees aren't the only problem. Speed of transaction is right up there with the fees.Avoid Changelly. But make a desktop wallet that does the same thing. How?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rustam Meraj",
      "created_time": "February 17, 2025, 02:37:08 AM",
      "body": "This sounds like very useful and money saving feature. Basically you are talking about system inside wallet that lets you temporarily connect value of your Bitcoin to regular currency like USD without actually changing it to stablecoin. With this we protect ourself from big price changes and avoid paying fees to move money around. With clicking button you can easily switch between seeing value of your Bitcoin in Bitcoin or in USD based on current exchange rate. This feature would be especially helpful for people who want to keep track of their Bitcoin in relation to regular currencies without wasting money on unnecessary transfer fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "February 17, 2025, 04:57:45 AM",
      "body": "Quote from: BADecker on February 16, 2025, 06:54:40 AMWhere you can click a button on your wallet and place the Btc on hold with regard to a certin currency. Something like a stablecoin without an actual transfer. Then toggle the button back according to the amount of Bitcoin the fiat is worth at that time.Click the button and get a USD connection right in the wallet. Click it again and get Btc at the current price of USD. All based on the funds in your wallet, without a transfer to a USD stablecoin.Save on transfer funds that way.Well it sure sounds like a nifty little trick if you can manage to figure this out. What would be the purpose of utilizing these features for the sake of my own curiosity? I feel like what you're looking for is the ability to generate smart contracts for a variety of purposes and I believe there are multiple platforms that offer the features you're looking for, good luck with the search m8!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "February 17, 2025, 06:57:36 AM",
      "body": "Quote from: BADecker on February 16, 2025, 06:54:40 AMWhere you can click a button on your wallet and place the Btc on hold with regard to a certin currency. Something like a stablecoin without an actual transfer. Then toggle the button back according to the amount of Bitcoin the fiat is worth at that time.Click the button and get a USD connection right in the wallet. Click it again and get Btc at the current price of USD. All based on the funds in your wallet, without a transfer to a USD stablecoin.Save on transfer funds that way.So you are talking about immediate swap between BTC and stablecoins? This seems like a cool idea, but it doesn't work in reality.Swapping BTC to stablecoins is just selling one crypto for another. Most multi-coin crypto wallets offer such feature, but it is provided by third parties. Exodus wallet has a swapping feature, but AFAIK it's provided by Changelly and some Exodus users aren't happy with this feature.If you are talking about converting BTC to stablecoins WITHOUT an actual transfer, this doesn't make sense to me. You are just measuring the current BTC price in stablecoins. This doesn't change anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "February 17, 2025, 08:07:29 AM",
      "body": "After reading some replies, it's clear OP is talking non-sense again. Comparing non-custodial wallet and custodial wallet is like comparing apples with oranges. I would suggest other reader to see his feedback (including untrusted ones) and put him on ignore.Quote from: promise444c5 on February 16, 2025, 09:02:55 AMQuote from: ABCbits on February 16, 2025, 08:45:27 AMSparrow Wallet partially fit your criteria since it have feature to freeze UTXO..I think almost every wallet that supports multiple input address can freeze UTXOs, I’m sure of Electrum and Blue-wallet as well..It's probably true. But many mobile or closed-source wallet doesn't even have UTXO selection feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "February 17, 2025, 05:49:19 PM",
      "body": "Quote from: ABCbits on February 17, 2025, 08:07:29 AMAfter reading some replies, it's clear OP is talking non-sense again. Comparing non-custodial wallet and custodial wallet is like comparing apples with oranges. I would suggest other reader to see his feedback (including untrusted ones) and put him on ignore.Quote from: promise444c5 on February 16, 2025, 09:02:55 AMQuote from: ABCbits on February 16, 2025, 08:45:27 AMSparrow Wallet partially fit your criteria since it have feature to freeze UTXO..I think almost every wallet that supports multiple input address can freeze UTXOs, I’m sure of Electrum and Blue-wallet as well..It's probably true. But many mobile or closed-source wallet doesn't even have UTXO selection feature.What is UTXO?All I want is a wallet with Bitcoin and USDC... and the ability inside the wallet to switch between the two at will.I'm sure that there are a lot of others who would like this feature, as well.Since Changelly has it one way or another, it shows that it can be done. Maybe it isn't worth the doing. And I am not tech savvy enough to do it. But it is there in Changelly, and probably other swap wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "February 17, 2025, 06:07:49 PM",
      "body": "Quote from: BADecker on February 16, 2025, 06:54:40 AMWhere you can click a button on your wallet and place the Btc on hold with regard to a certin currency. Something like a stablecoin without an actual transfer. Then toggle the button back according to the amount of Bitcoin the fiat is worth at that time..........Okay now basically if I understand what you're trying to say you are looking to create a transaction probably a signed one and then not broadcast it till you are actually ready to make the transaction it's feasible and seems quite similar to Freezing transactions on some wallets.Totally signing and broadcasting a transaction may have fit in too but there are two major setbacks to that one is the fact that the receiving party can also speed up the transaction using CPFP. Also another problem is even if you calculate the time of arrival of that transaction with the current MEMPOOL rates, it wouldn't be accurate since average transaction fees on the mempool are not stable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}