{
  "id": "topic_5463104",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "August 13, 2023, 09:43:28 AM",
  "content": "I just received an email from Coinbase telling me that they noticed some unusual activity on my account and it has been locked.  It went on to ask that I click on a link to pass a security check before my account is unlocked. I knew this was a phishing attempt and I didn't take any action. However, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they really do that? If they don't, how do these hackers know that I have a Coinbase account?If you are newbie and you get this sort of message, do not click the link or attempt to input any personal details. This is also a reminder that if you have your bitcoins on any exchange, it is not yours. Never forget, not your keys, not your bitcoins. Get your bitcoins off exchanges.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463104",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 13, 2023, 09:51:33 AM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMHowever, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they really do that? If they don't, how do these hackers know that I have a Coinbase account?Any body or site or exchange or anything that you give your email or documents to, they can sell it or give it to third party. You can not put the blame on only one exchange. You used the email only on Coinbase to register an account? If you have used it in other sites, the phishing can be coming from the other sites.If other people are not having the complain, likely that the phishing is from other site. We should be careful of our emails and personal documents. This is the reason people are saying we should be careful of KYC. Yours is just email though and we should be careful of where will used our email.Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMIf you are newbie and you get this sort of message, do not click the link or attempt to input any personal details. This is also a reminder that if you have your bitcoins on any exchange, it is not yours. Never forget, not your keys, not your bitcoins. Get your bitcoins off exchanges.It is good to do everything you want to do directly in the exchange unless you requested for the email yourself like authentication email. Not to click the link at all. The link can direct someone to a place he can download malware, asked for seed phrase or other ways to be scammed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Findingnemo",
      "created_time": "August 13, 2023, 09:52:37 AM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMIf they don't, how do these hackers know that I have a Coinbase account?Maybe they don't know at all, they just are sending out mass phishing emails hoping that a percentage of recipients will fall for their trap. But the thing is your email is exposed to scammers by breaching some of the crypto-related services databases or we don't know it may happen with coinbase itself or they just expressed it as you agreed such \"We work with service providers, partners and other third parties to help us provide our Services, and as a result we need to share certain information with these third parties\".https://www.coinbase.com/legal/privacySo it proves why we shouldn't give the email you are using for exchanges to no other service or else it is not going to end in any way.The good thing is you figured out that attack and hopefully every others do the same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "August 13, 2023, 10:15:32 AM",
      "body": "Don't understand estimate hackers, they're one of the most intelligent people, they might know about your Coinbase account or email because most guys who turn out to start scamming are some employees who either wasn't contented with their salaries or greedy guys who left their works for scamming. Maybe the scammer could be a cyber security worker from Coinbase now working as a scammer with many information of people using Coinbase. What am trying to say is our enemy is our friend pointing it to this case of hack is either someone from there office who had information of people is either the  scammer or works with the scammer. No doubt, Speaking from experience. Nowhere is safe enough the good thing is you escaped their traps",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "August 13, 2023, 10:27:43 AM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMI just received an email from Coinbase telling me that they noticed some unusual activity on my account and it has been locked.  It went on to ask that I click on a link to pass a security check before my account is unlocked. I knew this was a phishing attempt and I didn't take any action. However, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they really do that? If they don't, how do these hackers know that I have a Coinbase account?This is definitely a phishing attack attempt, it is usually done when a hacker gets access to your coin base account. This is not usually the selling out of data to hackers by coinbase but it is a breach of their database and the hacker collects the emails of users and sends them phishing emails and through this link they get access to the login details of the user and receive the passcode or 2FA of the account once they get access to the email. This has a happened in 2021 before as reported here. The first phishing link will direct you to a page like the image below telling that your account is been locked. Right now Coinbase hasn’t released any updates of this but it certainly a breach of data. And just like the warning before, do not leave your funds on any exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 13, 2023, 10:30:43 AM",
      "body": "They may or may not be selling your information, but always remember that hackers/scammers can get your email elsewhere. Heck, I frequently receive Coinbase-related phising email even though I don't even have a Coinbase account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Taskford",
      "created_time": "August 13, 2023, 10:33:20 AM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMI just received an email from Coinbase telling me that they noticed some unusual activity on my account and it has been locked.  It went on to ask that I click on a link to pass a security check before my account is unlocked. I knew this was a phishing attempt and I didn't take any action. However, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they really do that? If they don't, how do these hackers know that I have a Coinbase account?If you are newbie and you get this sort of message, do not click the link or attempt to input any personal details. This is also a reminder that if you have your bitcoins on any exchange, it is not yours. Never forget, not your keys, not your bitcoins. Get your bitcoins off exchanges.Usual action done by scammers so if I where you or to those newbies they should never get alerted on those message and verify the email by searching the right mail of coinbase and sender so that we will not fall on any phising attempts they do.Also we need to reach out to their real support by going on their legitimate app to verify if we really get those alerts for sure they would now about that and say its fake email we receive. Receive many attempts like this but never bother to open any single mail sent to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "August 13, 2023, 10:49:13 AM",
      "body": "\"Not your keys, not your coin\" is the main language we are supposed to understand if we really care about our privacy, irrespective of the promises exchanges can make to secure our personal details because they can never be trusted.Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMIf you are newbie and you get this sort of message, do not click the link or attempt to input any personal details. This is also a reminder that if you have your bitcoins on any exchange, it is not yours. Never forget, not your keys, not your bitcoins. Get your bitcoins off exchanges.This advice is not only for newbies but a general reminder for all. Now that halving is approaching, many people will start to venture into crypto investment, even those that have no knowledge about bitcoin or cryptocurrency. Therefore,  it is very important to secure our privacy by avoiding exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 13, 2023, 11:04:55 AM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMI just received an email from Coinbase telling me that they noticed some unusual activity on my account and it has been locked.  It went on to ask that I click on a link to pass a security check before my account is unlocked. I knew this was a phishing attempt and I didn't take any action. However, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they really do that? If they don't, how do these hackers know that I have a Coinbase account?There is no evidence that Coinbase gave out your data to a third party. This might also be a data breach from Coinbase because they also deal with third parties. These firms might suffer attack from hackers and keep it secret from customers to avoid a lack of confidence. That is why it is important to use unique emails when dealing with third-party organizations. And we shouldn't keep large amounts in exchange. QuoteIf you are newbie and you get this sort of message, do not click the link or attempt to input any personal details. This is also a reminder that if you have your bitcoins on any exchange, it is not yours. Never forget, not your keys, not your bitcoins. Get your bitcoins off exchanges.Newbies need to check the history of most exchanges that have suffered hacks and fraudulent activities to gain more experience. Some of them were popular and reputable. Many people didn't expect that these well-known exchanges will suffer such attacks and there is no certainty that clients will get a refund of money lost to hackers. No exchange is reliable because a change in government policy can even make them go bankrupt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 13, 2023, 11:45:43 AM",
      "body": "The hackers are just bumping emails that they can lay their hands on the internet to send their phishing link either you have an account with coin base or not. I received one yesterday but because I know that it was a phishing link,I just ignored it. That is why newbies should learn how to stay safe from phishing links and malware by not clicking on the link and buy apps from the the original site. It is also good that we have hackers in our mind anytime that we are about to use our computers or when we are using it,so that one can be very caution of falling into their trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 13, 2023, 12:04:17 PM",
      "body": "Maybe someone will consider me paranoid, but I do not use email at all. I use it only for registration on sites. And on each important site for me, I use a separate email. Maybe I'm missing something, but is it possible in our time that you can get something valuable using such services? In addition, hackers select nicknames for mass mailings, and often it really turns out that people receive letters from supposedly important organizations but are not related to them. That is, hackers play at random. To avoid this, create nicknames so that it is difficult to brute-force from them, but of course, do not publish your emails on dubious resources.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "August 13, 2023, 12:16:56 PM",
      "body": "It's possible that these exchange can sell out customer's data to third party but in few cases the mistake could emanate from the customer through the use of certain survey sites that might prompt a questionnaires which may ask you to enlist a few of exchanges you do use. (I have cut across such related questions while performing some online surveys but I just skip it).We got to be careful on how we thread online with ads, certain online crypto groups we find ourselves in as members and a lot of others. But as OP rightly said, exchanges can't be trusted with the holding of our coins, create a non-custodial wallet and take responsibility of your keys, it can never be overemphasized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "August 13, 2023, 01:08:28 PM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMHowever, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they really do that? If they don't, how do these hackers know that I have a Coinbase account? Email and other forms of connecting with users online have become the most common means of scamming these days, as one just needs to be very careful about what they click on, especially in this type of email. The most risky part right now is no longer about the platform where users register with their details and sell customer data; now there are many tools that have been developed to scrape out specified data from targeted websites. So we never can be careful enough on places that we register with our email; instead, we can just avoid the kind of emails we even open. Sometimes it's just better to block the email by just reading the heading or subject of the mail, especially when one is not expecting any mail of that nature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "August 13, 2023, 01:26:07 PM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMI just received an email from Coinbase telling me that they noticed some unusual activity on my account and it has been locked.  It went on to ask that I click on a link to pass a security check before my account is unlocked. I knew this was a phishing attempt and I didn't take any action. However, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they do that? If they don't, how do these hackers know that I have a Coinbase account?If you are a newbie and you get this sort of message, do not click the link or attempt to input any personal details. This is also a reminder that if you have your bitcoins on any exchange, it is not yours. Never forget, not your keys, not your bitcoins. Get your bitcoins off exchanges.I guess some hackers got access to your email without your knowledge and they see your deposit and withdrawal transactions on your email and which could make them send you a phishing link that will enable them to hack your Coinbase account. Maybe trying changing your password on your email and Coinbase account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "August 13, 2023, 02:07:06 PM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMI just received an email from Coinbase telling me that they noticed some unusual activity on my account and it has been locked.  It went on to ask that I click on a link to pass a security check before my account is unlocked. I knew this was a phishing attempt and I didn't take any action. However, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they really do that? If they don't, how do these hackers know that I have a Coinbase account?They send bulk emails to all email addresses they have to massively find victims. They don't care who you are and what accounts you have but if you fall in to their phishing traps, you lose money.QuoteIf you are newbie and you get this sort of message, do not click the link or attempt to input any personal details. This is also a reminder that if you have your bitcoins on any exchange, it is not yours. Never forget, not your keys, not your bitcoins. Get your bitcoins off exchanges.If you receive such important emails, double check with their website with news, blog, twitter to find information. If you need something more, double check with their Customer Support with Direct chat or with support tickets.Don't immediately click on any link which is potential phishing but if you need safety first, don't click on it before you can confirm it at an official website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "August 13, 2023, 02:13:42 PM",
      "body": "I got this once a while ago, for me its not only coinbase, they send me some other phishing related to other website as well, they also tried to log in to some of my exchange account and other account like steam, instagram, and other stuff. Fortunately it's not my main email and I used it not for my main account, and I use it recklessly so I didn't worry most of the account they try to hack is worthless. I think what they do is they got your your email from some leaked database, and then they were using some program to try registering your email into some of the popular site, that's how they find that your email are registered on coinbase, then they will send the phishing email, and in my case they try to hack into the accounts as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "August 13, 2023, 03:00:50 PM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMI knew this was a phishing attempt and I didn't take any action. However, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they really do that? If they don't, how do these hackers know that I have a Coinbase account?is the email you use to create your Coinbase account exclusive for that account only? if not, it is possible they got your email from elsewhere, they also probably didn't know that you have a Coinbase account, it is not uncommon(at least from my experience) to receive phishing emails saying that my account was compromised, need to reset my password, etc. also, as Findingnemo has shared, it might not be Coinbase selling customer's data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "August 13, 2023, 03:08:52 PM",
      "body": "Quote from: Davidvictorson on August 13, 2023, 09:43:28 AMI just received an email from Coinbase telling me that they noticed some unusual activity on my account and it has been locked.  It went on to ask that I click on a link to pass a security check before my account is unlocked. I knew this was a phishing attempt and I didn't take any action. However, I am unhappy because it looks like these exchanges may be selling customers' data to third parties. Do they really do that? If they don't, how do these hackers know that I have a Coinbase account?If you are newbie and you get this sort of message, do not click the link or attempt to input any personal details. This is also a reminder that if you have your bitcoins on any exchange, it is not yours. Never forget, not your keys, not your bitcoins. Get your bitcoins off exchanges.Even if it was a legitimate Coinbase email, I would always think twice before even attempting to click a single link from that email. You never get too sure when an email is spoofed, and it is common that hackers would just replace a single character to put people off guard like let's say COINBASE would be shown as C0INBASE. People not paying attention to details are most likely to fall for these. An email that have sense of urgency are most likely a phishing or hacking attempt. That's one of the things I also learned from the scambaiters in Youtube.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "August 13, 2023, 03:20:19 PM",
      "body": "Lots of these kinds of emails I have received nowadays and they know that I am using such emails on other social media platforms well they also sent me about my password needing to be changed or something like that to get my attention. also, they have my emails in Binance too I wonder how they were able to get my emails which were hidden in my PC. This kind of method is not new but their innovative approach is the problem because they are close enough to mimic the real emails from social media and if their victims are not aware of their strategy, they could easily fool them with those Phishing techniques.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "August 13, 2023, 03:40:59 PM",
      "body": "Quote from: Findingnemo on August 13, 2023, 09:52:37 AMMaybe they don't know at all, they just are sending out mass phishing emails hoping that a percentage of recipients will fall for their trap. But the thing is your email is exposed to scammers by breaching some of the crypto-related services databases or we don't know it may happen with coinbase itself or they just expressed it as you agreed such \"We work with service providers, partners and other third parties to help us provide our Services, and as a result we need to share certain information with these third parties\".https://www.coinbase.com/legal/privacySo it proves why we shouldn't give the email you are using for exchanges to no other service or else it is not going to end in any way.The good thing is you figured out that attack and hopefully every others do the same.This was my initial suspicion and glad that someone else has confirmed it. Definitely going to take your advice... henceforth I'm going to be using a single email across all board for crypto related stuff. It will enable me pin down any where a suspected attack is emanating from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}