{
  "id": "topic_5457402",
  "title": "Alik Bahshi",
  "author": "Alik Bahshi",
  "created_time": "June 24, 2023, 10:38:21 AM",
  "content": "Алик БахшиПочему они живы?                 Наверное многие задавались вопросом почему Пригожин и Стрелков-Гиркин до сих пор живы. Оба они смело обвиняют Путина в бездарном командовании и непрофессионализме его военноначальников. Такой же питерский бандит как и Путин, участник, созданной Путиным ОПГ, Пригожин, раннее проговоренный к 13 годам колонии по обвинению в краже, мошенничестве, вовлечении несовершеннолетнего в преступную деятельность и разбое, а в настоящее время являющийся командиром наёмников, так называемой частной военной компании «Вагнер», открыто назвал, как он сказал, дедушку Путина законченным мудаком, не только не убит, но и продолжает критиковать мстительного хозяина Кремля за провал спецоперации.(1) Если в путинской России малейшее вольнодумие, противоречащее деяниям диктатора приравнивается криминалу и строго наказывается, то молчание власти на поведение Пригожина и Стрелкова выглядит довольно странно.  Если со своими политическими противниками Немцовым и Навальным, Путин расправился не боясь международного осуждения, то в данном случае бездействие хозяина Кремля, надо думать, объясняется довольно вескими причинами.        На мой взгляд, у Пригожина есть доказательства вины Путина в убийстве трёх журналистов Орхана Джамаля, Александра Расторгуева и Кирилла Радченко, которые расследовали неприглядную деятельность Кремля в самом опасном африканском государстве Центральноафриканской Республики, богатом алмазами, ураном и золотом, где группа «Вагнер» занималась охраной тамошнего диктатора.  В свою очередь Стрелков обладает доказательством вины России в случае со сбитым Боингом рейса MH-17, где он является непосредственным участником в убийстве 298 человек. Путин страшно боится официального признания Пригожина и Стрелкова, которые, похоже, позаботились о разглашении правды, в случае их ареста или преждевременной смерти. Именно это и связывает Путина в принятии мер, чтобы заткнуть рот восставшим против него бандитам Пригожину и Стрелкову.1.   Законченный мудак, или последняя война Российской империи. https://alikbahshi.livejournal.com/96209.html    24.06,2023",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457402",
  "comments": [
    {
      "author": "bonfire66",
      "created_time": "June 24, 2023, 10:43:54 AM",
      "body": "Мне кажется, вы тут не правы. Пригожин может предстваить ЖЕЛЕЗОБЕТОННЫЕ доказательства гибели хоть 1000 человек. Как были предоставлены доказательства по делу Боинга MH-17. И что в итоге? Как обычно, скажут, что все это вранье. А вата ДАЖЕ НЕ ОБРАТИТ на это внимание.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "June 24, 2023, 07:06:19 PM",
      "body": "Quote from: bonfire66 on June 24, 2023, 10:43:54 AMКак были предоставлены доказательства по делу Боинга MH-17.Железобетонных доказательств, кто именно его сбил - ни одного. Ни у одной из сторон.Железобетонно известно лишь что его сбили зенитной ракетой. И что это произошло на территории Украины.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xenon131",
      "created_time": "June 26, 2023, 06:54:03 AM",
      "body": "Quote from: Alik Bahshi on June 24, 2023, 10:38:21 AMАлик БахшиПочему они живы?                 Наверное многие задавались вопросом почему Пригожин и Стрелков-Гиркин до сих пор живы. Оба они смело обвиняют Путина в бездарном командовании и непрофессионализме его военноначальников. Такой же питерский бандит как и Путин, участник, созданной Путиным ОПГ, Пригожин, раннее проговоренный к 13 годам колонии по обвинению в краже, мошенничестве, вовлечении несовершеннолетнего в преступную деятельность и разбое, а в настоящее время являющийся командиром наёмников, так называемой частной военной компании «Вагнер», открыто назвал, как он сказал, дедушку Путина законченным мудаком, не только не убит, но и продолжает критиковать мстительного хозяина Кремля за провал спецоперации.(1) Если в путинской России малейшее вольнодумие, противоречащее деяниям диктатора приравнивается криминалу и строго наказывается, то молчание власти на поведение Пригожина и Стрелкова выглядит довольно странно.  Если со своими политическими противниками Немцовым и Навальным, Путин расправился не боясь международного осуждения, то в данном случае бездействие хозяина Кремля, надо думать, объясняется довольно вескими причинами.        На мой взгляд, у Пригожина есть доказательства вины Путина в убийстве трёх журналистов Орхана Джамаля, Александра Расторгуева и Кирилла Радченко, которые расследовали неприглядную деятельность Кремля в самом опасном африканском государстве Центральноафриканской Республики, богатом алмазами, ураном и золотом, где группа «Вагнер» занималась охраной тамошнего диктатора.  В свою очередь Стрелков обладает доказательством вины России в случае со сбитым Боингом рейса MH-17, где он является непосредственным участником в убийстве 298 человек. Путин страшно боится официального признания Пригожина и Стрелкова, которые, похоже, позаботились о разглашении правды, в случае их ареста или преждевременной смерти. Именно это и связывает Путина в принятии мер, чтобы заткнуть рот восставшим против него бандитам Пригожину и Стрелкову.1.   Законченный мудак, или последняя война Российской империи. https://alikbahshi.livejournal.com/96209.html    24.06,2023  У хуйла особый подход к таким хмырям. На повара я бы не поставил до декабря, пому как опустил он его славно в газах всего мира.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "June 26, 2023, 09:52:39 AM",
      "body": "Quote from: Snork1979 on June 24, 2023, 07:06:19 PMQuote from: bonfire66 on June 24, 2023, 10:43:54 AMКак были предоставлены доказательства по делу Боинга MH-17.Железобетонных доказательств, кто именно его сбил - ни одного. Ни у одной из сторон.Железобетонно известно лишь что его сбили зенитной ракетой. И что это произошло на территории Украины.Да, но ИДЕНТИФИЦИРОВАТЬ эту ракету, чьего она производства, где была сделана, на каком заводе и когда - это же вообще не то чтобы просто, а очень просто. А также траекторию запуска. Все доказательства были предоствалены голландцами.Но если вы ЛИЧНО знаете, что там у голландцев было не так, то есть СФАЛЬСИФИЦИРОВАНО - расскажите! Очень было бы интересно посмотреть!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "June 27, 2023, 04:17:17 AM",
      "body": "Quote from: bonfire66 on June 26, 2023, 09:52:39 AMА также траекторию запуска. Да, ракета по малазийскому боингу была запущена с территории Украины.В этом голландцы не врут и с этим, вроде бы, никто и не спорит",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 22, 2023, 09:22:54 AM",
      "body": "Похоже, Путин не выдержал и всё же засадил Гиркина за решетку. Неужели он не боится признания вины Гиркиным в сбитии Боинга рейса MH-17.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "July 24, 2023, 10:27:53 AM",
      "body": "А ему уже все равно. Это типа как маньяка-убийцу уличили в убийстве 60 человек. Идет суд. И тут выясняется, что он убил не 60, а 62 человек. Так ему уже пофигу. Хоть 100 человек. Это как в ситуации с правителями России или СССР. Сталин убил миллионы, Хрущев почти столько же. Ленин тоже голодомором и продразверстками и в гражданской войне положил миллионы... уже пофиг всем. Миллионом трупов больше, миллионом - меньше - какая вжопу разница!А вот если ты написал в инете \"нет войне\" - то тебя закроют лет на 5 за дискредитацию армии. Как-то так, ИМХО!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alik Bahshi",
      "created_time": "July 24, 2023, 05:03:44 PM",
      "body": "Quote from: bonfire66 on July 24, 2023, 10:27:53 AMА ему уже все равно. Это типа как маньяка-убийцу уличили в убийстве 60 человек. Идет суд. И тут выясняется, что он убил не 60, а 62 человек. Так ему уже пофигу. Хоть 100 человек. Это как в ситуации с правителями России или СССР. Сталин убил миллионы, Хрущев почти столько же. Ленин тоже голодомором и продразверстками и в гражданской войне положил миллионы... уже пофиг всем. Миллионом трупов больше, миллионом - меньше - какая вжопу разница!А вот если ты написал в инете \"нет войне\" - то тебя закроют лет на 5 за дискредитацию армии. Как-то так, ИМХО!  Да,... Кто-то же сказал: умом Россию не понять\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "July 24, 2023, 07:45:18 PM",
      "body": "Quote from: Alik Bahshi on July 22, 2023, 09:22:54 AMПохоже, Путин не выдержал и всё же засадил Гиркина за решетку. Неужели он не боится признания вины Гиркиным в сбитии Боинга рейса MH-17. мне кажется он думает что-то вроде: \"ну, это же всего лишь какой-то самолёт\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "July 25, 2023, 06:31:39 PM",
      "body": "Quote from: The0ldl_lser on July 24, 2023, 07:45:18 PMмне кажется он думает что-то вроде: \"ну, это же всего лишь какой-то самолёт\"Хорь, скажи мне честно: а чем Боинг MH-17 принципиально отличается от предыдущего пассажирского самолёта, который рукожопые укро-пво-шники тоже сбили со всеми пассажирами ещё в 2001?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "July 26, 2023, 10:37:52 AM",
      "body": "Кстати, напомню как там оно было в первые часы. Если что, в ютюбе полно роликов на эту тему.Первое официальное объявление - Ура! Доблестные донецкие патриоты сбили Украинский военный самолет, который вез украинцев!Потом объявление - нет, это был украинский самолет, он сбил малазийский боинг. есть ВСЕ ДОКАЗАТЕЛЬСТВА.А потом уже придумали про украинскую ракету.Если человек ВРЕТ - то он ПУТАЕТСЯ в показаниях. ВЫ можете привести ссылки на украинские видео, где они так же путались в показаниях в то время? Слабо? А вот таких Российских видео - НАВАЛОМ!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}