{
  "id": "topic_5453250",
  "title": "Forever101",
  "author": "Forever101",
  "created_time": "May 18, 2023, 10:10:26 PM",
  "content": "For years , we have always heard and have seen how the movement in bitcoins price affect other coins/tokens price.Going through the charts of  other Cryptocurrencies, it is seeing that the remarkable rise of other crypto follows the rise of bitcoins. Since bitcoins has its own blockchain and other crypto have their own Blockchains, how does the price of bitcoins influence other Cryptocurrencies, please I need diplomatic explanation on this phenomena.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453250",
  "comments": [
    {
      "author": "Doan9269",
      "created_time": "May 19, 2023, 05:59:00 PM",
      "body": "Quote from: Forever101 on May 18, 2023, 10:10:26 PMFor years , we have always heard and have seen how the movement in bitcoins price affect other coins/tokens price.Going through the charts of  other Cryptocurrencies, it is seeing that the remarkable rise of other crypto follows the rise of bitcoins. Since bitcoins has its own blockchain and other crypto have their own Blockchains, how does the price of bitcoins influence other Cryptocurrencies, please I need diplomatic explanation on this phenomena.Bitcoin is the ultimate first and reliable digital currency that dictates the entirr cryptocurrencies weather to live, rise, fall or remain the way they are because it has been a successful digitally decentralized currency that has no any central authority influence or control in determining it own stay, no economy inflation as well could be identified with the network because it is entirely different from the fiat financial system ad economy, bitcoin is all about freedom, everyone can invest in the asset and still spend the currency for exchange of goods and services, it can be accepted as a legal tender unlike other cryptocurrencies, it does not fail and change from complying with it blockchain technology and protocols, other cryptocurrencies are being controlled by central authorities but bitcoin is fully decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "May 19, 2023, 08:12:38 PM",
      "body": "Well Bitcoin is the top coin in crypto-currency and yes it has a good degree of control in the crypto market in various ways, Bitcoin is the first coin that comes to the mind of people when ever crypto-currency is mentioned especially those that aren't very familiar with crypto, so when ever there is a pump in Bitcoin this create a shock wave in the market and has a way to affect other coin you see those who aren't able to get good amount of Bitcoin go for a more affordable coin.Also if there is a negative market in Bitcoin many investors of other coins fares the condition of their coin and how the can survive, so they are mostly to secure themselves by selling off leading to a drop in that coin they invested in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "May 19, 2023, 09:45:13 PM",
      "body": "Quote from: Forever101 on May 18, 2023, 10:10:26 PMFor years , we have always heard and have seen how the movement in bitcoins price affect other coins/tokens price.Going through the charts of  other Cryptocurrencies, it is seeing that the remarkable rise of other crypto follows the rise of bitcoins. Since bitcoins has its own blockchain and other crypto have their own Blockchains, how does the price of bitcoins influence other Cryptocurrencies, please I need diplomatic explanation on this phenomena.At the time, no other coin has proven or even come close to be the better of bitcoin. We could have given Ethereum a second look but, the price difference puts bitcoin at a distant position to either of these coins and as such, they just don't make the bench mark.The relativity between these coins is such that, bitcoin is the pioneer cryptocurrency and is regarded as such, this creates a sentiment about it in such a way that, its perfection and flaws is conveyed on all the rest of the cryptocurrencies or altcoins out there. Besides, none has managed to be better or even come close to being as good or decentralised as bitcoin.Fir this reasons and those not mentioned, its always common to note that an effective rise or gall in bitcoin price has got some effects on the coins available in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "May 20, 2023, 03:14:11 AM",
      "body": "Quote from: Forever101 on May 18, 2023, 10:10:26 PMFor years , we have always heard and have seen how the movement in bitcoins price affect other coins/tokens price.Going through the charts of  other Cryptocurrencies, it is seeing that the remarkable rise of other crypto follows the rise of bitcoins. Since bitcoins has its own blockchain and other crypto have their own Blockchains, how does the price of bitcoins influence other Cryptocurrencies, please I need diplomatic explanation on this phenomena.Due to the fact that Bitcoin was the first cryptocurrency to ever come into existence, and the coin that has the most volume of the coin market capitalization, whenever it is affected, it will always have an influence on the entire market, due to the fact since it is a major trading pair to all the coins, when it's value falls, traders trading value falls too, causing an a likewise downward movement to those alternate altcoins. But note that not all altcoins is always affected when the price of Bitcoin falls.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "May 21, 2023, 12:35:01 PM",
      "body": "Since when I don de hear about cryptpcurrency, na only bitcoin name I de hear. Before i begin to learn about bitcoin, I de think say na only am de for crypocurrency, na now I come understand say dem get other crypto coins too. In fact people for outside online trading no know about the other coins except bitcoin. So I de reason say because na bitcoin everybody know, say naturally people wey want to enter crypto business go choose bitcoin. Therefore bitcoin popularity and im de more efficient pass the other coins, go make am de affect dem patronage. Na so life be, e no easy to overtake the champion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "May 21, 2023, 03:45:46 PM",
      "body": "Quote from: Forever101 on May 18, 2023, 10:10:26 PMFor years , we have always heard and have seen how the movement in bitcoins price affect other coins/tokens price.Going through the charts of  other Cryptocurrencies, it is seeing that the remarkable rise of other crypto follows the rise of bitcoins. Since bitcoins has its own blockchain and other crypto have their own Blockchains, how does the price of bitcoins influence other Cryptocurrencies, please I need diplomatic explanation on this phenomena.I would want to direct you to the idea behind the creation of any coin. What sets Bitcoin apart from these other coins boils down to the idea, vision statement and mission statement it is known for. Other coins as we would see had a reason apart from being just a decentralized currency or centralized currency as I believe.Bitcoin has been the first coin and still is, it is pure decentralized currency like paper money, only the online version and with steady features and a promise of continued relevance. I knew about the existence of most alt coins from this Bitcoin forum and although different reasons might make some of us invest in these alt coins, we always find safe haven in Bitcoin once the market volatilities starting hitting hard.With the plans of halving that Bitcoin would effect sometime next year, I have no doubt how much the other cryptocurrencies in the market would be affected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hyphen(-)",
      "created_time": "May 22, 2023, 09:01:30 PM",
      "body": "Quote from: Forever101 on May 18, 2023, 10:10:26 PMFor years , we have always heard and have seen how the movement in bitcoins price affect other coins/tokens price.Going through the charts of  other Cryptocurrencies, it is seeing that the remarkable rise of other crypto follows the rise of bitcoins. Since bitcoins has its own blockchain and other crypto have their own Blockchains, how does the price of bitcoins influence other Cryptocurrencies, please I need diplomatic explanation on this phenomena.The idea de simple; Bitcoin na the first crypto wey dem create, any other coins come for im back na why e de control d entire Bitcoin market.If any news come out today say Bitcoin get issue, other altcoins go follow because na Bitcoin dem de look up to, na why e de control d market be that because even if you check am na Bitcoin get the highest money for all coins and d idea of Bitcoin dey transparent unlike altcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "May 23, 2023, 07:07:13 PM",
      "body": "Quote from: Forever101 on May 18, 2023, 10:10:26 PMFor years , we have always heard and have seen how the movement in bitcoins price affect other coins/tokens price.Going through the charts of  other Cryptocurrencies, it is seeing that the remarkable rise of other crypto follows the rise of bitcoins. Since bitcoins has its own blockchain and other crypto have their own Blockchains, how does the price of bitcoins influence other Cryptocurrencies, please I need diplomatic explanation on this phenomena.Make I use politics explain am small, Bitcoin na Nigeria president wey be Buhari then other altcoins na the governor dem wey we get for state. Inside that altcoins (governors) we get local government wey be the low marketcap coins like memecoins and the shitcoins dem. Anything wey affect president e go surely affect other state governors (altcoins). If the country (cryptocurency market) dey go well na because the president (Bitcoin) dey cause am and vice versa. Bitcoin na wetin hold the whole market on lockdown. Na Bitcoin dey popular pass before any other altcoins so the success of Bitcoin or the downfall wey be the rise and fall of Bitcoin price, go automatically affect other altcoins.E go affect altcoins because people dey observe how Bitcoin dey move before dem buy altcoins. Na Bitcoin be the S. I unit for the cryptocurrency market, na bitcoin people dey carry measure how the market be. If Bitcoin dey fall, expect say the whole market go react negatively and same thing go happen when Bitcoin begins they moon. History dun show say na so the market dey behave so people dey observe am and wait to see how Bitcoin dey move before dem take their decision to invest inside the market so dem go get better profits from their altcoins investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "May 23, 2023, 09:34:33 PM",
      "body": "Quote from: CryptopreneurBrainboss on May 23, 2023, 07:07:13 PMQuote from: Forever101 on May 18, 2023, 10:10:26 PMFor years , we have always heard and have seen how the movement in bitcoins price affect other coins/tokens price.Going through the charts of  other Cryptocurrencies, it is seeing that the remarkable rise of other crypto follows the rise of bitcoins. Since bitcoins has its own blockchain and other crypto have their own Blockchains, how does the price of bitcoins influence other Cryptocurrencies, please I need diplomatic explanation on this phenomena.Make I use politics explain am small, Bitcoin na Nigeria president wey be Buhari then other altcoins na the governor dem wey we get for state. Inside that altcoins (governors) we get local government wey be the low marketcap coins like memecoins and the shitcoins dem. Anything wey affect president e go surely affect other state governors (altcoins). If the country (cryptocurency market) dey go well na because the president (Bitcoin) dey cause am and vice versa. Bitcoin na wetin hold the whole market on lockdown. Na Bitcoin dey popular pass before any other altcoins so the success of Bitcoin or the downfall wey be the rise and fall of Bitcoin price, go automatically affect other altcoins.E go affect altcoins because people dey observe how Bitcoin dey move before dem buy altcoins. Na Bitcoin be the S. I unit for the cryptocurrency market, na bitcoin people dey carry measure how the market be. If Bitcoin dey fall, expect say the whole market go react negatively and same thing go happen when Bitcoin begins they moon. History dun show say na so the market dey behave so people dey observe am and wait to see how Bitcoin dey move before dem take their decision to invest inside the market so dem go get better profits from their altcoins investments. Snr. Man this your explanation go well o. Nobody wey go see and read this one wey no go understand unless the person na container. So far, the explanatory tells more when compared to the governmental structure and leadership in play. let me take  this to the health sector for more explanatory; There is a sayings that says when the head is down, it affects other system or parts  of the body because they would not function well as the head is not in shape or good form health otherwise.Now the head is likened to be bitcoin and other parts of the body can be seen as other alt coins in the crypto industry or space.when the head eats through the mouth, it goes down into the system for other organs to digest and get strength and life to live a good and healthy life, they grow as well after they have consumed what ever they have consumed by virtue of the mouth eating through  the head. This is the case of bitcoin and other crypto currency. If you understand it the you could get a clear picture of what and how bitcoin leads other crypto currency. When the head is attacked or cut off,it definitely affects other parts of the body which means that if bitcoin is by any means threatened, it also  have adverse effect on other crypto currency.I think  this explanatory could serve better for proper understanding added to other explanations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "May 23, 2023, 09:52:45 PM",
      "body": "Well I know lots of people already explained about this but lemme put a little light to what others have said so far. Usually as we know very well, bitcoin is the mother or a parent coin that is being introduced and launched before other altcoin out there and so on the rest altcoin solely depends on the increase and decrease of bitcoin coupled with the bitcoin halving on the run which entirely affects and influence children coin or child coin so, most of the coin are being paired with bitcoin for trading. At this point of trading if the bitcoin prices are being affected it automatically reflects to the paired coin, and again, out of the 100 percent altcoin in cmc and exchange, 60 to 70 percent of them are being paired to trade with bitcoin so I think that's why they are affected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "May 23, 2023, 09:53:12 PM",
      "body": "Bitcoin is the controller and determiner of the other coins in the ecosystem whatever happens to bitcoin affect other coins. Now why bitcoin affect other Cryptocurrencies is that, the rate of people use bitcoin is more than the number of people use altcoins. And also the value of bitcoin is much more better than other Cryptocurrencies. Bitcoin has a platform that business activities are going on massively while other Coins doesn't have. Because of the value and the high demand rate of bitcoin is making people to come to bitcoin more than other Cryptocurrencies and that is the reason why bitcoin affect other Coins in the ecosystem",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "May 24, 2023, 08:45:05 PM",
      "body": "Bitcoin na the baba of all cryptocurrency because na bitcoin those shitcoins copy do their own and na bitcoin be the coins wey get value pass because he dey short in supply. If you observe all those shitcoin price go high after sometimes e go crash because na people dey control the price since na the same people dey control the coins.Bitcoin no get anybody wey dey control am as him na king on him own,due to the way wey satoshi create am. All these factors come make am dey increase in value gradually as people begin understand the potential wey he get. One last thing wey make bitcoin dey control all altcoins na the bitcoin halving we dey always reduce the quantity of bitcoin wey miners go mine into half of the former quantity wey been dey. Bitcoin na also store of value wey go save your money from depreciating when you use am buy bitcoin because of him unstable price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}