{
  "id": "topic_5464515",
  "title": "shasan",
  "author": "shasan",
  "created_time": "August 25, 2023, 07:06:16 AM",
  "content": "What happened:: Posted as a borrower and removed the postScammers Profile Link: https://bitcointalk.org/index.php?action=profile;u=3504269Reference Link: https://ninjastic.space/post/62745051Amount Scammed: 66$ may beAdditional Notes: I have received an email where I can see a post made by Obari on the lending thread. The post was as mentioned below:Quote from: Obari on August 25, 2023, 06:20:15 AMWell your message is more of a threat mate.You shouldn't be this harsh to me because you wouldn't have to blame because everything I've done is for the safety of op and you will agree with me that $66 is no little money and I just have to be very careful about everything please.Well I got your address and since this was my first loan, I didn't want any issues but I want to plead that you give me till su day to make your payment and I will be making the payment in full I promise. This means the user took a loan from there but when the lender told him not to lend that person then removed the post. From there I think:The user is an alt account of Sakanwa. Wanted to post from the account Sakanwa but by mistake posted from Obari. Also from the record of  https://ninjastic.space/ Obari has not taken any loan. That means it is an alt account.If not they are alt accounts then Obari is the loan defaulter who took the loan from outside of the form or private message on the forum but as the lender told not lent deleted the post.Please provide your opinion of you.If it deserves to post anywhere else then please let me know.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464515",
  "comments": [
    {
      "author": "shasan",
      "created_time": "August 25, 2023, 07:14:24 AM",
      "body": "Reserve",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 25, 2023, 07:24:45 AM",
      "body": "It took me several times reading the posts to understand. The truth is that I don't feel sorry for CYBER_COWBOY, now Cantlogin or any of his alts, nor for the accounts that borrowed from him and have now defaulted.Summary for those who want to understand without diving through the posts:Sakanwa borrowed 0.00203BTC from CYBER_COWBOY, for which he had to pay back 0.00224BTC. He has defaulted on that loan, now excusing himself that CYBER_COWBOY has lost access to his original account or is hacked, and asks for an extension for one more month. The lender disagrees and sashan further tells him that he should repay the loan to the same address that sent him the funds originally. Sashan says that Obari is an alt of Sakanwa, and it seems so from the way he talks in the PM he sent him, but to top it off I just saw that Obari has asked sashan for a loan right now LOL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "August 25, 2023, 07:32:40 AM",
      "body": "Funny how things work here And respectful  I'm a user who is very committed  in the lending board and on several occasions I've asked shashan for a loan and he turned me down and I even asked for a loan this morning because as we all know that it takes sometimes several hours before shashan approves of loans and since my appointment  with the doctor was supposed to be tomorrow, I had to seek a loan so I can get ready before tomorrow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "August 25, 2023, 07:35:52 AM",
      "body": "Quote from: Poker Player on August 25, 2023, 07:24:45 AMIt took me several times reading the posts to understand. The truth is that I don't feel sorry for CYBER_COWBOY, now Cantlogin or any of his alts, nor for the accounts that borrowed from him and have now defaulted.Summary for those who want to understand without diving through the posts:Sakanwa borrowed 0.00203BTC from CYBER_COWBOY, for which he had to pay back 0.00224BTC. He has defaulted on that loan, now excusing himself that CYBER_COWBOY has lost access to his original account or is hacked, and asks for an extension for one more month. The lender disagrees and sashan further tells him that he should repay the loan to the same address that sent him the funds originally. Sashan says that Obari is an alt of Sakanwa, and it seems so from the way he talks in the PM he sent him, but to top it off I just saw that Obari has asked sashan for a loan right now LOL.I have highly tried to show that obari is the alt account of the borrower. Probably you have not see the quoted post of obari and also you have not gone through the reference link. If you read the quoted post of obari and reference link then it will be clear to you whether they are alt or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "August 25, 2023, 07:39:55 AM",
      "body": "100% right.I just wanted to publish this when I saw your thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 25, 2023, 07:42:15 AM",
      "body": "Quote from: shasan on August 25, 2023, 07:35:52 AMI have highly tried to show that obari is the alt account of the borrower. Probably you have not see the quoted post of obari and also you have not gone through the reference link. If you read the quoted post of obari and reference link then it will be clear to you whether they are alt or not.I have indeed seen it. See the bolded part:Quote from: Poker Player on August 25, 2023, 07:24:45 AMSashan says that Obari is an alt of Sakanwa, and it seems so from the way he talks in the PM he sent him, but to top it off I just saw that Obari has asked sashan for a loan right now LOL.What I see is that he probably got confused of account when he sent you the private message and instead of sending it to you from Sakanwa's, by mistake he sent it to you from Obari's account.Quote from: Obari on August 25, 2023, 07:32:40 AMFunny how things work here And respectful  I'm a user who is very committed  in the lending board and on several occasions I've asked shashan for a loan and he turned me down and I even asked for a loan this morning because as we all know that it takes sometimes several hours before shashan approves of loans and since my appointment  with the doctor was supposed to be tomorrow, I had to seek a loan so I can get ready before tomorrow.That's all well and good, but what do you have to say about you managing both the Obari and Sakanwa accounts?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "August 25, 2023, 08:05:24 AM",
      "body": "Quote from: shasan on August 25, 2023, 07:06:16 AMAlso from the record of  https://ninjastic.space/ Obari has not taken any loan. That means it is an alt account.If not they are alt accounts then Obari is the loan defaulter who took the loan from outside of the form or private message on the forum but as the lender told not lent deleted the post.Please provide your opinion of you.  Yes, k checked Obari post history in ninjastic space and found the above mentioned reply which has been deleted from forum now. I think same that Sikandar and obari is managing by same person or atleast login in same device (brother or any other relationship). Obari can explain correctly what happened actually. If both accounts managing by same person then still it wondering because lacal board of both accounts are changes Bangladesh and Nigeria.Quote from: Poker Player on August 25, 2023, 07:24:45 AMIt took me several times reading the posts to understand. I have also read three times what actually happened,  we have to read from start what actually happen but you now make it easy for new visitors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "August 25, 2023, 09:32:55 AM",
      "body": "Well firstly I want to thank everyone who have shown interest in this thread and secondly  for those who have been active on the lending board would have seen me in several cases and I've had about 3 times loan from shashan and there was a time I was given $150 loan and got scammed but I still cleared up the loan.I've been battling with my health and most of the loans I've taken so far are for my health issues  and I also have a phone with very poor battery, a Samsung galaxy s9 edge which is even broken badly and since  last week, it has been so blur that you barely read from the screen and I also told @shashan about my health and also the phone. quote author=Obari link=topic=5030169.msg62696427#msg62696427 date=1692034157]Quote from: shasan on August 14, 2023, 05:23:24 PMQuote from: Obari on August 14, 2023, 03:16:32 PMHello sirI still have an outstanding  loan of $12 with you, and I will be needing a $500 loan to pay in 10 weeks but the $12 will ne deducted from my loan which implies that I will receive  $488 from you and expected to pay $500 plus agreed interest  in 10 weeks.If its fine by you, then we can talk further about.Thanks in anticipation for a favorable response from you.I am sorry but I am not going to accept your loan request.I respect your decisions sir but I think it will be fair enough if you give me some clue to why you turned me down because last I checked, I haven't failed not even for once on my loan terms and I've been very respectful in time past and the only time it seems I got you angry was because I wasn't familiar  with sending usdt on binance and I use a Samsung  s9 with a poor battery health and the phone went off in the middle of our conversation  which I responded to as soon as I got the phone charged.Its fine if you don't want to offer me another loan but I'm sincerely  sorry for whatever way I must have wronged you and I hope this doesn't  ruine our business relationship.I also want to say a very big thank you for all the help so far, I'm grateful  and I hope to pay off the remaining  $12 within the week. Thanks 😔[/quote]I've known sakanwa from childhood and I can always attest for him and since my phone has been bad, I've  been logging in my account with his phone most times and it has really dragged me backward for over three weeks or so because I haven't been able to meet up with my work in my signature  campaign because I have to share sakanwa's phone with him and you know mistakes do happen and sakanwa is a totally different  entity  all together which i believe  many other persons might know him in person in the local board and I have been pairing with him on his phone and if something like this happens then is a mistake.I want to correct that Obari isn't a loan defaulter neither do I have any alt what so ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 25, 2023, 09:35:56 AM",
      "body": "Quote from: Obari on August 25, 2023, 07:32:40 AMFunny how things work here And respectful  I'm a user who is very committed  in the lending board and on several occasions I've asked shashan for a loan and he turned me down and I even asked for a loan this morning because as we all know that it takes sometimes several hours before shashan approves of loans and since my appointment  with the doctor was supposed to be tomorrow, I had to seek a loan so I can get ready before tomorrow.Sorry about your health issue and I wish you a quick recovery. Health problems can be a drain to our financial resources. I am surprised that Shashan turned you down because it is unusual for him to turn down members who are in campaigns. And you are in one of the long-lasting campaigns in the forum. But you need to give some explanation to clear your name from this issue. My mother will always say that it is better she go hungry than to be in debt. I just hope you raise funds and pay the loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "August 25, 2023, 09:41:25 AM",
      "body": "Quote from: Fiatless on August 25, 2023, 09:35:56 AMQuote from: Obari on August 25, 2023, 07:32:40 AMFunny how things work here And respectful  I'm a user who is very committed  in the lending board and on several occasions I've asked shashan for a loan and he turned me down and I even asked for a loan this morning because as we all know that it takes sometimes several hours before shashan approves of loans and since my appointment  with the doctor was supposed to be tomorrow, I had to seek a loan so I can get ready before tomorrow.Sorry about your health issue and I wish you a quick recovery. Health problems can be a drain to our financial resources. I am surprised that Shashan turned you down because it is unusual for him to turn down members who are in campaigns. And you are in one of the long-lasting campaigns in the forum. But you need to give some explanation to clear your name from this issue. My mother will always say that it is better she go hungry than to be in debt. I just hope you raise funds and pay the loan. I've already cleared up my loan with Shashan weeks back and anyone who was observant would have noticed that I've  been struggling  to make post on my account for sometime now and I barely miss post number because I make my post passionately not to pursue signature quarter and I haven't been an easy one for me without a good phone and still investing all the money I earn in health.And I've called sakanwa on his phone to come answer and clear up all the air because i guess he didn't logout my account from his phone before making a post",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "August 25, 2023, 09:42:25 AM",
      "body": "Quote from: Fiatless on August 25, 2023, 09:35:56 AMQuote from: Obari on August 25, 2023, 07:32:40 AMFunny how things work here And respectful  I'm a user who is very committed  in the lending board and on several occasions I've asked shashan for a loan and he turned me down and I even asked for a loan this morning because as we all know that it takes sometimes several hours before shashan approves of loans and since my appointment  with the doctor was supposed to be tomorrow, I had to seek a loan so I can get ready before tomorrow.Sorry about your health issue and I wish you a quick recovery. Health problems can be a drain to our financial resources. I am surprised that Shashan turned you down because it is unusual for him to turn down members who are in campaigns. And you are in one of the long-lasting campaigns in the forum. But you need to give some explanation to clear your name from this issue. My mother will always say that it is better she go hungry than to be in debt. I just hope you raise funds and pay the loan. Obviously you didn't read the rest.His \"friend since childhood\" is defaulting a loan. And it looks like Obari and the defaulter are the same person. His explanation makes a little sense, ok I get that, but it also looks super suspicious.Sakanwa can't pay back a loan and in the same moment Obari tries to take a loan. Also Obari commented in Sakanwa's loan thread like he is answering the accusations. Doesn't make too much sense.Also Obari was contacting the lender to please delete the quoted post looks pretty sus to be honest.I think the health and phone story is what it is, a story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "August 25, 2023, 09:50:56 AM",
      "body": "Quote from: AHOYBRAUSE on August 25, 2023, 09:42:25 AMQuote from: Fiatless on August 25, 2023, 09:35:56 AMQuote from: Obari on August 25, 2023, 07:32:40 AMFunny how things work here And respectful  I'm a user who is very committed  in the lending board and on several occasions I've asked shashan for a loan and he turned me down and I even asked for a loan this morning because as we all know that it takes sometimes several hours before shashan approves of loans and since my appointment  with the doctor was supposed to be tomorrow, I had to seek a loan so I can get ready before tomorrow.Sorry about your health issue and I wish you a quick recovery. Health problems can be a drain to our financial resources. I am surprised that Shashan turned you down because it is unusual for him to turn down members who are in campaigns. And you are in one of the long-lasting campaigns in the forum. But you need to give some explanation to clear your name from this issue. My mother will always say that it is better she go hungry than to be in debt. I just hope you raise funds and pay the loan. Obviously you didn't read the rest.His \"friend since childhood\" is defaulting a loan. And it looks like Obari and the defaulter are the same person. His explanation makes a little sense, ok I get that, but it also looks super suspicious.Sakanwa can't pay back a loan and in the same moment Obari tries to take a loan. Also Obari commented in Sakanwa's loan thread like he is answering the accusations. Doesn't make too much sense.Also Obari was contacting the lender to please delete the quoted post looks pretty sus to be honest.I think the health and phone story is what it is, a story. You  don't expect me to make stories with my health and there have been several  post were i stated about my health and also stated when I got an xray and I also told shashan about my phone and health.And I'm  supposed to see a doctor tomorrow  which I already told shashan that my appointment  is for weekend and shashan some times takes long to approve a loan maybe because his not active or so but I asked for the loan today against tomorrow.Please don't make it seem we're  not supposed to know ourselves outside  the forum and him not being  able to clear up the loan has nothing to do with me and I'm in this picture because I have been using his phone for some time now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 25, 2023, 10:08:44 AM",
      "body": "Quote from: AHOYBRAUSE on August 25, 2023, 09:42:25 AMQuote from: Fiatless on August 25, 2023, 09:35:56 AMQuote from: Obari on August 25, 2023, 07:32:40 AMFunny how things work here And respectful  I'm a user who is very committed  in the lending board and on several occasions I've asked shashan for a loan and he turned me down and I even asked for a loan this morning because as we all know that it takes sometimes several hours before shashan approves of loans and since my appointment  with the doctor was supposed to be tomorrow, I had to seek a loan so I can get ready before tomorrow.Sorry about your health issue and I wish you a quick recovery. Health problems can be a drain to our financial resources. I am surprised that Shashan turned you down because it is unusual for him to turn down members who are in campaigns. And you are in one of the long-lasting campaigns in the forum. But you need to give some explanation to clear your name from this issue. My mother will always say that it is better she go hungry than to be in debt. I just hope you raise funds and pay the loan. Obviously you didn't read the rest.His \"friend since childhood\" is defaulting a loan. And it looks like Obari and the defaulter are the same person. His explanation makes a little sense, ok I get that, but it also looks super suspicious.Sakanwa can't pay back a loan and in the same moment Obari tries to take a loan. Also Obari commented in Sakanwa's loan thread like he is answering the accusations. Doesn't make too much sense.Also Obari was contacting the lender to please delete the quoted post looks pretty sus to be honest.I think the health and phone story is what it is, a story. Thank you for your explanation. I read the thread but I don't get the part that it was Sakanwa that has an outstanding loan and Obari is asking for another loan. @Obari, a lender can turn down any loan application without explaining the reason. So you don't have the right to ask for an explanation because loans are given based on the lender's rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantlogin",
      "created_time": "August 25, 2023, 10:09:45 AM",
      "body": "@Obari tell your friend @Sakanwa to please pay back the loan today. It's now two days overdue.If he does not have money, at least he can add me on telegram and we can set up a installment.I need my money asap.https://bitcointalk.org/index.php?topic=5445759.msg62745873#msg62745873▂ ▅ ▆ ▇ https://t.me/CyberCowb0y ▇ ▆ ▅ ▂",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 25, 2023, 10:19:32 AM",
      "body": "Quote from: Obari on August 25, 2023, 09:41:25 AM I've  been struggling  to make post on my account for sometime now and I barely miss post number because I make my post passionately not to pursue signature quarter and I haven't been an easy one for me without a good phone and still investing all the money I earn in health.Yeah, ironic:1000 post in 16 days total logged in time  Must be karma!Ps: you had a desktop one week ago when you were doing reviews!Quote from: Obari on August 25, 2023, 09:32:55 AMI've known sakanwa from childhood Oh, the childhood cousin who will turn out to be your wife's friend's granddaughter!Simple, you f! up! Man up, deal with it and with the consequences and that's it!Let me tell you from years of experience what happens usually in those cases, instead of cleaning your reputation, you make everyone look at your account and more nasty stuff comes to light. I've seen enough accounts coming here to clear a misunderstanding and leaving with 10x more red tags and with an army of alts uncovered.Even if you're that 0.001% who truly has a friend who lends him his phone to post on Bitcointalk, you will never be able to prove it beyond a doubt, it's easy to just call a friend, make him record a 5-second video of him claiming he is sakanwa, so what? I can post a picture of my cat with a paper signed \"theymos\", what would that prove?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "August 25, 2023, 11:02:11 AM",
      "body": "Quote from: Poker Player on August 25, 2023, 07:42:15 AMWhat I see is that he probably got confused of account when he sent you the private message and instead of sending it to you from Sakanwa's, by mistake he sent it to you from Obari's account.You are still too far. The message/post was not to me that was to another lending thread. Obari posted about the repayment on that thread while s/he has not taken any loan. So, obviously, s/he was an account of Sakanwa. I am trying to prove that both account is managed by the same person.Quote from: Obari on August 25, 2023, 09:32:55 AMI've known sakanwa from childhood and I can always attest for him and since my phone has been bad, I've  been logging in my account with his phone most times and it has really dragged me backward for over three weeks or so because I haven't been able to meet up with my work in my signature  campaign because I have to share sakanwa's phone with him and you know mistakes do happen and sakanwa is a totally different  entity  all together which i believe  many other persons might know him in person in the local board and I have been pairing with him on his phone and if something like this happens then is a mistake.So, it occurs as both of you using the same device? But while I sent you a message on telegram you replied on that time. I doubt that both accounts are operated by different people. Would you like to ask your local board users who know both of you to share that you are not the alt account of Sakanwa?Quote from: Fiatless on August 25, 2023, 09:35:56 AMI am surprised that Shashan turned you down because it is unusual for him to turn down members who are in campaigns. And you are in one of the long-lasting campaigns in the forum.Are you crazy?? Why I will take him/her down? I want to join on that campaign???",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "August 25, 2023, 11:12:58 AM",
      "body": "Quote from: shasan on August 25, 2023, 11:02:11 AMQuote from: Fiatless on August 25, 2023, 09:35:56 AMI am surprised that Shashan turned you down because it is unusual for him to turn down members who are in campaigns. And you are in one of the long-lasting campaigns in the forum.Are you crazy?? Why I will take him/her down? I want to join on that campaign???No offense boss. You misconceived my position. What I meant was that members in campaigns have better chances of getting loans. So I was surprised that his own was turned down. My thought was that you may have refused to give the loan for other reasons which from what I have observed his insincerity in repaying. If you check my next post you will observe that I told Obari that he has no right to question your refusal to grant his request. I am sorry for my inability to clearly explain my point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 25, 2023, 11:28:56 AM",
      "body": "Quote from: shasan on August 25, 2023, 11:02:11 AMYou are still too far. The message/post was not to me that was to another lending thread. Obari posted about the repayment on that thread while s/he has not taken any loan. So, obviously, s/he was an account of Sakanwa. I am trying to prove that both account is managed by the same person.Yeah, OK. I think I'm a bit thick this morning as this is the second mistake I've made. Sorry about that.OK, it was a message in CYBER_COWBOY's lending thread. It doesn't change the point anyway, and it's that he screwed up by posting that from the wrong account. And I think the explanations he tries to give here are even more ridiculous. As stompix says, I wouldn't be surprised if a few DTs now go through both accounts and find even more negative stuff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "August 25, 2023, 11:51:08 AM",
      "body": "Quote from: Obari on August 25, 2023, 09:32:55 AMI've known sakanwa from childhood and I can always attest for him and since my phone has been bad, I've  been logging in my account with his phone most times and it has really dragged me backward for over three weeks or so because I haven't been able to meet up with my work in my signature  campaign because I have to share sakanwa's phone with him and you know mistakes do happen and sakanwa is a totally different  entity  all together which i believe  many other persons might know him in person in the local board and I have been pairing with him on his phone and if something like this happens then is a mistake.This story is nothing new, the account of friend, cousin, brother, sister etc. The connection that the lender has found between your accounts, and the evidence found are enough to reject your loan request. Now it's a question of how believable your story is, because it's a common thing on this forum that when someone gets caught with an alt account they make up different stories like this. It is clearly proven here that you may not have noticed while posting so it was posted from the wrong account, such a big mistake should not happen as the story you told. I may be wrong in understanding your case, looking forward to see more and what comes out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}