{
  "id": "topic_5497841",
  "title": "Cryptomultiplier",
  "author": "Cryptomultiplier",
  "created_time": "May 26, 2024, 01:04:52 PM",
  "content": "We know that if we want to learn the basics of cryptocurrency or seeking higher level knowledge for investing in and trading digital money, Udemy, Edx, Coursera are online sites that offer a wide variety of cryptocurrency training courses that can teach one on what needs to be known. Some others do exist that teach the subject of cryptocurrency and give users the opportunity to try out or test what they have learnt while gaining certification as a Certified Blockchain Professional (CBP) or certification as a Certified Blockchain Developer (CBD).Another finding led me to discover that the University of Nicosia offers an MSc in Blockchain and Digital Currency and is notably among the first institution with such academic degree in this field and in the world.*If the study of fish is called fishery, what is the study of Bitcoin, cryptocurrency in general and the study of Blockchain technology called?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5497841",
  "comments": [
    {
      "author": "stompix",
      "created_time": "May 26, 2024, 01:12:54 PM",
      "body": "Quote from: Cryptomultiplier on May 26, 2024, 01:04:52 PM*If the study of fish is called fishery, what is the study of Bitcoin or cryptocurrency in general and the study of Blockchain technology called?The study of fish is called ichthyology, a fishery is a place where fish are caught or a place where commercial raising happens.So first find the Latin or greek word for Bitcoin/Blockchain and slap an ology at the end!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "May 26, 2024, 01:13:19 PM",
      "body": "Your topic to me seems to me that it should be in the off topic section. That's because it has no matter of discussion. I don't see much of discussion here. The term cryptocurrency and Blockchain technology, comprises of a wide range of field, studies and specialty. They are broad terms that can be used to describe so many other terms relating to digital currencies. I don't think there's any other thing one can use to describe the study of cryptocurrency aside cryptocurrency it self.( If I'm wrong, I'm open to correction guys)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "May 26, 2024, 01:16:05 PM",
      "body": "Quote from: Cryptomultiplier on May 26, 2024, 01:04:52 PMWe know that if we want to learn the basics of cryptocurrency or seeking higher level knowledge for investing in and trading digital money, Udemy, Edx, Coursera are online sites that offer a wide variety of cryptocurrency training courses that can teach one on what needs to be known.Newbies have to start with educational resources for newbies, beginners.https://learnmeabitcoin.com/Getting started with BitcoinThe learnmeabitcoin website has different categories for beginners, and advanced levels.Books, courses, online resources are helpful too.Institutions offering blockchain courses and programs in the world.Big Library of Bitcoin & Blockchain Online CoursesAwesome BitcoinAwesome Crypto TradingMastering Bitcoin.Mastering the Lightning Network.I feel more comfortable to learn with books than with videos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "May 26, 2024, 01:40:47 PM",
      "body": "Quote from: Hatchy on May 26, 2024, 01:13:19 PMYour topic to me seems to me that it should be in the off topic section. That's because it has no matter of discussion. I don't see much of discussion here. The term cryptocurrency and Blockchain technology, comprises of a wide range of field, studies and specialty. They are broad terms that can be used to describe so many other terms relating to digital currencies. I don't think there's any other thing one can use to describe the study of cryptocurrency aside cryptocurrency it self.( If I'm wrong, I'm open to correction guys)I think it can be called Bitcoin and cryptocurrencies in general because bitcoin blockchain is what that really define what blockchain is and it led to the creation of other cryptocurrencies. But if it is called cryptocurrencies, it is not bad either. I want to say that this topic does not belong to off-topic because cryptocurrencies is what that are discussed about and nothing else that should be moved to off-topic board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "May 26, 2024, 01:47:41 PM",
      "body": "Quote from: Cryptomultiplier on May 26, 2024, 01:04:52 PM*If the study of fish is called fishery, what is the study of Bitcoin, cryptocurrency in general and the study of Blockchain technology called?So far cryptocurrency is still new that’s why there’s still no official word for study of crypto. Cryptography is the closest thing which blockchain started before cryptocurrency exist. Correct me if I’m wrong but the word crypto is derived from cryptography on cryptocurrency.Maybe in the future when the courses is already popular people will come up to the new terminology since this terms only come up if many people keep using it as slang then later on turns to be official name.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kruw",
      "created_time": "May 26, 2024, 01:57:26 PM",
      "body": "Peter Todd refers to it as \"Applied Cryptography\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "May 26, 2024, 01:59:42 PM",
      "body": "Quote from: stompix on May 26, 2024, 01:12:54 PMQuote from: Cryptomultiplier on May 26, 2024, 01:04:52 PM*If the study of fish is called fishery, what is the study of Bitcoin or cryptocurrency in general and the study of Blockchain technology called?The study of fish is called ichthyology, a fishery is a place where fish are caught or a place where commercial raising happens.So first find the Latin or greek word for Bitcoin/Blockchain and slap an ology at the end!I found out the Greek word for crypto means kryptos which means hidden, secret, or covered.While in Latin, Solidus electronicus quidam, (qui Anglice dicitur “Bitcoin”) is the terminology used to describe or refer to a certain electronic coin which we know as Bitcoin in English language. If I should add, \"ology\" behind, it would sound like \"kyptology and also solidus electronics quidamology\". Making sense?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "May 26, 2024, 01:59:58 PM",
      "body": "According to my research, there's really no new made up word specific for bitcoin or cryptocurrency studies. They just add the word studies to it lol.Maybe it is not yet that well explored by many universities or colleges. I am pretty sure not much or no school at all in my country offers courses for this study unless the school is specifically for bitcoin and cryptocurrency related studies. There's Fintech which is financial technology an existing subject for those who want to study something related to cryptocurrency",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "May 26, 2024, 02:00:49 PM",
      "body": "Quote from: Kruw on May 26, 2024, 01:57:26 PMPeter Todd refers to it as \"Applied Cryptography\".Makes more sense and sound like a course that can be studied in any higher institution of learning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "0t3p0t",
      "created_time": "May 26, 2024, 02:03:28 PM",
      "body": "Quote from: Wapfika on May 26, 2024, 01:47:41 PMQuote from: Cryptomultiplier on May 26, 2024, 01:04:52 PM*If the study of fish is called fishery, what is the study of Bitcoin, cryptocurrency in general and the study of Blockchain technology called?So far cryptocurrency is still new that’s why there’s still no official word for study of crypto. Cryptography is the closest thing which blockchain started before cryptocurrency exist. Correct me if I’m wrong but the word crypto is derived from cryptography on cryptocurrency.Maybe in the future when the courses is already popular people will come up to the new terminology since this terms only come up if many people keep using it as slang then later on turns to be official name.I think it is called cryptology but I am not sure about that as well. 😅 Since blockchain and cryptocurrency uses cryptographic code thing maybe that is what it is called. But I am also excited to know what really is the correct term for that. Regardless of what it is called, one thing is for sure about cryptocurrency and that is we all love it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Filippo Spina",
      "created_time": "May 26, 2024, 02:07:18 PM",
      "body": "I learned so much about bitcoin when I decided to read more about cryptography as a whole.I think the forum user above that mentioned \"Applied Cryptography\" is 100% correct.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 26, 2024, 03:04:26 PM",
      "body": "Quote from: Cryptomultiplier on May 26, 2024, 01:04:52 PM*If the study of fish is called fishery, what is the study of Bitcoin, cryptocurrency in general and the study of Blockchain technology called?Thanks for adding this course info to my account, I was not aware of it before. To be honest, I never took any cryptocurrency course, I read articles online from different websites, when I was joining bounties, I had to write articles, and to write articles I had to get some knowledge about things, so I started reading articles online, daily 2 to 5 max. And with time, when I used that knowledge in writing my article it got expanded. And afterward, I spent time on this forum, and added a little knowledge day by day, just like this course knowledge added today.Speaking of what we should call it on the fact that the study of fish is called fishery, it doesn't have to be that way, like the study of finding the cause of disease is known as Epidemiology while it should be diseasery according to you. The terms could be different like the ones you already mentioned above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moreno233",
      "created_time": "May 26, 2024, 04:02:10 PM",
      "body": "Well most school call it Blockchain, at least the few that I know. There are could be other variations but I have not seen much. Maybe, depending on the university, they can create some areas of specializations within Blockchain. Quote from: stompix on May 26, 2024, 01:12:54 PMQuote from: Cryptomultiplier on May 26, 2024, 01:04:52 PM*If the study of fish is called fishery, what is the study of Bitcoin or cryptocurrency in general and the study of Blockchain technology called?The study of fish is called ichthyology, a fishery is a place where fish are caught or a place where commercial raising happens.So first find the Latin or greek word for Bitcoin/Blockchain and slap an ology at the end!What an answer In reality, that was how many courses of study were coined. I'm yet to know why it has to be Latin and Greek words, perhaps a little dive into the history of formal education might reveal the reason because they occupy a significant position in academics. In philosophy, Latin occupy a significant percent of the diction, same can be said of anthropology. Maybe the early scholars used Latin mostly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 26, 2024, 04:54:04 PM",
      "body": "I'm not sure what it's called in actual but I believe cryptology sounds good to me. However, cryptology may not be direct study of blockchain or cryptocurrencies but of all crypt practices in general. I believe we need to find a better term for it. The study of Bitcoin should be called Bitcoinology without any doubt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 26, 2024, 05:09:44 PM",
      "body": "Quote from: Cryptomultiplier on May 26, 2024, 01:59:42 PMWhile in Latin, Solidus electronicus quidam, (qui Anglice dicitur “Bitcoin”) is the terminology used to describe or refer to a certain electronic coin which we know as Bitcoin in English language. No, it's not, that's just one guy on Quora making things up, quidam doesn't have a place in naming an object. also, solidus is the name of a Latin coin, not the Latin name for the coin, that's nummus.Also, you're thinking way too much over this both things that cover the study of Bitcoin already exist, cryptography/cryptology!https://www.britannica.com/topic/cryptologyYou don't have sharkology, golden fishology, and something like that you still have ichthyology!Bitcoin is part of cryptography, everything about it was already invented previously, Satoshi just put it together under a different form.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "May 26, 2024, 05:10:24 PM",
      "body": "This is actually a beautiful topic, and it has got many things to learn from it, ranging from what the study of Bitcoin, cryptocurrency and Blockchain been called. And I think I kind of agree to what Sir \"Stompix\" suggested to first find the Latin or greek word for Crypto/Bitcoin/Blockchain and slap an ology at the end.That is;1. Crypto in Greek = Kryptos, which means hidden). whereas if you are to slap an \"ology\" at the end, it gives us Kryptology. (I.e Cryptology, the study of Crypto)2. Bitcoin in Latin = \"Solidus electronicus quidam\", which means \"A certain electronic coin\"). whereas if you are to slap an \"ology\" at the end, it gives us Electronicus-quidamology (i.e the study of Bitcoin)3. Blockchain in Latin = \"Bibliotheca electronica quaedam\", which means a certain electronic library). whereas if you are to slap an \"ology\" at the end, it gives us Electronica-quaedamology (i.e the study of the Blockchain)But however, I also tried using a short cut with ChatGPT, and this is what I got 👇QuoteThe study of cryptocurrency is often referred to as \"cryptoeconomics.\" This field combines elements of cryptography, computer science, economics, and game theory to analyze and understand the incentives, behavior, and mechanisms behind cryptocurrencies and blockchain technologies.Credit: ChatGPT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "May 26, 2024, 05:51:20 PM",
      "body": "I believe the field should encompass both blockchain technology and cryptocurrency. These two areas, while distinct, together provide a comprehensive understanding of the space. Cryptocurrency focuses on the market aspects, while blockchain delves into the underlying technology.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harapan",
      "created_time": "May 28, 2024, 12:54:22 AM",
      "body": "Quote from: btc78 on May 26, 2024, 01:59:58 PMAccording to my research, there's really no new made up word specific for bitcoin or cryptocurrency studies. They just add the word studies to it lol.Maybe it is not yet that well explored by many universities or colleges. I am pretty sure not much or no school at all in my country offers courses for this study unless the school is specifically for bitcoin and cryptocurrency related studies. There's Fintech which is financial technology an existing subject for those who want to study something related to cryptocurrency There isn't any description for that yet and that doesn't mean there will not be a word that describes or comprises the both of them.The explorations of the nature of bitcoin can outweighs the outcomes/results.Bitcoin is very broad and as such requires attention and flexibility to handle it and facilitates the operations all together.The description of this or to this bitcoin family is going to be quite difficult to fathom.Even the bitcoin's Whitepaper has no traces of such phenomenon or list.Bitcoin is a name to the most recognized cryptocurrency and as well uses block chain systems to carry out its activities and transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "May 28, 2024, 01:17:45 AM",
      "body": "Quote from: Kruw on May 26, 2024, 01:57:26 PMPeter Todd refers to it as \"Applied Cryptography\".Applied Cryptography seems to be very appropriate.We can study about economics, finance and technology and programming but it can be all theories meanwhile applied cryptography can talk about the application of all aspects mentioned. It also encompasses the decentralized nature of cryptocurrency by the word cryptography which means hidden or secret. Hopefully we can teach more people in actual institutions formally and officially with the reliable source materials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}