{
  "id": "topic_5424340",
  "title": "tabas",
  "author": "tabas",
  "created_time": "November 29, 2022, 09:51:18 PMLast edit: November 30, 2022, 07:50:22 PM by tabas",
  "content": "Those that still have their mentioned assets on Coinbase, you better withdraw it immediately they'll be stopping the support for these by January 2023 as per Coinbase's article but on Coindesk, it says December 5. Although from their website says that it won't be lost because as long as you still have the recovery phrase, you'll still be able to access it but it's better to have it on your own posession before anything else.Quote from: https://help.coinbase.com/en/wallet/getting-started/what-types-of-crypto-does-wallet-supportAs of January 2023, Coinbase Wallet will no longer be supporting the following assets and networks due to low usage: BCH, ETC, XLM and XRP.And the main reason why they're going to stop supporting these coins because of;Quote from: https://www.coindesk.com/business/2022/11/29/coinbase-wallet-quietly-delists-bitcoin-cash-ethereum-classic-ripples-xrp-and-stellars-xlm/Coinbase cited \"low usage\" as a reason for delisting the four coins, Sources: https://help.coinbase.com/en/wallet/getting-started/what-types-of-crypto-does-wallet-supportCoinbase Wallet to End Support for Bitcoin Cash, Ethereum Classic, Ripple's XRP and Stellar's XLM",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5424340",
  "comments": [
    {
      "author": "asriloni",
      "created_time": "November 29, 2022, 10:28:42 PM",
      "body": "I think that if it's better if you are still adding a note about it can still be recovered through recovering your phrase to the non custodial wallet. It seems like that if these days coinbase didn't even wanna try to keep the coins with low usage. that's a good decision by coinbase but this exchange site must also think to remove bunch of shit tokens that is still trading at coinbase. Coinbase has been losing its big name due to the listed bunch of shit scam tokens on its exchange site like braintrust.  The users from those coins that were removed by coinbase have been leaving it and they were moving to the non custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 30, 2022, 04:30:23 AM",
      "body": "@OP you shouldn't confuse the readers!Coinbase wallet and Coinbase exchange are different, Coinbase wallet is a non custodial wallet which mean you can get the seed phrase and then import it to other non custodial wallet. This mean anyone that use Coinbase wallet must not panic since you wouldn't loss your coins.I don't know if Coinbase exchange still support those token or not, but this article only mention about Coinbase wallet only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "November 30, 2022, 04:31:52 AM",
      "body": "This came as a surprise to me. They're not really the most popular altcoins but they're still within the top 30 altcoins in the market. And we have many thousands of altcoins. It is very possible of course that a lot of people have already ceased trading during this crypto winter. With the prices of majority of coins slowly falling down, it is expected that activities would also decrease. But low usage of XRP? It's the top 7 altcoin right now. ETC, XLM, and BCH are also ranked 20 plus. I'm not one of these coins' supporters, but where have they gone?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "November 30, 2022, 07:15:55 AM",
      "body": "Quote from: tabas on November 29, 2022, 09:51:18 PMThose that still have their mentioned assets on Coinbase, you better withdraw it immediately because they'll be stopping the support for these by January 2023 as per Coinbase's article but on Coindesk, it says December 5. Although from their website says that it won't be lost but it's better to have it on your own posession before anything else.As of January 2023, Coinbase Wallet will no longer be supporting the following assets and networks due to low usage: BCH, ETC, XLM and XRP.Coinbase cited \"low usage\" as a reason for delisting the four coins, Pretty weird because those 4 projects that they are delisting all seem to be pretty big crypto projets in my opinion. I mean especially XRP has a huge following and it is still rank 7 in terms of marketcap so i am not really sure if the reason for the delisting is really low usage. Also i don't really see why an other reason why Coinbase should delist those tokens. I mean they are not from direct competitors like Binance, Kucoin or Huobi. There were quite a few delistings in the last few months like the stop of support of USDC as a stablecoin from Binance. I wonder why this is happening. In the case of Binance not supporting USDC anymore it is pretty obvious though that Binance just wanted to harm Coinbase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fzkto",
      "created_time": "November 30, 2022, 09:05:55 AM",
      "body": "I don't know about wallet support for these coins, but I do know that Coinbase removed the XRP trading pair back when XRP had a court case with the SEC. But I'm surprised that the wallet stops supporting these coins as well. It makes you wonder how to store cryptocurrency, because it turns out that any wallet can stop supporting various cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "November 30, 2022, 10:01:14 AM",
      "body": "The four coins are in the top 25 rankings on coinmarketcap, but coinbase wallet chooses not to support them anymore, isn't it that a coin with a high enough ranking makes network transactions busy and profitable for coinbase? But many wallets are available so this won't be a problem, just move it to another non-custodial wallet that is safe and reliable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 30, 2022, 10:43:52 AM",
      "body": "This partial news is strange, but if Coinbase can ban coin in the wallet? What can also do? I thought the news is related to coinbase excchange, not the wallet.Based on this quote, then:QuoteCoinbase Wallet is a Self-Custody Crypto Wallet, Putting You in Control of Your Crypto, Keys, and Data. Now You Can Safely Store Your CryptoSo as long as you have your keys, what is the benefit of removing these coins? Or how will they do it? Do they control the servers and therefore your node will not connect or what?Otherwise, the Bitcoin Cash argument was that the fees in the Bitcoin network are high, today the fees are stable for a while and therefore there is no use in that currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 30, 2022, 07:49:10 PM",
      "body": "Quote from: asriloni on November 29, 2022, 10:28:42 PMI think that if it's better if you are still adding a note about it can still be recovered through recovering your phrase to the non custodial wallet. It seems like that if these days coinbase didn't even wanna try to keep the coins with low usage. that's a good decision by coinbase but this exchange site must also think to remove bunch of shit tokens that is still trading at coinbase. Coinbase has been losing its big name due to the listed bunch of shit scam tokens on its exchange site like braintrust.  The users from those coins that were removed by coinbase have been leaving it and they were moving to the non custodial wallet. That's why reading the whole thing in the article is what I'm putting on the thread so that it will be more clear and precise. I think this act by Coinbase is just the start and we will see them do something more by 2023.Quote from: Jawhead999 on November 30, 2022, 04:30:23 AM@OP you shouldn't confuse the readers!Coinbase wallet and Coinbase exchange are different, Coinbase wallet is a non custodial wallet which mean you can get the seed phrase and then import it to other non custodial wallet. This mean anyone that use Coinbase wallet must not panic since you wouldn't loss your coins.I don't know if Coinbase exchange still support those token or not, but this article only mention about Coinbase wallet only.My bad, I've forgotten to include that phrase that everyone who still has the seed phrase can still access it. I'll edit it right away. As for Coinbase exchange, there's no announcement about the delisting. It's probably just on the Coinbase wallet.Quote from: Fundamentals Of on November 30, 2022, 04:31:52 AMThis came as a surprise to me. They're not really the most popular altcoins but they're still within the top 30 altcoins in the market. And we have many thousands of altcoins. It is very possible of course that a lot of people have already ceased trading during this crypto winter. With the prices of majority of coins slowly falling down, it is expected that activities would also decrease. But low usage of XRP? It's the top 7 altcoin right now. ETC, XLM, and BCH are also ranked 20 plus. I'm not one of these coins' supporters, but where have they gone?They're popular IMO and never thought that it will be delisted except for BCH. I think the main reason is about the demand on their wallet itself and not the entire usage that's also counting outside usage. So, to be wise on their end, they have to cut everything that's not profitable on their platform anymore and these 4 coins are the ones.Quote from: Jackl87 on November 30, 2022, 07:15:55 AMPretty weird because those 4 projects that they are delisting all seem to be pretty big crypto projets in my opinion. I mean especially XRP has a huge following and it is still rank 7 in terms of marketcap so i am not really sure if the reason for the delisting is really low usage. Also i don't really see why an other reason why Coinbase should delist those tokens. I mean they are not from direct competitors like Binance, Kucoin or Huobi. There were quite a few delistings in the last few months like the stop of support of USDC as a stablecoin from Binance. I wonder why this is happening. In the case of Binance not supporting USDC anymore it is pretty obvious though that Binance just wanted to harm Coinbase.It might be surprising but if it's not beneficial to their company and wallet itself, that's the decision that they see. It means that their users aren't really using these coins thus, the low usage.Quote from: fzkto on November 30, 2022, 09:05:55 AMI don't know about wallet support for these coins, but I do know that Coinbase removed the XRP trading pair back when XRP had a court case with the SEC. But I'm surprised that the wallet stops supporting these coins as well. It makes you wonder how to store cryptocurrency, because it turns out that any wallet can stop supporting various cryptocurrencies.Just use another non-custodial wallet if you're for storing it for a long time so that you won't have any problem about delisting or being removed or better use a hardware wallet.Quote from: Strongkored on November 30, 2022, 10:01:14 AMThe four coins are in the top 25 rankings on coinmarketcap, but coinbase wallet chooses not to support them anymore, isn't it that a coin with a high enough ranking makes network transactions busy and profitable for coinbase? But many wallets are available so this won't be a problem, just move it to another non-custodial wallet that is safe and reliable.Exactly, not a problem to those that have huge funds on this wallet because you're free to move it and if you've got the seed phrase which mostly you should really have, you can access it again but with such announcements. Better move it to another one.Quote from: hugeblack on November 30, 2022, 10:43:52 AMThis partial news is strange, but if Coinbase can ban coin in the wallet? What can also do? I thought the news is related to coinbase excchange, not the wallet.Based on this quote, then:QuoteCoinbase Wallet is a Self-Custody Crypto Wallet, Putting You in Control of Your Crypto, Keys, and Data. Now You Can Safely Store Your CryptoSo as long as you have your keys, what is the benefit of removing these coins? Or how will they do it? Do they control the servers and therefore your node will not connect or what?I think that having that in their wallet support cost them money to add these coins included on the operation of their wallet. And by having that step, it'll save them more money.Quote from: hugeblack on November 30, 2022, 10:43:52 AMOtherwise, the Bitcoin Cash argument was that the fees in the Bitcoin network are high, today the fees are stable for a while and therefore there is no use in that currency.Yeah and we're starting to see this fork going lower not just in ranks but in terms of usage and demand. During the ATH, it was one of the coins that didn't went up much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "November 30, 2022, 08:47:14 PM",
      "body": "It’s seems harsh but I guess business is business. If those coins aren’t bringing in enough trades & obviously fees (which is what it’s all about for exchanges) then it makes sense to delist. I’m not sad to see BCH chosen as one to delist, it’s about time really that scam was unravelled.With regards to XRP it could just be ass covering by Coinbase because of the impending battle with the SEC.I had high hopes for XLM years ago but it seems to have failed to gain enough adoption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "November 30, 2022, 09:56:08 PM",
      "body": "Quote from: Strongkored on November 30, 2022, 10:01:14 AMThe four coins are in the top 25 rankings on coinmarketcap, but coinbase wallet chooses not to support them anymore, isn't it that a coin with a high enough ranking makes network transactions busy and profitable for coinbase? But many wallets are available so this won't be a problem, just move it to another non-custodial wallet that is safe and reliable.Wondering as well with XRP for a reason of low usage, probably there are bigger reason behind this.Coinbase wallet should give more time for the user to transact with their funds, they should still allow the withdrawal and just stop the depositing option for those specific coins. Whatever their reason is, better to move your crypto now while you still can, the good thing here is that a lot of options to choose from aside from coinbase wallet, so there is nothing to worry about here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "November 30, 2022, 11:08:04 PM",
      "body": "Quote from: hugeblack on November 30, 2022, 10:43:52 AMThis partial news is strange, but if Coinbase can ban coin in the wallet? What can also do? I thought the news is related to coinbase excchange, not the wallet.Based on this quote, then:QuoteCoinbase Wallet is a Self-Custody Crypto Wallet, Putting You in Control of Your Crypto, Keys, and Data. Now You Can Safely Store Your CryptoSo as long as you have your keys, what is the benefit of removing these coins? Or how will they do it? Do they control the servers and therefore your node will not connect or what?They can drop support for those coins from the user interface of new versions of the wallet, which would surprise users who don't know that they can import the backup seed into another wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goinmerry",
      "created_time": "November 30, 2022, 11:52:58 PM",
      "body": "It makes sense though to delist something that is not really in heavy usage. Just can't imagine how \"low\" the usage is especially for XRP which I think still has good volatility these days and trading volume is good. Regardless, I think Coinbase should also do some email notifications to notify their users. I said this because as a Coinbase email subscriber, I received no email about that. I'm sure not all users are used to reading announcements on their websites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "December 01, 2022, 01:37:07 AM",
      "body": "Quote from: tabas on November 30, 2022, 07:49:10 PMQuote from: Fundamentals Of on November 30, 2022, 04:31:52 AMThis came as a surprise to me. They're not really the most popular altcoins but they're still within the top 30 altcoins in the market. And we have many thousands of altcoins. It is very possible of course that a lot of people have already ceased trading during this crypto winter. With the prices of majority of coins slowly falling down, it is expected that activities would also decrease. But low usage of XRP? It's the top 7 altcoin right now. ETC, XLM, and BCH are also ranked 20 plus. I'm not one of these coins' supporters, but where have they gone?They're popular IMO and never thought that it will be delisted except for BCH. I think the main reason is about the demand on their wallet itself and not the entire usage that's also counting outside usage. So, to be wise on their end, they have to cut everything that's not profitable on their platform anymore and these 4 coins are the ones.I also don't care about BCH. They're destined to fail not only because they're a fake Bitcoin but also because they insist they are the real Bitcoin. That's a perfect strategy to fail. They know very well that they are just a fork of Bitcoin, an altcoin in other words, but they defraud people to think that they are the original Bitcoin. But all this is like telling the altcoins to do something about their activities. This is like an order to increase them whatever way they can, whether organic or fake, or else they would be kicked out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "December 01, 2022, 05:03:53 AM",
      "body": "Quote from: fzkto on November 30, 2022, 09:05:55 AMI don't know about wallet support for these coins, but I do know that Coinbase removed the XRP trading pair back when XRP had a court case with the SEC. But I'm surprised that the wallet stops supporting these coins as well. It makes you wonder how to store cryptocurrency, because it turns out that any wallet can stop supporting various cryptocurrencies.It seems to me that we are going to go back to the days in which if you had 10 different coins then you had 10 different wallets as well, these days having several coins has gotten way easier as wallets which support a great deal of coins have become the new normal, however since you are exposed to developments like this in which the wallet you use may drop support for your coins then I suppose it is still a good idea to have a wallet which supports exclusively our coins as a backup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "December 01, 2022, 09:37:15 AM",
      "body": "Quote from: DeathAngel on November 30, 2022, 08:47:14 PMIt’s seems harsh but I guess business is business. If those coins aren’t bringing in enough trades & obviously fees (which is what it’s all about for exchanges) then it makes sense to delist. I’m not sad to see BCH chosen as one to delist, it’s about time really that scam was unravelled.With regards to XRP it could just be ass covering by Coinbase because of the impending battle with the SEC.I had high hopes for XLM years ago but it seems to have failed to gain enough adoption.Yep, it's all about the fees and profitability and if Coinbase is no longer getting that much from these coins fees then it makes sense why they have to remove it and have to move on.Quote from: goaldigger on November 30, 2022, 09:56:08 PMWondering as well with XRP for a reason of low usage, probably there are bigger reason behind this.Coinbase wallet should give more time for the user to transact with their funds, they should still allow the withdrawal and just stop the depositing option for those specific coins. Whatever their reason is, better to move your crypto now while you still can, the good thing here is that a lot of options to choose from aside from coinbase wallet, so there is nothing to worry about here.They've given a date when people expect it to be removed. As for XRP, it's known that there's a SEC issue and aside from having low usage, that could be another reason for them to remove it. There's still a massive community these coins even majority of us dislike BCH, it's still breathing though.Quote from: goinmerry on November 30, 2022, 11:52:58 PMIt makes sense though to delist something that is not really in heavy usage. Just can't imagine how \"low\" the usage is especially for XRP which I think still has good volatility these days and trading volume is good. Regardless, I think Coinbase should also do some email notifications to notify their users. I said this because as a Coinbase email subscriber, I received no email about that. I'm sure not all users are used to reading announcements on their websites.They might have the metrics of its usage and analytics on their end but for sure they're not going to disclose it. As for notifications, I think that they've done that and it's also on their blog site to make everyone aware of it. Usually with delisting's, they're sending a notification to all of their users.Quote from: Fundamentals Of on December 01, 2022, 01:37:07 AMI also don't care about BCH. They're destined to fail not only because they're a fake Bitcoin but also because they insist they are the real Bitcoin. That's a perfect strategy to fail. They know very well that they are just a fork of Bitcoin, an altcoin in other words, but they defraud people to think that they are the original Bitcoin. But all this is like telling the altcoins to do something about their activities. This is like an order to increase them whatever way they can, whether organic or fake, or else they would be kicked out.That's the fate of a project that has thought they're better than bitcoin. Well, it's just one of them and there are more in the market. The impact of this could go as little to these coins to nothing. As long as they're still listed in other high volume exchanges, they'll just keep going and this is a personal decision of Coinbase.Quote from: Silberman on December 01, 2022, 05:03:53 AMIt seems to me that we are going to go back to the days in which if you had 10 different coins then you had 10 different wallets as well, these days having several coins has gotten way easier as wallets which support a great deal of coins have become the new normal, however since you are exposed to developments like this in which the wallet you use may drop support for your coins then I suppose it is still a good idea to have a wallet which supports exclusively our coins as a backup.I still remember them when Coinbase doesn't have that much, and many have been waiting and requesting for them to add more. Now, it's time for them to delist many that they've listed so, we're really going back to the time when there's lesser. We may see them add and have the replacement for these removed coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "December 01, 2022, 10:57:01 AM",
      "body": "BCH had its issues. I think more crypto enthusiasts will like this move. XLM had not been heard for a long time so yes, the trade volume might be getting lower as time passes by. With XRP though I have doubts. It almost sounds like an attack because I can still see many supporters of the said coin despite their problem with SEC which had been going on for a long time. And because of this, they might be pushed down harder to make investors pull their investments, those who are still expecting good news when everything clears out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "December 01, 2022, 01:02:26 PM",
      "body": "-  What coinbase wants to convey is simple, they are reminding all coinbase users that if you have the coins they mentioned, starting from Dec. 5, 2022, they no longer support it due to low usage. these these.In this regard, I am a bit doubtful and disagree, I think they have other reasons. Why did I say? For example XRP, they announced that it is one of the low usages, how will that happen if XRP is still included in the top 10 altcoins in this industry?So for those who still have the coins mentioned in coinbase, it is better that they can withdraw them before December 5, I just advise its users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "December 01, 2022, 01:59:54 PM",
      "body": "Quote from: Mr. Magkaisa on December 01, 2022, 01:02:26 PMIn this regard, I am a bit doubtful and disagree, I think they have other reasons. Why did I say? For example XRP, they announced that it is one of the low usages, how will that happen if XRP is still included in the top 10 altcoins in this industry?I think they are just referring to low usage on their exchange, not saying that all altcoins are currently low usage in the market but it can be said that these 4 altcoins have almost become obscured in the market and are not mentioned much. Other than XRP is still considered the top coin, the rest are ETC, BCH, XML, I don't see anyone mentioning or investing in it, to me these are altcoins that have died because they are no longer profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "December 01, 2022, 02:05:23 PMLast edit: December 02, 2022, 08:13:58 AM by cryptomaniac_xxx",
      "body": "Quote from: fzkto on November 30, 2022, 09:05:55 AMI don't know about wallet support for these coins, but I do know that Coinbase removed the XRP trading pair back when XRP had a court case with the SEC. But I'm surprised that the wallet stops supporting these coins as well. It makes you wonder how to store cryptocurrency, because it turns out that any wallet can stop supporting various cryptocurrencies.Yes, they removed and other exchanges as well with the SEC vs XRP case and up to know there are still no decision.I think the most interesting coin here is BCH, but I guess in this bear market, this one hype coins is dying or at least there are no volumes in Coinbase and so they will have to delist it as well.We haven't hear any uproar regarding the delisting, so I guess there's no issue from the project developer, and there are still exchanges that support it so I they are still good to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}