{
  "id": "topic_5441559",
  "title": "casperBGD",
  "author": "casperBGD",
  "created_time": "February 28, 2023, 01:43:34 PM",
  "content": "Bitcoin NFT su bili aktuelni par dana, i cini se da je fama oko toga u silaznoj putanji, ali eto koga zanima napravili smo uputstvo kako jednostavno napraviti Ordinals putem Xverse i gamma.iohttps://banklessadriadao.substack.com/p/kako-kreirati-bitcoin-nftu biti se moze platiti vise, ili cekati malo duze, u skladu sa trenutnom aktivnoscu na samom blokčejnu, ali je cela procedura vrlo jednostavna, i za oko 10 dolara se moze napraviti \"inscription\", ukoliko vreme nije problem",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441559",
  "comments": [
    {
      "author": "SirJohnVonSlotty",
      "created_time": "February 28, 2023, 03:28:48 PM",
      "body": "Jel možeš meni debilu pojasnit na što gledam ovdje? Zamisli da sam zlatni retriver koji je tek jučer shvatio kako blockchain funkcionira.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trofo",
      "created_time": "February 28, 2023, 06:31:44 PM",
      "body": "Quote from: casperBGD on February 28, 2023, 01:43:34 PMBitcoin NFT su bili aktuelni par dana, i cini se da je fama oko toga u silaznoj putanji, ali eto koga zanima napravili smo uputstvo kako jednostavno napraviti Ordinals putem Xverse i gamma.ioDi ste bili u prva dva dana dok nitko nije znao kako točno raditi inscription i jedino je postojala kombinacije BitcoinCore + full node + kompajl Ord walleta sa githuba? Namučio sam se ko pas da da taj dio pokrenem, danas više nije toliko zanimljivo kada svatko može koristiit neki od gotovih servisa i tutorijali skaču na sve strane  Nisam vidio ni jedan od tih servisa da traži rare satoshije još uvijek. Jel imaš tu kakav info, da li je i to postalo mainstream.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casperBGD",
      "created_time": "February 28, 2023, 07:46:42 PM",
      "body": "Quote from: SirJohnVonSlotty on February 28, 2023, 03:28:48 PMJel možeš meni debilu pojasnit na što gledam ovdje? Zamisli da sam zlatni retriver koji je tek jučer shvatio kako blockchain funkcionira. u biti ovo i jeste za ljude koji nisu previse upuceni u kripto, imas neki materijal (slika, video, bilo sta digitalno), upload servis (gamma.io) i Xverse novcanik koji podrzava Ordinals i pratis \"wizard\", ono sto dobijes je NFT (ili bolje receno digitalni predmet) na Bitcoin mrezi, povezan za odredjeni satoshi (bas zato moras da koristis Xverse novcanik koji omogucava da kreiras adresu za \"kolekcionarske elemente\") - ali u pitanju je common satoshiopet, hype oko svega toga je sada malo primirenQuote from: Trofo on February 28, 2023, 06:31:44 PM~snipDi ste bili u prva dva dana dok nitko nije znao kako točno raditi inscription i jedino je postojala kombinacije BitcoinCore + full node + kompajl Ord walleta sa githuba?pisali smo i o tome ukratko, ali u biltenu pre nedelju ili dve (nema publike za to )Quote from: Trofo on February 28, 2023, 06:31:44 PM~snipNisam vidio ni jedan od tih servisa da traži rare satoshije još uvijek. Jel imaš tu kakav info, da li je i to postalo mainstream.rare ti je prvi satoshi posle prilagodjavanja tezine PoW algoritma, nisam siguran kako mozes doci do prethodnih, a novi se pojavljuje na svakih 14 danamozda je lakse doci do uncommon - koji je prvi satoshi u svakom blokuuz to, imas i epic - prvi posle halvinga, legendary - prvi u svakom ciklusu (kad se poklope halving i prilagodjanje tezine algoritma) (ukupno 5 - do sada ih nije bilo) i mythic - prvi satoshi ikadaimas ovde malo vise o tome kako se trazehttps://docs.ordinals.com/guides/sat-hunting.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trofo",
      "created_time": "February 28, 2023, 10:06:14 PM",
      "body": "Quote from: casperBGD on February 28, 2023, 07:46:42 PMuz to, imas i epic - prvi posle halvinga, legendary - prvi u svakom ciklusu (kad se poklope halving i prilagodjanje tezine algoritma) (ukupno 5 - do sada ih nije bilo) i mythic - prvi satoshi ikadaimas ovde malo vise o tome kako se trazehttps://docs.ordinals.com/guides/sat-hunting.htmlZnam za to, ova stranica koju si linkao je jedina postojala kada sam ja to radio tako da sam je prošao uzduž i popreko. Dosta dobar tutorijal ali pisan za ljude koji znaju puno o bitcoin mreži i vrte svoj node godinama. Neke stvari sam morao rješavati metodom pokušaja i promašaja  Meni je to bio prvi ozbiljniji tehnički susret s bitcoin mrežom, prije sam uvijek prčkao po EVM compatible stvarima.Nismo se razumijeli, jasno mi je šta su \"rare\" satoshiji i kako se traže. Moje pitanje je bilo da li znaš za neki servis koji je to napravio mainstrim kao i dizanje ordinalsa. Ne treba mi, nego čisto onako iz znatiželje kao projekt koji bi možda mogao pokušati ako ne postoji a opet znam da neću jer nemam vremena.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slackovic",
      "created_time": "March 01, 2023, 09:05:39 AM",
      "body": "Ja nekako mislim da su ti Bitcoin ordinals samo prolazan hype. Netko se dosjetio načina kako iskoristiti Bitcoin blockchain za nešto čemu nije namijenjen i odmah su svi popizdili za time. Nije mi jasno koja bi bila prednost korištenja NFT-ova na Bitcoin blockchainu u odnosu na Ethereum blockchain. Možda imam takvo mišljenje jer mi se ne da uopće proučavati Bitcoin ordinals, ali ne da mi se proučavati upravo zato jer imam takvo mišljenje",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "March 04, 2023, 01:53:51 PM",
      "body": "Quote from: slackovic on March 01, 2023, 09:05:39 AMJa nekako mislim da su ti Bitcoin ordinals samo prolazan hype. Netko se dosjetio načina kako iskoristiti Bitcoin blockchain za nešto čemu nije namijenjen i odmah su svi popizdili za time. Nadajmo se da je tako. Od kako su se pojavili krajem Januara, mreža je često zagušena i ima desetine hiljada nepotvrđenih transakcija. Postalo je nemoguće poslati tranksaciju sa malom naknadom jer za njih nema mjesta u blokovima. Nadam se da će kroz mjesec ili dva ovo sve izgubiti na značaju i da će ti spammeri odlepršati negdje drugo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "March 08, 2023, 08:04:26 PM",
      "body": "Ne sviđa mi se sve ovo sa Bitcoin ordinals i mislim da potencijalno može biti sigurnosni problem za Bitcoin, ali za sve one koji imaju neke od ovih Bitcoin NFT gluposti iako se hype malo smanjio... čuo sam za prvi open source zero-fee trustless Bitcoin NFT marketplace OpenDEX.Ja ovo nisam koristio, pa istražite i testirajte sami na na vlastitu odgovornost:https://openordex.org/https://github.com/orenyomtov/openordex",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slackovic",
      "created_time": "March 09, 2023, 05:06:06 AM",
      "body": "Quote from: dkbit98 on March 08, 2023, 08:04:26 PMNe sviđa mi se sve ovo sa Bitcoin ordinals i mislim da potencijalno može biti sigurnosni problem za Bitcoin, ali za sve one koji imaju neke od ovih Bitcoin NFT gluposti iako se hype malo smanjio... čuo sam za prvi open source zero-fee trustless Bitcoin NFT marketplace OpenDEX.Ja ovo nisam koristio, pa istražite i testirajte sami na na vlastitu odgovornost:https://openordex.org/https://github.com/orenyomtov/openordexHvala za info. Dizajn je Windows 98 stil što me užasno zivcira ali OK. Možda se nekome sviđa... Što se tiče kolekcija, nema ih puno  za izbor jer su glavne stranice za prodaju Bitcoin NFT-ova ordswap.io i ordinalswallet.ioMene zanima zašto misliš da bi ordinals mogli biti sigurnosni problem za BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trofo",
      "created_time": "March 09, 2023, 06:42:46 AM",
      "body": "Quote from: slackovic on March 09, 2023, 05:06:06 AMMene zanima zašto misliš da bi ordinals mogli biti sigurnosni problem za BTC.Ne znam na šta je kolega mislio ali meni prvo pada na pamet sigurnosni problem kroz smanjenu decentralizaciju. Raste veličina BTC chaina značajno kao i vrijeme za sinkronizaciju full noda.Trenutno je BTC chain preko 600 GB na mom hardu, i trebalo mu je više od 1 dana za sync. Tu moraš uzeti u obzir da je velika većina prostora i sync time potrošena na zadnjih par godina kada su blokovi postali popunjeniji. S ordinalsima blokovi se pune još više i znatno povećavaju potrebu za većim hardom i sync time. Sad uzmi u obzir sa su to podaci sa apsolutno najbržim hardom koji možeš kupiti legalno kod nas spojenim direktno na x16 PCIe sabirnicu i 12 GB rama rezervirano za node. Koliko vremena prije nego privatni korisnici potpuno odustanu od BTC full node? Spomenuti zahtjevi nisu veliki za korporacije ali već su na granici za privatne a ordinalsi će ih gurnuti preko granice ubrzo. Razlika cijene SSDa od 1 TB ili 2TB kod takvih brzina nije mala.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slackovic",
      "created_time": "March 09, 2023, 08:29:17 AM",
      "body": "Quote from: Trofo on March 09, 2023, 06:42:46 AMQuote from: slackovic on March 09, 2023, 05:06:06 AMMene zanima zašto misliš da bi ordinals mogli biti sigurnosni problem za BTC.Ne znam na šta je kolega mislio ali meni prvo pada na pamet sigurnosni problem kroz smanjenu decentralizaciju. Raste veličina BTC chaina značajno kao i vrijeme za sinkronizaciju full noda.Trenutno je BTC chain preko 600 GB na mom hardu, i trebalo mu je više od 1 dana za sync. Tu moraš uzeti u obzir da je velika većina prostora i sync time potrošena na zadnjih par godina kada su blokovi postali popunjeniji. S ordinalsima blokovi se pune još više i znatno povećavaju potrebu za većim hardom i sync time. Sad uzmi u obzir sa su to podaci sa apsolutno najbržim hardom koji možeš kupiti legalno kod nas spojenim direktno na x16 PCIe sabirnicu i 12 GB rama rezervirano za node. Koliko vremena prije nego privatni korisnici potpuno odustanu od BTC full node? Spomenuti zahtjevi nisu veliki za korporacije ali već su na granici za privatne a ordinalsi će ih gurnuti preko granice ubrzo. Razlika cijene SSDa od 1 TB ili 2TB kod takvih brzina nije mala.Hm... Da, vidiš, nisam razmišljao o veličini samog blockchaina. Zapravo nije bio problem kad su se samo tekstualne datoteke spremale na blockchain ali sad se spremaju i slike. I to na tisuće i tisuće svakakvih pikseliziranih sranja koje vjerojatno neće nikad vrijediti, a zauvijek će ostati.A sad te moram pitati... Zašto imaš BTC full node? Jasno mi je da se ljudi zalažu za decetralizaciju i što je više BTC full node-ova, to je veća decentraliziranost samog BTC-a. Ali ako to znači da moram potrošiti relativno puno novaca na kupnju 1 TB SSD i 12 GB RAM-a rezervirati samo za to. Skupa je to igra...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trofo",
      "created_time": "March 09, 2023, 08:46:00 AM",
      "body": "Quote from: slackovic on March 09, 2023, 08:29:17 AMA sad te moram pitati... Zašto imaš BTC full node? Jasno mi je da se ljudi zalažu za decetralizaciju i što je više BTC full node-ova, to je veća decentraliziranost samog BTC-a. Ali ako to znači da moram potrošiti relativno puno novaca na kupnju 1 TB SSD i 12 GB RAM-a rezervirati samo za to. Skupa je to igra...Zato da napravim svoj dio za sigurnost BTC mreže, svaki pravi crypto entuzijast mora imati full node  Šalim se malo, uglavnom sam uvijek sve radio na EVM compatible chainovima, vrtio ETH node nekada, pisao smart contracte i onda sada kada su krenuli ordinalsi, rekao ajde da vidim kako to izgleda na BTC mreži. Bilo je zanimljivo prvih tjedan dana prije nego su razne usluge krenule, sada mi je već dojadilo pa node više nije u pogonu ali je spreman za pogon uz jedno pol sata synca.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "March 09, 2023, 03:32:55 PM",
      "body": "Quote from: Trofo on March 09, 2023, 06:42:46 AMKoliko vremena prije nego privatni korisnici potpuno odustanu od BTC full node? Spomenuti zahtjevi nisu veliki za korporacije ali već su na granici za privatne a ordinalsi će ih gurnuti preko granice ubrzo. Razlika cijene SSDa od 1 TB ili 2TB kod takvih brzina nije mala.Možda će ažurirati Taproot s novim ograničenjima, ne vidim drugi način da se to ''popravi''.Slažem se da bi to mogao biti problem u budućnosti, ali u usporedbi s ethereum nodom situacija sa Bitcoinom je puno bolja, i ljudi zbog toga sigurno neće odustati od nodova.SSD je sve jeftiniji i još će padati za veće diskove, npr sada se 1 TB nov SSD može naći za $39.60, a ako hoćeš veći TBF i bolji kvalitet plati par dolara više:https://diskprices.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}