{
  "id": "topic_5445986",
  "title": "Bitcoinmoon12",
  "author": "Bitcoinmoon12",
  "created_time": "March 23, 2023, 04:10:32 AM",
  "content": "Arthur Hayes, the former CEO of BitMEX, recently spoke to David Hoffman on the Bankless Podcast and shared his thoughts on Bitcoin’s future.He explained that the liquidity for the Bitcoin Treasury Float Plan (BFTP) remains locked until rates drop, at which point Bitcoin will rise significantly. However, he dismissed the idea that Bitcoin will hit $1 million in 90 days.Hayes clarified that he believes Bitcoin can reach $1 million during this cycle, which he expects to be within the next two to three years. He discussed how BTC could achieve this milestone and began by distinguishing between inside money and outside money.Inside money, according to Hayes, is a liability on someone else’s balance sheet, such as dollars, yen, euro, yuan, stocks, and bonds. Crucially, what distinguishes it is that “you can’t utilize these things without interfacing with the fiat financial system and the people that are deputized to act in it,” he said.On the other hand, outside money is not a liability on someone’s balance sheet, such as gold, real estate, and Bitcoin. Outside money is advantageous over inside money because the banking system does not affect it.Hayes explained that outside money is desirable when the Federal Reserve is propping up the entire banking system, adding that banks holding BFTP-qualifying assets cannot go bust. Under this setup, the money supply expands infinitely at some point, resulting in price appreciation for outside money assets such as Bitcoin.While Hayes dismissed the idea of Bitcoin hitting $1 million in 90 days, he believes that Bitcoin can achieve this milestone in the next two to three years. This prediction is consistent with the view of many cryptocurrency experts who believe that Bitcoin’s price will continue to rise in the long term.Hayes’ views on Bitcoin’s future are essential, given his background in the cryptocurrency industry. As the former CEO of BitMEX, a leading cryptocurrency derivatives exchange, Hayes has extensive knowledge of the cryptocurrency market and its workings.In conclusion, Arthur Hayes believes that Bitcoin can reach $1 million during this cycle, but not in 90 days. He explained that Bitcoin’s outside money status is advantageous over inside money and will result in price appreciation in the long term. While his prediction is just one among many, it is essential to consider his insights as a former CEO of a major cryptocurrency exchange.Source: https://azcoinnews.com/bitmex-founder-arthur-hayes-predicts-bitcoin-to-reach-1-million-within-2-3-years-dismisses-90-day-timeline.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445986",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "March 23, 2023, 04:53:33 AM",
      "body": "Yes, well, we all believe it will reach a million, the question is when, and I don't have to believe this man any more than I believed this one.John McAfee Will Eat His D**k If Bitcoin Doesn’t Hit $1,000,000 By 2020In 2021 Dan Held predicted that we would reach half a million this cycle. Then there is another who has made a bet that it will reach one million in three months:QuoteBalaji Srinivasan has made a millionaire bet on Bitcoin’s price over the next 90 days, predicting the cryptocurrency will reach $1 million by June 17. I think it's going to take a lot longer than all these predictions. Half a million within a couple of cycles would be pretty good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "March 23, 2023, 05:21:46 AM",
      "body": "I don't sure with any high predicting about Bitcoin reach $1 million without two or three years later because have got the same predicted about bitcoin reach higher price and at the last bitcoin drop. Realistic bitcoin not always can't reach higher price and some time drop more than unpredictable after last years from $64K become under $20K. I believe with many speculation about bitcoin will back to higher price, but not guarantee with bitcoin will stable and exist on the top price because many experience after raising to higher price drop and need more than several months until one year recovery before have stable higher price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "March 23, 2023, 05:25:49 AM",
      "body": "Within 2 - 3 years, it is nothing compares to in 90 days which is a bet from Former Coinbase CTO.Former Coinbase CTO Places $2 Million Bet That Bitcoin Will Hit $1 Million In 90 DaysI did not know where he placed his bet? Or he just bet with his mouth and words.Don't believe them as they won't lose anything with their mouths and words except their reputation but you will lose your money if you believe in them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "March 23, 2023, 05:29:44 AM",
      "body": "A high hope on Bitcoin hitting $1M pretty soon is so much these days, I don't know what should have triggered such high hopes. The first Twitter I read about this, and perhaps the first person that initiated a theory on it is Balaji Srinivasan. He claimed the coin will reach the target in 90 days, but that's not just possible.It started when the US banks are having issues and were exposed by FED, and I believe that the apex bank would surely give enough bailout in this regard. So, Bitcoin reaching $1M, well, I don't know, maybe in years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YUriy1991",
      "created_time": "March 23, 2023, 05:44:11 AM",
      "body": "I think Hayes discussed the most likely way forward for Bitcoin after its rapid 30% rally. Hayes did not provide a specific price target for Bitcoin, but he did suggest that Bitcoin's future remains uncertain until it is clear what fueled its recent price hike.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "March 23, 2023, 07:23:40 AM",
      "body": "I don't trust the same guy who was found guilty of various counts for manipulating orders on the Bitmex exchange. This is more like another deluded Mcafee that the Bitcoin community has missed so much, they are not different from the way they all do their predictions, but Bitcoin welcomes everyone, but the smart ones understand the ways of bitcoin better.If Bitcoin reaches a million dollars today, I will be happy, but I feel that when making these predictions, one must be very logical, you don't just open your mouth and vomit whatever comes to the mind, it must be supported by an explanation, even if it is still a prediction and speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "March 23, 2023, 07:55:24 AM",
      "body": "I have faith in the future of bitcoin, the value of bitcoin will be much greater than it is now, that's all I can say. As for accurately predicting the bitcoin price, I'm sure no one can do it, if anyone says the bitcoin price will hit $1 million in the next 90 days or 3 years, that's bragging. They are just saying what they think or they are trying to gain attention to increasing their influence in the market. There aren't any experts in the market, they're just like us, it's all just predictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "March 23, 2023, 08:08:10 AM",
      "body": "Whether it's a known name that is predicting that bitcoin will reach $1M, it is for sure that it will happen but it's only a matter of time. But why is it that I'm feeling that these predictions are coming out when the bull run is being shown as a sign that we'll be there anytime soon? The only guy that I've seen that's very consistent in predicting the market bullish no matter what the situation of the market is was Tim Draper. Bull or bear markets, he's predicting bitcoin to reach certain highs but yeah, accuracy was the problem of his predictions. But as what they're saying with the future price of bitcoin, the prices that he's given will also surely gonna be hit someday.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "March 23, 2023, 08:35:43 AM",
      "body": "When people go left, the right way is the RIGHT, since BitMEX Founder isn't the only one talking about 1 Million per Bitcoin, brothers, and sisters, it's never going to come true, this reminds me of the 100k Bitcoin in 2020, almost everyone was saying that Bitcoin is going to 100k, this got into some peoples head and they held to their BTC and failed to take profit, unless Bitcoin lost its steam in January of 2022..Avoid following the crowd, follow a different path, believe in yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "March 23, 2023, 09:57:40 AM",
      "body": "Just when you thought people had beaten the 1-million dollar dead horse to smithereens, another dude comes out of the woodwork -- from the McAfee era too.Not that I don't like/dislike the guy, just thought he'd be happy he's escaped quite a lot of the storm with reasonable comfort.I'd love for a million dollar Bitcoin sure, but yeah as said above. The more people come out and say it, the less likely it's happening. Not in this 2/3 years anyway. Maybe let's revisit 100k first?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "March 23, 2023, 10:03:19 AM",
      "body": "It’s certainly possible to reach $1,000,000 in 2-3 years but it would take a disastrous depression and probable collapse of fiat currencies. I think what’s far more likely is $200,000 give or take $50,000 in either direction. I think we will definitely see in that price range 12-18 months or so after the next halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 23, 2023, 10:34:15 AM",
      "body": "I think bitcoin could eventually reach $1 million, but I don't think it's going to be 90 days or 2-3 years. I rather assume that it will take longer. After all, bitcoin has not even reached a price of $100k and that has to be reached first. In my opinion we can only expect a price of $1 million in 8-10 years if everything goes on as before. Sure, it would be nice if it were sooner, but don't count on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "March 23, 2023, 11:13:07 AM",
      "body": "I like how media play with words \"believe\" and \"predict\". Hayes only believe that it is possible for Bitcoin to reach such huge value, but the media has quickly converted that into prediction, like Hayes is some kind of financial analytics and started hype. That \"within 2-3 years\" is also raise doubts. That means that banks and huge part of financial sector must fail, to help Bitcoin to grow in value 37 times. I think government/governments will try to save banks and economy from fall. It will take many years for Bitcoin to reach one million.P.S. I believe that one day I will become rich, I dream of becoming rich, but that does not mean I predict that one day I will become rich",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Grim_Fandango",
      "created_time": "March 23, 2023, 11:22:18 AM",
      "body": "That is more whishful thinking on his part rather than anything else as I simply dont see Bitcoin making x40 in the next 2-3 years and i dont think that he really thinks that either but its in his interest to remain bullish.People should not listen to such predictions and instead just do focusing on acquiring more bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "March 23, 2023, 12:53:38 PM",
      "body": "There will come a time when bitcoin will reach a million dollars, but it's never going to happen in the next bull market. If you are a crypto trader and know how to study prices through charts, you know that this price in a few years is impossible; bitcoin's last high was 60,000+ and in the next bull market, I think we can easily break through 100,000$ or even more, and people are using and tweeting about one million dollars per Bitcoin on purpose. In the hope that some investors who are not familiar with price action will FOMO in and keep holding while they should be selling, they want to create hype and make-believe. If you believe this, it's your fault.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bushdark",
      "created_time": "March 23, 2023, 01:26:53 PM",
      "body": "Quote from: SquirrelJulietGarden on March 23, 2023, 05:25:49 AMWithin 2 - 3 years, it is nothing compares to in 90 days which is a bet from Former Coinbase CTO.Former Coinbase CTO Places $2 Million Bet That Bitcoin Will Hit $1 Million In 90 DaysI did not know where he placed his bet? Or he just bet with his mouth and words.Don't believe them as they won't lose anything with their mouths and words except their reputation but you will lose your money if you believe in them. I don't think this can that true because why would a person bet with that kind of huge amount of money to make a bet on Bitcoin. The cryptocurrency market is down now and we are not even sure what will happen next whether the price of Bitcoin will go down more or continue going up. The market is going to reach that level where everyone of us that are investors would be happy for the market bullish movement but the problem is that we don't even know when this is going to happen. Maybe he's just want to be on the headline news for placing a bet on Bitcoin to reach $1 million.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 23, 2023, 01:51:02 PM",
      "body": "Such comments are like (I say statements, therefore I am present), it is just a media hype to be hosted on one of the channels and ask him why you think the price of bitcoin will rise, including a lot of nonsense to prove that point of view.It is difficult for us to reach the price of $100,000 over the next three years, let alone half a million to a million.His words would be logical if he said in the next 20 years or 30 years, but the basis of this statement is to create an uproar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoverDoane",
      "created_time": "March 23, 2023, 02:10:25 PM",
      "body": "Quote from: Bitcoinmoon12 on March 23, 2023, 04:10:32 AMArthur Hayes, the former CEO of BitMEX, recently spoke to David Hoffman on the Bankless Podcast and shared his thoughts on Bitcoin’s future.He explained that the liquidity for the Bitcoin Treasury Float Plan (BFTP) remains locked until rates drop, at which point Bitcoin will rise significantly. However, he dismissed the idea that Bitcoin will hit $1 million in 90 days.Hayes clarified that he believes Bitcoin can reach $1 million during this cycle, which he expects to be within the next two to three years. He discussed how BTC could achieve this milestone and began by distinguishing between inside money and outside money.Inside money, according to Hayes, is a liability on someone else’s balance sheet, such as dollars, yen, euro, yuan, stocks, and bonds. Crucially, what distinguishes it is that “you can’t utilize these things without interfacing with the fiat financial system and the people that are deputized to act in it,” he said.On the other hand, outside money is not a liability on someone’s balance sheet, such as gold, real estate, and Bitcoin. Outside money is advantageous over inside money because the banking system does not affect it.Hayes explained that outside money is desirable when the Federal Reserve is propping up the entire banking system, adding that banks holding BFTP-qualifying assets cannot go bust. Under this setup, the money supply expands infinitely at some point, resulting in price appreciation for outside money assets such as Bitcoin.While Hayes dismissed the idea of Bitcoin hitting $1 million in 90 days, he believes that Bitcoin can achieve this milestone in the next two to three years. This prediction is consistent with the view of many cryptocurrency experts who believe that Bitcoin’s price will continue to rise in the long term.Hayes’ views on Bitcoin’s future are essential, given his background in the cryptocurrency industry. As the former CEO of BitMEX, a leading cryptocurrency derivatives exchange, Hayes has extensive knowledge of the cryptocurrency market and its workings.In conclusion, Arthur Hayes believes that Bitcoin can reach $1 million during this cycle, but not in 90 days. He explained that Bitcoin’s outside money status is advantageous over inside money and will result in price appreciation in the long term. While his prediction is just one among many, it is essential to consider his insights as a former CEO of a major cryptocurrency exchange.Source: https://azcoinnews.com/bitmex-founder-arthur-hayes-predicts-bitcoin-to-reach-1-million-within-2-3-years-dismisses-90-day-timeline.htmlThank you for the information, I was greatly helped thanks to your writing, because I also believe and see the development of bitcoint that it will be difficult to reach that value within 90 days, it takes more time to reach its highest value, and bitcoint will continue to increase in value from time to time with the economic situation and market demand continues to increase, that's clear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "March 23, 2023, 04:50:42 PM",
      "body": "That's waaaay too much but I understand his optimistic approach. He is the founder of Bitmex, what was he suppose to say, we are going down? Or we are going to be 50k in 3 years? That's not title worthy prediction, that would not even get you through the door for any article to be fair, the best thing to say is a few million dollars, that way you would actually get some attention.He could have gone even further, say that we will be 10+ million dollars in 10 years, which people would believe because it is 10 years and when we are talking about that much further ahead, nobody really knows what's going to happen, it could be 100k, it could be 10m, who knows?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}