{
  "id": "topic_5416731",
  "title": "simonjlovett",
  "author": "simonjlovett",
  "created_time": "October 11, 2022, 02:26:15 PM",
  "content": "Hi,I am looking to buy an old Bitcoin Forum account that was started in like 2009-2010. If you know someone that has that wants to sell or give away an old one they dont use. Please send me a message.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416731",
  "comments": [
    {
      "author": "_act_",
      "created_time": "October 11, 2022, 02:59:19 PM",
      "body": "Why? For official reason like to be able to post image and reduce newbie restrictions? Buy copper membership. Check below link for it:https://bitcointalk.org/index.php?topic=2385104.msg24371150#msg24371150There are some reasons not to buy an account, old accounts could have plagiarism in the last and this can lead to permaban if known after you bought the account.For other reasons, better to register new account and post good and rank up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "October 11, 2022, 03:00:20 PM",
      "body": "Quote from: simonjlovett on October 11, 2022, 02:26:15 PMHi,I am looking to buy an old Bitcoin Forum account that was started in like 2009-2010. If you know someone that has that wants to sell or give away an old one they dont use. Please send me a message.Well quoted this for future evidence. Buying and selling accounts were highly discouraged on the forum, perhaps DT members will put a negative tag on your account because of this.It is forum rule #18 [ https://bitcointalk.org/index.php?topic=703657.0 ].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simonjlovett",
      "created_time": "October 11, 2022, 03:27:55 PM",
      "body": "Quote from: _act_ on October 11, 2022, 02:59:19 PMWhy? For official reason like to be able to post image and reduce newbie restrictions? Buy copper membership. Check below link for it:https://bitcointalk.org/index.php?topic=2385104.msg24371150#msg24371150There are some reasons not to buy an account, old accounts could have plagiarism in the last and this can lead to permaban if known after you bought the account.For other reasons, better to register new account and post good and rank up.Its actually for petty reasons, I dont use this forum actually, just having a competition with some friends about who can prove they have known about crypto the longest. completely petty I know. the account can be never used, just need the date around then as I have a friend that can prove 2011.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simonjlovett",
      "created_time": "October 11, 2022, 04:03:53 PM",
      "body": "yeah thought that may be the case, thank you though",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 11, 2022, 04:32:59 PMLast edit: October 11, 2022, 06:32:53 PM by PX-Z",
      "body": "Quote from: simonjlovett on October 11, 2022, 03:27:55 PMIts actually for petty reasons, I dont use this forum actually, just having a competition with some friends about who can prove they have known about crypto the longest. completely petty I know. the account can be never used, just need the date around then as I have a friend that can prove 2011. Eh? For what reason, is there a bet/reward for it? Or what benefits it will give for you or to your friend?Having an old account doesn't mean you have broader knowledge regarding bitcoin/crypto (you can learn now and brag it to anyone). It doesn't mean you're the original owner too (well, you are here for that reason too). But yeah, you can be called OG's as old members. Well, can't help it, anyone have their reasons. Friendly advice, just don't let anyone know or else that account will be ruined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "October 11, 2022, 05:24:12 PM",
      "body": "Quote from: simonjlovett on October 11, 2022, 02:26:15 PMHi,I am looking to buy an old Bitcoin Forum account that was started in like 2009-2010. If you know someone that has that wants to sell or give away an old one they dont use. Please send me a message.Then correct your Subject (topic). QuoteWant old Bitcoin account  There is different between Bitcoin account and bitcointalk account.  Bitcoin account is also known as bitcoin wallet which is like the normal wallet we used in keeping or storing cash, but bitcoin account is for online storing of fund or coins.While bitcointalk account is the bitcoin forum account here which is used to discuss the development, projects, and others activities on bitcoin so if you are looking for bitcoin account, it is not possible unless you can get it from your best friend that he or she is not using it again. But if you are looking for old Bitcointalk account, people have given you the options to choose. Either you buy a copper member or you post quality post to rank up. Though you might see someone selling it but it is not the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "r_victory",
      "created_time": "October 11, 2022, 06:03:56 PM",
      "body": "Quote from: _act_ on October 11, 2022, 02:59:19 PMWhy? For official reason like to be able to post image and reduce newbie restrictions? Buy copper membership. This practice, in addition to being prohibited and not encouraged here on the forum, is usually for the wrong reasons, such as scams for example.I'm sure it's not just for posting images or other restrictions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "October 11, 2022, 06:05:38 PM",
      "body": "Quote from: simonjlovett on October 11, 2022, 03:27:55 PMIts actually for petty reasons, I dont use this forum actually, just having a competition with some friends about who can prove they have known about crypto the longest. completely petty I know. the account can be never used, just need the date around then as I have a friend that can prove 2011. It is great that you are trying to use an old account. I can provide an old account which has been created in 2009 the username of the account is 420-420 and the password is the same as the username. Please send me tips for the account to my wallet.Do you not think it is one kind of crime instead of fun??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "simonjlovett",
      "created_time": "October 22, 2022, 04:17:38 AM",
      "body": "Quote from: _act_ on October 11, 2022, 02:59:19 PMThis practice, in addition to being prohibited and not encouraged here on the forum, is usually for the wrong reasons, such as scams for example.I'm sure it's not just for posting images or other restrictions.Ah okay didn't know it would be looked at like that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 22, 2022, 06:08:18 AM",
      "body": "Quote from: simonjlovett on October 11, 2022, 03:27:55 PMIts actually for petty reasons, I dont use this forum actually, just having a competition with some friends about who can prove they have known about crypto the longest. completely petty I know. the account can be never used, just need the date around then as I have a friend that can prove 2011.You have a weird definition of \"proving\". Lying to your friends isn't.Anyway, the proper way to prove ownership of Bitcoin is by signing a message from an address that was funded a long time ago. Many of them are leaked, so there you can find great new ways to lie to your friends.Or just go full retard and claim you're Satoshi, some idiots get quite famous doing this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}