{
  "id": "topic_5445155",
  "title": "Mrbluntzy",
  "author": "Mrbluntzy",
  "created_time": "March 16, 2023, 11:54:18 AM",
  "content": "I apologize if this is a dumb question but the fact is that I don't know why. My question is, why is Bitcoin market always affected by all economics news, example is the issues with US bank like the SVB. Thank you",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445155",
  "comments": [
    {
      "author": "Dickiy",
      "created_time": "March 16, 2023, 12:43:52 PM",
      "body": "I think not only bitcoin, like currency trading, stocks, bonds and others are also very sensitive to economic news because it will affect demand in the market resulting in price volatility. The SVB incident certainly makes investors doubt the continuity of financial management at banks and of course has an impact on fiat currency confidence, and its position here if I mean we are in the phase of looking for the best financial system, and indirectly this can be called a war of the two systems finance.if the fiat bank crashes then the profit is bitcoin because investors' trust will return to bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 16, 2023, 02:28:28 PM",
      "body": "Quote from: Mrbluntzy on March 16, 2023, 11:54:18 AMMy question is, why is Bitcoin market always affected by all economics news, example is the issues with US bank like the SVB.The effect of nees affects bitcoin price there's no doubt but not all the news and nit to a reasonable extent it got to affect it, bitcoin price has many other factors that dictates the flow of it price conditions of which the role and influence of news is one, demand and supply is another reason to this, only the economic and financial news on digital technology has more impact especially when the news is captivating a d fast circulating on certain event or occurrence believed to be true or false.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "firesurfer",
      "created_time": "March 16, 2023, 04:06:55 PM",
      "body": "It is the volatility of Intermarket influence. There is a balance between assets-economic overview-international relations, political situation-economic indicators-monetary policy.If one of the above factors changes the other values will follow, so don't be surprised. Try to study the Intermarket and you will see that everything makes sense and maybe you will make the right judgment in your trades.Bitcoin is also just one of the products on the market and is especially volatile due to its extremely small capitalization compared to the rest of the markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "March 16, 2023, 04:11:38 PM",
      "body": "The market capacity of Bitcoin is still small, which did not maintain one trillion for a while, while to reach stability, I think we need a market capacity between 5 trillion to 15 trillion, which means that we are still very early.In order to reach that capacity, the demand must increase, which may take from 5 years to 30 years, which is sufficient time for this technology to mature or be replaced.If you notice, the percentage of impact in recent years is much lower than the situation was several years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unbunplease",
      "created_time": "March 16, 2023, 09:34:32 PM",
      "body": "The answer to the question about the impact of economic events on bitcoin is quite simple - now traders who trade on regular exchanges and on cryptocurrency exchanges are practically the same persons. Big capital has been coming into the cryptocurrency world for a long time, and it has brought its own rules of the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "March 16, 2023, 10:32:12 PM",
      "body": "Simply because its market value is dependent with demand and demand can be influenced by many factors. In such way that demand is changing because of factors, it reflects to the market price of Bitcoin and also other cryptos. This have been asked countless times but volatility itself is not something to be understood by anyone especially new ones in this industry.Quote from: Dickiy on March 16, 2023, 12:43:52 PMI think not only bitcoin, like currency trading, stocks, bonds and others are also very sensitive to economic news because it will affect demand in the market resulting in price volatility. The SVB incident certainly makes investors doubt the continuity of financial management at banks and of course has an impact on fiat currency confidence, and its position here if I mean we are in the phase of looking for the best financial system, and indirectly this can be called a war of the two systems finance.if the fiat bank crashes then the profit is bitcoin because investors' trust will return to bitcoin.I agree, all investments and assets are having volatile market value. Or should I say anything in the market or any industry that market prices are dependent with demand. Determinant of the market price is demand and supply, also volume. As long as these determinants are being affected,  expect changes as well with their market value.Quote from: Unbunplease on March 16, 2023, 09:34:32 PMThe answer to the question about the impact of economic events on bitcoin is quite simple - now traders who trade on regular exchanges and on cryptocurrency exchanges are practically the same persons. Big capital has been coming into the cryptocurrency world for a long time, and it has brought its own rules of the game.Not all traders in this industry are traders of stock market, I assume. Also, it is not only economic events which affect the market price of any asset.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "March 16, 2023, 11:08:21 PM",
      "body": "Quote from: Mrbluntzy on March 16, 2023, 11:54:18 AMMy question is, why is Bitcoin market always affected by all economics news, example is the issues with US bank like the SVB. Thank you How did tesla stock go from $300 down to $100 and back to $200 inside of the last 6 months.Image link:  https://i.ibb.co/CB29Ppk/tesla-crazy.jpgThe same principles and market mechanics behind wild stock market swings of the last 3 years.Are similar if not identical to the ones behind BTC price movement. \"Market speculation.\"Bitcoin exhibiting lower volatility in contrast to US stocks like tesla in 2022, should be noteworthy. Why is it not being discussed more?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "March 16, 2023, 11:10:19 PM",
      "body": "Exactly as others stated, its basically people who are in the market. When you have something as huge as this happening somewhere, it would be impossible to ignore it, you and I may not be affected by it because I am not American, and this bank doesn't directly impact me at all, it could crash to zero all I care and I wouldn't mind. However, when we are talking about a situation where everyone there gets affected and gets out of the market, then the price drops, so I get affected as well, so I get out, and you get affected, then you get out and.. as you can see there is a chain of reaction. Works both up and down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "March 16, 2023, 11:54:53 PM",
      "body": "quite literally every investment instrument was affected by these news, this is because the relevancy of the news that could affect world economic, if the news says there gonna be massive crisis all the stocks, real estate, etc gonna get affected for real, bitcoin is one of investment instrument of course it's only normal that it gonna be affected by such news that could quite literally change the current circumstance upside down.most are just gonna save their investments from the imminent disaster and you should consider the reaction of the market as one of the defensive mechanism by the investment market participant, if we care about our own assets then they certainly do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "March 16, 2023, 11:59:24 PM",
      "body": "Bitcoin is highly speculative and just generally the whole market place is awash with hot money, which is the dollar trade and cheap money has been an apparent trend since 2008.  It never really goes away that people have cash to speculate on various sectors and the popularity varies.  When we get bad news (globally), its a smack on the nose.   The world is massively inter connected now, Dollar dominates probably far more then it should relative to its trade percentage but the system is quite reliant on this hierarchy still that what happens to dollar echos around the world.   The fastest moves are because of the speculative and large banking operations occurring, governments want large banks in order to deal the debt that occur with deficit spending true of most of the worlds largest nations.          Bottom line you should take is that price is not an entire determination, its just a tag on the product on that day.  The market assigns a price, the one it chooses to capture the attention of the most people and get trade done.   In theory we could go full dictator and 'force' BTC price to be 100k but we'd see no interest, the participants would stand aside.  So whatever the price on that day, its thrown about to cause volume of trade not all prices are equal the volume done also is not always the same.  If one person did trade BTC at 100k it would not matter compared to a million who trade it at 20k; price is like a conversation and the modern world news and word spreads fast so the price alters alot also.  Not sure I explain that well but price is not a fixed absolute truth its a variable over time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "loopes",
      "created_time": "March 17, 2023, 12:18:11 AM",
      "body": "Bitcoin price goes up and down due to movement of supply and demand that fluctuative. When more people buy a bitcoin, bitcoin price will increase, otherwise when more people are trying to sell their bitcoin, bitcoin price will go down. Off course this supply and demand is very sensitive towards news of the moment, Because professional bitcoin traders with huge volume of bitcoin and majority of common traders react in anticipation from the moment or news happened, and do not react when the event is reported. That is the reason why bitcoin price affected to the news. This concept is not different to the stock price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smack That Ace",
      "created_time": "March 17, 2023, 12:47:10 AM",
      "body": "Quote from: Mrbluntzy on March 16, 2023, 11:54:18 AMI apologize if this is a dumb question but the fact is that I don't know why. My question is, why is Bitcoin market always affected by all economics news, example is the issues with US bank like the SVB. Thank you The Bitcoin market as well as other markets such as securities, foreign exchange, gold, etc., are all part of the world economy and are closely related to each other, so negative impacts cannot be avoided, as well as positive effects. Nothing in this world can exist independently, bitcoin to exist also needs electricity, the internet, and our needs, and to invest in bitcoin, we also need money and so on, you can see the connection between everything in this world is very close.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "March 17, 2023, 01:03:12 AM",
      "body": "There are several reasons, in my opinion the most important ones are the correlation that Bitcoin has with technological stocks, the participation of whales in the market and the relatively small capitalization Bitcoin has in comparison to other industries.Whether we like it or not, there is a lot of people who view Bitcoin as an investment rather than a currency and the point an investment like that is hoping an increase in value and as well financial stability so one can continue to increase the portfolio.Bad economical news may mean people won't meet the demand as expected by traders or even may lead some to sell their satoshis to pay for food and rent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "southerngentuk",
      "created_time": "March 17, 2023, 01:16:06 AM",
      "body": "Quote from: Mrbluntzy on March 16, 2023, 11:54:18 AMI apologize if this is a dumb question but the fact is that I don't know why. My question is, why is Bitcoin market always affected by all economics news, example is the issues with US bank like the SVB. Thank you It doesn't matter if you ask more questions than that. I think you need to look at world economic issues, maybe from ancient times to the present, or look for future technological perspective documents. And what you're seeing right now, I think it's as simple as the information needed to move prices and the overall downturn, almost any industry is in trouble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "March 17, 2023, 01:55:48 AM",
      "body": "Quote from: southerngentuk on March 17, 2023, 01:16:06 AMQuote from: Mrbluntzy on March 16, 2023, 11:54:18 AMI apologize if this is a dumb question but the fact is that I don't know why. My question is, why is Bitcoin market always affected by all economics news, example is the issues with US bank like the SVB. Thank you It doesn't matter if you ask more questions than that. I think you need to look at world economic issues, maybe from ancient times to the present, or look for future technological perspective documents. And what you're seeing right now, I think it's as simple as the information needed to move prices and the overall downturn, almost any industry is in trouble.Simply because it is humans with emotions that invest in bitcoin and not bots.Humans will always try to react to whatever news circulating the society and act towards it.This is why bitcoin fundamentals is important and not only bitcoin  but also other volatile assets like bonds and stocks.Then don't react to much to it such that it won't turn a FUD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "March 17, 2023, 02:40:51 AM",
      "body": "Quote from: Mrbluntzy on March 16, 2023, 11:54:18 AMI apologize if this is a dumb question but the fact is that I don't know why. My question is, why is Bitcoin market always affected by all economics news, example is the issues with US bank like the SVB. Thank you Economic news influences not only bitcoin, but also all other assets, such as the securities market, the stock market, and everything that is generally part of the global economy. BTC is part of the financial world and therefore is affected by any changes in it. This is how it works and should be taken for granted. You give a negative example with the problems of the American bank, like SVB, but any economic news affects btc. That is, it is the news that pushes the growth in value and can be the catalyst for a new bull run. This influence can't be avoided, but can be used to your advantage if interpreted correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "March 17, 2023, 05:17:00 AM",
      "body": "How you can say the news of SVB issue was affect Bitcoin price when the price only changed for less than 3%? it's just a normal volatility and there's no such bank issue affect Bitcoin price! it's different if the Bitcoin price changed for 10-20% in a single day when the news comes up, it's mean news is really affecting Bitcoin price since there's sudden change and not a normal volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FairUser",
      "created_time": "March 17, 2023, 05:26:07 AM",
      "body": "To be honest, here on the financial scale, crypto is still an area full of risks as well as opportunities. We have a lot of topics discussed on this, and from the perspective of my limited personal understanding of Bitcoin investing, what I learned is to turn the original 1 BTC into more than 1 and not care much about it long term because absolute trust will be exposed over time, as the field shows. Always feel lucky for many of us who already know things that they don't know and have to know how to make use of them,... then I think it's time for the individual creative part to come to the organization for the same goal of creating an easy environment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "March 17, 2023, 05:58:40 AM",
      "body": "We have to accept that the Bitcoin market are also \"infected\" by a lot of speculators. These people do not care about anything other than profit. The speculators are very trigger happy, because they have to protect their profits, so they will dump at the slightest indication that there might be trouble. They will sell their bitcoins before it happens and then move that money into other \"safe heavens\" to protect it. That is why the market are influenced by negative news.... even if that news are bogus. (FUD)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}