{
  "id": "topic_5477721",
  "title": "Mayor of ogba",
  "author": "Mayor of ogba",
  "created_time": "December 13, 2023, 01:44:22 PMLast edit: December 13, 2023, 03:45:26 PM by Mayor of ogba",
  "content": "Since the Buhari administration banned our local banks make they stop to they facilitating the payment of crypto, and make they ban any user bank account way used in bank account received payments of crypto. The thing does not end there, CBN they send agents to come P2P trading platforms to catch people way they convert Bitcoin or USDT to fiat so that they can ban any user's bank account way them caught, and the people no go get access to their money way they for their bank account. Since then, many people trading Bitcoin/USDT to fiat bank accounts have been banned by CBN. Thing way people way they trade for P2P trading platforms go do make CBN no ban their bank account1. Tell your buyer make in no write crypto-related words for the transfer description. 2. No they trade with people way just started to trade for P2P trading. For instance, people with a total number of 100 trades. 3. No trade with people with a lower percentage such as 80%. You can trade with people who have like 98%-100%. 4. Trade with people way don get like 3000 traded and above. 5. Always trade with banks like Opay so that if person mistakenly writes crypto-related words for your transfer description, Opay fit no go report you to CBN, or before they go report you, you fit don move your money from Opay to your main account. 6. No dey sell to traders way they offer big money to buy your Bitcoin/USDT for P2P trade. Na December be this, make we they careful for P2P trade make one mistake no go cause why we no go happy inside the December.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477721",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "December 13, 2023, 02:05:40 PM",
      "body": "Do not forget that crypto was part of 2023 financial bill that was signed by the incumbent president some months ago.What if CBN officials has been on many crypto trading P2P platforms since 2021 or before till now. How can you know? There is probability that you will not be able to avoid them if they target you.Quote from: Mayor of ogba on December 13, 2023, 01:44:22 PM2. No they trade with people way just started to trade for P2P trading. For instance, people with a total number of 100 trades.If a trader has completed 100 trades with good reputation, he is no more new and that is sufficient enough.Quote from: Mayor of ogba on December 13, 2023, 01:44:22 PM3. No trade with people with a lower percentage such as 80%. You can trade with people who have like 98%-100%.This can help against disappointment, but that is not related to CBN trying to locate some traders on an exchange.Quote from: Mayor of ogba on December 13, 2023, 01:44:22 PM6. No dey sell to traders way they offer big money to buy your Bitcoin/USDT for P2P trade.Like the second quote, this is just a general advice and not an advise not to trade with a CBN official. I found almost all these valid if you are giving a general advice on how to avoid P2P crypto trading scam. But if you are relating it to avoid CBN officials looking for crypto traders, I found only the first one valid which is this:Quote from: Mayor of ogba on December 13, 2023, 01:44:22 PM1. Tell your buyer make in no write crypto-related words for the transfer description. But if you like, you can avoid newbie traders. But of which I do not see it valid because no one knows of anyone that his or her account was freezed recently. That has occured in 2021 or so and only specific people were targeted and some were rumours.If you are just not using it for business at the time (in 2021), bank can not just freeze your account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "December 13, 2023, 02:15:14 PMLast edit: December 13, 2023, 04:02:12 PM by sokani",
      "body": "I don hear before say CBN dey send spies to P2P platforms like Whatsapp or telegram group, but I take this information as a pinch of salt because I believe say them get better things to do with their time rather than sending agents to go spy on traders. Coming back to some of the preventive measures wey you drop.Quote from: Mayor of ogba on December 13, 2023, 01:44:22 PM1. Tell your buyer make in no write crypto-related words for the transfer description. This na the way CBN dey take to know who dey into crypto because if you use keyword \"crypto, P2P or bitcoin\" for the description, the bank go flag the transaction and them go report am, which fit lead to the freezing of your asset. Quote from: Mayor of ogba on December 13, 2023, 01:44:22 PM5. Always trade with banks like Opay so that if person mistakenly writes crypto-related words for your transfer description, Opay fit no go report you to CBN, or before they go report you, you fit don move your money from Opay to your main account. I no accept this one. If you like move your funds to another bank, the description is already in the transaction and e dey indelible, them fit report you and CBN go take action. Also, I no think say dem go just freeze one of your account, if them really come for you, with the help of your BVN, dem go easily freeze all the accounts wey dey liked to your BVN.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 13, 2023, 02:24:53 PM",
      "body": "Quote from: sokani on December 13, 2023, 02:15:14 PMThis na the way CBN dey take to know who dey into crypto because if you use keyword \"crypto, P2P or bitcoin\" for the description, the bank go flag the transaction and them go report am, which fit lead to the freezing of your asset.Not likely. But this has been what Nigeria crypto traders have been doing since CBN banned bitcoin and other cryptocurrencies in Nigeria in February 2021. I also will highly advice people to not include crypto as the purpose of such transaction.We are just being careful of what is not chasing us. It is better than to relax.Even if there is nothing, why people should include crypto as a purpose of a transaction? Those bank officials might know thieves that can come to rob the person at one night or at daylight.Quote from: sokani on December 13, 2023, 02:15:14 PMI no accept this one. If you like move your funds to another bank, the transaction is already in the description and e dey indelible, them fit report you and CBN go take action. Also, I no think say dem go just freeze one of your account, if them really come for you, with the help of your BVN, dem go easily freeze all the accounts wey dey liked to your BVN.You are not also wrong. But some people believe that CBN first target the commerical banks before those like Opay, Kuda, Palmpay et cetera. That the person would have moved his money before it is too late. I also do not have this kind of thinking because it can all be too late. It will only be a surprise that OPay and others like it has also freeze the person's account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "December 13, 2023, 03:53:25 PM",
      "body": "I never hear this one and if really CBN dey do am then it is very bad of them. No wonder there are some time when I dey sell or buy some buyers or sellers will say I should not write anything related to crypto. Op the matter what, what you written here (this your thread) will help a lot of people. Because we have to really scronized the buyers profile or the account very well before clicking the order button because if your millions are frozen in Nigeria Bank account, it will be painful. Op number two is questionable, if someone has traded 100 trades in their accounts then that person is an experience trader. And come dey tok of 100 trades without any bad report. Some of them are even better than those legendary traders. The number 2 and number 3 have the same thinking, and another I can also add is that no dey trade with people wey want to corner you to buy from you. If anything happens Binance go tell you say dem no know because it was not carry out within their system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 13, 2023, 04:15:32 PM",
      "body": "Quote from: Mayor of ogba on December 13, 2023, 01:44:22 PM5. Always trade with banks like Opay so that if person mistakenly writes crypto-related words for your transfer description, Opay fit no go report you to CBN, or before they go report you, you fit don move your money from Opay to your main account. Sorry to say but this point dey very useless to be honest, if you use opay receive money from your crypto p2p partner, and the partner con write crypto related stuff for the transfer reference of description, and opay con see am and decided to report your account to central bank, trust me when I tell you say, CBN go still ban your account if they want, if you like, move the money from one bank to the other ten or more times, cbn go trace am and ban all of those accounts wey the money pass through.So, for me, you no even suppose include this point at all to be honest.But then, the good thing remains that, CBN as it stands get more serious things to do rather than chasing after crypto traders, them self go dey very useless if they abandon work wey dey suppose do begin chase crypto traders, when job no dey the country, person graduate from school and him or her no see work, the economy dey frustration even already big and established businesses, not to talk of small ones wey just dey start, man pikin decide not to do any thing illegal, and decided to start buying and selling crypto with him money, no be say na steal him steal the money, yet government won come still dey tackle the person, shey na when we all carry guns enter street before their eyes go clear.Nigerian government dey like to fight useless fight sometimes I swear.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DPHOR",
      "created_time": "December 13, 2023, 04:26:55 PM",
      "body": "I don't want to go further but what I know is that CBN not sending agent to monitor and ban people's account but they are having agents to trade for them as well compared to the dollar rate in Binance it seems to be very expensive over there and if they trade it would generates more profits than other ways they do trade. Why would CBN ban people's account for doing p2p and there's no crypto related words in transaction narration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Justbillywitt",
      "created_time": "December 13, 2023, 08:20:46 PM",
      "body": "Op I like this thing wey you talk for this your post, the things make Sense well well and I no go lie you e go help plenty people, but my only observation just dey as others been don talk am say it's best they don't put the word crypto for the description, provided say the word crypto dey for the description you are at risk of your account being blocked even if you use Opay or Kuda and others. No forget say Opay and others are licensed by CBN and insured by NDIC. So their activities are always checkmate by the CBN. Another thing I go add is that make we dey try dey use another exchange p2p platform instead of Binance alone. Since na Binance dey popular pass for we country na there this CBN people their focus dey. Since we already know how to detect a legitimate and trustworthy traders, making use of other exchanges p2p go help us avoid these CBN spies wey dey Binance p2p platform (if any)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "December 13, 2023, 08:42:24 PM",
      "body": "Quote from: Fivestar4everMVP on December 13, 2023, 04:15:32 PMQuote from: Mayor of ogba on December 13, 2023, 01:44:22 PM5. Always trade with banks like Opay so that if person mistakenly writes crypto-related words for your transfer description, Opay fit no go report you to CBN, or before they go report you, you fit don move your money from Opay to your main account. Sorry to say but this point dey very useless to be honest, if you use opay receive money from your crypto p2p partner, and the partner con write crypto related stuff for the transfer reference of description, and opay con see am and decided to report your account to central bank, trust me when I tell you say, CBN go still ban your account if they want, if you like, move the money from one bank to the other ten or more times, cbn go trace am and ban all of those accounts wey the money pass through.So, for me, you no even suppose include this point at all to be honest.I be no want add this part but something made me to add am. E get one of my friends way CBN banned his bank account because of crypto, before they banned the bank account in don already moved part of the money way in trade for P2P to his other Bank account, and CBN only banned my friend's bank account that received the money directly from P2P trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "December 14, 2023, 10:48:30 PM",
      "body": "Inasmuch as cryptocurrencies hasn't been adopted by our government I think there shouldn't be any reason to include any crypto related description in transactions irrespective of whether CBN will trace it or not but regardless of anything, I believe CBN is aware of the exchanges that is being done by converting cryptocurrencies to the Nigerian naira through binance so for me I believe their are some hidden benefits that some top CBN officials enjoys in Binance that's why they may not ban accounts related to cryptocurrency.  Even some of their officials may even be involved in crypto related transactions so this is our country, everyone always have their way out regardless of what the law enshrines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Makus",
      "created_time": "December 16, 2023, 07:49:05 AM",
      "body": "Omor which kind of matter be this one na, why CBN go dey do this kind of thing, Dem don dey cross their limit oo, wattin be the meaning of this one, say dem go enter p2p trading platform to they observe people trade, that means even the p2p wey go lick people information give Dem sef no get head, because na them go still write for their terms say no third party, so why  Op you try well well as you carry this one come board today at least person don dey aware of wattin Dem dey plan, but e for still goes well if to say you provide link or source from where you get the information from if possible, so that we go dey sure say na from legit background.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}