{
  "id": "topic_5413101",
  "title": "BitcoinExchangeIndia.com",
  "author": "BitcoinExchangeIndia.com",
  "created_time": "September 10, 2022, 06:08:01 PM",
  "content": "So, I had this domain BitcoinExchangeIndia.com, sitting idle for long. Thought of putting it up for some use. Currently, it is showing...1. Bitcoin Exchange Rate in India against INR.2. Bitcoin price in INR on this day.Let me know if it is useful and feel free to suggest improvement.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413101",
  "comments": [
    {
      "author": "pakhitheboss",
      "created_time": "September 11, 2022, 04:39:41 AM",
      "body": "Quote from: BitcoinExchangeIndia.com on September 10, 2022, 06:08:01 PMSo, I had this domain BitcoinExchangeIndia.com, sitting idle for long. Thought of putting it up for some use. Currently, it is showing...1. Bitcoin Exchange Rate in India against INR.2. Bitcoin price in INR on this day.Let me know if it is useful and feel free to suggest improvement.You have a great domain name and apart from just showing the INR value of Bitcoin, I would like to suggest that you can also use it to compare the selling price of Bitcoin showing up on different exchanges. This would help visitors to determine which exchange is providing good INR value. The same can be done for the buying price of Bitcoin in these exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "September 11, 2022, 01:54:28 PM",
      "body": "Apart from the exchange price, you can also add a services section and display a list of services provided by other merchants.For example some offer mobile recharge via BTC and some offer buying domains via BTC etc...You will have to dig up the internet and compile a list out of it which is indeed a time consuming job.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "100bitcoin",
      "created_time": "October 25, 2022, 06:03:22 PM",
      "body": "Nice work. How is the following as an alternative?https://100bit.co.in/index.php?currency=inr",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "October 26, 2022, 01:20:48 PMLast edit: October 26, 2022, 06:02:48 PM by pakhitheboss",
      "body": "Quote from: 100bitcoin on October 25, 2022, 06:03:22 PMNice work. How is the following as an alternative?https://100bit.co.in/index.php?currency=inr I did  visit your website using my mobile device and that link in the bottom  Bitcoin Price on This Day did not look much of an intrest or showed as something I should tap on. When I did it looked really good as you compared the fiat value of Bitcoin for the last 10 years. That would be a great help for someone comparing the fiat value of Bitcoin. What I would suggest you to highlight that link and rename the link with  Compare BTC price on this day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "October 26, 2022, 06:10:00 PM",
      "body": "Quote from: 100bitcoin on October 25, 2022, 06:03:22 PMNice work. How is the following as an alternative?https://100bit.co.in/index.php?currency=inr While visiting your website on an Android mobile device the upper right side seems to be slightly cut off. It may be due to the Mozilla browser that i am using on my device. Did you do a compatible test on different mobile browser? I also used Opera browser and the result was similar. This issue can be due to the menu option that you have added on that particular region, which doesn't operate or make any sense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "October 27, 2022, 03:08:47 PM",
      "body": "Quote from: elevates on October 26, 2022, 06:10:00 PMQuote from: 100bitcoin on October 25, 2022, 06:03:22 PMNice work. How is the following as an alternative?https://100bit.co.in/index.php?currency=inr While visiting your website on an Android mobile device the upper right side seems to be slightly cut off. It may be due to the Mozilla browser that i am using on my device. Did you do a compatible test on different mobile browser? I also used Opera browser and the result was similar. This issue can be due to the menu option that you have added on that particular region, which doesn't operate or make any sense. No, the websit is mobile compatible. The issue is with CSS and it take a few codes to get the alignment fixed. I do not think that might be the issue. OP can only help us and himself in getting it resolved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "October 28, 2022, 12:15:49 PM",
      "body": "if u have the money to put in it.hire a developer and turn it into a non-kyc p2p exchange.which would require a working wallet to act as an escrow.if not at-least add a graph that shows prices change every 1 minute or something.so, it looks like moving, right now it just looks like a landing page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "October 28, 2022, 03:59:22 PM",
      "body": "Quote from: IIrik11 on October 28, 2022, 12:15:49 PMif u have the money to put in it.hire a developer and turn it into a non-kyc p2p exchange.which would require a working wallet to act as an escrow.if not at-least add a graph that shows prices change every 1 minute or something.so, it looks like moving, right now it just looks like a landing page.To turn it into a non-kyc P2P exchange it would require a lot of work to be done.The front end and backend has to be planned very well and apart from that the main thing is handling disputes.Either it can be trade at your own risk website or a central authority would be needed to handle the disputes.If it is the prior then it might create a bad name for the website if the number of scammers increase on the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "100bitcoin",
      "created_time": "November 05, 2022, 06:17:00 PM",
      "body": "I have a dedicated thread on 100 bitcoin @ https://bitcointalk.org/index.php?topic=5412015.0. If you have a suggestion/feedback, please post it over there.Quote from: pakhitheboss on October 26, 2022, 01:20:48 PMI did  visit your website using my mobile device and that link in the bottom  Bitcoin Price on This Day did not look much of an intrest or showed as something I should tap on. When I did it looked really good as you compared the fiat value of Bitcoin for the last 10 years. That would be a great help for someone comparing the fiat value of Bitcoin. What I would suggest you to highlight that link and rename the link with  Compare BTC price on this day Renaming of the link is done.Quote from: elevates on October 26, 2022, 06:10:00 PMWhile visiting your website on an Android mobile device the upper right side seems to be slightly cut off. It may be due to the Mozilla browser that i am using on my device. Did you do a compatible test on different mobile browser? I also used Opera browser and the result was similar. This issue can be due to the menu option that you have added on that particular region, which doesn't operate or make any sense. Sorry. Could not recreate your problem. Also, the menu is to change & show different BTC price in different FIAT. It is pretty much working on both PC & Mobile at my end!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinExchangeIndia.com",
      "created_time": "April 01, 2023, 04:51:16 PM",
      "body": "Quote from: 100bitcoin on October 25, 2022, 06:03:22 PMNice work. How is the following as an alternative?https://100bit.co.in/index.php?currency=inr WoW! Outstanding work. You should build the site and keep adding features to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arajbhar",
      "created_time": "April 18, 2023, 04:40:14 AM",
      "body": "Here are some ideas for content that you can put on your website:1 . Content writing in local languages.2 . Price and feature comparison of Indian exchanges.3 . Crypto profit calculator (popular on google)4 . Crypto price prediction with AI algorithm (In demand but costly)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "April 19, 2023, 07:12:57 AM",
      "body": "Quote from: BitcoinExchangeIndia.com on September 10, 2022, 06:08:01 PMSo, I had this domain BitcoinExchangeIndia.com, sitting idle for long. Thought of putting it up for some use. Currently, it is showing...1. Bitcoin Exchange Rate in India against INR.2. Bitcoin price in INR on this day.Let me know if it is useful and feel free to suggest improvement.Its an exchange so maybe it should start with that feature.You could start with enabling P2P trades.Add a faucet or a raffle to attract usage.Add a section for alt-coins information as lots of Indians are into that.Add some content as an introduction to trends in crypto",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raybucks",
      "created_time": "April 19, 2023, 07:48:56 AM",
      "body": "How much traffic you get?if you get enough traffic like 5000 or 200000 then you can make another section of new tools or new  pages,like really exchanging from btc to inr , p2p blogs about crypto,advertising about bitcoin forumreferring to some good sites, affiliate marketing.and more",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}