{
  "id": "topic_5416120",
  "title": "fennic",
  "author": "fennic",
  "created_time": "October 06, 2022, 04:37:18 AM",
  "content": "South Korean authorities have reportedly frozen $40 million in crypto assets, including bitcoin, allegedly belonging to Luna founder Do Kwon. However, Kwon denied that any funds of his have been frozen. “I don’t even use Kucoin and Okex, have no time to trade, no funds have been frozen,” he insisted.South Korean prosecutors have reportedly frozen nearly $40 million in crypto assets allegedly belonging to Terraform Labs co-founder Kwon Do-hyeong (also known as Do Kwon). Citing Korean publication News1, journalist Colin Wu tweeted Wednesday:South Korean prosecutors have frozen $39.66 million of crypto assets, including BTC, owned by Do Kwon through two exchanges. Do Kwon and LFG previously denied trying to transfer their 3,313 BTC after being issued an arrest warrant.The coins were frozen at cryptocurrency exchanges Kucoin and Okx, the publication noted, adding that the two trading platforms have agreed to freeze Kwon’s crypto at the request of the prosecution.South Korean prosecutors revealed last month that they were seeking to freeze 3,313 bitcoins tied to Kwon that were transferred to Kucoin and Okx from a wallet allegedly linked to Luna Foundation Guard (LFG). However, the organization denied the allegation, insisting that it “hasn’t created any new wallets or moved BTC or other tokens held by LFG since May 2022.”Following the news of the prosecutors freezing $39.66 million in crypto belonging to him, Kwon took to Twitter to deny that the frozen funds are his. “I don’t get the motivation behind spreading this falsehood – muscle flexing? But to what end?” the Luna founder tweeted Tuesday, adding:Once again, I don’t even use Kucoin and Okex, have no time to trade, no funds have been frozen. I don’t know whose funds they’ve frozen, but good for them, hope they use it for good.A South Korean court issued an arrest warrant for Kwon on Sept. 14. He is accused of fraud after the collapse of the cryptocurrency luna (now called luna classic (LUNC)) and stablecoin terrausd (UST). Moreover, Interpol has issued a Red Notice for him. “A Red Notice is a request to law enforcement worldwide to locate and provisionally arrest a person pending extradition, surrender, or similar legal action,” Interpol’s website details, adding that “Red Notices are issued for fugitives wanted either for prosecution or to serve a sentence.”The Luna founder’s whereabouts are currently unknown. He was believed to be in Singapore but the Singapore police force recently said that he is currently not in the city-state. Kwon has maintained that he is not “on the run,” tweeting recently that he is “making zero effort to hide.”Source: https://news.bitcoin.com/south-korea-reportedly-freezes-do-kwons-crypto-worth-40m-luna-founder-says-the-funds-are-not-his/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416120",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "October 06, 2022, 06:21:15 AM",
      "body": "Whether or not the report is true doesn't matter; no one should be keeping that amount of money in a wallet owned and controlled by a third party.- Not your keys; not your coins.Centralized exchanges are means through which the government can regulate amd control a decentralized technology like Bitcoin. You do not own the funds, if you don't own the private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malcovi2",
      "created_time": "October 06, 2022, 06:28:35 AM",
      "body": "I wouldn't trust any Do Kwon's words because he wasn't transparent at the funds, I think he didnt provide any proof that funds were used to try to save the crash but instead most of the funds were moved to big exchanges and he only used a tweet that funds were used to peg UST but no blockchain link.I hope he goes into jail because of the lives that he ruined and he doesn't take responsibility for anything, He got what he deserve for being too cocky.blockchain doesnt lie, his a thief. He has funds in S.Korean exchangeshttps://cointelegraph.com/news/42-5k-btc-reportedly-moved-from-luna-foundation-guard-wallet-as-ust-peg-crumbles",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "October 06, 2022, 07:57:46 AM",
      "body": "I don't think quite a lot of people care if the frozen funds belonged to Do Kwon or not, it could prolly be his and he is just denying it to save face, what people want to see happen is for Do Kwon to answer to all of the fraud/scam allegations levelled against him since the collosal crash of luna which caused quite a lot of people irrepairable damage. He denies being on the run, but it looks so to me, but i am pretty sure that sooner rather than later the law will definitely catch up with him.Having said that, his situation and that of Luna should be a sort of lesson to people who invest in projects just because of hype, many of them (these projects) are basically pump and dump projects, and if you aren't lucky to sell when the hype is on, you might be devastated with the level of crash that will ensue afterwards, and that was the case with Luna investors, sorry to them anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "October 06, 2022, 08:46:46 AM",
      "body": "We will have to see then, if the news is real or fake, and hopefully it's real as we have heard as well that Do Kwon has disappeared and I though that they have him in custody or something.So for me, it's going to be a wait and see attitude, but I do hope that all his assets can be freeze, not just this one, maybe he still have far more Bitcoin and crypto something that is not on the centralized exchange and I think that is very important for the investigators to discover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "October 06, 2022, 09:28:37 AM",
      "body": "Ouch, so worst case is that the authorities has not freeze any of Do Kwon's account or money, so I guess he is still scott-free with a ton of money that he is not willing to give to those who have lost their hard earn money when they invested on his project.And with that, the authorities should really exercise their authorities but at the same time should be 100% that what they are freezing is not somebody's money but indeed it was Do Kwon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "October 06, 2022, 09:52:53 AM",
      "body": "Quote from: malcovi2 on October 06, 2022, 06:28:35 AMI hope he goes into jail because of the lives that he ruined and he doesn't take responsibility for anything, He got what he deserve for being too cocky.blockchain doesnt lie, his a thief. He has funds in S.Korean exchangeshttps://cointelegraph.com/news/42-5k-btc-reportedly-moved-from-luna-foundation-guard-wallet-as-ust-peg-crumblesI hope so. So many people lost their life caused by him. Im sure that if he was still owning some money that have not yet discovered. Only stupid people who believe what he was saying before. I remember when he said that he was moving all of funds to the binance but we didn't know what was happening with the funds caused by the funds mixed with all of money available in binance. He could steal it., I hope he will be jailed and all of his assets will be seized",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "October 06, 2022, 10:20:50 AM",
      "body": "Quote from: aubert on October 06, 2022, 09:52:53 AMQuote from: malcovi2 on October 06, 2022, 06:28:35 AMI hope he goes into jail because of the lives that he ruined and he doesn't take responsibility for anything, He got what he deserve for being too cocky.blockchain doesnt lie, his a thief. He has funds in S.Korean exchangeshttps://cointelegraph.com/news/42-5k-btc-reportedly-moved-from-luna-foundation-guard-wallet-as-ust-peg-crumblesI hope so. So many people lost their life caused by him. Im sure that if he was still owning some money that have not yet discovered. Only stupid people who believe what he was saying before. I remember when he said that he was moving all of funds to the binance but we didn't know what was happening with the funds caused by the funds mixed with all of money available in binance. He could steal it., I hope he will be jailed and all of his assets will be seizedHis arrest will only be a matter of time, he cannot hide forever, no one harbors an international criminal like him. I am lucky not to invest in luna and not lose money from it but I follow all his news and I hope he pays for what he did but my relatives and friends lost a lot of money because of him. If he is not dealt with, the market will become more chaotic and disorganized, scammers will operate blatantly because there is no law to punish them, the market needs to be cleaned of these things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 06, 2022, 10:32:31 AM",
      "body": "Do not trust Do Kwoon, he is doing exactly what a criminal that has been chased to the end of a wall will do, what do you expect him to do than to start denying that any funds belonging to him is been frozen? He knew he is guilty that's why he failed to surrender himself for proper questioning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 06, 2022, 10:48:16 AM",
      "body": "It seems that this issue will interact for a long time, just as happened with MTGOX's hack.The strange aspect is the attempt to transfer this money and at this time, the lawsuits are still under investigation and therefore it is stupid to move such money or try to sell it without anything being noticed.In general, I do not follow all the details of the case, but I think that Do Kwon is a liar after all that happened and the chaos he left in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "October 06, 2022, 11:52:56 AM",
      "body": "I've seen the same situation from the corrupt officials and it's like even it's allegedly pointed to them, the first thing for them to say is to deny all allegations and accusations against them.It's the first rule from the accused people so that there won't be additional sanctions and cases that will be filed against them. No matter how hard he try to deny that he's not using those exchanges and it's not his funds, the authorities have the proof of it before they will file a report to their offices and medias.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "October 06, 2022, 02:05:57 PM",
      "body": "Quote from: Upgrade00 on October 06, 2022, 06:21:15 AMWhether or not the report is true doesn't matter; no one should be keeping that amount of money in a wallet owned and controlled by a third party.- Not your keys; not your coins.An old saying but still very, very relevant. Newbies don’t know this when they first come into crypto though do they. There needs to be information very easily accessible to newbies. Exchanges are never going to highlight are they because they want users to store their crypto on their exchanges. It’s a very expensive lesson for some people as the first time they know the meaning of ‘not your keys’.As for Do Kwon, I hope he spends a very long time in jail, you can not get away with ruining lives like he has:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "October 06, 2022, 03:16:22 PM",
      "body": "The South Korean authorities should be sure this asset actually belongs to Do Kwon before making any public statement. Do Kwon is denying the ownership of the alleged asset means either he is laying or the Sk authorities where misinformed by kucoin and okx. And then, why will these two exchange agree to freez an asset which they are not sure belong to Kwon?Kwon project has done a lot of damage to the tera community that freezing $40m worth of his crypto assets (if this is true) is not a justification. There is no way they will use the asset to compensate the victims of luna crash so i don't actually see the point of the freezing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "October 06, 2022, 04:14:26 PM",
      "body": "I have often heard that there is always some element of truth to any rumour started. Maybe Do Kwon is just trying to save face by denying the reports of his frozen assets to the public, but it is pointless because him being already under serious investigation and with all the issues around him is bad to his image and any project he may decide to start if the investigations find him guilty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 06, 2022, 04:35:12 PM",
      "body": "https://cointelegraph.com/news/south-korean-foreign-ministry-orders-do-kwon-to-return-his-passportSouth Korean foreign ministry orders Do Kwon to return his passport\"Do Kwon, who has been named in an Interpol notice and an arrest warrant, has not been cooperative with the investigative agencies.South Korea’s Ministry of Foreign Affairs on Oct. 6 issued an order for Terraform Labs CEO Do Kwon to surrender his passport. The fugitive co-founder must hand over his Korean passport to authorities within 14 days of the order. Failure to comply will result in the cancellation of his passport altogether and the rejection of requests for reissuance in the future.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lagduf",
      "created_time": "October 06, 2022, 04:58:25 PM",
      "body": "Wow my first time to see do kwon got seized by regulators. that guy is still having a lot of money on his pockey. Im sure if that's only a small amounts that got discovered by regulators. Just wanna see how much money that is still owned by do kwon. I do believe to kwon is still owning lots of money. He was selling a lot of bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "October 06, 2022, 05:22:27 PM",
      "body": "Rich peeps don’t go to jail, they just manage their bail! This scam head might be roaming around but he won’t be relaxed for very long time. With the time he will loose the followers, he will loose the investor base and thus huge sell off will happen one more time. All he did was lure investors with low valued coin and made them believe in it and it’s so called $1 dreamy price. Still that man managed to create another version of it. I am pretty sure he is not in the good state of mind. If peeps are still investing into him then it’s time to leave this earth.   In fact we should not be even taking his name, he destroyed many investors on that night.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jaered",
      "created_time": "October 06, 2022, 06:33:43 PM",
      "body": "I don't believe De Kwoon. He has shown that he cannot be trusted from numerous utterances he made and I daresay he is lying and in hiding right now. If not, why hasn't he turned himself in to the local police in South Korea? That's my point here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "October 06, 2022, 08:03:08 PM",
      "body": "Well if ever they seized that money then that's fine. The man cannot be trusted with money, and that money he made from scheming and luring people in to LUNA should be given back to those he 'scammed' one way or another. I do not feel pity that he lost that much on exchanges. He probably got a lot of other accounts or wallets wherein he hid his money too, so that should have not been his entire stash. Would be interested if they managed to somewhat get a lot more from him. This guy surely has a lot more money than this, that's for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "October 06, 2022, 08:45:17 PM",
      "body": "Who would have thought the founder of tera luna, a project many crypto enthusiasts hold in high esteem will turned out to be a scammer and an outlaw. This is pretty messed up.  If this assets that gotten frozen truly belong the Do Kwon what will the authorities do with it? Between I think this is just a tiny part of what that criminal successfully squeeze from crypto investors who trusted him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}