{
  "id": "topic_5470965",
  "title": "Hewlet",
  "author": "Hewlet",
  "created_time": "October 19, 2023, 08:04:29 PM",
  "content": "I know that formal education has gained popularity to a very large extent, and it seems we've gotten used to it but, have you thought about how effective the IGBO system of education could become if it is properly polished and regulated?By the IBO system of education, I mean, the process where you decide on what to specialize in, pay a certain amount to someone already in the field, and get to have a first-hand learning process and loads of experience because you are directly learning and working at the same time. It is what most Easterners call serving your master and after a particular year's, he frees you to start working on your own.I feel it will encourage specialization (which is a key element to mastery)  and that the one-on-one learning condition will boast effective assimilation of what was taught.If the relationship between the boss in charge of this training and the trainee can be monitored and regulated correctly, I feel it will contribute a lot to increasing technical and industrious individuals in our country.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470965",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "October 19, 2023, 09:25:31 PM",
      "body": "Quote from: Hewlet on October 19, 2023, 08:04:29 PMI know that formal education has gained popularity to a very large extent, and it seems we've gotten used to it but, have you thought about how effective the IGBO system of education could become if it is properly polished and regulated?This is called apprenticeship and every tribe have their own version of it. However, the style the Igbos adopted is more effective and produce greater result than others practiced elsewhere. Quote from: Hewlet on October 19, 2023, 08:04:29 PMBy the IBO system of education, I mean, the process where you decide on what to specialize in, pay a certain amount to someone already in the field, and get to have a first-hand learning process and loads of experience because you are directly learning and working at the same time. It is what most Easterners call serving your master and after a particular year's, he frees you to start working on your own.I don't know if the apprentice pays, how I know it to be is that the apprentice (in their youth age or even children) are given to their master to serve them for certain number of years without payment... at the end they are taught the trade of the master and upon completion of service, the master will settle them by either giving them money to start up the same business or setting up the business for them including giving them the contacts and connection that will help them succeed. Quote from: Hewlet on October 19, 2023, 08:04:29 PMI feel it will encourage specialization (which is a key element to mastery)  and that the one-on-one learning condition will boast effective assimilation of what was taught.This model actually play a huge part in making the Igbos very rich and prosperous with the money spread among them and not just in the hands of few. Quote from: Hewlet on October 19, 2023, 08:04:29 PMIf the relationship between the boss in charge of this training and the trainee can be monitored and regulated correctly, I feel it will contribute a lot to increasing technical and industrious individuals in our country.I agree with you that this will make good impact if looked into. I understand that there is a growing interest in it already both home and abroad; in the near future,  we expect some good news to that effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "October 19, 2023, 10:10:35 PM",
      "body": "Proper attention and documentation of an agreement that would bide the boy and the masters is what can make it effectives, I came across some cases that warrants boss and boy judging issues due to boss refused to settle the boy who has served for so many years after and at this point the man refuses to settle instead decided to accused the boy for stealing his funds and selling off his goods without proper documentation that he refused to open up to him while on the training. Meaning the boss was just monitoring boy and taking records of his activities over the years so reaching time for settlement his boss brought out all his records.Omo this one come shock everybody I think the boy followed him in African way not by involving the police or taking him to court because he believed that his boss would win the case so decide to use Juju. My brother before 1 year after the boy leaves his boss became broke and was managing to survived the business, meaning the boy was actually right that he didn't involved himself with those accusations. I think government should look into this system and create a room for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "October 19, 2023, 10:51:12 PM",
      "body": "Apprenticeship have become so popular among the Igbos who have chooses trades over formal education and most of those apprentice have turn out to become successful in the various business after serving the maters for a stipulated time,  and just like smart gold pointed out some of the possible risk in such agreement it then means that those boys serving they masters have a lot to risk and even the oga also have his own risk if there be no proper agreements and guarantee since he be risking mismanagement of his business money if he fall for a wrong apprentice. Same goes with the apprentice since he may risk not getting settled by the oga it he doesn't make proper agreement also with the oga,  so both the apprentice and ago are both at risk. Also too comparing this with western education may be a wrong thing to do since both plays separate vital role in the economic life of the person because you be needing the Western education to be able to run a business effectively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "October 20, 2023, 08:13:14 AM",
      "body": "This system has been in existence before I was born and at the early age of Nigerian it works well and promises from the boss were kept. It is somewhat different now, bosses these days don't tend to fulfill their promises at last days. They always come out with a lie that the boy has been stealing some money from there and they will minus the money from the suppose money for all the years he has been with them, while some of them with wicked mind will not even pay them at all. I know what am saying I have seen two scenario I have encountered. This is why people do not value this type of education now compared to the way they value it in the past.This system is still practiced more in the Igbo land because it is more like a traditional way to financial freedom for young ones. One thing i love about the Igbo is how they value their tradition and language. Compared to the formal education the Igbos will rather choose their traditional system. But in general, and statistically Nigerians prefer the formal system of education.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}