{
  "id": "topic_5460744",
  "title": "DireWolfM14",
  "author": "DireWolfM14",
  "created_time": "July 23, 2023, 05:35:43 AMLast edit: July 23, 2024, 03:12:17 PM by DireWolfM14",
  "content": "IntroductionBorrowersLendersCollateral.Introduction:The Bitcoin Forum is committed to providing a free marketplace for all to trade and transact without any official limitations.  This is a truly free, capitalistic economy, or, as the administrator has described it, \"anarcho-capitalistic.\"  As such, it's up those who engage in this economy to protect themselves.  Caveat Emptor!However, that doesn't mean that you are completely on your own.  There are many reputable members of the forum who are committed to keeping the forum safe, and thwarting scammers before they have a chance to cause damage.  One of the tools available to members is the Trust System, which is intended to provide participants with feedback that others can use to judge a potential trade partner's trustworthiness.  The trust system is decentralized in the way that it is left to the community to manage.  It may not be perfect, but the philosophy aligns with the forum's commitment to a free marketplace.In the Lending sub-board this poses a few challenges for those who are new to the forum.  If you are a newbie to the forum or the Lending board it would behoove you to take a few moments to learn a little bit about the culture and expectations when requesting a loan or offering to lend to others.  These are not official forum rules, not even unofficial forum rules.  These are simply my observations and suggestions based on years of experience (good and bad) participating in, and monitoring this segment of the forum's economy..Borrowers:If you are requesting a loan I suggest you follow these guidelines to keep yourself and your account safe.Secured loans:If you are newbie looking for a loan, offer collateral!  There is almost no chance of a newbie receiving a loan without collateral.  Regardless of your account status or rank, if you do offer collateral make sure you are dealing with a reputable lender, or use a trusted escrow agent to hold the collateral.  Don't trust a new lender with your collateral, you'll likely be scammed.  Unsecured loans:Many lenders offer unsecured (no collateral) loans, but you will notice experienced lenders will issue unsecured loans only to aged accounts that have proven themselves as trustworthy.   Acceptance of unsecured loans is subject solely to the discretion of the lender.  New accounts asking for unsecured loans will often be summarily tagged as scammers.  If your first post on the forum is a request for an unsecured loan, don't be surprised to see your account painted red and your request ridiculed.Establish yourself:If you are new to the forum, there's no need to prove you're the owner of the brand new account, but if you've been around for a while you should take steps to assure a lender that you are the original owner of the account.  Sign your loan request with an address that's been staked or has been posted previously on the forum.  Use of PGP signatures is also highly recommended.  Even if the lender doesn't request it, he'll grow accustomed to you signing messages.  If your account gets hijacked and a lender sees an unsigned request, he's likely to notice the oddity and investigate further, potentially saving your account from being given a fraudulent loan.Protect yourself:Remember that all is not always as it seems.  Not all lenders are altruistic and helpful.  Generally speaking, most of the established lenders are trustworthy folks, but be wary of new lenders or those who are new to lending market.  Make sure you have a thorough understanding the lender's terms the interest rates, and repayment deadlines before accepting the loan.  Making changes to the terms and conditions is always easier before the parties commit to the loan. ID and Proof of Income:Identification documents, paycheck receipts, proof of income, and written or verbal contracts promising to pay are worthless to a lender.  There are no documents you can provide that will secure your loan request.  All forms of identification and documentation can easily be forged or faked, and no lender here has the ability to authenticate anyone's identity.  The prevailing theory is that no one would willingly disclose their personal information to a stranger on the internet for a few hundred dollars, unless of course it's not their identity to begin with.  Honest or not, such a request will appear to be a scam attempt.You are not entitled to a loan:Requesting a loan does not guarantee you'll receive one.  Lenders are not obligated to fill each (or any) loan request, nor should you expect yours to be honored.  When others respond to your request with questions or suggestions, it would be wise to answer honestly and heed the advice given.  Do not push the issue by repeating the same talking points or without modifying your request.  A sense of entitlement will almost always end with you being red-tagged and labeled a scammer.Investment Proposals:Requests for investment in a project are highly unlikely to be accepted.  Unless the requester is an established member who would otherwise qualify for an unsecured loan, requests for a project based on a business plan or a high yield investment proposal are often seen as a scam attempt by the community.  Even established members who offer proposals that sound too good to be true will be seen as attempting to scam so, imagine what it looks like when a newbie tries it..Lenders:If you plan to offer a lending service, you must assume many risks, not the least of which is giving the community the wrong impression about your motives.  You will increase your chances of success if you follow these simple suggestions:Do your own research:The Trust System can be very helpful in evaluating the borrower's potential to pay back the loan, however you shouldn't rely on only the one source for information.  Risks can be mitigated by issuing only secured loans, but you may find opportunities in that market segment are limited.  If you issue unsecured loans you alone are responsible for evaluating your client, and assume the risks.  Make sure to consider all the information publicly available to evaluate those risks, and beware of borrowers who've over-extended themselves with multiple loans.  Also beware of aged accounts suddenly asking for a loan if it seems out of character.  Another trend to look out for is borrowers who are asking for short-term loans just to develop their trust rating.  Often they are budling up to take bigger and bigger loans, with the possible goal of defaulting on a large loan.Signed messages:If you are new member offering a lending service or an established member new to the market, it's recommended that you sign a message using an address containing some funds.  This can demonstrate to the community that you are serious, and have the capitol to fill accepted requests.  It's also advisable to ask borrowers to sign a message using an address that was staked or previously posted on the forum.  This will help ensure that you are dealing with the same person responsible for the account's reputation.  I'm of the opinion that requesting signed messages should be standard practice, especially for unsecured loans.Be willing to use escrow:If you are new member offering secured loans, you may not have the reputation to earn the borrower's confidence that you will return the collateral.  Using a trusted, reliable third party as an escrow agent will help everyone feel safe.  Bitcoin technology such as multi-sig wallets can also be helpful in this regard.  Showing that you are willing to use escrow will demonstrate to the community that you are not attempting to scam someone out of their collateral.Transparency:Transparency and communication will help the lender maintain a professional and respectable reputation.  Once a loan has been issued, use the Trust System to communicate that the borrower has an active loan with you.  It's just common curtesy.  Publicly posting the addresses and transaction IDs involved is not mandatory, but can be helpful in resolving issues, or to prove that one party breached the initial agreement.Privacy:Generally speaking, transparency provides safety for the lender, however it's important to respect your clients' privacy, even from yourself.  Do not ask your clients to disclose personal information about themselves, such as identification documents, for example.  Not only is this an unreliable way to ensure the borrower's identity, it's likely to be seen as attempted identity theft..Collateral:The question of what constitutes valid collateral often comes up, and is often met with some debate.  Only the lender can decide what collateral suites his risk profile, however the following guidelines can help borrowers assess the likelihood of their secured loan request being accepted.Fungible Digital Assets:The most likely asset to be accepted as collateral by the majority of lenders is a cryptocurrency other than the one you want to borrow.  The currency, coin, or token must have sufficient trade volume, and be traded on reputable and accessibly exchanges.  For example, a borrower who is bullish on BTC but needs some USDT to pay for a service may request a USDT loan with BTC posted as collateral.  Often the lender holds the collateral in an address he controls, but the lender and borrower may agree to have the collateral held by an impartial third party or escrow agent.Non-Fungible Digital Assets:Non fungible assets are rarely accepted as collateral, and depending on the request can often be seen as an attempted scam or deceptive sale of the asset.  Despite some debates regarding the validity of digital assets and collectables (such as NFTs, domain names, or websites) as collateral, it's worth noting that they are frequently offered but rarely accepted.  Again, the lender needs to evaluate the legitimacy of the asset's proclaimed value, and the risk inherent in such offers.  Some escrow agents can help with non-fungible assets, in the event an offer is accepted.Physical Goods:Physical goods can be deemed valid collateral by some lenders, but often the logistics of transporting the items to and from the lender or escrow agent can be time-consuming and cost-prohibitive.  Borrowers who are within a close geographic area to the lender or a trusted escrow agent may have an easier time having their offer accepted.  Lenders will not accept photos or video evidence of the existence of the asset in leu of having the collateral physically in their possession.  If it's not in the lender's or escrow agent's hands, it's not collateral.  Borrowers who offer only proof of the existence of the asset, and are unwilling to relinquish possession are often seen as attempting to scam.What is not collateral:Identification documents are not collateral.  IDs can be faked or forged, and do not guarantee the identity of the borrower.  Nor do they guarantee recourse in the event of a defaulted loan.  Even if the documents are authentic, law enforcement agencies could take years to make any progress on a reported case.Fiat sent through PayPal or other reversable payment methods should never be offered or accepted as collateral.  The borrower could charge-back the collateral as soon as the lender sends the loan, leaving the lender empty handed and at a loss.Social media accounts and service provider accounts (such as exchange or casino accounts) are not collateral.  Any account that can be recovered by social engineering is a high risk for the lender to accept as collateral.Bitcoin Forum accounts should not be offered or accepted as collateral.  If a lender attempts to sell a Bitcoin Forum account in the event of a loan default, he risks being red-tagged as an account seller.  Selling and buying of Bitcoin Forum accounts is frowned upon by many members of the community.Items the borrower has listed for sale.  If the borrower is looking to sell the item he's offering as collateral, odds are he's not going to return the loan and is trying to trick the lender into unwittingly buying the item.Virtual credit cards, gift cards, access codes, game codes, VPS codes, or any similar type of item that holds digital value should be avoided.  These can easily be retrieved by the borrower through social engineering, or drained of their value immediately after the loan is issued.Summary:Historically the lending board has been an unkind place for members with fanciful borrowing requests.  It has been less kind to lenders with unclear or clearly malicious motives.  The nature of the lending board will always attract lazy scammers with feeble attempts that lack creativity.  If you are a legitimate borrower or lender, you'll want to make every effort to avoid the appearance that you are one of these lazy scammers, or you risk being tagged and labeled as if you are one.[/list]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460744",
  "comments": [
    {
      "author": "DireWolfM14",
      "created_time": "July 23, 2023, 05:35:57 AMLast edit: July 23, 2023, 02:57:15 PM by DireWolfM14",
      "body": "Local Rules:This thread is for the discussion of general lending and borrowing practices, the validity of specific types of collateral, and the overall safety of lending and borrowing activities.The following types of posts will be seen as off topic and removed:Requests for loans or offers to lendSpamming links to requests or offersDiscussions of one specific individual's reputation or habits",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2o67",
      "created_time": "July 23, 2023, 07:20:19 AM",
      "body": "There are other issues that should be addressed at this point in time such as lenders facilitating second or even third loans to borrowers who have already taken out loans with other lenders.Then there is the issue of some lenders having not updated their OP in a very long time and still state e.g they accept forum accounts as collateral, then having to explain to potential borrowers that they don't.Transaction details shows a level of honesty that a loan has been provided and also repaid.  I've seen a number of instances recently where loans have been taken out with no TX then when the lender is queried they can't recall or give a vague answer they think the loan was repaid.  (Not to mention sock puppet loans to make a lender or borrower look as though successful loans have occurred)May I also suggest you have a paragraph covering what \"interested bystanders\" are likely to do if loans are e.g. not repaid? / unreasonable demands for loans? / placing warnings when a loan has been provided but the lender hasn't placed a note on the borrower's trust feedback of the loan having occurred.Can we also discuss this section is not a \"buy positive trust feedback\" exercise.  In the past some lenders have stated they will only provide loans with a *neutral* trust feedback upon successful repayment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "July 23, 2023, 07:47:30 AM",
      "body": "Shouldn't they create a childboard specially for the investments or ventures? Or this should be fine to go in the services section as I did before?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 23, 2023, 10:47:57 AM",
      "body": "Borrowers also keep in mind in addition to the You are not entitled to a loan statement the fact that at least a few people here, myself included, when we do loan look at what you post about. It comes down to personality. If I see you frequently post things that i disagree with be them in crypto world / political world / tech world and so on. I will probably not loan you anything. And I'm am reasonably certain that others do that too. It's just the way human brains are wired.Also for borrowers, there are certain forms of collateral that some people will take, BUT there can be more hassles involved. Most people will not take domains as collateral st least here. From the people that do some registrars will not let you transfer more then once every 60 to 90 days. So even if you pay back on time or early you still may have to wait.Lenders, always keep fees in the back of your mind. It's great that you were willing to accept Dave's Left Testicle token as collateral. It's trading a $1 and you took 500 of them for a $400 loan so you have a nice 25% buffer. And you did a loan at 25% so you are getting a nice $100 payout in 30 days when you get paid back. But we have another gas fee run up on eth or some new token is issued on the BTC network and fees skyrocket again. Tough. You get paid back, you have to send back the collateral. Does not matter if it's now going to cost you $60 of that $100 profit. I'm sure that there is more that escapes me at the moment.@DireWolfM14 thanks for making this really needed post.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 23, 2023, 06:21:47 PM",
      "body": "Quote from: DireWolfM14 on July 23, 2023, 05:35:43 AMLenders:I'd like to add this:Out of character loan requests:Watch for loan requests from users you wouldn't expect it from. If, for example, I would ask for a large loan, don't jump at the opportunity! I've never asked for a loan before, and this should be treated as a big red flag.Then again, a user who often takes loans might be building up for bigger and bigger loans, so that's not an ideal scenario either. Even if he isn't planning for an exit scam, at some point he may no longer be able to pay back all loans. We call that \"filling one hole with another\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "July 23, 2023, 07:29:38 PM",
      "body": "This should be for the borrowers.I think a signed message from a borrower's old staked address should also be a standard practice when one if requesting for a loan. Yes, it might nowt avoid an intended exit scam, but it could very much avoid scenarios of someone silently hacking into a high ranked member's account and then using it to borrow a loan like it was in this caseThanks for the post @DireWolfM14, that was very thoughtful of you. At some point in time, this should be pinned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DireWolfM14",
      "created_time": "July 23, 2023, 08:00:52 PM",
      "body": "@Timelord2067, @DaveF, @LoyceV, @JeromeTash,Thank you all for the great suggestions, I've implemented them all in one form or another.Quote from: CryptoHFs on July 23, 2023, 07:47:30 AMShouldn't they create a childboard specially for the investments or ventures? Or this should be fine to go in the services section as I did before?There's a \"Long Term\" sub-board in this section for such requests and the Services board, like you mentioned or the Gambling sub-board, Investor-based games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 15, 2023, 07:52:40 AM",
      "body": "I would suggest that you add a section in the Borrowers category to pay attention to interest rates. People might think that they can just pay back what they borrowed, when the lender has different terms.As a matter of fact, you should also suggest to borrowers to pay attention to the loan terms, since reading the fine print is just as important as avoiding what not to do when requesting for the loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "December 23, 2023, 04:00:28 AM",
      "body": "Quote from: DireWolfM14 on July 23, 2023, 05:35:43 AMWhat is not collateral:Items the borrower has listed for sale.  If the borrower is looking to sell the item he's offering as collateral, odds are he's not going to return the loan and is trying to trick the lender into unwittingly buying the item.In the past, I have agreed with this, but I think there are some exceptions to this rule. If a borrower is asking for a loan against something that has a well-established value, and the loan amount is far below the value of the item for sale, it may make sense for a lender to make a loan against said item. Obviously, the lender would be taking the risk of having to take possession of the item and resell it, but this is the case for any collateral loan. For example, someone might be selling a physical coin, but needs money immediately. The seller/borrower may have already sent the coin to MJ, or some other reputable escrow (and they have received the physical coin), but will take some time to sell/auction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}