{
  "id": "topic_5456219",
  "title": "Free Guy",
  "author": "Free Guy",
  "created_time": "June 13, 2023, 10:32:45 AM",
  "content": "Hi Bitcoin talkers I am glad to join this forum I will now proceed to reading the forum rules and regulations so I can benefit and also be of benefit to this forumI also noticed that if the page is refreshed during registration the image captcha doesn't change Is this a security problem or it is normal on this forum,?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456219",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "June 13, 2023, 10:42:20 AM",
      "body": "Welcome to the forum mate, before posting I think the first thing you should have actually done was to just read the rules of the forum first. You can actually see the newbies guide before posting pinned right on the top this board or rather use this link Concerning the captcha issue maybe it could have been from your end but I doubt I encountered any difficulty like when I registered. If you refresh and it doesn’t changes the image you can just click the request new image and it will work. In fact I had to try this just now to be certain and even without inputting any details it changed the captcha letters after refreshing and also using the request new image button.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "June 13, 2023, 10:56:42 AM",
      "body": "Quote from: Free Guy on June 13, 2023, 10:32:45 AMHi Bitcoin talkers I am glad to join this forum I will now proceed to reading the forum rules and regulations so I can benefit and also be of benefit to this forumI also noticed that if the page is refreshed during registration the image captcha doesn't change Is this a security problem or it is normal on this forum,?First of all, welcome to the forum mate, I was once like you when I joined the forum but now at least I have benefited a lot of things today from these forum despite my irregularity on the forum but I can tell you that you are in the right part.If you want to know about the forum rule please kindly go through these link. Once again you are highly welcome to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "June 13, 2023, 11:07:59 AM",
      "body": "Quote from: Free Guy on June 13, 2023, 10:51:59 AMIt works when you request a new image but refreshing doesn't I think that's how it should be and I don't see a problem with that. What can be a problem is that reCaptcha can sometimes be really annoying and constantly asks you to solve the new captcha, and this happens if you use a VPN or TOR. Luckily, the forum offers the option to log in without a captcha, and all you have to do is click on the link  \"If you have persistent difficulties with the CAPTCHA, go here after logging in.\" and then you can log in without solving the captcha.Of course, in that case you need to keep that link safe, because someone malicious could use it to brute force your login data, and the captcha just serves to disable/slow down this process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "June 13, 2023, 11:22:52 AM",
      "body": "Quote from: Lucius on June 13, 2023, 11:07:59 AMLuckily, the forum offers the option to log in without a captcha, and all you have to do is click on the link  \"If you have persistent difficulties with the CAPTCHA, go here after logging in.\" and then you can log in without solving the captcha.Captcha bypass topic.Using captcha bypass code saves my time but like password, we can reset it after a few months or a year.Quote from: Free Guy on June 13, 2023, 10:32:45 AMHi Bitcoin talkers I am glad to join this forum I will now proceed to reading the forum rules and regulations so I can benefit and also be of benefit to this forumAfter your first post, your posting style is like a burst poster and is not like you are using your first minutes to read forum rules. My feeling is you make a new post after 6 minutes that is a limit for a newbie account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "June 13, 2023, 11:48:12 AM",
      "body": "Quote from: Free Guy on June 13, 2023, 10:32:45 AMHi Bitcoin talkers I am glad to join this forum I will now proceed to reading the forum rules and regulations so I can benefit and also be of benefit to this forumI also noticed that if the page is refreshed during registration the image captcha doesn't change Is this a security problem or it is normal on this forum,?You can read this post by our forum administrator @Theymos, Captcha bypass.We are all annoyed with captcha, but I guess this is just another way to thwart spam in our community. So I guess this is just part of the process when you register or become a regular member of this community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "June 13, 2023, 11:50:05 AM",
      "body": "I think during registration if you couldn't find the images comprehensible you may next till you got the right one that are clearly written for you to view the captcha. There is nothing much over it rather it could likely from your network configuration. However, am glad you successfully sign up to forum i know few people already shared the instruction pages for you to read and understand more better.Anyway, welcome to the official bitcointalk forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "June 13, 2023, 12:07:10 PM",
      "body": "Hi welcome to the forum mate. Instead of creating more topics, read more of them. Post your opinion in the posts under the on-going discussions rather than creating your own.Also, try to utilise the search function and if that doesn't work, try Google Dorks like this: site:bitcointalk.org [your topic/question]Good Luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "June 13, 2023, 12:13:39 PM",
      "body": "Welcome onboard, as for the log in captcha , you can put your log-in to always logged-in. No need to go through captcha, it will log you in automatically",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "June 13, 2023, 12:18:28 PM",
      "body": "Quote from: Free Guy on June 13, 2023, 10:32:45 AMI also noticed that if the page is refreshed during registration the image captcha doesn't change Is this a security problem or it is normal on this forum,?If the images from the captcha do not change after refresh meaning the captcha you did recently is being cached but if you clear your browser cache it would replace with new updated cached data and you should see different images on the captcha.If your security is your concern then it won't affect your account security but if your problem is the images from the captcha and still the images didn't change then try the reload button check the image below where you can find the reload button.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bounty Inspectors",
      "created_time": "June 13, 2023, 12:26:01 PM",
      "body": "Quote from: Free Guy on June 13, 2023, 10:51:59 AMIt works when you request a new image but refreshing doesn't Sometimes captcha doesn't work properly. And times no need to complete captcha. But Bitcointalk security is very advanced level don't worry about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "June 13, 2023, 12:48:24 PM",
      "body": "Welcome to the forum, just to let you know you can manually skip the captcha if it seems not working because sometimes when you use von the captcha may not seem to work properly but I do t think that is a security problem, I think it more of network problem per se.All you need to do is keep trying or skip to the next if you feel it not working for obvious reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ancafe",
      "created_time": "June 13, 2023, 12:49:29 PM",
      "body": "Quote from: Free Guy on June 13, 2023, 10:32:45 AMHi Bitcoin talkers I am glad to join this forum I will now proceed to reading the forum rules and regulations so I can benefit and also be of benefit to this forum That's what you should do and reading will enrich the knowledge you have, the discussion base will look interesting when someone understands what is being talked about and it will also bring you to the real learning stage. Any benefit will be gained when you bring insight into the discussion and there is something to be concluded, if you do well no one will ignore and there will always be someone who helps each other.Quote from: Free Guy on June 13, 2023, 10:32:45 AMI also noticed that if the page is refreshed during registration the image captcha doesn't change Is this a security problem or it is normal on this forum,? Maybe the problem lies with your network and some people have previously provided answers to that problem. Welcome to join and keep reading so that you are consistent in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "June 13, 2023, 02:12:34 PM",
      "body": "You have had many suggestions aready, I like to congratulate you for signing up here. I'm sure you must have solved the captcha challenge you complained because I believe it is a network glitch and nothing more, what you need to do is simply refresh though sometimes it may take time to solve as it keeps changing to new symbol but continue on it until it is solved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "June 13, 2023, 03:44:26 PM",
      "body": "Quote from: Free Guy on June 13, 2023, 10:32:45 AMHi Bitcoin talkers I am glad to join this forum Welcome to the forum.Quote from: Free Guy on June 13, 2023, 10:32:45 AMI will now proceed to reading the forum rules and regulations so I can benefit and also be of benefit to this forumThat is expected by many members who join the forum.Sometimes the account rank is not a benchmark for someone in terms of knowledge.7 posts today you made. There is one post that shows that you are a member who has the ability like a member who has been active in the forum for a long time with the courage to provide solutions to newbie..Hopefully your expectations that want benefits and be useful for the forum are achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "June 13, 2023, 03:58:54 PM",
      "body": "Quote from: Bounty Inspectors on June 13, 2023, 12:26:01 PMSometimes captcha doesn't work properly. And times no need to complete captcha. But Bitcointalk security is very advanced level don't worry about it.You just need to check all the boxes and they work fine verifying you but as you said no need to complete captcha then it might be the case when you have permanently logged in your account from any device that will bypass it otherwise if you login each time you will have to solve the captcha to login into your account.Captcha are different from the security and you must also take necessary steps for your account safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "israt1@",
      "created_time": "June 13, 2023, 09:39:20 PM",
      "body": "If you are exposed to it too much then it can be annoying. Maybe your browser has vpn connected. You can disable vpn to get rid of it. Resen clear all history. Hope you get the solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "June 13, 2023, 10:22:47 PM",
      "body": "Welcome to the forum. You can learn from this forum by reading threads that already made by users here and if you have any questions you can reply on that thread to know more about the topic. Hope you you will find this forum eady to use, though this is kind of old forum software but when you get used to it, you find it easy to use.The picture wont change when you refresh the page, you have to manually change the captcha image.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "June 13, 2023, 10:40:27 PM",
      "body": "Quote from: Free Guy on June 13, 2023, 10:32:45 AMHi Bitcoin talkers I am glad to join this forum I will now proceed to reading the forum rules and regulations so I can benefit and also be of benefit to this forumI also noticed that if the page is refreshed during registration the image captcha doesn't change Is this a security problem or it is normal on this forum,?As you find yourself here I will advise you to learn from the Senior colleagues and observe the system or the Forum very well before responding to any person or any conversation because here is a place that you will learn how to operate in Bitcoin and they actually if you want to learn very well or ask your questions lately on the conditions of bitcointalk I think the best place to make your post is in beginners and help",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 13, 2023, 10:51:14 PM",
      "body": "This forum has been operating efficiently for many years now, and both in terms of security and privacy, there has never been any compromise. So about the captcha, there is nothing wrong with it; if it really was a bit of a problem, I think it would have been handled earlier before being noticed. By the way, let me join others who are welcoming you and say \"welcome too\", but it really doesn't mean anything because no one will be telling you a warm goodbye when you are leaving, and depending on the situation that is going to cause you to leave, Just prepare your mind for criticism because you might get some, so you have to develop what some members refer to as thick skin so that even if you are being insulted, you will not turn into a crying baby. Read the rules, don't spam, and don't plagerize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}