{
  "id": "topic_5497454",
  "title": "windrunnersylvanas",
  "author": "windrunnersylvanas",
  "created_time": "May 22, 2024, 10:45:24 PM",
  "content": "I'm doubt that DeFi, AI, NFT & Gaming on Bitcoin will be success .. What do you really think about these narratives called Layer 2 And Defi on Bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5497454",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "May 22, 2024, 10:59:22 PM",
      "body": "Layer 2 is different from what you are asking question about. Layer 2 will refer to something like bitcoin lightning network, or the drive/spider chain. These are different from bitcoin tokens like Ordinals NFTs, BRC20 tokens and Runes.What I noticed about the bitcoin tokens is that you should only use them to gamble. Their prices can increase significantly and decrease significantly just like altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "May 23, 2024, 12:55:01 AM",
      "body": "Those projects should just choose another network than of choosing BRC20 or ordinals or runes protocol. They're probably going to succeed but only for a few days or weeks. And don't add anymore to the clogging of Bitcoin's network as they are only causing the fee to go up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "May 23, 2024, 01:57:34 AM",
      "body": "Quote from: windrunnersylvanas on May 22, 2024, 10:45:24 PMI'm doubt that DeFi, AI, NFT & Gaming on Bitcoin will be success .. What do you really think about these narratives called Layer 2 And Defi on Bitcoin?You have to look at it deeper like is DeFi, AI, NFT & Gaming altcoin projects are scam?Because scam or not, it starts with core idea to build up those projects as bad product ideas will lead to bad products, little or no use case and utility for the products, tokens. No actual intrinsic value, no chance to gain good price on the market.Altcoin blockchains or Bitcoin blockchain is only infrastructure on which those projects built but altcoin or Bitcoin blockchain does not decide these project's value and their token's value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "May 23, 2024, 05:57:26 AM",
      "body": "It depends on what you mean by \"on Bitcoin\"!Bitcoin protocol and its smart contracts does not have the option to create NFT, DeFi or any other token. So if anybody is claiming they've created a token \"on Bitcoin\" and are trying to sell it to you, that's a clear case of a scam.The best example of it is the Ordinals which is the biggest ongoing scam.However, there are sidechains available that are tied to bitcoin but aren't actually \"on Bitcoin\" (more like pegged to bitcoin) that have the protocol for more complex smart contracts and allow token creation. They are not scams.Off the top of my head I can name RootStock (RSK) as an example of such networks.Quote from: windrunnersylvanas on May 22, 2024, 10:45:24 PMwill be successI don't think so.Tokens existed for years in this world and they have not had any kind of meaningful success so far. Their only purpose have always been to raise funds, scam people and/or be used for pump and dumps. They have served no other purpose in the real world. So we can't really imagine any success for them in the future either, regardless of where they are built.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "windrunnersylvanas",
      "created_time": "May 23, 2024, 10:04:15 AM",
      "body": "Quote from: Charles-Tim on May 22, 2024, 10:59:22 PMLayer 2 is different from what you are asking question about. Layer 2 will refer to something like bitcoin lightning network, or the drive/spider chain. These are different from bitcoin tokens like Ordinals NFTs, BRC20 tokens and Runes.What I noticed about the bitcoin tokens is that you should only use them to gamble. Their prices can increase significantly and decrease significantly just like altcoins.so  those Ordinals NFTs, BRC20 tokens and Runes are not  on layer 2?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexinthesky",
      "created_time": "May 23, 2024, 10:12:08 AM",
      "body": "Quote from: pooya87 on May 23, 2024, 05:57:26 AMIt depends on what you mean by \"on Bitcoin\"!Bitcoin protocol and its smart contracts does not have the option to create NFT, DeFi or any other token. So if anybody is claiming they've created a token \"on Bitcoin\" and are trying to sell it to you, that's a clear case of a scam.The best example of it is the Ordinals which is the biggest ongoing scam.However, there are sidechains available that are tied to bitcoin but aren't actually \"on Bitcoin\" (more like pegged to bitcoin) that have the protocol for more complex smart contracts and allow token creation. They are not scams.Off the top of my head I can name RootStock (RSK) as an example of such networks.Quote from: windrunnersylvanas on May 22, 2024, 10:45:24 PMwill be successI don't think so.Tokens existed for years in this world and they have not had any kind of meaningful success so far. Their only purpose have always been to raise funds, scam people and/or be used for pump and dumps. They have served no other purpose in the real world. So we can't really imagine any success for them in the future either, regardless of where they are built.I understand your point. It seems there might be some confusion between native Bitcoin capabilities and sidechains like RootStock (RSK), which offer more advanced functionalities without being scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "May 23, 2024, 10:32:50 AM",
      "body": "Layer 2 is fairly good approach to let people use (turing complete) smart contract and other feature which isn't available on Bitcoin itself, without using altcoin or different blockchain. But as usual, i expect almost all of them are either scam or will fail.Quote from: windrunnersylvanas on May 23, 2024, 10:04:15 AMQuote from: Charles-Tim on May 22, 2024, 10:59:22 PMLayer 2 is different from what you are asking question about. Layer 2 will refer to something like bitcoin lightning network, or the drive/spider chain. These are different from bitcoin tokens like Ordinals NFTs, BRC20 tokens and Runes.What I noticed about the bitcoin tokens is that you should only use them to gamble. Their prices can increase significantly and decrease significantly just like altcoins.so  those Ordinals NFTs, BRC20 tokens and Runes are not  on layer 2?Correct, all of them on Bitcoin main network. But take note none of them are part of Bitcoin protocol. They create their own rule (which isn't verified by Bitcoin node/miner) and hope other people follow it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 23, 2024, 10:34:04 AM",
      "body": "Quote from: windrunnersylvanas on May 23, 2024, 10:04:15 AMso  those Ordinals NFTs, BRC20 tokens and Runes are not  on layer 2?They are not layer 2 because they are not bitcoin. Layer 2 means bitcoin that is not on blockchain because it is moved from blockchain to another layer which is called layer 2. Take bitcoin lightning network as an example, you will need to open a channel. If you are using a noncustodial bitcoin lightning wallet, you will need to transfer bitcoin onchain to an address on the wallet just like normal bitcoin wallet, you will pay the onchain transaction fee to open a lightning channel and the remaining BTC that you want to use to open the channel will be on your lightning wallet balance as the coin is transferred from onchain to offchain (layer 2). With layer 2, you are still referring to bitcoin and not any other coins or tokens.Quote from: ABCbits on May 23, 2024, 10:32:50 AMCorrect, all of them on Bitcoin main network. But take note none of them are part of Bitcoin protocol. They create their own rule (which isn't verified by Bitcoin node/miner) and hope other people follow it.That is true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "windrunnersylvanas",
      "created_time": "May 23, 2024, 10:42:38 AM",
      "body": "Quote from: Charles-Tim on May 23, 2024, 10:34:04 AMQuote from: windrunnersylvanas on May 23, 2024, 10:04:15 AMso  those Ordinals NFTs, BRC20 tokens and Runes are not  on layer 2?They are not layer 2 because they are not bitcoin. Layer 2 means bitcoin that is not on blockchain because it is moved from blockchain to another layer which is called layer 2. Take bitcoin lightning network as an example, you will need to open a channel. If you are using a noncustodial bitcoin lightning wallet, you will need to transfer bitcoin onchain to an address on the wallet just like normal bitcoin wallet, you will pay the onchain transaction fee to open a lightning channel and the remaining BTC that you want to use to open the channel will be on your lightning wallet balance as the coin is transferred from onchain to offchain (layer 2). With layer 2, you are still referring to bitcoin and not any other coins or tokens.Quote from: ABCbits on May 23, 2024, 10:32:50 AMCorrect, all of them on Bitcoin main network. But take note none of them are part of Bitcoin protocol. They create their own rule (which isn't verified by Bitcoin node/miner) and hope other people follow it.That is true. then what about Liquid network?? rootstock?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 23, 2024, 11:19:49 AM",
      "body": "Quote from: windrunnersylvanas on May 23, 2024, 10:42:38 AMThe Liquid Network is a sidechain protocol built on top of the Bitcoin blockchain. The Liquid Network was created by Blockstream but is governed by a federation of parties and operated on an open-source blockchain platform called Elements.Liquid network was created by Blockstream but in a way that federation of parties are involved. It has its own open source blockchain called Elements and it is referred to as side chain. It is called L-BTC which bitcoin developers will argue to be an altcoin. But if it was proposed in BIP and implemented, I think it would have be called layer 2 and be called BTC instead of L-BTC. Another  layer 2 that can be implemented would be the drive/spider chain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "May 23, 2024, 11:33:45 AM",
      "body": "Quote from: windrunnersylvanas on May 22, 2024, 10:45:24 PMI'm doubt that DeFi, AI, NFT & Gaming on Bitcoin will be success .. What do you really think about these narratives called Layer 2 And Defi on Bitcoin?When it's a bull run, people try to create narratives to try to capture money at all costs, then they invent a bunch of worthless crap and try to convince people that these creations make sense... bitcoiners are conservative and they won't accept that.. This type of movement on the bitcoin network is only for speculators and shitcoiners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "windrunnersylvanas",
      "created_time": "May 23, 2024, 12:15:50 PM",
      "body": "Quote from: Charles-Tim on May 23, 2024, 11:19:49 AMQuote from: windrunnersylvanas on May 23, 2024, 10:42:38 AMThe Liquid Network is a sidechain protocol built on top of the Bitcoin blockchain. The Liquid Network was created by Blockstream but is governed by a federation of parties and operated on an open-source blockchain platform called Elements.Liquid network was created by Blockstream but in a way that federation of parties are involved. It has its own open source blockchain called Elements and it is referred to as side chain. It is called L-BTC which bitcoin developers will argue to be an altcoin. But if it was proposed in BIP and implemented, I think it would have be called layer 2 and be called BTC instead of L-BTC. Another  layer 2 that can be implemented would be the drive/spider chain. Yes. I read some  of their documentation and got some understanding there. yeah i also think that it is not a pegging if a channel is created. but I have not a  big idea on it. what is your opinion sir??",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "B1-66ER",
      "created_time": "May 23, 2024, 12:29:54 PM",
      "body": "Those buzzwords—DeFi, AI, NFT, Gaming, Quantum, the list goes on—remind us that many of these projects consist of a small team and an evil VC planning a hype-and-dump scheme. I guess lots of them are now planning to move from the “crypto” to the “AI” hype. I noticed that while watching the latest Coffeezilla video about “rabbit r1 AI.”https://www.youtube.com/watch?v=NPOHf20slZgAdvice: Stay humble, stack sats.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Assface16678",
      "created_time": "May 23, 2024, 10:54:35 PM",
      "body": "Quote from: windrunnersylvanas on May 22, 2024, 10:45:24 PMI'm doubt that DeFi, AI, NFT & Gaming on Bitcoin will be success .. What do you really think about these narratives called Layer 2 And Defi on Bitcoin?No, well because I experience playing or doing those what you have mentioned, remember during pandemic in the world DeGi, NFT and gaming in bitcoin and other crypto currency become too popular that many people started soing those things and that's when they discover crypto currency and many people influenced to try digging deeper in crypto currency, I'm also one of the people that become too emersed in DeFi, NFT and crypto currency games, and I'd say I earn a lot from those things its just that I notice that the life span of those things is too short, its because people tend to sell all of their cryptos in the time of ATH and that's why projects like that started to fall apart because people are just selling and not holding simply, they are just farming and selling than people buying crypto currencies, so yeah those what you have mentioned are profitable if you have enter early but the life span of the project is short.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 24, 2024, 11:59:16 AM",
      "body": "Quote from: windrunnersylvanas on May 22, 2024, 10:45:24 PMI'm doubt that DeFi, AI, NFT & Gaming on Bitcoin will be success .. Defi hasn't been a success outside shitty altcoins for years now, why would it be one on Bitcoin when obviously there is no need forNFT, we have seen them, total failureGaming, again proved to be another hype everywhereAI...how it would even work?\"developers\" are getting desperate and are running out of shitty ideas to sell to investors, everything til now has proven to not serve the actual purpose and only a buzzword to move market prices, look at all those coins that are rebranding from defi to metaverse to ai, how it would even be possible to do it in the first place ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "May 24, 2024, 12:58:32 PM",
      "body": "I know one thing that Bitcoin is successful and all these shit happening on the Bitcoin network will be unsuccessful. They are hijacking the Bitcoin network pretending they can compete with other blockchains. Scaling isn't something that can be resolved by saying the word layer 2 it requires a lot of effort to achieve it. Take an example of Ethereum they came up with a unique idea of creating an ecosystem within the blockchain. They were successful and yet they are congested. Thanks to layer 2 they have achieved a desired results but they had to upgrade their blockchain to satisfy the requirements of layer 2 solution. Bitcoin network cannot do it without the help from the creator and the core team. As per my knowledge they all never expected things to change so much and that is the reason they planned to stay hidden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 24, 2024, 01:47:18 PM",
      "body": "Quote from: windrunnersylvanas on May 22, 2024, 10:45:24 PMI'm doubt that DeFi, AI, NFT & Gaming on Bitcoin will be success .. What do you really think about these narratives called Layer 2 And Defi on Bitcoin?I will only have to say this that you should trust the bitcoin network, bitcoin itself and any other thing concerning defi and third parties offers should be on your own risk, though i want to believe that the use of bitcoin layer two is another entire thing different from what you're comparing it with other networks, especially, you need to be careful in dealing with tokens, they are not all bad, but many were scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "May 24, 2024, 04:08:44 PM",
      "body": "I wouldn't call all of them a scam, sure most of them are because we do not even have to have what it says on the buzzword to be it, like AI coins without AI just the name uses it and project has nothing to do with it, or NFT but just boring copy cat of something else, gaming but there is no game yet etc etc all those examples, those are clean scams.There are also some that starts honest, but turns into scam over time as well, I guess when people see the money, they assume they will be fine but eventually they just can't hold themselves and end up selling out. There are also some that is not a scam at all, pure honest good intention people but they are just not that good at projects and they fail, not steal anyone's money at all, just straight up fail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "May 24, 2024, 04:28:20 PM",
      "body": "DeFi is already a success, I am not sure about the latter you are asking about however.DeFi is important because it prevents customer funds from getting lost like it happened with various exchanges throughout the years such as MtGox, FTX, etc. With DeFI you pretty much self custody your crypto and you can exchange it whenever you want without having to rely on a CEX.Look at the Defi volume on Coinmarketcap or other various websites, you can see that it grows every year. There are many traders now who only use CEX for fiat on and fiat off ramp and they do all their trading on DEXs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}