{
  "id": "topic_5458231",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "July 01, 2023, 01:17:24 PM",
  "content": "I don't have a gambling addiction, but I acknowledge that there are issues with my gambling habits that need to be addressed and corrected. One of the effective ways to tackle this is by observing, imitating, or modifying the patterns of other gamblers to suit me best. I'm curious about your own gambling lifestyle. Do you set aside specific times each day or week for gambling? If you enjoy sports betting, do you bet on games throughout the week whenever they're available? When it comes to visiting casinos, do you play at one today or this week and then try out a different one the next time you want to gamble? As for bankroll management, do you track it using an app, Excel, or any other methods? And regarding your environment, do you prefer playing at an online casino while listening to music in the background, or do you prefer a quiet atmosphere? I may have missed other aspects, but these questions should suffice for now. I look forward to reading your thoughts and comments.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458231",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "July 01, 2023, 01:36:28 PM",
      "body": "Quote from: alastantiger on July 01, 2023, 01:17:24 PMDo you set aside specific times each day or week for gambling?I prefer to gamble during weekends.Quote from: alastantiger on July 01, 2023, 01:17:24 PMIf you enjoy sports betting, do you bet on games throughout the week whenever they're available?I prefer weekends now. Before I prefer in-play throughout the week.Quote from: alastantiger on July 01, 2023, 01:17:24 PMAs for bankroll management, do you track it using an app, Excel, or any other methods?5% or less of my weekly income can go on gambling. I do not need other management for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "July 01, 2023, 01:39:09 PM",
      "body": "For now I don't have a specific pattern... Let me start with my account funding, I use $20 - $70 every month (most times it's not up to that amount) it might not be a lot of money but trust me the minimum wage in my country is slightly higher or same with that amount, and I try as much as possible to stick with that amount and not add more to it since I'm not the gambling freak that always wants to gamble.Next would be the time I gamble, like I said earlier I'm not any gambling pattern for now so I just log into my account and move straight to crash, plinko and mines most times it's when I'm lying down and about to go to bed that way I won't spend much time on my account. I haven't wagered on sport recently so I won't add it to my post. As for the song part I don't use song because to me playing song while lying down induces sleep and I wouldn't want a situation where I'll leave my mine games on Auto while I fall asleep that would result in me losing all my funds that's supposed to last me through the whole month to get exhausted in just one night.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "July 01, 2023, 01:46:56 PM",
      "body": "well, as a casual gambler, I'd say my gambling pattern is pretty moderate. I like to dabble in online sports gambling and occasionally try my luck with some casino games. I always set aside a specific portion of my income just for gambling, and I make sure I stick to that limit. Luckily, I'm not one to get addicted to gambling. I can easily go for a long period without placing any bets. So, yeah, that's my gambling style in a nutshell; moderate, responsible, and always keeping it under control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "July 01, 2023, 01:51:34 PM",
      "body": "Quote from: decodx on July 01, 2023, 01:46:56 PMwell, as a casual gambler, I'd say my gambling pattern is pretty moderate. I like to dabble in online sports gambling and occasionally try my luck with some casino games. I always set aside a specific portion of my income just for gambling, and I make sure I stick to that limit. Luckily, I'm not one to get addicted to gambling. I can easily go for a long period without placing any bets. So, yeah, that's my gambling style in a nutshell; moderate, responsible, and always keeping it under control. Same like you i also have interest in the sports gambling. They are two reason for this, first it is the love for the sports and secondly my track record on the casino games are usually not good and I think I am unlucky playing the casino games. I don't say that all of my sports bets go in a win but majority of them do end up in a positive manner. I don't know but most people will agree that a chances of winning on sport betting are higher than the chances on winning on the traditional casino games",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "July 01, 2023, 01:53:01 PM",
      "body": "Quote from: alastantiger on July 01, 2023, 01:17:24 PMDo you set aside specific times each day or week for gambling?I gamble when I feel that I want to play not when I need to play, 2 to 3 times a week at the most this is I believe safer as you don't develop your gambling addiction.QuoteWhen it comes to visiting casinos, do you play at one today or this week and then try out a different one the next time you want to gamble? I stick to the casinos I'm comfortable playing but I sometimes try out new casinos to see how the interface is different from the casinos I'm playing.QuoteAs for bankroll management, do you track it using an app, Excel, or any other methods? I never do that keeping track of your losses and winning is a bad idea you will just feel guilty.QuoteAnd regarding your environment, do you prefer playing at an online casino while listening to music in the background, or do you prefer a quiet atmosphere? I have my headphone and listen to music that depends on my mood usually soft rock.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "July 01, 2023, 02:11:42 PM",
      "body": "Quote from: alastantiger on July 01, 2023, 01:17:24 PM Do you set aside specific times each day or week for gambling? If you enjoy sports betting, do you bet on games throughout the week whenever they're available? From the answers that will be obtained, the addiction levels of every gambler will be known. If you enjoy sports betting and you bet on every game involving the sports you like, you are gearing up to become addicted and uncontrollable before you know. Your love for a sport should not make you become addicted by gambling every time the sport is on, to remain a disciplined gambler, you must not gamble on every game, sometimes just relax and enjoy the sports you love.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "July 01, 2023, 02:13:46 PM",
      "body": "Quote from: alastantiger on July 01, 2023, 01:17:24 PMI don't have a gambling addiction, but I acknowledge that there are issues with my gambling habits that need to be addressed and corrected. One of the effective ways to tackle this is by observing, imitating, or modifying the patterns of other gamblers to suit me best. I'm curious about your own gambling lifestyle. Do you set aside specific times each day or week for gambling?Not per week, but it will depend on my budget for the whole month since I'm an occasional gambler as well and budgeting is really my priority.If you are already having a hard time dealing with your gambling activities, better to stop for now and assess what is good for you and know if you can still afford it especially if you have plans to gamble every week. You can also choose a bet if you think its a sure win for you, since there are games that you can easily predict.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "July 01, 2023, 02:19:19 PM",
      "body": "I don't have much time to gamble as I am busy apart from work activities and also accompany my 15 month old son when I come home from work and on the weekends. And maybe only play when there is free time and also when there is a sense of wanting to play and at the right time, and lately I've been betting a lot on nights and weekends with very little capital just for fun.and maybe I will bet randomly at certain times when there is a football match, when I see it is a good match and the favorite team to bet on and watch it especially at night.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "July 01, 2023, 02:22:25 PM",
      "body": "I don't gamble regularly, and there is no set schedule for gambling. And I will gamble whenever I want and not for too long because it is not good for my finances. I also don't track how much I lose or win because I don't look it up or write it down in apps, Exel, or anything else. I usually gamble at night when I'm alone, but that doesn't mean I'll gamble every night because, for me, gambling is entertainment. And I have a lot of things that I can turn into entertainment, while gambling is just one of the entertainment for me. I always try to take care of myself while gambling and prevent the urge to continue gambling because it will be bad for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "July 01, 2023, 02:32:32 PM",
      "body": "Quote from: alastantiger on July 01, 2023, 01:17:24 PMI don't have a gambling addiction, but I acknowledge that there are issues with my gambling habits that need to be addressed and corrected. One of the effective ways to tackle this is by observing, imitating, or modifying the patterns of other gamblers to suit me best. I'm curious about your own gambling lifestyle.Copying gambling pattern of other gambler might give trouble to you since we have different behaviour to carry on others pattern. You might find it easy to copy when watching it but very hard to implement in actual when you have different level of patience. I tried to do this method before when I’m watching live streamers winning using their strategy.The result is terrible for me because I have different decision making when I’m already under pressure unlike the streamer that I’m watching that can keep his chill even with huge loss. Perhaps he is not pressured since he is using money sponsored by the casino for his stream.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "July 01, 2023, 02:41:08 PM",
      "body": "Quote from: alastantiger on July 01, 2023, 01:17:24 PMI don't have a gambling addiction, but I acknowledge that there are issues with my gambling habits that need to be addressed and corrected. One of the effective ways to tackle this is by observing, imitating, or modifying the patterns of other gamblers to suit me best. I don't agree with this, and how it will be helpful by mocking others Gambling style when the financial status of every individuals differs? Only you can estimate how much you can afford to spend on the Gambling but imagine what will happens if you try to follow the Gambling style of others which will lead you to make bet even when you don't have the intention and when the luck is not on your side then you will lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "July 01, 2023, 02:44:16 PM",
      "body": "I usually set 10% of my monthly salary for gambling and I split it for four weeks which mean I only gamble 2.5% every week. I don't set any time before I gamble, I will gamble when I'm free until my bankroll empty. But if I'm lucky and I win some money, I will use that money for gambling in the next month. If I won a big amount money, I would withdraw it immediately after I met the minimum wagering requirement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "July 01, 2023, 02:44:38 PM",
      "body": "Quote from: alastantiger on July 01, 2023, 01:17:24 PMAnd regarding your environment, do you prefer playing at an online casino while listening to music in the background, or do you prefer a quiet atmosphere? I may have missed other aspects, but these questions should suffice for now. I look forward to reading your thoughts and comments.So far and until now what I have done is when I want to gamble, I do it, I mean not focused on a certain time of the day, night or morning, so I will play just to check whether the game being played is profitable enough or not. So sometimes in a week, I can be full every day, and maybe not at all, it all depends on my own mood. Because at this time the soccer betting hasn't started yet, so I play more slot games to fill my free time.To be honest, I don't know what kind of gambler I am but I only play when I really feel like playing. only that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "July 01, 2023, 02:54:02 PM",
      "body": "Quote from: Jawhead999 on July 01, 2023, 02:44:16 PMI usually set 10% of my monthly salary for gambling and I split it for four weeks which mean I only gamble 2.5% every week. I don't set any time before I gamble, I will gamble when I'm free until my bankroll empty. But if I'm lucky and I win some money, I will use that money for gambling in the next month. If I won a big amount money, I would withdraw it immediately after I met the minimum wagering requirement.Setting a limit and getting fixed to it is really good. Myself have the limit, but the urge to win the lost amount keeps me active throughout the month. During the first week I use the payment for gambling and I loss it. Further I used to wait for the second week's payment and wager to recover the loss and stop.Things won't be in favour of us and ends in loss. This is the gambling pattern of mine, and at times I've also won and cashed out bitcoin to have fun. I don't have the habit of holding it for the next month's gambling need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 01, 2023, 03:01:42 PM",
      "body": "Quote from: alastantiger on July 01, 2023, 01:17:24 PMDo you set aside specific times each day or week for gambling? If you enjoy sports betting, do you bet on games throughout the week whenever they're available? At a time it was worse that it was daily and within the 24 hrs more betting from the initial one for the day you have made just because of chasing the loses but with time it reduced to interval of 2/3 days until weekly and sometimes casual depending on the games available.Quote from: alastantiger on July 01, 2023, 01:17:24 PMAnd regarding your environment, do you prefer playing at an online casino while listening to music in the background, or do you prefer a quiet atmosphere?This is dependent on the game being analysed. If you have different teams to analyse then to be in quiet atmosphere is preferred for attention but after the analysis and during the real bet, some cool tunes will be appreciated",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "July 01, 2023, 03:06:08 PM",
      "body": "Usually I place bets on Saturday/Sunday weekends because on that day there are usually a lot of big matches and I make a few bets that have been set aside every week, it's not much but I do it more regularly on weekends, even though there are matches on Wednesday or thursday next, sometimes I always place bets, of course, on big matches.I have set the bankroll but not recorded in Excel for me it will remember previous losses if we record everything that is at stake then there is no method because I am purely just for fun.Every gambler has a different time, for their peace of mind there are those who prefer day/night, or they are more focused on other games, but I myself am now only on sports betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "July 01, 2023, 03:07:30 PM",
      "body": "Quote from: alastantiger on July 01, 2023, 01:17:24 PMDo you set aside specific times each day or week for gambling? If you enjoy sports betting, do you bet on games throughout the week whenever they're available?Absolutely not. Bets are placed when needed, so it's can be each day (like during a tournament...) or just in some days (not important what day is). This can include also a long time of no betting! If you're betting to maximize your win ratio, and you want avoid the \"addiction\" trap you must avoid these \"betting days\". Just bet when you are SURE of win. Quote from: alastantiger on July 01, 2023, 01:17:24 PMWhen it comes to visiting casinos, do you play at one today or this week and then try out a different one the next time you want to gamble? I don't visit casinos, I haven't that money. I play sometimes btc casino that allow microbets. these amounts are really low (less than a coffee) so I don't care to have a schedule on this...Quote from: alastantiger on July 01, 2023, 01:17:24 PMAs for bankroll management, do you track it using an app, Excel, or any other methods? Yes. I count all data possible (tournament, event played, outcome etc etc)...Quote from: alastantiger on July 01, 2023, 01:17:24 PMAnd regarding your environment, do you prefer playing at an online casino while listening to music in the background, or do you prefer a quiet atmosphere?When I place a bet I don't watch or listen anything because concentration is all.Feel free to check my topic about betting suggestion (and a little explanation of my experience in this field).https://bitcointalk.org/index.php?topic=1234109.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "July 01, 2023, 03:19:49 PM",
      "body": "Seem we are all very aware of our gambling activity so far. I myself have been observing my own that every time I get my phone, I tend to look at my bets whether I won or not and then check also some matches. Nothing to track actually since all those are in the platform's record.I'm starting to think I got used to this kind of activity every day but I'm still aware that I'm not an addict. No specific pattern but I bet every time I have my phone. I should not use the phone anymore if I should quit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "July 01, 2023, 03:45:05 PM",
      "body": "If you're a daily gambler, for sure you'd be filled with ups and downs and if worse, down for a week or more. Problem is we cannot be certain of winning. Losing most of the time is more evident to majority of gamblers. The more we gamble, the bigger the chance of losing. I think profit will be fully earned if you know how to limit oneself or to know when to stop. Perhaps you win bigtime;if greed will take over and you would push yourself to experience it again, then what's more likely to happen is for your winnings to be eaten up by losses. This is the unfortunate reality in gambling that no matter how we wanted to be rich by means of gambling, it would always be a punch to the moon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}