{
  "id": "topic_5439046",
  "title": "Belarge",
  "author": "Belarge",
  "created_time": "February 09, 2023, 06:39:49 AM",
  "content": "My naija people abeg I want make we follow put mouth for this matter o, I know say we wey be naija people we want make the Labour Party candidate (peter obi) win for this forth coming presidential elections,And again we know say we get anoda two strong heads wey Dem say Dem no go gree because Dem want be president too, APC candidate ( bola tinubu) and PDP candidate (Atiku abubakar)My question now be say na how we want take put our own preferred candidate as president, how because I know say the other two candidates wey be our opposition (Tinubu and Atiku) Dem get money and Dem ready to do anything to be president",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439046",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "February 09, 2023, 11:33:20 AM",
      "body": "Nah why them say make every body get there PVC, this time if all of us come out for our preferred candidate small change go they.. no be for us to use mouth finish vote, wen time for the election reach, we go seat down finish inside huz say we no wan problem. Bola tinubu aka Bala Bulu and Atiku get money pass Obi but Obi get Supporters pass dem, all of us don tire for dre bad government nah positive change we need now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "February 09, 2023, 12:10:10 PM",
      "body": "We no go fit speak for everybody, as i they so, i they support Peter Obi because i believe say na im go fit work well so this country go move forward, but just because i believe in that no mean say Mr B or Mr C share the same ideology with me. Naija na country with different ethnic groups, religion, beliefs, etc, so all of us no fit think in the same way and you no fit force person, that is why we they practice democracy.Having said that, make everybody support their own candidate and vote for him, then allow INEC to do their own job, it is a very pivotal moment for Nigeria, and i hope say Peter Obi go emerge victorious, but the only thing i can do is to cast my vote for him and hope that majority of Nigerians do so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "February 09, 2023, 12:38:11 PM",
      "body": "Quote from: Belarge on February 09, 2023, 06:39:49 AMMy naija people abeg I want make we follow put mouth for this matter o, I know say we wey be naija people we want make the Labour Party candidate (peter obi) win for this forth coming presidential elections,And again we know say we get anoda two strong heads wey Dem say Dem no go gree because Dem want be president too, APC candidate ( bola tinubu) and PDP candidate (Atiku abubakar)My question now be say na how we want take put our own preferred candidate as president, how because I know say the other two candidates wey be our opposition (Tinubu and Atiku) Dem get money and Dem ready to do anything to be president This matter no be chise play and to be very frank, my own preferred candidate na Atiku and this na because we get alot of unfinished projects for this axis and we are believing that if Atiku win, he go try complete the project him don start and one other person wey go give listening ear to this crypto issues for we country na Atiku because he has said something similar to that even when no one of the candidates don ever talk and the moment you tell someone say you dey work online, the next talk wey you hear na be say you be yahoo boy and if this matter no dey addressed, e go really worry us.I just hope say Nigerians no go dey sentimental with the electoral process this time make we no go vote who go make us miss buhari.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "February 10, 2023, 07:37:22 AM",
      "body": "Quote from: Belarge on February 09, 2023, 06:39:49 AMMy naija people abeg I want make we follow put mouth for this matter o, I know say we wey be naija people we want make the Labour Party candidate (peter obi) win for this forth coming presidential elections,And again we know say we get anoda two strong heads wey Dem say Dem no go gree because Dem want be president too, APC candidate ( bola tinubu) and PDP candidate (Atiku abubakar)My question now be say na how we want take put our own preferred candidate as president, how because I know say the other two candidates wey be our opposition (Tinubu and Atiku) Dem get money and Dem ready to do anything to be president Mate this is democracy as you may wish to know, it is highly competitive and there are contestants of over 30 person's with each Nigerians rooting for their preferred candidate come the 2023 Presidential election. You have also spoken well but I would advise you to speak for yourself when it comes to matters like this as it is very sensitive.  As I would not tell you my preferred candidate, likewise others too but one thing for sure is that the election would hold, people would vote, results would be collated and  winner will emerge. Not until then, the current political situation of Nigeria is heavily pregnant as no one could tell what would be the outcome of the poll. At this point, I would advise each and everyone registered voter that has come of age and has collected their permanent voters card to come out election day to vote and make sure their votes are all counted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "February 10, 2023, 11:02:53 AM",
      "body": "Naija mata hard, corruption everywhere, even d youth self no know wetin dem want again. If dem don see money like dis there problem don end, so e hard to predict Naija next president. My candidate na Peter Obi, I never hide am bcos I dey reasonable. Naija mata pass ethnicity or personal gain, na persin wey fit do am na in we suppose support. Shey na Fulani wey don rule us bad for 8 years na in we want again (PDP), or na corrupt and clueless APC wey their candidate no fit to rule, and with corrupt record?E clear nau, but u go still see people voting 4 dem, dat na why I dey reason say we mad 4 Naija. E go hard to know who go win, we no know what we want, but make we sha get our PVC ready, d result go speak 4 in self.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silver005",
      "created_time": "February 11, 2023, 08:12:11 AM",
      "body": "Well, wetin dey there be say we the mases go try get our PVC,and again no be by getting PVC be the issues ooh The issue be say you go still come out on the election day come vote and as you dey vote shine your eyes, make them no go decieve you look the Logo very well before you place your finger ok, because those electorate they fit pay them to decieve voters ooh, and another thing be say na God go help us for this election,all their evil agenda will fail and na so e be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "February 11, 2023, 01:51:13 PM",
      "body": "Quote from: Belarge on February 09, 2023, 06:39:49 AMMy naija people abeg I want make we follow put mouth for this matter o, I know say we wey be naija people we want make the Labour Party candidate (peter obi) win for this forth coming presidential elections,Make I start with the fact when be say; no be everybody for naija actually want make Peter Obi win this forth coming presidential election. Just get am for mind say some people just sti dey when be say even if them nor bribe dem dey go still vote for Tinubu or Atiku and if you ask them for reasons them get plenty to tell you. Well Sha I dey for  PETER OBI.Quote from: Belarge on February 09, 2023, 06:39:49 AMMy question now be say na how we want take put our own preferred candidate as president, how because I know say the other two candidates wey be our opposition (Tinubu and Atiku) Dem get money and Dem ready to do anything to be president The only thing when we fit do for this matter now, nah for us to encourage those when dey campaign for Peter Obi make dem go collect their PVC. Nah only that one go increase the chances of him getting into power because if we say make we follow them with money we go lose the battle. While for those when don collect the PVC but dem just make up their mind say on that day dem nor go vote make we try encourage those kind people make dem see the problem when we go enter if they refuse to vote. Nah only this one I get to talk for the matter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "February 11, 2023, 11:20:48 PM",
      "body": "Quote from: Belarge on February 09, 2023, 06:39:49 AMMy question now be say na how we want take put our own preferred candidate as president, how because I know say the other two candidates wey be our opposition (Tinubu and Atiku) Dem get money and Dem ready to do anything to be president There are some parts of the country that are usually so skeptical about elections; they always assume that Nigerian elections can easily be rigged by INEC officials, and as a result, this set of people doesn't bother to register to vote. I have learned that in Nigeria, only the northern region takes election voting more seriously than other states. However, violence in the polling places of the election can discourage some people from coming out to vote. If individuals' security is guaranteed, I believe more people will come out to vote, but the fear of being caught up in some violent incidents at the election scene makes many reluctant. So to answer your question, in order for the right person to win the election, let everyone who believes in their best aspirants come out and vote, and by so doing, their vote will count, and if they voted for the best aspirant, it will enable him/her to get more votes and maybe be able to win. It is possible to wish for who you want to rule, but coming out to vote is what makes the best aspirant's vote bigger than his opponent's. Also, individual security should be guaranteed in the election voting scene so that citizens will not be scared to come out and vote.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "February 15, 2023, 10:35:46 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on February 11, 2023, 11:20:48 PMThere are some parts of the country that are usually so skeptical about elections; they always assume that Nigerian elections can easily be rigged by INEC officials, and as a result, this set of people doesn't bother to register to vote. You have learned that?Where do you actually learn that from? Any source links? I don't really know if other people are also very interested in Nigerian politics; I'm just furious. In my state and local government in particular, it's not the fear of election rigging and vote manipulation that stops people from coming out in mass to vote, but the election crisis and violence, which are almost considered to be something that occurs regularly. Most people actually believe in free and fair elections, but the fear of being harmed by political thug's stops people from voting their choice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}