{
  "id": "topic_5407245",
  "title": "Jao.lb",
  "author": "Jao.lb",
  "created_time": "July 22, 2022, 10:53:24 AM",
  "content": "Hola a todos,Aunque soy informático desde hace bastantes años, en esto de las criptos soy muy nuevo, apenas llevo medio año dedicándole lo que puedo en mi poco tiempo libre.Mi problema \"por ahora\" es el siguiente:Acabo de instalar Electrum 4.4.2 descargado de electrum.org en un Windows 11 Pro.Tras la instalación no encuentro el icono para ejecutar la App ni en la barra aplicaciones ni en el escritorio.Lo que he hecho hasta ahora:He habilitado ver los archivos ocultos y no encuentro el ejecutable. Solo veo las carpetas y archivos dentro del perfil de usuario de la Wallet que he creado durante la instalación.En Configuración / Aplicaciones / Aplicaciones y características, tampoco aparece la App, por lo que no puedo desinstalarla.Solo me permite ejecutar el programa desde el instalador que descargué y desde ahí puedo abrir la Wallet que configuré. Probablemente me permita hacer transacciones, pero no quiero hacer nada hasta ver que ocurre. La Wallet por ahora está vacía.El portátil lo compré hace relativamente poco, unos 6 meses y aunque una posibilidad siempre puede ser que tenga infectado el portátil, si es un malware, me extraña que se manifieste de esta manera, pues se estaría delatando sin haber todavía dinero por el medio.¿Esto es normal? ¿es compatible Electrum con Win 11? ¿Qué se me escapa?Cualquier ayuda os lo agradeceré.Muchas gracias de antemano.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407245",
  "comments": [
    {
      "author": "DdmrDdmr",
      "created_time": "July 22, 2022, 12:48:35 PM",
      "body": "Quote from: Jao.lb on July 22, 2022, 10:53:24 AM<…>No tengo el mismo entorno configurado, por lo cual no puedo basarme en la experiencia de haber instalado la misma topología. No obstante, si no ves el ejecutable en el directorio pertinente, habitualmente \"C:\\Program Files (x86)\\Electrum\\electrum-x.x.x.exe\" (donde x.x.x es la versión), puede que sea tu antivirus que esté bloqueando el fichero ejecutable y poniéndolo en cuarentena. De lo contrario, no veo justificación para no ver el fichero ejecutable.Otras cosas que podrías probar es ejecutar el fichero de instalación como Administrador (mouse derecho sobre el fichero de setup y seleccionar la opción pertinente), y de manera análoga, probar instalarlo en modo compatibilidad con una versión inferior a Windows 11.En todo caso, si lo has bajado del site original, y no tienes duda alguna, cabría aún a priori verificar las firmas del archivo, que no siempre es trivial. Aun saltándote este paso, miraría lo que punto más arriba por si canaliza alguna solución.He mirado en el foro y en Google y no he visto nada acerca de problemas con tu topología (tampoco nada en la dirección contraria – hay pocos hits en los resultados de la búsqueda).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jao.lb",
      "created_time": "July 23, 2022, 08:39:09 AM",
      "body": "Solución al problema encontrada.Lo primero, muchas gracias DdmrDdmr por el tiempo empleado en mi problema.Lo del antivirus ya lo había pensado, pero como no tengo instalado ninguno, evidentemente lo descarté.Lo de buscar en la carpeta Program Files\\...., en vez de eso, busqué en todo C:\\ \"electrum*.exe\" y no encontré más que el que me descargué de Electrum.org.Aun así, hace un rato lo he vuelto a comprobar y no ha generado ninguna carpeta de Electrum salvo la del perfil de usuario con la Wallet.Lo de instalar las aplicaciones como Administrador, se que desde Windows 7 (creo) hay que hacerlo así, y así lo hice.También busqué en el foro algo relacionado con electrum y win 11 y como dices, apenas hay nada.Al final, cuando me has puesto el nombre del ejecutable era \"electrum-x.x.x.exe\", he caído en la cuenta de que era la misma estructura de nombre que el que me había descargado.He vuelto a la página de descargas de Electrum.org, he leído más detenidamente las opciones de descarga que hay para Windows y he visto cual era el problema.Mendrugo de mí, he debido descargar la 1ª opción que dice \"Standalone Executable\".He descargado la 2ª opción \"Windows Installer\" y el nombre del fichero que descarga ya cambia, \"electrum-x.x.x-setup.exe\".Nunca había usado una opción \"standalone\", pero viendo como funciona, puede ser interesante cuando tu ordenador lo utilizan varias personas, pues el ejecutable lo mueves a alguna carpeta más discreta y nadie sabrá que está ahí y que tienes una Wallet con criptos.Una vez más, gracias por la ayuda.Un saludo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "July 23, 2022, 12:17:46 PM",
      "body": "Quote from: Jao.lb on July 23, 2022, 08:39:09 AM<…>Me alegro de que esté resuelto. A la postre, fue un \"no problema\" que ha dado pie a poder descubrir la opción de descarga standalone, algo a lo cual tampoco le había prestado atención. Además de lo que comentas en términos de una instalación más discreta, incluso uno podría llegar a ponderar instalarlo en alguna unidad flash, de manera que no residiese en su ordenador, aunque veo que sigue usando el disco como repositorio:Quote from: SebastianJu on April 16, 2013, 02:57:16 PMQuote from: dabest1 on April 16, 2013, 12:31:57 AMWhat is the difference between portable and standalone versions?The standalone can be put into a directory and started but the files are stored under c... users... and so on. So its not portably when you take the .exe with you because the wallet lies on the other pc.La versión portable (la tercera opción de instalación) sí que debería ser ya autosuficiente, aunque no la he probado. Los avisos del hilo de Bitcointalk, referenciado en la página de descarga de Electrum, son más bien relativos a los malos hábitos que uno puede llegar a adquirir por usar una versión portable (ej/ lanzarlo desde el pc de un tercero), que no por usarla en un mismo entorno seguro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}