{
  "id": "topic_5412448",
  "title": "casinotester0001",
  "author": "casinotester0001",
  "created_time": "September 05, 2022, 10:52:38 AMLast edit: September 05, 2022, 10:58:00 PM by casinotester0001",
  "content": "Just read this:Quote from: NotATether on September 05, 2022, 09:16:37 AMBy lately some people have been claiming that \"Bitcoin's power consumption is a central point of failure - someone can just switch off the electricity and all miners stop\". And in particular \"Bitcoin will not survive the coming winter\". Both of these are wrong.NotATether is right, look here:Heating My Home with Crypto Mininghttps://medium.com/swlh/heating-my-home-with-crypto-mining-137d2a29b62aIt may be the greenest kind of heat aroundIs crypto mining the next home heating trend?https://capital.com/is-crypto-mining-the-next-home-heating-trendHOW TO HEAT YOUR HOME WITH BITCOIN MININGhttps://bitcoinmagazine.com/business/how-to-heat-your-home-with-bitcoin-miningEDIT:Quote from: casinotester0001 on September 05, 2022, 10:23:29 PMRepurposing Bitcoin mining heat can solve global energy crisis: ArcaneWhile innovations in chipset manufacturing have helped reduce operational costs related to Bitcoin mining, a report from Arcane reveals the market’s potential to transform the energy industry.  source: https://cointelegraph.com/news/repurposing-bitcoin-mining-heat-can-solve-global-energy-crisis-arcane",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412448",
  "comments": [
    {
      "author": "mk4",
      "created_time": "September 05, 2022, 10:59:34 AM",
      "body": "Bitcoin isn't a waste of electricity regardless if you can heat your home with it or not. Because in the first place, something being a \"waste\" of electricity is totally subjective. If you think that Bitcoin is useless, then of course you'd think that it's a waste of electricity, and vice versa. The same reason that I could also think that wasting electricity on stuff like televisions is a waste of electricity, while some would say otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casinotester0001",
      "created_time": "September 05, 2022, 11:07:54 AM",
      "body": "Quote from: mk4 on September 05, 2022, 10:59:34 AMBitcoin isn't a waste of electricityPeople who are not involved in Bitcoin see it this way. Now if they hear that you can heat your home and earn money, maybe they will be inerested",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 05, 2022, 11:09:59 AM",
      "body": "Although  you can really heat your home with bitcoin mining, this is not the most efficient way to produce heat as its consume a lot more energy than a normal heater.Quote from: NotATether on September 05, 2022, 09:16:37 AMAnd in particular \"Bitcoin will not survive the coming winter\". Both of these are wrong.About this, it is not going to the winter all over the world at the same time. Bitcoin is not even mainly mined in Europe, and it is going to be mined anyway in other places while it is winter in Europe and Europeans are living their gas crisis with Russia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 05, 2022, 11:16:57 AM",
      "body": "Quote from: casinotester0001 on September 05, 2022, 10:52:38 AMHeating My Home with Crypto Mininghttps://medium.com/swlh/heating-my-home-with-crypto-mining-137d2a29b62aThe article even explains it costs him more money than using natural gas for heating.QuoteIt may be the greenest kind of heat aroundNo it's not. Unless you're otherwise using \"dumb\" electric resistor heating to heat your house, using electricity (without heat pump) wastes much more coal/gas/anything at the power plant than using that fuel directly to heat your house, because the power plant's efficiency is far from 100%.If you want to be efficient: use excess heat from the power plant in block heating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casinotester0001",
      "created_time": "September 05, 2022, 11:21:07 AM",
      "body": "Quote from: LoyceV on September 05, 2022, 11:16:57 AM...These first experimental models are like cars that consume 40 gallons / 100 miles.There will be people who will optimize the \"mining-heater\", I think",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 05, 2022, 11:26:54 AM",
      "body": "Quote from: casinotester0001 on September 05, 2022, 10:52:38 AMHeating My Home with Crypto MiningI have a feeling that these articles have forgotten about the noise a bitcoin miner makes.I don't say that using the heat of the ASICs is bad (I think that some even use it for their garden/plants) as long as they mine anyway, I just say that the topic may need to be expanded/completed in order to make it actually useful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "September 05, 2022, 11:27:04 AM",
      "body": "I have read these sort of stories and I find this thinking very innovative and a good way to recycle the heat generated from mining equipment. This will be of no benefit to those in places that require no heating, but to those in the colder region, leveraging on this free heat generated from mining hardware if you are a miner can effectively lower your expenses on electricity. Nothing should be a waste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 05, 2022, 11:57:06 AM",
      "body": "if asics produce more heat at 3kwh. than a normal home/whole room heating system then it is indeed green. plus you get passive income returns on that heat productionthis case is true if comparing mining asic vs those small personal heaters devices that sit near you that only produce a certain level of heat to warm you up but for safety standards do not exceed a certain temperature. whilst wasting 1-2kw in doing so (personal heaters, not room heaters)an asic can heat a whole room for 3kw. but i would not recommend putting it near you as the heat is intense in close proximity",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 05, 2022, 12:42:40 PM",
      "body": "Excellent. That's one refutation for the arguments against mining during the winter.On the other hand I'm not sure if this can be extended to summertime mining, unless there are air conditioning systems which work with heat as an input ( I don't think that's logical).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "September 05, 2022, 12:52:54 PM",
      "body": "Quote from: bitmover on September 05, 2022, 11:09:59 AMAbout this, it is not going to the winter all over the world at the same time. Bitcoin is not even mainly mined in Europe, and it is going to be mined anyway in other places while it is winter in Europe and Europeans are living their gas crisis with Russia.Besides that, more than 50% of the hash rate comes from renewable sources. Even if there was suddenly much less electricity provided for the ASICs, the network would continue working  (it'd harm, but it wouldn't kill it). Quote from: LoyceV on September 05, 2022, 11:16:57 AMThe article even explains it costs him more money than using natural gas for heating.It really depends on a lot of things. The price of electricity, the price of bitcoin, the price of natural gas, the possible taxes on both the bitcoin and the natural gas, etc. Currently, it's even less profitable to mine bitcoin with this difficulty, so less incentive either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 05, 2022, 01:13:43 PM",
      "body": "Quote from: casinotester0001 on September 05, 2022, 11:21:07 AMThere will be people who will optimize the \"mining-heater\", I think  No they won't. It's a competitive market: if it's profitable, the hash rate will go up, more miners will be installed, and it will consume more electricity again.Quote from: Queentoshi on September 05, 2022, 11:27:04 AMI have read these sort of stories and I find this thinking very innovative and a good way to recycle the heat generated from mining equipment.There was an April Fools joke a few years back, to place servers in homes to get free heat.Quote from: NotATether on September 05, 2022, 12:42:40 PMOn the other hand I'm not sure if this can be extended to summertime mining, unless there are air conditioning systems which work with heat as an input ( I don't think that's logical).Low temperature heat is quite useless for cooling. Using a miner only in cold months means you'll never earn back the hardware, and by the time summer is over, the hash rate went up so much your miner is worthless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 05, 2022, 01:22:55 PM",
      "body": "Quote from: LoyceV on September 05, 2022, 01:13:43 PMQuote from: Queentoshi on September 05, 2022, 11:27:04 AMI have read these sort of stories and I find this thinking very innovative and a good way to recycle the heat generated from mining equipment.There was an April Fools joke a few years back, to place servers in homes to get free heat.I don't think it was about jokes, at least as far as I remember, and it was about the Russian city of Irkutsk, where two entrepreneurs designed a system that would mine BTC and at the same time produce thermal energy. Maybe there were some April Fool's jokes, but over the years I have read about several examples where such systems have proven to be effective, of course with the assumption of cheap electricity.https://archive.curbed.com/2017/11/9/16619032/bitcoin-mining-heat-homes-siberia-russia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 05, 2022, 01:37:29 PM",
      "body": "Quote from: casinotester0001 on September 05, 2022, 11:21:07 AMThese first experimental models are like cars that consume 40 gallons / 100 miles.There will be people who will optimize the \"mining-heater\", I think  You can't optimize those mining heaters by avoiding the law of physics, end of story!Heat pumps have always provided more energy than they consume because they work on a different principle, you can't have a bitcoin miner that cossumes 3kw produce more than the equivalent joules of heat.Besides, unlike any other systems ASICs need to run 24h, you won't be shutting them during the day and putting them back at night when you're cold, and during the day you have to get rid of the excess heat, how you do that, by venting it out using more energy to get rid of unwanted heat, do I have to tell you the efficiency of it?The truth right now is that miners use more energy to get rid of the heat compared to the heat that is actually used.Quote from: NeuroticFish on September 05, 2022, 11:26:54 AMI have a feeling that these articles have forgotten about the noise a bitcoin miner makes.I don't say that using the heat of the ASICs is bad (I think that some even use it for their garden/plants) as long as they mine anyway, I just say that the topic may need to be expanded/completed in order to make it actually useful.That's because the guy in the article was mining with a GPU, so... I have a feeling that sometimes people want to talk about how they wish things would work not how really they do.ASICs are terrible as a home companion, they produce so much noise it's like having an industrial vacuum near you, I actually have my headphones sometimes when I enter that room, the screeching noise is just not the thing you want to listen to for more than 5 minutes. Then you have their enemies, dust, and humidity, you can get rid of dust but humidity is a pain in the ass.So unless you have a spare room with no neighbors to complain everything is close to impossible, and if you have that in your house, you have the problem of transferring the heat because it's quite hard to transfer heat via air tubes for ventilation and not to transfer noise also!Of course, there are ways to mitigate those- tune your mines to low, it will reduce the consumption and thus the need for ventilate the heat and the noise- use the miners to direct the heat only to the room next to you, heating it and transferring then naturally the heat without the noisehttps://bitcoinmagazine.com/business/how-to-heat-your-home-with-bitcoin-miningI bet he spent more on that than his S9 will make in all its lifetime.QuoteI’ll be removing the stock fans from the S9 and using an inline fan (an AC Infinity CLOUDLINE S4, which goes for around $100 at time of writingAn s9 makes 1$ a day, so there it goes 3 months and a half with just replacing the fan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 05, 2022, 01:51:20 PM",
      "body": "Quote from: stompix on September 05, 2022, 01:37:29 PMThe truth right now is that miners use more energy to get rid of the heat compared to the heat that is actually used.Most probably; especially as mining seems to be more suitable on sunny places people can put on their solar panels.Quote from: stompix on September 05, 2022, 01:37:29 PMThat's because the guy in the article was mining with a GPU, so... Omg LOL!Quote from: stompix on September 05, 2022, 01:37:29 PMyou have the problem of transferring the heat because it's quite hard to transfer heat via air tubes for ventilation and not to transfer noise also!It may work by actually heating water and send that through pipes, but that means more costs and more waste too.Or as said, use the heat in a garden where the tomatoes may not mind the noise (although I've read in the past that flower prefer classical music). But that may need to be insulated too if it's near the civilization.Quote from: stompix on September 05, 2022, 01:37:29 PMI bet he spent more on that than his S9 will make in all its lifetime.Exactly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LegendaryK",
      "created_time": "September 05, 2022, 06:20:05 PMLast edit: September 05, 2022, 08:19:13 PM by LegendaryK",
      "body": "Quote from: stompix on September 05, 2022, 01:37:29 PMQuote from: casinotester0001 on September 05, 2022, 11:21:07 AMThese first experimental models are like cars that consume 40 gallons / 100 miles.There will be people who will optimize the \"mining-heater\", I think  You can't optimize those mining heaters by avoiding the law of physics, end of story!Heat pumps have always provided more energy than they consume because they work on a different principle, you can't have a bitcoin miner that consumes 3kw produce more than the equivalent joules of heat.Besides, unlike any other systems ASICs need to run 24h, you won't be shutting them during the day and putting them back at night when you're cold, and during the day you have to get rid of the excess heat, how you do that, by venting it out using more energy to get rid of unwanted heat, do I have to tell you the efficiency of it?The truth right now is that miners use more energy to get rid of the heat compared to the heat that is actually used.BOOM, That was a great answer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "September 05, 2022, 09:45:25 PM",
      "body": "If someone is running a home miner, during the winter the heat generated can be used to heat the home and the cooling system of the miner can be switched off. This is a way to limit the spending on electricity running a heater. I don't know how effective this would be, and there is nothing as waste electricity. For some purpose the electricity is being used, and we don't know how good this gives the better result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "September 05, 2022, 09:49:27 PM",
      "body": "Quote from: mk4 on September 05, 2022, 10:59:34 AMBitcoin isn't a waste of electricity regardless if you can heat your home with it or not. Because in the first place, something being a \"waste\" of electricity is totally subjective. If you think that Bitcoin is useless, then of course you'd think that it's a waste of electricity, and vice versa. The same reason that I could also think that wasting electricity on stuff like televisions is a waste of electricity, while some would say otherwise.There would be argumentations in between if we do really make out some comparison about bitcoin mining and watching TV then people would always be finding out some con's out of it and making up some debate.Its never been a waste of electricity and if we are really just tending to compare it on other machines out there then we can say that it wont really be that worth.Anything that ends up on being beneficial for youwould really be considered to be useful and wont be a waste plus we are the ones who do pay out electricity consumption then its none of our business on how we are consuming it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 05, 2022, 10:21:45 PM",
      "body": "Quote from: stompix on September 05, 2022, 01:37:29 PMQuote from: casinotester0001 on September 05, 2022, 11:21:07 AMThese first experimental models are like cars that consume 40 gallons / 100 miles.There will be people who will optimize the \"mining-heater\", I think  You can't optimize those mining heaters by avoiding the law of physics, end of story!Heat pumps have always provided more energy than they consume because they work on a different principle, you can't have a bitcoin miner that cossumes 3kw produce more than the equivalent joules of heat.what you might be forgetting. is those personal heaters people put near their beds or desks just to warm them up. are wasting 1kw but not heating a whole room. their aim is not to \"cook metal\" to 120oc+. their aim is to just raise the temperature by only xocthose convector portable heaters that can warm a whole room use 2kw but they do not even try to produce 100oc due to safety mechanisms added to down power/shut off/prevent heaters getting too hotmeaning they are not even approaching the limits of physicsfor product safety and consumer safety. they are wasting that 1kw-2kw energy but not producing the maximum achievable heat out of that energy(safety rules about not going above Xoc to prevent house fires)its not a law of physics that asics are breaking.. its actually safety guidelines of max temp for products designated as personal heaters. yep you will not see a personal heater heater run constantly at 120ocyet you will see an asic do that.disclaimer dont sit near an asic. they get hot. and may also hurt your ears if you have not modified them to reduce noise",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "casinotester0001",
      "created_time": "September 05, 2022, 10:23:29 PM",
      "body": "Repurposing Bitcoin mining heat can solve global energy crisis: ArcaneWhile innovations in chipset manufacturing have helped reduce operational costs related to Bitcoin mining, a report from Arcane reveals the market’s potential to transform the energy industry.  source: https://cointelegraph.com/news/repurposing-bitcoin-mining-heat-can-solve-global-energy-crisis-arcane",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}