{
  "id": "topic_5474775",
  "title": "Vispilio",
  "author": "Vispilio",
  "created_time": "November 20, 2023, 02:38:41 PMLast edit: November 21, 2023, 09:36:48 AM by Vispilio",
  "content": "Öncelikle @Jossque'ye teşekkür ediyorum, benim için sürpriz bir airdrop oldu, kendisi bahsetmese uzun bir süre kontrol bile etmezdim belki de.Airdrop bugün TSİ 17.00'de başladı arkadaşlar buradan çeşitli ağlardaki cüzdanları deneyerek kontrol edebilirsiniz: https://airdrop.pyth.network/verify-eligibility/check-eligibilityClaim etmek için Solana cüzdanı gerekiyor, Solana zincirinde üretilmiş bir token PYTH. Bu oracle'ı kullanan Dapp'lerin olduğu çok farklı ağlardan airdrop hakkı kazanmış olma ihtimaliniz var, en aktif olanlar benim gördüğüm kadarıyla bahsi geçen Solana, ZkSync ve Arbitrum uygulamaları,Solana'daki DEX'lerde ve Kucoin'de listelendi ve tahmin ettiğimiz gibi fiyat hemen düşüşe geçti, diğer borsa listelemelerinin de bu hafta içinde gerçekleşmesi bekleniyor...X: https://twitter.com/PythNetwork",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474775",
  "comments": [
    {
      "author": "gospodin",
      "created_time": "November 20, 2023, 03:56:08 PM",
      "body": "jupiter üzerinden işlem yapanlara dağıtılmayacak mıydı bu airdrop? belli bir hacime ulaşanlara belli miktarlarda token dağıtımı olacaktı. solana ağında shit avındayken jupiter'i bolca kullanan birisiyim ama shit oldukları için hacimler doğal olarak düşük kalmıştı. geçen hafta paylaşılan resmi olmayan bilgilere göre airdrop alacağım diye düşünmüştüm ama şu an cüzdanlarım ile kontol edince cevap kocaman bir sıfır!şu ana kadar airdroplardan hep hayal kırıklığı yaşadım. ulan 3-5 biz de sebeplenek lan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 20, 2023, 04:01:05 PM",
      "body": "uzun zamandır alamadığım nadir airdroplardan biri oldu neden alamadığımı anlamadım. Millet malı götürdü abi. 10k usd üstü airdrop alanı gördüm kalpten gidiyordum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "November 20, 2023, 04:14:11 PM",
      "body": "Quote from: gospodin on November 20, 2023, 03:56:08 PMjupiter üzerinden işlem yapanlara dağıtılmayacak mıydı bu airdrop? belli bir hacime ulaşanlara belli miktarlarda token dağıtımı olacaktı. solana ağında shit avındayken jupiter'i bolca kullanan birisiyim ama shit oldukları için hacimler doğal olarak düşük kalmıştı. geçen hafta paylaşılan resmi olmayan bilgilere göre airdrop alacağım diye düşünmüştüm ama şu an cüzdanlarım ile kontol edince cevap kocaman bir sıfır!şu ana kadar airdroplardan hep hayal kırıklığı yaşadım. ulan 3-5 biz de sebeplenek lan.Pyth ekibi nasıl bir hesap yapmış gerçekten çok tartışmalara yol açtı, önce bir 200 milyon attılar, sonra itirazlar geldi bir 55 milyon daha ayırdılar airdrop için, bazı Dapp'ler ondan sonra dahil oldu, sırf bu işler için kriptoda bulunan adamlar var, projeler de artık nasıl eleme yapacağını şaşırdı sık sık hata yapabiliyorlar...Bu olaylardan bağımsız olarak https://jup.ag/ isimli adresi kullanmanızı şiddetle tavsiye ederim, bu da benim bir istisna olarak bonus Airdrop önerim olsun, perpetuals'da da 100 USD üzeri 1-2 işlem atın, şu anda Jupiter Solana ağında uzak ara lider DEX, token'ı çıkınca burada da büyük airdrop bekleniyor...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 20, 2023, 04:27:01 PM",
      "body": "Quote from: Vispilio on November 20, 2023, 04:14:11 PMQuote from: gospodin on November 20, 2023, 03:56:08 PMjupiter üzerinden işlem yapanlara dağıtılmayacak mıydı bu airdrop? belli bir hacime ulaşanlara belli miktarlarda token dağıtımı olacaktı. solana ağında shit avındayken jupiter'i bolca kullanan birisiyim ama shit oldukları için hacimler doğal olarak düşük kalmıştı. geçen hafta paylaşılan resmi olmayan bilgilere göre airdrop alacağım diye düşünmüştüm ama şu an cüzdanlarım ile kontol edince cevap kocaman bir sıfır!şu ana kadar airdroplardan hep hayal kırıklığı yaşadım. ulan 3-5 biz de sebeplenek lan.Pyth ekibi nasıl bir hesap yapmış gerçekten çok tartışmalara yol açtı, önce bir 200 milyon attılar, sonra itirazlar geldi bir 55 milyon daha ayırdılar airdrop için, bazı Dapp'ler ondan sonra dahil oldu, sırf bu işler için kriptoda bulunan adamlar var, projeler de artık nasıl eleme yapacağını şaşırdı sık sık hata yapabiliyorlar...Bu olaylardan bağımsız olarak https://jup.ag/ isimli adresi kullanmanızı şiddetle tavsiye ederim, bu da benim bir istisna olarak bonus Airdrop önerim olsun, perpetuals'da da 100 USD üzeri 1-2 işlem atın, şu anda Jupiter Solana ağında uzak ara lider DEX, token'ı çıkınca burada da büyük airdrop bekleniyor...2021-2023 (ay olarak belirtmişlerdi.) arası jupiter üzerinden işlem yapanlara bonuslu şekilde airdrop verecekler yazılmıştı. tabii bu yazdıklarım hep resmi olmayan açıklamalar. bu tür airdroplarda o kadar çok değişken oluyor ki insanın takip etmesi gerçekten çok zor.jupiter üzerinden işlem yapacaksın ama bunu xxx cüzdanı ile yapacaksın.xxx cüzdanını android telefonunda olacak ama telefonunun da fatura borcu olmayacak.faturanı ödemeyeceksin ama elektrik faturanı ödeyeceksin...valla şartlar böyle saçma sapan yerlere gidiyor. bir de hangisini takip edeceksin abi? bot kurup sağlı sollu saldıracaksın üstüne de gerçekten para harcaman gerekecek. bazı durumlar benim gibi sıradan kullanıcıyı aşıyor. hem zaman hem de para açısından böyle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 20, 2023, 06:32:15 PM",
      "body": "Quote from: mandown on November 20, 2023, 04:01:05 PMuzun zamandır alamadığım nadir airdroplardan biri oldu neden alamadığımı anlamadım. Millet malı götürdü abi. 10k usd üstü airdrop alanı gördüm kalpten gidiyordum.Hocam kalpten gidecek bir şey yok. Hayatta her şey nasip kısmet işidir. Demek ki bu nasibinde yokmuş diye bakmak lazım.Bende başlığı görünce bir umut baktım ama koskocaman zero gördüm.😂Hayırlısı bakalım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "November 20, 2023, 08:02:36 PM",
      "body": "Solanacıları yabana atmamak lazım baya aktif bir network, şimdiden 84%'ü claim edilmiş ki büyük bir airdroptu, Solana ekosistemine bir enjeksiyon oldu resmen...kaynak: https://dune.com/queries/3215128/5375214",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 20, 2023, 10:19:03 PM",
      "body": "Vay arkadaş, nerede böyle uğraşıp didinip, kırk tane görev yerine getirip beklentiye girdiğim zıvır varsa hepsi tırt, ve ne kadar milleti ihya eden ve duyanın duyduğu ama benim haberim olmayan zıvır varsa hepsi tavan. Bir zamanlar burada millet airdropları boklayıp katılanlara beleşçi muamelesi yaparken ben ve Gospodin ne airdroplar kovalamıştık. O zamanlar güzel de kazandım yalan yok ama uzun süredir airdrop konusunda kısmetim kapalı.En son sağlam airdrop alışım sağolsun Lachrymose'un açtığı konu sayesinde 1inch'den olmuştu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vispilio",
      "created_time": "November 22, 2023, 02:15:12 PM",
      "body": "https://staking.pyth.network/stakingStaking başladı ve baya tepki alımları geldi, güçlü projeymiş PYTH, bu kadar büyük airdrop'tan sonra 4 milyar USD+ FDV ile çok hızlı toparlandı diyebiliriz:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}