{
  "id": "topic_5459000",
  "title": "l99l",
  "author": "l99l",
  "created_time": "July 07, 2023, 05:22:30 PM",
  "content": "Özellikle dolunay dönemlerinde astrologlar 'dolunaydan etkilenme' konusunda türlü bilgiler verirken pek çok insan da türlü ruh hallerini dolunaya bağlar. Hallenilmeyi seviyoruz herhangi bir duruma bağlayarak, Dolunayda Astrolojide öneme sahip dünyamızın da uydusu, Dolunay zamanı deniz, göllerde git gel etkisi olur. İnsan Dolunaydan etkilenebilir mi insan vucududa sudan oluştuğuna göre mümkün müdür sorusu ?. sorunun cevabı karşısında bilim insanları, astrologlar farklı yazarlar ayrı düşünmüşler.''Hayır, etki edemez; çünkü medcezirin okyanuslara ve denizlere etki edebilmesinin nedeni, onların \"su\" olması değil, onların 1.400.000.000.000.000.000.000 kilogram kütleye sahip olmasıdır. Okyanuslar su değil de cıva olsaydı da etkileneceklerdi ve biz, yine etkilenmeyecektik.Eğer vücudunuzda siz de 1.4 sekstilyon kilogram suyu serbest olarak taşıyor olsaydınız, evet Ay'dan ve Güneş'ten etkilenirdiniz. Ne var ki vücudunuzdaki su, sadece 50-60 kilogram kadar ve hücrelerinizin içine ve aralarına dağılmış halde. Bunun üzerine Ay'ın etkisi, Ethem hocamızın tabiriyle sizi doğuran ebenizin kütlesinin etkisinden daha zayıf olacaktır.''Evrim Ağacı Çağrı Mert Bakırcı aradaki kütle farkından dolayı imkansız olduğunu savunmuş.Metafizik boyutunda kütlenin, çekimin çok önemi yok enerjisel olarak böyle bir etkisi oluyor olamaz mı olasılığı var yok denemez değildir.https://evrimagaci.org/soru/gelgit039in-insanlar-uzerine-bir-etkisi-olur-mu-16664#https://www.webtekno.com/dolunay-gelgitler-insanlari-gercekten-etkiler-mi-h125763.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459000",
  "comments": [
    {
      "author": "eightdots",
      "created_time": "July 11, 2023, 10:24:42 AM",
      "body": "Doğada yaşanan birçok olay birbiriyle bağlantılıdır. Buradaki etkide büyüklük baz alınmış ama hiç bilgi sahibi olduğum bir alan değil. Dizi/filmlerden aşinayım sadece. Dolunay oldu mu vay kurt adamların haline. Hiçbiri dönüşmek istemiyor Böyle olaylar ile ilgilenip de önümüzdeki ay şu şekilde bir ruh halim olacak şeklinde takılanlar da var. \"Hallenilmeyi seviyoruz\" iyi bir söylem olmuş bu konuyla ilgili. Bilim insanları ve astrologların aynı cümlede kullanılması da günümüzde astrologların ne kadar çok ilgi gördüğünü kanıtlıyor. Astrologlar ile ilgili bir eleştiri yapmıyorum ama en son bu sene için Fenerbahçe şampiyon olacak demişlerdi, hani nerede şampiyonluk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "July 11, 2023, 04:07:48 PM",
      "body": "Domino taşı etkisi diyerek dolunay denizlere denizlerin gelgitli havası yakın çevredeki canlılara o canlılardan bir kuş gelipte sabah sabah gafana sıçar ve etkilenmeden güne devam edebilirsen hocam evet dolunay insanları etkilemez   Şakası bir yana dolaylı olarak etkisi olur olmaz değil ama astrologların salladığı gibi olmaz yani. Bundan 4-5 sene ön el yazısından worde aktarma işi almıştım baya bi sayfaydı ve bu metinler yok bu zamanda ay şu evreye merkür bu evreye giriyor sana şu çıkıyor yazıları vardı yani o yüzden astrologlara hasssiktrolog olup git diyebilirsiniz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "July 15, 2023, 07:56:26 PM",
      "body": "Ben hayatımın ilk 20 yılında büyükşehir dışına çıkmamışım ya da hatırlamıyorum. Üniversitede kulüplerle doğaya çıktığımda özellikle gece bir garip olmuştum. Hiç gerçekten yıldız görmemişim diye düşünmüştüm. Çok net hatırlıyorum, kilometrelerce yakında elektrik bile yokken dolunay sanki farklı bir şeyler hissettirmişti. Bu tabi benim abartmam da olabilir ama işte sanki farklı bir enerjisi var gibi gelmişti yalan söylemeyeyim. Ama ilk postta bahsedilen dolunay etkisinin olduğunu düşünmüyorum. Lodos rüzgarının bir etkisi var mesela bence, çevremdeki insanlardan kesin gözlemleyebiliyorum. Eşim kesinlikle lodos günlerinde bir gıcık oluyor örneğin. Ama aynı şeyi ya da benzer bir şeyi dolunayda hiç yaşamadım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzigie",
      "created_time": "July 16, 2023, 12:22:33 PM",
      "body": "Quote from: püsür on July 15, 2023, 07:56:26 PMLodos rüzgarının bir etkisi var mesela bence, çevremdeki insanlardan kesin gözlemleyebiliyorum. Eşim kesinlikle lodos günlerinde bir gıcık oluyor örneğin. Ama aynı şeyi ya da benzer bir şeyi dolunayda hiç yaşamadım.Eşinizin polen veya toza karşı duyarlılığı olabilir. Rüzgarlı havalar benim ablamı da rahatsız ederdi. O da lodostan veya daha hafif rüzgarlardan hoşlanmazdı. Yakıştırmak gibi olmasın ama astım hastaları da buna benzer hava durumlarından hoşlanmazlar.Dolunaydan etkilendiğimi hiç hatırlamıyorum. Beni etkileyecek bir şey olarak görmüyorum dolunayı. Bana göre ilk ay gibi sıradan bir doğa hareketi. Fakat kurtlar dolunayda çok agresif ve hareketli oluyorlar. Bazı köpekler de dolunayda kurtlar gibi agresif ve hareketli oluyor. Türk mitolojisinde de bu olayın çok fazla örneği vardır. Hayvanların bazı hissiyatları daha güçlü olduğu için çekim etkisini bizden daha güçlü bir şekilde hissediyor olabilirler. Ben bu tür konulara karşı nötrüm. Olumlu veya olumsuz herhangi bir düşünce taşımıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}