{
  "id": "topic_5410676",
  "title": "DigitalMonk",
  "author": "DigitalMonk",
  "created_time": "August 21, 2022, 11:54:58 AM",
  "content": "* How does custom built  Bitcoin work ? * Can you receive and spent from a custom built BTC Address ?  * Can you Sign a a message from Custom built Address ? Is Bitcoin QT compatible and accept custom built Bitcoin Address ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410676",
  "comments": [
    {
      "author": "PrivacyG",
      "created_time": "August 21, 2022, 12:00:01 PM",
      "body": "There is no such thing as 'custom built address'.  What they do is they use a software to generate as many private keys as possible until one of them fits their initial request.  For example, you could request the software to generate private keys until one of them leads to an address containing 'BTCTalk'.  But of course, it gets harder the more specific you are and the more characters you use.  For example, it could be easier to generate an address containing the characters 'btctalk' without caring about the case sensitivity.  That might generate you a sequence such as 'bTctaLK' which is not ideal, but it should take way less time and the characters you wanted are still there so basically the software did the job.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "August 21, 2022, 12:09:44 PM",
      "body": "You can use the addresses just like any other address and you can also use them with any wallet you want, as long as the wallet supports importing private keys. Check these projects if you're interested in making one[1][2][1] https://github.com/JeanLucPons/VanitySearch[2] https://github.com/samr7/vanitygen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DigitalMonk",
      "created_time": "August 21, 2022, 12:41:50 PM",
      "body": "Can I create a private key out of a custombult  Bitcoin address ? How generate private key out of public key ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 21, 2022, 12:51:29 PM",
      "body": "Quote from: DigitalMonk on August 21, 2022, 12:41:50 PMCan I create a private key out of a custombult  Bitcoin address ? How generate private key out of public key ?  You can not do that since both operations are one way operations. Meaning you can compute public key from private key but not the other way around.Code:private key -> public key -> hash <-> address (human readable encoding)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 21, 2022, 12:58:42 PMLast edit: August 21, 2022, 01:09:27 PM by franky1",
      "body": "no..trying to start with a public address and work backwards to get a private key doesnt work. thats the beauty of cryptography security. you cant just pick a public address and find the private key(unless the target/victim used a broken/weak generator that had no randomiser* and you want to find the private key of their weak vanity gen/brainwallet)plus why would you want to.. nothing special about a private key that needs a trendy recognised sequence. because no one should be viewing the private key..vanitygen is about trying thousands of random private keys until it finds a public address that meets a character set someone wantsvanity address works by finding a sequence where the first few characters of the address are what someone wantsEG1f.....  can be found in a nearly/below hundred tries1fr.... can be found in a several thousand tries1fra.. can be found in a over a couple hundred thousand tries1fran. can be found in over a dozen million triesthe more characters at the start(prefix) you want a certain way the more magnitude of tries are requiredone major thing to suggest if you genuinely want a vanity addressis use a vanity generator that starts with a random number as the private key from the start of the process, then tries X attempts forward from that point.because if you try from 0 first.. so can someone else and thus in whatever time it took you to get a few prefix letter in your desired format. would take someone else that same timethus your key is WEAKbut starting from a random number no one can guess and then move forward means although many people could have a prefix the same as your prefix, but the other 20+characters suffix(end) would be different thus not the same address thus they cant steal things from you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "August 21, 2022, 01:24:55 PM",
      "body": "Quote from: DigitalMonk on August 21, 2022, 11:54:58 AM* Can you receive and spent from a custom built BTC Address ?  I guess what you asked is Vanity address.Three topics to learn and create Vanity address and how to use it.[Guide] How to create your customized Bitcoin-Address (vanitygen) – step by step[GUIDE] How To Create Vanity Address (Segwit)Pretty Addy Giveaway - part 2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "August 21, 2022, 02:17:54 PM",
      "body": "Quote from: DigitalMonk on August 21, 2022, 12:41:50 PMCan I create a private key out of a custombult  Bitcoin address ? How generate private key out of public key ?  The point of a private key is that it is something the public can not find.  It is something private that has only been generated by yourself.  If anyone could find the private key of my address, bc1q76xwrcslun45tt8trlklpec8kywg7f4qznwdmh, then Bitcoin's purpose would be nonexistent because everyone would have access to everyone's coins.So the answer is no.  You can not get the private key from the public address, whether 'custom' or not.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "August 21, 2022, 08:17:58 PM",
      "body": "Also, if you decide to do this, for security purposes, please make sure you use an air gapped computer, meaning no internet connection and no open connections/ports/communications when generating a vanity address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "August 21, 2022, 09:07:07 PM",
      "body": "Quote from: 2stout on August 21, 2022, 08:17:58 PMAlso, if you decide to do this, for security purposes, please make sure you use an air gapped computer, meaning no internet connection and no open connections/ports/communications when generating a vanity address.And make sure you know what the hell you are running.  Do not download a random software promising to get you some vanity addresses.  Do your research.  I would give you a link to a legitimate one, although why would you trust me?And no way should you ever run an online vanity address generator.  It might generate one for you, but chances are you will not be the only owner of the private key.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "August 21, 2022, 09:42:01 PM",
      "body": "Vanity gen is the right way to go. But is important to mention the limitations. While more chars you look for your address the complexity will be bigger, and it will tame more tame to generate. It's easy to create a wallet starting with 1BTC, but is complex to generate a 7 chars address.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jemzx00",
      "created_time": "August 21, 2022, 09:54:03 PM",
      "body": "I guess you're thinking about vanity generated address which can customized on the second to more digits of your bitcoin address. Yes, you can sign thru these kind of address and pretty much do things like what any other address do. You can try and check this thread from LoyceV about Pretty Addy Giveaway which has all the process on doing so and information about vanity address and he can also provide you some help providing your desired address. Note that the longer your desired custom address you want the longer it take to generate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "August 21, 2022, 10:46:25 PM",
      "body": "Quote from: PrivacyG on August 21, 2022, 09:07:07 PMQuote from: 2stout on August 21, 2022, 08:17:58 PMAlso, if you decide to do this, for security purposes, please make sure you use an air gapped computer, meaning no internet connection and no open connections/ports/communications when generating a vanity address.And make sure you know what the hell you are running.  Do not download a random software promising to get you some vanity addresses.  Do your research.  I would give you a link to a legitimate one, although why would you trust me?And no way should you ever run an online vanity address generator.  It might generate one for you, but chances are you will not be the only owner of the private key.-Regards,PrivacyG100% totally agree.  I remember one of those online vanity generators pulled a long con and then swept all the funds.  A quick search on vanity gen  scam on the forum will show how rife the scam is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DigitalMonk",
      "created_time": "August 22, 2022, 08:41:38 AM",
      "body": "I think Theymos can answer my question, how to get a private key from a custom built Public Key ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "August 22, 2022, 10:07:34 AM",
      "body": "Quote from: DigitalMonk on August 22, 2022, 08:41:38 AMI think Theymos can answer my question, how to get a private key from a custom built Public Key ? What is a custom public key, anyway? The public key is essentially a concatenation of an index that describes what we are looking at (either compressed or uncompressed public key) and, depending on this index, a concatenation of X-coordinate and Y-coordinate. There is nothing particularly interesting or \"custom\" about these coordinates because these are only numbers expressed in a certain format. Humans can't read these numbers easily, let alone they can comprehend how big they are. You are probably talking about public addresses, not public keys, but a public address is a derivative, it is an unpredictable output of using a public key as an input in two one-way hash functions, namely sha256 and RIPED160. You can't know in advance what a public address will be, you must first generate a random number (aka a private key), then calculate the coordinates using a previously generated private key, and only then can you start calculating your desired public address. Given that hash functions are one-way (you can't figure out input from output unless by brute-forcing all possible input values, which is practically impossible), you can't calculate the corresponding public key from your address, and, therefore, you also can't start to brute force corresponding private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DigitalMonk",
      "created_time": "August 22, 2022, 12:31:21 PM",
      "body": "When Bitcoin was invented, a public key or address were created first without using the SHA-256 then the first 50 Bitcoin was mined by the Bitcoin inventor the enigmatic Satoshi Nakamoto. There after he mined block 9 and made the first transaction. Now he must have created private keys for making transaction. Otherwise it is impossible to make transaction on the Blockchain. * Now, I am simply want to know how can create a customised public address and link a private key to it to make transaction ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "August 22, 2022, 08:50:26 PM",
      "body": "Quote from: DigitalMonk on August 22, 2022, 12:31:21 PM* Now, I am simply want to know how can create a customised public address and link a private key to it to make transaction ? Do you even try to read our posts or are you going to keep your own way?There is no way to get a custom public address and link a private key to it.  You get a private key and turn it into a private key.  No way me, you, Theymos or even Nakamoto himself can generate a private key out of a public address for you.Read all the replies above, they are more than enough to answer your question.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}