{
  "id": "topic_5473448",
  "title": "JMBitcointernational",
  "author": "JMBitcointernational",
  "created_time": "November 09, 2023, 07:25:09 AM",
  "content": "Before joining this forum i was thinking that Bitcoin is only limited to trading and investment  but  this forum has actually exposed my mind that Bitcoin is broad and covers a wider scope unlike my initial perception.The greatest thing that happens to me this period is joining this forum because it gave me the  access to meet knowledgeable crypto experts and gurus and am also happy because I have the chance of learning from their Bitcoin talks and discussions and with this idea I will take the Bitcoin activities very confidencial .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473448",
  "comments": [
    {
      "author": "Odohu",
      "created_time": "November 09, 2023, 07:50:57 AM",
      "body": "This forum should be the oldest and biggest Bitcoin community. It has one of the most active users of Bitcoin as can be seen in the daily activities here. Virtually all information relating to Bitcoin can be found here and if peradventure anything is missing, simply asking questions in the relevant section will deliver the answer within a short time because there are people with great experience here. There is hardly anyone who is in this forum and open to learning that will be lost. Hence, I'm not surprised to see rapid transformation in anyone who joins this forum and is committed to learning and following the conversation. I must admit that I was rejuvenated when I found this forum after knowing and using Bitcoin for years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 09, 2023, 08:49:59 AM",
      "body": "What can you ask and hope for with the foundational forum where the legend satoshi nakamoto has also discussed about Bitcoin per se together with other enthusiasts on the early days. Quote from: JMBitcointernational on November 09, 2023, 07:25:09 AMwith this idea I will take the Bitcoin activities very confidencial .You don't have to keep that knowledge when situation permits you, as long as you get to learn and absorb everything that you're learning from here. What you need to make it confidential is your involvement in Bitcoin because there are a lot of people nowadays that are targeting people that has knowledge Bitcoin in real life and they intended to harm to us. The common attacks like $5 wrench attack, robbery, etc. So that's what you should make yourself always remember to be lowkey while learning things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "November 09, 2023, 08:50:52 AM",
      "body": "Quote from: JMBitcointernational on November 09, 2023, 07:25:09 AMBefore joining this forum i was thinking that Bitcoin is only limited to trading and investment  but  this forum has actually exposed my mind that Bitcoin is broad and covers a wider scope unlike my initial perception.Knowledge about trading and investment can actually be found in many places if you or someone wants to learn it. However, in this forum you can get something that you might get elsewhere because of the knowledge and expertise of the members of this forum in testing a discussion with very unique abilities with delivery that is easy to understand.Your opening is interesting. You have the view that this forum is only limited to trading and investment. It is true that this forum is the most active with discussions covering all things including political matters if you like. How do you know this knowing that this forum is only about trading and investment. You were invited to join because someone explained it to you or someone else made you join.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 09, 2023, 08:54:18 AM",
      "body": "Good to see this. I have felt like this before when I was a newbie and learning. This forum helped me enough in real aspect of life. Anyone that is interested in bitcoin will not regret coming to this forum. But it would be better if you come with a meaningful topic next time so that we can also learn from what you have gained from. But I can understand this, it is about how you feel and appreciate what is going on this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "November 09, 2023, 11:18:27 AM",
      "body": "Quote from: JMBitcointernational on November 09, 2023, 07:25:09 AMBefore joining this forum i was thinking that Bitcoin is only limited to trading and investment  but  this forum has actually exposed my mind that Bitcoin is broad and covers a wider scope unlike my initial perception.The greatest thing that happens to me this period is joining this forum because it gave me the  access to meet knowledgeable crypto experts and gurus and am also happy because I have the chance of learning from their Bitcoin talks and discussions and with this idea I will take the Bitcoin activities very confidencial . Just like you, some of us had a narrow view of the term cryptocurrency but getting to the forum so much in knowledge changed in that. Informations patterning to cryptocurrencies you are presumable to pay for before having access to acquire them in some of the platforms I have been to, here in the forum you'll get it all free so long as you are ready to learning and ask questions about it. The love in the forum in sharing of knowledge is contagious that you can't hoard back whatever you've learned but in the look out for an opportunity to extend it to newbies too. The much crypto knowledge I have acquired I owe it to the bitcointalk community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "November 09, 2023, 03:26:00 PM",
      "body": "Quote from: JMBitcointernational on November 09, 2023, 07:25:09 AMBefore joining this forum i was thinking that Bitcoin is only limited to trading and investment  but  this forum has actually exposed my mind that Bitcoin is broad and covers a wider scope unlike my initial perception.The greatest thing that happens to me this period is joining this forum because it gave me the  access to meet knowledgeable crypto experts and gurus and am also happy because I have the chance of learning from their Bitcoin talks and discussions and with this idea I will take the Bitcoin activities very confidencial .I am glad you liked this forum and it helped you to understand the use cases of BTC but I am wondering what would be the broad scope you are talking about. I have been here for 2 years and till now I thought BTC was all about trading and investment (actually trading is a form of investment) so they meant the same thing here. If I have to assume here, I can say we can use BTC for payment method, for making seamless deals even if the banks are out, we can use BTC blockchain for making seamless smart contracts, we can use this technology in the voting system and many other systems and BTC can be used as a medium for freedom of speech due to its permanent data entry. Anyway, this forum has a lot to offer other than learning new things, we can make friends here, can communicate with them about the crypto industry because the network matters and this forum is also a source of earning so keep your spirits up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PytagoraZ",
      "created_time": "November 09, 2023, 03:35:03 PM",
      "body": "Quote from: JMBitcointernational on November 09, 2023, 07:25:09 AMBefore joining this forum i was thinking that Bitcoin is only limited to trading and investment  but  this forum has actually exposed my mind that Bitcoin is broad and covers a wider scope unlike my initial perception.It's great that you quickly found out the other side of bitcoin, can you explain it? I'm still confused about bitcoin. As far as I know bitcoin is a currency, digital asset, trading and investment. But I hope I can learn more about Bitcoin, and most importantly I hope I can hold a lot of Bitcoin for a long time because I believe it could change my life in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "November 09, 2023, 04:10:33 PM",
      "body": "Quote from: JMBitcointernational on November 09, 2023, 07:25:09 AMBefore joining this forum i was thinking that Bitcoin is only limited to trading and investment  but  this forum has actually exposed my mind that Bitcoin is broad and covers a wider scope unlike my initial perception.The greatest thing that happens to me this period is joining this forum because it gave me the  access to meet knowledgeable crypto experts and gurus and am also happy because I have the chance of learning from their Bitcoin talks and discussions and with this idea I will take the Bitcoin activities very confidencial .There are other platforms you can as well join and gain more knowledge or general education about what Bitcoin is actually meant for, but being a member of this forum \"bitcoinltalk\" created by Satoshi and which its purpose is targeted to educating newbies like you about Bitcoin and cryptocurrency gives you an edge in gaining firsthand information about Bitcoin and from the hands of some experts we have here in the space when it comes to bitcoin-related information. Feel free to have you join, relax and learn as you have become part of us, Welcome, Op.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "November 09, 2023, 04:33:30 PM",
      "body": "You think joining this forum is the best decision for you right now, here I want to tell you that being active on this forum regularly can be another best decision for you. Before joining this forum you considered Bitcoin as a coin only for trading and investing but soon after joining Bitcoin Forum you changed your view. Since your perspective has changed so much in the beginning, if you spend time in the forum and try to learn regularly, I can tell you that your total perception of Bitcoin will change. Surviving in the forum for a new member is a bit challenging but if a new member takes that challenge and survives in the forum then this bitcoin forum has a lot to offer him. Best of luck to you, hope this forum makes you a lot more experienced at some point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JMBitcointernational",
      "created_time": "November 09, 2023, 06:21:42 PM",
      "body": "Quote from: _act_ on November 09, 2023, 08:54:18 AM This forum helped me enough in real aspect of life. Anyone that is interested in bitcoin will not regret coming to this forum.  .Exactly and well said  because there are many advantages  of being a member of the forum, irrespective of the learning the forum also enhances your chances of becoming a crypto expert and also broadens your insight in all that it takes to have a prime and concretive knowledge about bitcoin and cryptocurrency in general . i sincerely thank the members of this group for their efforts in creating a reliable awareness for newbies to be positive minded about bitcoin and cryptocurrency at large.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "November 09, 2023, 07:07:44 PM",
      "body": "It's good you found your way here; I believe that's how it has been a good source that most people have also learned from in the past, and new people are always coming to the forum to learn. Although I was skeptical about Bitcoin when I first heard about it, later I got more interested and invested in it. I already had some good knowledge about Bitcoin before I joined the forum, but I still appreciate the fact that I have learned more things about it than I know. Learning never ends; we learn every day and on different topics, and the good of the forum is that there are different boards and other discussions here on the forum that are also very important in our lives. Keep learning, and you will be better. Enjoy your stay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "November 09, 2023, 07:44:47 PM",
      "body": "Quote from: JMBitcointernational on November 09, 2023, 07:25:09 AMBefore joining this forum i was thinking that Bitcoin is only limited to trading and investment, but this forum has actually exposed my mind that Bitcoin is broad and covers a wider scope unlike my initial perception.Lack of exposure limits the knowledge someone can have about something like bitcoins. There are many people who have a limited idea of what it is, and the ways to actually get bitcoins. Trading is the only side some people know about; they have no idea that there is a mining side to getting bitcoins and even that they are not supposed to keep bitcoin on the exchanges that they trade in. This forum changes that and exposes us to many information and things about bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "barisbilgili",
      "created_time": "November 10, 2023, 01:44:13 AM",
      "body": "Quote from: Dr.Bitcoin_Strange on November 09, 2023, 07:07:44 PMIt's good you found your way here; I believe that's how it has been a good source that most people have also learned from in the past, and new people are always coming to the forum to learn. Although I was skeptical about Bitcoin when I first heard about it, later I got more interested and invested in it. I already had some good knowledge about Bitcoin before I joined the forum, but I still appreciate the fact that I have learned more things about it than I know. Learning never ends; we learn every day and on different topics, and the good of the forum is that there are different boards and other discussions here on the forum that are also very important in our lives. Keep learning, and you will be better. Enjoy your stay.There is a lot of knowledge that can be gained on forums and there are also many things we can learn here about Bitcoin and we can also understand how to make a profit by investing using Bitcoin. Everyone who is new to Bitcoin will not be able to easily believe it, they need to learn it first before they can believe that by investing using Bitcoin they will be able to make a profit. You are right, it is important for those of us who are on this forum to be able to study various topics every day and this will make us even better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "November 10, 2023, 02:11:04 AM",
      "body": "You're not alone. As a matter of fact, I guess many of the latest Bitcoin supporters only perceive Bitcoin as a speculative asset or a new investment option. In other words, they are only looking at Bitcoin's USD price. It may not be their fault as they might have been first introduced to it through its price itself, but I hope they will also realize later on that Bitcoin isn't just that. In the first place, Bitcoin is the kind of hard money that the world badly needs now. It has implications in economics, privacy, governance, freedom, human rights, and so on. Isn't Bitcoin interesting?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "November 10, 2023, 02:33:10 AM",
      "body": "Quote from: JMBitcointernational on November 09, 2023, 07:25:09 AMBefore joining this forum i was thinking that Bitcoin is only limited to trading and investment  but  this forum has actually exposed my mind that Bitcoin is broad and covers a wider scope unlike my initial perception.The greatest thing that happens to me this period is joining this forum because it gave me the  access to meet knowledgeable crypto experts and gurus and am also happy because I have the chance of learning from their Bitcoin talks and discussions and with this idea I will take the Bitcoin activities very confidencial .You're fairly new to the forum, and you've already had quite a bit of time to read the information you need. and from your statement maybe you have benefited from the information you got.Because maybe you previously knew Bitcoin as an investment or trading asset, maybe you will be more interested there. Maybe you can share anything you get from forums that support increasing your knowledge and even skills in trading or investing in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EFS",
      "created_time": "November 10, 2023, 03:31:41 AM",
      "body": "Quote from: JMBitcointernational on November 09, 2023, 07:25:09 AMBefore joining this forum i was thinking that Bitcoin is only limited to trading and investment  but  this forum has actually exposed my mind that Bitcoin is broad and covers a wider scope unlike my initial perception.The greatest thing that happens to me this period is joining this forum because it gave me the  access to meet knowledgeable crypto experts and gurus and am also happy because I have the chance of learning from their Bitcoin talks and discussions and with this idea I will take the Bitcoin activities very confidencial .Welcome to the forum. There are not many crypto experts left here besides a handful of good guys in more technical side of the forum but you can still find old threads and benefit from quality discussions that has happened here. As you may know Satoshi created this forum and his posts are still available to read. This place is quite different than mainstream social media platforms. The userbase is also different. If you search and couldn't find an answer to your question related to Bitcoin and other crypto-currencies, don't hesitate to ask here even if it looks too simple.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iroh",
      "created_time": "November 10, 2023, 03:32:29 AM",
      "body": "Welcome to the forum. From your post, I think it’s safe to say you’ve successfully managed to browse through the forum and have started learning new information that is beginning to change and broaden your perspective about bitcoin. That’s good. A lot of people had likely thought along the same lines as you once did and a lot more probably still do. It can be satisfying knowing all your questions has already been(in some old thread)or will be answered. You seem happy on joining the forum. So be sure to read through and know things that are frowned at. Although it’s primarily about bitcoin, this forum also hosts a variety of discussions aside talks about bitcoin, so explore!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 10, 2023, 04:13:10 AM",
      "body": "Not bad. At least we have a thread of this style that is not only concerned with the economic interest that Bitcoin can bring. The only thing I miss is that the OP would have specified something about what he says he has learned in the couple of months he has been registered in the forum, because in his post history I only see that he has written some posts in this section, and I do not think he has learned much if he has only read this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "November 10, 2023, 10:04:35 AM",
      "body": "The forum is known for increasing the knowledge of members or participants, due to the large number of bitcoiners in the community. A whole lot of problems, and questions has been solved and answered in the forum. Any newbie that comes to the forum would at first think that bitcoin is about trading and investment. But, on the long going would realize the underground tech behind bitcoin. How miners work and what mining is all about in approving bitcoin transactions. Multiple bitcoin learning links are being spread round the forum for new members to read. If they read those links, their horizon will expand. They'll definitely see the deeper aspect of bitcoin. Though, it doesn't end there, but it'll put them somewhere ahead their peers, when it comes bitcoin discussion. What matters is consistently reading the bitcoin information, trends and updates. Because once we stop reading, our knowledge of bitcoin decreases as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}