{
  "id": "topic_5459782",
  "title": "@sriyan",
  "author": "@sriyan",
  "created_time": "July 14, 2023, 09:15:37 AMLast edit: July 14, 2023, 12:01:22 PM by @sriyan",
  "content": "What do you think about the polygon and polygonzkevm ecosystem? They launched a new token called \"POL\" to support both chains. So the existing matic token will be swapped to \"POL\". Also, the Polygon lab Founder is given some hints about the existing token airdrop. What do you think about it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459782",
  "comments": [
    {
      "author": "asriloni",
      "created_time": "July 14, 2023, 04:36:30 PM",
      "body": "Quote from: @sriyan on July 14, 2023, 09:15:37 AMWhat do you think about the polygon and polygonzkevm ecosystem? They launched a new token called \"POL\" to support both chains. So the existing matic token will be swapped to \"POL\". Also, the Polygon lab Founder is given some hints about the existing token airdrop. What do you think about it? Nothing special from this. The only improvement if the new token gonna be supporting ZKevm blockchain which is focusing into the high privacy for its user. I tried to find what you called that as hint for polygon lab to do airdrop in the future but i can't find any. Can you mention it here? It's quite strange that caused by even some people were calling the new token will have unlimited supply. The initial supply gonna be the same like matic. This is only rebrading and there's nothing special. Polygon labs was just implementing 1% trasury fees for funding purpose. That's pretty much the same like a small tax for polygon labs. Have you been ever reading the POL whitepaper before?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 14, 2023, 07:23:40 PM",
      "body": "Quote from: @sriyan on July 14, 2023, 09:15:37 AM...Founder is given some hints about the existing token airdrop. What do you think about it? When we hear such conversations about awards that come from people holding such a position, you just need to put aside all your business and perform at least minimal interaction in the Polygon ZkEVM network. But while there are few projects in the ZkEVM network, I will list some here:- https://app.0vix.com/- https://app.antfarm.finance/- https://quickswap.exchange/- https://polygon.name/- https://pancakeswap.finance/swap?chain=polygonZkEVM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 14, 2023, 09:39:50 PM",
      "body": "Quote from: @sriyan on July 14, 2023, 09:15:37 AMWhat do you think about the polygon and polygonzkevm ecosystem? They launched a new token called \"POL\" to support both chains. So the existing matic token will be swapped to \"POL\". Also, the Polygon lab Founder is given some hints about the existing token airdrop. What do you think about it? This could be a great development as MATIC continues to introduce growth and they’ve done this as a better solution to address other issues, we might see a new ATH for this coin in the next bull run and this is a good preparation. Though if you’re going to invest and follow this update, just make sure you understand how it works and the possible effect of this one, read the whitepaper and know its total supply, that can affect its valuation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "July 15, 2023, 03:53:22 AM",
      "body": "I honestly like 'POL' ticker better than 'MATIC', and one token being used on both chains, it'll be convenient for the user. Quote from: @sriyan on July 14, 2023, 09:15:37 AM Also, the Polygon lab Founder is given some hints about the existing token airdrop. What do you think about it? Source? (I checked Sandeep Naiwal Twitter, could not find anything relevant).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@sriyan",
      "created_time": "July 16, 2023, 05:30:17 AM",
      "body": "Quote Source? (I checked Sandeep Naiwal Twitter, could not find anything relevant).You can check the source here: https://twitter.com/sandeepnailwal/status/1656262074950094850?s=20    I hope he will give the airdrop as promised. Otherwise, it will affect the entire polygon ecosystem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 16, 2023, 11:06:28 AM",
      "body": "Quote from: libert19 on July 15, 2023, 03:53:22 AMI honestly like 'POL' ticker better than 'MATIC', and one token being used on both chains, it'll be convenient for the user... Considering the fact that the Total supply of Matic coins is completely in circulation, I think it may have something to do with the upcoming airdrop from Polygon. Thus Max. supply coins POL can exceed Max. supply Matik, while the difference will be aimed at airdrop from Polygon ZKEVM and encouragement of future validators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "July 16, 2023, 07:25:33 PM",
      "body": "The news of rebranding the token ticker from Matic to POL seems to have been well received by the market, but I just feel this is the same play book once again, the team has burnt a lot of money recently from the acquisition of new tech, hiring, marketing and branding, but the chain seems to be long distance for the major competitor, far from Ethereum, Binance chain, Arbritum etc. I do not expect much from Matic, but this will surely pump the price when the time comes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 21, 2023, 02:07:35 AM",
      "body": "Their PolygonZKEVM is superb and a key player here. We all know that in the early days, Polygon (Matic) is one of the pioneers in the layer 2 network that is under Ethereum.So for me, Polygon is a good project for long term especially layer-2 network these days keep increasing especially the TVL. It just a matter of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 21, 2023, 05:24:03 PM",
      "body": "Quote from: jacafbiz on July 16, 2023, 07:25:33 PMThe news of rebranding the token ticker from Matic to POL seems to have been well received by the market, but I just feel this is the same play book once again, the team has burnt a lot of money recently from the acquisition of new tech, hiring, marketing and branding, but the chain seems to be long distance for the major competitor, far from Ethereum, Binance chain, Arbritum etc. I do not expect much from Matic, but this will surely pump the price when the time comesThis is just an announcement, which the team takes 4 years to implement. And until the Polygon community has made a decision on this, migration from Matic to POL cannot be made. So either we will have to wait for an airdrop from Polygon ZKEVM for a very long time, or this airdrop will be released in Matic coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "July 21, 2023, 06:18:32 PM",
      "body": "Quote from: @sriyan on July 14, 2023, 09:15:37 AMWhat do you think about the polygon and polygonzkevm ecosystem? They launched a new token called \"POL\" to support both chains. So the existing matic token will be swapped to \"POL\". Also, the Polygon lab Founder is given some hints about the existing token airdrop. What do you think about it? I'm not a huge fan of any alts but polygon has a bright future ahead.  While we were sitting in a bear market they didn't sit back and wait until everything was pumping, they pushed forward with some really progressive stuff.  Interested to see what this coins price does when we are in a full bull market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "July 21, 2023, 10:49:53 PM",
      "body": "honestly i'm not really sure about the airdrop at all, I just think that it wouldn't be that worth it considering that matic right now already have humongous total supply, i wonder if POL will also have humongous total supply and if thats true you could easily imagine that the airdrop maybe aren't gonna be that significant. moreover, the fact that this thing isn't discussed as heavily as the other emerging token just might means that this isn't gonna be massive event.even like that I think its still worth it holding some of matic just in case.though I just don't really sure that the gain will be that much considering some don't even care about this polygonzkevm thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "July 22, 2023, 12:08:44 PM",
      "body": "Despite speculations that Polygon zkEVM is going to have a big potential airdrop, I have started farming in their chain. However, their gas fees aren't cheap and it may go a bit higher if congestion occurs.I both have LPs in Pancakeswap and Quickswap under the Polygon zkEVM chain. The recent one I have participated is in Quickswap's PerpTrade opportunity in Galxe where we need to add at least $30 or more worth of Polygon zkEVM-pegged ETH to their pool to be airdropped with both QUICK and USDC after a week of providing LP. The gas fee that I have paid for depositing LP was somewhere around $2 to $3 worth ($5+ if congestion) and just under $2 if withdrawing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 22, 2023, 04:25:25 PM",
      "body": "Quote from: @sriyan on July 16, 2023, 05:30:17 AMYou can check the source here: https://twitter.com/sandeepnailwal/status/1656262074950094850?s=20    I hope he will give the airdrop as promised. Otherwise, it will affect the entire polygon ecosystem.There is no promise of a clear date for the airdrop, there is a hint that it may take a year or more, otherwise do not trust any airdrop you hear about other than the official channel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 22, 2023, 06:18:27 PM",
      "body": "Quote from: yhiaali3 on July 22, 2023, 04:25:25 PMThere is no promise of a clear date for the airdrop, there is a hint that it may take a year or more, otherwise do not trust any airdrop you hear about other than the official channel.Usually we learn that the airdrop will be accurately distributed only after the announcement of the last snapshot is published. And if you haven't interacted with this network before this snapshot date, then you definitely can't claim airdrop. So in any case, it is better to do at least minimal interaction with the network than then watch your empty wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "July 24, 2023, 04:55:27 PM",
      "body": "Quote from: yhiaali3 on July 22, 2023, 04:25:25 PMQuote from: @sriyan on July 16, 2023, 05:30:17 AMYou can check the source here: https://twitter.com/sandeepnailwal/status/1656262074950094850?s=20    I hope he will give the airdrop as promised. Otherwise, it will affect the entire polygon ecosystem.There is no promise of a clear date for the airdrop, there is a hint that it may take a year or more, otherwise do not trust any airdrop you hear about other than the official channel.Reliable projects like that are smart enough of not \"confirming\" an airdrop like what Arbitrum, Aptos, Arkham Intelligence, Blur and Optimism did respectively. This is why it's called retroactive drop.I like surprises when it comes to airdrops and snapshot dates rather than announcing in advance. They're likely gonna give insane rewards to us, especially those who are being backed by solid VCs and partners like the Binance Labs. I don't mind if will take a year or more. This is more of delayed gratification. So do not expect too much of an airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 26, 2023, 08:44:46 PM",
      "body": "Quote from: tvplus006 on July 14, 2023, 07:23:40 PM...But while there are few projects in the ZkEVM network, I will list some here:- https://app.0vix.com/- https://app.antfarm.finance/- https://quickswap.exchange/- https://polygon.name/- https://pancakeswap.finance/swap?chain=polygonZkEVMFor those who still expect an airdrop from Polygon ZkEVM, they can perform another activity on the network: https://quest.intract.io/quest/64b7a6b0b549e0360fa6456d For performing simple actions on twitter and Discord, we will get the right to mint NFT in this blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "July 27, 2023, 04:14:30 PM",
      "body": "Quote from: jacafbiz on July 16, 2023, 07:25:33 PMThe news of rebranding the token ticker from Matic to POL seems to have been well received by the market, but I just feel this is the same play book once again, the team has burnt a lot of money recently from the acquisition of new tech, hiring, marketing and branding, but the chain seems to be long distance for the major competitor, far from Ethereum, Binance chain, Arbritum etc. I do not expect much from Matic, but this will surely pump the price when the time comesI think it's not about the name but it's about the features that they add. Still for some, maybe POL seems a better fit for the ticker because it was spelled after the name Polygon. It's now easy to remember for them but for me I think the old ticker sounds cool. I love it when the ticker is spelled differently from the coin name.Well, what can I do now? I guess ill just accept it and like I said earlier it was the features that still matters the most and not the name. We cant compare Polygon to ETH or other bigger chains/coins. Remember it was only just a solution or an alternative, so we shouldn't expect too much from it and I think it already did its part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "July 27, 2023, 11:52:20 PM",
      "body": "It's insane if polygon will be airdropping valued tokens to the hunters and my guess if that will never happen. So many people were expecting airdrop from this blockchain but it's too good to be true. Airdrop from polygon? this will never happen. It's only impossible thing to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "July 27, 2023, 11:57:01 PMLast edit: July 28, 2023, 12:35:48 PM by AmoreJaz",
      "body": "Quote from: aubert on July 27, 2023, 11:52:20 PMIt's insane if polygon will be airdropping valued tokens to the hunters and my guess if that will never happen. So many people were expecting airdrop from this blockchain but it's too good to be true. Airdrop from polygon? this will never happen. It's only impossible thing to happen.  and also, make sure it is the polygon legit team behind it. because scammers can easily claim that they are from MATIC team but they are not. so before you got attracted with this airdrop thingy, check their legitimacy, the conditions and all. because if you will shell out money, doubt its motive.airdrop these days is quite different way back. most of the time, you will just waste your time collecting this because what you will get won't be significant enough to trade in the market once it is listed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}