{
  "id": "topic_5454146",
  "title": "collinscoinz",
  "author": "collinscoinz",
  "created_time": "May 26, 2023, 10:00:43 PM",
  "content": "Of cause marriage is fundamentaly ordain by Almight God from the foundation of the world, but this era now,sorry to say marriage has now turned to garmbleing,any side can just wake up and demande for the portion of the asset.partiners should know what they are in to,and meet the criterials as an adult.learn the character of your partiner and understand him or her,even when you are right in a matter you can just be sorry not that doing you are not who you should be,but as a man or woman of peac,remember let love lead,also partiners should put away suspecting attitude.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454146",
  "comments": [
    {
      "author": "blockman",
      "created_time": "May 26, 2023, 10:14:01 PM",
      "body": "Quote from: collinscoinz on May 26, 2023, 10:00:43 PMOf cause marriage is fundamentaly ordain by Almight God from the foundation of the world, but this era now,sorry to say marriage has now turned to garmbleing,any side can just wake up and demande for the portion of the asset.partiners should know what they are in to,and meet the criterials as an adult.learn the character of your partiner and understand him or her,even when you are right in a matter you can just be sorry not that doing you are not who you should be,There are fixed marriages and people who have been there could fall out of love too easily. There's this culture in some countries that they need to fix marriages in order to combine and retain their wealth and businesses. Honestly, the first thing that comes first in guarding a relationship or marriage is communication. That's all, you just have to have a great way of communicating each other and knowing what your flaws are. Quote from: collinscoinz on May 26, 2023, 10:00:43 PMbut as a man or woman of peac,remember let love lead,also partiners should put away suspecting attitude.Love should always be there but sometimes it may not be felt and it becomes cold. And that's why you need to spark it up every time any of the two feels like that. It's a responsibility that you have to commit forever but then, there goes the divorces that seemed to become normal in many countries when marriage didn't work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 27, 2023, 02:58:58 PM",
      "body": "Quote from: collinscoinz on May 26, 2023, 10:00:43 PMOf cause marriage is fundamentaly ordain by Almight God from the foundation of the world, but this era now,sorry to say marriage has now turned to garmbleing,any side can just wake up and demande for the portion of the asset.partiners should know what they are in to,and meet the criterials as an adult.learn the character of your partiner and understand him or her,even when you are right in a matter you can just be sorry not that doing you are not who you should be,but as a man or woman of peac,remember let love lead,also partiners should put away suspecting attitude.We should stop being too religious and make the practical practice on how a relationship and marriage is meant to be, most of the challenges todayin a relationship is due to our lack of tolerance, selfish interest, ego, and being adamant in nature such that no one can talk to us and we hear or listen, no one dare trespass on us and goes free, many people have taken being religious for granted leaving the normal way of life the religion they practice says or expect them to live, to have a good relationship in marriage, we must be submissive as well to each other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Qiubell5",
      "created_time": "May 30, 2023, 01:55:54 AM",
      "body": "Marriage must be taken seriously. Many couples get divorced because they don't tolerate each other and don't trust each other. Even though the purpose of marriage is to have a family covered with peace of love and affection. So basically, in a marriage, don't just be selfish, and you have to trust each other to build a harmonious family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "May 30, 2023, 11:53:35 AM",
      "body": "Quote from: Qiubell5 on May 30, 2023, 01:55:54 AMMarriage must be taken seriously. Many couples get divorced because they don't tolerate each other and don't trust each other. Even though the purpose of marriage is to have a family covered with peace of love and affection. So basically, in a marriage, don't just be selfish, and you have to trust each other to build a harmonious family.Take it from the older ones and our grandmom's and grandpa's on how they've made each other last their lovelife and marriage. It's all about giving and taking and as well as great communication. We've got no crystal ball when our partners have some problems, one won't tell it directly as if he or she takes the entire world on his shoulder. But that's not the marriage that's ideal, one problem can be solved with the help of each other and that's why keep on talking to each other and know that you've got each others back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "May 30, 2023, 04:58:26 PM",
      "body": "Quote from: sunsilk on May 30, 2023, 11:53:35 AMTake it from the older ones and our grandmom's and grandpa's on how they've made each other last their love life and marriage. It's all about giving and taking and as well as great communication. A marriage that will last is a marriage between two people that want their union and are committed to making it work. Some of the marriages these days do not have two people that want it to work. Either one person is more committed to it or the two are not committed enough and the marriage ends up breaking up. I want my marriage to work so I have to understand the role I have to play to my partner which is to be submissive and be a wife, not trying to play his role. This is for me, because I understand the importance of marriage and companionship. Marriage is not for everyone, but I want to be married and live happily with my partner till death do us part.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "May 30, 2023, 06:54:11 PM",
      "body": "Quote from: Doan9269 on May 27, 2023, 02:58:58 PMQuote from: collinscoinz on May 26, 2023, 10:00:43 PMOf cause marriage is fundamentaly ordain by Almight God from the foundation of the world, but this era now,sorry to say marriage has now turned to garmbleing,any side can just wake up and demande for the portion of the asset.partiners should know what they are in to,and meet the criterials as an adult.learn the character of your partiner and understand him or her,even when you are right in a matter you can just be sorry not that doing you are not who you should be,but as a man or woman of peac,remember let love lead,also partiners should put away suspecting attitude.We should stop being too religious and make the practical practice on how a relationship and marriage is meant to be, most of the challenges todayin a relationship is due to our lack of tolerance, selfish interest, ego, and being adamant in nature such that no one can talk to us and we hear or listen, no one dare trespass on us and goes free, many people have taken being religious for granted leaving the normal way of life the religion they practice says or expect them to live, to have a good relationship in marriage, we must be submissive as well to each other. To be very honest, I agree with you on this one. So many marriages fail today, especially in my country because of being too religious. You will see people that did not even undergo courtship, they don't even know each other too well. Just because they worship in the same church and during sermon, the pastor will just stand up and say to them \"God said you are the husband of this person\" and immediately they will marry. Such marriages with experience do not last because it was just made based on religious speculation and no reality towards it. That is one of the reasons marriages fail today in my country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "May 30, 2023, 08:29:52 PMLast edit: May 30, 2023, 08:58:43 PM by Die_empty",
      "body": "Quote from: collinscoinz on May 26, 2023, 10:00:43 PMOf cause marriage is fundamentaly ordain by Almight God from the foundation of the world, but this era now,sorry to say marriage has now turned to garmbleing,any side can just wake up and demande for the portion of the asset.partiners should know what they are in to,and meet the criterials as an adult.learn the character of your partiner and understand him or her,even when you are right in a matter you can just be sorry not that doing you are not who you should be,but as a man or woman of peac,remember let love lead,also partiners should put away suspecting attitude.There is a high rate of divorce not only among celebrities but in the entire society. Now people can divorce at will because of infidelity, infertility, intolerance, financial issues, pride, external influence, etc. From personal observation in my area, I have identified a few reasons for the high rate of divorce which include:Social media influence: So many youths learn from celebrities and most of these celebrities always divorce. Most youths see these celebrities as their role model which make to follow in their footsteps. So many couples will always want to experiment with what they learned in social media in their marriage. Growth of Female right groups:  In my area we have seen an increase in female right groups that educates women about their rights. Before women were usually treated like second-class citizens but this right group has exposed women to information and enlightenment that have made them know that they also have the same rights as their husbands. These feminist has opened the eyes of women to seek legal action if they are not treated equally.Intolerance: Spouses are not willing to endure the lapses of their partners. The highest reason for legal divorce in my area is irreconcilable differences. This is because no spouse wants to say I am sorry. Even when they are wrong they find it difficult to say I am sorry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "May 30, 2023, 09:33:42 PM",
      "body": "The bedrock of every successful marriage is rooted in understanding because a union of two people that truly understand themselves will not experience much crispy and even if they do it will be settled and understood amicably,  but in recent to.,  we find people who bearly know themselves getting into this contract of marriage and this has been the result in a high rate of divorce cases because there is no way a relationship between two stranger will work when they're never taken the time to understand themselves. A lot of people make the mistake of marring with the hope to u understand their partner while in the marriage, but that doesn't work most times, since the union of marriage was supposed to be established on understanding right from the very beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "June 01, 2023, 10:25:53 AM",
      "body": "True love that leads to marriage shouldn’t need lots of hard work to be a success. If you love each other & live a healthy marriage that is full of trust then there is a recipe for an ever lasting marriage. I read recently that more marriages than ever end in divorce now but this doesn’t need to be the case if you are truly in love & dedicated to fulfilling a great marriage. Treat you wife well, have a family & enjoy life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "June 01, 2023, 04:19:10 PM",
      "body": "Quote from: Qiubell5 on May 30, 2023, 01:55:54 AMMarriage must be taken seriously. Many couples get divorced because they don't tolerate each other and don't trust each other. Even though the purpose of marriage is to have a family covered with peace of love and affection. So basically, in a marriage, don't just be selfish, and you have to trust each other to build a harmonious family.What we need in marriage or relationship is love and this must be a genuine one and not the fake or the type others use to deceive their partners, we must also take our relationship with all seriousness, have each other in mind, create time to have feeling and better opportunities to make discovery of selves, we must be honest and never cheated in the relationship, lastly we must be very tolerant to each other, divorce is not the solution to the marriage or relationship challenges, it's rather leads to being more frustrated deepens anger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "June 01, 2023, 07:29:14 PM",
      "body": "Sacrifice and tolerance is the key to marriage. When either the man or the woman has sacrificed or endure a lot and thinks it is high time s/he give it up,that is when divorce will come in play. Communication is very important because this is the only way to talk things out in order not to offend  each other unknowingly. So many divorce here and there because of lack of trying to change from our old ways to please the other. Selfishness on our own personal interest without the considering if your actions will hurt your partner can lead to divorce. Marriage is to assist one another and not otherwise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "June 01, 2023, 10:37:52 PM",
      "body": "I believe there are things that made two parties join together, and what could that be if I may asked?To me is \"Love & Compatibility\" which is compatible, this simply means you are perfectly okay what all kinds of characters from your lover be it the man or the woman. This implies that you are able to tolerate all forms of hate words and actions words from your partner. Secondly I don't think people knows the reason they are getting married because if they do I don't know if they will ever have any missed understand. I am a woman and also married with a daughter, I perfectly understand my husband very well, the thing is women should try adjust to their husband and not husband adjusting to their wives because the life you want to live as a woman may not be pleasant to your husband. Divorce isn't that common to our country maybe more in the westerner region.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "June 02, 2023, 07:49:28 PM",
      "body": "Quote from: collinscoinz on May 26, 2023, 10:00:43 PMOf cause marriage is fundamentaly ordain by Almight God from the foundation of the world, but this era now,sorry to say marriage has now turned to garmbleing,any side can just wake up and demande for the portion of the asset.partiners should know what they are in to,and meet the criterials as an adult.learn the character of your partiner and understand him or her,even when you are right in a matter you can just be sorry not that doing you are not who you should be,but as a man or woman of peac,remember let love lead,also partiners should put away suspecting attitude.The reason many relationships and marriages don't last in this time is because people don't actually go for true love and characters but they go for money and the physical body, with time they realised that money and attractive body is not a enough to keep the relationship. So many people are not happy in the relationship they are but they are just in the relationship because of money enduring and feeing pained. What keeps marriage is real love from both partners .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "June 05, 2023, 08:28:04 PM",
      "body": "It is during dating one needs to know the character of the person he or she wants to say I do too. Whether they are compatible or not before becoming husband and wife. But in today's world, many people are only after physical beauty and wealth. Once you are beautiful as a lady and wealthy as a guy, you consider yourself married too without asking yourself questions of what makes me want to settle down with the person you want to get married to apart from their beauty and wealth. What in case, if the beauty and wealth are no longer there, what will be of the marriage? It's very unfortunate that marriages are no longer the way it is years back. Many people now go into marriage with the mindset of what will they gain from the marriage in years to come without trying to build a happy home where love, affection, and harmony would continue to reign till their old age.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "June 05, 2023, 09:05:47 PM",
      "body": "Quote from: collinscoinz on May 26, 2023, 10:00:43 PMOf cause marriage is fundamentaly ordain by Almight God from the foundation of the world, but this era now,sorry to say marriage has now turned to garmbleing,any side can just wake up and demande for the portion of the asset.partiners should know what they are in to,and meet the criterials as an adult.learn the character of your partiner and understand him or her,even when you are right in a matter you can just be sorry not that doing you are not who you should be,but as a man or woman of peac,remember let love lead,also partiners should put away suspecting attitude. from my own understanding marriage is basically based on culture that is why it is advisable for someone to marry from the particular environment that he or her know the culture of other particular place so what causes family to be seen as gambling is because of the lack of understanding between the two couples and in between the ethnic group then come from so I believe if you marry from their own ethnic group that is nothing we met at the marriage to break them because both of you understand yourself through tradition and the behaviours",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "June 08, 2023, 12:45:35 PM",
      "body": "The way I see it this days people don't marry because of love, I tell people most times, that they should fall in love first before thinking about marriage, try to know who your partner is, know their flaws, what triggers them to anger, what they like and they don't like..Be in a relationship first before thinking of marriage, stay with this person for sometime first,(maybe months or even years).But our society today one woman or man can just be triggered by maybe a friend or his/her parents to get married to a man/woman because of wealth with an aim of getting divorced so assets can be shared between them, it's just so wrong, and that's why you see so many people today making it possible to be married in court because of the motive of getting divorced in future to acquire property,I just think people should just hustle and make their own money, fall in love before getting into marriage,no one should be wanting to get married because of assets (wealth) with a motive of getting divorced just to acquire wealth.if you don't love someone don't get married to them....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "June 11, 2023, 10:21:56 AMLast edit: June 11, 2023, 10:57:33 AM by Onyeeze",
      "body": "There are several ways in which we can save guard our relationship which are namely:CommunicationLoveTrustIn a relationship we have to accommodate all these mentioned in other to safe guard and make our marriage/ tealtionship work.1. Communication is what every Union or relationship needs because human beings differs in behaviour and in everything so we must have conversation to know what is in each other's mind and also something we might even be passing some kind of things but when we communicate with our partners it may ease off the burden or even profer solution as the case may be.2. Love must be in a relationship I think this is even the major thing that bring partners together. no matter how both party offend each other when love is their they will always forgive to keep going, if their is no love there shouldn't be relationship/marriage, is advisable not to be in either marriage or relationship where there is no love because happiness will not be present in such home.3. Trust is the overall becuase some people don't trust their partners even when those partners are sincere, this have caused dissolution of marriages where most partners are been accused of infidelity at the end they side to go separate ways since they are not compatible, note any day you start distrusting your partner it becomes a problem for you as the person that feel that you are been played upon so the best way to avoid all this is to marry your friend, the person you trust and love in other to keep a healthy marriage and relationship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anguwa",
      "created_time": "June 11, 2023, 06:26:05 PM",
      "body": "Most times we made mistake of not knowing the exact character we are supposed to know before marriage. We always look after the physical and body structure couple with financial stability and kept aside home training and good backgrounds, that is why we are mostly having problems in our marriages this days.If we look at our parents, they are leaving peacefully beautiful because they didn't consider all these phisical characters while looking for spouse instead they focus on manners and home training.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "June 11, 2023, 07:11:51 PM",
      "body": "Quote from: collinscoinz on May 26, 2023, 10:00:43 PMOf cause marriage is fundamentaly ordain by Almight God from the foundation of the world, but this era now,sorry to say marriage has now turned to garmbleing,any side can just wake up and demande for the portion of the asset.partiners should know what they are in to,and meet the criterials as an adult.learn the character of your partiner and understand him or her,even when you are right in a matter you can just be sorry not that doing you are not who you should be,but as a man or woman of peac,remember let love lead,also partiners should put away suspecting attitude.Marriage is a very important thing in life,for me the most important.It is there to enable the world and human race to continue to exist as the first matter and then to give us serenity and spiritual peace (beside the physical benefits  ).However when choosing a partner we should not go all in and rush to marry them if we are not 100% sure that we know them well enough,any person to do so will regret his/her choice and it will end up with a divorce which brings many bad consequences,like psychological ones to the persons divorcing,really heavy psychological ones to their children if they have any and a lot of other bad things.We of course after choosing the right partner should be tolerant with each other in many aspects of life,being gentle has solved much more problems than being harsh so this is key behavior for me for a successful,stress free and happy marriage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}