{
  "id": "topic_5465935",
  "title": "blue Snow",
  "author": "blue Snow",
  "created_time": "September 07, 2023, 04:21:55 AM",
  "content": "Indonesia, especially Jakarta is in a pollution emergency, Many say that this is caused by steam power plants where the fuel is coal. And, sadly I heard also on my social media local that this pollution is also caused by crypto-mining, I debated and rejected it opinion because crypto-mining in Indonesia is not much like other countries where their air is still clean today. So what do you though, is crypto mining become a big problem of pollution?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465935",
  "comments": [
    {
      "author": "mk4",
      "created_time": "September 07, 2023, 04:39:48 AM",
      "body": "If we're talking about pollution, there are LOTS of things to worry about than bitcoin/cryptocurrency mining. Yes, bitcoin/cryptocurrency mining does use energy, but so does your computer, your car, your home heater or air conditioner, the list goes on and on.Even Christmas lights are provenly using more energy than crypto mining if I remember correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "September 07, 2023, 04:49:33 AM",
      "body": "Quote from: blue Snow on September 07, 2023, 04:21:55 AMIndonesia, especially Jakarta is in a pollution emergency, Many say that this is caused by steam power plants where the fuel is coal. And, sadly I heard also on my social media local that this pollution is also caused by crypto-mining, I debated and rejected it opinion because crypto-mining in Indonesia is not much like other countries where their air is still clean today. So what do you though, is crypto mining become a big problem of pollution?Crypto mining? I'm not aware that Indonesia is in the business of mining, I might be wrong though. But I doubt that it's one cause of pollution in the city. Maybe it has become so over crowded and then there are so many cars in that country as well?In any case, I doubt that crypto mining will contribute to the pollution or even harm the environment. There are a lot of studies already out there debunking this theory by anti-bitcoin groups.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "September 07, 2023, 05:26:21 AM",
      "body": "\"Air pollution in Jakarta has hit such dire levels recently that the Indonesian capital has been named the most polluted city on Earth. Both the city and national governments blame vehicle emissions for the problem, yet deny that the more than a dozen coal-fired power plants ringing the city are a factor.\"Source : https://news.mongabay.com/2023/08/jakarta-snags-most-polluted-title-as-air-quality-plunges-and-officials-dither/It is estimated that about half of Jakarta's air pollution is caused by vehicular emissions, and coal combustion contributed only about 14% of the air pollution. So, No.... let's not blame everything that goes wrong on \"Bitcoin\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "September 07, 2023, 05:38:08 AM",
      "body": "There's no Indonesia in this list, it means Bitcoin mining in Indonesia is small and the effect is less to nothing.https://www.techopedia.com/bitcoin-mining-and-energy-statisticsEven your local social media say the air pollution caused by Bitcoin mining, you need to made a research and don't blindly trust what they say. It's nothing surprise the media is pro to the government since Bitcoin is decentralized and they can't control it completely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 07, 2023, 05:43:04 AM",
      "body": "Quote from: Kakmakr on September 07, 2023, 05:26:21 AM\"Air pollution in Jakarta has hit such dire levels recently that the Indonesian capital has been named the most polluted city on Earth. Both the city and national governments blame vehicle emissions for the problem, yet deny that the more than a dozen coal-fired power plants ringing the city are a factor.\"Source : https://news.mongabay.com/2023/08/jakarta-snags-most-polluted-title-as-air-quality-plunges-and-officials-dither/It is estimated that about half of Jakarta's air pollution is caused by vehicular emissions, and coal combustion contributed only about 14% of the air pollution. So, No.... let's not blame everything that goes wrong on \"Bitcoin\"   I think that the authorities take advantage of this to blame what is in their interest. It could be the private vehicle or bitcoin mining, but in this case it seems that vehicles are the main cause of the problem, so let them not tell us lies about bitcoin mining. It would have to be seen how much mining contributes to pollution as a percentage. I bet it is less than coal combustion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fruktik",
      "created_time": "September 07, 2023, 06:21:51 AM",
      "body": "They came up with another reason to blame mining for everything. And what? Such a thing is, in principle, quite expected. Well, the authorities do not like to see the fact that there is an alternative payment system that is supported in their country in the form of mining coins.They don't come up with that either. There have been so many similar examples, but they still can’t really prove anything to this day. In power, probably, itching at the fifth point))",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "September 07, 2023, 08:39:54 AM",
      "body": "Quote from: blue Snow on September 07, 2023, 04:21:55 AMAnd, sadly I heard also on my social media local that this pollution is also caused by crypto-mining, I debated and rejected it opinion because crypto-mining in Indonesia is not much like other countries where their air is still clean today. This is hear say with no proof or reasoning to support it and you should not help spread such ideas that projects mining as an environmental crisis wen it is not even top ten on the list of reasons why there is pollution in every country.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solokan",
      "created_time": "September 07, 2023, 09:21:45 AM",
      "body": "Indeed, there is a lot of news about air pollution in Jakarta. In my opinion, the main cause of Jakarta's air pollution is vehicles, because there are lots of vehicles passing through Jakarta, so in my opinion the main cause is vehicles. because in my opinion, of course, more people use vehicles compared to people who mine bitcoins.I hope the air in Jakarta will be clean again soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "September 07, 2023, 09:25:27 AM",
      "body": "Quote from: Solokan on September 07, 2023, 09:21:45 AMIndeed, there is a lot of news broadcasting about air pollution in Jakarta. In my opinion, the main cause of Jakarta's air pollution is vehicles, because there are so many vehicles in Jakarta passing by so I think the main cause is vehicles. because in my opinion there are people who mine bitcoin and people who use vehicles, so in my opinion there are more people who use vehicles than people who mine bitcoin.I hope the air in Jakarta will be clean again soon.It's gotta be more than just vehicles though that are causing all of those emissions. Anything that is powered by diesel (common fuel source for non-auto things) is also going to make a lot of pollution as well, and that's going to have to be mitigated. We can see that there are other cities where the vehicle use is similar to Jakarta, but they don't have a pollution emergency right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "September 07, 2023, 09:40:09 AM",
      "body": "Bitcoin consumption of electricity does not exceed the consumption of 3% of global electricity, and if we say that the generation of electricity is the first cause of emissions, the effect of bitcoin is 3%, and bitcoin mining does not produce only waste of damaged and used devices and is completely different from industries such as cooling, cars, oil Percolated derivatives that release greenhouse gases. Articles that indicate the bitcoin link to environmental conditions depend on inaccurate sources, and there are often other reasons for such allegations more than facts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "September 07, 2023, 09:43:31 AM",
      "body": "Quote from: blue Snow on September 07, 2023, 04:21:55 AMIndonesia, especially Jakarta is in a pollution emergency, Many say that this is caused by steam power plants where the fuel is coal. And, sadly I heard also on my social media local that this pollution is also caused by crypto-mining, I debated and rejected it opinion because crypto-mining in Indonesia is not much like other countries where their air is still clean today. So what do you though, is crypto mining become a big problem of pollution?When this is all about pollution then i don't know what exactly they are referring to as the main pollutants in this case, crypto mining is environmentally friendly, bitcoin that uses PoW is not harmful to the environment or releasing toxics unlike the other centralized forms of natural resources mining that causes a lot of environment pollution, I don't want to believe they are aiming at bitcoin mining as the major cause to this, there are other human activities that constitute the current disaster we face in the environment, maybe their assumption may be that crypto includes in the disasters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 07, 2023, 09:45:11 AM",
      "body": "This 2022 research is becoming old but it was a research about the carbon dioxide that bitcoin mining is contributing to the environment:The bitcoin mining network, energy and carbon impactThis was the conclusion:QuoteConclusionIn the grand scheme of things, the carbon emissions emitted by electricity providers supplying the Bitcoin mining network are inconsequential. At 0.08 % of global CO2 emissions, removing the entire mining network from global demand—and thereby depriving hundreds of millions of people of their only hope for a fair and accessible form of money—would not amount to anything more than a rounding error.I do not know much about other cryptocurrencies, but the energy they are consuming will not much be that significant like bitcoin, but bitcoin contribution 0.08% of global carbon dioxide emission while those of other other cryptocurrencies will not not be much.Most of the air pollution in Jakarta is caused by vehicle emissions and coal combustion:Quote from: https://time.com/6305644/indonesia-air-pollution-jakarta-smog-jokowi-coughWhile about half of Jakarta’s air pollution is caused by vehicular emissions, coal combustion contributed to 14% of pollution during the wet season from October 2018 to March 2019, according to a joint study by public health nonprofit Vital Strategies and the Bandung Institute of Technology. And while the transportation sector is the largest contributor of pollutants including carbon monoxide and PM2.5, the manufacturing sector produces the highest sulfur dioxide emissions.Quote from: mk4 on September 07, 2023, 04:39:48 AMIf we're talking about pollution, there are LOTS of things to worry about than bitcoin/cryptocurrency mining. Yes, bitcoin/cryptocurrency mining does use energy, but so does your computer, your car, your home heater or air conditioner, the list goes on and on.Even Christmas lights are provenly using more energy than crypto mining if I remember correctly.This is absolutely correct. But we have not even mentioned the mining industries, manufacturing industries, deforestation, bush burning, emission of other pollutants that can result to global warming and many more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "September 07, 2023, 10:31:25 AM",
      "body": "Quote from: blue Snow on September 07, 2023, 04:21:55 AMIndonesia, especially Jakarta is in a pollution emergency, Many say that this is caused by steam power plants where the fuel is coal. And, sadly I heard also on my social media local that this pollution is also caused by crypto-mining, I debated and rejected it opinion because crypto-mining in Indonesia is not much like other countries where their air is still clean today. So what do you though, is crypto mining become a big problem of pollution?It is not truly real reasons. There are many contributors to air pollution like smoke from vehicles, farming activities when they burn grass seasonally and other things. If saying the air in Jakarta is polluted only or mainly by cryptocurrency mining, it is a damn lie.In addition, cryptocurrency mining is not a biggest industry in Jakarta and it does not exhaust enough to cause air pollution.Empirical evidence shows that air quality changes during COVID-19 pandemic lockdown in Jakarta, Indonesia are due to seasonal variation, not restricted movements",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "September 07, 2023, 10:40:32 AM",
      "body": "Quote from: blue Snow on September 07, 2023, 04:21:55 AMIndonesia, especially Jakarta is in a pollution emergency, Many say that this is caused by steam power plants where the fuel is coal. And, sadly I heard also on my social media local that this pollution is also caused by crypto-mining, I debated and rejected it opinion because crypto-mining in Indonesia is not much like other countries where their air is still clean today. So what do you though, is crypto mining become a big problem of pollution?Pollution is one health hazard that is affecting the WORLD. However you didn't specify the kind of pollution you guys are experiencing If it's, carbon emissions, noise pollution or gas direct emission.However I still don't believe whatever pollution you guys are experiencing is caused by crypto mining, because the capacity of the crypto mine in Jakarta is not that huge to prompt that kind of pollution you are describing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "September 07, 2023, 10:41:05 AM",
      "body": "Quote from: Solokan on September 07, 2023, 09:21:45 AMIndeed, there is a lot of news about air pollution in Jakarta. In my opinion, the main cause of Jakarta's air pollution is vehicles, because there are lots of vehicles passing through Jakarta, so in my opinion the main cause is vehicles. because in my opinion, of course, more people use vehicles compared to people who mine bitcoins.I hope the air in Jakarta will be clean again soon.Well I think everyone knows about this too, because Jakarta is a very densely populated city, there are many activities there such as many factories that dispose of waste carelessly, the amount of development there that is not uncommon to find in the big city and especially the traffic. You could say that Jakarta is the busiest city in terms of traffic. Oh yes, especially now that there is a long dry season, it causes the growth of plants or large trees at several points to be clearly disturbed, and there is no more air filtering tool except greening.So therefore in my opinion it is not strange if Jakarta experiences pollution like this because previously it was also frequent, the point is that many factors are the cause.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "September 07, 2023, 10:56:47 AM",
      "body": "What a great timing from pollution activist who are blaming the crypto mining as the factor to cause pollution in Indonesia. So what they were using a decade ago? Solar energy and wind power to power up their cities? That’s funny allegation because pollution doesn’t happen overnight. I highly doubt there are enough mining industries in Jakarta that can actually cause concerning pollution in the area. So many things just does not add up in the given statement. They better triple check how did that happen. May be someone turned on the oven and left the door open.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "September 07, 2023, 11:12:17 AM",
      "body": "Bitcoin mining is not bad for the environment. Unlike traditional mining bitcoin mining does not involve extracting resources from the earth. It relies on solving complex mathematical puzzles using computer power Many bitcoin miners are shifting towards renewable energy sources like solar and wind power reducing their carbon footprint. Bitcoin mining incentivises the development of clean energy infrastructure as miners seek cheaper and more sustainable energy solutions. It’s a common misconception but bitcoin mining is not bad for the environment, it’s mostly FUD by fiat heads & paid actors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "September 07, 2023, 11:15:27 AM",
      "body": "Quote from: blue Snow on September 07, 2023, 04:21:55 AMIndonesia, especially Jakarta is in a pollution emergency, Many say that this is caused by steam power plants where the fuel is coal. And, sadly I heard also on my social media local that this pollution is also caused by crypto-mining, I debated and rejected it opinion because crypto-mining in Indonesia is not much like other countries where their air is still clean today. So what do you though, is crypto mining become a big problem of pollution?Anyone who gives the opinion that the cause of Jakarta's air pollution is bitcoin mining deserves to be met in a public debate room (surely they just talk without data).  afaik, Jakarta is not a city that has many miners, only a small number of crypto creators become miners there, based on the news i read through international news, the cause of Jakarta's pollution is because of motorized vehicles and factories that produce high carbon dioxide gas.  i'm sure it's the greenpeace loyalists who keep causing the FUD about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "September 07, 2023, 11:35:28 AM",
      "body": "Quote from: blue Snow on September 07, 2023, 04:21:55 AMIndonesia, especially Jakarta is in a pollution emergency, Many say that this is caused by steam power plants where the fuel is coal. And, sadly I heard also on my social media local that this pollution is also caused by crypto-mining, I debated and rejected it opinion because crypto-mining in Indonesia is not much like other countries where their air is still clean today. So what do you though, is crypto mining become a big problem of pollution?Well, I think you already answered your own question, since 2016 I joined crypto, this is probably the first time I am reading about cryptocurrency(Bitcoin specifically) mining and Jakarta, Indonesia together, both on this forum and outside the forum.I personally think Indonesia is not such a big market when it comes to crypto mining, they do not have as much candidates in this field to warrant them going through a pollution crises ., So I personally think that the cause of this might be what you suggested at first which is steam power plant where the coals are tuned to fuel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}