{
  "id": "topic_5462693",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "August 09, 2023, 07:35:32 PM",
  "content": "Watch the video. Pandemic on trial.Video: \"There is no corona pandemic but only a PCR Test plandemic\". Dr. Reiner Fuellmichhttps://www.globalresearch.ca/video-dr-reiner-fuellmich-opening-statements-grand-jury-court-public-opinion/5827784The plandemic was \"fueled by an elaborate psychological operation designed to create a constant state of panic among the world's population.\"\"This agenda has been long planned, it's ultimately unsuccessful, precursor was the swine flu some 12 years ago, and is cooked up by a group of super-rich psychopathic and sociopathic people who hate and fear people at the same time, have no empathy, and are driven by the desire to gain full control over all of us, the people of the world.\"Watch the video below for the full statement. Note to readers: Please click the share button above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles....",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462693",
  "comments": [
    {
      "author": "BADecker",
      "created_time": "August 11, 2023, 07:13:30 PM",
      "body": "Why didn't they do this a long time ago? And what about hydroxychloroquine (HCQ), the safest of all drugs that work to cure covid? And what about fenbendazlole (dog anti-parasitic) for cancer?FDA Drops Ivermectin Bombshellhttps://www.zerohedge.com/covid-19/fda-drops-ivermectin-bombshellDoctors are free to prescribe ivermectin to treat COVID-19, a lawyer representing the U.S. Food and Drug Administration (FDA) said this week.\"FDA explicitly recognizes that doctors do have the authority to prescribe ivermectin to treat COVID,\" Ashley Cheung Honold, a Department of Justice lawyer representing the FDA, said during oral arguments on Aug. 8 in the U.S. Court of Appeals for the 5th Circuit.The government is defending the FDA's repeated exhortations to people to not take ivermectin for COVID-19, including a post that said \"Stop it.\"The case was brought by three doctors who allege the FDA unlawfully interfered with their practice of medicine with the statements.A federal judge dismissed the case in 2022, prompting an appeal.\"The fundamental issue in this case is straightforward. After the FDA approves the human drug for sale, does it then have the authority to interfere with how that drug is used within the doctor-patient relationship? The answer is no,\" Jared Kelson, representing the doctors, told the appeals court....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "montaga",
      "created_time": "August 11, 2023, 07:20:11 PM",
      "body": "It was a plandemic and US Congressman @RonJohnsonWI knows ithttps://twitter.com/i/status/1690024961535004672PCR test is full blown fraud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 11, 2023, 08:01:10 PM",
      "body": "Quote from: montaga on August 11, 2023, 07:20:11 PMIt was a plandemic and US Congressman @RonJohnsonWI knows ithttps://twitter.com/i/status/1690024961535004672PCR test is full blown fraud.Loads of people know this. Loads of experts know this. The only way you can attack the perpetrators is:1. In the US, a man to man claim in the courts;2. In Canada, the UK, Australia, India, and a few other places of common law, is through \"King's Bench\" court - which is essentially man to man;3. In all civil law countries, you must do a class action of the kind that the country in question allows. If you want to go man to man in these countries, you literally have to show the whole history of the law to show how a man is above the government. Difficult to do.The governments/courts are almost too entrenched to do it any other way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}