{
  "id": "topic_5407668",
  "title": "spaceecon",
  "author": "spaceecon",
  "created_time": "July 26, 2022, 11:58:14 AM",
  "content": "I've been looking for a way to find new crypto games to play. But, I would also like to see estimates of the earnings and how fun the game is. To find new games, I usually use DappRadar or playtoearn.online , but these don't say anything about earnings. I have found this cored.io site, but this doesn't have too many games on it. Do you guys have any tips? Any help would be greatly appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407668",
  "comments": [
    {
      "author": "batang_bitcoin",
      "created_time": "July 26, 2022, 09:32:32 PM",
      "body": "Play to earn games these days are not that much profitable anymore. That's why if you want to be profitable, you need to consolidate your source of income through many methods like in staking to different platforms that has different APYs like mycointainer, trading, holding, p2e and many more. It is that profit in p2e games are not that high as before. I've seen the glory days and start of it, when it has started, many don't dived into that quick because it's not yet promising but when everybody sees that many profited, they've jumped on it quickly without thinking that it could sink someday and it really did.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "July 26, 2022, 09:53:55 PM",
      "body": "The reason, there has some a few aspect that earning is different for each person. Example you can take a look from AXIE:- Your MMR Account- Recent Activity Game (Win/Lose)- Atribute : Item or NFTsNot everyone has the same ROI%, I don't think you're gonna get an answer from use since most of game have different earning and not always a same.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 26, 2022, 10:57:31 PM",
      "body": "You will have to visit their community and ask the actual players to get a more accurate answer. Maybe they will still give you some ballpark figure but that's better than nothing.Quote from: spaceecon on July 26, 2022, 11:58:14 AM....I have found this cored.io site, but this doesn't have too many games on it. It's probably because there's simply less legitimate games now. Many already stopped. Their reward pool system were flawed from the start and got drained pretty quickly so they had no other option but to shutdown.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "July 26, 2022, 11:07:04 PM",
      "body": "Quote from: Yogee on July 26, 2022, 10:57:31 PMYou will have to visit their community and ask the actual players to get a more accurate answer. Maybe they will still give you some ballpark figure but that's better than nothing.Quote from: spaceecon on July 26, 2022, 11:58:14 AM....I have found this cored.io site, but this doesn't have too many games on it. It's probably because there's simply less legitimate games now. Many already stopped. Their reward pool system were flawed from the start and got drained pretty quickly so they had no other option but to shutdown.Yes, I do agree, go to the specific community groups or chats of the games, and ask from their players.They may not give you exact figures but they may possibly give you some estimates.Because it depends on the player himself, his skills, and how much he can spend to the items inside the game.So you really can't expect them to give a clear amount of earnings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TastyChillySauce00",
      "created_time": "July 27, 2022, 02:33:57 AM",
      "body": "Quote from: spaceecon on July 26, 2022, 11:58:14 AMI've been looking for a way to find new crypto games to play. But, I would also like to see estimates of the earnings and how fun the game is. Do you guys have any tips? Any help would be greatly appreciated. I can only suggest you sometimes. 1. Try to join on its community directly to know how much can be earned from playing the game2. There are some games but the earning was not so much as last year. The game like vulcan forged, axie infinity and stepn may still able to give you some money. 3. Try to use calculator that probably very useful to calculate your earning. There are some play to earn for free without need to buy the NFT. You need to only rent the NFT from others with share earning mechanism.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "July 27, 2022, 06:38:01 AM",
      "body": "Quote from: spaceecon on July 26, 2022, 11:58:14 AMI've been looking for a way to find new crypto games to play. But, I would also like to see estimates of the earnings and how fun the game is. Do you guys have any tips? Any help would be greatly appreciated. Theres a lot of sources like the one you mentioned. But personally Id rather check per game each on their website and do a classical review like checking feedback on some socials and review of those who already played the game. In my opinion that would be suited beforr trying out to shelled out money for that game or put some investment on it. Always check all details especially the legality of the team.Its also worth checking their partnership and confirm its authencity, might looking on a fake ads on their website and using big names to catch investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "July 27, 2022, 09:11:23 AM",
      "body": "Quote from: spaceecon on July 26, 2022, 11:58:14 AMI've been looking for a way to find new crypto games to play. But, I would also like to see estimates of the earnings and how fun the game is. To find new games, I usually use DappRadar or playtoearn.online , but these don't say anything about earnings. I have found this cored.io site, but this doesn't have too many games on it. Do you guys have any tips? Any help would be greatly appreciated. I wonder why almost all of them skip the godsunchained. I mean it's quite big compared to some of these obscure ones and the team also developed Immutable X. I mean i don't even like godsunchained, but it made me a ton of money and it's quite good compared to most of these.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "July 28, 2022, 08:58:06 PM",
      "body": "Quote from: spaceecon on July 26, 2022, 11:58:14 AMI've been looking for a way to find new crypto games to play. But, I would also like to see estimates of the earnings and how fun the game is. To find new games, I usually use DappRadar or playtoearn.online , but these don't say anything about earnings. I have found this cored.io site, but this doesn't have too many games on it. Do you guys have any tips? Any help would be greatly appreciated. I do not think it is surprising that you cannot find information about the earnings that you can get out of those games and there are primarily two reasons for this, to begin with how much money you earn will depend on your skill as a player and how much time you are willing to put to it, as it is obvious that someone which is unskilled and only dedicates a few minutes to it will never be able to earn big in any game.But the more important reason is that play to earn games are nowhere near as popular as they were and that popularity is still going down, so it is a mistake to think that somehow the amount of money you can get out of those games will be constant, and as such estimates about how much you can earn are impossible to give.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "July 28, 2022, 10:58:19 PM",
      "body": "It's hard to have such data, because crypto games are unstable from the potential earnings point of view. There are different factors which directly influence your income as player: players' traffic or hype, anti-cheats features, support and updates efficiency and frequency...Potential earnings change all the time. I played MIR4 and when it was launched you could easily earn more than 20$ a day (free to play), but on the next day you could barely make a dollar daily, putting much more effort on the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "July 28, 2022, 11:45:00 PM",
      "body": "It's very hard to find your earning accurately if you have not played the game. if you have played the game and it can be seen easily caused by once you played the game and start to grinding money from there and the system will be able to tell you how much you will earn by playing the game. There was also estimation that will always be appearing once you cleared the game or doing something related to the play to earn or move to earn. It's better if you are trying the game directly. The earning will always changed instantly depending on the numerous factor. it can't be generalized if the earning will always be stable anytime. Just like what axie infinity did. The earning has been dropping a lot due to the inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fvb",
      "created_time": "July 29, 2022, 12:14:40 AM",
      "body": "Hi all. I didn’t play this kind of toys before, but recently I got carried away and now I’m also looking for the best option. Now I'm playing Karmaverse and I'll tell you that it's quite difficult to win battles with other participants without playable NFT characters. So for anyone, you will have to invest and upgrade your account for further victories. The conclusion is the same as always, before you start earning, you must first invest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S A KHAIR",
      "created_time": "July 29, 2022, 12:21:02 AM",
      "body": "The trend of play to money is over, do you think it can still be profitable? I'm not sure about that, even with axie infinity has removed part of their game because of a loss and no revenue. I think playing games to make money is very difficult, besides working hard, there will be no form of both playing and making a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "July 29, 2022, 12:44:07 AM",
      "body": "It's rather different across different games,  heck even in the same game (but rather minimal sometimes) imo since there are PVP factors involved that make up the core of the earning part imo, which is why earnings aren't usually said. There's also the issue of the price of the tokens involved and it actually drops down real quick nowadays, maybe after the initial hype of the game if it doesn't drop already at the start of the release of the game, so it's rather hard to give an accurate estimate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "antsam",
      "created_time": "July 29, 2022, 01:18:31 AM",
      "body": "There are a lot of Play to Earn platforms currently popping up but I see the interest has started to wane. Try playing on a platform that is already big and has a name, it will definitely be more profitable for you, don't risk your time and money on a new platform that is still unclear",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "July 29, 2022, 02:56:59 AM",
      "body": "The game play to earn is now no longer as good as it was when Axie first appeared. Well we know at this time p2e games are popping up with big prize offers. Now the p2e era seems to be no longer feasible or more to be abandoned. Considering today's games, of course, you have to put in big capital to buy some combat equipment that has been in the game marketplace itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "July 29, 2022, 04:15:36 AM",
      "body": "Quote from: fvb on July 29, 2022, 12:14:40 AMHi all. I didn’t play this kind of toys before, but recently I got carried away and now I’m also looking for the best option. Now I'm playing Karmaverse and I'll tell you that it's quite difficult to win battles with other participants without playable NFT characters. So for anyone, you will have to invest and upgrade your account for further victories. The conclusion is the same as always, before you start earning, you must first invest.That's for sure, p2e is actually a form of investment. If you want to make a profit, you have to invest, there will be nothing free in the market. The fact that there are no games that just play and are profitable is that we should not waste our time looking for them.We are in a bear market and investing in a trend that has already declined is very risky so we should not participate in them anymore, let's wait for a bull market, then we can determine if p2e is really a place to make money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "July 29, 2022, 04:23:54 AM",
      "body": "@spaceecon, site owners usually have to manually include those revenue estimates (because there's no API related to the latest data for a particular game). Maybe you will find revenue estimates for mainstream games like Axie Infinity, but not for games that are still not widely known by the public. Because of that, the only way to find out is by doing research in the related game community, you can ask one of the users there.Sorry if this argument may not help you at all, but, this is the only way I can suggest. You can even get more information than just an estimation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "August 04, 2022, 10:18:16 PM",
      "body": "Quote from: S A KHAIR on July 29, 2022, 12:21:02 AMThe trend of play to money is over, do you think it can still be profitable? I'm not sure about that, even with axie infinity has removed part of their game because of a loss and no revenue. I think playing games to make money is very difficult, besides working hard, there will be no form of both playing and making a profit.It is not only difficult but the whole model is flawed from the very beginning, if you see the streamers that make money while they play their favorite video games you will see that they play some of the most popular video games of the moment, which have millions of players which just play for the entertainment they get out of those games.But when it comes to play to earn games the environment is completely different, there is almost no one which plays just for the sake of it and everyone is just trying to earn money, so with that in mind how can you earn money when there is not a huge user base supporting the top players? The truth is that you cannot do it, which is why the play to earn model has basically collapsed already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 04, 2022, 10:33:21 PM",
      "body": "Quote from: naira on July 29, 2022, 02:56:59 AMThe game play to earn is now no longer as good as it was when Axie first appeared. Well we know at this time p2e games are popping up with big prize offers. Now the p2e era seems to be no longer feasible or more to be abandoned. Considering today's games, of course, you have to put in big capital to buy some combat equipment that has been in the game marketplace itself.The early investor earned a lot from it but this time, those that have invested late, they're stuck in the middle of it waiting for something that they don't know if will come. Well, that includes me but I know what I'm doing and it is that its token is what I'm holding and waiting for it to pump again.No reason to sell right now as the market of it is too low and just holding it, whether I'll be in profit or not, I'll just hold it then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}