{
  "id": "topic_5441287",
  "title": "Oshosondy",
  "author": "Oshosondy",
  "created_time": "February 26, 2023, 10:10:03 AM",
  "content": "One of the mistakes traders do make which I have made in the past is to be looking for a better profit. A good example is when having $1000, looking for a way to make $100 or more daily. That would be when leveraging it will come to mind, but leveraging is one of the reasons some traders find it that they are continuing losing.As an experienced day trader, or a scalper, if you have $1000, what profit will you be looking for? Also what amount is your stop loss? What leverage would you prefer to use? Recently I find it more profitable to earn just $5 daily either through scalping or scalp trading that is turned into day trading. I am not using altcoins for this but bitcoin. If you are a day trader and you are using bitcoin to trade, if you have $1000, how much profit are you expecting daily? You may not use $1000, you can use percentage and I will understand what you meant too.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441287",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "February 26, 2023, 10:13:58 AM",
      "body": "Quote from: Oshosondy on February 26, 2023, 10:10:03 AMAs an experienced day trader, or a scalper, if you have $1000, what profit will you be looking for? Also what amount is your stop loss?You must have your risk / reward ratio like 1/3. It means you should open your trading position if you see a chance to get 30% profit with that position and only 10% loss with it.10% should be your cut-loss, not bigger.QuoteWhat leverage would you prefer to use? What if I say it is 0x leverage. It means you should not trade with leverage but with Spot trading only.QuoteRecently I find it more profitable to earn just $5 daily either through scalping or scalp trading that is turned into day trading. I am not using altcoins for this but bitcoin. $5 daily from $1000, please don't joke.If you only look for $5, your risk / reward ratio is bigger than 1/3 and I believe maybe risk is higher than reward. You should not trade if chance to lose is bigger than chance to gain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "February 26, 2023, 10:27:29 AM",
      "body": "Quote from: tbct_mt2 on February 26, 2023, 10:13:58 AMYou must have your risk / reward ratio like 1/3. It means you should open your trading position if you see a chance to get 30% profit with that position and only 10% loss with it.10% should be your cut-loss, not bigger.This can be possible for altcoin traders because altcoins are more volatile, unlike bitcoin which is less volatile. Or for people that wants to go for swing trading. Another reason you can go for this option is if you want to leverage, but the more the risk and closer the liquidation price.Since many days ago, bitcoin increased to $25000, have not decreased to $22000 yet. Let use use this two price range for the calculation. $25000 / $22000  *  $1000 = $1136That is just 13.6% for swing traders. Quote from: tbct_mt2 on February 26, 2023, 10:13:58 AMWhat if I say it is 0x leverage. It means you should not trade with leverage but with Spot trading only.There is no 0 leverage, leverage starts from one which assume the spot trading type of an asset. If you do not want to use leverage, you will set the leverage to at least 1. Quote from: tbct_mt2 on February 26, 2023, 10:13:58 AM$5 daily from $1000, please don't joke.If you only look for $5, your risk / reward ratio is bigger than 1/3 and I believe maybe risk is higher than reward. You should not trade if chance to lose is bigger than chance to gain.I have done most of the calculation above to know how 13.6% is what swing traders that trade short term and go short position since when bitcoin falled from $25000 will still be expecting to gain because bitcoin has not falled up to $22000 since that time till now. Although I understand you that $5 which is 0.5% is too small, but 30% is also too very big for scalpers and day traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "February 26, 2023, 11:08:26 AM",
      "body": "Quote from: Oshosondy on February 26, 2023, 10:10:03 AMRecently I find it more profitable to earn just $5 daily either through scalping or scalp trading that is turned into day trading. I am not using altcoins for this but bitcoin.Earning $5 on a $1,000 investment is way too conservative for any trader. That's making 0.5% on a daily. On my part, I like to swing. If I were to trade a $1,000 portfolio I would place myself on a 10% weekly profit for a start and that will be not to cause me any anxiety. 10% weekly will amount to $100. That's around $14 daily. Targeting it daily will mean to pile up pressure to meet up target. Keeping it on a weekly basis will allow one the opportunity to aggregate all winnings. Trust me, there are going to be days when you will make more than the $14 and days when you won't make up to it. Doing the daily thing means traders are more prone to forcing themselves into trades even when they should clearly stay on the sidelines. 5X leverage should be okay enough to get that target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "February 26, 2023, 12:27:59 PM",
      "body": "Leveraged trading can tempt someone to delay when closing his trade, especially when market conditions are rising. This makes them want bigger profits than they already have, which also makes many traders lose because suddenly, the market changes direction, and your trade gets red, which makes you lose.It's better to get enough profit every day than to force yourself to find more profit, especially if market conditions are still like they are now. It will benefit you more than staying in that trade. The profit will be different for each day because it depends on the coin we use for trading. But if it was a daily profit of $5, I would not reject it and would close my trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "February 26, 2023, 01:15:32 PM",
      "body": "It is better that we look at consistent profit no matter how little than to aim at huge profit that will not be consistent. If we are trading for huge profit then that is also how huge the losses will be when we lose and if you are having bad trades, you run out of capital faster. However, the more appropriate percentage of profit to aim for no matter the size of capital is suppose to be around 1-3 % per trade but a trader can also decide to increase that depending on his or her profit ability. Trading with low leverage and stop loss is advised also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "February 26, 2023, 06:51:28 PM",
      "body": "Quote from: Mpamaegbu on February 26, 2023, 11:08:26 AMQuote from: Oshosondy on February 26, 2023, 10:10:03 AMRecently I find it more profitable to earn just $5 daily either through scalping or scalp trading that is turned into day trading. I am not using altcoins for this but bitcoin.Earning $5 on a $1,000 investment is way too conservative for any trader. That's making 0.5% on a daily. On my part, I like to swing. If I were to trade a $1,000 portfolio I would place myself on a 10% weekly profit for a start and that will be not to cause me any anxiety. 10% weekly will amount to $100. That's around $14 daily. Targeting it daily will mean to pile up pressure to meet up target. Keeping it on a weekly basis will allow one the opportunity to aggregate all winnings. Trust me, there are going to be days when you will make more than the $14 and days when you won't make up to it. Doing the daily thing means traders are more prone to forcing themselves into trades even when they should clearly stay on the sidelines. 5X leverage should be okay enough to get that target.I think the opposite, 0.5% of daily profits is huge, if we apply compound interest after a single year you will obtain a 446% increase in your account, so if you start trading with 1k at the end of the first year you will have 5467 dollars, after two years you will have 29896 dollars and so on, if any trader can in fact reach that kind of average profit each and every day they will make a lot of money in a very short amount of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "February 27, 2023, 06:08:11 AM",
      "body": "Quote from: Oshosondy on February 26, 2023, 10:27:29 AMQuote from: tbct_mt2 on February 26, 2023, 10:13:58 AMWhat if I say it is 0x leverage. It means you should not trade with leverage but with Spot trading only.There is no 0 leverage, leverage starts from one which assume the spot trading type of an asset. If you do not want to use leverage, you will set the leverage to at least 1. By 0 leverage, I meant don't use leverage.Do you think your collateral is safe with x1 leverage. The coin you use as a collateral can lose its value anytime and if that coin drop 50% in price, your x1 leverage will no longer be x1 leverage.I experienced lost with leverages and I would say, if you don't earn a lot from this market, you should not trade with leverage. Risk to lose money with leverage is big enough and if anyone think using leverage can help them getting rich, forget that idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "February 27, 2023, 07:05:18 AM",
      "body": "I would have been more conservative in my calculations if it's medium or long-term trading, but for day trading, especially scalping, it's always good to loosen up so that the profit would measure up with the energy and time given to it. Day trading styles are many but scalping is the riskiest and most demanding, one should carefully observe the one they are engaging in so that careful training, management and plans would be used.Me, with $1,000 capital, x3 risk is enough for me when scalping, and I should be averaging $90 daily. But for other styles better than scalping where I must hold my positions longer, my risk would be x3.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xampeuu",
      "created_time": "February 27, 2023, 08:02:03 AM",
      "body": "Quote from: Oshosondy on February 26, 2023, 10:10:03 AMOne of the mistakes traders do make which I have made in the past is to be looking for a better profit. A good example is when having $1000, looking for a way to make $100 or more daily. That would be when leveraging it will come to mind, but leveraging is one of the reasons some traders find it that they are continuing losing.As an experienced day trader, or a scalper, if you have $1000, what profit will you be looking for? Also what amount is your stop loss? What leverage would you prefer to use? Recently I find it more profitable to earn just $5 daily either through scalping or scalp trading that is turned into day trading. I am not using altcoins for this but bitcoin. If you are a day trader and you are using bitcoin to trade, if you have $1000, how much profit are you expecting daily? You may not use $1000, you can use percentage and I will understand what you meant too. in leveraged trading the use of money management is highly recommended, so we must trade in a healthy manner. in other words, setting a clear stop loss, for example a maximum of 5%, and it depends on our trading strategy. on the other hand, use a realistic target, as you stated 0.5% per day, and I think that way your trading will be more relaxed, so this will affect our stress level, where our healthy minds will be more awake",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "February 27, 2023, 08:12:19 AM",
      "body": "10% profit is a bit high target for day trader regardless of the capital because you will be obsessed on profit hunt that always result to loss most of the time. For me, Somewhere between 1% to 5% is a decent profit for a scalp trading and same percentage for my stop loss. I’m not looking for the amount target because this will ruin my strategy.Let’s say I want 100$ profit per day then I will need more capital than 1000$ to hit that target in daily basis rather than do a risky trade like increasing leverage just to get that target profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "February 27, 2023, 10:17:52 AM",
      "body": "Quote from: dimonstration on February 27, 2023, 08:12:19 AM10% profit is a bit high target for day trader regardless of the capital because you will be obsessed on profit hunt that always result to loss most of the time. For me, Somewhere between 1% to 5% is a decent profit for a scalp trading and same percentage for my stop loss. I’m not looking for the amount target because this will ruin my strategy.1-5% profit is fine for scalpers but for day traders who hodl on to a certain position for longer hours sometimes the whole day 10% isn't high. Except when the trend has gone far from the a good and reliable entry point. But if a trader was to start a trend early enough 10% profit is very much moderate. QuoteLet’s say I want 100$ profit per day then I will need more capital than 1000$ to hit that target in daily basis rather than do a risky trade like increasing leverage just to get that target profit.I don't think a trader with $1000 capital will need to trade using Leverage to make $100 a day. Everyday must not be good to the trader, the reason i try to trade the obvious. If my analysis is clear i still to the profit plan if it has some iota of doubt i take anything the market offers and close for the day. Leverage trading is a trap in disguise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "February 27, 2023, 11:26:54 AM",
      "body": "Quote from: Mpamaegbu on February 26, 2023, 11:08:26 AM5X leverage should be okay enough to get that target.If using 5x, you will be good to know how to use stop loss. Stop loss is not my thing because of the low leveage I use, during high  volatility I have just little losses if trading bitcoin. Sometimes it is good to know that the more we are looking for profit, the more the loss if the price direction is opposite to the position opened and also the more can be the emotion.Quote from: tbct_mt2 on February 27, 2023, 06:08:11 AMBy 0 leverage, I meant don't use leverage.I understood you, but just I only corrected you, there is nothing like 0 leverage. At least you will use 1x leverage in future trading. Or did you mean future trading should no be gone for, is spot trading is what you are suggesting?Quote from: tbct_mt2 on February 27, 2023, 06:08:11 AMI don't think a trader with $1000 capital will need to trade using Leverage to make $100 a day. Everyday must not be good to the trader, the reason i try to trade the obvious. If my analysis is clear i still to the profit plan if it has some iota of doubt i take anything the market offers and close for the day. Leverage trading is a trap in disguise.I think so too, all I can do for leverage sometimes is to just go 3x if the market did not favour, and if gone 3x it must not be more than because that kind of averaging is also very risky and can latter lead to liquidation if you continue to increase it. I prefer to just start with 1x and if profit result, then close the trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "February 27, 2023, 11:44:28 AM",
      "body": "Earning $5 daily is not really compensable if you are trading the whole day while risking $1000 but never I think also this is the only we got for every day, we can make good trades the following day, maybe. But if we just spend 3-5 hours and got $5 as a minimum profit daily, I think that was good enough at least we did something than losing $5. We can't expect huge profits using Bitcoin for trading unless we use altcoin but yes, consider the high risk which could possibly lose your money in a day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "February 27, 2023, 01:40:08 PM",
      "body": "Quote from: Oshosondy on February 26, 2023, 10:10:03 AMOne of the mistakes traders do make which I have made in the past is to be looking for a better profit. A good example is when having $1000, looking for a way to make $100 or more daily. That would be when leveraging it will come to mind, but leveraging is one of the reasons some traders find it that they are continuing losing.--Snip--Snipped the rest of the post because it's already a mistake to have a presumption that opportunities to make $100 or more daily to take will always be there for plebs like many of us. If it's possible that they are always there to take, traders who are more well-capitalized than us, who are more skilled than us, and they have a thousand systematically, well-programmed trading-bots to use against us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryker1",
      "created_time": "February 27, 2023, 02:44:58 PM",
      "body": "Quote from: palle11 on February 26, 2023, 01:15:32 PMIt is better that we look at consistent profit no matter how little than to aim at huge profit that will not be consistent. If we are trading for huge profit then that is also how huge the losses will be when we lose and if you are having bad trades, you run out of capital faster. I agree with this in my own opinion --it is not appropriate to set a specific profit target as a day trader, as the market can be unpredictable and there is no guarantee that any particular trade will be profitable. Instead, day traders typically focus on managing risk and maintaining discipline in their trading strategies to minimize losses and maximize gains over time. Because if you are going to ask me, it is recommended that traders use only a small portion of their total portfolio for day trading and maintain a long-term investment strategy for the majority of their assets. Traders should always conduct thorough research and analysis before making any trading decisions and be prepared to adjust their strategies based on market conditions and don't focus on one strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "February 27, 2023, 04:31:02 PM",
      "body": "To be honest day traders work are really difficult. Making profit from the worse condition market makes them the warrior. But as a normal trader, I would suggest, rather than running after profits, make sure that you don’t make losses at first. Moreover during this post bear market, the market is really unpredictable. So anything and everything is happening to be honest. As a day trader, I won’t go above 5% of total bankroll to make profit, if you go for more profits, then the risk involved will also increase and hence there will will be more chances that you make more losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "February 27, 2023, 05:58:02 PM",
      "body": "Definitely not something that I would do, just way too risky. If I have 1000 dollars, I would buy bitcoin with 700 dollars of it and ETH with 300 of it and just let it be. On top of that, if I could just end up buying more later on when I get more money that would also be great as well, it will help me out a lot.However, if I end up with nothing at all, and that's my only money, trading doesn't make sense. When would you trade? If you could trade with 100 dollars and put 900 dollars into investment, that would work, or have 9000 dollars for investment and 1000 dollars for trading then it would work. Put some into investment before you start trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "February 27, 2023, 10:22:18 PM",
      "body": "Quote from: el kaka22 on February 27, 2023, 05:58:02 PMDefinitely not something that I would do, just way too risky. If I have 1000 dollars, I would buy bitcoin with 700 dollars of it and ETH with 300 of it and just let it be. On top of that, if I could just end up buying more later on when I get more money that would also be great as well, it will help me out a lot.I was just having the same thought. I am not that much of a good day trader myself and when I do trade, I use very low amount. It will be around $100-300 on average. And my target is small too. When it comes to a huge number such as $1000, I wouldn't risk it by putting all at once and also not choose high leverage. I will try to avoid future trading. Just stick to the good old spot trading. And not to mention, I will never choose any Alts. My choice of poison is Bitcoin, no doubt. So yeah, this is how it should be for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "February 27, 2023, 10:59:16 PM",
      "body": "Quote from: Oshosondy on April 26, 1975, 10:37:00 AM If you are a day trader and you are using bitcoin to trade, if you have $1000, how much profit are you expecting daily? You may not use $1000, you can use percentage and I will understand what you meant too. I've not been consistent in trading, though I wish I was, and as from now on, I will try to work on this..As a trader, if I have $1000 as my trading fund and decides to take advantage of bitcoin's price volatility to try to make some profit for myself, I personally believe that being able to make atleast, $5 profit each day consistently isn't a bad record, that is $35 in a week and $140 every month.Yeah, I know this amount looks small but it's manageable is one can consistently make it every day, no matter how bad the market is or how much loss suffered initially.And also worthy of note is that being overly greedy is also a reason why many traders end up loosing money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}