{
  "id": "topic_5457651",
  "title": "jeremypwr",
  "author": "jeremypwr",
  "created_time": "June 26, 2023, 01:50:39 PM",
  "content": "UFC on ESPN 48Multi Master Challenge   Prizes1st place: 3 mbtc Free Bet2nd place: 2 mbtc Free Bet3rd place: 1 mbtc Free BetThe Rules are similar to the original Sportsbet.io Multi Master that we all enjoyed so muchRulesa)  Predict the winner of each match (earn 1-2 points)b)  Predict how many matches will NOT go the Full Distance (will be adjusted accordingly if matches get cancelled)Odds @ https://sportsbet.io/sports/mma/ufc/ufc-fight-night-strickland-vs-magomedov/matchesMatches(2 points each)12. Sean Strickland vs. Abus Magomedov11. Grant Dawson vs. Damir Ismagulov10. Max Griffin vs. Michael Morales9. Melissa Gatto vs. Ariane Lipski8. Ismael Bonfim vs. Benoit Saint-Denis7. Brunno Ferreira vs. Nursulton Ruziboev(1 point each)6. Kevin Lee vs. Rinat Fakhretdinov5. Joanderson Brito vs. Westin Wilson4. Karol Rosa vs. Yana Santos3. Elves Brener vs. Guram Kutateladze2. Luana Carolina vs. Ivana Petrovic1. Blagoy Ivanov vs. Alexandr RomanovNOT go the Full Distance   Make sure your Prediction is in this format    Example12. Sean Strickland 11. Grant Dawson 10. Max Griffin 9. Melissa Gatto 8. Ismael Bonfim 7. Brunno Ferreira 6. Kevin Lee 5. Joanderson Brito 4. Karol Rosa 3. Elves Brener 2. Luana Carolina 1. Blagoy Ivanov NOT go the Full Distance 4",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457651",
  "comments": [
    {
      "author": "jeremypwr",
      "created_time": "June 26, 2023, 01:51:39 PMLast edit: June 26, 2023, 02:10:59 PM by jeremypwr",
      "body": "(Small print)* Must be active in Sports betting and/or Sports betting discussion (some exceptions) *** The declared winners are final and up to my discretion **Sportsbet.io has been kind enough to sponsor my Prediction Contests and Promos for a while now.Sportsbet.io is a sports betting website; therefore these Prediction Contests and Promos are catered to those who actually bet on/discuss sports.If you are unsure if you qualify, just shoot me a PM.  Thank you for your cooperation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tokeweed",
      "created_time": "June 26, 2023, 01:59:19 PM",
      "body": "12. Sean Strickland11. Damir Ismagulov10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Kevin Lee5. Joanderson Brito4. Yana Santos3. Guram Kutateladze2. Luana Carolina1. Alexandr RomanovNOT go the Full Distance:  5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "June 26, 2023, 02:04:59 PM",
      "body": "12. Sean Strickland 11. Damir Ismagulov10. Michael Morales9. Melissa Gatto 8. Ismael Bonfim  7. Brunno Ferreira   6. Rinat Fakhretdinov5. Joanderson Brito 4. Karol Rosa 3. Guram Kutateladze 2. Ivana Petrovic1. Blagoy Ivanov NOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CLS63",
      "created_time": "June 26, 2023, 02:07:45 PM",
      "body": "12. Sean Strickland11. Damir Ismagulov10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Rinat Fakhretdinov5. Joanderson Brito4. Yana Santos3. Guram Kutateladze2. Luana Carolina1. Alexandr RomanovNOT go the Full Distance:  5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leea-1334",
      "created_time": "June 26, 2023, 02:08:14 PM",
      "body": "12. Sean Strickland11. Grant Dawson10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Kevin Lee5. Joanderson Brito4. Karol Rosa3. Guram Kutateladze2. Ivana Petrovic1. Blagoy IvanovNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeremypwr",
      "created_time": "June 26, 2023, 02:30:05 PM",
      "body": "12. Sean Strickland11. Grant Dawson10. Michael Morales9. Melissa Gatto8. Ismael Bonfim 7. Brunno Ferreira   6. Rinat Fakhretdinov5. Joanderson Brito4. Karol Rosa3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "June 26, 2023, 03:22:05 PM",
      "body": "12. Sean Strickland11. Damir Ismagulov10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Kevin Lee5. Joanderson Brito4. Karol Rosa3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mv1986",
      "created_time": "June 26, 2023, 03:52:26 PM",
      "body": "12. Sean Strickland11. Grant Dawson10. Michael Morales9. Melissa Gatto 8. Ismael Bonfim 7. Brunno Ferreira 6. Rinat Fakhretdinov5. Joanderson Brito 4. Karol Rosa3. Guram Kutateladze2. Ivana Petrovic1. Blagoy IvanovNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Harkorede",
      "created_time": "June 26, 2023, 04:11:53 PM",
      "body": "12. Sean Strickland11. Damir Ismagulov10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Rinat Fakhretdinov5. Westin Wilson4. Yana Santos3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance: 7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betwrong",
      "created_time": "June 26, 2023, 04:24:59 PM",
      "body": "12. Sean Strickland11. Damir Ismagulov10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Rinat Fakhretdinov5. Joanderson Brito4. Yana Santos3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance: 8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "June 26, 2023, 08:33:30 PM",
      "body": "12. Sean Strickland11. Damir Ismagulov10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Rinat Fakhretdinov5. Westin Wilson4. Yana Santos3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance: 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "June 26, 2023, 08:50:39 PM",
      "body": "12. Abus Magomedov11. Damir Ismagulov10. Michael Morales9. Ariane Lipski8. Ismael Bonfim7. Nursulton Ruziboev6. Rinat Fakhretdinov5. Joanderson Brito4. Yana Santos3. EGuram Kutateladze2. Ivana Petrovic1. Blagoy IvanovNOT go the Full Distance 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notblox1",
      "created_time": "June 26, 2023, 09:46:17 PM",
      "body": "12. Sean Strickland11. Grant Dawson10. Michael Morales9. Melissa Gatto8. Benoit Saint-Denis7. Brunno Ferreira6. Rinat Fakhretdinov5. Westin Wilson4. Karol Rosa3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance 8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "June 26, 2023, 11:24:41 PM",
      "body": "12. Sean Strickland11. Damir Ismagulov10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Kevin Lee5. Joanderson Brito4. Karol Rosa3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance:  6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "morvillz7z",
      "created_time": "June 27, 2023, 12:17:12 AM",
      "body": "12. Sean Strickland11. Grant Dawson10. Michael Morales9. Melissa Gatto8. Benoit Saint-Denis7. Brunno Ferreira6. Rinat Fakhretdinov5. Joanderson Brito4. Yana Santos3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance 4",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Barcode_",
      "created_time": "June 27, 2023, 01:52:59 AM",
      "body": "12. Sean Strickland11. Grant Dawson10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Rinat Fakhretdinov5. Joanderson Brito4. Karol Rosa3. Guram Kutateladze2. Ivana Petrovic1. Blagoy IvanovNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "June 27, 2023, 03:32:22 AM",
      "body": "12. Sean Strickland11. Grant Dawson10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Rinat Fakhretdinov5. Joanderson Brito4. Karol Rosa3. Guram Kutateladze2. Ivana Petrovic1. Blagoy IvanovNOT go the Full Distance 7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "June 27, 2023, 10:15:35 AM",
      "body": "12. Sean Strickland11. Grant Dawson10. Michael Morales9. Melissa Gatto8. Ismael Bonfim 7. Brunno Ferreira6. Kevin Lee 5. Joanderson Brito 4. Karol Rosa3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance 5",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "June 27, 2023, 10:23:51 AM",
      "body": "12. Sean Strickland11. Damir Ismagulov10. Michael Morales9. Melissa Gatto8. Ismael Bonfim7. Brunno Ferreira6. Rinat Fakhretdinov5. Joanderson Brito4. Yana Santos3. Guram Kutateladze2. Ivana Petrovic1. Alexandr RomanovNOT go the Full Distance: 6",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}