{
  "id": "topic_5475536",
  "title": "Samsungs10",
  "author": "Samsungs10",
  "created_time": "November 26, 2023, 05:22:42 AMLast edit: November 28, 2023, 07:42:17 AM by Samsungs10",
  "content": "What happened: Until now, the Bounty Manager  TheCrypto360 has not kept the promise in accordance with what has been stated in the requirements made when Bounty  HASHFAIR GAMES has been done, even via telegram. It has added an extension of time of up to one month and then payment on November 19, 2023, but there is also no good etiquette in making payments. Even just to provide information via telegram was not implemented, but was active on BTT/Spreadsheet on November 23, 2023.Bounty Manager Profile Link: https://bitcointalk.org/index.php?action=profile;u=3422562Bounty Link: https://bitcointalk.org/index.php?topic=5457431.0https://hashfair.iohttps://hashfair.gamesPlan Payment Amount: The bounty campaign has been carried out in three periods:Round 1 : 25th June to 22th July - 50 = 15,000 USDTRound 2 : 23th July to 19th August - 30 = 9000 USDTRound 3 : 20th August to 16th September - 20 = 6000 USDTPayment Method: The payment plan will be made using HFG coins according to the amount specified in the requirements above.Telegram Bounty / Group: https://t.me/+SG3KP3536E43OWQxhttps://t.me/Hash_Fair_GamesPM/Chat Logs: https://t.me/c/1892671873/4025        https://t.me/c/1892671873/3946https://t.me/Hash_Fair_Games/7449    https://t.me/Hash_Fair_Games/7451 https://t.me/Hash_Fair_Games/7566    https://t.me/Hash_Fair_Games/8077Additional Notes: because there is no follow-up conversation on Telegram with the Bounty Manager, it is difficult to determine who does not want to pay. but when we asked carefully with the Dev and Team on telegram our account was closed and we couldn't communicate again.Until now, I myself cannot conclude who actually doesn't want to pay, because there is no communication that can confirm where the problem lies.Conclusion: I want good etiquette from the bounty manager to be able to provide information well and clearly so that bounty participants don't get confused. because the project is quite successful and it is not necessary to let go of the responsibilities that must be carried out. https://i.imgur.com/Oy7R76q.png",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475536",
  "comments": [
    {
      "author": "Adbitco",
      "created_time": "November 26, 2023, 07:17:25 AM",
      "body": "First you must have to pm your manager to know what is happening and why he is holding the payment then also try to reach out to the project owners to know what was their problem for not releasing payment. Most times it's advisable to always join a campaign that has escrowed their funds with someone that is reputable even though those token worths nothing but it should be in someone custody as to released them whenever the campaign is over according to how the discussion was made with the project owners. Sometimes hunters do not always read the rules correctly on the bounty thread and I know this is where most problems are coming from, learning to be patient is another keys as bounty campaign isn't that easy they consumed time and pays you peanut at the last end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samsungs10",
      "created_time": "November 26, 2023, 07:47:30 AM",
      "body": "Quote from: Adbitco on November 26, 2023, 07:17:25 AMFirst you must have to pm your manager to know what is happening and why he is holding the payment then also try to reach out to the project owners to know what was their problem for not releasing payment. Most times it's advisable to always join a campaign that has escrowed their funds with someone that is reputable even though those token worths nothing but it should be in someone custody as to released them whenever the campaign is over according to how the discussion was made with the project owners. Sometimes hunters do not always read the rules correctly on the bounty thread and I know this is where most problems are coming from, learning to be patient is another keys as bounty campaign isn't that easy they consumed time and pays you peanut at the last end.Actually, I really want to be able to connect and find out from the Bounty Manager, but there is a problem with how I can contact the Bounty Manager, because until now BM has never been active again after November 10 2023.Same with the project owner and team, several colleagues and I have questioned it, but instead it was thrown at the Bounty Manager and even many of our Telegram accounts were banned.I agree with what you say and admit that maybe I didn't read the rules in their entirety but only the main points. If it's a matter of patience, maybe my colleagues and I have been patient enough with the rules that BM made previously. After completing the bounty, 4 weeks later it will be paid [October 16, 2023], but it has been changed again to November 19, 2023. Until now, there has been no clarity.My colleagues and I just want the Bounty Manager to join Telegram again and explain in real terms what actually happened, because previously the Bounty Manager was able to pay well for the Bounties that were carried out.Thank you for your advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 26, 2023, 08:17:35 AM",
      "body": "Quote from: Samsungs10 on November 26, 2023, 07:47:30 AMQuote from: Adbitco on November 26, 2023, 07:17:25 AMSnipActually, I really want to be able to connect and find out from the Bounty Manager, but there is a problem with how I can contact the Bounty Manager, because until now BM has never been active again after November 10 2023.Same with the project owner and team, several colleagues and I have questioned it, but instead it was thrown at the Bounty Manager and even many of our Telegram accounts were banned.I agree with what you say and admit that maybe I didn't read the rules in their entirety but only the main points. If it's a matter of patience, maybe my colleagues and I have been patient enough with the rules that BM made previously. After completing the bounty, 4 weeks later it will be paid [October 16, 2023], but it has been changed again to November 19, 2023. Until now, there has been no clarity.My colleagues and I just want the Bounty Manager to join Telegram again and explain in real terms what actually happened, because previously the Bounty Manager was able to pay well for the Bounties that were carried out.Thank you for your advice.Well I don't know much about your bounty manager and I believe he is a new campaign manager maybe he decides to leave after receiving huge pay out from tokens because this is what most of the hunters do pass through manager received unexpected amount and close their telegram group and made away with the funds, this is were trust lays, most people do not join some bounty's due to either the manager is not known and can never be trusted with huge amount while some reputable manager do pay out to their hunters.My suggestion is that since your manager has not been active for long time now you have to endure more to see if he would come online and again, if your telegram ban or you are restricted from Post in the bounty group and project group seek for another telegram account then you can used it to track all the activities of the project including that of the bounty manager.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samsungs10",
      "created_time": "November 26, 2023, 08:46:51 AM",
      "body": "Quote from: Adbitco on November 26, 2023, 08:17:35 AMQuote from: Samsungs10 on November 26, 2023, 07:47:30 AMQuote from: Adbitco on November 26, 2023, 07:17:25 AMSnipsnipWell I don't know much about your bounty manager and I believe he is a new campaign manager maybe he decides to leave after receiving huge pay out from tokens because this is what most of the hunters do pass through manager received unexpected amount and close their telegram group and made away with the funds, this is were trust lays, most people do not join some bounty's due to either the manager is not known and can never be trusted with huge amount while some reputable manager do pay out to their hunters.My suggestion is that since your manager has not been active for long time now you have to endure more to see if he would come online and again, if your telegram ban or you are restricted from Post in the bounty group and project group seek for another telegram account then you can used it to track all the activities of the project including that of the bounty manager.Once again, thank you, friend, for your help and explanation, which can provide enlightenment for me and my fellow Bounty participants. It's true that he has only been Bounty Manager twice, because the first time he paid correctly, I felt that there would be no problems with the next bounty. I will, of course, pay attention to the suggestions and input you give as best as possible to be able to get certainty about this bounty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adreman23",
      "created_time": "November 26, 2023, 09:01:35 AM",
      "body": "If the bounty manager is no longer communicating, there's not much you can do. I visited his/her profile and noticed he/she have a low rank on the forum and are relatively new as a bounty manager. You can give him/her a red trust if you have evidence of non-payment for your bounty. However, ensure that your action is based on the forum's policy and has sufficient grounds. Giving a red trust has a profound impact on a person's reputation. On the other hand, you may choose to wait for a few days or weeks as there might be a personal reason for his/her offline status.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samsungs10",
      "created_time": "November 26, 2023, 09:13:40 AM",
      "body": "Quote from: Adreman23 on November 26, 2023, 09:01:35 AMIf the bounty manager is no longer communicating, there's not much you can do. I visited his/her profile and noticed he/she have a low rank on the forum and are relatively new as a bounty manager. You can give him/her a red trust if you have evidence of non-payment for your bounty. However, ensure that your action is based on the forum's policy and has sufficient grounds. Giving a red trust has a profound impact on a person's reputation. On the other hand, you may choose to wait for a few days or weeks as there might be a personal reason for his/her offline status.I really pay attention to all suggestions and thank you for your indirect support by strengthening me and other colleagues. It is always open for me to continue to wait and be able to communicate well with the Bounty Manager via telegram, and I really hope that happens so that the problems that occur can be known directly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 26, 2023, 09:32:55 AM",
      "body": "Quote from: Samsungs10 on November 26, 2023, 07:47:30 AMQuote from: Adbitco on November 26, 2023, 07:17:25 AMFirst you must have to pm your manager to know what is happening and why he is holding the payment then also try to reach out to the project owners to know what was their problem for not releasing payment. Most times it's advisable to always join a campaign that has escrowed their funds with someone that is reputable even though those token worths nothing but it should be in someone custody as to released them whenever the campaign is over according to how the discussion was made with the project owners. Sometimes hunters do not always read the rules correctly on the bounty thread and I know this is where most problems are coming from, learning to be patient is another keys as bounty campaign isn't that easy they consumed time and pays you peanut at the last end.Actually, I really want to be able to connect and find out from the Bounty Manager, but there is a problem with how I can contact the Bounty Manager, because until now BM has never been active again after November 10 2023.Same with the project owner and team, several colleagues and I have questioned it, but instead it was thrown at the Bounty Manager and even many of our Telegram accounts were banned.I agree with what you say and admit that maybe I didn't read the rules in their entirety but only the main points. If it's a matter of patience, maybe my colleagues and I have been patient enough with the rules that BM made previously. After completing the bounty, 4 weeks later it will be paid [October 16, 2023], but it has been changed again to November 19, 2023. Until now, there has been no clarity.My colleagues and I just want the Bounty Manager to join Telegram again and explain in real terms what actually happened, because previously the Bounty Manager was able to pay well for the Bounties that were carried out.Thank you for your advice.seeing that it has been a week since the supposed payment i think it’s reasonable to land on a conclusion nowif you violated something why would the bounty manager be inactive? if it’s because of personal reasons then they should have announced a warning with a justified explanation as to why there’s a huge possibility that the bounty manager have ran away with the payment already",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "November 26, 2023, 10:19:44 AM",
      "body": "Quote from: Samsungs10 on November 26, 2023, 07:47:30 AMActually, I really want to be able to connect and find out from the Bounty Manager, but there is a problem with how I can contact the Bounty Manager, because until now BM has never been active again after November 10 2023.The account was last active yesterday, have you tried to PM directly from the forum?In fact, this is a common problem experienced by bounty participants when participating in unclear projects and BM with low rank. I don't mean to accuse, but I think BM has an attachment to the project where the project only uses forums and participants to get free marketing. I can't give you anything at this time other than the advice to only follow BMs who have credibility like @julerz12 and @irfan_pak10.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "November 26, 2023, 11:35:33 AM",
      "body": "First of all, I do not think that this topic about Bounty Manager should be on the Altcoin discussion board. As per my understanding, the topic questions the reputation and integrity of the said Bounty Manager. The discussion is about the payments not being made by the BM, this topic should be moved to the Reputation board as we are not discussing any altcoin here. OP you should move your topic to the named board for further discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 26, 2023, 01:24:11 PM",
      "body": "Quote from: btc78 on November 26, 2023, 09:32:55 AMQuote from: Samsungs10 on November 26, 2023, 07:47:30 AMQuote from: Adbitco on November 26, 2023, 07:17:25 AMFirst you must have to pm your manager to know what is happening and why he is holding the payment then also try to reach out to the project owners to know what was their problem for not releasing payment. Most times it's advisable to always join a campaign that has escrowed their funds with someone that is reputable even though those token worths nothing but it should be in someone custody as to released them whenever the campaign is over according to how the discussion was made with the project owners. Sometimes hunters do not always read the rules correctly on the bounty thread and I know this is where most problems are coming from, learning to be patient is another keys as bounty campaign isn't that easy they consumed time and pays you peanut at the last end.Actually, I really want to be able to connect and find out from the Bounty Manager, but there is a problem with how I can contact the Bounty Manager, because until now BM has never been active again after November 10 2023.Same with the project owner and team, several colleagues and I have questioned it, but instead it was thrown at the Bounty Manager and even many of our Telegram accounts were banned.I agree with what you say and admit that maybe I didn't read the rules in their entirety but only the main points. If it's a matter of patience, maybe my colleagues and I have been patient enough with the rules that BM made previously. After completing the bounty, 4 weeks later it will be paid [October 16, 2023], but it has been changed again to November 19, 2023. Until now, there has been no clarity.My colleagues and I just want the Bounty Manager to join Telegram again and explain in real terms what actually happened, because previously the Bounty Manager was able to pay well for the Bounties that were carried out.Thank you for your advice.seeing that it has been a week since the supposed payment i think it’s reasonable to land on a conclusion nowif you violated something why would the bounty manager be inactive? if it’s because of personal reasons then they should have announced a warning with a justified explanation as to why there’s a huge possibility that the bounty manager have ran away with the payment alreadyI think they have to still exercise some little more patient before reaction otherwise I don't see any points to create an accusation thread against their manager. Sometimes we can invite the project representative a marketing officer to know why they haven't released their token to the bounty manager. To me I don't know if the funds has already been sent to manage or not since he didn't stated that it was escrowed with him so going to create accusations he might deny that the project hasn't sent him any funds yet so, the rightful way is to first confirm from the project representative to know if they sent out bounty payment after which you can all come together to accused the manager. IMO this is the right way to go about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 26, 2023, 03:50:07 PM",
      "body": "Quote from: Samsungs10 on November 26, 2023, 05:22:42 AMBounty Manager Profile Link: https://bitcointalk.org/index.php?action=profile;u=3422562OP, you're indeed to be blamed if it eventually turns sour and the said manager didn't fulfil his promise to you and your fellow bounty hunters. Learn a lesson and move on. You enrolled under a low ranked account which has virtually nothing to lose even if red tagged. Everything is yours to lose. It's even a big risk to enroll in bounties run by established members let alone a manager who isn't recognized on the forum yet. Bounty payment wasn't even escrowed and it's also run by a greenhorn here. Wasn't that a red flag for you?Quote from: Bureau on November 26, 2023, 11:35:33 AMThe discussion is about the payments not being made by the BM, this topic should be moved to the Reputation boardYou're right. It's either Reputation Board or Scam Accusations Board that suits what OP is laying bare here. Good a thing it has been moved now. For next time, others bringing this type of complaint should take note and know that those two boards are the relevant places to post them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 26, 2023, 11:22:16 PM",
      "body": "There are two warning signs when participating in a bounty campaign and these are new bounty managers with no reputation to protect and no accountability and can scam exit when a huge amount landed in their wallet for distribution.Second, no disclaimer and a lack of information about bounty distribution if the team is the one who will distribute the token or if the tokens are on escrow.Based on the information you presented here the two signs are present here, if there is no announcement of the distribution or you don't hear anything from the bounty manager, you have the option to open a scam accusation, this is to prevent future bounty to land in their hands.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samsungs10",
      "created_time": "November 27, 2023, 12:06:23 AM",
      "body": "Quote from: btc78 on November 26, 2023, 09:32:55 AMQuote from: Samsungs10 on November 26, 2023, 07:47:30 AMQuote from: Adbitco on November 26, 2023, 07:17:25 AMFirst you must have to pm your manager to know what is happening and why he is holding the payment then also try to reach out to the project owners to know what was their problem for not releasing payment. Most times it's advisable to always join a campaign that has escrowed their funds with someone that is reputable even though those token worths nothing but it should be in someone custody as to released them whenever the campaign is over according to how the discussion was made with the project owners. Sometimes hunters do not always read the rules correctly on the bounty thread and I know this is where most problems are coming from, learning to be patient is another keys as bounty campaign isn't that easy they consumed time and pays you peanut at the last end.Actually, I really want to be able to connect and find out from the Bounty Manager, but there is a problem with how I can contact the Bounty Manager, because until now BM has never been active again after November 10 2023.Same with the project owner and team, several colleagues and I have questioned it, but instead it was thrown at the Bounty Manager and even many of our Telegram accounts were banned.I agree with what you say and admit that maybe I didn't read the rules in their entirety but only the main points. If it's a matter of patience, maybe my colleagues and I have been patient enough with the rules that BM made previously. After completing the bounty, 4 weeks later it will be paid [October 16, 2023], but it has been changed again to November 19, 2023. Until now, there has been no clarity.My colleagues and I just want the Bounty Manager to join Telegram again and explain in real terms what actually happened, because previously the Bounty Manager was able to pay well for the Bounties that were carried out.Thank you for your advice.seeing that it has been a week since the supposed payment i think it’s reasonable to land on a conclusion nowif you violated something why would the bounty manager be inactive? if it’s because of personal reasons then they should have announced a warning with a justified explanation as to why there’s a huge possibility that the bounty manager have ran away with the payment alreadyIt could be that what you say is the truth, but it would be a good idea for me and several colleagues to open up opportunities for the Bounty Manager to be able to provide detailed explanations via telegram. Usually BM itself is always active in responding to every question we ask, but now this is no longer done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samsungs10",
      "created_time": "November 27, 2023, 12:21:54 AMLast edit: November 28, 2023, 02:57:42 AM by Samsungs10",
      "body": "Quote from: MAAManda on November 26, 2023, 10:19:44 AMQuote from: Samsungs10 on November 26, 2023, 07:47:30 AMActually, I really want to be able to connect and find out from the Bounty Manager, but there is a problem with how I can contact the Bounty Manager, because until now BM has never been active again after November 10 2023.The account was last active yesterday, have you tried to PM directly from the forum?In fact, this is a common problem experienced by bounty participants when participating in unclear projects and BM with low rank. I don't mean to accuse, but I think BM has an attachment to the project where the project only uses forums and participants to get free marketing. I can't give you anything at this time other than the advice to only follow BMs who have credibility like @julerz12 and @irfan_pak10.You are correct; the account, after being inactive since November 10, 2023, was active again on November 23, 2023. Several colleagues have contacted PM via this forum, but there has been no response at all from BM.I'm interested in taking part in the bounty again because I took part in the first bounty and no problems occurred; BM paid on time. It was my mistake to just believe that, but because this has happened, I can only accept this situation.  Quote from: Bureau on November 26, 2023, 11:35:33 AMFirst of all, I do not think that this topic about Bounty Manager should be on the Altcoin discussion board. As per my understanding, the topic questions the reputation and integrity of the said Bounty Manager. The discussion is about the payments not being made by the BM, this topic should be moved to the Reputation board as we are not discussing any altcoin here. OP you should move your topic to the named board for further discussion.Thank you for your advice. Indeed,  I was just looking for where there was the same problem, but maybe this is not correct. I will try to move it according to the provisions that apply. Once again, thank you for the correction to improve it in a better direction.Quote from: Adbitco on November 26, 2023, 01:24:11 PMI think they have to still exercise some little more patient before reaction otherwise I don't see any points to create an accusation thread against their manager. Sometimes we can invite the project representative a marketing officer to know why they haven't released their token to the bounty manager. To me I don't know if the funds has already been sent to manage or not since he didn't stated that it was escrowed with him so going to create accusations he might deny that the project hasn't sent him any funds yet so, the rightful way is to first confirm from the project representative to know if they sent out bounty payment after which you can all come together to accused the manager. IMO this is the right way to go about it.That's right, my friend, it does require more patience than usual, even though it seems like we have opened this opportunity to the Bounty Manager, but we don't know that until now there is nothing we can do anymore as long as BM is not active on Telegram. I, too, like you, don't want to be prejudiced against BM as long as there is no concrete evidence. I and other colleagues are just waiting until BM is active again on Telegram to open up about the problem.Quote from: Mpamaegbu on November 26, 2023, 03:50:07 PMQuote from: Samsungs10 on November 26, 2023, 05:22:42 AMBounty Manager Profile Link: https://bitcointalk.org/index.php?action=profile;u=3422562OP, you're indeed to be blamed if it eventually turns sour and the said manager didn't fulfil his promise to you and your fellow bounty hunters. Learn a lesson and move on. You enrolled under a low ranked account which has virtually nothing to lose even if red tagged. Everything is yours to lose. It's even a big risk to enroll in bounties run by established members let alone a manager who isn't recognized on the forum yet. Bounty payment wasn't even escrowed and it's also run by a greenhorn here. Wasn't that a red flag for you?Indeed, I have to admit that this is also a mistake that I may not have thought about until this far, but thank you for your advice that this is indeed the reality of what is happening, and there is no denying it other than having to wait and accept this reality.Quote from: Mpamaegbu on November 26, 2023, 03:50:07 PMQuote from: Bureau on November 26, 2023, 11:35:33 AMThe discussion is about the payments not being made by the BM, this topic should be moved to the Reputation boardYou're right. It's either Reputation Board or Scam Accusations Board that suits what OP is laying bare here. Good a thing it has been moved now. For next time, others bringing this type of complaint should take note and know that those two boards are the relevant places to post them. Thanks again for the advice, and that's what I did. My first move was into the wrong room, and I changed it back to the right place.Quote from: robelneo on November 26, 2023, 11:22:16 PMThere are two warning signs when participating in a bounty campaign and these are new bounty managers with no reputation to protect and no accountability and can scam exit when a huge amount landed in their wallet for distribution.Second, no disclaimer and a lack of information about bounty distribution if the team is the one who will distribute the token or if the tokens are on escrow.Based on the information you presented here the two signs are present here, if there is no announcement of the distribution or you don't hear anything from the bounty manager, you have the option to open a scam accusation, this is to prevent future bounty to land in their hands.My mistake was believing that the first bounty payment was done correctly by the bounty manager, and when BM made another bounty, I was also interested and always had a good opinion of BM, who had already paid, even though in the end it happened like this. But as long as there is no communication back with BM, I still hope there will be a bright spot that can happen. But once again, I really appreciate your support in carrying out options that can be carried out as a follow-up, because it is for a better goal in the future. Once again, thank you, my friend, for providing moral assistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "November 27, 2023, 01:38:32 AM",
      "body": "Quote from: Samsungs10 on November 27, 2023, 12:56:42 AM I and other colleagues are just waiting until BM is active again on Telegram to open up about the problem.The bounty manager account you are referring to was also active a few days ago. when you see he is still active in completing the spreadsheet which I see is not final yet. that means everything is not finished yet.While waiting, you can actually go to the project's official Telegram account. look for the admin and ask whether the funds for the bounty campaign have been given to the bounty manager. because there are those who have provided bounty allocations from the start, but there are also project teams who send bounty payments themselves and wait for the final spreadsheet from the bounty manager.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "November 27, 2023, 03:19:58 AM",
      "body": "Quote from: Pandu Geddon on November 27, 2023, 01:38:32 AMThe bounty manager account you are referring to was also active a few days ago. when you see he is still active in completing the spreadsheet which I see is not final yet. that means everything is not finished yet.It was supposed to be paid after 4 weeks of the campaign duration, as the campaign thread says. It can be delayed for many reasons but keeping no communication with the hunter is totally unprofessional. He should at least keep them informed about what is happening, why, and when will they get paid.I just tagged him so he posts here. Will remove once the issue is fixed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Samsungs10",
      "created_time": "November 27, 2023, 03:40:45 AMLast edit: November 28, 2023, 03:01:33 AM by Samsungs10",
      "body": "Quote from: Pandu Geddon on November 27, 2023, 01:38:32 AMQuote from: Samsungs10 on November 27, 2023, 12:56:42 AM I and other colleagues are just waiting until BM is active again on Telegram to open up about the problem.The bounty manager account you are referring to was also active a few days ago. when you see he is still active in completing the spreadsheet which I see is not final yet. that means everything is not finished yet.While waiting, you can actually go to the project's official Telegram account. look for the admin and ask whether the funds for the bounty campaign have been given to the bounty manager. because there are those who have provided bounty allocations from the start, but there are also project teams who send bounty payments themselves and wait for the final spreadsheet from the bounty manager.I have already carried out your suggestion. I also know that BM has been active since November 23, 2023, after being inactive since November 10, 2023. I continue to monitor movements on BTT and spreadsheets, but there is no movement according to what was promised. Usually BMs are very active on Telegram, but currently there are no BMs appearing on Telegram at all. Meanwhile, if we go to the official telegram of the project, we have also done this, and even several colleagues have actually been banned from the official telegram because they keep asking about the whereabouts of the Bounty Manager, who doesn't appear. Of course, it's difficult to ask anything else. Just to ask about the existence of the Bounty Manager, our account was banned.Quote from: Little Mouse on November 27, 2023, 03:19:58 AMQuote from: Pandu Geddon on November 27, 2023, 01:38:32 AMThe bounty manager account you are referring to was also active a few days ago. when you see he is still active in completing the spreadsheet which I see is not final yet. that means everything is not finished yet.It was supposed to be paid after 4 weeks of the campaign duration, as the campaign thread says. It can be delayed for many reasons but keeping no communication with the hunter is totally unprofessional. He should at least keep them informed about what is happening, why, and when will they get paid.I just tagged him so he posts here. Will remove once the issue is fixed.Thank you for your support. Until now, my colleagues and I have been waiting for good etiquette from the Bounty Manager via telegram or posting here. If there are changes from the Bounty Manager, then it is appropriate for me to provide the information again for correction. I always hope that there are improvements and changes that can be made by Bounty Manager.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "November 27, 2023, 03:47:15 AM",
      "body": "Quote from: Little Mouse on November 27, 2023, 03:19:58 AMQuote from: Pandu Geddon on November 27, 2023, 01:38:32 AMThe bounty manager account you are referring to was also active a few days ago. when you see he is still active in completing the spreadsheet which I see is not final yet. that means everything is not finished yet.It was supposed to be paid after 4 weeks of the campaign duration, as the campaign thread says. It can be delayed for many reasons but keeping no communication with the hunter is totally unprofessional. He should at least keep them informed about what is happening, why, and when will they get paid.I just tagged him so he posts here. Will remove once the issue is fixed.Yes, I think even if there is a disclaimer from the bounty manager that the distribution will be done by the team itself or the project, he should at least open a communication line between the bounty hunters and himself.And when he log-in to this community, there's none of that, maybe he is also waiting for a PM from the project. But at least keep the hunters in the loop as it's already November and many weeks have past without the bounty manager updating the participants and it looks very shady at this point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "November 27, 2023, 04:20:37 AM",
      "body": "A newbie account become bounty manager check.Bounty rewards not escrowed check.No official ANN and project representative check.What you can expect? the manager will not lose anything since his account is newbie rank, he can create a new account and start manage a new bounty, yet you still join it. The only way is attacking their social medias to warn other people, which I think it's more wasting time than works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}