{
  "id": "topic_5441556",
  "title": "Linklord",
  "author": "Linklord",
  "created_time": "February 28, 2023, 01:31:07 PM",
  "content": "I have just participated in this market a few recent months and begin with some BTC. I am saving them in my cold wallet and I'm wondering how to bridge my BTC to another chains such as Ethereum, Polygon to get more profit from Defi. Please help me and give me some good ways (reasonable cost and safe) to do that. Thank all!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441556",
  "comments": [
    {
      "author": "joniboini",
      "created_time": "February 28, 2023, 01:56:30 PM",
      "body": "If you \"bridge\" your token to another chain, you basically lose your Bitcoin and get a made-up token instead (like WBTC). Are you aware of the risk? You no longer control your BTC, and you rely on some smart contract or other parties, just like how you use a centralized exchange. Not to mention you also need to deal with volatility, trading volumes, etc for each wrapped token. There is no way to reduce this risk other than looking for other options. CMIIW.If you really want to earn passive income from altcoins, allocate funds for that and just buy the altcoins directly. Keep your BTC for yourself, don't get tricked by some shady pools promising 50% gain per year when you can DCA on your own.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "February 28, 2023, 02:08:49 PM",
      "body": "Quote from: Linklord on February 28, 2023, 01:31:07 PMI have just participated in this market a few recent months and begin with some BTC. I am saving them in my cold wallet and I'm wondering how to bridge my BTC to another chains such as Ethereum, Polygon to get more profit from Defi. Please help me and give me some good ways (reasonable cost and safe) to do that. Thank all!You need to use dapps bridge specific on the blockchain you are using because you will meed to lock your native Bitcoin to a smart contract to get an equivalent wrapped Bitcoin on your desired blockchain. If your purpose is just trading then why not use the native token of the specific blockchain that you will use to save time for getting separate transaction fee. Then just buy WBTC on that specific blockchain DEX if you want to hold Bitcoin on that Blockchain. Bridging native Bitcoin to WBTC is a bit tricky and some bridge doesn’t have this feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "February 28, 2023, 02:25:02 PM",
      "body": "It's a lot easier to use an exchange like bybit, deposit some funds as btc and withdraw them as wbtc (or btc on another network).The wrapped bitcoin on other networks are relatively stable but you need some of the coin for that network to be able to use them anyway so it might make sense to withdraw and convert to the native coin anyway. Also transaction fees on eth are expensive, polygon are still fairly high so make sure you take note of that when determining yield.High yields are either scams or need active management (every few days or a week) to achieve best results afaik don't risk too much if you're just testing things out. Give it a month and see what happens, also try depositing and withdrawing from smart contracts to make sure you can do that. If you're not using a site that's highly trusted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "February 28, 2023, 02:39:57 PM",
      "body": "Quote from: Linklord on February 28, 2023, 01:31:07 PMI have just participated in this market a few recent months and begin with some BTC. I am saving them in my cold wallet and I'm wondering how to bridge my BTC to another chains such as Ethereum, Polygon to get more profit from Defi. Please help me and give me some good ways (reasonable cost and safe) to do that. Thank all!So you want us to help you convert your bitcoins into some tokens (not even altcoins!) supposedly pegged to the value of bitcoin (until the issuer gets in trouble and will depeg it and run with the bitcoins), in order to keep those tokens in some questionable businesses' custody for some extra dollars you may or may not receive for doing this.I guess that some may help you, especially in the altcoins section. But I wouldn't. When (not if) the things will go wrong you may want to hold people responsible for helping you transform your bitcoins into ... well.. dust. I am not certain you want that and I am not certain you know what you're doing.Yes, if you're lucky you may end up with profit. Far too many didn't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "February 28, 2023, 02:44:21 PM",
      "body": "Quote from: Linklord on February 28, 2023, 01:31:07 PMI am saving them in my cold wallet and I'm wondering how to bridge my BTC to another chains such as Ethereum, Polygon to get more profit from Defi. Please help me and give me some good ways (reasonable cost and safe) to do that. Thank all!Defi are not giving good profits anymore.You will most likely ending having 3-5% per year or even less, and the risk is higher than you get in the tradicional markets, specially now with those high interest rates all over the world.Additionally, some Defi are getting hacking almost every 2 months or so.I would advice that you review your strategy.If anyway you still want to continue, I recommend that you take a look in this link:https://ethereum.org/en/bridges/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "February 28, 2023, 03:07:12 PM",
      "body": "Where exactly in defi are you looking to put your funds into? Also, you are better off converting your btc directly into ethereum and go from there rather than going through pegged versions of btc. You may use https://simpleswap.io/ to do btc-eth swapOnce on ethereum, it's easy to bridge to other evm chains as there are plenty bridges available. 1) https://app.hop.exchange/2) https://bungee.exchange/p.s. I have personally used above sites mentioned, they worked for me well. I take no guarantee however.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "February 28, 2023, 03:47:05 PM",
      "body": "Quote from: Linklord on February 28, 2023, 01:31:07 PMI have just participated in this market a few recent months and begin with some BTC. I am saving them in my cold wallet and I'm wondering how to bridge my BTC to another chains such as Ethereum, Polygon to get more profit from Defi. Please help me and give me some good ways (reasonable cost and safe) to do that. Thank all!Don't do this! Any token that has bitcoin name is not real bitcoin, and has some peg that can be broken.Moving Bitcoin to other shitcoin chains you are making it full centralized and controlled by few people who can make your new token worthless.Just looks what is constantly happening to Solana shitchain, and people are still using this shit, Binance chain is no better and runned by CZ and few of his friends.There is also a risk you could face soon with regulations, because everything else except Bitcoin is going to be considered as security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "February 28, 2023, 09:16:13 PM",
      "body": "Quote from: Linklord on February 28, 2023, 01:31:07 PMI have just participated in this market a few recent months and begin with some BTC. I am saving them in my cold wallet and I'm wondering how to bridge my BTC to another chains such as Ethereum, Polygon to get more profit from Defi. Please help me and give me some good ways (reasonable cost and safe) to do that. Thank all!Let's be clear here. You wouldn't be \"bridging\" your BTC. You would be lending your BTC, or trading it for a token. As we have recently seen, there is no guarantee that the BTC will be returned or that the token will retain the value of the BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}