{
  "id": "topic_5417593",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "October 18, 2022, 11:14:21 PM",
  "content": "QuoteIndia on Sunday launched 75 digital banking units in villages and small towns across the country in a move that it said will help bring financial services and literacy to more citizens.The digital banking units, set up in collaboration with over 20 public and private banks, are brick-and-mortar outlets that are equipped with tablets and internet services to help individuals and small businesses open their savings accounts, access government identified schemes, perform verifications, make transactions and avail loans and insurance.The physical outlets span across all Indian states and union territories, andwill provide services in two modes. “Self-service mode will be available 24x7x365 days,” said Shaktikanta Das, Governor of Reserve Bank of India, in a virtual conference. “The banks are also free to engage the services of digital business facilities and correspondence to expand the footprint of DBUs,” he said.Das said the units will also offer a digital assistance zone to answer queries from individuals and small businesses and hear their grievances.Availing banking services has traditionally been a struggle for people living in villages and small towns, said Prime Minister Narendra Modi. Even as more than a billion bank accounts exist in India, people living in remote areas have had to typically take a day off from the work to visit a nearby city for their banking related work.“We have given top priority to ensure that banking services reach the last mile,” he said. “We not only removed the physical distance but, most importantly, we removed the psychological distance.”The digital banking units are part of the Modi government’s years-long efforts to serve people in the far flung areas of the country. The government launched Jan Dhan Yojana, a scheme to get all citizens access to banking and financial services in 2014. More than 470 million bank accounts have been opened as part of the scheme,“Today the entire country is experiencing the power of Jan Dhan Bank accounts,” said Modi. “This opened the way for loans for the poor without collateral and provided Direct Benefit Transfer to the accounts of the target beneficiaries. These accounts were the key modality for providing homes, toilets, gas subsidy, and benefits of schemes for farmers could be ensured seamlessly. The IMF has praised India’s digital banking infrastructure. The credit for this goes to the poor, farmers and labourers of India, who have adopted new technologies, made it a part of their lives,” he said.https://techcrunch.com/2022/10/16/india-launches-75-digital-banking-units-in-rural-areas-in-financial-inclusion-push/....What is relevant here is bitcoin supporters claiming a larger than 4 billion unbanked demographic in the world. Who comprise some of bitcoin's largest user and support base.Banks and financial institutions primarily cater to whales and the wealthy. Global support for the poor and homeless are definitely lacking. Which is a primary driving force behind bitcoin and crypto mass adoption.While crypto may not necessarily be the main motivation behind india choosing to roll out vastly improved support for its unbanked. It could provide greater competition between crypto and banks in the country. Which tends to be something that many crypto supporters approve of. As it could mean better tools, support and greater opportunities for people in general.That said could the timing be wrong for this as it is occurring during a financial downtrend and global recession. While it is easy for investors and businesses to be profitable during a bull market. Our current bear market could tighten margins for error with new businesses and banks. Maybe what banks really need is to rollout a stablecoin pegged to the value of wood stoves and firewood.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417593",
  "comments": [
    {
      "author": "Vaskiy",
      "created_time": "October 19, 2022, 06:59:34 AM",
      "body": "The country with the highest population launching 75 digital banking units is a way to show that the ruling government is in favour of digital growth. It is true that the country have got a huge percentage of its economy in the un-banked sector. The government might've got wider plan, but what it has done with the digital bank launch is just a deviation and nothing in favour of the economy or towards the goodness of the bottom people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "October 19, 2022, 11:14:49 AM",
      "body": "Quote from: Hydrogen on October 18, 2022, 11:14:21 PMWhile crypto may not necessarily be the main motivation behind india choosing to roll out vastly improved support for its unbanked. It could provide greater competition between crypto and banks in the country. Which tends to be something that many crypto supporters approve of. As it could mean better tools, support and greater opportunities for people in general.One advantage of this digital banking unit is that it is not only bringing financial services but also financial education to the people. Most of these people in rural areas are not well educated to access or operate digital banking services, hence this launch would be an avenue to learn about these services. Online financial knowledge is a prerequisite for the use of cryptocurrencies. The people would soon be exposed to exploitation and excesses of centralized financial systems and they would definitely start searching for alternatives. Bitcoin would definitely have a competitive advantage over government-issued physical or digital currencies which would make Indians embrace it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$anounimus$",
      "created_time": "October 19, 2022, 05:15:54 PM",
      "body": "Quote from: Hydrogen on October 18, 2022, 11:14:21 PMWhat is relevant here is bitcoin supporters claiming a larger than 4 billion unbanked demographic in the world. Who comprise some of bitcoin's largest user and support base.In general, I feel that digital banking is a forward-thinking trend that will continue to gain momentum over time. There are many benefits to banks offering mobile apps, and I expect more services to take advantage of online banking as we move further into the future. From the looks of it, fintech (financial technology) is already starting to have an impact on Indian financial institutions—but there is still plenty of room for growth.The launch of these units, I think, will have other positive impacts, such as an increase in salaries for bank employees, but the public will also benefit from this move. It is hoped that this will help many poor people who may not have access to banks. In addition, these units are expected to increase access to banking facilities in rural areas such as orphanages, shelters for women and children, and tribal areas where many do not have easy access to financial institutions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "October 19, 2022, 07:25:19 PM",
      "body": "India has 3rd largest Web3 talent pool in the world: new NASSCOM-Hashed study“India currently accounts for over 11% of the global Web3 talent pool, making it the third largest Web3 talent pool in the world. Today, the Indian tech industry directly employs about 75,000 blockchain professionals. In addition, this talent pool is expected to grow by more than 120% over the next 1-2 years With a growing global demand for developers and blockchain professionals, India’s fast-growing workforce has clear advantages when it comes to upskilling, rapid retraining and bridging the Web3 supply/demand gap. \"https://apnews.com/article/technology-india-business-fa14bd4a6e34313399c7c1b9570256f2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "October 19, 2022, 08:22:45 PM",
      "body": "There are three banking applications in my phone from India, that I use, since I basically been living outside for 5 years, I do have to understand that I cannot go to any physical bank 🏦 and make changes or deposit or send or anything like that. 1. DBS 2. NIYO 3. NIYO global All three of them are not only amazing but they are also purely digital, I cannot go to dbs offline branch and ask for things to be done, they have good customer support and it works fairly well with cryptocurrencies like bitcoins, I used to own an account in SBI which is offline + online branch in India but it got banned when the government decided that they were not too happy with it, therefore at the end of the day I decided it's better to use the digital ones since they were more open for cryptocurrencies like bitcoins and were also working fine without paper 📜. Like why not ? Its better, faster, cheaper !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}