{
  "id": "topic_5440034",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "February 16, 2023, 08:21:42 AM",
  "content": "https://decrypt.co/121243/ordinals-gain-momentum-with-76000-nfts-minted-to-bitcoinOrdinals Gain Momentum With 76,000 NFTs Minted to BitcoinWhile the community remains divided, Ordinals has taken the Bitcoin ecosystem by storm.Despite pushback from Bitcoin purists, Ordinals—the NFT-like project on the Bitcoin blockchain—shows no signs of slowing, as over 76,400 inscriptions have been created to date. The number of Ordinals spiked on February 9, 2023, exceeding 20,800 inscriptions for the day, according to data from Dune.https://dune.com/dataalways/ordinals",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440034",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "February 16, 2023, 08:28:08 AM",
      "body": "I think it's an \"Intel refusing to build chips for the iPhone\" moment for us. So if anyone of us wants to benefit from this in the long run (considering that the announcement of ordinals came from this very forum), then we better get into this market now, otherwise we will be lumped with all the rest of the mainstream adopters and laggards, and miss out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "February 16, 2023, 08:46:40 AM",
      "body": "Unique serial number for every single satoshihttps://bitcointalk.org/index.php?topic=117224.msg1256530#msg1256530__The first ideas for creating unique non-fungible things in the Bitcoin ecosystem were more than 10 years ago.Opinions of some influential market participants in twitterhttps://twitter.com/sassal0x/status/1619888007515107330?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "February 16, 2023, 11:14:07 AM",
      "body": "NFT projects have yet solved their Achilles problem, inflationary supply and can not fight against selling pressure from NFT owners, gamers, investors. If they can not solve it, their projects will fail and their tokens will be dumped.If anybody does not believe it, check NFT category, Metaverse category, GameFi category on Coinmarketcap and see price history of such tokens.Ordinals creates short term higher demands on Bitcoin network but when hype on Ordinals is slow down especially when their token is dumped, crashed, demand will vanish shortly. Bitcoin network will return to its normality.Bitcoin network is better than in 2017 when Roger Ver and BCash team attacked with dusts. The Ordinals case proves that Bitcoin network is stronger and better than years ago. Nothing like transactions stucked in mempool one or two weeks with high fee rates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "February 16, 2023, 11:26:06 AM",
      "body": "Quote from: NotATether on February 16, 2023, 08:28:08 AMI think it's an \"Intel refusing to build chips for the iPhone\" moment for us. So if anyone of us wants to benefit from this in the long run (considering that the announcement of ordinals came from this very forum), then we better get into this market now, otherwise we will be lumped with all the rest of the mainstream adopters and laggards, and miss out.I believe we should not. There's a risk because it might open attack vectors by bad-actors in government, to find a narrative to \"shut the whole network down\". It could be something like, if bad-actors inscribe millions of child-porn in the Bitcoin blockchain, then politicians can have a cause to demand miners to stop processing those transactions, \"or else\". The narrative can also perhaps be used as an attack vs. full nodes? Because our computers are storing child-porn, the government can probably confiscate them from us?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "February 16, 2023, 11:34:36 AM",
      "body": "Quote from: Wind_FURY on February 16, 2023, 11:26:06 AMIt could be something like, if bad-actors inscribe millions of child-porn in the Bitcoin blockchain, then politicians can have a cause to demand miners to stop processing those transactions, \"or else\". The narrative can also perhaps be used as an attack vs. full nodes? Because our computers are storing child-porn, the government can probably confiscate them from us?That is a disadvantage shared by all decentralized systems. For example, the Bitcoin network right now, has some malware embedded in some of the early blocks (circa 2013 or something like that). It is not possible to delete the content without introducing a centralized censorship mechanism - it doesn't matter whether dev groups are the ones controlling it, it's still technically censorship.The good news is that most bad actors are actually just script kiddies disguised as paper tigers, so if somebody inserts a neural network inside the `ord` program that filters out illegal (image) content, then that particular attack vector would be closed for most people.However, we would just be playing whack-a-mole at that point because someone could fork the codebase to a time without the neural net. And Pandora's box opens all over again.I am a firm believer in the Streisand effect, so by inserting such a NN in client code in the first place, we are indirectly enticing people to inscribe that kind of content.Another alternative is to place the NN on the ordinals block explorer (which is already centralized), and that would actually be a much better idea. Better if VirusTotal integration was also included to weed out malware and stuff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "February 16, 2023, 11:49:29 AM",
      "body": "Quote from: Wind_FURY on February 16, 2023, 11:26:06 AMI believe we should not. There's a risk because it might open attack vectors by bad-actors in government, to find a narrative to \"shut the whole network down\".Of course. All those years, they couldn't thought of any FUD to shut it down, but hey, illegal content on-chain! Where's the self-destruction button?  Quote from: Wind_FURY on February 16, 2023, 11:26:06 AMBecause our computers are storing child-porn, the government can probably confiscate them from us?Look, if we ever let this happen, we'd deserve our fate. It's similar to saying that we should shut down the Tor nodes because some use it to run hidden services with child porn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "February 16, 2023, 01:52:49 PM",
      "body": "Quote from: tranthidung on February 16, 2023, 11:14:07 AMNFT projects have yet solved their Achilles problem, inflationary supply and can not fight against selling pressure from NFT owners, gamers, investors. If they can not solve it, their projects will fail and their tokens will be dumped.If anybody does not believe it, check NFT category, Metaverse category, GameFi category on Coinmarketcap and see price history of such tokens.Ordinals creates short term higher demands on Bitcoin network but when hype on Ordinals is slow down especially when their token is dumped, crashed, demand will vanish shortly. Bitcoin network will return to its normality.Are you seeing the next FTX or Terra Luna on this kind of project?  I do not know what others think but I think NFT on Bitcoin is just a marketing ploy and a money grab, I don't see any usage on these NFT at all.  Maybe I am wrong but I really don't buy this kind of project being implemented on Bitcoin or in its outer layer. Instead of this kind of stuff, I believe it is better if they put their energy and resources to create a better-performing Bitcoin and it can start with Scalability to secure future growth of transactions capability when the adoption explosion commence.Quote from: tranthidung on February 16, 2023, 11:14:07 AMBitcoin network is better than in 2017 when Roger Ver and BCash team attacked with dusts. The Ordinals case proves that Bitcoin network is stronger and better than years ago. Nothing like transactions stucked in mempool one or two weeks with high fee rates.Indeed the capability of Bitcoin to process transactions today is quite remarkable compared to its capability way back in 2017.  It was somehow frustrating way back then when we have to pay too much just to compete for confirmation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "February 16, 2023, 02:00:16 PM",
      "body": "Quote from: lionheart78 on February 16, 2023, 01:52:49 PMI do not know what others think but I think NFT on Bitcoin is just a marketing ploy and a money grab, I don't see any usage on these NFT at all.  Maybe I am wrong but I really don't buy this kind of project being implemented on Bitcoin or in its outer layer. The idea behind NFT, GameFi, Metaverse is not sustainable but I think those branches of cryptocurrency ecosystem will survive. Unfortunately, along the way, many projects will fail and die before people can build up more sustainable tokenomic models as well as more really good utility and use cases for NFTs.At the moment, NFT or Metaverse games are not actual games and can not compete with traditional games. In addition, people who join are not actually gamers and they won't simply enjoy playing games but care more about cost-benefit of their investment in NFTs. Therefore, when they feel bad, they will cut loss, sell their NFTs and tokens on market that would cause huge selling pressure.QuoteInstead of this kind of stuff, I believe it is better if they put their energy and resources to create a better-performing Bitcoin and it can start with Scalability to secure future growth of transactions capability when the adoption explosion commence.It's the past story and usually it's hard to share it to newbies and help them understand it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ektotanes",
      "created_time": "February 19, 2023, 06:28:32 PM",
      "body": "Am I the only one who holds Bitcoin, but who is completely uninterested in NFTs? Just curious",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "February 19, 2023, 07:15:48 PM",
      "body": "Quote from: zasad@ on February 16, 2023, 08:21:42 AMhttps://decrypt.co/121243/ordinals-gain-momentum-with-76000-nfts-minted-to-bitcoinOrdinals Gain Momentum With 76,000 NFTs Minted to BitcoinWhile the community remains divided, Ordinals has taken the Bitcoin ecosystem by storm.Despite pushback from Bitcoin purists, Ordinals—the NFT-like project on the Bitcoin blockchain—shows no signs of slowing, as over 76,400 inscriptions have been created to date. The number of Ordinals spiked on February 9, 2023, exceeding 20,800 inscriptions for the day, according to data from Dune.https://dune.com/dataalways/ordinalsWow, I had no clue about this project, it sounds interesting. Particularly this bit: \"The Ordinals protocol enables users to explore, transfer, and receive individual satoshis, which may include unique inscribed data such as videos and images. The process of adding assets to individual satoshis is called inscription. As Rodarmor explains, inscriptions make it possible to put content in a Bitcoin transaction and assign it to a satoshi. Once completed, Rodarmor says, the inscriptions are stored in a Bitcoin transaction’s signature.\"Found this on another article on decrypt: https://decrypt.co/120250/ordinals-launches-nfts-on-bitcoin-triggers-controversy also the quote below. \"One of these projects is Ordinals, and some Bitcoin maximalists are calling it an affront to Bitcoin principles.\"you can't stop them\" well ofc! bitcoin is designed to be censor resistant. doesn't stop us mildly commenting on the sheer waste and stupidity of an encoding. at least do something efficient. otherwise it's another proof of consumption of block-space thingy.— Adam Back (@adam3us) January 29, 2023Ordinals creator Casey Rodarmor takes the criticism in stride, saying the controversy helps his cause.“I actually love the haters,” he said. “I mean, they do more to drive people to find out about the project than anybody else. I don’t know what they think when they have these massive audiences, and they go, ‘This is an attack on Bitcoin’—it seems like you don’t want to do that if you don’t want people to use the thing.” \"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "February 19, 2023, 07:37:55 PM",
      "body": "@tread93seems your reading the crap that shows bias towards wanting it to continuebitcoin is a consent network by defaultlearn the difference between consent vs the other terms like \"permissionless\" and \"censorship resistancefunny how the link you pick only has content that lean towards the wording that say it cant be stopped and should continueoh well down that rabbit hole you go, hope it takes you less than a few months to re-surfaceby the way adam back is not a big coder, he just employs them. so dont take his word as a coder of possibility. take his words of which direction he is sponsoring his employees to push, pull of not bother with",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "February 19, 2023, 09:05:51 PM",
      "body": "I think there are currently two types of people interested in NFTs:1. People who want to make a quick buck2. People who want to take advantage of themI believe the concept of non-fungible tokens has some potential, but the NFTs being sold now have no real or lasting value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "February 19, 2023, 09:35:39 PM",
      "body": "Quote from: ektotanes on February 19, 2023, 06:28:32 PMAm I the only one who holds Bitcoin, but who is completely uninterested in NFTs? Just curious I am also not interested in NFT.  I was once but my interest died down when the hype of NFT declined and many investors lost huge amounts of money.  Most NFTs created that time were money grabs taking advantage of the trend and naive investors.Quote from: odolvlobo on February 19, 2023, 09:05:51 PMI think there are currently two types of people interested in NFTs:1. People who want to make a quick buck2. People who want to take advantage of themI believe the concept of non-fungible tokens has some potential, but the NFTs being sold now have no real or lasting value.Aren't they the same meaning?  Making a quick buck and taking advantage of the hype to make a quick buck.  After all at the current situation, when someone heard about NFT, it is all about making money out thin air.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "February 19, 2023, 11:58:13 PM",
      "body": "Quote from: franky1 on February 19, 2023, 07:37:55 PM@tread93seems your reading the crap that shows bias towards wanting it to continuebitcoin is a consent network by defaultlearn the difference between consent vs the other terms like \"permissionless\" and \"censorship resistancefunny how the link you pick only has content that lean towards the wording that say it cant be stopped and should continueoh well down that rabbit hole you go, hope it takes you less than a few months to re-surfaceby the way adam back is not a big coder, he just employs them. so dont take his word as a coder of possibility. take his words of which direction he is sponsoring his employees to push, pull of not bother withI think I liked what Casey Rodarmor said, which was basically saying if this is a way to get more people to use BTC, then why wouldn’t we support something like that as bitcoiners? I’m not sure if it’s really beneficial to the network or not, I just briefly skimmed through that article but I do think that there are certain utilities with NFTs and elements of those tokens that could be cool to assign to certain SATs. Idk to me it just sounds kind of cool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}