{
  "id": "topic_5456874",
  "title": "Broly46",
  "author": "Broly46",
  "created_time": "June 19, 2023, 02:06:06 PM",
  "content": "None of my thread have any elements of hatred, I choose my words carefully and I even go as far as making sure I would not get carried away by narratives and begin to talk bad about woman.In facts I love woman, and treat them with respect just like a gentleman, I do not ever once beat a woman in my entire life.However I mainly dislike some married guys and their daily routine, due to them being the breadwinner to the family, they have to go out and hunt for foods, obviously they have to go out and fight another man like me, and get my foods, this is something I dislike, but I do not hate them, because since the dinosaur age, men has been designed to kill each other to survive,  it is just as barbaric as it sound.finally, make peace!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456874",
  "comments": [
    {
      "author": "Wend",
      "created_time": "June 19, 2023, 03:17:36 PM",
      "body": "Quote from: Broly46 on June 19, 2023, 02:06:06 PM... because since the dinosaur age, men has been designed to kill each other to survive,  it is just as barbaric as it sound.finally, make peace!This is something that a lot of people are trying to hide, and they always think they are good people. Indeed, this life is a war, if we want to survive, we must destroy someone and get our reward. Just like in this cryptocurrency market, if we want to make a profit and make a lot of money, then someone else needs to make sacrifices for us to get there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "June 19, 2023, 03:21:59 PM",
      "body": "Quote from: Broly46 on June 19, 2023, 02:06:06 PMNone of my thread have any elements of hatred, I choose my words carefully and I even go as far as making sure I would not get carried away by narratives and begin to talk bad about woman.In facts I love woman, and treat them with respect just like a gentleman, I do not ever once beat a woman in my entire life.However I mainly dislike some married guys and their daily routine, due to them being the breadwinner to the family, they have to go out and hunt for foods, obviously they have to go out and fight another man like me, and get my foods, this is something I dislike, but I do not hate them, because since the dinosaur age, men has been designed to kill each other to survive,  it is just as barbaric as it sound.finally, make peace!Your title says you do not hate \"woman generally\" and then you go and say that you dislike married guys. So pertaining to men? You are confusing me. can you be more clear? Because from what I read you hate it when they get food from you or something and that's what men do that they hunt. So what are you really trying to say?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "June 19, 2023, 04:05:16 PM",
      "body": "It's been years and decades since oppression and discimination across genders. Economies are developing and I think our mindsets as well should follow the adjustments. We should accept the fact that both sexes has the capability to perform tasks and function as an employee. Some are even better than the counterpart gener or sex. It does depend on the individual and never their characteristics. Also enough minding things outside your concern. If other people are facing problems in your perspective, then let them be.Quote from: crwth on June 19, 2023, 03:21:59 PMQuote from: Broly46 on June 19, 2023, 02:06:06 PMNone of my thread have any elements of hatred, I choose my words carefully and I even go as far as making sure I would not get carried away by narratives and begin to talk bad about woman.In facts I love woman, and treat them with respect just like a gentleman, I do not ever once beat a woman in my entire life.However I mainly dislike some married guys and their daily routine, due to them being the breadwinner to the family, they have to go out and hunt for foods, obviously they have to go out and fight another man like me, and get my foods, this is something I dislike, but I do not hate them, because since the dinosaur age, men has been designed to kill each other to survive,  it is just as barbaric as it sound.finally, make peace!Your title says you do not hate \"woman generally\" and then you go and say that you dislike married guys. So pertaining to men? You are confusing me. can you be more clear? Because from what I read you hate it when they get food from you or something and that's what men do that they hunt. So what are you really trying to say?Quite setting a standard supporting the claim regarding gender discrimination. It sounded like he hated the idea that married men puts food in the table which sonehow creates the idea that women should also do so. Bottomline here is that, we do all have different set ups on our households. As long as things do work in such way, then that should not be a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "June 19, 2023, 04:37:08 PM",
      "body": "I'd like to go on record and state that I don't give two shits what OP's or anyone else's views on women are.  I don't know any of you in real life, and this forum doesn't need any of this Twitter/FB/whatever drama regarding identity politics, cancel culture, thought policing, and all of that shit.  If you live long enough you'll realize that you can get along just fine with people who hold extreme views that don't align with your own.And that nobody is perfect.  Not in their thoughts or actions, so as far as bitcointalk is concerned the only thing I'm going to judge is the quality of people's posts.  If somebody hates [insert whatever here], anyone is free to openly argue against that viewpoint.  This is a discussion forum after all, and a global one at that.  No doubt there are going to be a lot of members with myriad prejudices.  Grow a thick skin if y'all can't handle it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broly46",
      "created_time": "June 19, 2023, 04:44:06 PM",
      "body": "Quote from: Wend on April 24, 2023, 02:45:11 PM...a lot of people are trying to hide...it is too barbaric, we would dismiss anything violence as soon as possible as a gentleman.Quote from: crwth on April 24, 2023, 02:45:11 PM...You are confusing ne. can you be more clear?...You can look at my profile and find the answers. They need to hunt me down because it is a threat to them, if they can't kill me they can't sleep well at night. That is why I hate myself. Hope it clear the puzzle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terencio",
      "created_time": "June 19, 2023, 04:53:31 PM",
      "body": "Men are not designed to kill each other to survive, nor are they the only ones who can provide for their families. Women can also work, earn, and contribute to the household, just as men can also care, nurture, and support their loved ones",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 19, 2023, 05:05:36 PM",
      "body": "Quote from: Broly46 on June 19, 2023, 04:44:06 PMQuote from: Wend on April 24, 2023, 02:45:11 PM...a lot of people are trying to hide...it is too barbaric, we would dismiss anything violence as soon as possible as a gentleman.Quote from: crwth on April 24, 2023, 02:45:11 PM...You are confusing ne. can you be more clear?...You can look at my profile and find the answers. They need to hunt me down because it is a threat to them, if they can't kill me they can't sleep well at night. That is why I hate myself. Hope it clear the puzzle.That doesn't answer him at all. So who are those hunting you? If you have something to clarify, you might wanna paste a link where someone accused you hate women. Yep it's the nature of men to fight each other though. You can observe this even in the animal kingdom when men have to fight just to have sex with one female specie. One has to dominate the other to survive but this does not happen online. Only snowflakes breaks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "June 19, 2023, 05:21:17 PM",
      "body": "Quote from: Broly46 on June 19, 2023, 02:06:06 PMHowever I mainly dislike some married guys and their daily routine, due to them being the breadwinner to the family, they have to go out and hunt for foods, obviously they have to go out and fight another man like me, and get my foods, this is something I dislike, but I do not hate them, because since the dinosaur age, men has been designed to kill each other to survive,  it is just as barbaric as it sound.finally, make peace!I must confess that I struggle hard to understand this post. From my little understanding, if I'm correct anyway, I first thought maybe you were accused of hatred towards women in one of your threads but later realized perhaps that is not the case. The truth is that either you are with a woman or you are alone you must go out and struggle for what to eat. It is a responsibility you can not runaway from either with woman in your life or not.It would be clear enough to say you dislike marriage in totality but it is unfair to dislike men who are fulfilling their responsibility on a daily basis. From the time immemorial, it has been men's responsibility to cater for women and majority of men have got themselves use to it already thou some women feel entitled and turn to be ingrate despite the sacrifice of men.Quote from: The Sceptical Chymist on June 19, 2023, 04:37:08 PMAnd that nobody is perfect.  Not in their thoughts or actions, so as far as bitcointalk is concerned the only thing I'm going to judge is the quality of people's posts.  If somebody hates [insert whatever here], anyone is free to openly argue against that viewpoint.  This is a discussion forum after all, and a global one at that.  No doubt there are going to be a lot of members with myriad prejudices.  Grow a thick skin if y'all can't handle it.It is weird how many of us expect others to behave in a way that suit us other than themselves and worry over the issues we can not change no matter the level of our dissatisfaction with it. I remember when I joined this forum newly and my first experience was people questioning my username to the extent I created a topic on the choice of username   things will get more better if we can overlook some things and learn not to be judgemental over how others do their things as far as they are not breaking the rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broly46",
      "created_time": "June 19, 2023, 06:11:15 PM",
      "body": "Quote from: Yatsan on April 24, 2023, 02:45:11 PM...Some are even better than the counterpart...I love how researchers begin to experiment on how far can a human (cope) do with task that is against their natural wills, e.g. making woman to be breadwinner, to drive heavy trucks, to lift weights and such. That is defying gravity and we know what, we are going to failed real hard. That is perverting itself to me.Quote...it sounded like he hated the idea that...well? wanna go into the rabbit hole and get to the bottom of this complex discussion?Quote from: The Sceptical Chymist on April 24, 2023, 02:45:11 PM...if you live long enough you'll realize that... I had been calling this history is repeating itself, I do not know people keep falling for the history again and again, despite one can live very long, yet they are not really changing. They might know more but they are not gonna do anything with history repeating too.Quote...nobody is perfect... the quality of people's posts...well, I might be quite tech savvy enough to generate AI assisted post to my heart content, but I decide to take sweet time to read each of them and take my personal views. Not perfect indeed!Quote...Grow a thick skin...that is easier said than done, it take ages of self improvement to achieve some result. Not some self actualization btw.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broly46",
      "created_time": "June 19, 2023, 07:02:07 PM",
      "body": "Quote from: bittraffic on April 24, 2023, 02:45:11 PM...So who are those hunting you...Let me count how many times someone has put a gun right at my head and ready to pull the trigger, tbh that is countless times I have through a death threat, that is also how I could survive the covid breakout with ease, unlike many was killed by the virus. Survivalism make me strong to live to these day, yup, many try to kill me but they are unsuccessful. Their failure also help me run into this forum, do you not know satoshi didn't survive the subprime market collapse too, do you think it is coincident? or it is a killing plot from the very beginning? well?Quote...but this does not happen online...We all laugh about making money online during 2000-2010, do you recalled your dad would call you idiot if you told them you make some mmo money, some pokemon coins, ahahahahaha, they are coming for your coin now. I sure hope bitcoin is still a funny internet video game money today.Quote from: knowngunman on April 24, 2023, 02:45:11 PM...struggle hard to understand this post...because it indicate my power level is very high, not many people would get to my zone easily, do you think warren buffett is easy to understand? he is as sneaky as a senile old man, old man are heavily equiped with heavy weight explosive too. take your sweet time, it is about learning the forbidden arts.Quote...choice of username...well that is indeed very offensive username, many would not readily ignore it, I said they had a kneejerk reaction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "June 20, 2023, 10:44:21 AM",
      "body": "Quote from: Broly46 on June 19, 2023, 02:06:06 PMNone of my thread have any elements of hatred, I choose my words carefully and I even go as far as making sure I would not get carried away by narratives and begin to talk bad about woman.In facts I love woman, and treat them with respect just like a gentleman, I do not ever once beat a woman in my entire life.However I mainly dislike some married guys and their daily routine, due to them being the breadwinner to the family, they have to go out and hunt for foods, obviously they have to go out and fight another man like me, and get my foods, this is something I dislike, but I do not hate them, because since the dinosaur age, men has been designed to kill each other to survive,  it is just as barbaric as it sound.finally, make peace!In regards to the bolded, It's actually an age when dumb and violent people roam the earth because they have no light in them. It can also happen in this age, even to modern people.It always happens at some point in time in human history when the Earth's or humans protective shields have become weakened exposing themselves to the instability and chaotic nature of the great \"cosmic darkness\" that surrounds the shield.The shield is overwhelmed when humans repeatedly violate the natural laws designed to keep society sane and moral. The shield also helps keep the outerspace dark energy or \"aliens\" from entering your world. So, they understood that to breach it and takeover they have to get the humans to violate the laws.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "June 20, 2023, 11:06:23 AM",
      "body": "Since the beginning of the world, men have been carrying the responsibility of the family. This responsibility falls on men by birth. Every man goes out and works hard to earn money to keep his family well and to keep all the family members happy. But not all men are responsible, there are some men who avoid the knowledge of their responsibility. As a result, their families live a difficult life. There are some men who do not think about the family and get involved in various vices and abuse the girls of the family. This can never be a good aspect of a man. Apart from performing his duties well, a man should definitely keep the family happy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "June 20, 2023, 12:16:00 PM",
      "body": "Dude's an incel trying to cover up the fact that he can't get a woman to stay with her even with a date. In my experience, people who say that they don't hate X tend to hate X. What did married men do to you that you hate them, never seen a good marriage? You know the saying, different strokes for different folks? Just because you hate something that someone loves doesn't mean your hate is valid. You haven't beat a woman before because you've never been with one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "June 20, 2023, 12:56:41 PM",
      "body": "Quote from: Broly46 on June 19, 2023, 02:06:06 PMIn facts I love woman, and treat them with respect just like a gentleman, I do not ever once beat a woman in my entire life.The strongest human woman we need to gently protect.Quote from: Broly46 on June 19, 2023, 02:06:06 PMHowever I mainly dislike some married guys and their daily routine, due to them being the breadwinner to the family, they have to go out and hunt for foods, obviously they have to go out and fight another man like me, and get my foods, this is something I dislike, but I do not hate them, because since the dinosaur age, men has been designed to kill each other to survive,  it is just as barbaric as it sound.As a man who is married and has children, it is indeed required to have to make a living for their needs. The work of a married man is not all the same even though the average man works odd jobs. But they don't have to fight other men or they don't have to fight each other, for me that's a different context because fortune varies from one man to another. For men who have regular jobs, it is clear how much their income is regulated.Maybe your environment is different from the environment of many other people in real life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}