{
  "id": "topic_5473406",
  "title": "sologub",
  "author": "sologub",
  "created_time": "November 08, 2023, 09:03:45 PMLast edit: November 11, 2023, 08:49:55 AM by sologub",
  "content": "За последние несколько месяцев мне удалось отправить четырех своих клиентов из России в Европу при помощи стартап визы. Алгоритм релокации (коротко): $60К+ вы вкладываете в стартап, который регистрируем на территории Европы (они ложатся на счет фирмы и тратятся только на развитие проекта. Под такую статью попадает, например, плата себе зарплаты из этих денег) --> --> подаемся на звание инновационного продукта/услуги (в зависимости от страны процедура разная, но если в общих чертах то нужно показать как ты собираешься трудоустраивать 5-10 местных в свою компанию в течении года - трех). --> получив бумагу от бюрократов идем к другим бюрократам и говорим \"а дайте нам стартап визу и ВНЖ ведь мы - инновационные\"В среднем вся процедура занимает 3-4 месяца. Пока у меня 100% доходимость до результата. Пятый проект - мой собственный (я релоцировался в Лондон). Если у вы хотите переехать но у вас нет проекта и даже идеи - могу накидать и идей и работающих проектов, которые в режиме ожидания. Мой интерес: до 20% вашей компании если мы реально будем работать над развитием продукта или до $20К если продуктом заниматься не будем (если компания только для того, чтобы заскочить в поезд). Конкретная сумма зависит от юрисдикции и платятся от лица созданной компании в Европе как зарплата в течении 6-9 месяцев.  Подробный алгоритм узнайте, написав в личку.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473406",
  "comments": [
    {
      "author": "imhoneer",
      "created_time": "November 09, 2023, 06:35:54 AM",
      "body": "Quote from: sologub on November 08, 2023, 09:03:45 PMЗа последние несколько месяцев мне удалось отправить четырех своих клиентов из России в Европу при помощи стартап визы. Алгоритм релокации (коротко): $60К+ вы вкладываете в стартап, который регистрируем на территории Европы (они ложатся на счет фирмы и тратятся только на развитие проекта. Под такую статью попадает, например, плата себе зарплаты из этих денег) --> --> подаемся на звание инновационного продукта/услуги (в зависимости от страны процедура разная, но если в общих чертах то нужно показать как ты собираешься трудоустраивать 5-10 местных в свою компанию в течении года - трех). --> получив бумагу от бюрократов идем к другим бюрократам и говорим \"а дайте нам стартап визу и ВНЖ ведь мы - инновационные\"В среднем вся процедура занимает 3-4 месяца. Пока у меня 100% доходимость до результата. Пятый проект - мой собственный (я релоцировался в Лондон). Если у вы хотите переехать но у вас нет проекта и даже идеи - могу накидать и идей и работающих проектов, которые в режиме ожидания. Мой интерес: до 20% вашей компании если мы реально будем работать над развитием продукта или до $20К если продуктом заниматься не будем (если компания только для того, чтобы заскочить в поезд). Конкретная сумма зависит от юрисдикции и платятся от лица созданной компании в Европе как зарплата в течении 6-9 месяцев.  Подробный алгоритм узнайте, написав в личку телеграм. Здравствуйте господин @sologub, опять решили заглянуть к нам.Так, а мы о Вас наслышаны и ваших подвигах, вот не забываем и остальным напоминаем https://bitcointalk.org/index.php?topic=5366082.0.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sologub",
      "created_time": "November 10, 2023, 09:05:33 AM",
      "body": "Quote from: imhoneer on November 09, 2023, 06:35:54 AMЗдравствуйте господин @sologub, опять решили заглянуть к нам.Спасибо, уважаемый. Как ты сам писал в своей ветке: QuoteНичего не утверждаю однозначноА в созданной тобой теме никаких фактов, только какие-то невнятные товарищи что-то пишут. Хочу, также, напомнить что человек признается мошенником ТОЛЬКО судом. В противном случае это клевета. Можешь скинуть решение какого нибудь суда? Спойлер: нет, не можешь. Потому что такового нет. А следовательно: все написанное в твоей ветке домыслы и предположения.  Напомню: QuoteНичего не утверждаю однозначно",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "malaker",
      "created_time": "November 10, 2023, 09:52:07 AM",
      "body": "А отзывы релокантов имеются? Ну чтобы убедиться)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 10, 2023, 10:20:38 AM",
      "body": "У знакомых там счета заблочили по причине русского паспорта, хотя живут там не первый год и доходы легальные, а не стартапы.Если вы в Лондоне, скажите есть ли там шанс поменять в банке старые фунты на новые?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "November 10, 2023, 10:31:55 AM",
      "body": "imhoneer, надо бы дополнить Ваш тред о sologub   Там на самом деле очень много интересного) У меня с ним тоже когда-то был контакт, переписка была очень интересной. Постараюсь ее найти и закинуть в тред) По теме релокации, есть возможность залочить средства до исполнения? С Вашим интересом все ясно, я про основной  деп.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "November 10, 2023, 12:13:46 PM",
      "body": "Не забываем поддерживать флаг в отношении этого мошенникаhttps://bitcointalk.org/index.php?action=trust;flag=2871С учетом того что Ratimov выпилился из отзывов, сейчас флаг поддержан минимальным необходимым для активации количеством участников.Ну а по теме интересная мысль промелькнулы - скинуть что ли инфу на этого клоуна Мизулиной/СК/прокуратуре? Сейчас инфоцыган налево и направо сажают глядишь и этим заинтересуются   Меньше форум засирать будет",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sologub",
      "created_time": "November 10, 2023, 05:39:16 PMLast edit: November 10, 2023, 05:44:53 PM by Xal0lex",
      "body": "Quote from: Ratimov on November 10, 2023, 09:16:07 AMМожешь скинуть решение какого нибудь суда? Зачем мне что-то доказывать человеку, имя которого я не знаю и нас не представили. Но если что-то хочешь пожалуйста (прийдется, правда, подумать и потрудиться): - идешь на сайт правительства Великобритании. - ищешь там мое ФИО и аффилированные с ней компании. - смотришь партнеров по этим компаниям.  - пишешь и узнаешь за меня. Доказывать что-то анониму нет никакого желания. Quote from: klarki on November 10, 2023, 10:31:55 AMПо теме релокации, есть возможность залочить средства до исполнения? С Вашим интересом все ясно, я про основной  деп.Ты мне ничего не платишь: заводишь средства в компанию в которой у меня 5-10% и у тебя/твоей команды остальное (важно: право голоса не по долям, а у каждого участника). Мы тратим деньги только после того как начинаем активность после получения стартап визы и только на те активности, которые нужны для достижения целей компании (получить прибыль). Никаких серых схем и левых откатов.[примечание модератора: несколько постов были объединены]Quote from: KTChampions on November 10, 2023, 12:13:46 PMНу а по теме интересная мысль промелькнулы - скинуть что ли инфу на этого клоуна Мизулиной/СК/прокуратуре? Сейчас инфоцыган налево и направо сажают глядишь и этим заинтересуются   Меньше форум засирать будет  Это пишет чувак с подписью на беттинг. Really. Ты просто, wasteman, мужик.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "light_warrior",
      "created_time": "November 10, 2023, 05:49:13 PM",
      "body": "Quote from: sologub on November 10, 2023, 05:39:16 PMQuote from: Ratimov on November 10, 2023, 09:16:07 AMМожешь скинуть решение какого нибудь суда? Зачем мне что-то доказывать человеку, имя которого я не знаю и нас не представили. Но если что-то хочешь пожалуйста (прийдется, правда, подумать и потрудиться): - идешь на сайт правительства Великобритании. - ищешь там мое ФИО и аффилированные с ней компании. - смотришь партнеров по этим компаниям.  - пишешь и узнаешь за меня. Так а где взять твои фио? Ты светил гдето или здесь на форуме выкладывал? Как искать то на сайте правительства Великобритании? Давай выкладывай а люди поищут, я могу пробежаться по инету поискать тебя и твои заслуги если они у тебя есть  Левые или не левые заслуги.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sologub",
      "created_time": "November 10, 2023, 06:05:41 PM",
      "body": "Quote from: light_warrior on November 10, 2023, 05:49:13 PMТак а где взять твои фио? Я так полагаю у тех людей что кричат \"я его знаю!\"Quote from: light_warrior on November 10, 2023, 05:49:13 PMТы светил гдето или здесь на форуме выкладывал? Как искать то на сайте правительства Великобритании? Давай выкладывай а люди поищут, я могу пробежаться по инету поискать тебя и твои заслуги если они у тебя есть  Левые или не левые заслуги.Вот и я о том же: куча людей кричат что \"Сологуб мошенник!!!\" но никто из них не может назвать имени. Все что-то слышали но никто ничего не знает.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "csync",
      "created_time": "November 11, 2023, 12:27:04 AM",
      "body": "Кейсы подобные при релокации в Испанию. Нужен очень хороший бизнес план, который должны утвердить в Министерстве Промышленности, ну а если есть MVP или продукт, так все становится легче. Кажется подобное есть и в Португалии. Посредник там особо не нужен, вся инфа доступна в интернете. А стартап / проект можно купить готовый.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sologub",
      "created_time": "November 11, 2023, 08:34:49 AMLast edit: November 11, 2023, 02:07:11 PM by Xal0lex",
      "body": "Quote from: Ratimov on November 10, 2023, 08:31:56 PM...написал, что у тебя доходность 100%Я этого не утверждал. В моем посте написано: \"Пока у меня 100% доходимость до результата\". ИQuote from: Ratimov on November 10, 2023, 08:31:56 PMКогда нечего сказать по теме. Как раз по теме ибо эта подпись характеризует человека очень сильно. Это настолько нечистоплотная херня что просто писец - я про беттинг. Зарабатывать деньги на нищих и закредитованных лудоманах это зашквар посильнее чем работать с компаниями из РФ. Хуже только торговля людьми и их частями. Но это в Сологубии так. Возможно в Ратимовке по другому. Quote from: csync on November 11, 2023, 12:27:04 AMКейсы подобные при релокации в Испанию. Нужен очень хороший бизнес план, который должны утвердить в Министерстве Промышленности, ну а если есть MVP или продукт, так все становится легче. Кажется подобное есть и в Португалии. Посредник там особо не нужен, вся инфа доступна в интернете. А стартап / проект можно купить готовый.Да ты прав: в большинстве стран еврозоны есть такие программы. И прав ты в том, что найти можно информацию в интернете (спойлер: на официальных сайтах правительств) или спросив у GPT/Bard. Ошибаешься ты в одном: я не посредник, и мой интерес лежит в развитии проекта на той стороне а мое преимущество - британский паспорт (который упрощает работу) [примечание модератора: несколько постов были объединены]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sologub",
      "created_time": "December 22, 2023, 11:06:49 AM",
      "body": "Quote from: Symmetrick on November 12, 2023, 05:02:59 PMзапускать ico в 2017 году была чистоплотной хуйнёй?А кто запускал ICO? Я продавал результаты анализа рынков ICO проектов. Ну или покажи обратное.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}