{
  "id": "topic_5456723",
  "title": "Broly46",
  "author": "Broly46",
  "created_time": "June 18, 2023, 07:35:16 AM",
  "content": "what is the point of having high IQ?it is believed that high IQ make you a better person.it is also believed that high IQ get you more score in a test in school.but what does it make you a person after leaving the school.in real life, there is finited of everything resource, what does high IQ help the reality?let me assume, when there is only 100 apple in the town, high IQ person would more likely get more of the apple, yup, high IQ help you get more apple from finited source of apple. thus make you a better breadwinner, high IQ make a better breadwinner than low IQ person.finally:is it economics topic? it is politics isn't it? source, please?why should I believe you?go back to your baselet me know how do you think.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456723",
  "comments": [
    {
      "author": "Bako97",
      "created_time": "June 18, 2023, 09:01:43 AM",
      "body": "Quote from: Broly46 on June 18, 2023, 07:35:16 AMwhat is the point of having high IQ?it is believed that high IQ make you a better person.it is also believed that high IQ get you more score in a test in school.but what does it make you a person after leaving the school.in real life, there is finited of everything resource, what does high IQ help the reality?finally:is it economics topic? it is politics isn't it? source, please?why should I believe you?go back to your baselet me know how do you think. high IQ doesn't make you a better person, it makes you a more smarter person.In a group of people, the person with high IQ always have an edgewise over those with low IQ because of their problem solving ability.A person with high IQ is believed to posess a \"meta-cognitive awareness\", they know how to detect and reuse plans, methods and strategies that they can apply to solve problems.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broly46",
      "created_time": "June 18, 2023, 10:03:23 AM",
      "body": "Quote from: Bako97 on April 24, 2023, 02:45:11 PM...\"meta-cognitive awareness\",...it is very unusual, after I break this terms down into individual words, I come to an understanding that:meta = very primitive sthcognitive = recognition ability, such as able to read text, to read a picture to tell it's nameawareness = obviously they are aware of it while most people simply ignore anything in life.Quote...detect and reuse plans, methods and strategies... to solve problems...let's sum it up, isn't it what a breadwinner suppose to do? breadwinner solve the problem of the most fundamental life problems, food is ought to be the most fundamental life problems, water is also the most fundamental problems, of course, in a wasteland or in the woods, there isn't many fancy objects to play with, breadwinners should not have to solve too many things that is trivial and non criticals. Gadgets or toys or luxury is not fundamental items.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "June 18, 2023, 12:16:50 PM",
      "body": "This connotes that having those or an IQ's enables you to handle the affairs of life more better than an ordinary person or a layman. Having IQ also position you to qualifies into working in a good company than others who are not knowledgeable enough to handle that position of work. So IQ helps during school and after school, you are being smarter and creatives than others who aren't making any efforts in times of life as well as general innovation just as Bitcoin was introduced and established to us by Satoshi Nakamoto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "June 18, 2023, 01:24:35 PM",
      "body": "Quote from: Broly46 on June 18, 2023, 07:35:16 AMwhat is the point of having high IQ?it is believed that high IQ make you a better person.it is also believed that high IQ get you more score in a test in school.but what does it make you a person after leaving the school.in real life, there is finited of everything resource, what does high IQ help the reality?let me assume, when there is only 100 apple in the town, high IQ person would more likely get more of the apple, yup, high IQ help you get more apple from finited source of apple. thus make you a better breadwinner, high IQ make a better breadwinner than low IQ person.finally:is it economics topic? it is politics isn't it? source, please?why should I believe you?go back to your baselet me know how do you think.IQ is what one needs to be successful in whatever he or she is doing. In decisions making,in business,in whatever name them. People do things the other way round because they lack IQ and they end up regretting their actions. This is one of the gifts that most leaders lack that it why they decide to eat up the country's money that is in their custody and at the end they will be caught and send to jail. But initially,they thought that they are the smart ones,unknown to them that they lack IQ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 18, 2023, 03:33:05 PM",
      "body": "OP, I think I understand what you are trying to express here, yeah, but high IQ in humans can be in different aspects of their career, profession, academic degree, etc. For example, someone who has a high IQ on how to run a business could expand the business by opening other branches. Also, someone can have a high IQ in academics; they can read, write, and pass their exams very well, but with such an IQ in only academics, they may not necessarily do well in other aspects of life.Some people have a high IQ to counsel others and solving family problems, but they can't handle their own homes. Some don't have the high IQ to manage their office; they could get employed in a large private company, but due to poor performance, they can easily get sacked, even though they were people of great intelligence in the high institution. In general, high level of IQ in a career that someone chooses will grant them excellent.OP, I know that the forum is not against individuals that write in bad English because it's not the mother tongue of most people here, but it's very important to write correctly with good punctuation because that's what makes readers easily understand the message you are trying to pass. Some people can just skip a thread after reading the first and second paragraphs, and when it doesn't make sense to them, they will just skip the topic. So, I will advise you to  work on your writing skills; it will help build you a great reputation here. You can read Advantages of engaging in quality contributions on the forum.Don't take it so hard on me, it's just friendly advice.Cheers 🥂, Dr.Bitcoin_Strange 👺👺",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "June 18, 2023, 04:46:11 PM",
      "body": "A higher IQ makes you more suited for complex problem solving and that's the basis of upstarts in today's world. The ability to solve a problem means you create something people are willing to pay money for and that makes you a better bread winner.Quote from: Broly46 on June 18, 2023, 10:03:23 AMmeta = very primitive sthMeta actually means something that is progressive or beyond the current sphere, like meta-physics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "June 18, 2023, 05:17:10 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on June 18, 2023, 03:33:05 PMOP, I think I understand what you are trying to express here, yeah, but high IQ in humans can be in different aspects of their career, profession, academic degree, etc. For example, someone who has a high IQ on how to run a business could expand the business by opening other branches. Also, someone can have a high IQ in academics; they can read, write, and pass their exams very well, but with such an IQ in only academics, they may not necessarily do well in other aspects of life.Some people have a high IQ to counsel others and solving family problems, but they can't handle their own homes. Some don't have the high IQ to manage their office; they could get employed in a large private company, but due to poor performance, they can easily get sacked, even though they were people of great intelligence in the high institution. In general, high level of IQ in a career that someone chooses will grant them excellent.OP, I know that the forum is not against individuals that write in bad English because it's not the mother tongue of most people here, but it's very important to write correctly with good punctuation because that's what makes readers easily understand the message you are trying to pass. Some people can just skip a thread after reading the first and second paragraphs, and when it doesn't make sense to them, they will just skip the topic. So, I will advise you to  work on your writing skills; it will help build you a great reputation here. You can read Advantages of engaging in quality contributions on the forum.Don't take it so hard on me, it's just friendly advice.Cheers 🥂, Dr.Bitcoin_Strange 👺👺Yep, I have seen my schoolmates considered to be the first section as they were full of book readers and in the year-end program, they are the kids who are valedictorians and with honors.  Academically they are good. Met them in college in the nearby city, and most of them now drink beer. Does look like it's not their first time anymore but I'm certain those kids had not tasted a beer during high school.  It's in their college days when the first time they got a life. They can explain thermodynamics, I give them that.If a person with a high IQ uses this intelligence for good then he's a better person I suppose. If he uses his intelligence to get away with crimes he did I guess that's still good but doesn't make him a better person.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "June 18, 2023, 05:29:59 PM",
      "body": "Well, it is true that high INTELLIGENT QUOTIENT (IQ), helps you to excel in academics.  It is believed that, with the high IQ you have as person, coupled with your academic excellence, you can easily Navigate your way through life struggle. A high IQ person can easily think fast when faced with a troubled situation. Also, in hiring personnel's for your company or business, you need high IQ individuals, who are social reformers, Idealist that can help your business grow.  So in an Ideal sense, high IQ will really help you in real time situation, even being a breadwinner, you need high IQ traits to win more bread 🍞 for your family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "June 18, 2023, 05:30:35 PM",
      "body": "high IQ does not make you a better person. it just makes you better at working thing outIQ is not about being born with a skill or knowledge. its about having the better ability of finding solutions, work arounds, or even just spotting problemsidiots think that if they can call a flaw a feature that makes them smart. but they have not thought about the problem or a solution, or even a real useful function for the flaw.. so not knowing anything, they dont want to do anything about it so pretend its a feature just to stand at the sidelines pretending to be smarthowever a smart person would see a problem and:find a way to abuse the flaw in a way for gain. find a way to fix itinform others of the solution for fixing/gaining from itbut not all smart people are good people. there are many scammers that abuse dumb people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broly46",
      "created_time": "June 18, 2023, 06:06:28 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on April 24, 2023, 02:45:11 PM...they may not necessarily do well in other aspects of life...It is too often, they have to be careful in choosing their career.Quote...write in bad English...to work on your writing skills...Yes your highness, having high command of English is a respect to the community and the kingdom. Having perfect American English is a good start. Those weak in English tend to be very cagey snobbish and chauvinistic about other language too. Language reflect the true nature of a culture, beautiful language also give the impression to a person of high calibre, intelligence, professional and reliable. Protecting English language, it is an important duty to every gentleman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "June 18, 2023, 06:10:52 PM",
      "body": "Quote from: MainIbem on June 18, 2023, 12:16:50 PMThis connotes that having those or an IQ's enables you to handle the affairs of life more better than an ordinary person or a layman. Having IQ also position you to qualifies into working in a good company than others who are not knowledgeable enough to handle that position of work. So IQ helps during school and after school, you are being smarter and creatives than others who aren't making any efforts in times of life as well as general innovation just as Bitcoin was introduced and established to us by Satoshi Nakamoto. I've been to jobs that require taking an IQ test first before hiring you which is a little discriminative as not everyone who can do good are book smart but at the same time if they've been doing stuff like that for a while and they have thrived, it's a testament to how successful their hiring process is right? But I digress, having high IQ would definitely help you a ton in life, makes school a breeze, finding jobs easier, and landing you a better life a much simpler task compared to the average person. It comes with its own drawbacks though, such as a high predisposition for suicide and depression, as well as many other mental health issues that are associated with having an above-average IQ.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "June 18, 2023, 06:11:10 PM",
      "body": "There are endless benefits of having a high IQ and just saying it seem needless, in a world were the general IQ levels is at a constant decline it's a great thing to actually be able to still maintain a high IQ.High IQ can+ Help you get task done well and on time.+ Help you have a better understanding of thing faster.+ Create financial opportunity for yourself.+ Be logical and discipline in your approach to things.But it has a side effect and that you may not be able to interact properly with people of lower IQ, because of the distance IQ and you may be see as someone who feels perfect and you opinion may seem hateful",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "June 19, 2023, 04:41:12 AM",
      "body": "Higher IQ doesn’t mean you will always make more money. I think the man with the highest IQ alive works somewhere making minimum wage.There are also many dumb people out there who have a low IQ and they are millionaires. There is no correlation really. These days, being smart and getting good grades doesn’t always mean you will be wealthy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DrBeer",
      "created_time": "June 19, 2023, 08:49:53 AM",
      "body": "As it is not surprising, but the answer will not be unambiguous.1. Positive side: this is knowledge, the desire for development, critical thinking, better and more complex goals in life. Accordingly, there is a high probability of a high standard of living, recognition, and success.2. On the other hand - no matter how strange it sounds, but \"it's easier for a fool to live.\" No, this does not mean that being a fool, you will have everything that is written in paragraph 1. This means something else - you will not have the realization that you live poorly, that you have little money, that you have no prospects.Near the fool there will always be someone who will say - you live normally, there are those who live even worse, so here's a penny for your work, and you will probably work now 12 hours a day for the same money A person with low intelligence also has low needs in life. Believe me - if you are planning to have your own villa by the age of 45-50, accounts in several banks, savings in cryptocurrency, good education for children, happy grandchildren, the opportunity to gather all families once a month on the ocean and spend a great time, then a primitive and the poor dream of a lifetime, of course exaggerated, \"buy a new iPhone\"!A person without a high level of intelligence does not have a very important quality - critical thinking. And this is a very important skill for a real assessment of what is happening, understanding the situation, developing measures to change the situation. Therefore, the majority of the undeveloped are poor, unhappy, and this is systemic for them and in many generations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "June 19, 2023, 08:57:09 AM",
      "body": "— IQ = Knowledge to solve problems.— High IQ = more Knowledge to solve problems properly— Low IQ = less Knowledge to solve problems properly — Knowledge = Light to see— High Knowledge = more Light to see— Low knowledge = less Light to see— Light = the right information that eliminates ignorance. — The More the Light the better. The Less the Light the more the problems like disease, hunger, poverty (inability to take care of ones needs), confusion, etc*How To obtain Light: Consume enough good or holy information/foods only, and trust them to guide/help you. * How To dim or quench the Light: Consume bad information/foods and trust them to guide/help you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CODE200",
      "created_time": "June 19, 2023, 09:12:42 AM",
      "body": "Quote from: adaseb on June 19, 2023, 04:41:12 AMHigher IQ doesn’t mean you will always make more money. I think the man with the highest IQ alive works somewhere making minimum wage.There are also many dumb people out there who have a low IQ and they are millionaires. There is no correlation really. These days, being smart and getting good grades doesn’t always mean you will be wealthy. Was about to say that about the first line, we are so preoccupied of who's the smartest that we don't find solutions to solve the problem of slave labor and possibly losing the next greatest mind to exhaustion in those factories. IQ isn't an accurate scale of being a brilliant person, there's no precise measure to the measurement of someone's knowledge, there's multiple factors that IQ disregard, they split street smart with book smart which is kind of stupid because they go hand in hand as they are the oversimplication of the concept theory and practice. The point I guess of measuring someone's IQ is probably to help build self-esteem among the geniuses to are tacit in nature because there's so few who they think understands them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "June 19, 2023, 09:16:22 AM",
      "body": "Quote from: Broly46 on June 18, 2023, 07:35:16 AMsnipfinally:is it economics topic? it is politics isn't it? source, please?why should I believe you?go back to your baselet me know how do you think.QuoteGeniuses often have high IQs, but not everyone with a high IQ can be considered genius. Intelligent people, on the other hand, can have strong intelligence in many areas without having very high IQs. Intelligence can be expressed and measured in a variety of ways, and individuals with diverse intelligence can make valuable contributions in a variety of fields and professions.[1]GoogleFrom the writing above, IQ measurement often does not involve people who have emotional, social, musical, or creative intelligence, so a high IQ does not guarantee whether someone will have better money-making abilities than smart people, government officials around the world and also big entrepreneurs don't have high IQ but they have good intelligence and also take advantage of opportunities very well, so they can even hire people with high IQ to become staff in their company, in conclusion, as long as you have good intelligence then you will definitely make a lot of money by utilizing it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptocurencyKing",
      "created_time": "June 19, 2023, 10:03:35 AM",
      "body": "Quote from: Broly46 on June 18, 2023, 07:35:16 AMwhat is the point of having high IQ?it is believed that high IQ make you a better person.it is also believed that high IQ get you more score in a test in school.but what does it make you a person after leaving the school.in real life, there is finited of everything resource, what does high IQ help the reality?let me assume, when there is only 100 apple in the town, high IQ person would more likely get more of the apple, yup, high IQ help you get more apple from finited source of apple. thus make you a better breadwinner, high IQ make a better breadwinner than low IQ person.finally:is it economics topic? it is politics isn't it? source, please?why should I believe you?go back to your baselet me know how do you think.IQ isn't just limited to test but of course, if you want to relate to it in a test perspective, you should as well realise that, not all tests are written or taken on screens. Life itself tests you on several grounds and bases.How your able to perform in goose defines how well you understood how to make life choices and in turn, what your IQ is like in the field being tested.It's intelligent quotient and I take that to mean a measure of how your able and how fast yo make certain choices which could be deemed right. High IQ helps, you just have to know how to apply it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uruhara",
      "created_time": "June 19, 2023, 10:12:34 AM",
      "body": "But still, there are more great people who have high IQs like the inventors of today's technology. and inventors in the past.And in work I think people with high IQs would rather start their own company than work for someone else. but a high IQ also does not guarantee someone can be economically successful.Because to be successful you can't only have a high IQ. but also courage in action is also needed. and the ability to improve skills is also needed. and if it's about great skills then not people with high IQ can have it. But great skills are usually owned by people who have high EQ. EQ (great skill) & IQ (great thinking ability). both are needed. but can not be a benchmark.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}