{
  "id": "topic_5434409",
  "title": "StompyTooth",
  "author": "StompyTooth",
  "created_time": "January 12, 2023, 05:34:10 AMLast edit: January 16, 2024, 05:14:14 PM by StompyTooth",
  "content": "Intersango owes users thousands of bitcoin. Patrick Strateman embezzled 10s of millions of dollars worth of bitcoin from thousands of users. Hundreds are owed 1 BTC or more. He also sold the forked coins of these users.A co-founder has written up these new revelations, and his struggle to bring them to light in the hopes that people will get their money back. If you or anyone you know used Intersango, please share this with them.  Here’s a detailed account of what happened here: paypeoplepatrick d0t comAxios has written a story about this verifying some of the details.Axios did get a lot of things wrong, for instance saying the exchange shut down in 2012 (it shut down in 2014) and makes it seem like an accounting error (millions were embezzled at the time the site was taken down).. it also repeats the defendants lies that somehow it is ok to embezzle while in a lawsuit and ignores the fact that the lawsuit was brought over 3 years after the embezzlement started... despite all of this Axios still wrote an article showing the massive amounts owedhttps://www.axios.com/2023/12/14/customers-of-dead-bitcoin-exchange-demand-refundsAs you can see from the article 7 figures have already been paid out.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434409",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "January 12, 2023, 06:02:07 AM",
      "body": "If you're going to attempt to promote a website which is relatively new, less than a month old, you would need to provide more context to your thread and include all relevant information.For one, you should specify that the article covers an old news and you're not just using it for clickbait or some other malicious intent.The Press board might also be a better fit to post this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StompyTooth",
      "created_time": "January 12, 2023, 06:09:12 AM",
      "body": "Hey, I don't know what to tell you, but it's not a scam. Maybe it reads like one, but thousands of people are actually owed money. When they read this and click through to the site they will understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spiker777",
      "created_time": "January 12, 2023, 06:18:52 AM",
      "body": "Quote from: StompyTooth on January 12, 2023, 05:34:10 AMIntersango owes users thousands of bitcoin. Patrick Strateman embezzled 10s of millions of dollars worth of bitcoin from thousands of users. Hundreds are owed 1 BTC or more. He also sold the forked coins of these users.A co-founder has written up these new revelations, and his struggle to bring them to light in the hopes that people will get their money back. If you or anyone you know used Intersango, please share this with them.  Here’s a detailed account of what happened here: paypeoplepatrick d0t comNever Heard of Intersango before (maybe i am too young for that).. and they don't have much footprint left in internet either. i searched it on google and could only find this link about one Intersango which was supposed to be a crypto exchangehttps://bittrust.org/intersango-formerly-britcointhe link also indicates that It was formerly called Britcoin the post itself doesn't provide many details nor are there any reviews (positive or negative) from any of it's users. the link provided there doesn't work so we can assume it could've scammed thousands of people (only if it had thousands of users)  if they scammed millions off dollars of user's money we could've at least heard some news. maybe it was not as hyped as FTX (which scammed $ billions) but still, there has to be some news about their scam.  according to the website you gave this incident happened around 2014.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StompyTooth",
      "created_time": "January 12, 2023, 06:33:59 AM",
      "body": "Quote from: spiker777 on January 12, 2023, 06:18:52 AMQuote from: StompyTooth on January 12, 2023, 05:34:10 AMIntersango owes users thousands of bitcoin. Patrick Strateman embezzled 10s of millions of dollars worth of bitcoin from thousands of users. Hundreds are owed 1 BTC or more. He also sold the forked coins of these users.A co-founder has written up these new revelations, and his struggle to bring them to light in the hopes that people will get their money back. If you or anyone you know used Intersango, please share this with them.  Here’s a detailed account of what happened here: paypeoplepatrick d0t comNever Heard of Intersango before (maybe i am too young for that).. and they don't have much footprint left in internet either. i searched it on google and could only find this link about one Intersango which was supposed to be a crypto exchangehttps://bittrust.org/intersango-formerly-britcointhe link also indicates that It was formerly called Britcoin the post itself doesn't provide many details nor are there any reviews (positive or negative) from any of it's users. the link provided there doesn't work so we can assume it could've scammed thousands of people (only if it had thousands of users)  if they scammed millions off dollars of user's money we could've at least heard some news. maybe it was not as hyped as FTX (which scammed $ billions) but still, there has to be some news about their scam.  according to the website you gave this incident happened around 2014. Intersango was once the second largest bitcoin exchange. Its members were some of the first to ever be interviewed about bitcoin for the wallstreetjournal, newsweek, cncb and so on. Feel free to look at the archive.org page for Intersango and before the site was taken down in 2014, their about us page linked to a lot of the press articles. The site was taken down a year and a half after the registrations were closed and volume slowly died. A website called bitcoincharts.com also tracked early bitcoin exchanges and shows the volume that Intersango had as well as how its volume slowly died down. After 2014, when the site was taken down, most had already taken off their coins. Tons of people had inactive accounts and so the CTO basically took the site down and stole all the coins from users who had been inactive. There are some people that claim they were scammed but many had no idea and no way to find out. One of the co-founders fought a long legal battle to expose this and the article I linked to is the one that he wrote. This might be an old site but most embezzlement is only found out well after the fact. The evidence is all there and he is just trying to bring it to light and I am helping him.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StompyTooth",
      "created_time": "January 12, 2023, 06:39:09 AM",
      "body": "Quote from: franky1 on January 12, 2023, 06:28:08 AMthe website is one of those scam primersthey tempt you in with a thing[biography/history/advert] about some legal event [past or present] and then hook you in with a later scheme you can sign upto to then be part of a class of people seeking money... but ofcourse you will need to pay a admin fee upfronthere is the realitythose that lost from the 2012 intersango stuff.. are not getting anything backdont buy into any scheme that makes you think you can gets funds from nothing, or funds from historic events. oops. did i just step in and reveal the scam at the primer stage and before the topic creators scam initiated.. oh well. moving onIt's not a scam. There is no scheme. Just facts. The other co-founder who wrote the article sincerely hopes that those who's bitcoin was unknowingly embezzled gets it back. Read the article. It's clearly not what you are saying. lol you said you were \"moving on\" in your previous comment. now you can, bye bye",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StompyTooth",
      "created_time": "January 12, 2023, 06:45:12 AM",
      "body": "Quote from: franky1 on January 12, 2023, 06:04:31 AMyou know when you go on social media. and you see them scams that say \"did you wear a uniform to work, you may be owed thousands\"where you then end up reading a scam asking you to deposit to them money for court costs or admin or [insert lame reasons]well this topic is THAT. a scammoving onlook up the. case NORMAN v STRATEMAN. This was a lawsuit in the California Superior Court. If you look at the dockets you can see the two Intersango co-founders spent a million dollars each duking it out in this legal battle. It finally went to trial. You don't think maybe some updates came out? You don't think it is possible that there are new revelations. 5600 people are owed bitcoin and now it is a matter of public record.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StompyTooth",
      "created_time": "January 12, 2023, 06:47:50 AM",
      "body": "Quote from: Upgrade00 on January 12, 2023, 06:02:07 AMIf you're going to attempt to promote a website which is relatively new, less than a month old, you would need to provide more context to your thread and include all relevant information.For one, you should specify that the article covers an old news and you're not just using it for clickbait or some other malicious intent.The Press board might also be a better fit to post this.Why do you think this covers old news? When they found out Bernie Madoff had been embezzling funds since the 80s, was that old news? But thanks your feedback.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StompyTooth",
      "created_time": "January 12, 2023, 06:55:28 AM",
      "body": "Quote from: franky1 on January 12, 2023, 06:49:18 AMmaddoff... he was still in business scamming until 2008 when he got caught and the court system handled him within statute of limitationsyour \"secret\" recipe to get random people money. involving a mailing list they need to be part of to gain this secret.. Pfftcome on i smell the scammy admin fee scam a mile awayFrankie, if I was trying to scam people I wouldn't be directing it at the 0.000001 percent of human beings that accessed an obscure site over 8 years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StompyTooth",
      "created_time": "January 12, 2023, 07:02:56 AM",
      "body": "Quote from: spiker777 on January 12, 2023, 06:18:52 AMQuote from: StompyTooth on January 12, 2023, 05:34:10 AMIntersango owes users thousands of bitcoin. Patrick Strateman embezzled 10s of millions of dollars worth of bitcoin from thousands of users. Hundreds are owed 1 BTC or more. He also sold the forked coins of these users.A co-founder has written up these new revelations, and his struggle to bring them to light in the hopes that people will get their money back. If you or anyone you know used Intersango, please share this with them.  Here’s a detailed account of what happened here: paypeoplepatrick d0t comNever Heard of Intersango before (maybe i am too young for that).. and they don't have much footprint left in internet either. i searched it on google and could only find this link about one Intersango which was supposed to be a crypto exchangehttps://bittrust.org/intersango-formerly-britcointhe link also indicates that It was formerly called Britcoin the post itself doesn't provide many details nor are there any reviews (positive or negative) from any of it's users. the link provided there doesn't work so we can assume it could've scammed thousands of people (only if it had thousands of users)  if they scammed millions off dollars of user's money we could've at least heard some news. maybe it was not as hyped as FTX (which scammed $ billions) but still, there has to be some news about their scam.  according to the website you gave this incident happened around 2014. There should be news. I know the co-founder has reached out to several media outlets. Non crypto outlets don't get it and CoinDesk turned down the article because the editor didn't understand why people weren't coming forward. Well the 5600 people that are owed don't even know it or gave up a long time ago. They certainly don't know about these newly public releases. CoinDesk also didn't seem to understand the difference between civil litigation and criminal prosecution. Confessions in a civil trial don't translate to convictions. For instance, if in divorce court child abuse is discovered, the judge will not be able to sentence someone to jail. No a new trial in a new venue (not family court) needs to happen. Well it's the same thing here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StompyTooth",
      "created_time": "January 12, 2023, 07:14:01 AM",
      "body": "Quote from: franky1 on January 12, 2023, 07:01:01 AMyour not thoughyour hooking in more then just victims with tempters that other people can get involved too.. if you were a legit entity trying to seek clients for a legit lawsuityou would not be using such cheap tactics like a square-space hosting using a 1 year bought domain that uses proxies(privacy guard)i wont explain what legit case-invites actually do. (i dont want to train a scammer to scam better) but you surely aint one of the legit primers of a legit future fund recovery caseLook, a class action means lawyers get 10 million dollars of other people's money. All the evidence has already been put in the record by Patrick Strateman's own testimony. There is no work left to do but to get law enforcement to force him to give people their money back and to do a forensic audit to establish that he hasn't stolen from other people. If you've ever called up trying to get law enforcement to take on something, even if there is clear evidence, you'd know how resistant to bringing charges they are. That is why potential victims need to come forward. Attention needs to be brought to the matter. That is what I am doing. I'm sorry if the website isn't up to your standards of professionalism. It is just about getting the word out to potential victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StompyTooth",
      "created_time": "January 12, 2023, 07:31:48 AMLast edit: January 12, 2023, 07:41:52 AM by StompyTooth",
      "body": "Quote from: franky1 on January 12, 2023, 07:16:13 AMim not going to tell you what real legal process looks like.. i dont want you emulating/phishing it to make your scam look more legit.but you are not showing the basics.. in any waywhere is money being asked for? You are trolling hard lol but I love you anyway, Frankie. Do you want me to set you up a video call with the co-founder? I'd be happy to make that happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 25, 2023, 09:17:56 PM",
      "body": "Quote from: StompyTooth on January 12, 2023, 06:45:12 AMlook up the. case NORMAN v STRATEMAN. This was a lawsuit in the California Superior Court. If you look at the dockets you can see the two Intersango co-founders spent a million dollars each duking it out in this legal battle. It finally went to trial. You don't think maybe some updates came out? https://www.govinfo.gov/app/details/USCOURTS-cand-4_16-cv-03587/USCOURTS-cand-4_16-cv-03587-4Based on this, it seems you have no case whatsoever!QuoteORDER by Judge Yvonne Gonzalez Rogers granting 36 Motion to Dismiss; granting 37 Motion to Dismiss. Court DISMISSES WITH PREJUDICE the entire action. (fs, COURT STAFF) (Filed on 12/16/2016)After the case with the users vs Bitcoinica and Intersango lost, what makes you think you can change anything now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}