{
  "id": "topic_5415167",
  "title": "DigitalNoteXDN",
  "author": "DigitalNoteXDN",
  "created_time": "September 28, 2022, 05:02:59 AM",
  "content": "Q3 has seen some exciting development and progress at DigitalNote. We have been fortunate in securing the services of M1chl to help the project reach the goals and objectives that the team has set.One of the most important developments has been the success of writing a Mobile wallet for DigitalNote encompassing our wallet encrypted Messaging features. This allows our users to communicate securely with each other in real time.The development of the Apps by M1chl has overcome many challenges that we were unable to solve in the past. The App is now available on the Google Play stores and on the Apple Store.Some of the features that we now have built into the wallet include the following:Cold Staking – This means that you can stake your XDN without having to keep your wallet open to benefit from earning rewards. Another effort in making sure that XDN works toward a greener future. Withdraw staking rewards – This is a feature that allows you to leave your main balance for staking and withdraw the rewards to your “spend” account for purchases or to send XDN to your friends. Allows for instant payments for purchases of goods and services. This will be a significant benefit to users and merchants that can now have a trustless service to receive funds with a nominal fee being paid by the purchaser, ensuring the Merchant gets the full value of the purchase price.Q3 PartnershipsCavoodle.orgWe have secured a significant partnership with Cavoodle.org. They have released just under 300 unique Cavoodle Pup NFTs that have an XDN collar. The significance of this partnership is that we have been gifted 90% of the proceeds on the sale of these NFT’s to ensure that we can continue to pay for the development of DigitalNote and set up our own supporter’s club. These pups have been transferred to our developer's account so we are in control of what we do with them. We encourage the XDN community to choose your favorite pup and secure them as soon as possible so that we can continue developing XDN into one of the best Cryptocurrencies for our community. The “Whitelist” price to the Community will be the same for everyone which is currently just 0.1ETH. The pups are available on Opensea.ioRocketbot.proThe Rocketbot.pro partnership is another great development offering XDN exposure to over 100,000 cryptocurrency enthusiasts. This will also include a listing on the Merge wallet with another exciting feature for XDN investors. XDN holders can spawn an XDN masternode offering higher rewards than staking alone. The benefit of this service Is that you do not have to pay an additional fee to rent a VPS to host your masternode. The cost of hosting the masternode is based on a percentage of the rewards that are earned. More details to follow.Future DevelopmentWith the funds that we hope to secure from the sale of these cute XDN Cavoodle pups, we will allocate to the following:Development of the Apps to further enhance usability in a Point-of-Sale environment. Advertise to attract Cryptocurrency Investors and Merchants. Provide more opportunities to make our goal “XDN Accepted Here” a reality. Set up an XDN NFT Private Pup club similar to BAYC . Set up a web wallet using the tools and technology that have been used for our Mobile Wallets. Further, enhance our blockchain and QT wallets to scale even further. Investigate a DOA using 2XDN on the Binance Smart Chain to help make decisions on future projects. This will help give 2XDN the use case that has been missing.It really is time for XDN Supporters to start partying! Since 2014 https://www.coingecko.com/en/coins/digitalnote",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415167",
  "comments": [
    {
      "author": "DigitalNoteXDN",
      "created_time": "February 08, 2023, 03:21:57 AM",
      "body": "Just love the way you do not have to manually monitor your masternodes. Once you host on the new DigitalNote Non-custodial masternode wallet services. You get notifications sent directly to your phone when there is an issue. “Saving you time, saving you money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}