{
  "id": "topic_5469301",
  "title": "alani123",
  "author": "alani123",
  "created_time": "October 05, 2023, 01:38:45 PMLast edit: October 06, 2023, 11:30:47 AM by alani123",
  "content": "Crypto debit cards are a tool to easily spend your crypto and sometimes earn cashback while doing it. I'm starting this thread to help provide some guidance on what alternatives exist out there, while tracking the most vital specifications of each card. This list is going go be focused on debit cards that let you deposit your own crypto and have it exchanged for transactions.List in alphabetical orderBinance.com: https://www.binance.com/en/cardsCrypto.com: https://crypto.com/cardsPlutus: https://plutus.it/cardSpectroCoin: https://spectrocoin.com/en/bitcoin-debit-card.htmlWirex: https://wirexapp.com/cardFeatures|Provider|Ordering costs|Virtual?|Fees|Cashback?|Regions Available||Binance/Swipe.io|0€|YES|Low/None|YES|EU/EEA||Crypto.com|5$|YES|Some|YES|EU/EEA, UK, US, Brazil, Australia, New Zealand||Plutus.it|0€|YES|Low/None|YES|EU/EEA, UK|Cashback ComparisonUpcoming sectionFees ComparisonUpcoming sectionExchange Rate ComparisonUpcoming sectionCode:2023 10 05: List posted for the first time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469301",
  "comments": [
    {
      "author": "alani123",
      "created_time": "October 05, 2023, 01:38:56 PMLast edit: October 05, 2023, 01:52:24 PM by alani123",
      "body": "Reserved. More cards will be added as I come by them, I just wanted to put the thread layout out before adding everything. Feel free to make recommendations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "October 05, 2023, 02:12:02 PM",
      "body": "There was an old thread reflecting those that were KYC or not. Could you account for this? Although I think there are no longer KYC exempt or have ridiculous limits without verification, such as $50. If so I do not see much sense to spend with your card an investment that over time is revalued, although some people spend them because the Treasury of your country does not have direct access to the data of the exchange or company that depends on the card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 05, 2023, 03:59:18 PM",
      "body": "I like your idea, and will bookmark it for future reading, and waiting for the upgrade. To be honest, I am not a user of such cards, because Crypto is banned in our country. So, I don't really focus on things that are useless to me, but extra knowledge is useful and helps us in times that we don't expect. Well, coming back to the discussion, don't you think you should at least compare the 5 cards, I mean you did say, you would update it but it would be good if you would come up with the comparison of 5 cards at least. It is not that hard I think (I hope you won't mind my words, just a feeling). And you also created a topic about Binance debit card's availability in EU --> https://bitcointalk.org/index.php?topic=5469145.msg62942695#msg62942695 I read the whole thread, and the answers are still ambiguine, I mean does Binance card still work in EU or not. Well, I thought to ask this question there, but I did ask it here, because, such information should also be added to the comparisons. And I saw a similar thread created on the very same thing --> Crypto Debit Cards Observer  Created by Ratimov. And in that thread, he mentioned that the Binance card is currently unavailable. And one more thing, in what manner this thread will be unique then that? Overall, I like this initiative and really love to hear more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "October 05, 2023, 04:24:29 PM",
      "body": "Quote from: Ratimov on October 05, 2023, 04:08:00 PMNo benefit, OP is apparently going to talk about something that has already been told and published on the forum a long time ago. The uniqueness and meaning of opening a new topic may be if someone wants to test these cards and make comparisons from their own experience, this would be useful content and unique content.Just like reviews, got your point. If that's the case, then it is going to be fun because personal experiences are really helpful but will OP really try them out or just review them theoretically? Not objecting OP just curious. Because it won't be easy for the OP to review them I think he will simply write a comparison (that he aforementioned). Well, that's good then.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "October 05, 2023, 09:24:45 PM",
      "body": "I think these cards aren't supported worldwide, at least on Binance and crypto.com. I have tried for a long time to get a crypto debit card where we can spend our crypto. But I found Pyypl only that I can trust and support in my country. Though they require KYC, they are not as stringent as Binance. However, I have been using this card for a while and have never faced any issues. I am not sure if it is worth adding to the list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "October 05, 2023, 09:35:08 PM",
      "body": "Quote from: Faisal2202 on October 05, 2023, 03:59:18 PMAnd you also created a topic about Binance debit card's availability in EU --> https://bitcointalk.org/index.php?topic=5469145.msg62942695#msg62942695 I read the whole thread, and the answers are still ambiguine, I mean does Binance card still work in EU or not. Well, I thought to ask this question there, but I did ask it here, because, such information should also be added to the comparisons. Binance card is still functional, just not as useful while we can't deposit EUR. Quote from: Poker Player on October 05, 2023, 02:12:02 PMThere was an old thread reflecting those that were KYC or not. Could you account for this? Although I think there are no longer KYC exempt or have ridiculous limits without verification, such as $50. If so I do not see much sense to spend with your card an investment that over time is revalued, although some people spend them because the Treasury of your country does not have direct access to the data of the exchange or company that depends on the card.I think most cards require KYC these days. If I come across any that don't I'll post about it. Maybe in a separate thread though as those tend to be prepaid and not debit cards. Not sure about it yet. Quote from: Ratimov on October 05, 2023, 04:08:00 PMQuote from: Faisal2202 on October 05, 2023, 03:59:18 PMAnd one more thing, in what manner this thread will be unique then that? Overall, I like this initiative and really love to hear more. No benefit, OP is apparently going to talk about something that has already been told and published on the forum a long time ago. The uniqueness and meaning of opening a new topic may be if someone wants to test these cards and make comparisons from their own experience, this would be useful content and unique content.I'd like to compare the cashback plans these cards offer and come up with a conclusion. I'll just take some time I guess. Suggestions and constructive criticism is welcome. Don't be so negative yet tho... I just posted this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 06, 2023, 07:12:59 AM",
      "body": "Spectrocoin.com has a long history of scam, activities that do not comply with the terms of service, sudden closure of accounts, and CEO also launched Bankera which is one of the biggest ICO scams. The forum is full of Spectrocoin scam topics and the negative trust in their account will say a lot. I hope you remove them from the list.https://bitcointalk.org/index.php?action=trust;u=317543Spectrocoin.com Scamming Users 2020spectrocoin is sadly a scamQuote from: Jawhead999 on June 07, 2020, 07:13:42 AMHere are some accusations against this wallets█ Spectrocoin.com imitated a transfer of 64 BTC. Then removed 24+ BTC moreBankera/Spectrocoin paid shills bumping the thread 24/7 Creating a fake buzz !!!Scam by spectrocoin of 100 BTC Getting worried about my SPECTROCOIN transaction - WHERE IS MY MONEY !! Please Help! Spectrocoin.com is holding my moneySpectrocoin scammed me by 50$ BTC !!!!!Beware ! Scam ! spectrocoin.com ! Stay away from Spectrocoin ! Shady Company. Spectrocoin is SorryCrypto.com is a well-known service, but I hear about stupid technical mistakes they made and some bankruptcy lawsuits. I am not sure about all of them, but this must be taken into account.I think only Binance is the good in that list",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alani123",
      "created_time": "October 06, 2023, 08:19:25 AM",
      "body": "Quote from: Yamane_Keto on October 06, 2023, 07:12:59 AMSpectrocoin.com has a long history of scam, activities that do not comply with the terms of service, sudden closure of accounts, and CEO also launched Bankera which is one of the biggest ICO scams. The forum is full of Spectrocoin scam topics and the negative trust in their account will say a lot. I hope you remove them from the list.This is a valid observation. But I think it might be worth adding a notice for their bad reputation instead of outright removing them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "October 09, 2023, 01:17:44 PM",
      "body": "Quote from: alani123 on October 06, 2023, 08:19:25 AMQuote from: Yamane_Keto on October 06, 2023, 07:12:59 AMSpectrocoin.com has a long history of scam, activities that do not comply with the terms of service, sudden closure of accounts, and CEO also launched Bankera which is one of the biggest ICO scams.This is a valid observation. But I think it might be worth adding a notice for their bad reputation instead of outright removing them. That would be great, I hope you update it soon.I searched for Wirex. They have a long history here with no clear scam, but they have shady customer management, as the support team is not trained, rarely responds and often responds with unhelpful information, so you should take that into account when recommending this service.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainCharacter",
      "created_time": "October 19, 2023, 11:51:04 AM",
      "body": "I can also recommend \"advcash\", never had issues there",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}