{
  "id": "topic_5426962",
  "title": "DdmrDdmr",
  "author": "DdmrDdmr",
  "created_time": "December 08, 2022, 02:20:31 PM",
  "content": "Ayer, los ministros de la UE llegaron a un acuerdo para limitar los pagos en efectivo, y aplicar las normas antiblanqueo a los criptoactivos, dentro del marco de la directiva AMLD6. Tras el acuerdo de ministros, el asunto pasará al Parlamento Europeo quien deberá aprobar el texto definitivo tras su revisión.El primer artículo abajo referenciado cita que:Quote<…> Además del límite a los pagos en efectivo, las normas prevén extender los controles antiblanqueo que ya existen en la UE al sector de los criptoactivos, de modo que los proveedores de estos servicios tendrán que llevar a cabo verificaciones sobre sus clientes a la hora de efectuar transacciones por valor de 1.000 euros o más. <…> El segundo, que debe ser el origen de la información, señala que:QuoteThe new EU anti-money laundering and combating the financing of terrorism (AML/CFT) rules will be extended to the entire crypto sector, obliging all crypto-asset service providers (CASPs) to conduct due diligence on their customers. This means that they will have to verify facts and information about their customers. In its position, the Council demands CASPs to apply customer due diligence measures when carrying out transactions amounting to €1000 or more, and adds measures to mitigate risks in relation to transactions with self-hosted wallets. The Council also introduced specific enhanced due diligence measures for cross-border correspondent relationships for crypto-asset service providers.Pero por otro lado he leído en el tercer escrito, dentro de la web de la Comisión Europea, que:Quote<…>Today's proposal will improve Member States' ability to detect and counter tax fraud, tax evasion and tax avoidance, by requiring all crypto-asset service providers – irrespective of their size or location – to report transactions of clients residing in the EU. <…>It is foreseen that the new reporting requirements with regard to crypto-assets, e-money and digital currencies would enter into force on 1 January 2026.Creo que son dos cosas distintas, si bien relacionadas, donde el primer punto está bajo el paraguas del AML y es más inmediato, y el segundo bajo el prisma de los impuestos, y con un horizonte temporal a medio plazo.Ver:https://es.investing.com/news/economy/los-paises-de-la-ue-aprueban-un-tope-de-10000-euros-para-pagos-en-efectivo-2331186https://www.consilium.europa.eu/es/press/press-releases/2022/12/07/anti-money-laundering-council-agrees-its-position-on-a-strengthened-rulebook/https://ec.europa.eu/commission/presscorner/detail/en/ip_22_7513",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426962",
  "comments": [
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 08, 2022, 03:36:44 PM",
      "body": "Bueno, está claro que la intención es tener controladas las transacciones con criptomonedas con KYC como si fueran transacciones bancarias. Otra cosa es hasta qué grado puedan conseguirlo, pues esa legislación no va a estar vigente en todo el mundo en un principio. Pero puedo ver en un futuro donde obliguen a Ledger, Trezor, etc a identificar a sus usuarios, aunque hecha la ley hecha la trampa.Lo bueno que veo de esto es que diga que en teoría entraría en vigor en 2026. Primero porque las cosas de palacio van despacio y no sería de extrañar que se retrasara más, y luego porque de aquí allí puede haber matizaciones que relajen requisitos aunque en este punto no soy muy optimista.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 08, 2022, 05:52:29 PM",
      "body": "Quote from: Don Pedro Dinero on December 08, 2022, 03:36:44 PM<…>Lo del arranque con objetivo 2026 es, efectivamente, el único foco de luz que veo en la perspectiva al aspecto relativo a controlar todas las TX con fines impositivos (como argumento declarado, aunque está claro que va más allá). De hecho, a medida que veamos el desarrollo de lo que nos viene encima, habrá que ver si la gente sigue en el tablero de juego, o si algunos optan por plegar velas antes de estar sometido a un control exhaustivo. En ello depende mucho también la situación de base de los activos en tenencia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "December 08, 2022, 11:30:14 PM",
      "body": "Definitivamente son dos propuestas legislativas diferentes: AMLD6, la cual está orientada en combatir el lavado de dinero, y DAC8 (una actualización de la Directive on Administrative Cooperation, DAC), orientada en la evasión de impuestos.No encontré el texto propuesto para DAC8 hasta ahora (quería verificar que alcance tiene). Hay un enlace en la página enlazada por DdmrDdmr pero no contiene las últimas actualizaciones de la DAC, la última es de 2020 y parece no referirse a criptoactivos.Si encontré esta página de preguntas y respuestas que brinda un poco más detalle pero tampoco era lo que esperaba. Por ejemplo, no queda claro si hay límites mímimos para los montos de las transacciones a reportar (como sí ocurre con AMLD6). Es también interesante que en el sitio de preguntas y respuestas figura que \"en algunos casos\" se incluyen transacciones con NFTs, en otros no.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 09, 2022, 06:18:10 AM",
      "body": "Quote from: d5000 on December 08, 2022, 11:30:14 PM<…>Gracias por confirmar que son dos directivas distintas. Al redactar mi primer borrador, pensaba que eran contradicciones, para luego ver que el objetivo cubierto era distinto en ambos casos, aunque parte de un gran todo común.Cuando uno lee sobre estas directivas, y aún sabiendo que, por lo menos en el caso de DAC8 queda aún margen de debate y posiblemente algo más relativo a si puede haber o no un mínimo exento en la captación de datos de TXs cripto y su autor nominal, siempre cuesta ver bien el detalle de su aplicación, y su equiparabilidad o no a la gestión del efectivo que se hace recurrentemente. En el caso de un DAC8 sin exención, no de daría dicha exención en umbrales pequeños, aunque tampoco es obligatorio que lo equiparen al efectivo.Y si luego entramos en qué hace cada país miembro entramos en la siguiente ronda de los líos, para lo cual entiendo que las directicas anteriores pretenden asentar bases comunes, aunque con algo de flexibilidad a la baja en el caso de la AMLD6 (como es el caso de España con el efectivo topado en un umbral inferior al indicado en la directiva).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 15, 2022, 02:59:31 AM",
      "body": "Me pregunto cuanto faltará para que los exchanges y los bancos directamente nos pidan nuestras claves publicas maestras para poder operar con ellos.Creo que si los políticos europeos no lo han considerado es porque no están enterado de como funciona la derivación de las direcciones individuales. También me llama la atención como 1000$/EUR es el número mágico que separa las transacciones monitoriadas de las que se deben pasar por el filtro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "December 15, 2022, 03:45:18 AM",
      "body": "Quote from: Hispo on December 15, 2022, 02:59:31 AMMe pregunto cuanto faltará para que los exchanges y los bancos directamente nos pidan nuestras claves publicas maestras para poder operar con ellos.El tema es que en este caso todo usuario que quiera proteger su privacidad simplemente tendrá varias carteras HD, quizá con una \"meta clave\" que genere varias a la vez. Se puede seguir este \"juego\" al infinito, si piden las meta-claves tendremos meta-meta-meta claves etc., o simplemente Lightning o algún otro paso por transacciones off-chain. Es decir, pedir la xpub no les sirve porque se puede eludir también sin problemas. También podemos usar altcoins, si hacemos un atomic swap a Monero, una transacción más en Monero, y luego otro swap de Monero a Bitcoin, ya prácticamente no se puede probar nada.Lo que podrían pedir sin embargo sería una declaración jurada acerca del origen \"real\" del dinero (lo que ya hacen algunas bolsas, como Bitstamp, cuando se trata de montos elevados), o acerca de todas las direcciones que utilizamos en esta transacción. En este caso, creo que habrá un movimiento importante al P2P y habrá una tendencia que se separen los circuitos P2P y \"formales\".Sin embargo, esto no creo que se implementará en el caso de montos pequeños, porque el costo de personal y tecnológico para los exchanges (en muchos casos PYMEs) para probar el origen de los fondos etc. sería demasiado alto. Y esto es un argumento que vi varias veces en legislación propuesta para Europa, porque (aunque algunos lo crean) tampoco quieren ahogar el ecosistema cripto. Pero simplemente no valdría la pena tanto lío porque no ayudará a captar los peces gordos del lavado del dinero.Quote from: Hispo on December 15, 2022, 02:59:31 AMTambién me llama la atención como 1000$/EUR es el número mágico que separa las transacciones monitoriadas de las que se deben pasar por el filtro. Es simple, es la recomendación de la FATF, y es un monto ampliamente usado como mínimo para pedir requisitos AML en el sistema financiero tradicional, por ejemplo para transferencias internacionales. Básicamente esta legislación quiere equiparar las empresas cripto con las empresas financieras, y como las cripto no tienen \"jurisdicción\", se usan los mismos límites como para las transferencias internacionales.Ojo que la FATF Travel Rule también recomienda que se guarden la dirección cripto y el nombre de los participantes de cada transacción hacia un exchange o proveedor de servicios. Nada más que con +1000€ habría requisitos más severos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "womanderful",
      "created_time": "December 15, 2022, 07:26:45 AM",
      "body": "Quote from: d5000 on December 15, 2022, 03:45:18 AMtodo usuario que quiera proteger su privacidad simplemente tendrá varias carteras HD […] o simplemente Lightning o algún otro paso por transacciones off-chain […] MoneroEstá claro, y lo estuvo siempre, que tenemos medios alternativos para escapar al ojo de sauron. Sin embargo hay un problema mayor: hacer todas estas cosas y terminar con monedas limpitas e intrazables es como tener una pepita de oro en el bolsillo. ¿Quién va a querer operar contigo? Uno queda intrazable y fuera del alcance de las autoridades, pero más solo que la una.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 16, 2022, 03:49:40 AM",
      "body": "Quote from: womanderful on December 15, 2022, 07:26:45 AMQuote from: d5000 on December 15, 2022, 03:45:18 AMtodo usuario que quiera proteger su privacidad simplemente tendrá varias carteras HD […] o simplemente Lightning o algún otro paso por transacciones off-chain […] MoneroEstá claro, y lo estuvo siempre, que tenemos medios alternativos para escapar al ojo de sauron. Sin embargo hay un problema mayor: hacer todas estas cosas y terminar con monedas limpitas e intrazables es como tener una pepita de oro en el bolsillo. ¿Quién va a querer operar contigo? Uno queda intrazable y fuera del alcance de las autoridades, pero más solo que la una.Bueno, métodos va a haber. Las drogas, las armas, la prostitución y un largo etcétera de actividades ilegales van a seguir sucediendo, y van a usar algún medio de intercambio, sea cash, metales preciosos, criptomonedas o lo que sea. Solo pensemos que la vicepresidenta del parlamento la han pillado con 600.000 euros en metálico provenientes de un soborno de Qatar.A cuento de este thread, acabo de ver también que en EEUU, con la excusa de lo que ha pasado con FTX, quieren aprobar una legislación AML sobre las criptomonedas que básicamente va contra todo tipo de mixers, coinjoins etc y que va en la misma línea de la de la UE, con lo cual tenemos que estar muy atentos a cómo se suceden los acontecimientos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "December 16, 2022, 07:00:29 AM",
      "body": "Quote from: womanderful on December 15, 2022, 07:26:45 AM¿Quién va a querer operar contigo? Uno queda intrazable y fuera del alcance de las autoridades, pero más solo que la una.Todos que podrían imaginarse ser ese tal \"uno\". Si, esto llevaría a una cierta separación de flujos monetarios, pero es probable que el P2P aumente.Quote from: Don Pedro Dinero on December 16, 2022, 03:49:40 AMA cuento de este thread, acabo de ver también que en EEUU, con la excusa de lo que ha pasado con FTX, quieren aprobar una legislación AML sobre las criptomonedas que básicamente va contra todo tipo de mixers, coinjoins etc y que va en la misma línea de la de la UE, con lo cual tenemos que estar muy atentos a cómo se suceden los acontecimientos.Este proyecto de ley (el PDF se puede ver aquí) es mucho más abarcativo que la MiCa de la UE (que a grandes rasgos es todavía razonable), porque incluye a mineros y hasta ciertos tipos de traders (\"MEV searchers\") equiparándolos con compañías financieras (\"money service business\") y obligándolos al AML/KYC. Si esto se aprueba así (lo que no parece probable) no sería posible ya minar Bitcoin en EE.UU., salvo con algún tipo de lista blanca de direcciones. Ni tampoco se podrá operar una bolsa cripto que ofrezca criptos con sistemas de privacidad como Monero (a lo sumo a través de plataformas P2P que no tengan ningún tipo de \"sede\" en el país).El proyecto de ley no tiene en absoluto que ver con la protección al consumidor y por ende nada con FTX, sino que busca terminar con todo tipo de privacidad en el mundo cripto de EE.UU., y por lo tanto merece un repudio absoluto. (Igual siempre hay que recordar: EE.UU. no es \"el mundo\", ni siquiera América, aunque ellos - y gran parte de ese foro, como a veces parece - crean eso).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "womanderful",
      "created_time": "December 16, 2022, 07:41:55 AM",
      "body": "Quote from: Don Pedro Dinero on December 16, 2022, 03:49:40 AMLas drogas, las armas, la prostitución y un largo etcétera de actividades ilegales van a seguir sucediendoPero yo no quiero hacer nada de eso, y el hilo no trata de eso. Lo único que yo quiero es comprar los regalos de navidad para mi gente, sin tener que dar todos mis datos personales a nadie (que visto lo visto equivale a publicarlos en internet, pero esa es otra historia). Hubo una pequeña época dorada donde se podían comprar algunas cosas con bitcoin pero aquello ya se acabó y hemos vuelto al punto de partida: para mantener tu privacidad solo se puede pagar en efectivo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Porfirii",
      "created_time": "December 16, 2022, 09:02:16 AM",
      "body": "Quote from: womanderful on December 16, 2022, 07:41:55 AMQuote from: Don Pedro Dinero on December 16, 2022, 03:49:40 AMLas drogas, las armas, la prostitución y un largo etcétera de actividades ilegales van a seguir sucediendoPero yo no quiero hacer nada de eso, y el hilo no trata de eso. Lo único que yo quiero es comprar los regalos de navidad para mi gente, sin tener que dar todos mis datos personales a nadie (que visto lo visto equivale a publicarlos en internet, pero esa es otra historia). Hubo una pequeña época dorada donde se podían comprar algunas cosas con bitcoin pero aquello ya se acabó y hemos vuelto al punto de partida: para mantener tu privacidad solo se puede pagar en efectivo.Ya lo he defendido varias veces aquí, y lo seguiré haciendo: debería estipularse un límite exento para el que no hubiera que pasar por todo el proceso de KYC. Es lo más razonable, por un lado, y por otro facilitaría el consumo (ya se paga un IVA...) y la adopción de Bitcoin. Por algún motivo o no interesa o no apetece priorizar y regular este tema.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "December 16, 2022, 10:23:19 AM",
      "body": "Operativamente, en mi entorno cercano, no conozco ningún sitio físico que acepte bitcoin de manera directa. Bajo esa perspectiva, el sucedáneo más cercano que encuentro son los vales que puedes adquirir en ciertos portales (lo que duren de manera anónima), pero fuera de eso poca cosa, y menos aún sin identificarte. Acabaremos yendo a comprar un cactus al Rastro …Desde luego que un mínimo exento de trabas (identificación declaración, etc.) sería lo menos malo, pero a este paso no creo que suceda. Tampoco es que me apetezca demasiado veranear en la RCA o en El Salvador.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 16, 2022, 06:53:02 PM",
      "body": "Quote from: womanderful on December 16, 2022, 07:41:55 AMPero yo no quiero hacer nada de eso, y el hilo no trata de eso. Lo único que yo quiero es comprar los regalos de navidad para mi gente, sin tener que dar todos mis datos personales a nadie (que visto lo visto equivale a publicarlos en internet, pero esa es otra historia). Hubo una pequeña época dorada donde se podían comprar algunas cosas con bitcoin pero aquello ya se acabó y hemos vuelto al punto de partida: para mantener tu privacidad solo se puede pagar en efectivo.Me refiero a que podrás usar para tu privacidad lo mismo que se usa para esas actividades oscuras, aunque tú no hagas nada ilícito. A día de hoy el uso más privado en el día a día se hace con cash, que es lo mismo que usan el tráfico de drogas etc. En el caso del bitcoin para pagos del día a día las opciones son muy reducidas sino inexistentes, como comenta DdmrDdmr. Al fin y al cabo lo que nosotros usamos simplemente por privacidad sin quebrantar la ley es lo que usan también los delincuentes y por eso digo que opciones habrá, lo que pasa es que serán reducidas. En mi caso creo que el uso de efectivo, aunque se va a seguir reduciendo paulatinamente, va a tardar mucho en desaparecer por mucho en que se empeñen porque mucha gente nos vamos a resistir a dejar de usarlo y la locomotora económica de la UE es un país donde se usa mucho. El tema de las criptomonedas va a estar complicado, pues la mayoría de gente las usa como inversión y por tanto es más difícil no solo que las usen para pagar, sino que los negocios implementen maneras para que la gente pague, pues además en caso de hacerlo se complican las cosas a nivel contable/fiscal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}