{
  "id": "topic_5417018",
  "title": "JamesDaniel90",
  "author": "JamesDaniel90",
  "created_time": "October 13, 2022, 06:54:38 PM",
  "content": "I first got into crypto in February this year however did not start investing in Bitcoin until June after the crash as I felt it was too expensive until then. I have been DCA now since June and my average buy is £17,100 and I have 6% of a Bitcoin which I know is not much but I have been taking it slow and feel it is slowly growing whilst buying at these lower prices. I watched a clip on Youtube earlier saying how Bitcoin is great however it is limited in terms of profit potential and it got me thinking if I should keep DCA into Bitcoin or sell it all and put into Altcoins that are likely to return much more over the next 2-3 years. I mean how high can Bitcoin realistically go in the next 2-3 years? £150k maybe which would be less then 10x compared to other altcoins that can 20-50x when the bull run returns. Just wondering if everyone invests in Bitcoin or is it worth just focusing on strong altcoins that can 20-50x in the next few years?I know I have got into Bitcoin at a good price but just feel while altcoins are currently 85-95% down from all time high may be better making the most of that rather then being safe with Bitcoin and not seeing much return.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417018",
  "comments": [
    {
      "author": "d5000",
      "created_time": "October 13, 2022, 07:05:58 PM",
      "body": "Altcoins can yield a better ROI than Bitcoin. But they are extremely risky.If you consult altcoin charts and see how the older ones of them did in several market cycles (so look at least at the chart 2018-2022), many altcoins had a single bull run where their price multiplied. But it was often an unique event, and the price later never was able to fully recover to previous heights.Most of the altcoins currently being in top 10 are relatively new, so they may have existed only for one entire market cycle (or even less). So you can't predict if they still have potential, and how they will behave in future cycles. They may go much further down.See for example what happened to top altcoins of the past. YaCoin, NXT, Peercoin, and even the oldest altcoin, Namecoin, are some cases of coins which were in the top 10 by market cap eventually but now are below position 300, some even below 1000.Bitcoin in contrast, even if it's volatile, has consistently outperformed the previous market cycle until now. It's not guaranteed that this will continue, but it's not unlikely. (And if it occurs again, then the current <20.000 USD are of course an excellent price to stock up.)So choose wisely.(PS: A \"deeper\" reason why so many altcoins had only a single cycle is that the projects were premined and centralized, and later abandoned by their creators. This is similar to \"rugpulling\" in the DeFi space. There are very low incentives to invest in a project which was built to yield most of its ROI to a single \"dev team\" which then disappeared. In contrast, decentralized altcoins like Namecoin may have a chance to come back eventually.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 13, 2022, 08:00:40 PM",
      "body": "If you're going to regret not doing it and you've found an altcoin you like that's generally and repeatedly performed well (and you expect to do 20-50x, why wouldn't you put 5% of what you're investing in it)?Bitcoin is the best investment for stability but if you think there is a good contender that can do well in terms of market cap and you're going to be annoyed you didn't invest, a profit is still a profit regardless of how big it is and 2xing your entire portfolio (or even just adding a few % to it to me sounds much better than losing it all).If you don't care about altcoins or decide everyone's heard of bitcoin it's their go to for crypto investments so altcoins might perform badly because of it - then stick with just investing in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "melody82",
      "created_time": "October 13, 2022, 08:09:42 PM",
      "body": "The streets of cryprto are littered with the corpses of speculators who went altcoin chasing that 50x gain, because btc is too expensive. But if it was that easy we would all be super rich. It is possible to make money in alts, but chances are you will lose. Prove me wrong: show why bitcoins will or will not go up, and why an alt should go up 50x. I think btc is the better safe bet, more an more it is adopted. Altcoins come and go. Most of them have no long term. Some do. But most do not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "October 13, 2022, 08:12:37 PM",
      "body": "Yes, there are altcoins that can really give you huge profit in the next bull run. But the problem is that it's hard to find which one of them. And as others have said, the risk on altcoin investing is high as compare to bitcoin.And that's why majority here put their money on the line for BTC and then diversify their portfolio with several altcoins, those solid and not shitcoin and meme coin. The question is, would you take that risk or would you rather play it safe but still get a good profit and steady profit and not complicate things in your end?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "October 13, 2022, 08:43:14 PM",
      "body": "Quote from: JamesDaniel90 on October 13, 2022, 06:54:38 PMI watched a clip on Youtube earlier saying how Bitcoin is great however it is limited in terms of profit potential and it got me thinking if I should keep DCA into Bitcoin or sell it all and put into Altcoins that are likely to return much more over the next 2-3 years. I mean how high can Bitcoin realistically go in the next 2-3 years? £150k maybe which would be less then 10x compared to other altcoins that can 20-50x when the bull run returns.  And please don't forget that the same way an altcoin can go 20-50x in profit within a short while, so can it also fall 20-50x lost in price within that same short period of time. So never you forget that investing in these altcoins is a big risk, but if you know you are ready to take this risk, then go give it a try, and blame no one if the results don't go as planned. Because for me, Bitcoin remains the best investment option with a slow and steady reasonable reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uchegod-21",
      "created_time": "October 13, 2022, 10:54:44 PM",
      "body": "Quote from: Baofeng on October 13, 2022, 08:12:37 PMYes, there are altcoins that can really give you huge profit in the next bull run. But the problem is that it's hard to find which one of them. And as others have said, the risk on altcoin investing is high as compare to bitcoin.And that's why majority here put their money on the line for BTC and then diversify their portfolio with several altcoins, those solid and not shitcoin and meme coin. The question is, would you take that risk or would you rather play it safe but still get a good profit and steady profit and not complicate things in your end?It all depends on what works for you. Investment in altcoins is risky but not all altcoins. Eth, Bnb and some big altcoins will always be here. If you want more ROI you can go for them. But since I discovered that bitcoin drives the market and it is more safe, I have been buying as little bitcoin as I can, the mission is not to get super rich but to be safe against inflation and if I could get some more profits it is better. I am not good in researching coins, that is why I am cool with bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "landheer",
      "created_time": "October 13, 2022, 11:17:12 PM",
      "body": "what is certain is that the decision is yours, in my opinion it is better to invest in bitcoin because in bitcoin your assets will be safer, indeed by investing in altcoins when the market is bull run, the increase in altcoins is very high, it can even be up to 50 times , but the risk of a decline can also be up to 70 times the decline. and I speak according to my experience in bitcoin and crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "October 13, 2022, 11:40:41 PM",
      "body": "Quote from: VanillaH on October 13, 2022, 11:05:15 PMAll coins are highly speculative and risky, but Bitcoin remains my top choice!When it comes to risk then Bitcoin is no exemption which it could really be still risky but making itself to place on the top ranking of all the years of crypto existence then its a solid indication that it is really doing wellwhich you could really make yourself that confident on investing into it.Even though the returns or potential profits might really be the same just like before or into those early years but at least we could assureits potential that it would really be heading into that path or direction.Altcoins is alternative choice since there are people cant really be just contented on small returns or isnt really a fan on holding for long term thats why they do make out other choice which would preferably ending up with altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "October 14, 2022, 01:06:57 AM",
      "body": "Quote from: VanillaH on October 13, 2022, 11:05:15 PMAll coins are highly speculative and risky, but Bitcoin remains my top choice!Bitcoin is going to be a stablecoin now, I don't expect a couple of year ago, USDT and another stable coin is stable. But now after watching what happen in the market, I have got an argument if altcoin and stablecoin highly speculative, it's not true if we hold USDT aren't risk, because I believe it's more risk because fiat fluctuation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "October 14, 2022, 02:19:32 AM",
      "body": "Quote from: JamesDaniel90 on October 13, 2022, 06:54:38 PMJust wondering if everyone invests in Bitcoin or is it worth just focusing on strong altcoins that can 20-50x in the next few years?We do not know what investors do in investing. Between Bitcoin and Altcoins, I think many people choose Bitcoin as their investment without leaving Altcoins. And the Altcoins chosen for investment are also not all, only a few Altcoins that have good potential for 1 to 2 years are chosen for investment.Bitcoin is for me the best investment option. While Altcoins are full of uncertainty. But I would not advise you to deposit everything to invest in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "October 14, 2022, 02:24:34 AM",
      "body": "There is no ceiling for bitcoin’s price. Sky is the limit. Bitcoin may go above $100k or a million or even higher. It is because, it is not bitcoin going up. It is the dollar going down against bitcoin. Bitcoin is fundamentally the strongest the hardest money ever existed. The dollar has no chance against bitcoin in the long term. Don’t get confused just because jpow feeding the dollar with hard-on pills now. The dollar is dead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 14, 2022, 02:28:16 AM",
      "body": "Quote from: JamesDaniel90 on October 13, 2022, 06:54:38 PMor sell it all and put into Altcoins that are likely to return much more over the next 2-3 years. ..assuming you actually find altcoins that are going to give you returns. This is like the typical \"buy the S&P500 vs buy individual stocks\" argument. Which is a better decision would totally depend on if you're actually capable of making good picks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kro55",
      "created_time": "October 14, 2022, 02:40:33 AM",
      "body": "Quote from: JamesDaniel90 on October 13, 2022, 06:54:38 PMJust wondering if everyone invests in Bitcoin or is it worth just focusing on strong altcoins that can 20-50x in the next few years?. It is true that altcoins can be better than bitcoin, which can yield 20 times, 50 times or even 100 times profits but the problem is that we never know and are certain which alts will do it. We focus on the top 10 altcoins to reduce risk but they are not as safe as bitcoin offers. Do you remember Luna? being one of the top 10 coins with a market cap of $60 billion and collapsing in less than 2 weeks, it can be said that Luna reminded us of the fact that not every top coin is safe. In all market cycles, you can see the only thing is bitcoin is always on top, it always bounces back every down cycle, and the rest is still uncertain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 14, 2022, 03:10:13 AM",
      "body": "In terms of potential ROI, especially if you are looking at the short term, I have to admit that at this point in time certain altcoins are definitely better than Bitcoin. But, as I've always been saying, it's like finding a needle in a haystack. How many altcoins do we have now? How many of them have the potential to x10? Good luck hitting the right target. I'm not saying it's not possible, but I guess the possibility of you ending up having several dead altcoins in your wallet is much higher than you ending up picking the best ones. I'm not discouraging you, by the way. It's always better to explore further and do research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "October 14, 2022, 03:17:58 AM",
      "body": "Quote from: Darker45 on October 14, 2022, 03:10:13 AMIn terms of potential ROI, especially if you are looking at the short term, I have to admit that at this point in time certain altcoins are definitely better than Bitcoin.Problems with altcoins are: You can get high ROIs with them, higher than with Bitcoin in a few weeks, a few months; but when the trend is broken, you will lose more with altcoins. Another problem with altcoin investors is: they believe too much in altcoins and they hesitate to cut loss, to exit early. Therefore, when they get loss with altcoins, it should be -50%, -90% or even higher.QuoteBut, as I've always been saying, it's like finding a needle in a haystack. How many altcoins do we have now? How many of them have the potential to x10? Bitcoin and altcoins have correlation in market capital flow that moves around between Bitcoin and altcoins. It is reason we have Bitcoin season and altcoin season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "October 14, 2022, 03:38:22 AM",
      "body": "Quote from: aylabadia05 on October 14, 2022, 02:19:32 AM~~Bitcoin is for me the best investment option. While Altcoins are full of uncertainty. But I would not advise you to deposit everything to invest in Bitcoin.If you don't like to take risks and don't have too much experience choosing altcoins, then it wouldn't be a bad idea to invest everything in bitcoin. And if you can hold bitcoin for a long time like 5 years or 10 years, i believe that the ROI that bitcoin brings will not be inferior to what altcoins give you. Invest all in bticoin, I mean here we are just talking about investing in crypto, not about putting all assets in crypto without outside investments, what that shouldn't be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 14, 2022, 03:52:32 AM",
      "body": "Quote from: JamesDaniel90 on October 13, 2022, 06:54:38 PM(....)I know I have got into Bitcoin at a good price but just feel while altcoins are currently 85-95% down from all time high may be better making the most of that rather then being safe with Bitcoin and not seeing much return. I don't disagree with altcoins at all. But be careful with the altcoins you select, I highly suggest buying high market cap altcoins, and avoiding mid to small marketcap altcoins.And another thing is, Bitcoin is already proven over time, since the beginning, Bitcoin never disappoint us. So for me, always have Bitcoin in your bag, even you can say that the ROI is very low for Bitcoin now, but as long as you are safe, it's ok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "October 14, 2022, 03:56:33 AM",
      "body": "Quote from: tbct_mt2 on October 14, 2022, 03:17:58 AMQuote from: Darker45 on October 14, 2022, 03:10:13 AMIn terms of potential ROI, especially if you are looking at the short term, I have to admit that at this point in time certain altcoins are definitely better than Bitcoin.Problems with altcoins are: You can get high ROIs with them, higher than with Bitcoin in a few weeks, a few months; but when the trend is broken, you will lose more with altcoins. Another problem with altcoin investors is: they believe too much in altcoins and they hesitate to cut loss, to exit early. Therefore, when they get loss with altcoins, it should be -50%, -90% or even higher.Altcoins are not something you should stick and be loyal to. We have to be reminded that they come and go. They're usually short-lived. So they should only be treated as milking cows. When playing with altcoins, good entry and exit points should be well-plotted in advance. By the time a good profit is achieved, altcoins should be dumped as quickly as they're acquired. They shouldn't stay in wallets for long. After all, they're only there so that your Bitcoin value increases. Bitcoin is still the ultimate goal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "October 14, 2022, 04:06:10 AM",
      "body": "Quote from: JamesDaniel90 on October 13, 2022, 06:54:38 PMI mean how high can Bitcoin realistically go in the next 2-3 years? £150k maybe which would be less then 10x compared to other altcoins that can 20-50x when the bull run returns. Just wondering if everyone invests in Bitcoin or is it worth just focusing on strong altcoins that can 20-50x in the next few years?I know I have got into Bitcoin at a good price but just feel while altcoins are currently 85-95% down from all time high may be better making the most of that rather then being safe with Bitcoin and not seeing much return. It is your decision, we know there will be altcoins which will outperform bitcoin, the question is if you have the skill to pick the altcoins which will do this? If you have the skill then by all means buy those altcoins, hold them and enjoy your profits.But if you do not have this skill, and if you cannot do it you do not have to worry as you are not alone on this, then it is too risky to pick that strategy and you will obtain a better outcome by just buying bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}