{
  "id": "topic_5473633",
  "title": "Eclipse33",
  "author": "Eclipse33",
  "created_time": "November 10, 2023, 06:22:08 PMLast edit: November 18, 2023, 02:01:31 AM by Eclipse33",
  "content": "For auction is one of the coolest rainbow Monero variants produced by LEALANAThe piece for auction is a rainbow .10 XMR token, PCGS authenticatedLoaded and fully funded with 0.10 XMR/ This gem ships slabbed in a fresh and clear PCGS holder. Feeling like a Swiss bank-vault in the hand, coming in a 32 grams. This 2020 specimen of an original rainbow layered variant of the 2020 LEALANA monero series. The face of this coin shimmers and refracts light, unlike the standard coins issued within this series. Being one of the first three-hundred coins where RAINBOW layering has been applied by LEALANA. Crisp lines and Hawaiian aesthetics meet in a dashing compliment. Provoking feelings of security, durability and robustness. This coin has been encapsulated by the highly esteemed grading agency Professional Coin Grading Services located in Newport Beach California. On the obverse of the instrument can be noted an illustrious and highly complex holographic foil. A large M for monero can be noted shimmering hypnotically within the light. The hologram features several points of holographic refraction as well as dynamic points of tension and dissemination. Exuding an air of sophisticated calculation and cryptographic calibration.   - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - Due Diligence ✦ 🌈 ✦ PCGS verification here: https://www.pcgs.com/cert/47442290 ✦ 🌈 ✦✦ 🌈 ✦ Original sale thread: https://bitcointalk.org/index.php?topic=5308230.0 ✦ 🌈 ✦ Lot 1: #195, Mint condition, straight from a spy-thriller. Full public address: It's monero silly, there is no-way to see public addresses.Funded at LEALANA factory by Eclipse: Circa 2021.Monero is an advanced, state of the art privacy coin which scrambles transaction outputs, employs decoy addresses and encrypts the total amount sent within a transaction. Monero is private by default, yet still possesses the ability for a user to reveal a transaction if-so desired. Monero is the most actively used cryptocurrency on the international cyber-black market, beating bitcoin and lite-coin by a longshot. ---- In bitcoin we trust -----*Local rule: Please limit posts to bids or comments/questions about the item for auction.STARTING BID: 0.0001BTCMINIMUM BID INCREMENT: 0.0003 BTCEND TIME: FRIDAY NOVEMBER 17th, 2023, 9:00 UTC (Forum time) **Payment due within 24 hours of auction end!!**SNIPE: Any bid made in last 5 minutes will extend the auction 5 minutes beyond the ending time.If within those 5 extended minutes, a new bid is made, 5 minutes will be added to the auction from the time of that bid.PAYMENT: Bitcoin BTC SHIPPING: Based on location and preference",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473633",
  "comments": [
    {
      "author": "DabsPoorVersion",
      "created_time": "November 10, 2023, 08:19:33 PM",
      "body": "0.0001BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StackItUp",
      "created_time": "November 11, 2023, 12:15:03 AM",
      "body": "0.00123BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rsincognito",
      "created_time": "November 11, 2023, 12:40:40 PM",
      "body": "Quote from: StackItUp on November 11, 2023, 12:15:03 AM0.00123BTC@StackItUp,  reading the original bitcointalk sale link of these coins and your comments back and forth was hilarious. Lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "StackItUp",
      "created_time": "November 11, 2023, 02:22:35 PM",
      "body": "Quote from: rsincognito on November 11, 2023, 12:40:40 PMQuote from: StackItUp on November 11, 2023, 12:15:03 AM0.00123BTC@StackItUp,  reading the original bitcointalk sale link of these coins and your comments back and forth was hilarious. Lol. maybe i was bad at explaining back then.You know what was hilarious?this:\"Set #'s are randomly selected. Coin numbers in a particular set will be of the same random number.\" and that the maker charged 350$ extra to let you select numbers. Or... as more you buy as larger is the premium. Should be vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rsincognito",
      "created_time": "November 11, 2023, 04:43:08 PM",
      "body": "Let it go bro. Let it go…….. lolP.S.   beautiful coin Eclipse33 ! 🤠",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "November 12, 2023, 01:29:59 AM",
      "body": "Maybe I missed it , but does this come with the associated digital certificate with view key etc?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SurfinPanda",
      "created_time": "November 17, 2023, 05:56:10 PM",
      "body": "0.0016",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}