{
  "id": "topic_5398452",
  "title": "feisar",
  "author": "feisar",
  "created_time": "May 13, 2022, 08:32:52 AM",
  "content": "Καλημέρα, θέλω να ρωτήσω κάτι σχετικά με το exodus wallet (αν γνωρίζει κάποιος εμπειρικά). Το κατέβασα σήμερα για να μεταφέρω κάποια coins από τα Ανταλλακτήρια, αλλά διαπίστωσα τα εξής περίεργα:αφενός δεν μου έδωσε τις 12 λέξεις κλειδιά κι αφετέρου δεν μου ζήτησε να βάλω password 😖 είναι φυσιολογικό αυτό; έχω άλλα 2 πορτοφόλια και για να ανοίξουν θέλουν login με κωδικό, ενώ μου είχαν δώσει και την secret recovery phrase εξαρχής, εδώ τίποτα! όποιος θέλει το ανοίγει και μπαίνει ελεύθερα...Ευχαριστώ εκ των προτέρων",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398452",
  "comments": [
    {
      "author": "BlackHatCoiner",
      "created_time": "May 13, 2022, 08:48:11 AM",
      "body": "Quote from: feisar on May 13, 2022, 08:32:52 AMαφενός δεν μου έδωσε τις 12 λέξεις κλειδιάΔημιούργησες νέο πορτοφόλι και δεν σου έδωσε τις λέξεις ή προσπάθησες να κάνεις export τη φράση από ένα ήδη υπάρχον πορτοφόλι; Επίσης, υπάρχει κάποιος συγκεκριμένος λόγος που έχεις επιλέξει Exodus; Το πρόγραμμα είναι κλειστού κώδικα και είναι, επομένως, ενάντια της διαφάνειας, που είναι βασική αρχή σε αυτόν τον τομέα.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "feisar",
      "created_time": "May 13, 2022, 08:56:57 AM",
      "body": "Αμάν! καλά που δε πρόλαβα να μεταφέρω  Λες να προτιμήσω κάποιο άλλο; Έχω coinomi και atomic αλλά δεν έχουν όλα τα νομίσματα. Το κατέβασα επειδή έκανα μια έρευνα και είδα ότι θεωρείται πολύ αξιόπιστο (στα 5 καλύτερα). Δε ξέρω βέβαια τι σημαίνει κλειστού κώδικα. Ποιό θα μου πρότεινες;Τώρα όσον αφορά αυτό που ρωτάς, μετά το download άνοιξε χωρίς να μου δώσει τα κλειδιά, ούτε password ζήτησε να βάλω! Μου φαίνεται πολύ περίεργο γιατί είναι τα 2 βασικότερα πράγματα στα wallets. Το έκλεισα το ξανάνοιξα, πάλι τα ίδια. Υποπτεύομαι μήπως δεν έγινε καλό κατέβασμα (παρότι από την επίσημη σελίδα) και θέλει απεγκατάσταση;",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 13, 2022, 09:18:23 AM",
      "body": "Quote from: feisar on May 13, 2022, 08:56:57 AMΑμάν! καλά που δε πρόλαβα να μεταφέρω  Λες να προτιμήσω κάποιο άλλο;Κοίτα, εάν έχεις διάφορα κρύπτος και αισθάνεσαι ασφαλής κρατώντας τα, γιατί εγώ προσωπικά δεν θα αισθανόμουν, σου προτείνω να αγοράσεις ένα hardware wallet όπως, πχ Trezor. Το Trezor είναι ανοιχτού κώδικα και υποστηρίζει πολλά altcoins. Είναι η πιο ασφαλής επιλογή που έχεις, καθώς οι υπογραφές των συναλλαγών δεν γίνονται στο PC σου, κι άρα δεν διατρέχεται ο κίνδυνος κλοπής κλειδιών από malware. Το αρνητικό είναι πως κοστίζει πάνω από 50 ευρώ (το Trezor One 85.56 EUR), αλλά μικρή η σημασία αν μιλάμε για μεγάλης αξίας κρύπτος. Προσωπικά δεν θα το προτιμούσα κι από θέμα ιδιωτικότητας, αλλά δεν ισχύει στην περίπτωση σου που έχεις ήδη δώσει KYC (υποθέτω) σε ανταλλακτήρια.Quote from: feisar on May 13, 2022, 08:56:57 AMΈχω coinomi και atomic αλλά δεν έχουν όλα τα νομίσματαΜακριά απ'το Coinomi. Έχει πιαστεί να στέλνει seed phrases (plain text!) σε εξωτερικό server. Επίσης κλειστού κώδικα με ύπουλους προγραμματιστές. Το atomic είναι επίσης κλειστού κώδικα, αλλά πέρα από αυτό, δε θα εμπιστευόμουν κανέναν developer που θα έκανε τέτοια δήλωση:Quote from: atomicwalletHey! Atomic Wallet utilizes many open-source components, like libraries, block explorers and so forth. We put a lot of effort and time to provide a good quality, reliable product for everyone. However, we keep part of our development in secret, in order to protect our users and ourselves from scammy copycats, phishing and bootleg applications.Quote from: feisar on May 13, 2022, 08:56:57 AMΔε ξέρω βέβαια τι σημαίνει κλειστού κώδικα.Σημαίνει πως δεν μπορείς να διαβάσεις τι κάνει το software. Εάν το software είναι open-source (ανοιχτού-κώδικα) μπορείς να διαβάσεις κάθε γραμμή, κάθε αρχείο, κάθε σχόλιο στον κώδικα. Μπορείς να επιβεβαιώσεις πως αυτό που σου λέει είναι. Αντίθετα, ένα κλειστού κώδικα πρόγραμμα δεν μπορείς να εξετάσεις αν συμπεριφέρεται κακόβουλα (π.χ., αν στέλνει private keys σε server, αν παράγει κλειδιά εντός ενός μικρού εύρους αριθμών, αν χρησιμοποιεί αδύναμη κρυπτογραφία κ.α).Προσωπικά θεωρώ λάθος να λέμε ένα κλειστού-κώδικα wallet software \"non-custodial\", αφού δεν ξέρεις αν κάποιος άλλος έχει πρόσβαση. Quote from: feisar on May 13, 2022, 08:56:57 AMΥποπτεύομαι μήπως δεν έγινε καλό κατέβασμα (παρότι από την επίσημη σελίδα) και θέλει απεγκατάσταση;Αλήθεια δεν έχω ιδέα. Πρόσεξε όμως πως αν κάνεις απεγκατάσταση χωρίς να έχεις backup, τα έχασες τα χρήματα.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "feisar",
      "created_time": "May 13, 2022, 10:31:16 AM",
      "body": "Καταρχήν σ' ευχαριστώ πάρα πολύ για την απάντηση και τις πληροφορίες. Ειδικά όσα λες για coinomi και atomic πολύ χρήσιμα!Αν εξαιρέσουμε τα 2 hardware (trezor & ledger) από hot wallets ποιό θα πρότεινες; (για desktop, όχι για κινητό).Quote from: BlackHatCoiner on May 13, 2022, 09:18:23 AMΑλήθεια δεν έχω ιδέα. Πρόσεξε όμως πως αν κάνεις απεγκατάσταση χωρίς να έχεις backup, τα έχασες τα χρήματα.Όχι ευτυχώς, όπως είπα ήδη, δεν πρόλαβα να κάνω κάποια μεταφορά. Uninstall και τέλος.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 13, 2022, 11:35:46 AM",
      "body": "Quote from: feisar on May 13, 2022, 10:31:16 AMΑν εξαιρέσουμε τα 2 hardware (trezor & ledger) από hot wallets ποιό θα πρότεινες; (για desktop, όχι για κινητό).Αυτό είναι ένα από τα πολλά προβλήματα με τα altcoins, κάθε ένα έχει και δικό του software. Δεν έχω ασχοληθεί ιδιαίτερα, αλλά γνωρίζω πως εάν δε θέλεις να αγοράσεις hardware wallet μπορείς να εγκαταστήσεις το software του Trezor στο PC σου. (Trezor Suite)Φυσικά δεν θα έχει την ίδια ασφάλεια, αλλά τη θεωρώ καλύτερη επιλογή από Exodus, Coinomi, Atomic. Πόσο μάλλον από το να τα αφήσεις στο exchange. Γενικά όμως αν κατέχεις altcoins, χάνεις από κάπου, είτε είναι ασφάλεια, είτε είναι ιδιωτικότητα (δεν τρέχεις full node για κάθε alt), είτε είναι οικονομική χειραγώγηση.Σημείωση: Το Trezor έχει ανοιχτό software και firmware.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "feisar",
      "created_time": "May 13, 2022, 11:57:55 AM",
      "body": "Και πάλι σ' ευχαριστώ για τις συμβουλές και τον χρόνο σου",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "May 13, 2022, 11:00:42 PM",
      "body": "Quote from: feisar on May 13, 2022, 10:31:16 AMΌχι ευτυχώς, όπως είπα ήδη, δεν πρόλαβα να κάνω κάποια μεταφορά. Uninstall και τέλος.Format να κάνεις...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr1000",
      "created_time": "June 21, 2022, 03:04:15 PM",
      "body": "Quote from: feisar on May 13, 2022, 10:31:16 AMΌχι ευτυχώς, όπως είπα ήδη, δεν πρόλαβα να κάνω κάποια μεταφορά. Uninstall και τέλος.Άλλαξε υπολογιστή",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}