{
  "id": "topic_5452161",
  "title": "The Cryptovator",
  "author": "The Cryptovator",
  "created_time": "May 09, 2023, 09:49:02 PM",
  "content": "Have you observed the significant number of project launches featuring the name \"PEPE\"? If you check the recently added list on CoinMarketCap, you'll notice that approximately 90% of the project names include \"pepe.\" Lately, meme coins have been experiencing a remarkable surge in market capitalization. What are your thoughts on meme coins and the prevailing trend of pepe-related projects? Personally, I wasn't initially a fan of meme coins, but it appears that they have gained considerable hype. I'm curious to know your opinion on meme coins as well. Have you invested in any of them?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452161",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "May 09, 2023, 09:58:22 PM",
      "body": "Quote from: The Cryptovator on May 09, 2023, 09:49:02 PMHave you observed the significant number of project launches featuring the name \"PEPE\"? If you check the recently added list on CoinMarketCap, you'll notice that approximately 90% of the project names include \"pepe.\" Lately, meme coins have been experiencing a remarkable surge in market capitalization. What are your thoughts on meme coins and the prevailing trend of pepe-related projects? Personally, I wasn't initially a fan of meme coins, but it appears that they have gained considerable hype. I'm curious to know your opinion on meme coins as well. Have you invested in any of them?This was already in expectation earlier than now, and as soon as the PEPE gained ground and started trending, it did not even take up to 2 days before there were already all sorts of PEPE this and PEPE that. This is what actually happens when any new meme coin gains popularity: others want to use the influence of that exact coin to make something out of it, which actually doesn't last for long, just like what happened with Dogecoin, Shiba Inu, and many others when those coins became talk of the town and all their names began being featured in other shit coins (mememes), which actually don't have any really fundamental other than trying to use the hype from the others.My taught on this is that we should try as much as we can to avoid this kind of coin because the project owners might actually be out there to rug pull. In as much as we are all trying to make profit from every little trade, we should also exercise caution when doing so. Now that Pepe has been listed on Binance, we will definitely see more of the name, like Pepe Swap, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "May 09, 2023, 10:56:04 PM",
      "body": "This is nothing new. Remember when the meme coins that started from Dogecoin to Shiba INU and then there goes the series of these projects that have ended up their names with INU?And the same goes with the Bitcoin forks that have been also troublesome for many for the past years. These trending names will always be attached made by the developers if the project has become successful at its launching time. I'll keep myself from these projects or else I'll be stuck in the midst of it and eventually incur losses that can't be recovered anymore from these projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lobo13hf",
      "created_time": "May 09, 2023, 11:37:29 PM",
      "body": "they are just trying to ride the fame train, there's nothing innovative about them it's just they used the name of already popular meme coin and such trend has been going on for long, remember doge? and shiba? it's the same thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "May 10, 2023, 12:01:56 AM",
      "body": "Like many have said, such occurrence is truly normal, always following other steps in order to gain the same success but we all know they gonna hardly get some success, at best it's just fraction of that success.more over not only like that, these coin are more likely to be deploying their token across many blockchain, everytime there's new blockchain surfacing, especially layer 2 blockchain these meme coin will definitely flock into it and create their own token, not that I have problem with their speculative nature though, sometime it's really good investing in these meme coin only at early stage but in the end there are still too much meme coin generated everyday. everyone just wanna become rich by deploying their own coin and then buying it at very first phase since they are the ones that's most likely adding the liquidity towards the platform like uniswap and then gain masive increase in investment after their coin become more popular.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoiNGhosT89",
      "created_time": "May 10, 2023, 12:37:45 AM",
      "body": "These types of projects in my opinion are still just popular and speculation that are not sustainable in the long term, there will be those who manage to make a profit but I think they are high risk for the majority of crypto-investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "May 10, 2023, 02:15:58 AM",
      "body": "Quote from: The Cryptovator on May 09, 2023, 09:49:02 PMHave you observed the significant number of project launches featuring the name \"PEPE\"? If you check the recently added list on CoinMarketCap, you'll notice that approximately 90% of the project names include \"pepe.\" Lately, meme coins have been experiencing a remarkable surge in market capitalization. What are your thoughts on meme coins and the prevailing trend of pepe-related projects? Personally, I wasn't initially a fan of meme coins, but it appears that they have gained considerable hype. I'm curious to know your opinion on meme coins as well. Have you invested in any of them?These people behind the project was just riding the hype and following along the trend. The main goal is to make profit out of this hype - so that makes these projects very risky to invest. The main reason why projects like these surfaced, is because people loves to put their money to something that could potentially make them rich overnight. Meme coins are community driven tokens that are capable of pumping a huge percentage overnight and could go the other way around as quickly as it got up. Kind of interesting but then again very risky because you could lose your money in a matter of hours when the hype die down and people starts selling. That's enough reason for me to keep off these new meme coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "May 10, 2023, 04:02:55 AM",
      "body": "Not only in coinmarketcap, but there's someone create a similar meme coin in this forum named PEPA PEPA; MEMECOIN WITH SOME ETHICAL SUBSTANCE, definitely copy pasting from PEPE coin because the sudden hype and the developer want to get rich quick scheme. Although PEPE coin is already a shitcoin, but the other coins which want to copy PEPE is no more than a garbage.I don't invest in meme coins because the fees is high, so in order to make a profit, you need to spend a good amount of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "May 10, 2023, 11:14:10 AM",
      "body": "Quote from: The Cryptovator on May 09, 2023, 09:49:02 PMHave you observed the significant number of project launches featuring the name \"PEPE\"? If you check the recently added list on CoinMarketCap, you'll notice that approximately 90% of the project names include \"pepe.\" Lately, meme coins have been experiencing a remarkable surge in market capitalization. What are your thoughts on meme coins and the prevailing trend of pepe-related projects? Personally, I wasn't initially a fan of meme coins, but it appears that they have gained considerable hype. I'm curious to know your opinion on meme coins as well. Have you invested in any of them?No, I just invested on solid altcoins, like ETH, BNB, ADA and a couple. I'm not into this whole meme coins or those who are purely for hype, pump and dump. I have nothing against those who like to play with their money on this kind of projects.But not me, I prefer stable and solid investment of money. I might not be risking here, but it's too much for me to hunt this meme coins and then join the bandwagon for the money. And for those who are into \"pepe\" right now and making money, then good for you. But hopefully you also know that you are taking a big risk as I have read that a lot of investors are losing money specially if you have invested on top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "May 10, 2023, 01:14:13 PM",
      "body": "Quote from: The Cryptovator on May 09, 2023, 09:49:02 PMHave you observed the significant number of project launches featuring the name \"PEPE\"? If you check the recently added list on CoinMarketCap, you'll notice that approximately 90% of the project names include \"pepe.\"Cryptocurrency market is fulled with scam projects that are trendy.Years ago with massive success of Shiba Inu meme coin, many tokens were created with their token names as \"XYZ Inu\". I used Coinmarketcap to search tokens with Inu in their names, the list is about 100 projects. Insanely crazy that how scammers can launch their projects with viral names.After Shiba Inu, the market has PEPE and again we are witnessing their repeated scam method. They add no value, no better use case for their projects and tokens, just use open-source, change token name, token specifications, tokenomics and launch their new projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bussybuddy",
      "created_time": "May 10, 2023, 01:25:51 PM",
      "body": "One of the best ways to capitalize on hype from stereotypical developers, I find it funny, maybe because I really don't care too much about the appeal of pepe or related memecoins at this stage. So I feel the current market is quite funny. The inflated shoddy things just need to rely on some virtual community factor to support, the price will fluctuate wildly, many people are enjoying the current short-term happiness but forgetting that we have No matter how difficult many attempts at product development are to fail in this environment. For me the criteria of looking at memecoin are really very negative and it is not attractive for me to take risks, I want to enter this market exactly as I thought about saying all the fluctuations around will not influence the long-term strategy and outlook on bitcoin and top altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "May 10, 2023, 01:36:11 PM",
      "body": "One example of so many copy cat projects out there. Most of the project like this is just created to join the wave of hype and to profit out from the trend. Almost everyone who is interested in the copy cat coin don't even care about the development or utility of project, It's just for show given that it happened a lot of time. Clone projects like this don't really have a project output. Never ever invest on it for a long term thinking, Majority of the one who posses this coins just want to flip it for profit. I think this kind of project is what makes crypto get a bad image given that newbies are t he one who are getting victimized by this. There are even phishing or malicious projects that copied a part of a name of a trending coin just to attract victims.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "May 10, 2023, 01:58:53 PM",
      "body": "Quote from: The Cryptovator on May 09, 2023, 09:49:02 PMHave you observed the significant number of project launches featuring the name \"PEPE\"? If you check the recently added list on CoinMarketCap, you'll notice that approximately 90% of the project names include \"pepe.\" Lately, meme coins have been experiencing a remarkable surge in market capitalization. What are your thoughts on meme coins and the prevailing trend of pepe-related projects? Personally, I wasn't initially a fan of meme coins, but it appears that they have gained considerable hype. I'm curious to know your opinion on meme coins as well. Have you invested in any of them?Isn't it just the hypetrain? The origin, PEPE coin, was in the highlights of the altcoin market afaik. No idea honestly how it happened (and I have no plans on trying to figure it out), but seeing as it made the headlines, I reckon a lot of projects are trying to ride the seemingly foundation-less wave and try to profit off of whatever they can. I don't really consider this a \"trend\" of sorts, it's probably just a temporary hype for the coin itself. Meme coins aren't exactly anything new as well, idk what happened with the PEPE investors but they hyped the train pretty well to the point where even regular investors wanted to have a bite. I haven't lately, I mean I did buy SHIB in the past, but I don't actively look for them nor try to ride in any \"hypes\" like this one, or like what Elon did with doge. I just avoid it like a plague. Sure, it can give a LOT if you get lucky, but that's the thing, it's all about luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "May 10, 2023, 02:02:48 PM",
      "body": "For me, it is nothing more than a pumping/dumping coin and a new trend to steal the money of beginners who invest in something new for nothing but that the name is new and everyone is talking about it.I am almost certain that the percentage of investment in a currency will increase if it changes its name with every trend and pays a lot in promotional campaigns. No one thinks about the code, future development, or the real interest.The names are different, the goal is the same. MEME PEPE KEKE ZEZE ....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FahriZah",
      "created_time": "May 10, 2023, 06:32:37 PM",
      "body": "Absolutely yes new coin pepe now trending but at the moments so many scam pepe project attended in the market and so many fake meme community created also telegram and twitter have fake pepe page lots of scammers doing this types of work but who want to find out real pepe community they're need properly study and find a real pepe community twitter and telegram please don,t wast your money with fake pepe project and remember always any real admin/moderators never send you DM first on Telegram just keep remembering for your best think with Proper study.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "May 10, 2023, 09:25:08 PM",
      "body": "Quote from: The Cryptovator on May 09, 2023, 09:49:02 PMHave you observed the significant number of project launches featuring the name \"PEPE\"? If you check the recently added list on CoinMarketCap, you'll notice that approximately 90% of the project names include \"pepe.\" Lately, meme coins have been experiencing a remarkable surge in market capitalization. What are your thoughts on meme coins and the prevailing trend of pepe-related projects? Personally, I wasn't initially a fan of meme coins, but it appears that they have gained considerable hype. I'm curious to know your opinion on meme coins as well. Have you invested in any of them?I was trying to understand this situation and all I got is DOUBTs. A project that was created for Hyped is impossible to stay long in the market because, after that, it drops drastically without a chance of coming back or recovery, they'll turn shitcoins already. Dogecoins and Shiba Inu are known among meme coins that are considered a little bit reliable, not I say they are worth investing but as we can see these coins competitive among others and still gain popularity in the crypto market. But about Pepe, I'd better not try...let us see what will happen after the hype",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittick",
      "created_time": "May 10, 2023, 09:42:05 PM",
      "body": "you'll be surprised how many projects are there across various blockchain that's using this name, there's simply too many and everyday they are keep being generated and generated and what makes me wonder is that, these coins still have some people that supported it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "May 10, 2023, 09:43:15 PM",
      "body": "Quote from: lobo13hf on May 09, 2023, 11:37:29 PMthey are just trying to ride the fame train, there's nothing innovative about them it's just they used the name of already popular meme coin and such trend has been going on for long, remember doge? and shiba? it's the same thing.Its a meme token season again, most probably they will grab this opportunity to attract investors and make money, sooner or later when the hype is over then you will see most of these meme token will start to dump that much. With PEPE i think it will ended up with the same faith, so enter early now and make sure to take profit before its too late, meme token seems the trend right now, wait until its over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lobo13hf",
      "created_time": "May 10, 2023, 09:44:07 PM",
      "body": "there are indeed many of them but i'd definitely not gonna invest in any one of them, first reason is that they are just trying to copy existing coin.second reason being, there are more likely higher chance of them being created by some scammers, just stick with the original.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "May 10, 2023, 09:44:13 PM",
      "body": "Quote from: The Cryptovator on May 09, 2023, 09:49:02 PMHave you observed the significant number of project launches featuring the name \"PEPE\"? If you check the recently added list on CoinMarketCap, you'll notice that approximately 90% of the project names include \"pepe.\" Lately, meme coins have been experiencing a remarkable surge in market capitalization. What are your thoughts on meme coins and the prevailing trend of pepe-related projects? Personally, I wasn't initially a fan of meme coins, but it appears that they have gained considerable hype. I'm curious to know your opinion on meme coins as well. Have you invested in any of them?It will be short-lived tbh, the hype was still there considering an enormous amount of people made millions of dollars when they ape in on the project when its market cap was still low. The point is, the only people getting rich on this are the founders, imagine if they dump it on retails, that would be a catastrophic blow. If ever I'll invest in it, I'll not put thousand of dollars in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}