{
  "id": "topic_5407727",
  "title": "PowerGlove",
  "author": "PowerGlove",
  "created_time": "July 26, 2022, 10:08:27 PMLast edit: July 27, 2022, 06:38:28 AM by PowerGlove",
  "content": "I've only been on Bitcointalk for about a month, so I'm not aware of the history.I noticed that an old ban notice was bumped and some of his recent posts have been deleted.I just want to say that although franky1 posts a little too much for my liking, and his posts are not the easiest to read, they often contain useful points.Maybe I haven't been exposed to his posts for long enough to find them grating, but I'll miss his direct/no-bullshit takes on things.I'll admit that I've never bothered to fact-check any of his posts.Can anyone give me a quick history lesson?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407727",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "July 26, 2022, 10:25:05 PM",
      "body": "Quite surprising that you knew franky1 was banned from development and technical discussion and you did not know the reason why.Started from here: Ban request for user: franky1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "July 26, 2022, 10:35:50 PM",
      "body": "You may also get some clues from his trust profile (Check through trusted, untrusted and send feedback) - https://bitcointalk.org/index.php?action=trust;u=65837I personally don't want to know how the saga started as it seems to be a long trail of disagreements, accusations and counteraccusations. It probably began before my existence in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rizzrack",
      "created_time": "July 26, 2022, 10:39:50 PM",
      "body": "Quote from: PowerGlove on July 26, 2022, 10:08:27 PMI'll admit that I've never bothered to fact-check any of his posts.franky1 is a very smart guy !But has a tendency to make statements where he is wright 98% but the other 2% is way off and changes the whole concept of the idea. And reaches some different result due to that small \"wrong concept\" and argues about it regardless what others try to explain. Topics range from difficulty to lightning network and everything in between.Read the first page: Luke Jr's HARDFORK proposal debunked (just a random example)If you ask me it's a shame... but yeah... it is what it is.Quote from: Charles-Tim on July 26, 2022, 10:25:05 PMQuite surprising that you knew franky1 was banned from development and technical discussion and you did not know the reason why.This thread was recently bumped...  Note: franky1 is banned from the this subforum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "July 26, 2022, 11:01:52 PM",
      "body": "Most of the negative feedback he got is not valid to me.People shouldn't be tagged for their opinion, nor banned. At least, allowing anyone to share an opinion is how a democratic system should work. If you don't like what a user has to say, ignore or debate but don't tell him to shut up. Otherwise, it's acting a bit like a dictatorship in which you have 'to obey' a group and their ideologyI agree with the majority of his speeches and prefer a lot reading his comments more than the shitpost here and there, but even if I was 'anti-franky1', I wouldn't say he should be banned..Fortunately IRL in politics, you can't do like bitcointalk does. People here have double standards,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "July 27, 2022, 07:15:52 AM",
      "body": "Quote from: Rizzrack on July 26, 2022, 10:39:50 PMfranky1 is a very smart guy !But has a tendency to make statements where he is wright 98% but the other 2% is way off and changes the whole concept of the idea. And reaches some different result due to that small \"wrong concept\" and argues about it regardless what others try to explain. Topics range from difficulty to lightning network and everything in between.While I disagree with some of his takes, I think he's smart as well. I just noticed that with market/economy-related topics, he tends to be kinda tinfoil hat ish with some of his takes.But regardless — one thing's for sure, he's definitely using his brain a lot, even if he's a bit too much into making \"theories\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 27, 2022, 08:31:12 AM",
      "body": "As a newbie on the forum, Franky1 was one of those guys who I really admired and loved to read his posts on Bitcoin discussion board, even though I barely understood 60% of that he talked about.I found him to be very knowledgeable and technical. I dare say in the early days (before the feedbacks and ban) they used to post on different boards around the forum, as opposed to now when Franky1 frequents few boards.Quote from: LeGaulois on July 26, 2022, 11:01:52 PMPeople shouldn't be tagged for their opinion, nor banned. At least, allowing anyone to share an opinion is how a democratic system should work. If you don't like what a user has to say, ignore or debate but don't tell him to shut up. Otherwise, it's acting a bit like a dictatorship in which you have 'to obey' a group and their ideologyTagging the account does not necessarily shut them up, it's just a heads up to other members that they should not simply swallow whatever content put out, especially as newer members judge who to listen to based on rank and merits.Banning is a different subject.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 27, 2022, 08:32:17 AM",
      "body": "I put him on my ignore list, because he knows a lot, yes, but just as he gives you walls of text about things he is right, he gives you walls of text about things he is not right and he is constantly entrenched in his position.An example in this thread: Quote from: Poker Player on April 01, 2022, 05:49:18 AMAlso: PLEASE REALIZE THAT franky's ARGUMENTS ARE GARBAGE. As they are based on a former draft on a slightly different subject, that didn't pass, as I've shown on page 2. And when he argues, he changes your argument and counterargues against something you had not said, which happened to me debating with him before in other threads. So for me the solution was to put him on my ignore list. Without acrimony and without having anything personal against him.Quote from: LeGaulois on July 26, 2022, 11:01:52 PMMost of the negative feedback he got is not valid to me.For me neither, those referring to his opinions or how he argues should be neutral in color, even if they are negative in spirit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 27, 2022, 09:04:44 AM",
      "body": "See this post: https://bitcointalk.org/index.php?topic=5193489.msg52782685#msg52782685. He has a pathological inability to stay on topic, and derails every thread in to an argument about his pet peeves - Lightning, Core, block sizes, etc.Quote from: LeGaulois on July 26, 2022, 11:01:52 PMPeople shouldn't be tagged for their opinion, nor banned.I agree with this completely, but he wasn't banned for having a different opinion - he was banned for constantly derailing threads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rizzrack",
      "created_time": "July 27, 2022, 10:44:12 AM",
      "body": "Quote from: PowerGlove on July 26, 2022, 10:08:27 PMCan anyone give me a quick history lesson?History may be slightly different, depending which party is telling it and is continuously been written: https://bitcointalk.org/index.php?topic=5407547.msg60637752#msg60637752",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PowerGlove",
      "created_time": "July 27, 2022, 04:02:58 PM",
      "body": "Quote from: o_e_l_e_o on July 27, 2022, 09:04:44 AMSee this post: https://bitcointalk.org/index.php?topic=5193489.msg52782685#msg52782685. He has a pathological inability to stay on topic, and derails every thread in to an argument about his pet peeves - Lightning, Core, block sizes, etc.@o_e_l_e_o: Thanks for finding that post, that helps me understand the issue. I wish he could marshal his thoughts a bit better, because he seems like a really smart guy, with lots of value to add.Quote from: Rizzrack on July 27, 2022, 10:44:12 AMHistory may be slightly different, depending which party is telling it and is continuously been written: https://bitcointalk.org/index.php?topic=5407547.msg60637752#msg60637752  @Rizzrack: Thanks for linking to that post, it's nice to see his side.I think he made an interesting point (about overreach, and \"protectionist\" mindsets) because one[1] of his recently deleted posts (which I merited) was mostly on-topic (I think) but included criticisms of the Core dev team and corporate sponsorships. Assuming everything he said was true (to the best of his knowledge) then I can't see why it was deleted (when compared to any of his other posts in that topic).I'm not advocating on his behalf, just trying to understand.He does tend to fill threads up with big walls of text, and that can hurt discussion (especially in Dev & Tech).I don't know, I guess I'm for this \"ban\" in practice, but against it in theory.[1] https://loyce.club/archive/posts/6063/60633183.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "July 27, 2022, 10:04:26 PMLast edit: July 27, 2022, 11:41:08 PM by LeGaulois",
      "body": "Quote from: o_e_l_e_o on July 27, 2022, 09:04:44 AMQuote from: LeGaulois on July 26, 2022, 11:01:52 PMPeople shouldn't be tagged for their opinion, nor banned.I agree with this completely, but he wasn't banned for having a different opinion - he was banned for constantly derailing threads.Derailing is subjective and relative to each individual's opinion. In his case,it wasn't even a consensus. If some people find it bothering, it is not the opinion of everyone. In long discussions it is inevitable to go off topic but on forums rare are pepole truly derailing a discussion. If a person is not able to argue against @franky1's opinions that is another problem and in that case perhaps the problem is with the person and not @franky1?Then following this logic, in that case we should also consider all those shitposters derailing the topics because it pollutes the discussions. Or should we even move all these useless topics in the 'beginners and help' section because it derails the primary function of this section.What's funny is with people who ususally like to make 'scandals' in the 'Reputation' section for tags wrongly given etc, but when the red trust is given by some users, you never see them shouting.what brave guys...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 27, 2022, 11:26:38 PM",
      "body": "Quote from: LeGaulois on July 26, 2022, 11:01:52 PMPeople shouldn't be tagged for their opinion, nor banned. At least, allowing anyone to share an opinion is how a democratic system should work.Agreed, and I argued strenuously for not banning franky1 in that thread from January....but I guess he did wind up getting banned, which I don't think I was aware of.  You know, there's been a push to have social media sites control \"misinformation\", and I think that really heated up during the pandemic, and now it's reached a point where Youtube will demonetize any video where \"COVID\" is uttered, along with a list of other words they must have provided to their content creators, because now when I watch videos words are constantly being either omitted or bleeped out, and it's annoying as fuck.Is that what we want on bitcointalk?  Do we really want gatekeepers of the truth safeguarding....whoever?  I mean Jesus, this is bitcoin.  You have to be responsible for yourself, that's a huge aspect of what crypto is all about--and the forum ought to reflect that, IMO.  We don't even ban scammers here, for Christ's sake.  Why ban someone who's unpopular because of what he writes?  I don't get it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "July 28, 2022, 12:06:00 AM",
      "body": "Quote from: Charles-Tim on July 26, 2022, 10:25:05 PMQuite surprising that you knew franky1 was banned from development and technical discussion and you did not know the reason why.Started from here: Ban request for user: franky1I am afraid. You are not 100% right. The thread you refer to was created by BlackHatCoiner on January 05, 2022. But, Look at this thread which is created by Moderator gmaxwell on October 15, 2019. This means franky1 was banned from the Development and technical discussion sub-board on the same date or earlier.Quote from: The Pharmacist on July 27, 2022, 11:26:38 PMAgreed, and I argued strenuously for not banning franky1 in that thread from January.But, He was already banned from the Development and technical discussion sub-board since October 15, 2019.Quotebut I guess he did wind up getting banned, which I don't think I was aware of. Actually you were aware of that;Quote from: https://bitcointalk.org/index.php?topic=5193489.msg52782219#msg52782219Thanks for clarifying that--I saw this thread and almost slapped my head in amazement.  Even some of the worst trolls here don't usually get banned, much less long-time members who frequently go off-topic, go on rants, or state opinions that aren't popular. I didn't realize members could be banned from specific sections.  That's good to know.Also, I think you can be confused because once theymos replied that:Quote from: https://bitcointalk.org/index.php?topic=5193489.msg52782026#msg52782026franky1 was not and is not banned. I see that some off-topic posts of his were deleted recently, though normally his posts are pretty substantive (even if I usually disagree with him).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "July 28, 2022, 12:29:48 AM",
      "body": "Quote from: o_e_l_e_o on July 27, 2022, 09:04:44 AMSee this post: https://bitcointalk.org/index.php?topic=5193489.msg52782685#msg52782685. He has a pathological inability to stay on topic, and derails every thread in to an argument about his pet peeves - Lightning, Core, block sizes, etc.Quote from: LeGaulois on July 26, 2022, 11:01:52 PMPeople shouldn't be tagged for their opinion, nor banned.I agree with this completely, but he wasn't banned for having a different opinion - he was banned for constantly derailing threads.yeah but being against lightning could be fully correct.which would mean all that disagreed with him possibly are ruining btc which actually goes well beyond bitcointalk.but maybe he is wrong and should be,banned in that section.I think 🤔 he may be correct ,but at my age I will likely be dead when lightning effectively has killed off btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "July 28, 2022, 12:39:38 AM",
      "body": "Quote from: philipma1957 on July 28, 2022, 12:29:48 AMI think 🤔 he may be correct ,but at my age I will likely be dead when lightning effectively has killed off btc.It's a bit off-topic. But, Who will own your assets after your death since you don't have kids?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "July 28, 2022, 12:42:36 AM",
      "body": "Quote from: AnotherAlt on July 28, 2022, 12:39:38 AMQuote from: philipma1957 on July 28, 2022, 12:29:48 AMI think 🤔 he may be correct ,but at my age I will likely be dead when lightning effectively has killed off btc.It's a bit off-topic. But, Who will own your assets after your death since you don't have kids?wife but if she goes first buysolar’s kids. (he has been a very good guy to partner with)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 28, 2022, 06:37:54 AM",
      "body": "Quote from: The Pharmacist on July 27, 2022, 11:26:38 PMAgreed, and I argued strenuously for not banning franky1 in that thread from January....but I guess he did wind up getting banned, which I don't think I was aware of.  He is not banned from the forum since he still continues posting, he is just banned from the technical board which is a good thing in my opinion since it helps keep at least one board clean considering how he derails every discussion.Basically he didn't like SegWit and using second layer as scaling solution so he continues bashing Bitcoin in every topic and spreads a lot of misinformation even if it is completely irrelevant to that topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "July 28, 2022, 07:46:18 AM",
      "body": "Quote from: LeGaulois on July 27, 2022, 10:04:26 PMIf a person is not able to argue against @franky1's opinions that is another problem and in that case perhaps the problem is with the person and not @franky1?Absolutely, but herein lies the problem. Even if someone is able to argue against franky1's opinions, franky1 ignores those arguments and continues to spam his off-topic opinions across multiple threads. It is this repeated spamming which lead to his ban from Dev & Tech, not his opinions. Loyce even created an entire thread dedicated to him to disprove his opinions in one place, but that doesn't stop him derailing threads all over the place.I feel we are largely in agreement. I have never and would never advocate banning someone for their opinions, regardless of how ridiculous or provably incorrect those opinions are, but when your constant spamming prevents other users from having a sensible discussion then I draw the line. Everyone has the inalienable right to free speech, but everyone also has the right to actually be able to use the forum for discussion without constant spam and/or derailment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "July 28, 2022, 08:20:57 AM",
      "body": "Quote from: PowerGlove on July 26, 2022, 10:08:27 PMI noticed that an old ban notice was bumpedThat link explains it already: \"years of continual harassment and misinformation\". I recently stumbled upon him again in a topic where someone posted something, and got a huge lecture from franky1 in return. I can't find back the post due to the sheer volume of posts.It's clear franky1 doesn't like the Bitcoin Lightning Network, and unfortunately he posts this view in any thread he can. You may want to read Is LN Bitcoin? franky1: About scaling, on-chain and off-chain, but it gets worse after a few pages.Quote from: LeGaulois on July 26, 2022, 11:01:52 PMPeople shouldn't be tagged for their opinionAgreed:Quote from: theymos on January 30, 2020, 09:13:15 PMThe system is for handling trade risk, not for flagging people for good/bad posts/personalities/ideas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}