{
  "id": "topic_5416920",
  "title": "Vlad BTCTKVR",
  "author": "Vlad BTCTKVR",
  "created_time": "October 12, 2022, 11:52:10 PM",
  "content": "Hi, guys!I'm back with a new podcast episode. This time, I'm interviewing Austrian economist Rahim Taghizadegan. When I met him this summer at Mallorca Blockchain Days, he held a presentation about the cult-like nature of Bitcoin communities and to which extent this is good for the money system.So I've decided to bring him on my podcast. Since he is well-acquainted with Austrian economic literature (he teaches it himself at academic level), I've also asked him some questions related to human action and how BTC adoption works (bottom up through communities or top-down via nation states). Other topics include the pros and cons of maximalism, as well as protocol ossification.Here's where you can listen to the interview. If you can, please subscribe and leave feedback:YouTube: https://youtu.be/7W7EJkQa7s8Spotify: https://open.spotify.com/episode/3hCXxceoI8OInGoY9nzevJ?si=ca96b1096eac4208Apple Podcasts: https://podcasts.apple.com/ro/podcast/bitcoin-takeover-podcast/id1451766883?i=1000582419638Native player (no registration, you can use Tor browser): https://bitcoin-takeover.com/audio/?name=2022-10-12_s12_e4_rahim_taghizadegan_on_austrian_economics__bitcoin_as_a_cult.mp3Article about the interview: https://bitcoin-takeover.com/s12-e4-rahim-taghizadegan-on-austrian-economics-bitcoin-as-a-cult/Rahim is the young guy in the centre:https://i0.wp.com/bitcoin-takeover.com/wp-content/uploads/2022/10/Rahim-Taghizadegan-Austrian-Economist-Bitcoin-Takeover-Podcast.jpeg",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416920",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "October 13, 2022, 06:33:58 AM",
      "body": "Well some people think if they get rid of the cult then Bitcoin will be a more \"inclusive\" place.Actually it will just become a polarized currency because there will always be people out there who hate liberals, they consider inclusiveness as a liberal trait so Bitcoin development will end up being caught in the crossfire of US politics like CashApp and Venmo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 13, 2022, 07:25:42 AM",
      "body": "The fact that a lot of people in the community has a libertarian mindset, does not mean that they are part of some extremist cult. We have to remember that anyone challenging the \"norm\" and finding better alternatives..are in actual fact good for the society. I think the mainstream media are to blame for the \"cult\" label that are plastered on Bitcoin communities, because they are pushing the hidden agenda of the puppet masters that wants to create that perception. (They are scared of the disruptive potential of the Bitcoin technology)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 13, 2022, 07:29:53 AM",
      "body": "Quote from: Kakmakr on October 13, 2022, 07:25:42 AMI think the mainstream media are to blame for the \"cult\" label that are plastered on Bitcoin communities, because they are pushing the hidden agenda of the puppet masters that wants to create that perception. (They are scared of the disruptive potential of the Bitcoin technology)  Media does not have any reason to feel threatened by Bitcoin, it's the people who own those publications who have a stake in various financial institutions, who feel that their personal interests are threatened by its rise. Nothing they can do about it though, except for spreading misinformation in their media outlets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "October 13, 2022, 07:44:10 AM",
      "body": "We have to remember that some people are resorting to labeling something as a \"cult\" when they fail to fully understand it and when they don't like it that much and got a hidden agenda of stopping or even destroying it. With the label of cult, there can be some people who are turned off with that something being described as such. As for me, as long as that cultish community is not involved with anything illegal or destructive in nature then I am so fine with it...and I don't really care what other people or the so-called experts can be thinking about it. We are now in the information era...we don't anymore experts condescending telling us anything on something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "October 13, 2022, 09:40:52 AM",
      "body": "Bitcoin community is not a cult and that's why it is called a community whereby all affairs partaining bitcoin could be discussed, but in so doing we can have a subgroup spearheaded by some reputable members on individuals discretion, it's a choice and not officially except for the executive memebers of the forum which we don't also know or have interest to how how they meet or discuss, but the large community here is big enough to make every possible discoveries one could ever thought about as a gathering, but irrespective of what others may say about the community, it standard never get compromised to that of an occultic group, this is purely and strictly bitcoin community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "October 13, 2022, 10:24:51 AM",
      "body": "I don't see Bitcoin as a cult, it's just it is the first and prime mover, so obviously, it become successful because of a lot of followers. Satoshi can't be called a leader, he just disappeared right? And a cult is only for small group of individuals that worship a leader, but we are big already, and I will assumed that those who have bitcoin or at least who encountered and knows about it could be in the millions already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "October 13, 2022, 12:09:45 PM",
      "body": "Reading the topic of this discussion OP, I had to go check out the typical characteristics of a cult group, so I can on my own compare it with the characteristics of this community to see if there is a similarity. These are some of the characteristics I could find;QuoteThe group is focused on a living leader to whom members seem to display excessively zealous, unquestioning commitment.The group is preoccupied with bringing in new members.The group is preoccupied with making money.Questioning, doubt, and dissent are discouraged or even punished.Members are expected to devote inordinate amounts of time to the group.Members are encouraged or required to live and/or socialize only with other group members.sourceNow comparing those characteristics;QuoteThe group is focused on a living leader to whom members seem to display excessively zealous, unquestioning commitment.Can we say this is Satoshi?QuoteThe group is preoccupied with bringing in new members.I don't think there is any strong rule that you must bring people to the forum.QuoteThe group is preoccupied with making money.We love money yes, but it is not the primary purpose of this forum, I believe the primary objective here is for knowledge and not money.QuoteQuestioning, doubt, and dissent are discouraged or even punished. Almost all sorts of questions and enquiries to know more are entertained on this forum, we are all here to learn.QuoteMembers are expected to devote inordinate amounts of time to the group.The forum is a free place, you decide the time you want to be active.QuoteMembers are encouraged or required to live and/or socialize only with other group members.Privacy is key, and even though we are in the same forum, it is still often advised that you still exercise caution with other members.In conclusion, there is a reason why there is the word ''community'' and the word ''cult''. IMO while they may share some similarities, the two word do not exactly refer to the same thing. Cult is the extreme of a community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 13, 2022, 01:53:08 PM",
      "body": "@Rruchi man, I think you broke this economist as they say in my country \"like a baby breaking a rattle toy\" because the man is an economist by profession and should talk about Bitcoin from an economic point of view, and not deal with whether something is a cult or not. Although there are those who just want to make money, and those who are really interested in technology, as you already well noticed, we don't have a leader, nor do we go around telling people what to do with their money.To me, all these so-called experts who compare us with some kind of cults, criminals, terrorists or environmental destroyers are someone who should be dealt with by real experts, of course those who study human behavior and the brain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "October 13, 2022, 02:37:48 PM",
      "body": "Quote from: TravelMug on October 13, 2022, 10:24:51 AMI don't see Bitcoin as a cult, it's just it is the first and prime mover, so obviously, it become successful because of a lot of followers. Satoshi can't be called a leader, he just disappeared right? And a cult is only for small group of individuals that worship a leader, but we are big already, and I will assumed that those who have bitcoin or at least who encountered and knows about it could be in the millions already.Maybe he's pointing out with market movement wherein 'unity' is evident with the investors which is simply normal. Everyone wants profit from their investment which makes the tendency high for investors to move as one based on the market behavior. Perhaps there is a price increase, most of the investors will avoid selling early not because they planned it, but simply because they are all eyeing to a bigger profit. Also, in something which is controlled by demand, the best way to survive or to benefit from it is to move or go with the flow of the majority because quantity is the bottomline. Try moving on the opposite, I doubt if it would give you a better outcome.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "October 13, 2022, 02:57:39 PMLast edit: October 13, 2022, 10:27:27 PM by coolcoinz",
      "body": "I'll try to listen to the end because this podcast is over 2 hours long, so it's going to take some time. I appreciate that you guys were able to talk so long about this topic. As for the headline, I feel like the idea was already disproved in this thread, but despite that, I'll try to listen and make my own mind about the points that you make. After a few minutes of listening, I feel like making a point about people having a subjective understanding of value is completely true, but this doesn't make us a cult in any way. Let's say, I have a car that my father used to drive and I wouldn't sell it for $100k, although the current market value is $10k. That said, you could say it's worth 5k to you and that's all you'd be willing to pay. Does that make any of us right or wrong? No. I see the value in it, the majority sees another value and you can say it has no value to you. We will all be right. I like bitcoin, I wouldn't sell it for $20k, but the market price today is as low as 18k. I don't see any reason to sell my coins and there will be people who will say that they wouldn't even pay 10k for it. That's fine, but the thing is they don't have to, just as I don't ever have to sell. I can give it to my children and let them decide what value it has to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "October 13, 2022, 03:48:09 PM",
      "body": "Bitcoin is not a cult, it's simply ignored by \"governments\" and \"financial institutes\" because they fear the end of their era. Imagine world without fiat money, peeps would built in the chips into their hands and just swipe here and there, everyone would just want to have more and more bitcoin so that they can get the services or products they want without any middle party or bank etc. Ever seen star trek or Doctor Who? Sometimes I feel like bitcoin was pulled straight out of those scifi movies and series. It looks like cult because its new technology (relatively) and due to non ending hindrances peeps are unable to utilize it's full specs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "October 13, 2022, 04:37:35 PM",
      "body": "Quote from: Kakmakr on October 13, 2022, 07:25:42 AMThe fact that a lot of people in the community has a libertarian mindset, does not mean that they are part of some extremist cult. We have to remember that anyone challenging the \"norm\" and finding better alternatives..are in actual fact good for the society. I think the mainstream media are to blame for the \"cult\" label that are plastered on Bitcoin communities, because they are pushing the hidden agenda of the puppet masters that wants to create that perception. (They are scared of the disruptive potential of the Bitcoin technology)  To be honest here, I won't consider the media for the blame, and any shit OP has got to say, but I consider it embarrassing that OP has been around the community for three months if I'm right, but he/her has failed to observe closely and draw meaning for himself.Folk like this are easily convinced into doing things they aren't supposed to. I'm also very certain to say that, if OP has read the rules here then he shouldn't have brought or started such.Reading Rruchi Man's comments should be enough for him, I got vexed already as I didn't bother jumping to listening to the podcast.If I can add to Bitcoin Forum cult claim's, I'd say no, it's Main aim is to inculcate and teach about Bitcoin in general. Advocating/ Lobbying for the Growth and further adoption of Bitcoin around the Globe. Aside learning bout Bitcoin, I've learned learned positive criticisms is no bad thing, learned some new word's, and also trying to handle bashing online. In everything there's a piece of good innit, so I'm being focused on what improves my rational faculty daily.The Fiat Currencies have done more harm than good, the more deep you go digging bout it, the more you see they're backed by government as well as CDBC'S. the limitations of fiat currencies didn't affect OP during COVID-19 I guess, ain't it ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vlad BTCTKVR",
      "created_time": "October 13, 2022, 09:58:35 PM",
      "body": "Quote from: Kakmakr on October 13, 2022, 07:25:42 AMThe fact that a lot of people in the community has a libertarian mindset, does not mean that they are part of some extremist cult. We have to remember that anyone challenging the \"norm\" and finding better alternatives..are in actual fact good for the society. I think the mainstream media are to blame for the \"cult\" label that are plastered on Bitcoin communities, because they are pushing the hidden agenda of the puppet masters that wants to create that perception. (They are scared of the disruptive potential of the Bitcoin technology)  Well, the \"cult\" isn't exactly what the mainstream media describes us. It's also how we show up at conferences worshipping certain individuals (in the past, Andreas Antonopoulos and more recently Michael Saylor), buying the same \"Don't trust, verify\" merchandise (even if we are not technically competent enough to verify our own code), reading the same books (\"The Bitcoin Standard\" is in the bookshelf of pretty much every bitcoiner on Twitter) and posting pictures of the same devices (it used to be the Trezor, now the Coldcard is the cool maximalist device). There are community members who spend every day telling their friends and social media followers that everything will be divided by 21 million (the BTC supply) and that Bitcoin is \"element zero\" in chemistry.There are many nuances, and it seems that every adoption cycle brings in people who are more willing to follow a narrative than to approach Bitcoin critically. You should spend a day reading what's going on in the community chats of Samourai wallet or Coldcard users. I'm convinced that these are bona fide \"micro cults\". And I get it, I know why this is happening. But this doesn't mean that we should indulge in the shallow \"Bitcoin fixes this\" mindset. If you spend too much time on Bitcoin Twitter, you will feel like a cult member – as there are even gatekeepers and hound dogs (Mr. Hodl, Dieter Bob) who do nothing but police other people's speech and bully them into a uniform way of thinking. Even if it's for a good cause, I think we should reflect more on how we're actually improving the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "October 13, 2022, 10:04:42 PM",
      "body": "Quote from: Kakmakr on October 13, 2022, 07:25:42 AMThe fact that a lot of people in the community has a libertarian mindset, does not mean that they are part of some extremist cult. We have to remember that anyone challenging the \"norm\" and finding better alternatives..are in actual fact good for the society. Depends, extremism usually isn't very good regardless what it's about. Although, I don't think Bitcoin is subjected to much of it, thankfully. There are though, definitely Bitcoin maximalists which could potentially be seen as harmful depending on your perspective. Quote from: so98nn on October 13, 2022, 03:48:09 PMBitcoin is not a cult, it's simply ignored by \"governments\" and \"financial institutes\" because they fear the end of their era. Imagine world without fiat money, peeps would built in the chips into their hands and just swipe here and there, everyone would just want to have more and more bitcoin so that they can get the services or products they want without any middle party or bank etc. It looks like cult because its new technology (relatively) and due to non ending hindrances peeps are unable to utilize it's full specs. it hasn't been ignored by the majority of the world's governments. They're either regulating it via taxes or they're banning it. That seems to be the two most common approaches to it. However, I do doubt they fear it. Bitcoin isn't meant to take over, it's meant to provide an alternative, which I do think a lot of people concentrate on it taken over. and judge success based on that fact. When in reality it's unlikely to ever do that.It's not exactly new technology either. A lot of what Bitcoin has implemented was thought of many years ago. The difference for me is while there was ideas of a decentralised currency, Satoshi is the only one to bring it to life, setting him apart from the rest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vlad BTCTKVR",
      "created_time": "October 13, 2022, 10:12:03 PMLast edit: October 14, 2022, 11:00:56 AM by mprep",
      "body": "Quote from: Oluwa-btc on October 13, 2022, 04:37:35 PMQuote from: Kakmakr on October 13, 2022, 07:25:42 AMThe fact that a lot of people in the community has a libertarian mindset, does not mean that they are part of some extremist cult. We have to remember that anyone challenging the \"norm\" and finding better alternatives..are in actual fact good for the society. I think the mainstream media are to blame for the \"cult\" label that are plastered on Bitcoin communities, because they are pushing the hidden agenda of the puppet masters that wants to create that perception. (They are scared of the disruptive potential of the Bitcoin technology)  To be honest here, I won't consider the media for the blame, and any shit OP has got to say, but I consider it embarrassing that OP has been around the community for three months if I'm right, but he/her has failed to observe closely and draw meaning for himself.Folk like this are easily convinced into doing things they aren't supposed to. I'm also very certain to say that, if OP has read the rules here then he shouldn't have brought or started such.That's where you're wrong, I've only been around for 2 weeks. Somehow my podcast is at season 12 and you can find articles of mine about Bitcoin which date back to mid-2017, but it's fine. Don't look too much into it, I like your portrayal better Quote from: Welsh on October 13, 2022, 10:04:42 PMQuote from: Kakmakr on October 13, 2022, 07:25:42 AMThe fact that a lot of people in the community has a libertarian mindset, does not mean that they are part of some extremist cult. We have to remember that anyone challenging the \"norm\" and finding better alternatives..are in actual fact good for the society. Depends, extremism usually isn't very good regardless what it's about. Although, I don't think Bitcoin is subjected to much of it, thankfully. There are though, definitely Bitcoin maximalists which could potentially be seen as harmful depending on your perspective. I find it interesting that the perception is so different here. On Twitter, there are plenty of community members who label themselves as \"toxic maximalists\", \"fundamentalists\", \"Bitcoin crusaders\", \"Bitcoin extremists\". They will say that anything that is not Bitcoin is a scam, they will argue that even tokens built on top of Bitcoin (Counterparty, Omni, Stacks, RGB, Taro) are scams and there is even a crowd which believes that the Lightning Network is a failure which is not really Bitcoin. What I find most amusing is that Blocsktream tried to offer all the \"scammy\" features on the Liquid sidechain. And after they spent time calling out tokens for being scams, now their sidechain mostly mines empty blocks because users don't really want to be associated with these scams. That's what you get when there's no nuance and the scam is the tool itself, which is not relative to a network or protocol. Anyway, I got sidetracked a bit. My point is that the responses I got here are visibly different from those I got on Twitter.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "October 14, 2022, 12:48:19 AM",
      "body": "Cults usually involve something dark and secretive. Like giving your cult members poisoned koolaid. Thats a cult. This what we have? Its not a cult. Its a club. Anyone is free to join, anyone is free to leave and obviously some of us will be more fanatical or less fanatical about Bitcoin than others. As long as you enjoy Bitcoin and talking about Bitcoin then this is the right place for you. Thats really all it is.I just realize that sounded like something a cult recruiter would say.  Anyway, we're not a cult. Yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nhazwrath",
      "created_time": "October 14, 2022, 01:57:16 AM",
      "body": "Nobody should be engaging media without proof that the media in question is honest.  =>Talking points such as these are why smart people don't engage you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 14, 2022, 02:33:34 AM",
      "body": "Quote from: Vlad BTCTKVR on October 13, 2022, 10:21:47 PMQuote from: Welsh on October 13, 2022, 10:04:42 PMQuote from: Kakmakr on October 13, 2022, 07:25:42 AMThe fact that a lot of people in the community has a libertarian mindset, does not mean that they are part of some extremist cult. We have to remember that anyone challenging the \"norm\" and finding better alternatives..are in actual fact good for the society. Depends, extremism usually isn't very good regardless what it's about. Although, I don't think Bitcoin is subjected to much of it, thankfully. There are though, definitely Bitcoin maximalists which could potentially be seen as harmful depending on your perspective. I find it interesting that the perception is so different here. On Twitter, there are plenty of community members who label themselves as \"toxic maximalists\", \"fundamentalists\", \"Bitcoin crusaders\", \"Bitcoin extremists\". They will say that anything that is not Bitcoin is a scam, they will argue that even tokens built on top of Bitcoin (Counterparty, Omni, Stacks, RGB, Taro) are scams and there is even a crowd which believes that the Lightning Network is a failure which is not really Bitcoin. What I find most amusing is that Blocsktream tried to offer all the \"scammy\" features on the Liquid sidechain. And after they spent time calling out tokens for being scams, now their sidechain mostly mines empty blocks because users don't really want to be associated with these scams. That's what you get when there's no nuance and the scam is the tool itself, which is not relative to a network or protocol. Anyway, I got sidetracked a bit. My point is that the responses I got here are visibly different from those I got on Twitter.What is true to other people, could be false to others. I'm sure it wouldn't really affect you unless you get to become a keyboard warrior to argue each so don't stress yourself with those comments cause it won't help grow a youtube channel. The forum is not a religious group that's for sure and more than likely, half of the users have invested in ETH. The forum is not entirely into BTC but a lot have diversified thier belief kinda practicing Santeria.    The community is very inclusive too, it only needs registration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vlad BTCTKVR",
      "created_time": "October 14, 2022, 09:41:45 AM",
      "body": "Quote from: Nhazwrath on October 14, 2022, 01:57:16 AMNobody should be engaging media without proof that the media in question is honest.  =>Talking points such as these are why smart people don't engage you.You can argue that I'm debating in bad faith and be as subtle as you want in terms of implying that I'm too dumb to deserve replies to the inquiry.But let me ask you this: did you watch/attend any of the Miami conferences? Or the one that's currently taking place in Amsterdam?I won't make any assumptions, but I'll leave a few samples here. Before you consider using \"these guys are in a minority\" argument, I'll remind you that these conferences have more attendees than BitcoinTalk forum accounts and the amount of followers that the talking heads have should also be taken into consideration.Max Keiser's \"fuck Elon\" moment: https://youtu.be/GC_h_tz44uwMichael Saylor telling sovereign individuals what they should do with their own money: https://youtu.be/8ZcFahsvFyISaifedean explaining to Jordan Peterson that Bitcoin is \"digital energy\" (this became a popular meme): https://youtu.be/iJ85fyWx-CkI could probably dig up more stuff about Bitcoin being a \"battery\", \"digital real estate\", \"element zero\", \"digital alchemy\", and all sorts of silly metaphors. But the concerning part is that people take them seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}