{
  "id": "topic_5397840",
  "title": "achow10",
  "author": "achow10",
  "created_time": "May 09, 2022, 05:50:06 AM",
  "content": "I think that having Bitcoin might be a good investment but calling it a safe haven might be over exaggeration. We all know how volatile Bitcoin is and how it may be up one hour then it will be down on another. This needs sound mental faculties and lots of patience and discipline if you want to reach your goals of financial independence on cryptocurrency. Surely you can call Bitcoin a safe haven once you have cashed out your millions.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397840",
  "comments": [
    {
      "author": "Blue King",
      "created_time": "May 09, 2022, 06:22:10 AM",
      "body": "Quote from: achow10 on May 09, 2022, 05:50:06 AMI think that having Bitcoin might be a good investment but calling it a safe haven might be over exaggeration. We all know how volatile Bitcoin is and how it may be up one hour then it will be down on another. This needs sound mental faculties and lots of patience and discipline if you want to reach your goals of financial independence on cryptocurrency. Surely you can call Bitcoin a safe haven once you have cashed out your millions. Before we only knew gold was our refuge.But the current bitcoin can be called our safe haven.The most expensive currency in the cryptocurrency world is Bitcoin and Bitcoin is invested in almost all countries.So the current bitcoin can be called a safe haven.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptoababe",
      "created_time": "May 09, 2022, 06:32:02 AM",
      "body": "For me, its a safe haven if you are holding in a cold wallet which you have your private key with you. But not a safe haven if you are holding in an exchange because your account can be terminated at anytime. Although bitcoin was created to be a safe haven but you cant control it from being on exchanges also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tarek0987",
      "created_time": "May 09, 2022, 08:36:52 AM",
      "body": "Quote from: Blue King on May 09, 2022, 06:22:10 AMQuote from: achow10 on May 09, 2022, 05:50:06 AMI think that having Bitcoin might be a good investment but calling it a safe haven might be over exaggeration. We all know how volatile Bitcoin is and how it may be up one hour then it will be down on another. This needs sound mental faculties and lots of patience and discipline if you want to reach your goals of financial independence on cryptocurrency. Surely you can call Bitcoin a safe haven once you have cashed out your millions. Before we only knew gold was our refuge.But the current bitcoin can be called our safe haven.The most expensive currency in the cryptocurrency world is Bitcoin and Bitcoin is invested in almost all countries.So the current bitcoin can be called a safe haven.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 09, 2022, 11:46:23 PM",
      "body": "No it's not. Safe haven means an asset that doesn't lose its value during hard times, or at least loses much less value than other assets. With Bitcoin we see that when stocks go down, Bitcoin follows. When covid and response to it happened, Bitcoin experienced some of it biggest crashes. It full recovered from it and made lots of gains afterwards, but still that alone disqualifies Bitcoin from being a safe haven. Imagine that if you have a contract that requires you to pay a sum at certain date, you store your money in Bitcoin, because you think it's a safe haven, then Bitcoin crashes before that date, and you're forced to sell at a loss, like it or not. That's the opposite of safe haven.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheGhostMan",
      "created_time": "May 10, 2022, 01:53:59 AM",
      "body": "In my opinion I do not see it as a \"safe haven\" since it is not a currency that has a stipulated value, as when we talk about fiduciary currencies or minerals such as gold. As we all now know that cryptocurrencies are volatile, today it may be in a bullish chain but in a few days in a bearish one, even in the worst case it may be worth nothing. That is why I do not see it as “A safe haven”, although I want to emphasize that it is very good for investors since when we talk about BTC they are crypto assets that generally remain in resistance, today they are not having a very good time. but I am sure that with patience and perseverance this will rise to the clouds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "May 10, 2022, 02:32:54 AM",
      "body": "Quote from: achow10 on May 09, 2022, 05:50:06 AMI think that having Bitcoin might be a good investment but calling it a safe haven might be over exaggeration. We all know how volatile Bitcoin is and how it may be up one hour then it will be down on another. This needs sound mental faculties and lots of patience and discipline if you want to reach your goals of financial independence on cryptocurrency. Surely you can call Bitcoin a safe haven once you have cashed out your millions.This is obviously something that's really being put to the test at the current moment with the blood bath that's going around on all markets across the board.  So is bitcoin a safe haven..I think it depends on what your definition of safe haven is.  It is certainly isn't a safe haven like gold, silver and other precious metals are.  But as for a store of value/money compared to many countries fiat..I think it is a safe haven.  Have to remember not all countries have very strong currency, not to mention currency citizens can trust.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "May 10, 2022, 02:39:58 AM",
      "body": "If an asset is volatile, it is not a safe haven. If an asset fluctuates more or less like the rest of the mainstream assets, it must not be a safe haven. If an asset is risky, it is not a safe haven. And since Bitcoin is all of the above, I doubt it could be considered a safe haven. However, this is true if we are to look at the charts with shorter time frames. If we are to take several steps back, zoom out, and focus instead on long-term movements of Bitcoin's price, we may be seeing a picture with a different suggestion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "May 10, 2022, 05:24:39 AM",
      "body": "Bitcoin is NOT a safe heaven,but Bitcoin can become a safe heaven,if you HODL it long enough.Bitcoin doesn't act like a safe heaven in the short term,but in the long term(if the BTC price really moves in cycles and if we witness another ATH somewhere around the next BTC halving)we might see a big growth in both the value and price of BTC.In conclusion,this question doesn't have a simple answer.At the end of the day,Bitcoin might be a safe heaven,but with a really volatile price,which means that BTC is completely different than the traditional safe heavens like gold,real estate,etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 10, 2022, 06:00:45 AM",
      "body": "Your question is necessitated by the ongoing crash, no doubt. If Bitcoin were in an upward rally at this moment I'm sure such wouldn't cross your mind. Well, be rest assured that those who see Bitcoin as a Safe Haven aren't looking at the momentary crashes it goes through. It's a phoenix and they know it to always regain whatever it loses each time. For me, I see it as such too. What's happening in the market ATM is just a way of the market providing new investors another greater opportunity to get in. Yet, a great number of investors will be scared at this time to go all in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "May 10, 2022, 06:05:41 AM",
      "body": "Quote from: achow10 on May 09, 2022, 05:50:06 AMI think that having Bitcoin might be a good investment but calling it a safe haven might be over exaggeration. We all know how volatile Bitcoin is and how it may be up one hour then it will be down on another. This needs sound mental faculties and lots of patience and discipline if you want to reach your goals of financial independence on cryptocurrency. Surely you can call Bitcoin a safe haven once you have cashed out your millions.Depends on how you look at, if you are here for long term, maybe it could be a safe haven for the majority of us specially if the price will go up in a strong bull market. But as to what we are seeing right now? it doesn't make sense to hedge your wealth because the price is continuing to decline and it might be at the end of the year. So you have to question yourself if you want to hedge your money long term or short term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "May 10, 2022, 06:07:16 AM",
      "body": "If you look at the performance until recently, it has behaved like a safe haven, the problem is that if you look at the market over the last 24 hours it doesn't look like a safe haven, but you have to take a broader perspective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "May 10, 2022, 06:11:11 AM",
      "body": "Quote from: achow10 on May 09, 2022, 05:50:06 AMI think that having Bitcoin might be a good investment but calling it a safe haven might be over exaggeration. We all know how volatile Bitcoin is and how it may be up one hour then it will be down on another. This needs sound mental faculties and lots of patience and discipline if you want to reach your goals of financial independence on cryptocurrency. Surely you can call Bitcoin a safe haven once you have cashed out your millions.It's not a safe heaver in traditional meaning. By safe heaven, we understand some form of assets which will provide support during a bad market movement. Bitcoin is definitely not this kind of safe heaven because of its volatility. Bitcoin is a safe heaven to save your wealth from the government or enforcement agencies etc. In times of crisis. We have seen it during Hongkong crisis and we are seeing it now for Russia Ukraine crisis. If you want traditional safe heaven - buy gold!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "perla",
      "created_time": "May 10, 2022, 07:47:47 AM",
      "body": "It is safer than the banks since you are he bank here but in terms of price I don't think that it is a safe haven a good example is what happened to me, I bought Bitcoins when it was around $42,000 and now the price is around $30k-$40k and I don't think I am safe at all I just hope that the price would recover at least around $40k",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "raidarksword",
      "created_time": "May 10, 2022, 08:01:50 AM",
      "body": "In crypto patience is the best weapon to become successful in this industry. The volatility of Bitcoin is every imminent wherein it can give you profit or it will give you saddened loses anytime. Market has cycles that's why it's best to make the timing so important to enjoy the crypto success in the long term haul and waiting for the bull seasons to come through.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vaskiy",
      "created_time": "May 10, 2022, 08:49:39 AM",
      "body": "The volatility never let bitcoin to be a safe haven. It can be considered as a safe haven by long term holders who doesn't have a timeline to make use of the holdings. Because, we don't know when the market crashes/bounce. If the market was down when the user is in need, then the user losses from the capital. Every investment have risk and nothing can be considered as safe haven other than gold which fluctuates very minimal comparatively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "May 11, 2022, 02:16:23 AM",
      "body": "Quote from: achow10 on May 09, 2022, 05:50:06 AMI think that having Bitcoin might be a good investment but calling it a safe haven might be over exaggeration. We all know how volatile Bitcoin is and how it may be up one hour then it will be down on another. Before calling bitcoin volatile we should have to see the difference of the price of bitcoin in last ten years. I think bitcoin is always a safe haven for those traders who do trade in long-term",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Falconer",
      "created_time": "May 11, 2022, 02:44:24 AM",
      "body": "Quote from: |MINER| on May 11, 2022, 02:16:23 AMBefore calling bitcoin volatile we should have to see the difference of the price of bitcoin in last ten years. I think bitcoin is always a safe haven for those traders who do trade in long-termGood and safe are two different things. Bitcoin is an asset that may be the best choice for traders to profit from its price volatility compared to some other physical and stock investment assets, but it is certainly not a safe asset when you want prices to remain stable without high volatility.The security that bitcoin offers is not in its price, but in the nature of its resistance to hacking attempts. Bitcoin have never been hacked, but some hackers have simply taken advantage of user error who failed to implement ways to properly secure their wallets. So if you don't care about price volatility, then bitcoin is a safe asset to keep long term. But when they care about volatility then you should not make bitcoin an asset that is safe from price volatility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "May 11, 2022, 03:23:10 AM",
      "body": "I think depending on the time you get in, for those who got on very early perhaps they might consider it as a safe haven but for others who got in at the peak for short term gain, it won't be safe heaven because their investment has reduced as the price fluctuate. For long term holders, they may see it as safe haven with the belief that btc price will be much higher in future",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lubang Bawah",
      "created_time": "May 11, 2022, 04:43:00 AM",
      "body": "All types of investments have risks including bitcoin, even now I often hear cases of hack wallet because now more and more evil programs are spread to steal data on a PC or smartphone, if we think for the long term then I prefer to save bitcoin in the top exchanges last Use for staking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}