{
  "id": "topic_5501442",
  "title": "fromindia",
  "author": "fromindia",
  "created_time": "June 29, 2024, 11:04:02 AM",
  "content": "Personally I am a computer engineer. Currently working with Bitcoin. I have made a python library to check balance of auto generated 100000 private keys and address in 10 minutes. But it is not enough to get some good luck. So I am trying to find some specific private keys created within 2012 to 2015. I have learnt that during that period private key was created based on Number.Random JavaScript vulnerabilities. Is there anybody who could help me on it? How could I get private keys which ware created followed by JavaScript vulnerabilities.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5501442",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "June 29, 2024, 11:24:39 AM",
      "body": "No one is going to aid your attempt to brute force a private key, not that it matters cause you'll be unsuccessful whichever private key you attempt to crack.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 29, 2024, 12:00:37 PM",
      "body": "1. Unless you know exactly how to exploit those JS vulnerabilities and restrict the range in which the private keys were generated, you're pretty much out of luck (you have much better chance to win the lottery many times in a row).2. Anybody who would know what to do and have low enough morals (see point 3), would do it for himself, isn't it.3. Keep in mind that if you find such an address and move the coins to your own wallet, that is called theft.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SickDayIn",
      "created_time": "June 29, 2024, 01:01:47 PM",
      "body": "Any simple brute force attack for generating private keys would already have been included as test case when Satoshi created Bitcoin. I wouldn't bother yourself with trying to do this. Additionally no one on this forum will help you with trying to steal the coins from someone else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "June 29, 2024, 01:18:37 PM",
      "body": "Based on your actions, people can know the kind of person you are. I'm not attacking you by saying this, but despite the negative feedback in your profile I see you continue to share posts and topics that could further hurt your reputation even more ( I know that you don’t even care).You are attempting something unethical and potentially illegal by exploiting vulnerabilities in private keys to steal assets from others. Such actions harm innocent individuals who saved their assets, savings, their dream projects. Stealing that money may lead to both sides losing a lot.Please do not expect anyone here to provide you with clues or assistance for your whatever you are doing to find private keys, so as they involve harming others and steal their money there will be consequences after it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "June 29, 2024, 08:15:01 PM",
      "body": "Quote from: fromindia on June 29, 2024, 11:04:02 AM~Is there anybody who could help me on it? How could I get private keys which ware created followed by JavaScript vulnerabilities.Fuck you! Stealing private keys through a vulnerability is akin to digital burglary.  Do you think anyone with morals would assist such a crime? Bitcoin thrives on security, and you want to exploit it for personal gain?  This isnt just a moral failing, its a criminal offense.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "June 29, 2024, 08:20:58 PM",
      "body": "So you created this thread because you wanted to know how you can steal the Bitcoin that miners generated or the Hodler bought? And you think we will help you with that? Are you retard or you're joking? Get a life and stop the things that you're doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sky_T",
      "created_time": "June 30, 2024, 08:57:38 PM",
      "body": "Quote from: fromindia on June 29, 2024, 11:04:02 AMIs there anybody who could help me on it? How could I get private keys which ware created followed by JavaScript vulnerabilities.How do you expect someone to help you? Attempting to steal a private key is highly unethical and no will want to partake in anything that is not right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "July 01, 2024, 10:44:19 AM",
      "body": "I write this reply to make sure people being cautious towards OP by checking feedback left to his account. Previously he user admit he steal someone else Bitcoin and will exploit another Bitcoin wallet. So it's likely he created this thread in attempt to continue stealing someone else Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moreno233",
      "created_time": "July 01, 2024, 10:53:56 AM",
      "body": "Quote from: fromindia on June 29, 2024, 11:04:02 AMPersonally I am a computer engineer. Currently working with Bitcoin. I have made a python library to check balance of auto generated 100000 private keys and address in 10 minutes. But it is not enough to get some good luck. So I am trying to find some specific private keys created within 2012 to 2015. I have learnt that during that period private key was created based on Number.Random JavaScript vulnerabilities. Is there anybody who could help me on it? How could I get private keys which ware created followed by JavaScript vulnerabilities.Anyone who have been active in this forum for at least three months will be able to understand that you are out for no good. I don't know why you think anyone will help you steal the coin of another person but I can assure you that no one will cooperate with you on this and if there is anyone who have the means to do that, such person might not need you to execute such plans. I will suggest you transfer your skill into mining Bitcoin, that will help you more than wasting your time in fantasies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "July 01, 2024, 10:58:47 AM",
      "body": "Quote from: fromindia on June 29, 2024, 11:04:02 AMPersonally I am a computer engineer. Currently working with Bitcoin. I have made a python library to check balance of auto generated 100000 private keys and address in 10 minutes. But it is not enough to get some good luck. So I am trying to find some specific private keys created within 2012 to 2015. I have learnt that during that period private key was created based on Number.Random JavaScript vulnerabilities. Is there anybody who could help me on it? How could I get private keys which ware created followed by JavaScript vulnerabilities.Instead attempting to brute force those random wallets you found maybe its more better if you will find a legitimate job where you can earn decent money? For sure it will benefit you more in long time rather than wasting your effort on trying to penetrate someone's wallet. Also as you said you are a computer engineer so for sure there would be a lot of opportunities for you to get especially if you are skilled to create something technical service to people online.Also no one will help you if people know that what you are doing is something illegal which can cause for a innocent ones to lose their money. Play fair and work on your skills since its really fulfilling to spend your money gotten from clean jobs you made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wiss19",
      "created_time": "July 05, 2024, 05:44:43 AM",
      "body": "Quote from: Sky_T on June 30, 2024, 08:57:38 PMQuote from: fromindia on June 29, 2024, 11:04:02 AMIs there anybody who could help me on it? How could I get private keys which ware created followed by JavaScript vulnerabilities.How do you expect someone to help you? Attempting to steal a private key is highly unethical and no will want to partake in anything that is not right. He doesn't know either and that is why he is here asking if someone can help him with his problem. In this world, there are also bad guys apart from the good guys, (thieves for example, or the black hat hackers). They are the ones that can possibly help the OP with an exchange of some sold cash or cryptos that they can get on this operation but I think if they are that great to make this operation successful then I don't think we can spot them here lurking and waiting for offers like this because they themselves can get started on their own and they can make money immediately or whenever time they like it. I can only wish a good luck to the OP for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "July 05, 2024, 06:11:43 AM",
      "body": "Quote from: fromindia on June 29, 2024, 11:04:02 AMPersonally I am a computer engineer. Currently working with Bitcoin. I have made a python library to check balance of auto generated 100000 private keys and address in 10 minutes. But it is not enough to get some good luck. So I am trying to find some specific private keys created within 2012 to 2015. I have learnt that during that period private key was created based on Number.Random JavaScript vulnerabilities. Is there anybody who could help me on it? How could I get private keys which ware created followed by JavaScript vulnerabilities.It is sorrowful to see a computer engineer who specializes in stealing people's hard-earned labor. Your skill is highly sought after and can easily get a job in some job-sourcing platforms. After people have engaged in productive work, earned and invested, you want to just steal from them to make a living. You will never be lucky because your aim is evil. My advice is that you use your skills in some endeavors that will enable you to earn a living instead of focusing on criminal activities. As you can see from all the replies nobody is willing to engage in such a shameful act. Maybe the devil will be willing to assist you, so go meet him in hell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "July 05, 2024, 08:16:30 AM",
      "body": "You can imagine that if it is possible for computer engineers like you to brute force private keys and steal bitcoins of others, is Bitcoin still valuable in eyes of investors and many people?This is a simple question and I believe you can answer it. It's impossible at least with computational power now for the public. Even governments don't have such computational power to do this.Finding an atom in the universe, if possible, can hep you to find Bitcoin private keys. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Betwrong",
      "created_time": "July 05, 2024, 08:36:23 AM",
      "body": "Quote from: NeuroticFish on June 29, 2024, 12:00:37 PM1. Unless you know exactly how to exploit those JS vulnerabilities and restrict the range in which the private keys were generated, you're pretty much out of luck (you have much better chance to win the lottery many times in a row).2. Anybody who would know what to do and have low enough morals (see point 3), would do it for himself, isn't it.3. Keep in mind that if you find such an address and move the coins to your own wallet, that is called theft.That is what people should be aware of in the first place. It might look like tweaking the numbers and letters until you get the right combination(the private key) is not the same as to break into someone's house and rob them. But if you think of it, it's actually the same thing. You're taking someone's fortune, completely illegally. If you don't think that committing theft is a good idea, you shouldn't do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "July 05, 2024, 10:11:44 AM",
      "body": "Quote from: fromindia on June 29, 2024, 11:04:02 AMPersonally I am a computer engineer. Currently working with Bitcoin. I have made a python library to check balance of auto generated 100000 private keys and address in 10 minutes. But it is not enough to get some good luck. So I am trying to find some specific private keys created within 2012 to 2015. I have learnt that during that period private key was created based on Number.Random JavaScript vulnerabilities. Is there anybody who could help me on it? How could I get private keys which ware created followed by JavaScript vulnerabilities.And most likely you are not the first one to think about bruteforcing a Bitcoin wallet to find that one private key. And so far, we haven't heard anyone really finding those privatekey so it's not that easy as you think.What like the rest of us here says, it's your morals, it's the very definition of stealing and what if by chance you are the victim, what do you feel. If I'm in your case, why not used your degree to a more productive way? Get a job, as usually a developer's salary is huge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 05, 2024, 06:38:36 PM",
      "body": "The problem with Math.random is that if you have enough samples, you can predict the next outcome of the function or even recover the seed and know the whole sequence. On practice it means that if the server respond to your request with the result of this function, you can try to exploit it. But if someone ran it on their computer for their own use, you most likely won't be able to do anything. It doesn't have some sort of bug that it generates values only in a narrow range, or makes a statis output like all zeroes or some other values.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}