{
  "id": "topic_5405817",
  "title": "Queentoshi",
  "author": "Queentoshi",
  "created_time": "July 10, 2022, 05:53:30 PM",
  "content": "The value of bitcoin dropped unexpectedly this year from $30,215 to $20,385 within a few days from June 9th to June 17th according to coinmarketcap, A quick question for anyone here who purchased bitcoins say on June 9th just before the unexpected dip began? Do you regret your decisions and are you confident that bitcoins will bounce back?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405817",
  "comments": [
    {
      "author": "Hispo",
      "created_time": "July 10, 2022, 07:04:32 PM",
      "body": "I am quite confident a price recovery will come in mid-long term, if I would have bought some random sh*tcoin I would of course be worried about my investment, since those tend to die after a significant bump. But since we are talking about Bitcoin, I dont think my positions are lost forever.Bitcoin is the major of cryptocurrencies, one of the vastly known, secure and ever expanding. In the mean time, this price ranges are ideal to add some satoshis to the bag, if possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "July 10, 2022, 07:08:46 PM",
      "body": "Do I regret buying before the dip? No not at all. Would I regret buying after the dip? Definitely. Buy the dip and hodl. Thats all the strategy I need. In fact, I would prefer not to even think about the \"end\" of the dip and just buy whenever I see such massive Bitcoin discounts. Because in reality, thats what they are. Discounts. And once you start thinking of them that way, you will find yourself buying at every dip.Don't fool yourself into \"waiting for the perfect opportunity\". 1 BTC = 1 BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "July 10, 2022, 07:22:06 PMLast edit: July 12, 2022, 11:59:14 AM by Zilon",
      "body": "I didn't regret buying.. I paid attention to my chart and knew when to sell..The trend began from may but it wasn't clear enough where the market direction was pointing to. From the chart we see may 9th till june 10th was a strong indecision (range market), price revolved from $28k to $32k. From that point i was waiting for a pin bar because prior to this we had series of lower highs.from june 11th a major pin bar formed at a resistance zone which pushed the price below $30k. This pin bar was accompanied by a long bear candle which pushed the price even further. I expected price to fall this far and currently we are facing another indecision in the market (range market) and if there is no correction after this trend price will still fall further.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChrisPop",
      "created_time": "July 10, 2022, 07:22:56 PM",
      "body": "Once you default into the mode of thinking that:1) You don't have a crystal ball.2) That means you can't predict the tops and bottoms in a market with so many market participants with so many different interests- You will realize that the market only offers opportunities. If you purchased BTC at $30k, instead of $20k it might be not ideal, but you understand that you have no control on that. However it is better to purchase an asset that you can consider cheap at higher price than to not purchase it at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "July 10, 2022, 07:47:58 PM",
      "body": "Quote from: Queentoshi on July 10, 2022, 05:53:30 PMThe value of bitcoin dropped unexpectedly this year from $30,215 to $20,385 within a few days from June 9th to June 17th according to coinmarketcap, A quick question for anyone here who purchased bitcoins say on June 9th just before the unexpected dip began? Do you regret your decisions and are you confident that bitcoins will bounce back? Bitcoin going dip is not something someone like investors can regret of because bitcoin never remain constant and any investor can purchase bitcoins now the price is in low state and hold until it rise because if you don't know that theirs no regrets in cryptocurrency investment no now, because bitcoin like market that fall and rise and the dip is like the worst part of bitcoin which people use and hate bitcoin investment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Furious 7",
      "created_time": "July 10, 2022, 07:48:09 PM",
      "body": "Basically I don't really care about this but indeed I will only convey what I want to say about my ignorance The real regret is definitely there because of course there is some hope to buy lower than that but this didn't really have any impact on me because what I bought was something good enough for my portfolio.As for the current decline, it is not very suitable to be regretted and I would rather say this is a blessing for me to add more and more to my assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Newlifebtc",
      "created_time": "July 10, 2022, 08:00:21 PM",
      "body": "Quote from: Zilon on July 10, 2022, 07:22:06 PMI didn't regret buying.. I paid attention to my chart and knew when to sell..The trend began from may but it wasn't clear enough where the market direction was pointing to. From the chart we see may 9th till june 10th was a strong indecision (range market), price revolved from $28k to $32k. From that point i was waiting for a pin bar because prior to this we had series of lower highs.from june 11th a major pin bar formed at a resistance zone which pushed the price below $30k. This pin bar was accompanied by a long bear candle which pushed the price even further. I expected price to fall this far and currently we are facing another indecision in the market (range market) and if there is no correction after this trend price will still fall further.  from what you observe from the way Bitcoin price is moving now do you think that Bitcoin price will fall again before it will stand to be moving high. I'm still watching the market because it was on 21k and now it has returned to 20k is any possibility that Bitcoin price will go back to 17k and we predict that it will fall again before it rise again. If you details you can explain more about how it going to rise and fall within this month of July or we should expect downfall of Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "July 10, 2022, 08:41:21 PMLast edit: July 11, 2022, 02:09:30 PM by Zilon",
      "body": "Quote from: Newlifebtc on July 10, 2022, 08:00:21 PMfrom what you observe from the way Bitcoin price is moving now do you think that Bitcoin price will fall again before it will stand to be moving high. I'm still watching the market because it was on 21k and now it has returned to 20k is any possibility that Bitcoin price will go back to 17k and we predict that it will fall again before it rise again. If you details you can explain more about how it going to rise and fall within this month of July or we should expect downfall of Bitcoin We are in another indecision in the market. i will not categorically tell if prices will fall further but if price continues to retest the support zone and another pin bar or a hanging man candle forms near the resistance i fear prices might fall further. But with the current pin bar formed and if prices gets to the support zone and keeps consolidating there and breaks through below the support line expect another massive sell",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheNineClub",
      "created_time": "July 10, 2022, 08:43:09 PM",
      "body": "Really not worried about the dip and haven't really been since the last cycle. I am not saying that it will go back up, because it might not, but I personally want to see this experiment go the distance and these up's and down's don't really make much difference in the grand scheme of things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 10, 2022, 08:48:32 PM",
      "body": "Quote from: Queentoshi on July 10, 2022, 05:53:30 PMA quick question for anyone here who purchased bitcoins say on June 9th just before the unexpected dip began? Do you regret your decisions and are you confident that bitcoins will bounce back?All market movements are unexpected and the only certainty is volatility.Anyone who purchases bitcoins at a certain time, should have already understood that the market can always go below their entry level, it could take 8 days or months. Such fluctuations shouldn't bother you much, especially as a long term holder.In 5, 10 or 20 years, it would matter little, if you bought in at $30k or $20k.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "July 10, 2022, 09:12:43 PM",
      "body": "Quote from: Queentoshi on July 10, 2022, 05:53:30 PMA quick question for anyone here who purchased bitcoins say on June 9th just before the unexpected dip began? Do you regret your decisions and are you confident that bitcoins will bounce back?A quick counter question. Was this the first unexpected dip you experienced in crypto? Do you think people who bought, for example, Mar 11, 2020 at $7,900 are regretting their decision now, considering the fact that on Mar 12, 2020 the price dropped to $4,900? There is no one size fits all approach to bitcoin. If you expect to get rich overnight, then probably bitcoin is not for you. If you are a day trader, then you can regret about bad timing, but you need to be prepared for that. However, if you plan to invest long-term, then such dips do not make too much of a difference. The market behaves in waves, with surges and slumps. We are just in the latter part of the current wave.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "July 10, 2022, 09:24:20 PM",
      "body": "I don't mind not buying the dip. No one can predict dips nor peaks, so I just keep byuing whenever I can. I don't even look to the price. It doesn't matter, I'll buy at any price. The point is stacking and hodling!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 11, 2022, 05:48:21 AM",
      "body": "This can only be regretted by those who do not have a long-term vision. If you buy to hold for a couple of cycles you don't care, and if you do DCA the same, or any of its variants, because very few people have a big lump sum and buy only once. The normal thing is to make several purchases, and as you are not going to hit the bottom, unless it is by chance, it doesn't matter if you bought at $30k or $20, the point is to accumulate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "July 11, 2022, 05:50:48 AM",
      "body": "I made a thread and many posts in WO about how Bitcoin is going to retest the 200 Weekly Moving Average when the price was around $44k.I bought 50% at $21.5k and now I am DCAing on my way towards the end of the year to get a good average all over.I think that's the best plan. If you didn't see this dip incoming, you need to understand Bitcoin technically a bit more.Supply vs Demand > Fundamentals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "July 11, 2022, 06:03:55 AM",
      "body": "Price recovery happens for sure. The problem for now is the timeline. We don't know when the price will increase to recover the loss happened out of unexpected market crash. Same as this it has hapein the past and recovery have taken place. As we're in a complete bear market, this time it'll take time. Most of the time once an user experience such a situation and recovers making a profit in the long term or short term, he starts to have more trust over the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 11, 2022, 06:16:30 AM",
      "body": "You are right I regret it a lot when I bought bitcoin at $420 and it dropped down after I bought back in 2015. I lost a lot of money when my $420 worth bitcoins went updown to $21000 per coin in 2022. My huge loss was +4900%. I cry every night for losing so much money LOL.In a couple of years from now when price is $400,000 I will regret again for buying bitcoin at $30,000+ and cry again for \"losing\" +1200%",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "July 11, 2022, 06:23:02 AM",
      "body": "Quote from: Queentoshi on July 10, 2022, 05:53:30 PMA quick question for anyone here who purchased bitcoins say on June 9th just before the unexpected dip began? Do you regret your decisions and are you confident that bitcoins will bounce back?Nope, I don't regret it one bit as even if you bought BItcoin at ~30k (which I did by the way) its still more than 50% lower from the all time high so I would say its a still good buy. Bitcoin at ~20k is of course even a better buy, but there if I learned anything when it comes to buying Bitcoin, its that there is no point trying to buy at the bottom. Instead, its much better to use DCA (and that's exactly what I am doing) so you avoid regretting going all in and then you see price going down much further.Just to add, I wouldn't regret even if I bought Bitcoin at ~67k as all that means is that I would have to wait a little bit longer to be in profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "July 11, 2022, 06:44:54 AMLast edit: July 17, 2022, 06:46:28 AM by Franctoshi",
      "body": "Quote from: Queentoshi on July 10, 2022, 05:53:30 PMThe value of bitcoin dropped unexpectedly this year from $30,215 to $20,385 within a few days from June 9th to June 17th according to coinmarketcap,A quick question for anyone here who purchased bitcoins say on June 9th just before the unexpected dip began? Do you regret your decisions and are you confident that bitcoins will bounce back?No regrets at all since I'm not looking at the short term price target rather the future price of Bitcoin when it's going to be worth more and more and become scarcier and higher in price, therefore I'm even looking forward to getting more cheaper Bitcoin even as I have gotten some Bitcoin around $20k. I love market crash or dips because I've got to understand that it's an opportunity for me to get cheaper Bitcoin so far I have other streams of income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "July 11, 2022, 06:53:51 AM",
      "body": "I did not regret buying before the dip, after or during dip. I've seen how Bitcoin prices went up and down. I am sure that from every purchase I would gain profit and all I have to do is wait or do other stuff to make time to fly faster. If a person is able to feel market mood, then every purchase before dip he can turn into profit through reselling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}