{
  "id": "topic_5418151",
  "title": "CryptoQED",
  "author": "CryptoQED",
  "created_time": "October 24, 2022, 12:36:36 PM",
  "content": "Bitcoin has been through a lot of hardships since its inception and investors and traders are feeling the agony of the crypto market meltdown this year. BTC is now trading at $19,322 at the time of writing.Coingecko reports a 0.3% decrease in value for the token. This month, crypto expert @woonomic tweeted that Bitcoin (BTC) has not yet touched bottom and would not soon rally.However, Twitter’s anonymous crypto expert Capo has suggested that Bitcoin may have a recovery in the near future.https://cryptoqed.com/news/bitcoin-news/bitcoin-rally-imminent-according-to-analyst-who-predicted-2022-crypto-crash/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418151",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "October 24, 2022, 12:50:14 PM",
      "body": "Quote from: CryptoQED on October 24, 2022, 12:36:36 PMBitcoin has been through a lot of hardships since its inception and investors and traders are feeling the agony of the crypto market meltdown this year.Agony?!! Are you serous right now!If someone has been felling that way just because price hasn't been \"shooting to the moon every day\" then that is their own fault and you can't call such people \"investors\" because they have no idea what they are doing.QuoteCoingecko reports a 0.3% decrease in value for the token.Token is referred to what is built on top of another platform known as token platform and relies on that. Like whatever you build in Ethereum platform.Bitcoin is not a token.QuoteThis month, crypto expert @woonomicYou mean some idiot on the internet who claims to be an \"expert\" just because he makes some posts about the price.QuoteHowever, Twitter’s anonymous crypto expert Capo has suggested that Bitcoin may have a recovery in the near future.The reality is that nobody knows since it is not predictable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 24, 2022, 12:54:33 PM",
      "body": "Crypto twitter is expecting for months a bitcoin price rally \"any day now\". Yes, the numbers tell that - if this cycle (counted from halving to halving) is following the same type of \"curve\" as the previous ones did - the crypto winter is about to end. But this doesn't mean anything. The price can still go down (as well as up). The recovery may still not come as early as some expect (you can thank to the global recession).I'll also add that while some read the charts and they're bullish, others read the same charts and they're bearish.So if @woonomic is right, I'd be happy too. But don't count on that. Too much hopium hurts. Better wait, DCA and see. Hope for the best, but be prepared for the worse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "October 24, 2022, 12:54:58 PM",
      "body": "Quote from: CryptoQED on October 24, 2022, 12:36:36 PMCoingecko reports a 0.3% decrease in value for the token. This month, crypto expert @woonomic tweeted that Bitcoin (BTC) has not yet touched bottom and would not soon rally.Bitcoin is not a token, you should know this and differentiate between a coin and a token.Definition of tokensQuote from: tranthidung on July 20, 2022, 03:52:09 AMMain difference between them areA coin has its own blockchain. Whatever its blockchain is, whatever its algorithm is: either Proof of Work, Proof of Stake, DAG, etc. It has an own blokchain.A token does not has its own blockchain. It is built on another blockchain and if that blockchain die, stop working, that token stop working too.In other words, tokens are like parasites on other blockchainsQuoteHowever, Twitter’s anonymous crypto expert Capo has suggested that Bitcoin may have a recovery in the near future.Anyone can say this, in future, in near future but when?We can not and should not time the market. It is why long term investors are winners but short term speculators, gamblers, traders are mostly in pain and get loses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 24, 2022, 12:58:58 PM",
      "body": "Quote from: CryptoQED on October 24, 2022, 12:36:36 PMBitcoin has been through a lot of hardships since its inception and investors and traders are feeling the agony of the crypto market meltdown this year. BTC is now trading at $19,322 at the time of writing.Did you know the meaning of inception? Because clearly you are totally wrong about this. Those that hold bitcoin since its inception in 2009 or some years after are now in wealth. Quote from: CryptoQED on October 24, 2022, 12:36:36 PMCoingecko reports a 0.3% decrease in value for the token. This month, crypto expert @woonomic tweeted that Bitcoin (BTC) has not yet touched bottom and would not soon rally.Clearly corrected by pooya87, bitcoin is a coin, not a token. Even if there is anything that would be token about bitcoin, it would still be altcoins and not bitcoin.Quote from: CryptoQED on October 24, 2022, 12:36:36 PMHowever, Twitter’s anonymous crypto expert Capo has suggested that Bitcoin may have a recovery in the near future.It is like just saying one plus one equals two, we all know that, that another opportunity is coming for people to become rich, which is bitcoin bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "October 24, 2022, 01:07:50 PM",
      "body": "every time internet users see articles about prices going up, expect the price to dip instead. but it may really temporarily like what it did yesterday and then drop the next day. every body wants a bull run. one thing is for sure when it comes to bull run, its always going to happen after halving. next halving is 2024, that's 2 years from now. agony lol excruciating pain right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "October 24, 2022, 01:36:52 PM",
      "body": "Quote from: CryptoQED on October 24, 2022, 12:36:36 PMHowever, Twitter’s anonymous crypto expert Capo has suggested that Bitcoin may have a recovery in the near future.https://cryptoqed.com/news/bitcoin-news/bitcoin-rally-imminent-according-to-analyst-who-predicted-2022-crypto-crash/I believe in crypto anonymous more than crypto experts, I agree with this analysis no one knows all just speculation everywhere about war, inflation, rising interest rates and many more that make bitcoin price slow to recover, I just think that bitcoin can solve the problem of it all, if only everyone noticed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "October 24, 2022, 01:39:24 PM",
      "body": "Why would there be a rally right now? The halvening will happen in early 2024. What would drive the Bitcoin price up before that? The only thing that can happen is some random small uptrends, +10-15%, and eventual similar downtrend. It's been less than 1 year from ATH, how can anyone seriously expect a new rally to new ATH right now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 24, 2022, 01:46:20 PM",
      "body": "Quote from: CryptoQED on October 24, 2022, 12:36:36 PMBitcoin has been through a lot of hardships since its inception and investors and traders are feeling the agony of the crypto market meltdown this year.Cringe.Quote from: CryptoQED on October 24, 2022, 12:36:36 PMCoingecko reports a 0.3% decrease in value for the token.Not that it's grammatically incorrect, but we shouldn't put bitcoin in the same basket with \"tokens\". It's a cryptocurrency on its own.Quote from: CryptoQED on October 24, 2022, 12:36:36 PMThis month, crypto expert @woonomic tweeted that Bitcoin (BTC) has not yet touched bottom and would not soon rally.What?! A \"crypto expert\" (lol) said that we haven't touched the bottom yet? Let me sell my entire bitcoin fortune!Quote from: CryptoQED on October 24, 2022, 12:36:36 PMHowever, Twitter’s anonymous crypto expert Capo has suggested that Bitcoin may have a recovery in the near future.Wow. What a useful assertion. Bitcoin price is going either up or down. That was unexpected.Don't these guys have a job?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "October 24, 2022, 02:04:10 PM",
      "body": "Anybody can speculate and predict the price of Bitcoin base on his/her on view in the market using the chart patterns. Too, a llot of people and many indicators has already called Bitcoin bottom since, yet we're still here consolidating, I think that Bitcoin does what it wants to do at any given time regardless of anyone's prediction.Therefore when traders /market Analysts predict and it comes to pass ,then is right while if the prediction didn't come to pass the analyst is wrong. However, I'm just waiting patiently on Bitcoin and only time will tell where we will be heading to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "October 24, 2022, 02:22:18 PM",
      "body": "Quote from: NeuroticFish on October 24, 2022, 12:54:33 PMCrypto twitter is expecting for months a bitcoin price rally \"any day now\". This reminds me of how, when the price dropped at the beginning of 2018, shortly after hitting the peak of almost 20,000 USD, Youtube was filled with videos warning that a recovery was imminent. In the end I unsubscribed from all the cryptocurrency channels because they were all about the same thing and it was clear that the best of the cycle was over. Regarding this cycle, I believe that little by little the price will go up. Maybe at the end of this year, maybe next year, but the real good stuff won't come until after the next halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "October 24, 2022, 02:55:48 PM",
      "body": "Quote from: CryptoQED on October 24, 2022, 12:36:36 PMBitcoin has been through a lot of hardships since its inception and investors and traders are feeling the agony of the crypto market meltdown this year. BTC is now trading at $19,322 at the time of writing.Coingecko reports a 0.3% decrease in value for the token. This month, crypto expert @woonomic tweeted that Bitcoin (BTC) has not yet touched bottom and would not soon rally.However, Twitter’s anonymous crypto expert Capo has suggested that Bitcoin may have a recovery in the near future.https://cryptoqed.com/news/bitcoin-news/bitcoin-rally-imminent-according-to-analyst-who-predicted-2022-crypto-crash/First of all, there are no true crypto experts that exists, I don't know why people are calling them by that name because they are just like us, speculating on the likelihood of the market in the next few months. These experts cannot even guarantee that bitcoin will indeed recover in that given time, it might happen but it's just a coincidence. And yes, bitcoin has been through a lot of issues, ups and downs all these years but look at it now, it's still existing in the market and still ranked #1 on the most sought after cryptocurrency of all time. What happened lately is not the first time in the history, feeling distress is only for the weak hearted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 24, 2022, 03:26:40 PM",
      "body": "Jeez what a shitty topic based on a click bait article. The Twitter guy you quoted didn't say anything about \"imminent bitcoin rally\" or anything similar of that sort.I reported this topic for being low value but I doubt it will get deleted since there's already dozen replies. Well, at least it should be moved to appropriate board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "October 24, 2022, 03:43:56 PM",
      "body": "Quote from: Rikafip on October 24, 2022, 03:26:40 PMJeez what a shitty topic based on a click bait article. The Twitter guy you quoted didn't say anything about \"imminent bitcoin rally\" or anything similar of that sort.I reported this topic for being low value but I doubt it will get deleted since there's already dozen replies. Well, at least it should be moved to appropriate board.Actually, it wasn't the twitter guy that made mention of \"imminent btc rally\" it was the article writer because when you click on the link and open the page the content are exactly the way OP has posted them. And when you scroll down a bit you will find the quote from the twitter guy below.QuoteGood morning!Market looking good for a last leg up. Higher highs and higher lows on ltf and demand being moved up.We could see 21k this week.I don't really see what the big deal about the tweet because from 19k to 21k which the anonymous dude predicted is not such a big rally to be excited about, the only thing i see is the article writer just want to draw attention with such topic heading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 24, 2022, 04:12:34 PM",
      "body": "Quote from: Bitstar_coin on October 24, 2022, 03:43:56 PMActually, it wasn't the twitter guy that made mention of \"imminent btc rally\" it was the article writer because when you click on the link and open the page the content are exactly the way OP has posted them. And when you scroll down a bit you will find the quote from the twitter guy below.You might wanna read my post again and you will see that I said exactly what you are saying. Article writer is the one who made that clickbait title, while he referred to Twitter guy saying that about bitcoin rally being imminent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}