{
  "id": "topic_5458701",
  "title": "flyingcarpet",
  "author": "flyingcarpet",
  "created_time": "July 05, 2023, 10:39:38 AM",
  "content": "Sıfır araçlara gelen zamlardan TOGG da nasibini aldı. Şirket tarafından yapılan açıklamada, 'Yeni fiyat listesi 5 Temmuz 2023 itibarıyla güncellenmiştir' denildi.v1 standart, v2 standart ve v2 uzun menzil TOGG aracın yeni fiyatlarını görselde görebilirsiniz. Haber kaynağında firmanın kullanıcılarına yaptığı açıklama da yer alıyor.Haberin ve görselin kaynakları:https://finans.mynet.com/haber/detay/otomotiv/sifir-aractaki-artisa-yerli-otomobil-de-katildi-togg-a-ilk-zam-geldi-fiyatlar-1-6-milyon-liranin-uzerine-cikti-tam-yuzde-27/467315/https://twitter.com/webtekno/status/1676501280670228482",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458701",
  "comments": [
    {
      "author": "ZekiBeyy",
      "created_time": "July 05, 2023, 10:47:11 AM",
      "body": "Bunun olacağı zaten belliydi benim için sürpriz olmadı açıkçası. Başvuru yapmak için verilen 60 bin liranız hala 60 bin olarak duruyor o zamandan bu zamana yaklaşık olarak %30-50 arasında kaybınız olduğunuda unutmayın. Şimdi aracı almaktan vazgeçip 60 liranızı alsanız yine zararda olan siz olacaksınız işte böyle saçma bir durum var. Yerli ve Milli....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "July 05, 2023, 10:53:30 AM",
      "body": "Quote from: ZekiBeyy on July 05, 2023, 10:47:11 AMBunun olacağı zaten belliydi benim için sürpriz olmadı açıkçası. Başvuru yapmak için verilen 60 bin liranız hala 60 bin olarak duruyor o zamandan bu zamana yaklaşık olarak %30-50 arasında kaybınız olduğunuda unutmayın. Şimdi aracı almaktan vazgeçip 60 liranızı alsanız yine zararda olan siz olacaksınız işte böyle saçma bir durum var. Yerli ve Milli....Almak isteyenler ve kendisine kurada çıkanlar yeni fiyatlar üzerinden mi ücretlendirilecekler? Aslında bir kontrat ile hakları korunması lazım. 60 bin lirayı veren ve TOGG almayı bekleyen vatandaşlar eski fiyattan almalılar bence. Orada bir katakulli döndürmemeleri lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SUPERSAIAN",
      "created_time": "July 05, 2023, 10:54:28 AM",
      "body": "Dolar kurundan kaynaklı dememişlerde. Globalde yaşanan tedarik zincirindeki aksamadan dolayı üretimimizde aksamalar oluyor falan demişler. Tutsaydınız ya tutabiliyorsanız 1milyon TL'nin aşağısında TOGG'u daha bir kaç ay bile bir milyonun altında tutamadılar aracın fiyatını. 60 bin TL muhabbeti neymiş öyle almaya vazgeçsen paran enflasyonda sana eriyip geri gelecek. Böyle zamanlarda ön koşul için falan fiat para bağlamak çok gereksiz bir yere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "July 05, 2023, 11:00:03 AM",
      "body": "%30 a yakın bir zam gelmiş normal demek isterdim ama bu bildiğiniz fırsatçılık neden zam yaptılar, diğer bütün sektörler olsun zam yaptığında fırsatçılık oluyor ise bunun adı da fırsatçılıktır.Şunu çok merak ediyorum oldu da Dolar 3-4 TL düştü peki bunlar fiyatlarda indirim yapacaklar mı? Ben hiç sanmıyorum indirim yapacaklarını.Neyse para yok zaten alacaklar düşünsün.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 05, 2023, 11:44:49 AM",
      "body": "Quote from: Phoenix Anka on July 05, 2023, 10:53:30 AMQuote from: ZekiBeyy on July 05, 2023, 10:47:11 AMBunun olacağı zaten belliydi benim için sürpriz olmadı açıkçası. Başvuru yapmak için verilen 60 bin liranız hala 60 bin olarak duruyor o zamandan bu zamana yaklaşık olarak %30-50 arasında kaybınız olduğunuda unutmayın. Şimdi aracı almaktan vazgeçip 60 liranızı alsanız yine zararda olan siz olacaksınız işte böyle saçma bir durum var. Yerli ve Milli....Almak isteyenler ve kendisine kurada çıkanlar yeni fiyatlar üzerinden mi ücretlendirilecekler? Aslında bir kontrat ile hakları korunması lazım. 60 bin lirayı veren ve TOGG almayı bekleyen vatandaşlar eski fiyattan almalılar bence. Orada bir katakulli döndürmemeleri lazım. Ne eski fiyatı hocam ya tamamen seçim için hızlandırılmış ve sçeim çalışması haline dönüştürülmüş bir satış politikasından bahsediyoruz. Mayıs sonuna kadar teslim etmeyi taahhüt ettikleri aracın bırakın yarısını bırakın 3 te 1 ini 100 tanesi zor teslim ettiler. Seçim çalışmaları adı altında sıcacık milyarlarca lira kasaya girdi ve paralar kullanıldı.Yerli ve milli araba bile üstüne koya koya gidiyorsa kimse kusura bakmasın ithaller ne yapsa müstehaktır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "July 05, 2023, 01:20:16 PM",
      "body": "Quote from: zonefloor on July 05, 2023, 11:44:49 AMQuote from: Phoenix Anka on July 05, 2023, 10:53:30 AMQuote from: ZekiBeyy on July 05, 2023, 10:47:11 AMBunun olacağı zaten belliydi benim için sürpriz olmadı açıkçası. Başvuru yapmak için verilen 60 bin liranız hala 60 bin olarak duruyor o zamandan bu zamana yaklaşık olarak %30-50 arasında kaybınız olduğunuda unutmayın. Şimdi aracı almaktan vazgeçip 60 liranızı alsanız yine zararda olan siz olacaksınız işte böyle saçma bir durum var. Yerli ve Milli....Almak isteyenler ve kendisine kurada çıkanlar yeni fiyatlar üzerinden mi ücretlendirilecekler? Aslında bir kontrat ile hakları korunması lazım. 60 bin lirayı veren ve TOGG almayı bekleyen vatandaşlar eski fiyattan almalılar bence. Orada bir katakulli döndürmemeleri lazım. Ne eski fiyatı hocam ya tamamen seçim için hızlandırılmış ve sçeim çalışması haline dönüştürülmüş bir satış politikasından bahsediyoruz. Mayıs sonuna kadar teslim etmeyi taahhüt ettikleri aracın bırakın yarısını bırakın 3 te 1 ini 100 tanesi zor teslim ettiler. Seçim çalışmaları adı altında sıcacık milyarlarca lira kasaya girdi ve paralar kullanıldı.Yerli ve milli araba bile üstüne koya koya gidiyorsa kimse kusura bakmasın ithaller ne yapsa müstehaktır. O zaman ne yapılsa müstahak. En fazla tepki gösteren kişiler sıraya ilk giren kişilerdi. O fiyata zaten böyle teknik özellikle sahip full elektrikli SUV olmazdı. Sınıfına yaklaştı fiyatı ve daha da yaklaşacak, zamanla normal fiyatına gelecek. Yerli ve Milli damgası yüzünden ucuz olmasını beklerdim ama beklentiler her zaman ki gibi boşa çıktı. En güzelini Bthd yaptı gitti Tesla aldı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "July 05, 2023, 01:58:49 PM",
      "body": "Mesele TOGG fiyatının değişikliği değil, mesele TOGG’a ulaşamamak aslında. Bu kadar parayı verip arabayı alamıyorsanız bir gariplik vardır. Araçların banttan seri üretime geçişi olduğunu söylüyorlardı seri üretime geçtiyse nasıl insanlar araçlarını alamıyorlar? Değişen fiyatlar sebebiyle geçmiş sipariş veren herkes mağdur olacak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "July 05, 2023, 05:36:29 PM",
      "body": "geçen ekşi sözlük'te bataryalardan kaynaklı olarak günde en fazla 30 araç üretilebildiğini yazmıştı birisi. hatta ilk çıkan araçları da batarya soğutma olayından geri çağrıldıığını vs yazmışlardı. ne kadar doğru bilemem ama neredeyse tesla y modeli ile aynı zamanlarda adı ülkemizde geçen 2 elektrikli araçtan maalesef togg çok sessiz kaldı. zam olayı da kimi şaşırtacak ülkemizde? şayet yukarıda yazdığım gibi üretim kısmında sorun varsa sipariş sonrası arabalar gelene kadar fiyatlar x2 bile olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "July 05, 2023, 08:52:25 PM",
      "body": "Quote from: gospodin on July 05, 2023, 05:36:29 PMgeçen ekşi sözlük'te bataryalardan kaynaklı olarak günde en fazla 30 araç üretilebildiğini yazmıştı birisi. hatta ilk çıkan araçları da batarya soğutma olayından geri çağrıldıığını vs yazmışlardı. ne kadar doğru bilemem ama neredeyse tesla y modeli ile aynı zamanlarda adı ülkemizde geçen 2 elektrikli araçtan maalesef togg çok sessiz kaldı. zam olayı da kimi şaşırtacak ülkemizde? şayet yukarıda yazdığım gibi üretim kısmında sorun varsa sipariş sonrası arabalar gelene kadar fiyatlar x2 bile olur.Elektrikli araçların yanlış hatırlamıyorsam ÖTV dilimi de değişikti, düşük tutulmuştu sırf TOGG fiyatı düşük olsun diye. O matrah değişikliği yaşanırsa fiyat otomatik iki katına çıkar zaten. Çok geç olmadan yapar bunu üstelik. Günde 30 araç üretimi ile neler yapmayı düşünüyoruz? Almanya bizim TOGG’u kıskanırken(!) biz özellikle mi 30 tane üretiyoruz anlamadım?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "July 05, 2023, 08:58:17 PM",
      "body": "Helal olsun adamlara vatandaşı düşünmüşler zam yapmışlar. Sonuçta bu araç şarj olurken harcanan elektrikte hala kömür kullanılıyor. Umarım 2x daha yapar.  Her oyunun hilesi vardır. Bazıları bölümü hızlı geçirmek içindir. Togg'da onlardan biriydi birkaç özel kuruluşa yapılan desteklerle dışarıdan satın alarak ortaya çıkarttıkları ürünü siz kamu zararı yapabilir ne olmuş denen çaykurçay mı sandınız.Seçim haftası oyunu hızlandırma görevi verildi görev tamamlandı İlk alan arkadaşlar ciddi anlamda şanslı hiçbir zaman kıvrak bir zekam olmadı. Bunu alan arkadaşlar Akp sevdalılarına 2-5x arası rahatlıkla satar hele bir bu işin bugu olan akp plaka oldumu bak neler oluyor neler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "July 05, 2023, 09:49:32 PM",
      "body": "Quote from: mandown on July 05, 2023, 08:58:17 PMHelal olsun adamlara vatandaşı düşünmüşler zam yapmışlar. Sonuçta bu araç şarj olurken harcanan elektrikte hala kömür kullanılıyor. Umarım 2x daha yapar.  Her oyunun hilesi vardır. Bazıları bölümü hızlı geçirmek içindir. Togg'da onlardan biriydi birkaç özel kuruluşa yapılan desteklerle dışarıdan satın alarak ortaya çıkarttıkları ürünü siz kamu zararı yapabilir ne olmuş denen çaykurçay mı sandınız.Seçim haftası oyunu hızlandırma görevi verildi görev tamamlandı İlk alan arkadaşlar ciddi anlamda şanslı hiçbir zaman kıvrak bir zekam olmadı. Bunu alan arkadaşlar Akp sevdalılarına 2-5x arası rahatlıkla satar hele bir bu işin bugu olan akp plaka oldumu bak neler oluyor nelerYanlış bir cümle oldu. Plaka ararken AKP değil RTE plaka daha değerli oluyor. Yıllar önce bir şahinde gördüm ve plakayı satıyordu arkadaş şahini hediye veriyordu sene 2018-19 civarı, satış fiyatı 250 bin liraydı çok iyi hatırlıyorum. Ne espirisi var deyince plakanın özel olduğunu söylemişti. Diğer yandan ise bu plaka verilse bile arabasına takmayacak adamlar var. Ülke çok garip bir yere dönüştü.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pierre 2",
      "created_time": "July 06, 2023, 07:37:16 AM",
      "body": "Daha ilk çıktığında bile 950 bin lira o araba için fazlaca ucuzdu. Araba orta segment çünkü yanlış bilmiyorsam. 1 milyon 500 bin lira bence normal bir fiyat. Zaten daha ne olacaktı ki? Doların 30 olmasına ramak kalmış şurada. Tek istediğim şey şu arabanın adam akıllı satıp gerçekten vatandaşın parasının ülkede kalmasını sağlamasıdır. Bu araç ciddi olarak siyaset üstü bir şey. Otomobil üreticileri piyasasında yerli markamızın olması gerekli. Hatta bir değil 2 tane yerli marka olmalı. Çok iyi üretim kapasitemiz var.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "July 06, 2023, 10:45:27 AM",
      "body": "1.2 milyon bandına dayandı sanırım arabanın en düşük segmentinde fiyatı. En yuksek segment ise 1.5 milyonu geçmiş.  Zam ile ilgili açıklamalara baktim, tedarik zincirinde yaşanan maliyet etkileri ve finansal gelişmelere atıfta bulunulmuş. Şimdi asıl soru arabayı almaya hak kazanan ve sırasını bekleyenler bu artıştan payını alacak mı, neticede insanlar o günün koşullarında o fiyattan almaya hak kazanmıştır, aradaki fark bu insanların kabahati değil ki",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "July 06, 2023, 11:04:11 AM",
      "body": "Alınamayacak aracın fiyatının kaç olduğunun önemi yok. İstediği fiyattan versin zaten sadece belli başlı siyasi bağlantısı olan kişiler dışında kimse ulaşamıyor.Fiyatların böyle olacağı belliydi kimse eski halini düşünmesin. Yalandan seçim öncesi ucuz araç dediler ama asla ulaşılabilir olmayacak",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "July 06, 2023, 11:11:44 AM",
      "body": "Bunu sırf 1 milyonun altında araba var diye göstermek için böyle fiyattan satar gibi yaptılar ama ne oldu hemen zam geldi. Biz bunu bekliyorduk da koyunlar ne düşünüyor acaba oy verirken yerli milli arabamız var hepimiz alabiliriz hüloğğ diyenler daha ceplerinde çift mtv ödeyecek parası yokken sevinç çığlıkları attı. İşte Türkiye yüzyılı böyle bir şey tüm dünya bizi kıskanıyor o kadar zenginiz ki vergileri çifter çifter ödüyoruz toggları zamlı fiyattan alıyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hvdv",
      "created_time": "July 06, 2023, 11:20:03 AM",
      "body": "Quote from: LGD2Business on July 06, 2023, 11:11:44 AMBunu sırf 1 milyonun altında araba var diye göstermek için böyle fiyattan satar gibi yaptılar ama ne oldu hemen zam geldi. Biz bunu bekliyorduk da koyunlar ne düşünüyor acaba oy verirken yerli milli arabamız var hepimiz alabiliriz hüloğğ diyenler daha ceplerinde çift mtv ödeyecek parası yokken sevinç çığlıkları attı. İşte Türkiye yüzyılı böyle bir şey tüm dünya bizi kıskanıyor o kadar zenginiz ki vergileri çifter çifter ödüyoruz toggları zamlı fiyattan alıyoruz. Olur mu? Sonuçta yerli ve milli bir araç üretilmiş. Bu üretilen araç her şeye bedel hocam. Çift MTV umrunda değil çünkü arabası yok ve araba alacak parası da yok. Böyle oldukça daha çok vergi isterler. Zaten hükümet kanadında bir sav var piyasa kötü olsa herkes arabasıyla mı gider işe diye garip bir sav, bu savdan hareketle araç sahiplerine her şeyi yaparlar. Bu arada Akaryakıtta otomatik vergi arttırma sistemi de o torba yasada. Bu çok konuşulmuyor da zırt pırt akaryakıt fiyatı artınca bunu da konuşacağız.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "July 06, 2023, 11:50:13 AM",
      "body": "Quote from: Phoenix Anka on July 05, 2023, 01:20:16 PMQuote from: zonefloor on July 05, 2023, 11:44:49 AMQuote from: Phoenix Anka on July 05, 2023, 10:53:30 AMQuote from: ZekiBeyy on July 05, 2023, 10:47:11 AMBunun olacağı zaten belliydi benim için sürpriz olmadı açıkçası. Başvuru yapmak için verilen 60 bin liranız hala 60 bin olarak duruyor o zamandan bu zamana yaklaşık olarak %30-50 arasında kaybınız olduğunuda unutmayın. Şimdi aracı almaktan vazgeçip 60 liranızı alsanız yine zararda olan siz olacaksınız işte böyle saçma bir durum var. Yerli ve Milli....Almak isteyenler ve kendisine kurada çıkanlar yeni fiyatlar üzerinden mi ücretlendirilecekler? Aslında bir kontrat ile hakları korunması lazım. 60 bin lirayı veren ve TOGG almayı bekleyen vatandaşlar eski fiyattan almalılar bence. Orada bir katakulli döndürmemeleri lazım. Ne eski fiyatı hocam ya tamamen seçim için hızlandırılmış ve sçeim çalışması haline dönüştürülmüş bir satış politikasından bahsediyoruz. Mayıs sonuna kadar teslim etmeyi taahhüt ettikleri aracın bırakın yarısını bırakın 3 te 1 ini 100 tanesi zor teslim ettiler. Seçim çalışmaları adı altında sıcacık milyarlarca lira kasaya girdi ve paralar kullanıldı.Yerli ve milli araba bile üstüne koya koya gidiyorsa kimse kusura bakmasın ithaller ne yapsa müstehaktır. O zaman ne yapılsa müstahak. En fazla tepki gösteren kişiler sıraya ilk giren kişilerdi. O fiyata zaten böyle teknik özellikle sahip full elektrikli SUV olmazdı. Sınıfına yaklaştı fiyatı ve daha da yaklaşacak, zamanla normal fiyatına gelecek. Yerli ve Milli damgası yüzünden ucuz olmasını beklerdim ama beklentiler her zaman ki gibi boşa çıktı. En güzelini Bthd yaptı gitti Tesla aldı. Her zaman demişimdir birşey piyasaya ilkkez çıkıyorsa ilk deneyenlerden olmamak lazım. Şimdi herkes bunu derse kim deneyecek bunu diyebilirsiniz. Bu durumda da ülkemizde kodomandan bol birşey yok birde taraftardan bol birşry yok ilk onlar deneyecekti ve alınacaktı. Bende yerli arabanın ithallere göre ucuz olmasını beklerdim. Bırakın ucuz olmasını hiçbir farkı kalmadı neyse bakalım göreceğiz ilerleyen günlerde",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "July 07, 2023, 05:58:49 AM",
      "body": "Her şeye sırayla zam yapılırken TOGG fiyatının sabit kalacağını düşünmek saçmalık olurdu.Dolar 19 Türk lirası iken bu fiyatlar geçerliydi şimdi se 27 türk lirasını görmüş bir para biriminden bahsediyoruz.TOGG, %100 Yerli bir araç olmadığı için bazı araçta kullanılan malzemeler yurtdışından ithal edildiği için bu fiyatına yansıyacaktı ve sonunda oldu sadece.Bu fiyatlara hala iyi olduğunu söyleyebiliriz ama teknik servis veya herhangi bir kronik sorunu olacak mı bunu bilemiyoruz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gramble",
      "created_time": "July 07, 2023, 06:35:33 PM",
      "body": "Beklenen haber geldi !!! Sınıfında satışta pazar lideri olmayı başarmış o kadar reklamı başka bir marka yapsaydı 1 milyon adet satmıştı..Yerli otomobil Togg, elektrikli SUV segmentinde pazar lideri oldu. ‘Bir otomobilden fazlası’ hedefiyle çıktığı yolda Türkiye’nin doğuştan elektrikli ilk akıllı cihazı T10X’i kullanıcılarla buluşturmaya devam eden Togg, iki ayda gerçekleştirdiği satışlarla elektrikli SUV segmentinde pazar lideri olma başarısını gösterdi.Togg, mayıs ve haziran aylarında 808 adet T10X’i kullanıcılara teslim ederek, elektrikli C-SUV segmentinde yüzde 28,9’luk payla pazar lideri oldu. T10X, toplam elektrikli SUV pazarında da yüzde 15’lik pazar payı ile haziran sonu itibarıyla liderliğe yerleşti.Kaynak : Milliyet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}