{
  "id": "topic_5441920",
  "title": "Macadonian",
  "author": "Macadonian",
  "created_time": "March 03, 2023, 01:36:06 AMLast edit: March 03, 2023, 01:53:12 AM by Macadonian",
  "content": "Lets imagine a world where Bitcoin has taken over as the main currency of the world and that almost everyone uses Bitcoin. What would happen if events like the Value Overflow Incident[1] or CVE-2018-17144 [2] happened again when Bitcoin was being used and relied on by most of the world?When both of these events occurred  they were corrected shortly after but the Value overflow incident required a rollback of the Blockchain which was fine back in 2010 when only a few people used Bitcoin but what effect would rolling back the Blockchain have when most of the world uses Bitcoin? If you think about how many times visa/master cards are used which crypto.com claims 24,000 a second [3] second then rolling back the Bitcoin Blockchain would roll back maybe millions of transactions which were concluded at the time. Goods or services that were bought with those transactions may have been completed and during a event like this the vendor could lose out on their payment.Would this harm Bitcoin because everyone who used it would lose faith in its integrity or do you think it would not have a big impact? The 2nd example the Bitcoin core devs found a way of printing unlimited Bitcoin but it found it early enough to fix it. 2018 a lot more people were using Bitcoin and if someone did exploit it we could have seen a lot of faith in Bitcoin be lost. How can we prevent this in the future because once we have converted all the world or most of the world we cannot afford for things like this to happen imo and it could destroy further adoption of Bitcoin if a big enough event like the previous two occurs when most of the world uses Bitcoin.1. https://en.bitcoin.it/wiki/Value_overflow_incident2. https://bitcoincore.org/en/2018/09/20/notice/3, https://crypto.com/university/blockchain-scalabilitytldr: What would happen if the Bitcoin blockchain was rolled back when most of the world depended on it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441920",
  "comments": [
    {
      "author": "pooya87",
      "created_time": "March 03, 2023, 04:55:09 AM",
      "body": "Quote from: Macadonian on March 03, 2023, 01:36:06 AMLets imagine a world where Bitcoin has taken over as the main currency of the world and that almost everyone uses Bitcoin. What would happen if events like the Value Overflow Incident[1] or CVE-2018-17144 [2] happened again when Bitcoin was being used and relied on by most of the world?Implementations of Bitcoin that have such a bug would accept the invalid block(s) in their chain and the other implementations of Bitcoin that don't have the bug would reject them hence splitting the network into two chains. After a short time the shorter invalid chain would be reorged and the buggy implementations would follow the correct chain which would have the most work too.The risk of double spend would be higher during that short period but it depends on the number of confirmation the receivers demand and how quickly they detect the chain split which is easy to do if their node has a good enough number of connections to various implementations.QuoteWhen both of these events occurred  they were corrected shortly after but the Value overflow incident required a rollback of the Blockchain I don't think it is correct to call it a \"rollback\" since it was just getting rid of invalid blocks.QuoteWhat would happen if the Bitcoin blockchain was rolled back when most of the world depended on it? It depends on a lot of variables. Just seeing a \"rollback\" or reorg does not automatically mean double spends since the same transactions could be in the other valid chain in the other valid blocks already mined. It also depends on what the target of the theoretical attack is, for example a centralized exchange is a possible target and them losing money is nothing new!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "garlonicon",
      "created_time": "March 03, 2023, 06:31:32 AM",
      "body": "Quotethe Value overflow incident required a rollback of the BlockchainIt was still solved before reaching coinbase maturity. That means, all normal transactions were unaffected. Only coinbase transactions were reverted, and only those, which had below 100 confirmations, and in that case, none of them were spent, so in practice, there was no real loss of coins (because you cannot consider a coinbase transaction to be \"yours\" before reaching that maturity, it is the whole point of waiting 100 blocks, just to avoid loss of funds).QuoteGoods or services that were bought with those transactions may have been completed and during a event like this the vendor could lose out on their payment.This is also false, because in case of chain split, usually transactions are confirmed in both chains. If some transaction is valid, but included in the wrong chain, it is not automatically \"banned\", it is simply included in the right chain, because it is still broadcasted in the network.QuoteThe 2nd example the Bitcoin core devs found a way of printing unlimited Bitcoin but it found it early enough to fix it.Again, coinbase maturity is the answer. As long as coin amounts are explicitly visible, there are enough eyes looking at total supply to catch it. We have even RPC commands that can count all coins in circulation, we have pages showing capitalization, and tracing the supply.Also note that even if those coins will be unnoticed for a long time, then still, it is possible to remove them in a soft-fork way. Because soft-forks are about making currently valid transactions invalid in the new version. So, if that history will be set in stone, then still, it is possible to apply a soft-fork, that would burn overprinted coins, until reaching the proper amount. Note that it is possible to move additional coins into fees first, and then miners could claim less amount in the coinbase transaction.Then, it will be fully compatible with old clients, and both versions will meet in the same point. Because you can try, and reintroduce bug from Value Overflow Incident in the latest version, and recompile it. You will still synchronize the whole chain, because there was no hard-fork used to fix this bug. And in practice, none is needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "March 03, 2023, 08:13:13 AM",
      "body": "Here's the thing: Just like in 2018, the vulnerability will usually be caught by bitcoin developers before anyone has a chance to exploit it. Then, most of the world's nodes will be using the new patch, and the few nodes that remain unpatched will not affect the status of transactions because they are a minority.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Macadonian",
      "created_time": "March 03, 2023, 01:33:11 PM",
      "body": "I think I am not understanding something because I have been reading from the sources and they all use the world rollback for the value overflow incident. Let me understand no transactions were rejected only those that were invalid? The invalid ones are the ones that created Bitcoin that did not exist on the network and they just roll backed those transactions and not the whole Blockchain? Quote from: garlonicon on March 03, 2023, 06:31:32 AMQuotethe Value overflow incident required a rollback of the BlockchainIt was still solved before reaching coinbase maturity. That means, all normal transactions were unaffected. Only coinbase transactions were reverted, and only those, which had below 100 confirmations, and in that case, none of them were spent, so in practice, there was no real loss of coins (because you cannot consider a coinbase transaction to be \"yours\" before reaching that maturity, it is the whole point of waiting 100 blocks, just to avoid loss of funds). What does coinbase maturity mean? Sorry I am not the most technical person. You do not mean Coinbase as the exchange? I thought 6 confirmations was enough to be satisfied that a transaction could not be reverted. So if coinbase maturity means waiting for 100 blocks to be confirmed then any transaction that did not meet 100 confirmations would be rolledback? If that happened and the world used Bitcoin then millions of transactions could still be lost on the roll back. Most merchants accept a transaction when it is recorded on the blockchain and some require 6 confirmations but I have never heard of any merchant unwilling to give you their goods or services until a transaction has reached 100 confirmations so I still think that merchants would lose confidence in accepting Bitcoin for small transactions. If I buy a coffee for a few satoshi am I expected to wait 100 confirmations before the merchant will give me that coffee just in case something like the value overflow incident happened again? Because I do not know how long 100 confirmations would take but it would take a very long time and would not be suitable for daily transactions. Quote from: NotATether on March 03, 2023, 08:13:13 AMHere's the thing: Just like in 2018, the vulnerability will usually be caught by bitcoin developers before anyone has a chance to exploit it. Then, most of the world's nodes will be using the new patch, and the few nodes that remain unpatched will not affect the status of transactions because they are a minority.It has happened twice in Bitcoin history and the 1st time it was not caught and someone successfully printed more Bitcoin then the 21 million cap but it was rolled back. 50% chance of finding it before someone exploits it and causes more work for the Bitcoin developers but I know the developers can roll back or invalidate the printed Bitcoin transactions what I am concerned about is if something like this happens again then we lose a lot of confidence from merchants accepting Bitcoin that have not reached enough confirmations and it could remove the possibility of using Bitcoin for small every day transactions. I might not understand what you guys are saying so please be kind haha I am trying to learn how big of a problem this could be in the future when a lot of people are using Bitcoin or if it is something that I should not worry about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "March 03, 2023, 02:15:25 PM",
      "body": "QuoteWhat does coinbase maturity mean?It means that if some miner will get some new coins, then they cannot be spent immediately. That miner has to wait 100 blocks to move those funds. This is needed, because if you have a coinbase transaction, then in case of chain reorganization, it will be replaced. All other non-coinbase transaction does not need such protection, because they can be included by every splitted chain. Also, any non-coinbase transaction can be included later. But when you have coinbase, then you have a block number, so you cannot include it in any later block (not to mention that if there is some halving, or if you include transactions with different fees, then your amount in coinbase could be higher than required).QuoteYou do not mean Coinbase as the exchange?Historically, the name \"coinbase\" was Bitcoin-specific first, and that exchange was created later. Every block has some transactions. The first one is called \"coinbase\", because it is the base for introducing new coins. It is the only transaction in a block that can create new coins, or take fees from other transactions. And it is created by the miner that creates a block, not by other users.QuoteI thought 6 confirmations was enough to be satisfied that a transaction could not be reverted.For users, yes. For miners, no. It is consensus rule that miners need 100 confirmations.QuoteIf that happened and the world used Bitcoin then millions of transactions could still be lost on the roll back.No, because if you have non-coinbase transaction, then it can be included in the same or later block. So, if you have A->B transaction, then you can have B->C transaction, even in the same block. And any splitted chain can also include it. Only miners have to wait for 100 confirmations, other users can spend funds immediately, even with zero confirmations, then both transactions can be included in the same block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Macadonian",
      "created_time": "March 03, 2023, 02:26:52 PM",
      "body": "Quote from: vjudeu on March 03, 2023, 02:15:25 PMFor users, yes. For miners, no. It is consensus rule that miners need 100 confirmations.Ok so when a block is mined Bitcoin cannot be moved until 100 confirmations have happened after it has been mined? If that is the case a roll back only needs to invalidate the transactions which have yet to confirm 100 times so a rollback means that blocks mined would be rolled back and not users transactions?Sorry for the questions I am trying my hardest to understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vjudeu",
      "created_time": "March 03, 2023, 03:03:05 PM",
      "body": "QuoteOk so when a block is mined Bitcoin cannot be moved until 100 confirmations have happened after it has been mined?For newly generated coins? Yes. For other transactions? No. But those other transactions will be included in every other chain as well, so when that chain will be replaced, those transactions will not have zero confirmations, but they will already be deeply confirmed in the new chain. So, if after 70 blocks, the chain will be reorganized, and if your transaction had 50 confirmations in the old chain, it could have for example 48 confirmations in the new chain.QuoteIf that is the case a roll back only needs to invalidate the transactions which have yet to confirm 100 times so a rollback means that blocks mined would be rolled back and not users transactions?Only newly generated coins will be rejected, as long as the chain reorganization is shorter than 100 blocks. And in case of Value Overflow Incident, everything was fixed after 74691-74638=53 blocks, so only if some miner generated new coins in the old chain, those coins vanished. But those miners didn't have any chance to spend those coins, so before reaching 100 confirmations, miners cannot assume that they generated anything, because their new coins are not yet confirmed by the consensus rules. And any transactions made by non-mining users, were confirmed in both chains at the same time, so users saw things like their number of confirmations changed, for example from 50 to 48, and that was all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "March 03, 2023, 05:04:20 PM",
      "body": "The question becomes: what happens if the entire world is dependent on a software, and a bug is exploited in that software? The answer is that the developers will take on. There isn't much to discuss. What happened with Windows and Eternal Blue? A ransomware attack that affected hundreds of thousands of computers, and resulted into billions of dollars in damage. What about Adobe Flash? In 2015, some fellows cyberattacked the Hacking Team, and tons of sensitive information was compromised. In 2014, OpenSSL had a bug exploit which allowed hackers to steal private keys and passwords from millions of sites. People continued using these products / software normally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "March 03, 2023, 07:28:08 PM",
      "body": "From a financial view point, the answer to this question \"what if?\" Is: 1- for traders, they must not panic and just stop trading, meaning, don't panic.2- for ordinary users, they must not panic and just stop transacting until every issue is solved.3- for exchanges, they must halt all operations related to trades, meaning they should not panic.It all boils down to: do not panic and wait for recovery, in a decentralized economy you just need to have patience.Technical standpoints were covered on previous posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Macadonian",
      "created_time": "March 04, 2023, 12:27:41 PM",
      "body": "Quote from: BlackHatCoiner on March 03, 2023, 05:04:20 PM What happened with Windows and Eternal Blue? A ransomware attack that affected hundreds of thousands of computers, and resulted into billions of dollars in damage. What about Adobe Flash? In 2015, some fellows cyberattacked the Hacking Team, and tons of sensitive information was compromised. In 2014, OpenSSL had a bug exploit which allowed hackers to steal private keys and passwords from millions of sites. People continued using these products / software normally. I understand what you are saying but Windows has millions of dollars to invest in advertisement campaigns which Bitcoin will never have because it is a decentralized platform. Windows spends millions each year to persuade people in buying their products and when vulnerabilities are exposed they try to correct their image through their advertisement campaigns. Adobe Flash has been abandoned because of how insecure it was Adobe was around for so long because it was funded by advertisements the same way Windows was but Microsoft ended support of Adobe[1] because of insecurity so this builds credit to my concerns. If Bitcoin was to have a big vulnerability people would lose faith and companies will look for alternatives. 1: https://learn.microsoft.com/en-us/lifecycle/announcements/update-adobe-flash-support",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serveria.com",
      "created_time": "March 06, 2023, 10:16:59 PM",
      "body": "Quote from: Macadonian on March 03, 2023, 01:36:06 AMLets imagine a world where Bitcoin has taken over as the main currency of the world and that almost everyone uses Bitcoin. What would happen if events like the Value Overflow Incident[1] or CVE-2018-17144 [2] happened again when Bitcoin was being used and relied on by most of the world?When both of these events occurred  they were corrected shortly after but the Value overflow incident required a rollback of the Blockchain which was fine back in 2010 when only a few people used Bitcoin but what effect would rolling back the Blockchain have when most of the world uses Bitcoin? If you think about how many times visa/master cards are used which crypto.com claims 24,000 a second [3] second then rolling back the Bitcoin Blockchain would roll back maybe millions of transactions which were concluded at the time. Goods or services that were bought with those transactions may have been completed and during a event like this the vendor could lose out on their payment.Would this harm Bitcoin because everyone who used it would lose faith in its integrity or do you think it would not have a big impact? The 2nd example the Bitcoin core devs found a way of printing unlimited Bitcoin but it found it early enough to fix it. 2018 a lot more people were using Bitcoin and if someone did exploit it we could have seen a lot of faith in Bitcoin be lost. How can we prevent this in the future because once we have converted all the world or most of the world we cannot afford for things like this to happen imo and it could destroy further adoption of Bitcoin if a big enough event like the previous two occurs when most of the world uses Bitcoin.1. https://en.bitcoin.it/wiki/Value_overflow_incident2. https://bitcoincore.org/en/2018/09/20/notice/3, https://crypto.com/university/blockchain-scalabilitytldr: What would happen if the Bitcoin blockchain was rolled back when most of the world depended on it? Well, we can't because all software is prone to bugs and bugs are being found and dealt with regularly. Bitcoin had surprisingly few severe bugs and security incidents so far if compared to most other software (at least which were publicly announced). At least I haven't heard about someone successfully double-spending or stealing coins from a random wallet. Have you?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maxre",
      "created_time": "March 07, 2023, 05:39:47 PMLast edit: March 08, 2023, 07:30:40 AM by Maxre",
      "body": "Quote from: Macadonian on March 03, 2023, 01:36:06 AMLets imagine a world where Bitcoin has taken over as the main currency of the world and that almost everyone uses Bitcoin. What would happen if events like the Value Overflow Incident[1] or CVE-2018-17144 [2] happened again when Bitcoin was being used and relied on by most of the world?When both of these events occurred  they were corrected shortly after but the Value overflow incident required a rollback of the Blockchain which was fine back in 2010 when only a few people used Bitcoin but what effect would rolling back the Blockchain have when most of the world uses Bitcoin? If you think about how many times visa/master cards are used which crypto.com claims 24,000 a second [3] second then rolling back the Bitcoin Blockchain would roll back maybe millions of transactions which were concluded at the time. Goods or services that were bought with those transactions may have been completed and during a event like this the vendor could lose out on their payment.Would this harm Bitcoin because everyone who used it would lose faith in its integrity or do you think it would not have a big impact? The 2nd example the Bitcoin core devs found a way of printing unlimited Bitcoin but it found it early enough to fix it. 2018 a lot more people were using Bitcoin and if someone did exploit it we could have seen a lot of faith in Bitcoin be lost. How can we prevent this in the future because once we have converted all the world or most of the world we cannot afford for things like this to happen imo and it could destroy further adoption of Bitcoin if a big enough event like the previous two occurs when most of the world uses Bitcoin.1. https://en.bitcoin.it/wiki/Value_overflow_incident2. https://bitcoincore.org/en/2018/09/20/notice/3, https://crypto.com/university/blockchain-scalabilitytldr: What would happen if the Bitcoin blockchain was rolled back when most of the world depended on it? Oh yeah bro, your speculations are good But I want to say that this is just a theory but in real life that could be possible because governments and other high class people won't follow them. There are more mysteries than we can ever imagine at that time. So Bitcoin can never be adopted properly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "March 07, 2023, 05:56:21 PM",
      "body": "Quote from: Macadonian on March 04, 2023, 12:27:41 PMI understand what you are saying but Windows has millions of dollars to invest in advertisement campaigns which Bitcoin will never have because it is a decentralized platform.What do advertising have to do with any of this? What happens is this: the software you trust happens to have some serious bug. The developers thrive to fix it. Would you still use it? In my opinion, yes. Quote from: Macadonian on March 04, 2023, 12:27:41 PMAdobe Flash has been abandoned because of how insecure it was Adobe was around for so long because it was funded by advertisements the same way Windows was but Microsoft ended support of Adobe[1] because of insecurity so this builds credit to my concerns.Actually, the real reason why Flash was started to get abandoned, was due to Apple for refusing to have it as intermediary during the launch of the first iPhone, but that opens up another discussion. Flash was buggy, and still, it was the most popular and widely used animation software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Macadonian",
      "created_time": "March 08, 2023, 12:16:06 AM",
      "body": "Quote from: BlackHatCoiner on March 07, 2023, 05:56:21 PMWhat do advertising have to do with any of this? What happens is this: the software you trust happens to have some serious bug. The developers thrive to fix it. Would you still use it? In my opinion, yes. The more money a company has for advertising the more they can recover from vulnerabilities. Microsoft uses millions of dollars every year to advertise Windows and it is the most popular operating system because of the advertisement and a lot of people here talk about how Windows is not secure so they have lost a lot of peoples faith in the product. Any one who knows how Linux works compared to Windows knows that Windows is terrible but most people outside of this forum do not know it because they are brain washed by the advertisement campaigns by Microsoft.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}