{
  "id": "topic_5409780",
  "title": "Samrean",
  "author": "Samrean",
  "created_time": "August 13, 2022, 08:55:27 PM",
  "content": "I have been observing few accounts in the local thread who are playing intelligently to get merits by posting tweets pics and text in order to get merit in WO and also distribute too much merits between them.The Accounts suspected areHamza2424WatCheThemePenZAINmalik75 Previously i reported Possible Merit Abuse in local board and later NoorulHuda was banned and Cosmic Beyonders got negative trust and account stops posting but their tactics were same.The game plan is to post tweets from famous twitter accounts in WO (its a copy past with zero effort plus they give source link to make the safe) and get merits. Also they distribute merits between each other in local thread too much and with some planning all of them are reaching Full member. Recently the exchange of merits is too much.  Previously NoorulHuda and Cosmic Beyonders were doing same and people pointed out too. (https://bitcointalk.org/index.php?topic=178336.msg59852248#msg59852248)Check the post history especially for suspected accounts and you will find too many tweets spams with no real effort to write anything themselves and too get the merits. Also you will find their post one after the other in WO.  Also check the images they use of full scale pics only to spam in the WO. Let's see if they try to edit their post after seeing this threads.Anyways sharing my observations which was noticing for a long time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409780",
  "comments": [
    {
      "author": "suchmoon",
      "created_time": "August 14, 2022, 12:41:12 AM",
      "body": "I believe I have reported at least one of those for plagiarism but it's been a while so I can't be sure. Anyway, WO is good for merit farming and even occasional plagiarism since mods ignore it, and seems that some users (or one sockpuppeting user) turned it into a nice little project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "August 14, 2022, 03:32:36 AM",
      "body": "Quote from: Samrean on August 13, 2022, 08:55:27 PMAlso you will find their post one after the other in WO.  Also check the images they use of full scale pics only to spam in the WO. Interestingly I do not see you made any post in WO yet you are complaining about merit distribution in WO. There are user who use it to whore merit but we got used to it. A user can not continue for long if they do not have genuine interest in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "August 14, 2022, 03:41:20 AM",
      "body": "Quote from: BitcoinGirl.Club on August 14, 2022, 03:32:36 AMInterestingly I do not see you made any post in WO yet you are complaining about merit distribution in WO.I don't see how posting in WO would benefit the OP.Quote from: BitcoinGirl.Club on August 14, 2022, 03:32:36 AMThere are user who use it to whore merit but we got used to it. A user can not continue for long if they do not have genuine interest in the forum.Sure they can. Farm merit to rank up a bunch of accounts and them spam the shit out of the forum with low-quality signature shitposting. They have genuine interest in making money and no interest in the quality of the discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "August 14, 2022, 03:55:11 AM",
      "body": "Quote from: suchmoon on August 14, 2022, 03:41:20 AMQuote from: BitcoinGirl.Club on August 14, 2022, 03:32:36 AMInterestingly I do not see you made any post in WO yet you are complaining about merit distribution in WO.I don't see how posting in WO would benefit the OP.My point was without being a regular in WO OP is complaining about merit distribution in WO. I could be wrong to sense it though.QuoteSure they can. Farm merit to rank up a bunch of accounts and them spam the shit out of the forum with low-quality signature shitposting. They have genuine interest in making money and no interest in the quality of the discussion.The financial motivation was not in my mind LOL. I take off what I said 🤣I was speaking from my own experience. When I am enjoying my time I am regular in the forum but when I not having good time around then I do not feel to make posts even for months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 14, 2022, 07:12:20 AM",
      "body": "Quote from: BitcoinGirl.Club on August 14, 2022, 03:55:11 AMMy point was without being a regular in WO OP is complaining about merit distribution in WO. I could be wrong to sense it though.I don't think you have to post there to notice the thread I also think WO-users are very capable to decide which posts deserve Merit. In general, the Merit to post ratio is very high there, and that makes it an attractive place for Merit farmers. I'm surprised it doesn't happen more often.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "August 14, 2022, 07:56:34 AM",
      "body": "Quote from: BitcoinGirl.Club on August 14, 2022, 03:55:11 AMMy point was without being a regular in WO OP is complaining about merit distribution in WO. I could be wrong to sense it though.Mate, I think this kind of action is not off limits to any user. Someone is still not obligated to post on a particular board but they can care enough about abuse of merit, quality of posts and so on that when they come to complain then take the bright side and listen. I mean I can still distribute merit on local boards, reporting posts even though I don't post there.Quote from: BitcoinGirl.Club on August 14, 2022, 03:55:11 AMThe financial motivation was not in my mind LOL. I take off what I said 🤣I was speaking from my own experience. When I am enjoying my time I am regular in the forum but when I not having good time around then I do not feel to make posts even for months.In forums we cannot expect other people to have the exact same mindset as us. This is a unique forum where we have things that are never the same among users with different cultures, knowledge, backgrounds, economies. So we shouldn't think people have to have the same mindset as us.So far I think WO is an easier place for spammers to get merit without putting too much effort into improving the quality of their posts. They can post memes, some words or whatever just to get merit, but I'm not generalizing all users there are the same. It's just about some users who aren't really sincere about having a good discussion about bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "August 14, 2022, 11:58:07 AMLast edit: August 14, 2022, 12:34:28 PM by dragonvslinux",
      "body": "Personally I care much more about the value of posts, than the intent on posting, even if I do bare the OP's opinion in my mind and therefore sometimes I don't send merit because of this (WatChe comes to mind).For example one of those users mentioned - Hamza2424 - I have sent merit a handful of times for charts mainly regurgitated from twitter. This for me is useful/vauable as I don't spend much time on twitter looking at charts or analysis, so WO helps to refine this process for me with other users posting what they consider to be the most relevant. As long as it has a source, I don't see any issue with that, and it remains useful for me.Is it a very lazy form of posting, without adding much additional opinion yourself? For sure, and that's why I usually don't give more than +1 if the analysis isn't original. But doesn't make it less useful personally.A few examples: 1 | 2 | 3 | 4. Note I'm also not the only one who finds these types of posts useful, or with value.Quote from: _BlackStar on August 14, 2022, 07:56:34 AMSo far I think WO is an easier place for spammers to get merit without putting too much effort into improving the quality of their posts. They can post memes, some words or whatever just to get merit, but I'm not generalizing all users there are the same. It's just about some users who aren't really sincere about having a good discussion about bitcoin.Could someone explain the difference (in terms of value) of a hat-wearing WO member regurgitating a chart or meme from twitter and getting 5-20 merits for it, compared to some newbie or low ranking member getting 1-4? Obviously the intent from WO regulars is rarely to gain merit (as most have enough), but I don't see how the post value is any different. Double standards come to mind here.If others want to be \"more careful\" with who they send merit to, then you are more than welcome. Personally I'll merit what I find useful or of value to me, because I'm meriting a post not a user.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 14, 2022, 12:22:24 PM",
      "body": "Quote from: Samrean on August 13, 2022, 08:55:27 PMI have been observing few accounts in the local thread who are playing intelligently to get merits by posting tweets pics and text in order to get merit in WO and also distribute too much merits between them.The Accounts suspected areHamza2424WatCheThemePenZAINmalik75 Previously i reported Possible Merit Abuse in local board and later NoorulHuda was banned and Cosmic Beyonders got negative trust and account stops posting but their tactics were same.The game plan is to post tweets from famous twitter accounts in WO (its a copy past with zero effort plus they give source link to make the safe) and get merits. Also they distribute merits between each other in local thread too much and with some planning all of them are reaching Full member. Recently the exchange of merits is too much.  Previously NoorulHuda and Cosmic Beyonders were doing same and people pointed out too. (https://bitcointalk.org/index.php?topic=178336.msg59852248#msg59852248)Check the post history especially for suspected accounts and you will find too many tweets spams with no real effort to write anything themselves and too get the merits. Also you will find their post one after the other in WO.  Also check the images they use of full scale pics only to spam in the WO. Let's see if they try to edit their post after seeing this threads.Anyways sharing my observations which was noticing for a long time.Hey Dear Asslam o Alikum.My Dear All members on Bitcointalk Listen to me very carefully. This is my Community Pakistans Monthly Anlysis done by me.https://bitcointalk.org/index.php?topic=232519.msg60700439#msg60700439First thing i use to post in WO from very long as First merit recived from JJG on WO from that day I'm regular to WO. Check there are only 20 active members in last month.There is no point on Palgrism Alhamdulliah i use to add Source in every single post check you will come to know there every single post i do i mention the source.Without any hesitation i post in WO as some meme BTC related stuff daily and i receive very good number of merits fro WO. Then My local community i use to send those smerits to active and good posters.And i think Wo members who merit me are one of top users on the Bitcointalk so they better know Quality of Post and as well i would like to mention again from Day 1 posting with Reffence i have sources on Twitter as BTC magazine, BTC Quotes, BTC memes and many other as Glassnode, OnchainCollege, PLCB and PlanC. i use to follow them and post their useful posts with Reffence. sometimes very rare i dont put Source link when i dont get it i use to say Unknown source.Checkout not even 1 single merit has been sent to Non Quality Post as one liners. And please take the name Samreen also in this list as i gave many merit to her as well.There are a few active members and i use to merit them up on day of independence by very very Sad moment i have to say she seems jealous as many members of my Community posting in WO and earning merits.Please Notice that i can send my merit to anyone by that should not be spam so check its not spam its supporting spirit of my Community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 14, 2022, 12:38:07 PM",
      "body": "Quote from: dragonvslinux on August 14, 2022, 11:58:07 AMPersonally I care much more about the value of posts, than the intent on postingValid point. I don't even mind seeing valuable posts from Twitter here, because I don't use Twitter (and my computer can't even access it).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 14, 2022, 12:47:48 PM",
      "body": "Quote from: LoyceV on August 14, 2022, 12:38:07 PMQuote from: dragonvslinux on August 14, 2022, 11:58:07 AMPersonally I care much more about the value of posts, than the intent on postingValid point. I don't even mind seeing valuable posts from Twitter here, because I don't use Twitter (and my computer can't even access it).Thanks sir, But i would like to know is its Palgrism if my all posts own a reffence to original source.What is wrong in meriting my Community members with good posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 14, 2022, 01:04:00 PM",
      "body": "Quote from: Hamza2424 on August 14, 2022, 12:47:48 PMi would like to know is its Palgrism if my all posts own a reffence to original source.Plagiarism by definition doesn't provide a reference link. Post a link and you're good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "August 14, 2022, 02:32:53 PM",
      "body": "Quote from: Hamza2424 on August 14, 2022, 12:47:48 PMQuote from: LoyceV on August 14, 2022, 12:38:07 PMQuote from: dragonvslinux on August 14, 2022, 11:58:07 AMPersonally I care much more about the value of posts, than the intent on postingValid point. I don't even mind seeing valuable posts from Twitter here, because I don't use Twitter (and my computer can't even access it).What is wrong in meriting my Community members with good posts.I don't see a problem with it, as long as they aren't shit posts or sockpuppets and generally I'd encourage it. Personally this is how I see merit distribution is intended; from merit sources -> high merit earning individuals -> lower merit earning users and to local community boards. Ideally merit sources would have infinite amount of time in order to merit lower merited individuals and newbies, but this is unrealistic. Other members obviously have different opinions and prefer more of a gate-keeping strategy in order to avoid merit ending up \"in the wrong hands\". This is predominantly due to DT1 eligibility being based on trust from merit earning individuals, so merit abuse becomes an issue. Despite being a relevant concern the root problem imo is with the system of DT1 eligibility, rather than merit distribution itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}