{
  "id": "topic_5426976",
  "title": "arabspaceship123",
  "author": "arabspaceship123",
  "created_time": "December 08, 2022, 02:41:41 PM",
  "content": "If you're searching for vanity address generators be careful you'll find scams. In the first search outputs I've found a scam to steal Bitcoins bitcoinvanityaddress.comOnline generators aren't safe they'll record private keys. One day you'll discover your coins aren't in your wallet. Don't use websites to generate vanity addresses you can't trust them. It's not worth taking shortcuts.Samr7 vanitygen hasn't updated in 10 years. It's a trusted option https://github.com/samr7/vanitygen",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5426976",
  "comments": [
    {
      "author": "albon",
      "created_time": "December 08, 2022, 06:00:46 PM",
      "body": "In fact, the domain is new, and I do not have explicit proof that I accuse it of a scam, but it targets beginners who do not even know how to create a wallet for bitcoins. Through this site, after clicking on Generate, it gives you a new wallet address for your bitcoins and a private key to use, and perhaps after you open the wallet and deposit your bitcoins, they will steal what you deposited, so I do not advise at all to use online generators sites, and any beginner can easily create a wallet from the official sites and uses it without generators sites.QuoteDomain: BITCOINVANITYADDRESS.COMRegistrar URL: http://www.nicenic.netRegistrar: Nicenic International Group Co., LimitedIANA ID 3765Status: clientTransferProhibited, ClientDeleteProhibitedCreation Date: November 14, 2022 (3 weeks agoUpdate Date: November 14, 2022 (3 weeks ago)Expiration Date: November 14, 2023Age: 24 daysRegistry Registrant ID: Not Available From RegistryRegistrant Organization: Vlad ArtemievRegistrant State/Province: NoneRegistrant Country: RORegistrar Abuse Contact Email: support@nicenic.netRegistrar Abuse Contact Phone: +853.2354112SOURCE: https://www.domainiq.com/domain?bitcoinvanityaddress.com#/whois",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}