{
  "id": "topic_5417591",
  "title": "DaveF",
  "author": "DaveF",
  "created_time": "October 18, 2022, 10:21:42 PM",
  "content": "Was thinking about the way something was done 35+ years ago on a BBS I was on.You could be banned BUT there were 2 types of bans; the forever ban as it was called which is the same as the perma ban here and the X day ban where you could come back BUT who you were was gone. You came back as a new user. It did work to keep things a bit calmer because, there was no rank or merit or trust post count was king. Would something like that work here? It would allow mods / staff to ban people a lot more quickly but not worry about people coming back.Certain things, like plagiarism and threats could still be perma bans. But, other offenses just get you a 30 or 60 or 90 day vacation and welcome back to being a newbie.No idea why it tripped across my brain today but does anyone think it would help here?-Dave",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417591",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "October 18, 2022, 10:33:28 PM",
      "body": "Quote from: DaveF on October 18, 2022, 10:21:42 PM the X day ban where you could come back BUT who you were was gone. You came back as a new user. It did work to keep things a bit calmer because, there was no rank or merit or trust post count was king. ....But, other offenses just get you a 30 or 60 or 90 day vacation and welcome back to being a newbie.Is it a little bit harsh? The temp ban without posting or pm i guess is enough. Considering the time that will be consumed again just to get merits and ranking. It also sounds like you were just given a permanent ban but just evaded it since you will turn back to newbie or sounds like you were nuked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "October 18, 2022, 10:46:24 PM",
      "body": "Sorry.....I was cut up with that....A user gets the normal ban process (temporary or permanent) but this time, if it's temporary, then the user......Allow me some time to ask : why was it called the temporary ban in the first place?? When users ain't given a second chance (that's if it's considerable, based on their legacies --say, creating useful threads or navigating creative informations and ideas, with images and links) what's the need to have divisions to which ban a user deserves?? Just being curious yunno.How 'bout if a user is back from the said probation, --say, a user like fillipone( for instance), how will continue they continue their usual lifestyle of posting threads with images AS BEING A NEWBIE ? HOW 'BOUT THE MERIT-SOURCE POSITION? or you think I'm being too optimistic? What's the point of coming back, as the same person, in the same account -- coupled with the tags or the ordeal that was assimilated by everyone; that the user is a cheat, spammer, critical threat or whatsoever??There's a lot to consider.....Sandra 💇",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 18, 2022, 11:01:20 PM",
      "body": "Quote from: Sandra_hakeem on October 18, 2022, 10:46:24 PMSorry.....I was cut up with that....A user gets the normal ban process (temporary or permanent) but this time, if it's temporary, then the user......Allow me some time to ask : why was it called the temporary ban in the first place?? When users ain't given a second chance (that's if it's considerable, based on their legacies --say, creating useful threads or navigating creative informations and ideas, with images and links) what's the need to have divisions to which ban a user deserves?? Just being curious yunno.How 'bout if a user is back from the said probation, --say, a user like fillipone( for instance), how will continue they continue their usual lifestyle of posting threads with images AS BEING A NEWBIE ? HOW 'BOUT THE MERIT-SOURCE POSITION? or you think I'm being too optimistic? What's the point of coming back, as the same person, in the same account -- coupled with the tags or the ordeal that was assimilated by everyone; that the user is a cheat, spammer, critical threat or whatsoever??There's a lot to consider.....Sandra 💇If say I got a ban now this account DaveF would be locked. I would have to come back as DaveF2 The point was that there are a lot of people evading bans now. Those that got banned for just spamming / being disruptive / whatever could come back BUT it's a new user. So they have posting limits and no images and all the other restrictions. I would think it would accomplish 2 things.1) As I said, it would allow the banning of more people quickly because it's not a 1 and done. Think of it as a time-out. You could come back but are starting at zero.2) If you DID do something and did get banned you could come back as yourself and not worry about getting kicked.Say I did something that was over the line but perhaps not worthy of a permaban. I could get the boot and loose all the perks of a legendary. BUT, I could come back and still be a beneficial member of the forum. It's harsher then just a temp ban, not as brutal as a perma....As I said it was from a BBS back in the late 80s that I was on. Before the internet and everything else, so things were a lot different. I don't know if it can translate to the modern discussion board as a viable thing.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrimeNumber7",
      "created_time": "October 18, 2022, 11:23:41 PM",
      "body": "We already have something as you describe. I have occasionally seen the mods allow someone to create a new account after being banned so they can continue participating in the community. It is pretty rare for the admins/mods to explicitly allow this, however, there are also many instances in which this is implicitly allowed as many who have been banned come back as new users, and most of these people do not get banned for ban evasion. I don't think ban appeals should be eliminated. A ban appeal is an opportunity for the person banned to present evidence/an argument that the mods may not have considered when deciding to ban someone. When done publicly, it also allows the community to weigh in regarding the person's benefit (or possibly lack thereof) to the community, which should also be considered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 18, 2022, 11:36:35 PM",
      "body": "Quote from: DaveF on October 18, 2022, 10:21:42 PMBut, other offenses just get you a 30 or 60 or 90 day vacation and welcome back to being a newbie.I remember a case in which some valuable members of the forum got banned temporarily due to participating in an altcoin giveaway. With your proposal, all of them would lose their rank and become a newbie. I don't think that would be fair.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "October 18, 2022, 11:59:28 PM",
      "body": "Quote from: hosseinimr93 on October 18, 2022, 11:36:35 PMQuote from: DaveF on October 18, 2022, 10:21:42 PMBut, other offenses just get you a 30 or 60 or 90 day vacation, and welcome back to being a newbie.I remember a case in which some valuable members of the forum got banned temporarily due to participating in an altcoin giveaway. With your proposal, all of them would lose their rank and become a newbie. I don't think that would be fair. Wait just thinking, if this will happen then once a legendary user commits a mistake then the moderator decided to perma banned that user, then after a month they will back as a newbie I think that is unfair even though Op has a good Idea but I don't think if other will agree with this. also Perma banned here in forum is enough because you can not post anything or give merits to other users for a couple of months or days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "October 19, 2022, 03:34:59 AM",
      "body": "Quote from: DaveF on October 18, 2022, 10:21:42 PMCertain things, like plagiarism and threats could still be perma bans. But, other offenses just get you a 30 or 60 or 90 day vacation and welcome back to being a newbie.Coming back with a second chance and is de-ranked to a newbie then have to start from scratch. I think it is too harsh and is not a good one.Getting a second chance is not easy and to have it, a perman banned user should have a good contribution, good net-effect for consideration. So if that user eventually gets a second chance, if the forum de-ranks the user back to a newbie rank, it is like wiping out all the past contribution, all reputation.If it is applied, I guess people will choose to create a new account rather than try to submit a ban appeal and wait too long for a second chance.I only know with a second chance, there are some types of offense:- Coming back instantly, without a temporary ban (like 30, 60 or 90 days) AND without any time for signature ban- Coming back but with a temporary ban (like 30 days, after that the user can start using the account) AND a signature ban (like 3 months, 6 months, 1 year, 2 years).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PowerGlove",
      "created_time": "October 19, 2022, 03:47:37 AM",
      "body": "I like the \"I'll paraphrase your point and then you tell me where I misunderstood\" technique. So, here goes: You're saying that (sometimes) after returning from a temporary ban, you should have to start from scratch with a new account?That seems a little harsh to me, especially once you consider the type of offenses that lead to temporary bans. I'm also not a fan of the double punishment (i.e. not being able to participate for a long time and \"wiping\" their progress).I think there's a good idea beneath the surface, and I like what you said later in the thread about reducing ban evasion and about having something harsher than temporary bans but not as harsh as permanent ones, to give the mods more options.What do you think about the idea of introducing activity reductions? I would have suggested merit reductions, but I think people will bare their teeth at that idea.So, maybe a very short \"time-out\" just to cool down (5 days or something) and then instead of locking their account and forcing them to start from scratch with a new one, just set their activity back to 480/240/120/60/30/1 depending on the nature of the offense?That way, their account stays intact (trust feedback, merit, etc.) and the punishment can be appropriately scaled to fit the crime. In fact, depending on how many punishments were handled this way, ban evasion could probably be almost entirely eradicated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 19, 2022, 09:22:28 AM",
      "body": "Quote from: DaveF on October 18, 2022, 10:21:42 PMCertain things, like plagiarism and threats could still be perma bans. But, other offenses just get you a 30 or 60 or 90 day vacation and welcome back to being a newbie.Sorry, but I just don't see the point of doing this and I don't expect anything would be better with this change.There is already temporary ban in bitcointalk forum, but I wouldn't go so far to remove their rank and allow them to come back as a newbie.People are going to try to register again after being banned no matter what rules and regulations we have in place, and we saw that many times.Then you will have the issue with moderators having to deal with all this 30, 60 or 90 day ''vacation'' period for more members, and that means more work for moderators (for nothing).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "October 19, 2022, 11:26:09 AM",
      "body": "Quote from: DaveF on October 18, 2022, 11:01:20 PMIf say I got a ban now this account DaveF would be locked. I would have to come back as DaveF2 The point was that there are a lot of people evading bans now. Those that got banned for just spamming / being disruptive / whatever could come back BUT it's a new user. So they have posting limits and no images and all the other restrictions. I would think it would accomplish 2 things.a permanent ban is certainly not an obstacle to creating a new account. I am of the opinion that most of the banned users have created new accounts. Some asked for an unban, and some just continued under a new name.also, the smarter ones, who continued from the beginning, respected the rules and try to be in tune with them. there are always those who by nature cannot give up their model of behavior, here I mean trolls and fraudsters who try to sell the same scheme. but such are quickly exposed and then we have some \"dramas\" that DT members don't like it.We already have a time limit and signature bans, which I think is quite enough. I would rather introduce that Newbie cannot open a new topic except in certain categories like Meta, Scam accusations, and Beginners & Help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 19, 2022, 12:57:27 PM",
      "body": "OK, does not seem to be that popular of an idea. I though it would be good for the members that ARE contributing and useful but have at times been known to 'go off the rails' so to speak. This way the mods don't have to think about getting rid of a good user (perma ban) or just suspending them for a bit which I DO NOT THINK corrects behavior.It would have been a 'middle ground' that would make some people think a bit more. Taking the threats / plagiarized content off the table since I have been here for 8+ years and have a good history I would have to do something EPIC to get a perma ban. And there are more then a few users like me. This way the mods have another tool in their pocket. I would still be me, everyone would know it's me, but they would also know I screwed up big time somewhere. Now, if I do somethings bad and say get a 90 day or whatever ban, unless you look at my post history nobody would even know what happened in a year or 2 when it all becomes a distant memory.<shrug> I think it would help a bit because now a lot of people know they CAN go past certain lines because there is no long term pain. But, I seem to be in the minority here.As I said in the OP it came from a different time  / way of doing things. May not translate well to the way things work in 2022.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 19, 2022, 01:50:50 PM",
      "body": "The anonymity feature enables you to easily create several accounts, even if you are banned several times without any additional costs.If someone wants to discuss or learn, banning the account will not be a big problem.The problem lies in joining the signature campaigns, which require starting over and waiting for more than 7 months.So our problem is only related to the profit from the campaigns and not a problem related to the forum, such as spamming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 19, 2022, 02:22:01 PM",
      "body": "Quote from: DaveF on October 19, 2022, 12:57:27 PMIt would have been a 'middle ground' that would make some people think a bit more. Taking the threats / plagiarized content off the table since I have been here for 8+ years and have a good history I would have to do something EPIC to get a perma ban. And there are more then a few users like me. This way the mods have another tool in their pocket. Couldn't something more simple like a signature ban (that we already have but is imho underused at the moment) would be a sort of middle ground approach, instead of perma banning or not banning at all? People usually plagiarize because they want to farm merit as fast as possible to achieve higher ranks and join better signature campaigns, so if they can't make money but they continue to be active and helpful members their their case would be revised after some time (lets say 6 months- 1 year) and possibly signature ban lifted. Regarding eliminating ban appeals part, I like that even less because I would like to see ban appeal process being even more transparent that it currently is, where people don't get any feedback from admins for months or even years. I realize that sometimes no answer is an answer, but how hard is to reply in one of those threads saying \" we looked into your appeal once again and an answer is no\" or something along those lines.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "October 19, 2022, 02:34:08 PM",
      "body": "There were suggestions on how to make money with the ban, but the moderators considered it to be extortionate, exploitative, and harsh. Permanent bans can be lifted after 6 months with a fine, especially for plagiarism bans. Loss of rank is regarded as so grievous by members, and therefore I feel that if you break a rule and keep your rank you should pay some fines. It is important that the forum continues to generate funds somehow, since it serves the same purpose as the user community",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "October 19, 2022, 02:35:11 PM",
      "body": "Bans aren't explained too well as it is and we all know how some of the Admin/mods hit the flame button all too easy, so their fingers would probably get a little too itchy to slam someone down to newbie status to cherry pick who they want at the top/bottom of their ideal totem poll.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "October 19, 2022, 05:54:19 PM",
      "body": "Quote from: DaveF on October 19, 2022, 12:57:27 PMBut, I seem to be in the minority here.You don't have to think that you're in the minority here just because your idea doesn't get much support. You should probably know that forum don't want to be too harsh on users whose active user base is decreasing day by day. Even if your idea is good and interesting then I think it will interfere with the existing system where it will only make more users feel like they are being treated too harshly.Not all mistakes should be punished that severely, and I'm sure the current system is good enough without needing any significant changes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "October 19, 2022, 07:24:56 PM",
      "body": "Quote from: DaveF on October 19, 2022, 12:57:27 PMOK, does not seem to be that popular of an idea. I though it would be good for the members that ARE contributing and useful but have at times been known to 'go off the rails' so to speak. This way the mods don't have to think about getting rid of a good user (perma ban) or just suspending them for a bit which I DO NOT THINK corrects behavior.It would have been a 'middle ground' that would make some people think a bit more. Taking the threats / plagiarized content off the table since I have been here for 8+ years and have a good history I would have to do something EPIC to get a perma ban. And there are more then a few users like me. This way the mods have another tool in their pocket. I would still be me, everyone would know it's me, but they would also know I screwed up big time somewhere. Now, if I do somethings bad and say get a 90 day or whatever ban, unless you look at my post history nobody would even know what happened in a year or 2 when it all becomes a distant memory.<shrug> I think it would help a bit because now a lot of people know they CAN go past certain lines because there is no long term pain. But, I seem to be in the minority here.As I said in the OP it came from a different time  / way of doing things. May not translate well to the way things work in 2022.-DaveDave, Have you realized that you're tryna make the whole process tough? I mean incessantly tough -- say, a kinda over reaction on the whole issue. I understand that you're trying to adopt an old idea -- for whatever reasons -- in this new era, to serve as a 'deterrent' to whoever the culprit is but, -- you don't kill your child for a punishable offense, do you? You see the point..I don't think anyone is against you; neither are you rated amongst any minority bla bla bla..... It's just your perception or, maybe you're understanding every the other person's appraisal the other way-round: don't pick an offense if no one seems to see through your vision. There are many advantages to your points, but many, MANY.... MORE disadvantages.Sandra 💇",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "October 19, 2022, 07:57:33 PM",
      "body": "Quote from: DaveF on October 18, 2022, 11:01:20 PMThe point was that there are a lot of people evading bans now. Those that got banned for just spamming / being disruptive / whatever could come back BUT it's a new user. So they have posting limits and no images and all the other restrictions. I would think it would accomplish 2 things.You know something?  I'd be willing to bet that most of these plagiarists have alt accounts waiting in the wings in case one of them gets banned for plagiarism or whatever else, sort of like naim027.  I never got the sense that newcomers were ignorant to how things work on the forum when they register, probably because they were referred here by a friend or family member who's told them all about bans, ranking up, and everything else.So I don't think changing the ban system would help things much, even if it would normally make total sense to do so on a normal forum without financial incentives to post.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "October 19, 2022, 08:54:18 PM",
      "body": "Quote from: The Pharmacist on October 19, 2022, 07:57:33 PMQuote from: DaveF on October 18, 2022, 11:01:20 PMThe point was that there are a lot of people evading bans now. Those that got banned for just spamming / being disruptive / whatever could come back BUT it's a new user. So they have posting limits and no images and all the other restrictions. I would think it would accomplish 2 things.You know something?  I'd be willing to bet that most of these plagiarists have alt accounts waiting in the wings in case one of them gets banned for plagiarism or whatever else, sort of like naim027.  I never got the sense that newcomers were ignorant to how things work on the forum when they register, probably because they were referred here by a friend or family member who's told them all about bans, ranking up, and everything else.So I don't think changing the ban system would help things much, even if it would normally make total sense to do so on a normal forum without financial incentives to post.I am 100% in agreement here. 10000000000000% of the users that have been banned for offenses like plagiarism or spamming or whatever just accept the fact that that account is banned and either make a new account, already had an alt account they use, or would look to buy an account. Being banned on this forum doesn't really do anything but cost you the account that is banned. I do agree that we need to get rid of ban appeals period. There may be a special case that pops up (unsure what that would be at this time), but for the most part just eliminate them altogether. If someone is doing something that gets them a permaban, do we really want them coming back? Haven't you ever heard a leopard cannot change his spots? The naim027 appeal was the last straw IMO. He made the forum look foolish and he had higher ups(at least 1) protect his secret. If anything we need stronger bans. IP bans would help but ultimately is not the solution. The goal wouldn't be to turn people away from bitcoin or the forum, but to teach the shitheads of the world that we don't want or need their type. We all know the world isn't perfect and some users circumstances are much much worse than others, but you ultimately make the conscious choice on whether to be a shithead or not. Choose not to be that shithead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}