{
  "id": "topic_5470732",
  "title": "Kavelj22",
  "author": "Kavelj22",
  "created_time": "October 17, 2023, 11:28:23 PM",
  "content": "A few hours ago, the Israeli Defense Forces committed a new massacre in the Gaza Strip that exceeded all expectations. The forces bombed a hospital housing civilians fleeing the bombing, in addition to those injured as a result of the bombings. The targeting of the hospital left more than 600 dead, and the hospital administration confirmed that all of them were civilians.According to the latest statistics, the death toll as a result of the continuous bombing for 12 days exceeded 3,000, in addition to an unspecified number of wounded and the complete destruction of the infrastructure of the entire northern Gaza Strip, which is already besieged, while preventing the entry of food and medical aid through all crossings leading to the Gaza Strip.Regardless of whether you support the Palestinian right or support Israel, I cannot imagine a rational person who would question the horror of what is happening to more than two million citizens in front of the eyes of the world. You may have been affected by the death of 200 Israelis after the Hamas attack last October 7, but in your opinion, is it permissible to react in this barbaric way? Hamas did not kill children or attack hospitals, and no matter how strong it is, it cannot reach the size of the military might of a force like Israel, which is supported by the most powerful armies in the world. Who benefits from killing more than a thousand children and destroying hospitals and shelters?Believe me, I am unable to even formulate the appropriate expressions to describe what I feel. I am no longer as surprised by what Israel does as I am by the position of countries, entities, and even companies.Can someone explain to me what is the benefit of international law that imposes certain conditions, even in cases of war, that hospitals and shelter centers should not be targeted and the way for humanitarian crossings should be opened? Why does everyone view the American veto as a normal step, while the Security Council and the entire United Nations agree to condemn what is happening? Can a rational person explain to me what is the benefit of establishing international law in light of the existence of what is called the right of veto? Then why do those with the veto insist on remaining within the United Nations and international legitimacy if they constantly overturn its decisions that agree with them? How can laws be effectively activated under the veto?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470732",
  "comments": [
    {
      "author": "mikeywith",
      "created_time": "October 18, 2023, 12:42:22 AM",
      "body": "There is no international law, there is only \"power\" in this world if you are strong enough to do whatever you want -- you will always get away with it, the human rights and all the rest of it are just pure propaganda to feed the average joe.As for the hospital blast, the Western media already has the plan to justify that given that the majority of their audiences are brainwashed, they could claim that this was done by Hamas on purpose or by mistake, they could also claim that Hamas was hiding rockets under that patients' beds, and those folks will happily accept the death of all those civilians and continue to send their hard-earned money in form of taxes to Israel because somehow, they think that if Israel is gone, the next target will be their country, and surprisingly this is common western propaganda, because the Americans think the U.S will be next after Israel, and so do the French and the British and everyone else who supports Israel, it's like the Palestinians have some secret nuclear weapon which will deploy to erase the whole world and the only thing standing in the way of that magical bottom is Israel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamin1i",
      "created_time": "October 18, 2023, 06:04:01 AM",
      "body": "The hypocrisy of the West, their use of definitions and concepts only when things are going in their favor, is disgusting.Human rights are only for their own people. War crimes are only crimes if committed against them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "October 18, 2023, 07:36:34 PM",
      "body": "Quote from: mikeywith on October 18, 2023, 12:42:22 AMThere is no international law, there is only \"power\" in this world if you are strong enough to do whatever you want -- you will always get away with it, the human rights and all the rest of it are just pure propaganda to feed the average joe.When you spend years studying “international law,” deterrent means, and principles in waging wars, then you find a question in your exams that requires you to answer that international law criminalizes and punishes the violator who violates military values and violates international law and violates its general principles. Then you turn on the TV to see a force targeting a hospital containing civilians and doctors?? Where is the international law they taught us? And why do we even study it? Where are the deterrent means?I can say with complete conviction that what is known as “international law” is the biggest lie known to human history and that there may not be anything comparable to it in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "October 18, 2023, 07:49:24 PMLast edit: November 26, 2023, 02:48:12 PM by digaran",
      "body": "All humans good, never talk bad about others OK?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 18, 2023, 08:27:50 PMLast edit: October 18, 2023, 08:56:08 PM by 1miau",
      "body": "Quote from: Kavelj22 on October 17, 2023, 11:28:23 PMA few hours ago, the Israeli Defense Forces committed a new massacre in the Gaza Strip that exceeded all expectations. The forces bombed a hospital housing civilians fleeing the bombing, in addition to those injured as a result of the bombings. The targeting of the hospital left more than 600 dead, and the hospital administration confirmed that all of them were civilians.How about checking sources first, instead of just trusting any claims from Hamas?  Because it turned out that the rocket was fired by Hamas itself and it crashed near the hospital, like the OSINT (Open Source Intelligence) community has confirmed: That caused the explosion at a parking lot NEAR the hospital, not a rocket from Israel allegedly flying IN the hopsital.  There are even more irregularities in statements from Hamas: - Hamas can't show any pictures of the alleged 500 dead civilians = it's very likely another lie from Hamas because if many people were killed, Hamas would spread the propaganda all over the place. But there are no pictures- There are no rocket craters, as usual for rocket targets, another sign that a Hamas rocket misfired shortly after being launched near the hospitalIt's summarized here, already reviewed by the OSINT community:  https://nypost.com/2023/10/18/all-of-the-evidence-that-shows-hamas-was-responsible-for-hospital-explosion/Quote from: Kavelj22 on October 17, 2023, 11:28:23 PMAccording to the latest statistics, the death toll as a result of the continuous bombing for 12 days exceeded 3,000, in addition to an unspecified number of wounded and the complete destruction of the infrastructure of the entire northern Gaza Strip, which is already besieged, while preventing the entry of food and medical aid through all crossings leading to the Gaza Strip.Sure, 3000 deaths, like the 500 deaths from the hospital, LOL.  Hamas has lost all credibility, therefore these numbers are 100% meaningless. If someone dies, ask Hamas, why Hamas- has incited the recent violence due to their massacre against israeli civilians, do you condem this? - is using civilians as human shields to fabricate propaganda about deaths, while Hamas could have protected themHamas should come out and face Israel's army face to face. Of course Hamas won't do that because Hamas is scum hiding behind civilians. Quote from: mikeywith on October 18, 2023, 12:42:22 AMThere is no international law, there is only \"power\" in this world if you are strong enough to do whatever you want -- you will always get away with it, the human rights and all the rest of it are just pure propaganda to feed the average joe.Turned out that the propaganda was from Hamas, trying to incite more hate in this ongoing conflict. It's not just not helpful at all, it's also disgusting. A sane and educated person will check first, what happened and PROVE his claims. I want PROOF, not UNPROVEN accusations. And even then, no one from these islamic extremists will apologize that the rocket was from Hamas, not from Israel. All the extremist pawns (we have quite a bunch of the in Germany), will not apologize for spreading UNPROVEN lies to incite more hate. Quote from: mikeywith on October 18, 2023, 12:42:22 AMAs for the hospital blast, the Western media already has the plan to justify that given that the majority of their audiences are brainwashed, they could claim that this was done by Hamas on purpose or by mistake, they could also claim that Hamas was hiding rockets under that patients' beds, and those folks will happily accept the death of all those civilians and continue to send their hard-earned money in form of taxes to Israel It would be nice to get some facts instead of unproven speculations that. Because it turned out that your claim aged like milk.  Of course, spreading hate is much easier for Hamas apologists that to face the truth. And no, the only ones who are brainwashed here are the vast majority of Hamas apologists, for parroting any unproven pro Hamas propaganda...Stop getting brainwashed from Hamas propaganda and find out, what really happened, backed up by proof.  Quote from: mikeywith on October 18, 2023, 12:42:22 AMbecause somehow, they think that if Israel is gone, the next target will be their country, and surprisingly this is common western propaganda, because the Americans think the U.S will be next after Israel, and so do the French and the British and everyone else who supports Israel, it's like the Palestinians have some secret nuclear weapon which will deploy to erase the whole world and the only thing standing in the way of that magical bottom is Israel. I'm a very tolerant person but there's no doubt that all these Hamas supporters are not compatible with our German society. There's a small, extremist bunch, they reject any German societey norms. They behave like extremists and they are extremists. They are trying to ignore the duty, that if you come to Germany, get offered a good social security, a good living standard, all the things, Germany has achieved, they need to be friendly and they need to accept the German culture. But instead, they are trying to reverse our German culture and engage in radical islamist behaviour. They force their religious believs on others and if someone dares to criticize it, the critics will be massacred. They don't accept the German culture and if we say them to do so, they will cause a massacre. If their religion is critized, they will bomb the shit out of normal EU people. They are fanatic. Yes, after Israel is wiped off the map, which is the goal by extremist organizations like Hamas or Israel etc., EU and USA will be next. We, in the west, are well advised to send this Hamas supporting scum right away, where it came from. There, these extremists can bomb themselves about their Allah bullshit, as it pleases them. But not here in Germany.  Quote from: adamin1i on October 18, 2023, 06:04:01 AMThe hypocrisy of the West, their use of definitions and concepts only when things are going in their favor, is disgusting.You mean the hypocrisy of Hamas, when Hamas needs to spread fake propaganda, when in reality, the rocket near the hospital came from Hamas? And, why is Hamas firing rockets near the hospital?  Maybe using civilians as human shields again? Nah, Hamas are the good guys...  Hamas is disgusting scum and pawns like we have quite a few here on Bitcointalk are fooled too easily into spreading such disgusting Hamas propaganda. Like now, all the news are out, where everyone claimed, Israel bombed a hospital and killed 500 people but the rocket was fired by Hamas. Question all the propaganda, wait if any claims from any side are PROVEN, check it yourself and stop spreading UNPROVEN propaganda. Hamas is a terrorist organization and tries to incite a mayor war, where Hisbollah, the terrorist regime in Iran and some other islamist idiots will try to incite a big war. We don't need such crap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "October 18, 2023, 11:16:22 PM",
      "body": "Quote from: 1miau on October 18, 2023, 08:27:50 PMBecause it turned out that the rocket was fired by Hamas itself and it crashed near the hospital, like the OSINT (Open Source Intelligence) community has confirmed: Since when did NYpost become  \"Open Source Intelligence\" ? where is your OSINT source?QuoteIt would be nice to get some facts instead of unproven speculations that. Because it turned out that your claim aged like milk.  You used the New York Post as your \"fact reference\" which is funny, where is your source of all the info you posted above? if you are going to quote another Western legacy media then spare yourself the effort. in fact:QuoteIn the hours after the attack, @Israel, the official Israeli account on X (formerly Twitter), posted a video it claimed was proof that the explosion was the result of a misguided rocket launched by Islamic Jihad militants. But within minutes, Aric Toler, a former Bellingcat researcher who now works for The New York Times, pointed out that the time stamp on the video showed 8 pm local time, a full hour after the explosion took place.The post on Israel’s official account was subsequently edited to remove the video while maintaining its claim that the attack was not the result of an Israeli strike.https://www.wired.com/story/al-ahli-baptist-hospital-explosion-disinformation-osint/Kolina Koltai a senior researcher at open source intelligence (OSINT) Bellingcat said in response to the IDF putting that fake video and then deleting it:Quote“When you see people in such a capacity putting out a claim, walking it back, putting out a video, deleting the video, it makes it tough, not just for us to do our job, but even for the public to find out what’s going on,”She also mentioned in response to some Israeli fake newsQuoteHead ups, there is a claim that the hospital bombing in Gaza was by Hamas. If you see the video below, it is actually from at least 2022.So I ask again, where is your OSINT resource that confirms that the hospital was attacked by Hamas? if your source claims that it wasn't an airstrike conducted by a fighter jet, it doesn't change anything, your source needs to prove that Hamas was indeed the one who launched it, it's common since the attacker bares all responsibility unless proven otherwise.QuoteStop getting brainwashed from Hamas propaganda and find out, what really happened, backed up by proof.  Hamas is a political movement, I couldn't care less what they say or do, just like Netanyahu's government, they would use everything at their disposal to win, and that includes propaganda, it's perfectly normal to dislike or a hate a political party including this army and leader, but what you doing now is hating on all the civilians who have nothing to do with Hamas.what I care about is the lives of the innocent Palestine people who have been suffering since the Zionist state took place back in 1948, the radical government and settlers have put the lives of both Palestinians and Israelis at stake, you keep mentioning Hamas as if they are superpower who control the whole area, you don't seem to know that they don't extend past Gaza, but despite them not having a foot in the West Bank, Israel did not stop the killing of the Palestinians in the west bank.You seem to be pretty misinformed, about the religious aspect in the area, Israel is fighting both Muslims and Christians, it's part of the Zionist doctrine which you don't seem to understand, it's Zionist (God's chosen people according to them) vs everyone.Are you aware that ALL human rights organizations state that Israel committed war crimes and has been brutal to the Palestinians for decades? and that includes ALL Israeli human rights organizations.B'Tselem one of the largest human rights organizations based of Jerusalem mentioned this:2,260 children were killed by the IDF and the settlers from 2000 to date, 519 of them were way too far from Gaza in the west bank where Hamas does not exist, 1,741 minors in Gaza were killed by the IDF vs 4 Israeli minorsYou would find a lot of interesting reads there such as \"Top Israeli officials criminally liable for knowingly ordering strike expected to harm civilians, including children, in the Gaza Strip\"All Israeli human rights organizations will tell you the same thing about the brutality of the IDF and the settlers, if you are not satisfied with Israeli resources you can turn to amnesty which also statesQuoteIsrael’s continuing oppressive and discriminatory system of governing Palestinians in Israel and the Occupied Palestinian Territories (OPT) constituted a system of apartheid, and Israeli officials committed the crime of apartheid under international law. Israeli forces launched a three-day offensive on the occupied Gaza Strip in August during which they committed apparent war crimes.But no, this is all Hamas propaganda, they control the Israeli and international human rights originations to spread fake news.QuoteI'm a very tolerant personHard to tell to be honest. Quotethat if you come to GermanyIf you are annoyed by a certain group of people regardless of their religion or background, don't let them into your country, it's as simple as that to a superpower country like Germany, unfortunately, it wasn't the case for the weak Palestinians back in 1948 since no matter how hard they tried to stop the Zionist from taking their land -- they couldn't.  QuoteYes, after Israel is wiped off the map, which is the goal by extremist organizations like Hamas or Israel etc., EU and USA will be next.So why does this have to be in the order you mentioned, why can't it be EU, USA, and then Israel for example  , I find it hard to believe that a country with 2% the GDP of the U.S, a small population of 10 million with little to no natural resources is standing in the way of the \"extremist organizations\" who plan to take down the EU and the USA, it's also worth mentioning that Israel as a state only come to existence roughly 70 years ago, so who was protecting the world from the \"extremist organizations\" back then? we know for sure it wasn't the Jews so who was it?  I am not trolling really, I just don't have what it takes to understand arguments with flawed logic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tetaeridanus",
      "created_time": "October 19, 2023, 12:34:00 AM",
      "body": "@mikeywith; the person @1miau and I are also talking the same thing in my thread; he claims false allegations and even tell that no hospital was even bombed and the 470 civilians dead is a fake propoganda of Hamas. I don't even know if this is worth discussing anymore.@1miau I want you to remember this image every day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 19, 2023, 12:34:58 AM",
      "body": "Quote from: mikeywith on October 18, 2023, 11:16:22 PMQuote from: 1miau on October 18, 2023, 08:27:50 PMBecause it turned out that the rocket was fired by Hamas itself and it crashed near the hospital, like the OSINT (Open Source Intelligence) community has confirmed: Since when did NYpost become  \"Open Source Intelligence\" ? where is your OSINT source?I haven't claimed anywhere that New York Post is OSINT community. You clearly didn't read that article and you also didn't bother to check the OSINT community yourself. Even in the NYP article, two names from the OSINT community are mentioned and cited... But no, all you can come up with is a strawman \"New York Post is no OSINT source\" - LOL. Quote from: mikeywith on October 18, 2023, 11:16:22 PMQuoteIt would be nice to get some facts instead of unproven speculations that. Because it turned out that your claim aged like milk.  You used the New York Post as your \"fact reference\" which is funny, where is your source of all the info you posted above? if you are going to quote another Western legacy media then spare yourself the effort. in fact:I've just posted one source from all the sources I've read about this. Is it so difficult to look it up or are you afraid to see some Hamas propaganda getting debunked into pieces?  Quote from: mikeywith on October 18, 2023, 11:16:22 PMQuoteIn the hours after the attack, @Israel, the official Israeli account on X (formerly Twitter), posted a video it claimed was proof that the explosion was the result of a misguided rocket launched by Islamic Jihad militants. But within minutes, Aric Toler, a former Bellingcat researcher who now works for The New York Times, pointed out that the time stamp on the video showed 8 pm local time, a full hour after the explosion took place.The post on Israel’s official account was subsequently edited to remove the video while maintaining its claim that the attack was not the result of an Israeli strike.https://www.wired.com/story/al-ahli-baptist-hospital-explosion-disinformation-osint/So, you are saying that there were two explosions happening? From the pictures we know today, that can't be true. And like you've seen in the picture in that wired article, the hospital seems to be intact, doesn't it?  Quote from: mikeywith on October 18, 2023, 11:16:22 PMShe also mentioned in response to some Israeli fake newsHead ups, there is a claim that the hospital bombing in Gaza was by Hamas. If you see the video below, it is actually from at least 2022.So I ask again, where is your OSINT resource that confirms that the hospital was attacked by Hamas? if your source claims that it wasn't an airstrike conducted by a fighter jet, it doesn't change anything, your source needs to prove that Hamas was indeed the one who launched it, it's common since the attacker bares all responsibility unless proven otherwise.Your strawmen proves exactly what? I can go to Twitter and pull out fake videos from any side so that's proof enough to debunk a claim? This is proving exactly what? - Nothing! When Russia attacked Ukraine, there have been videos from a chemical explosion in China from years ago, normal Twitter users are not the OSINT community. They will re-post anything for clicks. Even New York Post mentioned the OSINT researchers from GeoConfirmed. There are far more commenting on the incident, like Nathan Ruser or Oliver Alexander commented on this as well. It's like Bitcoin buyer and Bitcoin developer. Quote from: mikeywith on October 18, 2023, 11:16:22 PMQuoteStop getting brainwashed from Hamas propaganda and find out, what really happened, backed up by proof.  Hamas is a political movement, I couldn't care less what they say or do, just like Netanyahu's government, they would use everything at their disposal to win, and that includes propaganda, it's perfectly normal to dislike or a hate a political party including this army and leader, but what you doing now is hating on all the civilians who have nothing to do with Hamas.Hamas is a terrorist organization and everyone is suffering from them. Not just Israelis, people from Palestine as well. Believe me, I have defended the palestinian struggle even in our German section in our forum in 2022, especially criticizing the illegal israeli settler practices. I really hope for peace in that region, which is very difficult unfortunately. I was even accused to be pro Hamas.  So, you see, I'm considering both sides here. But what these Hamas terrorists did there, murdering thousands of israeli civilians in such a brutal way, is not acceptable at all. I don't need to elaborate this. The fact, that we now have in Germany antisemitic rallies from \"pro Palestine\" (pro Hamas) folks, who are shouting \"down with Israel\" or \"gas the jews\" in GERMANY, is not acceptable. Houses, where Jews are living, were marked like in Hitler's 3rd reich. This is not acceptable. Quote from: mikeywith on October 18, 2023, 11:16:22 PMyou keep mentioning Hamas as if they are superpower who control the whole area, you don't seem to know that they don't extend past GazaI know this very well. Quote from: mikeywith on October 18, 2023, 11:16:22 PMYou seem to be pretty misinformed, about the religious aspect in the area, Israel is fighting both Muslims and Christians, it's part of the Zionist doctrine which you don't seem to understand, it's Zionist (God's chosen people according to them) vs everyone. Your guess couldn't be more uneducated on the matter because as I've said I have defended the cause of Palestine previously in the forum. I know that the extremist far right in Israel will not hesitate to erase Palestine, like the radical Hamas wants to erase Israel. We won't get peace with such folks. Quote from: mikeywith on October 18, 2023, 11:16:22 PMAre you aware that ALL human rights organizations state that Israel committed war crimes and has been brutal to the Palestinians for decades? and that includes ALL Israeli human rights organizations.Looks like you are completely unaware that I've read tons of this, from Human Rights Watch, Amnesty International, German outlets and even Alex Gladstein's article about Bitcoin and Palestine. Quote from: mikeywith on October 18, 2023, 11:16:22 PMIf you are annoyed by a certain group of people regardless of their religion or background, don't let them into your country, it's as simple as that to a superpower country like Germany, unfortunately, it wasn't the case for the weak Palestinians back in 1948 since no matter how hard they tried to stop the Zionist from taking their land -- they couldn't.  Unfortunately, international law applies and refeugee crisis is a very hot topic in Germany right now. Yes, we need changes but when we make changes there, someone will be unhappy instead. Quote from: mikeywith on October 18, 2023, 11:16:22 PMQuoteYes, after Israel is wiped off the map, which is the goal by extremist organizations like Hamas or Israel etc., EU and USA will be next.So why does this have to be in the order you mentioned, why can't it be EU, USA, and then Israel for example  , I find it hard to believe that a country with 2% the GDP of the U.S, a small population of 10 million with little to no natural resources is standing in the way of the \"extremist organizations\" who plan to take down the EU and the USA, it's also worth mentioning that Israel as a state only come to existence roughly 70 years ago, so who was protecting the world from the \"extremist organizations\" back then? we know for sure it wasn't the Jews so who was it?  I am not trolling really, I just don't have what it takes to understand arguments with flawed logic.As I've said, the radical folks trying to force Islam onto European countries are very few. But they are existing and they won't refrain from suicide bombing our societey to death. I'm not interested to get an escalation, where more and more people are radicalized due to political islam. We have tons of nice Muslims in Germany, they don't make any issue at all, the problem are the radicalized ones and the past days have shown that we need to take it seriously. Like you, I'm also for a peaceful society.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 19, 2023, 12:43:05 AM",
      "body": "Quote from: tetaeridanus on October 19, 2023, 12:34:00 AM@mikeywith; the (Islamophobic) person @1miau and I are also talking the same thing in my thread; he claims false allegations and even tell that no hospital was even bombed and the 470 civilians dead is a fake propoganda of Hamas. I don't even know if this is worth discussing anymore.Yes, such a high number is completely exxagerated according to publicly available evidence. Take this shot from Times of Gaza (Palestinian source): https://twitter.com/Timesofgaza/status/1714317733410611712Anyone who has followed the Russian invasion against Ukraine can tell you, that such a blast- isn't a normal, guided rocket hit (would have caused a massive crater)- won't cause 470 dead civilians- doesn't destroy a hospital at allAs sad as it is, we need to stay calm and review the facts. Quote from: tetaeridanus on October 19, 2023, 12:34:00 AM@1miau I want you to remember this image every day.You don't need to come me with your propaganda. What's happening there is evil enough, no need to abuse it for cheap propaganda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tetaeridanus",
      "created_time": "October 19, 2023, 12:49:30 AM",
      "body": "You call anything but your own opinion propoganda; AS said in my thread; people live in tents in the yard of the hospital in small spaces. Gaza President said the official number ; you don't need to be agressive with these self-claimed facts. I am really sorry and see huge flaws in your moral. I don't believe you think this is evil like in your last sentence. I live in lands where we watch war every day, I also watched Russia-Ukraine conflict. Are Ukraniens in open-air prison with no where to run like Palestanians? No, this is why Israel's coward air attacks are killing many civilians; get some lesson from Turkey, man up go to ground attack , pick the aggressors up and jail them; not bomb them with civilians in fighter jets!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 19, 2023, 12:54:46 AM",
      "body": "Quote from: tetaeridanus on October 19, 2023, 12:49:30 AMI am really sorry and see huge flaws in your moral. I don't believe you think this is evil like in your last sentence. I live in lands where we watch war every day, I also watched Russia-Ukraine conflict. Are Ukraniens in open-air prison with no where to run like Palestanians? No, this is why Israel's coward air attacks are killing many civilians; get some lesson from Turkey, man up go to ground attack , pick the aggressors up and jail them; not bomb them with civilians in fighter jets!Like you, I believe these deaths are evil and brutal. Every death is one death too many, I think we can agree here. That's why peace is so important and an important part of peace is to look up, what really happened there. Quote from: tetaeridanus on October 19, 2023, 12:49:30 AMGaza President said the official numberWell, if he said so, it must be true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tetaeridanus",
      "created_time": "October 19, 2023, 01:00:57 AM",
      "body": "Quote from: 1miau on October 19, 2023, 12:54:46 AMQuote from: tetaeridanus on October 19, 2023, 12:49:30 AMI am really sorry and see huge flaws in your moral. I don't believe you think this is evil like in your last sentence. I live in lands where we watch war every day, I also watched Russia-Ukraine conflict. Are Ukraniens in open-air prison with no where to run like Palestanians? No, this is why Israel's coward air attacks are killing many civilians; get some lesson from Turkey, man up go to ground attack , pick the aggressors up and jail them; not bomb them with civilians in fighter jets!Like you, I believe these deaths are evil and brutal. Every death is one death too many, I think we can agree here. That's why peace is so important and an important part of peace is to look up, what really happened there. Quote from: tetaeridanus on October 19, 2023, 12:49:30 AMGaza President said the official numberWell, if he said so, it must be true.  Well ending there sir, I +1 in this comment of yours even if I don't accept what you said earlier. Peace is important, all humans need peace. No human is more important than other because of race religion skin or anything.PS: He is the president, so he is the most official.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "October 19, 2023, 01:04:49 AMLast edit: October 19, 2023, 01:19:12 AM by Learn Bitcoin",
      "body": "Quote from: 1miau on October 19, 2023, 12:43:05 AM---With due respect, I don't know who did this and who did that. But I know that Israel is an illegal country born in 1948 out of nowhere. You say Hamas is a terrorist organization. But do you understand how and why Hamas was born? What do they want? If any country builds an armed organization to get freedom, okay, I will support that organization. Bangladesh and Pakistan were the same country before 1971. Pakistan has more power with the military and digital weapons, while Bangladesh does not have anything significant. Bangladesh built an organization named Mukti Bahini, and they fought against Pakistan to get freedom from them. Mukti Bahini got weapons from India, and they built some weapons on their own using local resource. India and the Soviet Union supported Bangladesh, while Pakistan had a big supporter, the USA. Do you think Mukti Bahini was a terrorist organization? All Palestinians want is freedom from Israel and recognition from the world. Still, If you say that organization is a terrorist group, it's up to you. I am supporting them in front of the world. I can't stop crying since last night. I am giving you some links to some video clips. Watch them and let me know how you feel.https://fb.watch/nMecVY-F6e/https://www.facebook.com/reel/700014658395408https://www.facebook.com/story.php?story_fbid=857113185820502&id=17841404556886204https://facebook.com/story.php?story_fbid=pfbid02gQTew8sZGj1wMh5yWyx4TQvEeo8rsWK8U93E6w7vcRqFNTjLUd2LYvLi8XftAnful&id=100093354352663&mibextid=NnVzG8https://fb.watch/nMen5O4SD2/?mibextid=fgUVKvhttps://www.facebook.com/mofa.pna/posts/pfbid028pgKiZ4dtUqJDTdMBiBdFeYnjExrtGPa5381guP1ntggFt5k8foCfQ4odjEwFGdnl?mibextid=YxdKMJ",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 19, 2023, 01:41:09 AMLast edit: October 19, 2023, 01:58:11 AM by 1miau",
      "body": "Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMQuote from: 1miau on October 19, 2023, 12:43:05 AM---With due respect, I don't know who did this and who did that. Then, looking up the claims of both sides would be a good idea?  Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMBut I know that Israel is an illegal country born in 1948 out of nowhere. Israel is not an illegal country like Palestine is not an illegal country. Both were \"created\" from british rule in that region. Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMYou say Hamas is a terrorist organization. Yes, and we know that at least sinc last weak, where they went after several thousand Israeli civilians, except from the rocket launches by Hamas. Israel has it's \"Iron Dome\" for a reason.  Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMBut do you understand how and why Hamas was born? To spread their radical ideology.  Unfortunately, Hamas took power in Gaza 2006/2007 from democratic Fatah and (no surprise) Hamas banned democratic elections. Since then, no democratic vote was hold in Gaza and Hamas started to ramp up their bullshit. Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMWhat do they want? Wipe Israel off the map.  Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMIf any country builds an armed organization to get freedom, okay, I will support that organization. The problem is that \"fighting for freedom\" for Hamas means to bomb Israelis to death.  That's not how peace is achieved. Of course, the religious israeli right wants to wipe Palestine off the map. With such folks, peace is impossible. Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMDo you think Mukti Bahini was a terrorist organization? Different conflict, different issues. Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMAll Palestinians want is freedom from Israel and recognition from the world. That's what I hope for Palestinians as well. But that won't be possible with Hamas because peace is no option for Hamas until Israel is wiped off the map. Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMStill, If you say that organization is a terrorist group, it's up to you. I am supporting them in front of the world. Hamas is a terrorist group and a very brutal one, like we have seen last week. Palestinians are normal people, they are NOT a terrorist organisation. But Hamas is abusing these Palestinians for their own gain. The headquarters of Hamas are located in Qatar and they don't care the slightest about how many Palestinians are killed, their main goal is to wipe Isreal off the map. Quote from: Learn Bitcoin on October 19, 2023, 01:04:49 AMI can't stop crying since last night. I am giving you some links to some video clips. Watch them and let me know how you feel.https://fb.watch/nMecVY-F6e/https://www.facebook.com/reel/700014658395408https://www.facebook.com/story.php?story_fbid=857113185820502&id=17841404556886204https://facebook.com/story.php?story_fbid=pfbid02gQTew8sZGj1wMh5yWyx4TQvEeo8rsWK8U93E6w7vcRqFNTjLUd2LYvLi8XftAnful&id=100093354352663&mibextid=NnVzG8https://fb.watch/nMen5O4SD2/?mibextid=fgUVKvhttps://www.facebook.com/mofa.pna/posts/pfbid028pgKiZ4dtUqJDTdMBiBdFeYnjExrtGPa5381guP1ntggFt5k8foCfQ4odjEwFGdnl?mibextid=YxdKMJNo need to lecture me on the issue I'm well aware about this conflict.  Supporting Hamas means supporting a new Holocaust: QuoteOne of Hamas' goals is to destroy the State of Israel by military force and to establish an Islamic state instead. In its founding charter published on August 18, 1988, Hamas referred to the world's most influential anti-Semitic conspiracy theory, the Protocols of the Elders of Zion, which had been exposed as a fake as early as 1921. On May 1, 2017, Hamas issued a policy and position paper supplementing the 1988 charter or, according to some commentators, replacing it entirely. Hamas has ruled the Gaza Strip since its election victory in 2006 and the civil war over Gaza in June 2007, which was widely perceived internationally as a coup d'état by Hamas, and since then no elections have been held in the Palestinian territories. On October 7, 2023, Hamas launched an attack on Israel, in which Izz al-Din al-Qassam Brigades fighters entered settlements around the Gaza Strip. Hamas committed numerous excesses of violence and murdered over 1,400 Israelis, most notably in the massacre of Reʿim and Kibbutz Kfar Aza. Israel then declared a state of war and began retaliatory strikes and preparations for a ground offensive against the Gaza Strip.https://de.wikipedia.org/wiki/HamasThe ideology from Hamas has quite a few similarities to that of Adolf Hitler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "October 19, 2023, 02:13:47 AM",
      "body": "Quote from: 1miau on October 19, 2023, 12:34:58 AMI haven't claimed anywhere that New York Post is OSINT community. You clearly didn't read that article and you also didn't bother to check the OSINT community yourself. Alas, you cited NYpost article and said \"look, they said that OSINT confirmed that Hamas struck the hospital\" and I said, there is no such claim, link leads to GeoConfirmed which I followed closely, and read all the analysis, and nothing there that claims what you claimed, and since you failed to quote the source I now have the right to assume that you did not read anything past that NYpost article.If you even follow GC you would have seen their last thread where it sayQuoteIt rules out a rocket misfire. It means the possibilities are:1) Israel uses heat-seeking missiles (via cruise missile or airstrike) to destroy the rocket launchers, they fired some here and accidentally also hit the hospital, perhaps locked onto hospital's power generators.There are all sorts of speculations and analyses of what has happened, NONE of them say that Hamas struck the hospital, so again, where is your proof? QuoteI've just posted one source from all the sources I've read about this. Is it so difficult to look it up or are you afraid to see some Hamas propaganda getting debunked into pieces?  You have not, you just posted a link to NYpost and claim it's solid proof, am asking where is your proof, you expect me to find it for you. Quote from: mikeywith on October 18, 2023, 11:16:22 PMSo, you are saying that there were two explosions happening? From the pictures we know today, that can't be true. I don't know, you need to ask that official Israeli account where they got the video from, and why they deleted it after being confronted.QuoteAnd like you've seen in the picture in that wired article, the hospital seems to be intact, doesn't it?  But you said Hamas struck it, so make up your mind, which one is it, the hospital is fine or Hamas did hit it? Also, you seem to confuse missiles with nukes, the hospital is 27,500 square meters large, you could hit one whole block and the rest wouldn't be affected, now whether 500 people were killed or not is up for debate, based on all the evidence I have seen so far, adding that to what I heard from friends in Palestine, I think it's highly exaggerated, I doubt the number is that large, but as in every war, when you launch an offensive you take the blame for the actual and the fake deaths, if a Ukrainian dies from a heart attack during a Russian offensive, you can effectively blame the Russians for it, the same thing applies here, when Hamas attacked Israel they had to bear all responsibility, they can't say that person died in a car accident because he was running away from us, it's common since the attacker pays the bill.QuoteYour strawmen proves exactly what? I can go to Twitter and pull out fake videos from any side so that's proof enough to debunk a claim? This is proving exactly what? - Nothing! It proves that Israeli officials posted a video dating back to 2022 to \"prove that Hamas did it\", and then it was deleted, why did they have to have to do that if they were not responsible? why did they need to make an obvious false claim if they were too sure that they were innocent? QuoteWhen Russia attacked Ukraine, there have been videos from a chemical explosion in China from years ago, normal Twitter users are not the OSINT community. They will re-post anything for clicks. What normal people? the account that posted the video and then deleted it were 1- Michael Herzog (Ambassador of Israel to the United States)2- Israel state account (State of Israel's official Twitter account)Why do you think they posted the videos and then deleted them? these are not my words, these are Kolina Koltai's words, and the fake video posted by the two accounts can be found online.QuoteHamas is a terrorist organization and everyone is suffering from them. so are the IDF and the Israeli settlers, so if Hamas considered a terrorist organization when the the IDF is not? if we were to take the number of civilians killed by both sides, the IDF would win by an order of magnitude, you could call Hamas a terrorist group that's fine, Hamas could disappear after the war but nothing will change, the resistance ideology of Hamas will live forever, until the Israeli's elect a government that would put an end to all the suffering of the Palestinians, ditch the idea of building their Zionist empire that extends beyond the current occupied lands of Palestine to Lebanon, Syria, Jordan, and Egypt.The Palestinians lowered their demands over the decades in order to reach a mutual agreement with the Israelis and put into effect the two-state solution, they are now left with the last bit of land since Israel never honored any of its agreements, when someone has nothing to lose - they would do anything to take revenge, they couldn't care less what you call them or think about them, if you want to help the Israeli people live in peace, then help them get rid of this radical governments, sit on the negation table and have one last serious negotiations to bring peace to the whole region, launching airstrikes, invading Gaza, killing every Hamas member will not end the suffering for both nations.The collective West has the power to enforce that, but they are not willing to do that, it's almost like they are happy with the conflict since it does achieve some benefits for them.QuoteBut what these Hamas terrorists did there, murdering thousands of israeli civilians in such a brutal way, is not acceptable at all.Killing civilians is unjustified for anyone under any circumstances, fighting for your freedom is a right you were born with.QuoteThe fact, that we now have in Germany antisemitic rallies from \"pro Palestine\" (pro Hamas) folks, who are shouting \"down with Israel\" or \"gas the jews\" in GERMANY, is not acceptable. Houses, where Jews are living, were marked like in Hitler's 3rd reich. This is not acceptable. So now you are going to blame the Palestinians for the new Nazis? the Arabs and the Muslims alike have no problem with Jews (unlike the Nazis), the problem is with the Zionists, very different categories.QuoteUnfortunately, international law applies and refeugee crisis is a very hot topic in Germany right now. Yes, we need changes but when we make changes there, someone will be unhappy instead. As far as I know, most refugees there come from Syria, a country that was living in peace until (the U.S and its allies EU, Saudi, UAE, etc) decided to destroy the country, American troops are still there, making sure the country stays miserable, I think Germany shouldn't be the only one responsible here, you should divide the refugees between all the countries that helped in destroying Syria, and hopefully, this serves as a good less for Germany not to follow U.S steps in wars that bring nothing but tragedy to everyone except the likes of Lockheed Martin.QuoteAs I've said, the radical folks trying to force Islam onto European countries are very few. But they are existing and they won't refrain from suicide bombing our societey to death. I'm not interested to get an escalation, where more and more people are radicalized due to political islam. We have tons of nice Muslims in Germany, they don't make any issue at all, the problem are the radicalized ones and the past days have shown that we need to take it seriously. Like you, I'm also for a peaceful society.  We don't blame the Germans for what Nazi Germans did, but you guys keep labeling those extremists as Muslims, painting the picture that this is what the average Muslim, when in reality the most affected people by those extremists are the Muslims themselves, in your previous post you mentioned \"Allah Bullshit\" which is a direct insult to every Muslim reading it.What I know is, that the vast majority of people around the globe want to live in peace, I live in a Muslim country where most people can't even point Germany on the map, they don't even know the capital city of Germany, all they know is that BMWs are Mercedes are made there, many of them support Germany in the world cup (oh ya not much after the LGPT flag thing lol anyway) but in reality, they just don't care about Germany or any other place in the world, the sad part here is that many people in the West think that we wake up every morning to plan on how to harm you, invade you or anything of that stupid propaganda that the media spreads when in reality, we are busy working and hardly have the time for all that bullshit.It's also worth mentioning that comments like yours where you tie the word \"Islam/Muslim\" to every extremist/terrorist will make things only worse when someone in the U.S shoots 10 kids at school, you don't say \"A Christian terrorist\", so it's only fair that we treat everyone and every religion equally IMO.Anyway, this will be my last post in this thread, I always try my best to stay away from Politcs but my feelings get the best of me, sorry if I offended anyone here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "October 19, 2023, 02:18:27 AM",
      "body": "Quote from: 1miau on October 19, 2023, 01:41:09 AMYes, and we know that at least sinc last weak, where they went after several thousand Israeli civilians, except from the rocket launches by Hamas. Israel has it's \"Iron Dome\" for a reason.  That was brutal. I do not support anyone's attacks. Not even from Hamas. Usually, they were attacking Israel as a reaction to Israel's attack except for the attack on 7th October. Quote from: 1miau on October 19, 2023, 01:41:09 AMUnfortunately, Hamas took power in Gaza 2006/2007 from democratic Fatah and (no surprise) Hamas banned democratic elections. Since then, no democratic vote was hold in Gaza and Hamas started to ramp up their bullshit. I am not aware of their Inside story about who is ruling Gaza at this moment. If that's the case, it's not appreciatable. Quote from: 1miau on October 19, 2023, 01:41:09 AMWipe Israel off the map.  You and I both know it's impossible. If I am not wrong, they have only 40,000 members in their organization, and they don't have the special weapons that Israel has. It's kinda ant and Elephant fight. Palestine does not want to wipe of Israel off the map. They want freedom from them. Quote from: 1miau on October 19, 2023, 01:41:09 AMThe problem is that \"fighting for freedom\" for Hamas means to bomb Israelis to death.  That's not how peace is achieved. Of course, the religious israeli right wants to wipe Palestine off the map. With such folks, peace is impossible. These conflicts have been happening for ages; Israel built everything with their power and their invasion of the Palestinian people was continuous just like Russia did in Ukraine. People react at first, and then they forget things day by day. Quote from: 1miau on October 19, 2023, 01:41:09 AMThat's what I hope for Palestinians as well. But that won't be possible with Hamas because peace is no option for Hamas until Israel is wiped off the map. You seem so sure about their goal. I don't think they want to wipe Israel off the map. But I am not sure. If they have different goals except getting freedom from Israel, it's not acceptable. Quote from: 1miau on October 19, 2023, 01:41:09 AMNo need to lecture me on the issue I'm well aware about this conflict. I am no one to lecture you. I just wanted to share my POV with you with full respect which I mentioned at the start of my previous post. You seem to take it negatively. I feel like you did not watch the videos I referred to. Those are not any news. I respect you, and I thought you did too. But your usage of those emojis gives a different message dear 1miau.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 19, 2023, 03:04:27 AM",
      "body": "Quote from: mikeywith on October 19, 2023, 02:13:47 AMQuote from: 1miau on October 19, 2023, 12:34:58 AMI haven't claimed anywhere that New York Post is OSINT community. You clearly didn't read that article and you also didn't bother to check the OSINT community yourself. Alas, you cited NYpost article and said \"look, they said that OSINT confirmed that Hamas struck the hospital\" and I said, there is no such claim, link leads to GeoConfirmed which I followed closely, and read all the analysis, and nothing there that claims what you claimed, and since you failed to quote the source I now have the right to assume that you did not read anything past that NYpost article.Well, all the pictures that I've presented here are drawn by myself or I've copied them from the NYP article.   Quote from: mikeywith on October 19, 2023, 02:13:47 AMIf you even follow GC you would have seen their last thread where it sayQuoteIt rules out a rocket misfire. It means the possibilities are:1) Israel uses heat-seeking missiles (via cruise missile or airstrike) to destroy the rocket launchers, they fired some here and accidentally also hit the hospital, perhaps locked onto hospital's power generators.There are all sorts of speculations and analyses of what has happened, NONE of them say that Hamas struck the hospital, so again, where is your proof? QuoteYes, perhaps really sounds like we can rule out certain things... I didn't claim anywhere that Hamas targeted their own hospital deliberately. Of course, without giving the link and context, It's always easy to make bold claims. Quote from: mikeywith on October 19, 2023, 02:13:47 AMI've just posted one source from all the sources I've read about this. Is it so difficult to look it up or are you afraid to see some Hamas propaganda getting debunked into pieces?  You have not, you just posted a link to NYpost and claim it's solid proof, am asking where is your proof, you expect me to find it for you. Stop deliberately misinterpreting my posts. The link I've given from New York Post is just a summary. Do you think I'm writing here an essay now on this? It's just a waste of time anyway for Hamas asslickers like you, who don't even question what has happened there. We can present the evidence that the hospital is still intact and not destroyed by an israeli airstrike and we can present evidence that these 470 deaths are completely exagerated in this Hamas propaganda lie. Hamas is a terrorist organisation which end goal the annihilation of al Israelis is. They will make shit up, as long as people blindly defend them. Hamas is pure evil and I'm not surprised, considering how they took power in 2006 in Gaza and have destroyed any democracy there.  Quote from: mikeywith on October 19, 2023, 02:13:47 AMI don't know, you need to ask that official Israeli account where they got the video from, and why they deleted it after being confronted.Maybe they got it wrong, since everyone except Hamas is safe from being wrong in your opinion.  Quote from: mikeywith on October 19, 2023, 02:13:47 AMQuoteAnd like you've seen in the picture in that wired article, the hospital seems to be intact, doesn't it?  But you said Hamas struck it, so make up your mind, which one is it, the hospital is fine or Hamas did hit it? I've never written \"struck\" multiple times because striking means deliberately targeting something. It really looks like an accident. Once again, stop claiming I would have written something, which I didn't wrote. Not a really good look to bring such strawmen...  Quote from: mikeywith on October 19, 2023, 02:13:47 AMAlso, you seem to confuse missiles with nukes, the hospital is 27,500 square meters large, Nukes? What's this strawman now? You know what a nuke would do to the Gaza strip?  Quote from: mikeywith on October 19, 2023, 02:13:47 AMyou could hit one whole block and the rest wouldn't be affected, now whether 500 people were killed or not is up for debate, based on all the evidence I have seen so far, adding that to what I heard from friends in Palestine, I think it's highly exaggerated, What we can see from the pictures, there's not much damage at all. Quote from: mikeywith on October 19, 2023, 02:13:47 AMIt proves that Israeli officials posted a video dating back to 2022 to \"prove that Hamas did it\", and then it was deleted, why did they have to have to do that if they were not responsible? why did they need to make an obvious false claim if they were too sure that they were innocent? So what? Luckily we have many people to point it out and get to the correct version. Quote from: mikeywith on October 19, 2023, 02:13:47 AMQuoteWhen Russia attacked Ukraine, there have been videos from a chemical explosion in China from years ago, normal Twitter users are not the OSINT community. They will re-post anything for clicks. What normal people? the account that posted the video and then deleted it were 1- Michael Herzog (Ambassador of Israel to the United States)2- Israel state account (State of Israel's official Twitter account)Why do you think they posted the videos and then deleted them? these are not my words, these are Kolina Koltai's words, and the fake video posted by the two accounts can be found online.Because it's proven wrong? So, according to you, they should keep up all the wrong videos (like Hamas does)?  Quote from: mikeywith on October 19, 2023, 02:13:47 AMQuoteHamas is a terrorist organization and everyone is suffering from them. so are the IDF and the Israeli settlers, so if Hamas considered a terrorist organization when the the IDF is not?IDF are not advocating to wipe Palestine off the map. Some right wing settlers and right wing israeli parties are, yes. Quote from: mikeywith on October 19, 2023, 02:13:47 AM if we were to take the number of civilians killed by both sides, the IDF would win by an order of magnitude, you could call Hamas a terrorist group that's fine, Hamas could disappear after the war but nothing will change, the resistance ideology of Hamas will live forever, until the Israeli's elect a government that would put an end to all the suffering of the Palestinians, ditch the idea of building their Zionist empire that extends beyond the current occupied lands of Palestine to Lebanon, Syria, Jordan, and Egypt.That's bullshit and you certainly know this. There are moderates on both sides which would accept each other's country and there could be peace. Unfortunately, these moderates are not very numerous. On Palestinian side, these \"moderates\" (Fatah) where killed by Hamas in 2006 and Hamas took over the Gaza Strip. Any peaceful efforts were wasted due to a power hungry Hamas. Quote from: mikeywith on October 19, 2023, 02:13:47 AMThe Palestinians lowered their demands over the decades in order to reach a mutual agreement with the Israelis and put into effect the two-state solution, they are now left with the last bit of land since Israel never honored any of its agreements, when someone has nothing to lose - they would do anything to take revenge, they couldn't care less what you call them or think about them, if you want to help the Israeli people live in peace, then help them get rid of this radical governments, sit on the negation table and have one last serious negotiations to bring peace to the whole region, launching airstrikes, invading Gaza, killing every Hamas member will not end the suffering for both nations.Over the years, it's on both sides. Let's not forget, that 1948, directly after the British withdrawal, Israel was attacked by all arab countries nearby. Quote from: mikeywith on October 19, 2023, 02:13:47 AMQuoteBut what these Hamas terrorists did there, murdering thousands of israeli civilians in such a brutal way, is not acceptable at all.Killing civilians is unjustified for anyone under any circumstances, fighting for your freedom is a right you were born with.Hamas is NOT fighting for freedom, it's fighing to erase Israel. It was written in their founding charta of Hamas. Quote from: mikeywith on October 19, 2023, 02:13:47 AMSo now you are going to blame the Palestinians for the new Nazis? the Arabs and the Muslims alike have no problem with Jews (unlike the Nazis), the problem is with the Zionists, very different categories.Nowhere I've blamed \"the Palestinians\", I've blamed the radical Hamas and their asslickers. Big difference! Please stop twisting my words.  Quote from: mikeywith on October 19, 2023, 02:13:47 AMQuoteUnfortunately, international law applies and refeugee crisis is a very hot topic in Germany right now. Yes, we need changes but when we make changes there, someone will be unhappy instead. As far as I know, most refugees there come from Syria, a country that was living in peace until (the U.S and its allies EU, Saudi, UAE, etc) decided to destroy the country, American troops are still there, making sure the country stays miserable, I think Germany shouldn't be the only one responsible here, you should divide the refugees between all the countries that helped in destroying Syria, and hopefully, this serves as a good less for Germany not to follow U.S steps in wars that bring nothing but tragedy to everyone except the likes of Lockheed Martin.That's outright bullshit, so you are an dictator Assad asslicker as well, who bombed his own population deliberately to secure his dictatorship. And that disqualifies any advocacy for your alleged \"freedom fighting\" disguised as Hamas terrorists. Amazing what we have in this Bitcoin forum here, we'd imagine that dictators are getting the red card shown here, but now, they get applauded. Shame. Quote from: mikeywith on October 19, 2023, 02:13:47 AMQuoteAs I've said, the radical folks trying to force Islam onto European countries are very few. But they are existing and they won't refrain from suicide bombing our societey to death. I'm not interested to get an escalation, where more and more people are radicalized due to political islam. We have tons of nice Muslims in Germany, they don't make any issue at all, the problem are the radicalized ones and the past days have shown that we need to take it seriously. Like you, I'm also for a peaceful society.  We don't blame the Germans for what Nazi Germans did, but you guys keep labeling those extremists as Muslims, painting the picture that this is what the average Muslim, when in reality the most affected people by those extremists are the Muslims themselves, in your previous post you mentioned \"Allah Bullshit\" which is a direct insult to every Muslim reading it.Germans were responsible to a large degree allowing Hitler to run amok like he did and right now, these tendencies are growing again. And I've not labelled all Muslims as violent extremists, I've even written most of them are nice people here in Germany. Stop twisting my words - impossible challenge for you? I can recommend some Charlie Hebdo for you.  Quote from: mikeywith on October 19, 2023, 02:13:47 AMWhat I know is, that the vast majority of people around the globe want to live in peace, That's a noble goal but impossible with Hamas or right wing israeli settlers (yes, I critcize both sides). Quote from: mikeywith on October 19, 2023, 02:13:47 AMIt's also worth mentioning that comments like yours where you tie the word \"Islam/Muslim\" to every extremist/terrorist will make things only worse when someone in the U.S shoots 10 kids at school, you don't say \"A Christian terrorist\", so it's only fair that we treat everyone and every religion equally IMO.There a difference between Extremist/Islamist and normal, friendly Muslims. I don't know how often I should write this, I've written it often enough. We have quite a lot of nice and friendly Muslims in Germany. Quote from: mikeywith on October 19, 2023, 02:13:47 AMAnyway, this will be my last post in this thread, I always try my best to stay away from Politcs but my feelings get the best of me, sorry if I offended anyone here.Yes, thanks for nothing, have a peaceful day...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "October 19, 2023, 03:15:45 AM",
      "body": "Quote from: Learn Bitcoin on October 19, 2023, 02:18:27 AMQuote from: 1miau on October 19, 2023, 01:41:09 AMYes, and we know that at least sinc last weak, where they went after several thousand Israeli civilians, except from the rocket launches by Hamas. Israel has it's \"Iron Dome\" for a reason.  That was brutal. I do not support anyone's attacks. Not even from Hamas. Usually, they were attacking Israel as a reaction to Israel's attack except for the attack on 7th October. Peace is very difficult there, yes. Extremists are on both sides and that's why I've also criticized Israeli settlers in the past. Quote from: Learn Bitcoin on October 19, 2023, 02:18:27 AMQuote from: 1miau on October 19, 2023, 01:41:09 AMWipe Israel off the map.  You and I both know it's impossible. If I am not wrong, they have only 40,000 members in their organization, and they don't have the special weapons that Israel has. It's kinda ant and Elephant fight. Palestine does not want to wipe of Israel off the map. They want freedom from them. Exactly. Would Israel intend to wipe Palestine off the map, it would have happened long ago because Israel would have the capabilities. But there are some right wing parties in Israel, who would like to do that. So, advocating for moderates on both sides is our best bet. And hopefully, the war doesn't escalates further. Quote from: Learn Bitcoin on October 19, 2023, 02:18:27 AMBut your usage of those emojis gives a different message dear 1miau. I'm sorry if my emojis caused any inconvenience.  Sometimes, discussions are heated, I didn't want to cause any harm.  Have a nice day, dear Learn Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tetaeridanus",
      "created_time": "October 19, 2023, 08:32:39 AM",
      "body": "Quote from: Learn Bitcoin on October 19, 2023, 02:18:27 AMQuote from: 1miau on October 19, 2023, 01:41:09 AMYes, and we know that at least sinc last weak, where they went after several thousand Israeli civilians, except from the rocket launches by Hamas. Israel has it's \"Iron Dome\" for a reason.  That was brutal. I do not support anyone's attacks. Not even from Hamas. Usually, they were attacking Israel as a reaction to Israel's attack except for the attack on 7th October. Quote from: 1miau on October 19, 2023, 01:41:09 AMUnfortunately, Hamas took power in Gaza 2006/2007 from democratic Fatah and (no surprise) Hamas banned democratic elections. Since then, no democratic vote was hold in Gaza and Hamas started to ramp up their bullshit. I am not aware of their Inside story about who is ruling Gaza at this moment. If that's the case, it's not appreciatable. Quote from: 1miau on October 19, 2023, 01:41:09 AMWipe Israel off the map.  You and I both know it's impossible. If I am not wrong, they have only 40,000 members in their organization, and they don't have the special weapons that Israel has. It's kinda ant and Elephant fight. Palestine does not want to wipe of Israel off the map. They want freedom from them. Quote from: 1miau on October 19, 2023, 01:41:09 AMThe problem is that \"fighting for freedom\" for Hamas means to bomb Israelis to death.  That's not how peace is achieved. Of course, the religious israeli right wants to wipe Palestine off the map. With such folks, peace is impossible. These conflicts have been happening for ages; Israel built everything with their power and their invasion of the Palestinian people was continuous just like Russia did in Ukraine. People react at first, and then they forget things day by day. Quote from: 1miau on October 19, 2023, 01:41:09 AMThat's what I hope for Palestinians as well. But that won't be possible with Hamas because peace is no option for Hamas until Israel is wiped off the map. You seem so sure about their goal. I don't think they want to wipe Israel off the map. But I am not sure. If they have different goals except getting freedom from Israel, it's not acceptable. Quote from: 1miau on October 19, 2023, 01:41:09 AMNo need to lecture me on the issue I'm well aware about this conflict. I am no one to lecture you. I just wanted to share my POV with you with full respect which I mentioned at the start of my previous post. You seem to take it negatively. I feel like you did not watch the videos I referred to. Those are not any news. I respect you, and I thought you did too. But your usage of those emojis gives a different message dear 1miau. Sad to see dear 1miau is so close minded to this case and forgets Gaza belongs to Palestine. I don't think those emojis are meant to escalate anger but he likes emojis. Nonetheless, one opinion does not change the fact that Israel is doing war crimes everyday not only to Hamas but civilians of Palestine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}