{
  "id": "topic_5432956",
  "title": "senay",
  "author": "senay",
  "created_time": "January 04, 2023, 08:46:58 AM",
  "content": "hi. I am new to this community but i  think this is the best place to get an answer to my question. i am an old lady and i bought  some btc in 2016. i  have them on mycelium wallet. Since then a lot has been changed. Now my question is is mycelium wallet still good. I updated few times cant even remember when. If mycelium wallet not good what should I do? do i lose my btc? ect. thanks",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432956",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "January 04, 2023, 08:59:29 AM",
      "body": "Quote from: senay on January 04, 2023, 08:46:58 AMhi. I am new to this community but i  think this is the best place to get an answer to my question. i am an old lady and i bought  some btc in 2016. i  have them on mycelium wallet. Since then a lot has been changed. Now my question is is mycelium wallet still good. I updated few times cant even remember when. If mycelium wallet not good what should I do? do i lose my btc? ect. thanks Hello.There's a board specific for Mycelium: https://bitcointalk.org/index.php?board=231.0Maybe you manage to move this there, or at least into Wallet Software (https://bitcointalk.org/index.php?board=37.0)However, Mycelium is usually not advised because it's closed source. But it's not a bad wallet.If you have meaningful amount of coins, then the problem is not Mycelium, it's that you keep it in a not-secure-enough manner and you may want to consider buying a hardware wallet (I guess that setting up a cold storage is out of question, so I went for the most user friendly approach) and transfer your coins there, into safety.I will add that if you set up a new wallet - no matter is hardware wallet or whatever - make sure it's you who generates the new seed, make sure you save/store that seed offline in multiple places, make sure you recover your wallet at least once from the seed (to make sure it's the right wallet), make sure the new seed never touches a computer/smartphone (never goes online).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 04, 2023, 09:13:04 AM",
      "body": "Quote from: NeuroticFish on January 04, 2023, 08:59:29 AMIf you have meaningful amount of coins, then the problem is not Mycelium, it's that you keep it in a not-secure-enough manner and you may want to consider buying a hardware wallet (I guess that setting up a cold storage is out of question, so I went for the most user friendly approach) and transfer your coins there, into safety.Not sure how technically literate/illiterate OP is, but the best choice would probably be a Ledger Nano X, so it could be used with a mobile phone. Unless OP has a computer/laptop and know how to use it correctly, then a Ledger Nano S Plus would do.P.S. Follow the instructions carefully. Only store the backups offline on a piece of paper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qzl9899",
      "created_time": "January 04, 2023, 09:22:50 AM",
      "body": "Hello senay. Seeing that you said you bought Bitcoin in 2016, I am sincerely happy for you - you have made a very successful investment.I contacted cryptocurrency very late, which caused me to miss a lot. And because of the epidemic and work, my life is very difficult.Therefore, I look forward to receiving some of your support - some small help that will not affect you.I am a poet, a poet who writes in Chinese. I made many NFTs with Chinese poems. If I get some support from you, I am willing to give you these NFTs directly and keep in touch with you forever。I am not a liar. I will not directly give you an address and threaten you to transfer money. That is disrespect for you and myself. I just want your response. thank you!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "January 04, 2023, 09:29:39 AM",
      "body": "OP, please be very careful with private messages asking for help and offering help. Not all such people come with good intentions.At least when something is discussed publicly (here), others can see and correct/warn in case of anything shady.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "January 04, 2023, 09:49:38 AM",
      "body": "Mycelium wallet is quite good wallet, but just use it to transfer your coin, not hold all of your coins on online phone because a hacker might attack you via online. So you need to bought hardware wallet and transfer your funds from your Mycelium wallet. However there's a recent case where Luke Dashjr e.g. one of Bitcoincore's developer get hacked on his both online and hardware wallet. Better to buy 2-3 hardware wallet to split all your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "January 04, 2023, 10:01:51 AM",
      "body": "Quote from: senay on January 04, 2023, 08:46:58 AMhi. I am new to this community but i  think this is the best place to get an answer to my question. i am an old lady and i bought  some btc in 2016. i  have them on mycelium wallet. Since then a lot has been changed. Now my question is is mycelium wallet still good. I updated few times cant even remember when. If mycelium wallet not good what should I do? do i lose my btc? ect. thanks If you till remember or stored your passphrase well you are fine since you can recover your funds on wallet, but if you lose all of it and don't remember everything which can access your wallet then you might struggle to recover your funds. Remember its important to secure your passphrase or private key since this is serves as your password so please take care of it and don't give it to anyone. Mycelium wallet is a good wallet but if you mishandle to use this since you lost the access on your wallet then maybe you will get a problem with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}