{
  "id": "topic_5436519",
  "title": "Crypto Library",
  "author": "Crypto Library",
  "created_time": "January 23, 2023, 08:32:17 PM",
  "content": "Video: https://twitter.com/Canal_11Oficial/status/1616833846032343042Football fans across the world will be familiar with yellow and red cards that are brandished by referees.They were introduced over 50 years ago in the 1970 World Cup for fouls and disruption of the game.But history was made on Saturday 21st January as the first white card in football was shown by a match official in Portugal.It was shown during a clash between Sporting Lisbon and Benfica women's teams in the women's Portuguese league cup, in which Benfica won 5-0.What is a white card?The card was introduced by Portuguese authorities as part of a new initiative to encourage teams to act in a sporting manner and get immediate positive recognition.It can be shown to anyone who is involved in fair play and is designed to improve the ethics in the sport.Why was it shown?The card was shown just before half-time to medical staff from both sides after they rushed to the aid of a fan who felt unwell in the stands.As the card was shown to the medical staff, the crowd stood on the their feet to applaud the medics as they walked back to the dugout.           sourceAs football is one of the most popular games in sports gambling and its updates are very important for gambling. Many times the result of the match changes on the basis of yellow and red cards, so in football  cards showing  is important and also for gambling. The main purpose of opening this topic is to get familiar with white cards.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436519",
  "comments": [
    {
      "author": "Merit.s",
      "created_time": "January 23, 2023, 09:58:41 PM",
      "body": "I haven't seen it before and if I may ask does the white card control only the medics to inform them about a player or fan that needs medical attention or it also have a meaning to the players in a match. Though,this is a good initiative by the Portuguese to him taken their time to come up with such idea but it is FIFA that will determine if this card will be introduced to international football or not. To me it looks funny since yellow card and red card must be used in a game to caution the players fr rough attacks and to limit injuries or to discipline players or coach that are arrogant on the pitch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "January 23, 2023, 10:14:23 PM",
      "body": "From what I've read from source, I think the introduction of the white card by the Portuguese authorities is a good initiative and one that might not take a lot of time before its adopted into international football.We have yellow and red card which are used to warn or ban players from the match, it makes sense to introduce another card which can be used to applaud players that play very well, and the white card could be perfect for that purpose, so indeed, it's a good idea the Portuguese authorities have shown to the world, I hope FIFA adopts this in no distance time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "January 23, 2023, 10:20:49 PM",
      "body": "Quote from: Fivestar4everMVP on January 23, 2023, 10:14:23 PMFrom what I've read from source, I think the introduction of the white card by the Portuguese authorities is a good initiative and one that might not take a lot of time before its adopted into international football.We have yellow and red card which are used to warn or ban players from the match, it makes sense to introduce another card which can be used to applaud players that play very well, and the white card could be perfect for that purpose, so indeed, it's a good idea the Portuguese authorities have shown to the world, I hope FIFA adopts this in no distance time. The color of peace being used is really good. As said the white card being used to applaud the good act is really impressive and a much needed one. Once after a red card the player won't be able to play one match in the tournament. Same as that something credits for holding more white card makes the new rule even more impressive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "January 23, 2023, 10:25:09 PM",
      "body": "Quote from: romero121 on January 23, 2023, 10:20:49 PMQuote from: Fivestar4everMVP on January 23, 2023, 10:14:23 PMFrom what I've read from source, I think the introduction of the white card by the Portuguese authorities is a good initiative and one that might not take a lot of time before its adopted into international football.We have yellow and red card which are used to warn or ban players from the match, it makes sense to introduce another card which can be used to applaud players that play very well, and the white card could be perfect for that purpose, so indeed, it's a good idea the Portuguese authorities have shown to the world, I hope FIFA adopts this in no distance time. The color of peace being used is really good. As said the white card being used to applaud the good act is really impressive and a much needed one. Once after a red card the player won't be able to play one match in the tournament. Same as that something credits for holding more white card makes the new rule even more impressive.Interesting new adoption.I think that it will be used rarely in a true men game as men are different than women,they can get pretty aggressive,just go and watch some youtube videos with soccer games from South America and some African leagues,you will see a lot of UFC fighting more than they are playing football and it get pretty messy in those leagues,sometimes even the referee is assaulted by hooligans,fans of those teams so I think it would not be that much of use or even if it will be it is going to be just for show but not for real,that is why FIFA has not implemented it yet and it doesn't look like they will do soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcampaign",
      "created_time": "January 23, 2023, 10:30:16 PM",
      "body": "but has this white card been used also by the big football leagues or other cup events, I don't know about this information but glad you shared it allin this thread so i learned a lot, as far as i know only red and yellow cards during watching football",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "January 25, 2023, 06:33:18 AM",
      "body": "Quote from: bitcampaign on January 23, 2023, 10:30:16 PMbut has this white card been used also by the big football leagues or other cup events, I don't know about this information but glad you shared it allin this thread so i learned a lot, as far as i know only red and yellow cards during watching footballAs this is the first time a white card has been used in a club-based game in Portugal. Benifica Vs Sporting women's football match Referee Catarina has used a white card for the first time. At first it was not clear why the white card was shown, but after the white card was shown, two medical officers were seen proceeding to provide treatment. It is known that during the match, if any player becomes unfit i.e. sick, then a white card is arranged for immediate medical treatment. A card like this had never been shown in the past, so this first showing of a white card created a new dimension in the world of football.The importance of this card is that if a player's physical condition deteriorates, the white card is used to signify that it is a special and very important part of a sport.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "January 25, 2023, 06:53:34 AM",
      "body": "Well, I don't see the real purpose of this \"white card\"... but it's me. I mean, what's the point? Do you get a white card and big applause? Maybe I am missing something?I had fun reading the comments, there are some good ones:QuoteA white card to promote fair play..How about we dont give money to crying fake injured soccer players that act like babies on the field. The sport is a joke.Is this really something we can expect in the future:QuoteIf the white card is good. What will the sure to follow black card mean?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "January 25, 2023, 07:04:11 AM",
      "body": "Football is loved through the world because of its agression. I am not against the white card but I am not sure whether the white card will bring any benefits to the game. Above all this card was shown in a women football match, they are way less agressive if you consider men's football. I do not think the referee would be able to use the white card when men are playing the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silence Scream",
      "created_time": "January 25, 2023, 07:11:49 AM",
      "body": "In Platini's statement in 2014, the White Card was actually spoken with the aim of taking the football player out of the field for 5-10 minutes.  However, the Portuguese Football federation developed it as a reward mechanism.  In the mentioned match, the medical team was “awarded” with a white card.  We can see this as an important positive development for Fair Play.  I think it can be an application that will add color to football, I hope we will see it more often.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinerer",
      "created_time": "January 25, 2023, 07:39:31 AM",
      "body": "I have never seen a white card given in a football game before. This is the first time I saw such an incident.  I don't know if I have complete knowledge about the game of football  However, as much knowledge as there is, this matter is not known. I think this white card means something special in Portugal.  I need to study more on this topic to be clear about it. Being clear about it seems like I will gain some new knowledge in the game of football.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "January 25, 2023, 07:43:33 AM",
      "body": "This is a new developments in the world of football, a white card? wow!Quick question, We all know that a player is suspended from some games as a penalty if they booked by the Referee with a yellow card a number of times;Quote-Five yellows accumulated before match week 19 results in a one-match ban.-Ten yellows accumulated by week 32 will result in a two-match ban.-Fifteen yellows by week 38 means a three-match ban.-Twenty yellows in a season can result in the Regulatory Commission punishing the player in a manner that they deem to be most fitting.For Red Cards; Quotea red card means instant dismissal. When it comes to the length of any suspension period, it is dependent on the nature and seriousness of the foul, as follows:-For a sending off, after a second yellow in one game, the suspension period is one match.-For a so-called professional foul, a player will also receive a one-match ban.-If the foul in question is dissent, it will normally be a two-match ban.-If we are talking about violent conduct, the punishment is normally a three-match ban.  source What will happen when a player is shown the white card many time in one game or season?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "January 25, 2023, 07:46:58 AM",
      "body": "Normally cards are tools use to regulate football games to keep in check, making sure players play according to standard rules as laid down which any tackles and behavior deviation of that attracts either the yellow or red card depending on the gravity of your offense.As the yellow and red cards are for reprimanding it's also good to have a card that applaud good act too on the pitch as this will encourage good character amongst players and management as the white cards shows that one's good act is publicly recognized.It's a nice development into football!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "January 25, 2023, 08:23:56 AM",
      "body": "So, uh, it's a public recognition card in other words? I won't deny that it's a good thing, but in the general scheme of things for a match, I don't think it has that much of an effect compared to a red/yellow card. And idk if making people feel good for doing what they're supposed to do is a necessity. Definitely, a good thing since it'd probably boost their feelings or something similar, but idk, it just paints itself in a bad way of sorts in my view. Additionally, is this even used in players? The example uses it on a \"medical staff\" so I'm not sure. Cause if it is, then it'd be pretty hard to measure what \"public recognition\" per match would be, if it was just MVP's or an MVP play then it'd be a lot easier, but then again they'd have to reward that AFTER the game, so giving out a white card in the middle of the game doesn't seem like it'd pose that much of a use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "January 25, 2023, 12:04:23 PM",
      "body": "Quote from: iv4n on January 25, 2023, 06:53:34 AMWell, I don't see the real purpose of this \"white card\"... but it's me. I mean, what's the point? Do you get a white card and big applause? Maybe I am missing something?I think exactly the same thing, although I'm not surprised given the current era of goodism in which we live. If it has no more implications than a round of applause or the referee saying that you are practicing fair play, I don't see much sense in it. But maybe I'm wrong and this type of 'moralistic' cards will be generalized in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nimogsm",
      "created_time": "January 25, 2023, 12:35:59 PM",
      "body": "A good way to draw attention to women's football and a very competent PR move.I am not sure that the innovation will be applied in the men's leagues there are currently enough and two cards and the rules will not be changed.If a white card also appears in the main leagues, it will be interesting because the card will not greatly affect the rules we are familiar with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "January 25, 2023, 12:55:04 PM",
      "body": "It seems to me that the condition of the fans who came to the match and thereby trusted their teams with their money is really worth paying attention to, and when everything that happens outside the playing field does not interest anyone, then this is also not right and the fans deserve attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Erumo",
      "created_time": "January 25, 2023, 01:04:22 PM",
      "body": "They should add \"LGBT colored\" card in football. Show player this card, and he would never behave bad on the field. This will act like a warning card, that shows what punished player should expect to get in a locker room if he did not stop fouling or playing aggressively towards other team members. I am convinced that such card will have a quick effect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "January 25, 2023, 01:24:54 PM",
      "body": "Quote from: Rruchi man on January 25, 2023, 07:43:33 AM....What will happen when a player is shown the white card many time in one game or season?Applause and some sort of recognition or maybe respect. You get more of that when you get more white cards hehe. I wish there is an actual reward but it's basically useless and it will not affect how the game is decided unlike the yellow and red. Players will still continue with how they play on the field using their dirty tricks or dives just to get an advantage for their team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "January 25, 2023, 01:29:17 PM",
      "body": "Quote from: Erumo on January 25, 2023, 01:04:22 PMThey should add \"LGBT colored\" card in football. Show player this card, and he would never behave bad on the field. This will act like a warning card, that shows what punished player should expect to get in a locker room if he did not stop fouling or playing aggressively towards other team members. I am convinced that such card will have a quick effect. Are you serious? In my opinion LGBT propaganda is very common nowadays and it seriously annoys people who only accept traditional sexual relationships.The white card in soccer is an interesting initiative, but LGBT propaganda in soccer is unnecessary. I don't mind sex minorities doing things in their own homes that interest them, but when they promote their orientation to children it's too much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}