{
  "id": "topic_5410751",
  "title": "SafuBTC",
  "author": "SafuBTC",
  "created_time": "August 22, 2022, 06:00:00 AM",
  "content": "Which play to earn game is worth having in your connections right now? Also, are you a fan of card games like Gods Unchained?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410751",
  "comments": [
    {
      "author": "asriloni",
      "created_time": "August 22, 2022, 06:43:40 AM",
      "body": "Gods unchained was a garbage card game. I prefer to take berserk from vulcan rather than garbage game called gods unchained. I can earn lava and i can swap it into the USDT even though that needs minimum xp to be able to earn lava but this far better rather than gods unchained. Gods unchained was a game that rely with the hype but im not even seeing something useful from this game rather than so many garbage NFT card with no utilities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "August 22, 2022, 07:33:22 AM",
      "body": "Quote from: SafuBTC on August 22, 2022, 06:00:00 AMWhich play to earn game is worth having in your connections right now? Also, are you a fan of card games like Gods Unchained? I've stopped playing P2E games as the value of majority of them has dropped. I haven't played God Unchained and other card games except Axie Infinity.I think that the latter was the most popular of them all but things have changed. That popularity of theirs have gone eventually, thanks to the market situation and all of their crappy updates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "August 22, 2022, 11:02:30 AM",
      "body": "Quote from: SafuBTC on August 22, 2022, 06:00:00 AMWhich play to earn game is worth having in your connections right now?Don't touch them!Play to Earn projects are bad because they are inflationary. You imagine it like this. If their projects have good marketing, growth, more players will join, invest first and play their games. The more players play their games, the more tokens will be created in a same time. The more active players, the higher inflationary rate.If you are not smart, determined and fast with your decision, you will stuck after their tokens were dumped.You can choose Play To Earn category from Coinmarketcap or Coingecko, check charts and see how those projects have dumps in past months. Their tokens will be dumped in either bull or bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "August 22, 2022, 11:10:04 AM",
      "body": "Currently all existing p2e games is not profitable anymore including the biggest of them all like Axie Infinity. Investors and players don’t want to invest more money on the game which cause the lack of liquidity for the token rewards to absorb. There’s no point on investing to games like this on bear market because no one is buying more NFTs and tokens to give value on the reward. The team is just getting the reward money from the player itself so the p2e system is useless in time like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitKongy",
      "created_time": "August 22, 2022, 12:01:16 PM",
      "body": "Quote from: asriloni on August 22, 2022, 06:43:40 AMGods unchained was a garbage card game. I prefer to take berserk from vulcan rather than garbage game called gods unchained. I can earn lava and i can swap it into the USDT even though that needs minimum xp to be able to earn lava but this far better rather than gods unchained. Gods unchained was a game that rely with the hype but im not even seeing something useful from this game rather than so many garbage NFT card with no utilities. You got this right friend, this is why I don't invest money in Gods unchained project, there is a massive hype going on with this project and when I checked it out its just a NFTa and card thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FirmWars",
      "created_time": "August 22, 2022, 12:05:40 PM",
      "body": "Quote from: OcTradism on August 22, 2022, 11:02:30 AMQuote from: SafuBTC on August 22, 2022, 06:00:00 AMWhich play to earn game is worth having in your connections right now?Don't touch them!Play to Earn projects are bad because they are inflationary. You imagine it like this. If their projects have good marketing, growth, more players will join, invest first and play their games. The more players play their games, the more tokens will be created in a same time. The more active players, the higher inflationary rate.If you are not smart, determined and fast with your decision, you will stuck after their tokens were dumped.You can choose Play To Earn category from Coinmarketcap or Coingecko, check charts and see how those projects have dumps in past months. Their tokens will be dumped in either bull or bear market.Are there any type of projects in crypto space right now that haven't dumped down to 80% already? Bro you don't have a point, if we are in a bull market and these projects dumped then your point will be valid, the only play to earn game I am into is illuvium, no other crypto project like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "August 22, 2022, 12:13:14 PM",
      "body": "Except if you are a heck of a serious player striving to reach to the top of the leaderboard, which again demands a decent amount of money and your free time; It is impossible that you will still be able to earn a reasonable amount of money by playing these games. And I'm not only referring to P2E games like Axie Infinity or Gods Unchained here but in general.If you still want to play, you might want to give up the notion of their earning potential and just play the game for fun instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "August 22, 2022, 12:22:30 PM",
      "body": "It depends, are you planning to invest to make money or you are planning to invest and support the project? Many play to earn games are bad generally, and the few serious ones that I like are far from completion right now, Decimated is in development and the token is 90% down from all time high, illuvium is now 90$ from 1800$ and few more. .. You can make money off them but be wise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoATM",
      "created_time": "August 22, 2022, 12:50:41 PM",
      "body": "Is there anything that's better than Vulcan Forged right now? I mean this project is more reliable since its already up and running, gameplay and fun are present in this game than Axie infinite, supply is very thin too, 50$ to 100$ per PYR in 2024 is easy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YellowSwap",
      "created_time": "August 22, 2022, 02:09:26 PM",
      "body": "With the likes of Star Atlas I believe that it's just the beginning, few play-to-earn games mixed metaverse with their project and that's what I am talking about, how will such a project not survive? The problem is many play-to-earn projects are rushed by the team to make money in the bull market, of cos you can't expect all of them to be serious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayTrain",
      "created_time": "August 22, 2022, 06:17:38 PM",
      "body": "very rarely come across p2e games where you can play and passively earn, or you need to enter the game at the very beginning to make a profit, my last game that brought me a small profit is the \"squid game\" from the biswap dex exchange, at first it was pretty good, but today the game is suspended because the pool has run out of funds from the developers....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 22, 2022, 09:54:06 PM",
      "body": "Quote from: jossiel on August 22, 2022, 07:33:22 AMQuote from: SafuBTC on August 22, 2022, 06:00:00 AMWhich play to earn game is worth having in your connections right now? Also, are you a fan of card games like Gods Unchained? I've stopped playing P2E games as the value of majority of them has dropped. I haven't played God Unchained and other card games except Axie Infinity.I think that the latter was the most popular of them all but things have changed. That popularity of theirs have gone eventually, thanks to the market situation and all of their crappy updates.Same here, it is a waste of time and money since P2E often needs initial capital to play the game and need extra fund to keep up with the game competition. .  Only a few are free but it will give us hard time in order to have something to cash out. Well, most of p2e today mimic Axie infinity because of its huge success but I tried to avoid all of them after what happened to Axie infinity reward token SLP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "August 22, 2022, 10:51:49 PM",
      "body": "Quote from: OcTradism on August 22, 2022, 11:02:30 AMPlay to Earn projects are bad because they are inflationary. You imagine it like this. If their projects have good marketing, growth, more players will join, invest first and play their games. The more players play their games, the more tokens will be created in a same time. The more active players, the higher inflationary rate.I'm not so sure about your inflationary angle since they also have burning mechanisms in place for their NFTs. The main problem with many of these P2E games is the mismanaging of their reward pool. They offered a high percentage return to players but they could not sustain it. Players leave once it is drained and move on to other games they could exploit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Grim149x",
      "created_time": "August 23, 2022, 03:45:42 PM",
      "body": "Dyor about dream quest it also card game ithink they have a potentail easy money when the game was release. Thats why iak buying token and hold it soon it will be lambo they also partner on sand box",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ije07",
      "created_time": "August 23, 2022, 04:55:17 PM",
      "body": "Currently I only play p2e games that are on the Wemix wallet because some of the games provided are in accordance with the game genre that I like and moreover to do token transactions on the game to the wallet also seems simple so it only requires a wallet application from Wemix to connect to those games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WalkerIVIV",
      "created_time": "August 23, 2022, 11:45:59 PM",
      "body": "my gaming choice is just axie infinity and vulcan forged, these two are currently the ones that have bigger chance of dominating the entire gaming niche in blockchain.there are indeed something like gala that's just as good but it already valued relatively high that it left low chance of making good roi.instead axie infinity is already losing its market capitalization hugely same thing with vulcan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "autumnleaf",
      "created_time": "August 24, 2022, 02:14:30 AM",
      "body": "Quote from: SafuBTC on August 22, 2022, 06:00:00 AMWhich play to earn game is worth having in your connections right now? Also, are you a fan of card games like Gods Unchained? It's my first time hearing about Game Gods Unchained so i don't have info and experience to share but if we are talking about other P2E I am sure you are familiar already with Axie Infinity. So far, Axie Infinity comes first in mind to me been playing almost 2 years now and it is good that I get to it play early on its stage and earn bountiful from it but now its hard to now due market conditions but I still play when I have time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "August 24, 2022, 03:06:34 AM",
      "body": "Quote from: jossiel on August 22, 2022, 07:33:22 AMQuote from: SafuBTC on August 22, 2022, 06:00:00 AMWhich play to earn game is worth having in your connections right now? Also, are you a fan of card games like Gods Unchained? I've stopped playing P2E games as the value of majority of them has dropped. I haven't played God Unchained and other card games except Axie Infinity.I think that the latter was the most popular of them all but things have changed. That popularity of theirs have gone eventually, thanks to the market situation and all of their crappy updates.We still cannot confirm that they are completely dead because there are still many p2e projects in the process of formation and development. But now it can be said that their hype is over and they are no longer as profitable as we expected, especially in a market where everything is very tough. Now is not the time to join the P2E game, as we do not know what their future holds, best wait until the bear season is over, if they have a niche to survive, we will consider it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "August 24, 2022, 04:42:03 AM",
      "body": "Quote from: CryptoATM on August 22, 2022, 12:50:41 PMIs there anything that's better than Vulcan Forged right now? I mean this project is more reliable since its already up and running, gameplay and fun are present in this game than Axie infinite, supply is very thin too, 50$ to 100$ per PYR in 2024 is easy. We can't actually say there's or no but the problem is almost all of play to earn projects have been facing the same problem. As far as i know vulcan forged was also focusing into the inflation problem that happened with another play to earn game. I remember there are lots of play to earn game like that like SKILL, TLM and many more. Some of these play to earn were dead. The only problem is how can make the economy become sustain for the players. We know that grinders have become the main opponents from play to earn game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}