{
  "id": "topic_5419910",
  "title": "igotek",
  "author": "igotek",
  "created_time": "November 08, 2022, 08:19:26 AM",
  "content": "Türkiye Petrolleri müşterielrini önemsemiyor, hırsız muamelesi yapıyor ve bunun için özür bile dilemiyor. Üzerine sizden faizle para talep ediyor. Üzerine paranıza el koyuyor. Lütfen detaylı şekilde yazdıkalrımı okuyunuz ve bu firmada nuzak durunuz. Dört yıldır yakıt aldığım firmadan nasıl nefret ettim lütfen sizlerde okuyun. Cimere ve tüketici hakem heyetine ayrıca şikayet ettim. Elimden geldiği kadar internet ortamında pek çok yerde herkesin bu bilgiye ulaşması için yaşadıklarımı yazacağım.***Dört yılı aşkın süredir Türkiye Petrolleri isimli firmanın yakıt istasyonlarından sürekli olarak hem eşimin aracına hem de kendi aracıma yakıt almaktayım. Aracımdan çıkmadan yakıt alabilmek için internet üzerinden web sitelerinden taşıt tanıma sistemlerine defalarca başvurdum. Ancak müşteri hizmetlerini arayıp ne zaman geleceğini sorduğumda her seferinde yakın bir tarihte adresinize gönderilecek, beklemeniz gerekiyor diyerek yedi ay boyunca oyaladılar. Bir gün yakıt alırken istasyon görevlisine bu durumu şikayet ettiğimdeTürkiye Petrolleri isimli bir uygulama çıkardıklarını ve cep telefonuma yükleyerek oradan aynı işlemleri yapabileceğimi söyledi.Cep telefonuma Türkiye Petrolleri uygulamasını yükledim. Uygulamada belirtildiği şekilde 18/06/2022 tarihinde 1 TL yükledim. Paranın uygulamaya geçtiğini görünce aynı tarihte 749 TL daha yükleme yaptım. Uygulama içerisinde toplam 750 TL param oldu.Aracıma yakıt almak için istasyona gidip Türkiye Petrolleri uygulaması ile yakıt almak istediğimi söyledim. Görevlinin önünde cep telefonumdaki uygulamaya gerekli bilgileri girdim. Ancak pompayı taktığında yakıt vermedi. Müşteri hizmetlerini aradığımda ise hatta bekleme müziği dinletiliyordu ve kimseyle konuşamadım. 10 dakika kadar hatta bekledikten sonra acelem de olduğu için istasyondaki görevliye 750 TL vererek yakıt almak zorunda kaldım.Ertesi gün müşteri hizmetleri ile görüştüğümde kullanıcı hatası olduğunu söyleyerek 750 TL’nin uygulamaya geçmesi için tekrar işlem yaptığını belirtti. Uygulamadan işlemlerin başlatılmadan önce görevlinin pompayı araca takıp tuşuna basması gerekiyormuş. İki gün sonra 750 TL tekrar uygulamaya geldi. Haziran ayı içerisinde eşimle beraber aracımızla Hatay’dan İzmir’e doğru Akdeniz turuna çıktık. Yakıtımız azaldığında yolumuz üzerinde gördüğümüz Türkiye Petrolleri istasyonlarından yakıt almak istedik. Ancak hiçbir yerden yakıt alamadığımız gibi bir istasyondaki görevli bize “Hacker mısınız ? Yakıt çalacaksınız değil mi? Pompayı öyle her gelenin aracına taksaydık, ohooo!” diyerek aşağıladı. Herkesin içinde rezil olduk ve arkamıza bakmadan uzaklaşmak zorunda kaldık. Üstelik müşteri hizmetlerine bunu bildirdiğimde özür dilemek yerine bazı istasyonlarımızın uygulama hakkında bilgisi yoktur denildi.21/06/2022 tarihinde sonunda Muğla ilindeki bir istasyondaki görevli bize kibarca yardımcı olacağını söyledi. Pompayı araca takıp tuşuna bastı ve uygulamaya gerekli bilgileri girdik ve yakıt alımı başladı. Uygulamada ne kadar yakıt alınmak istenildiğinin bilgisi girilmesi gerekiyor. 750 TL olarak girdik, içindeki paramı kullanıp uygulamayı artık silmek istiyordum. Çünkü yıllardır yakıt aldığım firmadan bu uygulama yüzünden artık nefret ediyordum. Ancak aracım 650 TL yakıt aldıktan sonra pompa durdu. Aracıma daha fazla yakıt alınamıyordu. Ancak uygulama 750 TL kesti ve istasyon görevlisinden 650 TL yakıt aldığıma dair fiş aldım.   Müşteri hizmetlerini arayarak durumu izah ettim ama yine ısrarla kullanıcı hatası olduğunu söylediler. Aracımın ne kadar yakıt alacağını benim önceden bilmem mümkün değil. Böyle bir teknoloji zaten yoktur. Araç ne kadar yakıt alırsa o kadar ücret kesmeleri gerekirdi. 100 TL iadesi için kayıt açıldı.   Aradan günler geçtikçe sürekli olarak müşteri hizmetlerini arayıp tartışmak zorunda kaldım. Çünkü 650 TL yakıt aldığımı ve uygulamadan 750 TL çekildiğini gördüklerini söyledikleri halde 100 TL paramı bir türlü iade etmiyorlardı. Her aradığımda farklı bir bahane söylüyorlardı.“Paranız zaten hesabınıza iade gelmiş.”“Para yanlışlıkla bir başkasına iade edilmiş. Beraber çalıştığımız firmayı konu hakkında uyardık, düzeltecekler.”“İadeniz neden gelmiyor, bilmiyoruz.”“Para hesabınıza geçmiş ama siz harcamışsınız.”   Bir gün hesabımda 100 TL görünce Türkiye Petrolleri istasyonuna giderek beni şu uygulamadan kurtarın dedim. 08/08/2022 tarihinde istasyon görevlisi yardımcı oldu ve uygulamadan 100 TL tutar çekip yakıt verdi. Daha sonra söz konusu uygulamayı sildim.   Aradan iki hafta kadar geçtikten sonra cep telefonumu arayan biri Türkiye Petrolleri’ne borcum olduğunu söyledi. Ancak durumu izah edince biz gerekli incelemeyi yapıp düzelteceğiz deyip kapattılar.   07/11/2022 tarihinde beni arayan biri yine borcum olduğunu söyleyince uygulamayı telefonuma tekrar yükledim. Kontrol ettiğimde uygulamada 100 TL para gözüküyor ve 112,64 TL borcum olduğu görünüyor. Müşteri hizmetlerini arayıp durumu izah ettim. İnceleyeceklerini söylediler. Ancak yine hiçbir şey yapmayıp beni mağdur edeceklerini biliyorum.   İnternetten biraz araştırma yaptığımda bu uygulamada müşterilerin parası olmasa dahi müşterilere hazır limit adı altında para yüklendiğini ve bunun kullanılması durumunda faiz talep ederek geri ödeme istediklerini öğrendim. 18/06/2022 tarihinde 750 TL ödedim.21/06/2022 tarihinde 650 TL yakıt aldım.08/08/2022 tarihinde 100 TL yakıt aldım. Bu işlemi kendi paramla değil müşterilerine sundukları hazır limitle yapıldığını öğrendim. Bu işlemi zaten istasyon görevlisi yardım ederek yaptı. Bu işlem için benden faiz talep ediliyor.14/09/2022 tarihinde uygulamaya 100 TL iade yüklemişler. Bu yüklenen para benimmiş. Girdi çıktı olarak bakıldığında aslında alacak verecek yoktur. Ancak firma ısrarla benden para ödememi istiyor. Zaten kendi yaptıkları uygulama olması gerektiği gibi çalışmadığı için bu kadar soruna neden oldular.Yukarıda anlattığım şekilde gerçekleşen olay için ben 750 TL harcadım, 750 TL yakıt aldım. Benim hiç kimseye borcum yoktur. Tüm işlemlerin tarihlerini yazdım. Ya uygulamadaki 100 TL alacağım ve 112,64 TL borcum silinsin ve bana borcumun olmadığına dair yazılı imzalı belge verilsin, ya da benim paramı çalıştırdıkları için ben de faiz talep ediyorum!18/06/2022 tarihinde 750 TL yükledim. Bu paranın 650 TL’sini harcadım. 100 TL’sini Türkiye Petrolleri benden haksız olarak aldı ve 14/09/2022 tarihine dek kullandı. 14/09/2022 tarihinde uygulamaya parayı iade olarak yüklediklerini bildirmediler. Zaten uygulamadaki para da kendilerinde ve bu parayı da kullanamıyorum. İstasyon görevlileri ile bu uygulama yüzünden tartışmaktan bıktım, usandım. Düzgün çalışmayan bir uygulama yapmışlar ve istasyon görevlilerine gerekli eğitimi vermemişler.18/06/2022 tarihinden itibaren hala devam etmekte olan bu tarihe dek ve bu tarihten sonrasına dek paramı benden haksız yere alarak kişisel çıkarları için kullanan bu firmadan ben de faiz talep ediyorum. 08/11/2022 tarihinde beni arayan Türkiye Petrolleri temsilcisi ısrarla borcum olduğunu ve konuşmayı hukuk birimine aktaracağını ve ödemekle yükümlü olduğunu söyledi. Kontrol ettiğimde uygulamadaki 100 TL’yi kullanarak ödeme yapıldığını ancak 12,78 TL daha ödeme yapılması gerektiğini öğrendim. Küsuratlı ödeme yapılmadığından 13 TL ödeme yapmaya mecbur bırakıldım. Daha sonra söz konusu tutarı ödedim. 22 kuruş içeride param kaldı.Beni mecbur bıraktıkları ödeme tutarı 13 TL’nin tarafıma iadesini ve söz konusu firmadan özür bekliyorum. Aylarca süründürdüler bir de utanmadan faiz aldılar. Hırsız muamelesine uğradığım petrol istasyonunda eşimle beraber herkesin önünde rezil oldum. Özür dilemeleri gerekirken bir özür dahi dilemediler. Üstüne faiz aldılar. Bunun adı zorbalıktır. Madem benim paramı bu kadar süre çalıştırdınız siz niye faiz ödemiyorsunuz dediğimde ise böyle bir uygulamaları olmadığını söylediler.Baştan sona her durumda hem yanlış işlem yapan, hem suçlu olan, hem borçlu olan benmişim. Olması gerektiği gibi çalışmayan bir uygulama yapmışlar. Yaptıkları uygulamadaki sorunların/hataların düzeltilmesi yerine müşterilerini suçlayan bir firma var. Üç ay boyunca para iadesini yapamamak beceriksizliktir. Bu tarz büyük firmaların bu kadar sorumsuz davranması kabul edilemez. 13 TL beni zengin etmez ama bir firmanın itibarını yerle bir eder. Sorun 13 TL değil, sorun firmanın olaya yaklaşımı.Evet, uygun fiyata yakıt satıyorlar ama müşterilerini bu şekilde mağdur ediyor ve hatalarını kabullenmiyorlarsa ben o yakıtı ne yapayım!!!!HAKKIM GEÇTİ VE HARAM ZEHİR ZIKKIM EDİYORUM !",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419910",
  "comments": [
    {
      "author": "wolwoo",
      "created_time": "November 08, 2022, 11:37:12 AM",
      "body": "Üstad çok geçmiş olsun.Paranla rezil olmak deyimiyle özdeşleşen bir deneyim yaşamışsınız, bir musibet bin nasihatten iyidir. Kurumsal firmaların bu tür olaylardaki yaklaşımı yapılacak en güzel reklam-pr çalışması iken söz konusu firmanın bu konuda sınavı veremediği açıkça görülüyor. Ben de hepsiburada'dan birsey almıştım, kaç defa yazdım ettim, gelen ürün küçük boyuttaydı. Neyse sonunda parayı iade etti hepsiburada, ürün de sizde kalsın dediler, firmaya kesmiştir faturayı ellam..o olaydan sonra bir süre kullanmadım uygulamayı ama en azından biraz uğraşsam da sorunumu çözdülerdi. Sonra tekrar alışveriş yapmaya başladım. Getir de mesela o konuda iyi, bi defasında meyve bozuk geldi, dedim hemen iade edildi param. istegelsin ürünü eksik gönderdi 1 saat sonra kapımdaydı...Karşıdaki kişiye gerekli eğitim verilirse sonuç alınır ancak laf olsun diye müşteri hizmetleri varsa \"olmasa daha iyiydi\" dedirtir adama...tekrar geçmiş olsun",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "November 08, 2022, 12:10:59 PM",
      "body": "Hocam çok geçmiş olsun. baştan sona yazdıklarınızı okudum. türkiye petrollerini hep görüyorum hiç alışverişim olmamıştı. bu olay gösteriyor ki bir daha alışveriş yapmamam gerekiyor bu firmadan. sorun meblağ tutarı değil Türkiye’de böyle bir algı var sanki meblağ tutarı önemli gibi laf ediyorlar. önemli olan sizin hakkınızı arama talebiniz. hakkınızı hukuki kanallarla aramanızı tavsiye ederim. gidin bu olayları söyleyin şikayetçi olun. siz değil onlar uğraşsın. kayıtlar istenir mahkemede mutlaka o zaman kıvıramazlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "November 08, 2022, 01:23:58 PM",
      "body": "Abi benzini Shell'den kızı kelden alıcan diye boşa demiyorlar, kaç yıldır aktif olarak araç kullanıcısıyım ama 1 kere bile yakıtımı türkiye petrollerinden almışlığım yok, gerekte görmüyorum güzelim Shell var onuda bulasazsam gider Opetten alırım, afedersinde sokayım uygun fiyatına Geçmiş olsun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 08, 2022, 10:11:42 PM",
      "body": "Shell'den şaşmam, aslında üç aşağı beş yukarı hepsinin (bilinenlerin) yakıtı aynı ama mevzu denetimde patlıyor, kendi deneyimlerime göre bu konuyu en sıkı tutan Shell, dolayısıyla yakıtın kendisi de, hizmet kalitesi de belli bir çizgide.Yoksa paranın tamamını elin gavuruna yedireceğime, hele de mesela tuvaletine gönül rahatlığıyla girdiğimiz için ihtiyaç amaçlı durduğumuz Opet varken yerlileri tercih etmek isterdim ama kazın ayağı öyle değil maalesef, Opet'te üçkağıt daha çok (çatı şirketi kastetmiyorum, istasyon anlamında tabii ki)Not: Ankara'da otururken Opet kullanırdım ama SADECE Mehmetçik Vakfı'nın işlettiği istasyonlardan alırdım, oralarda verilen ürün sıfır hata, lokum gibi yakıt veriyorlar ama İzmir'de yok ne yazık ki.İlgilenene Mehmetçik Vakfı Opet istasyon listesi:- Yenişehir Akaryakıt İstasyonu;İstanbul ili Pendik ilçesi Kurtköy mevkiindeki VIAPORT alış veriş merkezi girişinde bulunan ve mülkiyeti Vakfa ait 3.368,53 m² büyüklüğündeki arazide bulunan akaryakıt ve LPG istasyonu market, haberleşme ve tuvalet gibi hizmetleri 24 saat esasına göre verilmektedir. Tesisimiz, yerleşim ve verdiği hizmet bakımından örnek tesis niteliğindedir. Tesis Aralık 2012 ayında hizmete girmişAdres : Yenişehir Mah. Dedepaşa Cad. No: 21 Pendik / İSTANBULTel : 0 (216) 482 00 00Faks : 0 (216) 482 50 50- Maslak Akaryakıt İstasyonu;Maslak Büyükdere Caddesi üzerinde, 3’üncü Kolordu Komutanlığı yanında bulunan, mülkiyeti hazineye ait ve Vakfa 29 yıllık irtifak hakkı ile tahsis edilen tesisimizde; akaryakıt satışı, market ve araç yıkama hizmetleri verilmekte olup, OPET Petrolcülük A Ş tarafından 03 Kasım 2001 tarihinde anahtar teslimi ve ücretsiz inşa edilmiş ve 2008 yılında yan parsele taşınan istasyon 2008 yılının Eylül ayından itibaren daha büyük bir alanda hizmet vermeye başlamıştır.İstasyon teknolojik, görsellik ve hizmet açısından dünya standardında olup, günlük akaryakıt satışı bakımından da sektörde lider konumunda bulunmaktadır.Adres :  Reşitpaşa Mahallesi (Maslak Mevkii) Büyükdere Caddesi No: 219 D: 3 Sarıyer / İSTANBUL Tel : 0 (212) 285 27 97 / 0 (212) 285 27 98 / 0 (212) 285 28 48Faks : 0 (212) 285 17 10- Kurtköy Akaryakıt İstasyonu ve Dinlenme Tesisleri;Anadolu Otoyolu 27+450'nci km Kurtköy mevkiinde bulunan akaryakıt ve dinlenme tesisleri, 16 Kasım 1998 tarihinde Karayolları Genel Müdürlüğünden 10 yıl süreli olarak kiralanmış, 05 Şubat 2009 tarihinden sonraki yıllarda sözleşmesi birer yıllık süreyle yenilenmiş, Kasım 2013 ayından itibaren de Kurtköy B Tipi OHT için 10 yıllık yeni sözleşme yapılmıştır. Akaryakıt ve Dinlenme Tesisleri, otoyolun her iki tarafında 204.000 m2'lik kısmı yeşil alan ve 35.000 m2'lik kısmı tesis (1.500m2 kapalı alan) alanı olmak üzere toplam 239.000m2 alana kurulmuştur. Aynı zamanda şirket merkezi durumunda da olan tesis, akaryakıt sektöründeki son teknolojiye göre inşa edilmiştir. Tesislerde;a. Kuzey İstasyon Bölgesi (Ankara-İstanbul İstikameti)b. Güney İstasyon Bölgesi (İstanbul-Ankara İstikameti) olmak üzere karşılıklı iki tesisten oluşmaktadır. Tesisler \"B Tipi Otoyol Hizmet Tesisi\" katagorisinde ve otel hizmeti hariç (lokanta, market, hediyelik eşya, mescit, duş, tuvalet, vb.) tüm ihtiyaçlara cevap verecek şekilde 24 saat esasına göre hizmet vermektedir. Tesisler son olarak 2014 yılında yenilenerek otoyolda seyahat eden yerli/yabancı tüm sürücü ve yolculara uluslar arası standartlarda cevap verecek düzeye getirilmiştir.Adres : 1. İstasyon: Fatih Mah. Kâtip Çelebi Cad. No: 2 Tuzla / İSTANBUL                      2. İstasyon: Fatih Mah. Kâtip Çelebi Cad. No: 6 Tuzla / İSTANBUL              3. İstasyon: Fatih Mah. Kanuni Cad. No: 1 Tuzla / İSTANBUL                                           Tel : 0 (216) 482 50 11 / 0 (216) 482 49 83 / 0 (216) 482 48 93 Faks : 0 (216) 482 49 73- Ankara (Eskişehir Yolu) Etimesgut Akaryakıt İstasyonu;Çağlayan Sosyal Tesislerinden hemen sonra Ankara-Eskişehir yoluna cepheli ve mülkiyeti Vakfa ait arazide kurulu tesisimiz 4.500 m² büyüklüğündedir.Adres: Erler Mah. Dumlupınar Blv. No: 402 Etimesgut / ANKARATel : 0 (312) 236 47 70Faks : 0 (312) 236 47 75- İstanbul Güngören Akaryakıt İstasyonu;İstanbul ili, Güngören ilçesinde bulunan ve mülkiyeti Vakfa ait arazide kurulu istasyonumuz 15 Kasım 2013 tarihinde akaryakıt sektöründeki son teknoloji ile inşa edilerek hizmete açılmıştır. İstasyonda; Akaryakıt Çeşitleri ile LPG istasyonu, market, haberleşme ve tuvalet gibi hizmetler 24 saat esasına göre verilmektedir. Adres: Gençosman Mahallesi Şehit Orgeneral Eşref BİTLİS Cad. No: 10 Güngören / İSTANBULTel : 0 (212) 562 20 00Faks : 0 (212) 562 40 00",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "November 09, 2022, 07:18:35 PM",
      "body": "Quote from: MK-74 on November 08, 2022, 01:23:58 PMAbi benzini Shell'den kızı kelden alıcan diye boşa demiyorlar, kaç yıldır aktif olarak araç kullanıcısıyım ama 1 kere bile yakıtımı türkiye petrollerinden almışlığım yok, gerekte görmüyorum güzelim Shell var onuda bulasazsam gider Opetten alırım, afedersinde sokayım uygun fiyatına Geçmiş olsun.Shellden kız alacaksın kelimesini yeni duydum hocam ben güzel bir lafmış  bende genellikle shell kullanıyorum. bulamayınca opet veya bpet alıyorum. bir kaç kez petrol ofisinden aldım petrol ofisi bile sorun çıkardı bana. burada hocamıza çok üzüldüm. konuya da bir çok güzel bilgiler eklenmiş. buradan faydalananlar da olacak konuda. türkiye petrolleri artık bir sürü potansiyel müşteri kaybediyor. ben de anlatacağım tanıdıklarıma.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 09, 2022, 07:33:39 PM",
      "body": "Bizim burada bana göre shell iyi değil en iyisi petrol ofisi. Bizim buradaki shell'den yakıt alın emin olun daha az km gideceksiniz. Konu dışı olacak ama sadece o değil denetlenmeyen heryer bu durumda.N11'den eylül sonuna doğru bir spor ayakkabısı aldım ayakkabı istediğim değilde farklı model göndermişler adamlara ulaşıp ürünün hatalı olduğunu anlattıp doğru ayakkabıyı istediğimi söyledim bak buraya kadar herşey normal değilmi?N11 den iade etmek istedim satıcı firma ups kargo harici çalışmıyormuş ilçede ups kargo yok. ups geldi aldı gitti bu gerizekalılar ürünü yanlış ve kod olmadan yollamış n11'e iade kodu gireceğiz ya giden kargo sisteme yansımadı kargoyu aradım hatalı yolladıklarını ürünü geri çağırdıklarını söylediler ürün 5 günde geri geldi ilk iade hakkı doldu ve kod iptal oldu o kod olmayınca yeni talep oluşturdum ve tekrar iade kodu aldım.n11'in verdiği kodu ups kargoda girecek menü yokmuş upsde iade ederken girilen kod başka bir kodmuş n11'i aradık ulaştık defalarca anlattığım halde 15 günde derdimi anlayabildiler. 15 günün sonunda verilen cevap herhangi bir kargoya verebilirmişim sorun şu ki ben tekrar iade kodu oluşturamıyorum adamlar bunun içinde 4 gün bekletti. bu süreçte kargocu ile iyice ahbab oldukNeyse dedik. ayakkabı kargoda bekliyor ve herhangi bir firmadan yollamak için tam geri çağıracağım ups kargonun sistemine başka bir kod gelmiş. O da nesi kod ile karşı taraf değil kargoyu ben ödüyorum. Kargocu onu düzeltti gitti geldi derken 1.5 ayda ayakkabı bana zor ulaştı.Ülkemizde özel sektör dahil artık işini düzgün yapan yer kalmadı.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "November 09, 2022, 07:55:24 PM",
      "body": "Quote from: mandown on November 09, 2022, 07:33:39 PMBizim burada bana göre shell iyi değil en iyisi petrol ofisi. Bizim buradaki shell'den yakıt alın emin olun daha az km gideceksiniz. Konu dışı olacak ama sadece o değil denetlenmeyen heryer bu durumda.N11'den eylül sonuna doğru bir spor ayakkabısı aldım ayakkabı istediğim değilde farklı model göndermişler adamlara ulaşıp ürünün hatalı olduğunu anlattıp doğru ayakkabıyı istediğimi söyledim bak buraya kadar herşey normal değilmi?N11 den iade etmek istedim satıcı firma ups kargo harici çalışmıyormuş ilçede ups kargo yok. ups geldi aldı gitti bu gerizekalılar ürünü yanlış ve kod olmadan yollamış n11'e iade kodu gireceğiz ya giden kargo sisteme yansımadı kargoyu aradım hatalı yolladıklarını ürünü geri çağırdıklarını söylediler ürün 5 günde geri geldi ilk iade hakkı doldu ve kod iptal oldu o kod olmayınca yeni talep oluşturdum ve tekrar iade kodu aldım.n11'in verdiği kodu ups kargoda girecek menü yokmuş upsde iade ederken girilen kod başka bir kodmuş n11'i aradık ulaştık defalarca anlattığım halde 15 günde derdimi anlayabildiler. 15 günün sonunda verilen cevap herhangi bir kargoya verebilirmişim sorun şu ki ben tekrar iade kodu oluşturamıyorum adamlar bunun içinde 4 gün bekletti. bu süreçte kargocu ile iyice ahbab oldukNeyse dedik. ayakkabı kargoda bekliyor ve herhangi bir firmadan yollamak için tam geri çağıracağım ups kargonun sistemine başka bir kod gelmiş. O da nesi kod ile karşı taraf değil kargoyu ben ödüyorum. Kargocu onu düzeltti gitti geldi derken 1.5 ayda ayakkabı bana zor ulaştı.Ülkemizde özel sektör dahil artık işini düzgün yapan yer kalmadı. Ülkedeki en iyi işini yapan özel sektördekiler bile hatalar yapabiliyor. N11 gibi platformlarda insanlar rahatlıkla mağaza açabiliyor. Sen bu insanın içini bilmiyorsun ki, nasıl bir esnaf olduğunu bilmiyorsun. Mağazadan tüm iyi niyetle ürünü alıyorsun ancak esnaf o kadar sorunlu ki sana nasıl zorluk çıkaracaksa çıkarıyor. 1.5 ayda kargo işinin çözülmemesi de bunlardan bir örnek olarak görebilirim. Esnaf iyi niyetli olsa ups diye diretmezdi. Neyse sonunda hallolmuş gözünüz aydın hocam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "püsür",
      "created_time": "November 09, 2022, 07:57:10 PM",
      "body": "Benzinliklerde oçluğu gerçekten çok arttı. Yukarıda yazıldığı gibi kesinlikle çoğunda hile var. Aynı yolu aynı hızda gittiğimde bariz fark ediyorum. İstanbul çevresinde 3 ilde benzin aldım, bence kesin çoğunda hile dönüyor. Ayrıca eski bir komşumuz vardı. Sigara dağıtım işinde çalışıyordu yanlış hatırlamıyorsam jti, bütün işleri günleri yolda geçiyor yani. Kesinlikle opet'ten aldıklarını ve diğerlerinden iyi olduğunu söylüyordu. Kendi arabası için de opet'ten alıyordu yani. Ancak bizim evin oradaki opet'in hile yaptığını düşünüyorum ben.Türkiye Petrolleri konusu ise gerçekten faciaymış. Geçmiş olsun. Kim bilir kadrolarında ne boş tipler var...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "November 09, 2022, 08:49:44 PM",
      "body": "Bende genelde Opet'ten yakıt alıyorum bulunduğum şehirdeki Shell istasyonunda önceden problemli yakıt satışları yapıldığı için aracıma o bayiden hiç yakıt almadım. Hafta sonu yakıt biraz daha ucuz diyerek Lukoil bayisinden alayım dedim girişteki tabela ile pompadaki fiyat arasında neredeyse 1 lira fark vardı burada benim fark etmediğim bu indirimli fiyat 100 lira üzeriymiş bende farklı fiyat olduğundan dolayı 50 liralık alım yapayım bir sonraki gün Opet bayisinden alırım dedim (kart harcama puanı için) 50 liralık yakıt benim menzilimi değiştirmedi tahminen yakıt koyulmadı diyeceksiniz ki 2 litre bile değil değiştirmez ki ama inanın en az 30-40 km menzil artması gerekirdi çünkü önceki ve sonraki 200 liralık alımlarım aynı miktarda menzil arttırdı. 50 lira önemli değil de istasyonda böyle durum varsa başkaları da olumsuz etkilenmesin şikayet edeceğim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "November 09, 2022, 09:56:40 PM",
      "body": "Öncelikle geçmiş olsun. Uygulamayı muhtemelen test etmeden sunmuş olabilirler. Gerçekleşen hata zaten sizden kaynaklı olmadığı için yakıt verip tutardan az para çekilmişse bile bunu nezaketen şirketin ödemesi doğru olurdu ve konuyu kapatmalılardı. Müşteri memnuniyetinin ön plana alınmadığı çok açık. Bende bu tip durumlarla karşılamamak için olabildiğince shell veya opet tercih ediyorum ayrıca akaryakıt uygulamalarından uzak kalıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "November 11, 2022, 07:52:38 AM",
      "body": "Geçmiş olsun, oldukça saçma sapan olaylar silsilesi ile karşılaşmışsınız resmen. Bu tür işlemleri müşteri hizmetlerinin düzeltmesi çok da zor olmamalı, ilk görüşülen kişi halledemiyorsa üst birime aktardığında sorunun çözülmesi lazım. Kendileri de biliyor ortada bir alacak verecek durumu olmaması gerektiğini ama işi yokuşa sürmek için uğraşmışlar resmen.Türkiye Petrolleri kullandığım bir marka değildi ama artık mecbur kalmadıkça hiç kullanmam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "judas",
      "created_time": "November 11, 2022, 01:57:23 PM",
      "body": "Sırf bu tarz pürüzler yaşamamak için istemeyerek daha global markaları tercih ediyorum çünkü böyle bir olay yaşadığınız vakit karşınızda muhatap bulma şansınız daha yüksek oluyor.Genellikle kullandığım opetlerin tuvaleti vs temiz olduğu için tercihim opet oluyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "November 14, 2022, 04:30:16 PM",
      "body": "Hep denk geliyordum yol kenarında bu petrol istasyonlarına ancak hiç alışveriş yapmamıştım. Bu başınıza gelen sorundan dolayı ilerleyen zamanlarda da alışveriş yapacağımı zannetmiyorum. Genellikle Opet, Shell gibi bilindik markaları tercih ediyorum. Kuruş fark var zaten değmez.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "November 14, 2022, 10:13:26 PM",
      "body": "Quote from: Red Pie on November 09, 2022, 07:18:35 PMQuote from: MK-74 on November 08, 2022, 01:23:58 PMAbi benzini Shell'den kızı kelden alıcan diye boşa demiyorlar, kaç yıldır aktif olarak araç kullanıcısıyım ama 1 kere bile yakıtımı türkiye petrollerinden almışlığım yok, gerekte görmüyorum güzelim Shell var onuda bulasazsam gider Opetten alırım, afedersinde sokayım uygun fiyatına Geçmiş olsun.Shellden kız alacaksın kelimesini yeni duydum hocam ben güzel bir lafmış  bende genellikle shell kullanıyorum. bulamayınca opet veya bpet alıyorum. bir kaç kez petrol ofisinden aldım petrol ofisi bile sorun çıkardı bana. burada hocamıza çok üzüldüm. konuya da bir çok güzel bilgiler eklenmiş. buradan faydalananlar da olacak konuda. türkiye petrolleri artık bir sürü potansiyel müşteri kaybediyor. ben de anlatacağım tanıdıklarıma.Ahahhaha yanlış anlamışsın hocam, Benzini Shellden, Kızı Kelden alıcaksın söz, benzinden kız alacaksın değil Shell den şaşmayın abi, Shell  yoksa bulunduğunuz yerde o zaman Opet, benim sıralamam bu şekilde.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 17, 2022, 04:52:50 PM",
      "body": "Başlığı görünce aklıma yılar önce Burdur da amcamın Türk petrol ( o zaman adı öyleydi diye biliyorum) iş yapmıştı. Şirketi adından dolayı Türk firması zannediyordum ama iş yeri sahibine sordum yabancı şirketmiş. Ben şimdiye kadar hiç bu firmadan aracıma ne gaz ne de benzin almadım. Bana iyi bir firma olarak gelmiyor. Bir de petrol ofisini hiç sevmem. Shell ve BP tercihim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "November 17, 2022, 05:20:07 PM",
      "body": "Quote from: ajanwalker on November 17, 2022, 04:52:50 PMBaşlığı görünce aklıma yılar önce Burdur da amcamın Türk petrol ( o zaman adı öyleydi diye biliyorum) iş yapmıştı. Şirketi adından dolayı Türk firması zannediyordum ama iş yeri sahibine sordum yabancı şirketmiş. Ben şimdiye kadar hiç bu firmadan aracıma ne gaz ne de benzin almadım. Bana iyi bir firma olarak gelmiyor. Bir de petrol ofisini hiç sevmem. Shell ve BP tercihim. Opet shell bp benim de tercihlerim ama petrol ofisi de almak zorunda kaldığında alabileceğin bir petrol firması. diğer ismi bilinmedik firmalara göre daha iyi en azından. bir sürü firma görüyorum hiç birinden almıyorum ve tanıdıklarım da almıyor nasıl bu kadar para kazanıyorlar onu da anlamıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 17, 2022, 05:29:30 PM",
      "body": "valla şu petrolcülerin, pompacı amk, yaptığı çakallıkları anlatsam bir daha araba kullanmazsınız. bunun yanında konuda yaşanan olayda bence çakallık yok, tam anlamıyla işten anlamamak bulunuyor. yok abicim olmuyor işte zorlamayın. sizin yapmanız gereken sadece benzin istasyonunda benzin satmak. teknoloji konularına vs girmeyin!!!geçen haftaya kadar ben de shell'den takılıyordum ama arabamı yıkamak için 44 saniye vermeleri ve hiçbir şekilde su gelmemesi yüzünden artık tamamen bıraktım. onlar da çok üzüldü zaten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}