{
  "id": "topic_5445424",
  "title": "bfsaxz",
  "author": "bfsaxz",
  "created_time": "March 18, 2023, 06:34:27 PM",
  "content": "Hello,,i bought btc in my btc wallet there stands right now wallet balance uncofirmed if i click on the transaction in front of it there is a green check mark and if i click on the transaction there stands status 16 confirmed what to do now because it has been for alot of hours unconfirmed in my wallet but the transaction there stands green check mark with 16 confirmed what now please help thank you!!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445424",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "March 18, 2023, 06:36:37 PM",
      "body": "I'm not sure I understand what's the problem. If you can see that the transaction is confirmed and has 16 confirmations already, where does it show as \"unconfirmed\"? It would be helpful if you can provide a screenshot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bfsaxz",
      "created_time": "March 18, 2023, 06:43:00 PM",
      "body": "in electrum its showing as confirmed with green check mark 17 confirmation status on electrum i see red circle dot filled in red if i click on it there stands wallet balance unconfirmed so i dont understand it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "March 18, 2023, 06:44:33 PM",
      "body": "Quote from: bfsaxz on March 18, 2023, 06:43:00 PMin electrum its showing as confirmed with green check mark 17 confirmation status on electrum i see red circle dot filled in red if i click on it there stands wallet balance unconfirmed so i dont understand it.It sounds like your wallet is not synced with electrum servers properly. Try to click on the red circle, and connect to another server by right-clicking and selecting \"Use as server\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "March 18, 2023, 06:45:41 PM",
      "body": "Quote from: bfsaxz on March 18, 2023, 06:43:00 PMin electrum its showing as confirmed with green check mark 17 confirmation status on electrum i see red circle dot filled in red if i click on it there stands wallet balance unconfirmed so i dont understand it.You don't need to panic, it just means your Electrum client is not synchronized with the latest block data, so it doesn't know that your transaction has already confirmed.Try closing Electrum and opening it again, or disable any anti-virus software that may be blocking the ports used by Electrum. Or you can do what OmegaStarScream said and select another server to sync with.After clicking on the green circle, you will get a window like this:Ensure that there is at least 1 node that has block height at least 781383 (presumably the block your transaction is in).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "March 18, 2023, 07:38:15 PM",
      "body": "Copy the address you purchased your bitcoins to (or TX ID,) and paste it here https://blockchair.com/bitcoin, if your balance is correct, you are safe. Your issue is with wallet sync.If you reinstall your wallet (after delete it from a while) delete \"certs\" directory in \\AppData\\Roaming\\Electrum or connect it to any other server/use VPN/TOR it will work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}