{
  "id": "topic_5443440",
  "title": "1miau",
  "author": "1miau",
  "created_time": "March 05, 2023, 05:50:48 PMLast edit: March 23, 2023, 02:03:32 AM by 1miau",
  "content": "Für neue Nutzer im Forum scheint es immer wieder schwierig zu sein, die ersten Merits zu sammeln. An dieser Stelle soll daher eine kleine Sammlung entstehen, auf die als Ressourcen zurückgegriffen werden kann. Merit wurde im Februar 2018 eingeführt, um die folgenden Punkte zu fördern: - Es sollen qualitativ gute Beiträge hervorgehoben werden. - Die Beitragsqualität im Forum soll insgesamt verbessert werden. - Der Spam und Missbrauch durch Signaturkampagnen soll verringert werden. Hier der originale Beitrag mit Begründung der Forumsleitung. Merit wird von diesem Zeitpunkt an benötigt, um im Forumsrang aufzusteigen: __________________________________________________________________________RangBenötigte AktivitätBenötigtes Merit__________________________________________________________________________Brand new00__________________________________________________________________________Newbie10__________________________________________________________________________Jr Member301__________________________________________________________________________Member6010__________________________________________________________________________Full Member120100__________________________________________________________________________Sr. Member240250__________________________________________________________________________Hero Member480500__________________________________________________________________________LegendaryZufällig im Bereich 775-10301000Um der Intention des Merits gerecht zu werden, ist es daher wichtig, zu wissen, dass nicht jeder Beitrag Merit bekommen soll, denn wenn Merit systematisch für Beiträge verteilt wird, die dem ursprünglichen Gedanken der Einführung des Merits entgegen stehen, dann könnte das als Merit-Missbrauch gewertet werden. In schlimmen Fällen hat das in der Vergangenheit sogar zu negativem Trust geführt, heute kann es zu neutralem Trust führen oder Ausschluss in Signaturkampagnen. Auch das Betteln um Merit ist nicht gerne gesehen und kann mit Trust geahndet werden. Es ist daher sehr wichtig, sich das Merit ehrlich mit guten Beiträgen zu verdienen, denn davon profitiert auch das Forum insgesamt. Was einen guten Beitrag ausmacht ist nicht zu 100% präzisierbar aber die Dinge, die in den 1miau Merit-Kriterien dargelegt wurden, sind eine sehr gute Übersicht dazu: 1miau Merit-KriterienEs gibt diverse Möglichkeiten im Forum, wie man selbst als neuer Forumsnutzer Merit durch etwas Einsatz verdienen kann, ohne ein Blockchain-Profi zu sein. Daher ein paar Beispiele, von denen manche aber im internationalen Bereich sind: Angebote im deutschsprachigen Forenbereich: Hier bietet 1miau an, für gute Kommentare, die klassische Bärenmarkt-Durchhalteparolen präsentieren, Merit zu vergeben. Hier könnt ihr cygan erklären, wie ihr zum Nutzernamen eures Bitcointalk-Account gekommen seidHier bietet qwk an, ihm eure besten Beiträge zu präsentieren, von denen ihr denkt, dass diese noch mehr Merit verdienen. Aktuell ist qwk jedoch nur selten aktiv. Hier bietet tyz an, ihm eure besten Beiträge zu präsentieren, von denen ihr denkt, dass diese noch mehr Merit verdienen. Aktuell ist tyz jedoch nur selten aktiv. Angebote im internationalen Forenbereich: Hier bietet fillippone an, die eigenen Beiträge zu verlinken und fillippone vergibt dann nach der Evaluierung etwas Merit, wenn die Beiträge von hoher Qualität sind. Link: [Merit] Share your best posts/threads with Fillippone to be merit assessedVorgeschlagen von CoinEraserRatimov bietet neueren Forumsmitgliedern an, ihre Beiträge zu evaluieren. Dort muss man nur den Rang, Anzahl an Merit und sein Profillink in einem Beitrag hierlassen. Er schaut dann bei Gelegenheit das Profil durch und verteilt gegebenenfalls Merit. Link: [Merit] Help newbies and those who have a little left to the next rankVorgeschlagen von CoinEraserHier bietet BlackHatCoiner für Newbies und Jr. Members an, sich 1 Merit zu verdienen, wenn sie bei ihm Testbitcoins anfordern und diese dann im Bitcoin Testnetz versenden und im Lightning Netzwerk. Die tBTC sollten nach dem Test an ihm zurückgegeben werden. Der Faden soll dazu motivieren, das Lightning Netzwerk zu testen.Link: [Merit] Help newbies and those who have a little left to the next rankVorgeschlagen von CoinEraserHier könnt ihr den Merit-Quellen gut Beiträge verlinken. Es wird jedoch nicht so gerne gesehen, wenn eigene Beiträge verlinkt werden. Falls eigene Beiträge verlinkt werden, sollte pro verlinktem Beitrag mindestens 2 Beiträge anderer Nutzer verlinkt werden. Link: Berichtet gute Beiträge den Merit-Quellen Hier bietet Fivestar4everMVP an, dass ihr einen Kommentar abgeben könnt, wenn einem weniger als 25 Merit fehlen, um den nächsten Forumsrang zu erreichen. Link: [v2][Self Moderated] In Merits, Count Down To Your Next Rank...Vorgeschlagen von CoinEraserDieses Angebot von Fivestar4everMVP wurde weiterentwickelt, nachdem es beimersten Versucht viel Durcheinander gab. Hier der damalige Text des ersten Versuchs: Hier bietet Fivestar4everMVP an, dass ihr einen Kommentar abgeben könnt, wenn einem nur noch 25 Merit fehlen, um den nächsten Forumsrang zu erreichen. Es ist allerdings fraglich, ob man dort Merit bekommt, da der Faden mittlerweile sehr entgleist ist. Link: [FUN][In Merit] Post Count Down To Your Next Rank Here. Vorgeschlagen von CoinEraserHier bietet Lafu an, dass er euch Merit gibt, wenn ihr Malware im Forum aufdeckt. Manche Hacker erstellen gefälschte ANN Projektvorstellungsfäden, in denen sie die Malware verlinken, welche auf GitHub platziert wird. Lafu engagiert sich bei der Aufdeckung solcher Hacker und wenn ihr ihm dabei helft und auch einen Hacker aufdeckt, könnt ihr dafür Merit erhalten. Link: Report Malware and Suspicious Links here so Mods can take Action ! Vorgeschlagen von LafuWer gut übersetzen kann, der könnte sich den Faden von fillippone ansehen, in dem er anbietet, dass andere Nutzer seine Beiträge übersetzen und in ihren lokalen Forumsbereichen präsentieren können. Es ist sehr wahrscheinlich, dass fillippone für Übersetzungen Merit vergibt. Link: Help me translate my best posts in your Local BoardVorgeschlagen von CoinEraserWer gut übersetzen kann, der könnte sich den Faden von GazetaBitcoin ansehen, in dem GazetaBitcoin anbietet, dass andere Nutzer GazetaBitcoin's Beiträge übersetzen und in ihren lokalen Forumsbereichen präsentieren können. Es ist sehr wahrscheinlich, dass GazetaBitcoin für Übersetzungen Merit vergibt. Link: Help me translate my best posts in your Local BoardVorgeschlagen von CoinEraserGerne können weitere Beispiele in diese Liste aufgenommen werden. Merit zu verdienen mag daher zu Beginn schwer erscheinen aber wer immer wieder bemüht ist, gute Beiträge zu schreiben, wird rasch merken, dass es gar nicht so schwer ist, Merit zu verdienen. Wichtig ist, dass man gewillt ist, gute Beiträge zu schreiben und dies wird stets von etablierten Forumsteilnehmern honoriert.  In diesem selbst-moderierten Faden gelten die allgemein anerkannten Regeln:- Kein Off-Topic- Keine Pyramidenzitate- Kein unnötiges Denglisch- Keine Beiträge oberflächlicher Qualität (Shitposts)- Keine Diffamierungen- Keine unnötigen Memes / GIFs- Kein Getrolle",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443440",
  "comments": [
    {
      "author": "CoinEraser",
      "created_time": "March 05, 2023, 07:52:01 PM",
      "body": "Das ist wieder ein schöner Faden von dir, 1miau!Im internationalen Bereich des Forums gibt es noch einen Faden, in dem man einen Beitrag schreiben kann, wenn einem nur noch 25 Merit fehlen, um den nächsten Forumsrang zu erreichen. Dies soll auch dazu dienen, das Merit-Quellen oder andere Benutzer des Forums dort reinschauen, sich die Beiträge der Forumsmitglieder anschauen und dann für gute Beiträge Merit verteilen.Natürlich gibt es keine Garantie dafür, dass man auch Merit bekommt, aber bisher klappt es wohl ganz gut und der Faden hat schon einigen Leuten geholfen, ihren neuen Rang zu erreichen. So oder so sollte man sich aber zuerst den ersten Beitrag des Fadens durchlesen und sich an alle Regeln halten. Dann wird die Chance größer, dort auch Merit zu erhalten.  Link: [FUN][In Merit] Post Count Down To Your Next Rank Here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "March 05, 2023, 08:21:06 PM",
      "body": "Quote from: CoinEraser on March 05, 2023, 07:52:01 PMDas ist wieder ein schöner Faden von dir, 1miau!Im internationalen Bereich des Forums gibt es noch einen Faden, in dem man einen Beitrag schreiben kann, wenn einem nur noch 25 Merit fehlen, um den nächsten Forumsrang zu erreichen. Dies soll auch dazu dienen, das Merit-Quellen oder andere Benutzer des Forums dort reinschauen, sich die Beiträge der Forumsmitglieder anschauen und dann für gute Beiträge Merit verteilen.Link: [FUN][In Merit] Post Count Down To Your Next Rank Here.Danke für den Hinweis und ich habe deinen Vorschlag direkt in meinen Anfangsbeitrag aufgenommen.  Wahrscheinlich werde ich das noch etwas umstrukturieren, damit das alles etwas übersichlicher ist. Z.B. mit Unterteilung in Beiträge im internationalen Bereich und Beiträge im deutschsprachigen Bereich. Ich glaube nämlich, dass es noch einige weitere Beiträge gibt, die das einfache Verdienen von Merit anbieten, nur finde ich die alle nicht direkt. Quote from: CoinEraser on March 05, 2023, 07:52:01 PMSo oder so sollte man sich aber zuerst den ersten Beitrag des Fadens durchlesen und sich an alle Regeln halten. Dann wird die Chance größer, dort auch Merit zu erhalten.  +1Das ist ein sehr wichtiger Punkt, der sogar sehr leicht zu beachten ist, wenn man ihn kennt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 06, 2023, 10:13:44 AMLast edit: March 06, 2023, 01:40:32 PM by CoinEraser",
      "body": "Quote from: 1miau on March 05, 2023, 08:21:06 PMIch glaube nämlich, dass es noch einige weitere Beiträge gibt, die das einfache Verdienen von Merit anbieten, nur finde ich die alle nicht direkt. Ja, mir sind heute tatsächlich auch noch ein paar Eingefallen:Es gibt diesen Gesprächsfaden von fillippone, bei dem er seine Unterstützung anbietet. Dort kann jedes Forumsmitglied mitmachen, der bisher noch unter 1000 Merit liegt. Alle zwei Wochen kann man dort 5 gute Beiträge einreichen, die nicht älter als 120 Tage sind. Er akzeptiert auch Beiträge aus lokalen Boards, aber dafür sind einige bestimmte Boards ausgeschlossen.Link: [Merit] Share your best posts/threads with Fillippone to be merit assessedAuch von Ratimov gibt es zu dem Thema einen Gesprächsfaden, bei dem er seine Hilfe anbietet. Dieser richtet sich vor allem an Forumsmitglieder, die noch Newbies sind. Dort muss man nur den Rang, Anzahl an Merit und sein Profillink in einem Beitrag hierlassen. Er schaut dann bei Gelegenheit das Profil durch und verteilt gegebenenfalls Merit.  Link: [Merit] Help newbies and those who have a little left to the next rankIn dem Gesprächsfaden von BlackHatCoiner können sich Newbies und Jr. Members 1 Merit verdienen, wenn sie bei ihm Testbitcoins anfordern und diese dann im Bitcoin Testnetz versenden und im Lightning Netzwerk. Die tBTC sollten nach dem Test an ihm zurückgegeben werden. Der Faden soll dazu motivieren, das Lightning Netzwerk zu testen.Link: [Merit] Help newbies and those who have a little left to the next rankWie schon bei dem ersten Gesprächsfaden erwähnt, sollte man sich immer zuerst den ersten Beitrag durchlesen und verstehen, welche Regeln es gibt. Nur so erhält man die Möglichkeit, auch Merit zu erhalten.  edit: Den zweiten Beitrag von Ratimov entfernt sowie den von OgNasty, da diese nicht mehr aktuell sind. Außerdem \"Faden\" bereinigt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "March 06, 2023, 12:31:16 PM",
      "body": "Das überschneidet sich mit dem von aundroid erstellten Activity, Merit und Ranganforderungen im Forum.Da er nicht aktiv ist könnten wir seinen Beitrag aber auch gerne lösen und diesen hier anpinnen? Und da es hier (wieder) ganz besonders in Auge sticht... das Wort Faden steht nämlich schon 16 (edit: nun 18) Mal im Thread Vielleicht können wir uns auf Gesprächsfaden oder Diskussionsfaden einigen wenn Thread schon nicht von allen hier gewünscht wird.Aber nur Faden schmerzt mich einfach immer wieder wenn ich es lese",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 06, 2023, 01:29:45 PM",
      "body": "Quote from: mole0815 on March 06, 2023, 12:31:16 PM-snip- Vielleicht können wir uns auf Gesprächsfaden oder Diskussionsfaden einigen wenn Thread schon nicht von allen hier gewünscht wird.Aber nur Faden schmerzt mich einfach immer wieder wenn ich es lese Danke dir für deinen Hinweis. Mir war nicht klar, dass der Ausdruck \"Faden\" so nicht erwünscht ist. Werde da in Zukunft auf jeden Fall drauf achten und ihn so in dieser Form nicht mehr verwenden. Sollte es doch noch mal passieren, war es ein Versehen.  Quote from: Ratimov on March 06, 2023, 01:06:21 PMIch möchte klarstellen, dass, wenn jemand geholfen werden möchte, er nur dieses Thema verwenden sollte: [Merit] Help newbies and those who have a little left to the next rank -snip-Alles klar, danke für die Aufklärung! Werde meinen vorherigen Beitrag noch mal bearbeiten.  Quote from: Ratimov on March 06, 2023, 01:06:21 PMDas Konzept ist gut, aber schade, dass es nicht mehr aktiv ist und es dort keine neuen Anwendungen gibt, und OgNasty selbst hat seine Aktivität als Verdienstquelle stark reduziert.Ich dachte, da der Gesprächsfaden nicht geschlossen ist, dass die ganze Aktion noch laufen würde. Auch für diese Aufklärung danke ich dir!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mole0815",
      "created_time": "March 06, 2023, 01:54:01 PM",
      "body": "Quote from: CoinEraser on March 06, 2023, 01:29:45 PMDanke dir für deinen Hinweis. Mir war nicht klar, dass der Ausdruck \"Faden\" so nicht erwünscht ist. Werde da in Zukunft auf jeden Fall drauf achten und ihn so in dieser Form nicht mehr verwenden. Sollte es doch noch mal passieren, war es ein Versehen. Ich möchte hier niemandem die Worte und Sprache vorgeben CoinEraser!Das Thema gab es zur Genüge bereits z.B. hier: Zu viel Denglisch im deutschsprachigen Forumsbereich und wenn dann gehört das Thema Thread, Faden, Gesprächsfaden oder Diskussionsfaden auch dort hin Ist mir nur (mal wieder) aufgefallen und daher der vorsichtige Hinweis auf dieses emotionale Thema Wie gesagt es gehört hier nicht zwingend hin und dieser neue Merit-Thread/Gesprächsfaden kann gerne angepinnt werden und die Position vom veralteten Thema übernehmen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "March 06, 2023, 03:32:54 PM",
      "body": "Quote from: CoinEraser on March 06, 2023, 10:13:44 AMQuote from: 1miau on March 05, 2023, 08:21:06 PMIch glaube nämlich, dass es noch einige weitere Beiträge gibt, die das einfache Verdienen von Merit anbieten, nur finde ich die alle nicht direkt. Ja, mir sind heute tatsächlich auch noch ein paar Eingefallen:Super, danke dafür! Werde ich heute Abend mit aufnehmen.  Quote from: CoinEraser on March 06, 2023, 01:29:45 PMQuote from: mole0815 on March 06, 2023, 12:31:16 PM-snip- Vielleicht können wir uns auf Gesprächsfaden oder Diskussionsfaden einigen wenn Thread schon nicht von allen hier gewünscht wird.Aber nur Faden schmerzt mich einfach immer wieder wenn ich es lese Danke dir für deinen Hinweis. Mir war nicht klar, dass der Ausdruck \"Faden\" so nicht erwünscht ist. Werde da in Zukunft auf jeden Fall drauf achten und ihn so in dieser Form nicht mehr verwenden. Sollte es doch noch mal passieren, war es ein Versehen.  Also ich habe gegen \"Faden\" nichts einzuwenden, da der Begriff nicht gegen die lokalen Regeln verstößt und das  bisher ja auch so gehandhabt wurde. Wenn sich das Denglisch im Forum allerdings verringert und mole0815 glücklicher ist, Diskussionsfaden oder Gesprächsfaden zu verwenden, ist das in Ordnung für mich.  Ansonsten gibt es wieder \"Faden\", wenn an anderer Stelle absichtlich Denglisch verwendet wird. Quote from: mole0815 on March 06, 2023, 12:31:16 PMDas überschneidet sich mit dem von aundroid erstellten Activity, Merit und Ranganforderungen im Forum.Da er nicht aktiv ist könnten wir seinen Beitrag aber auch gerne lösen und diesen hier anpinnen? Das überschneidet sich nicht wirklich, einzige Überschneidung ist das übergeordnete Thema, nämlich  \"Merit\". Mein Beitrag stellt nämlich nicht das Merit-System im Allgemeinen vor, wie das beim Diskussionsfaden von aundroid der Fall ist. Mir ging es hauptsächlich darum, neue Forumsmitglieder zu ermutigen, dass es gar nicht so schwer ist Merit zu verdienen und ihnen daher gleich ein paar Tipps an die Hand geben. Daher auch unsere Liste mit Möglichkeiten, durch etwas Engagement ein bisschen Merit zu verdienen, was vielen neuen Forumsmitglieder bestimmt sehr hilft. Quote from: mole0815 on March 06, 2023, 12:31:16 PMUnd da es hier (wieder) ganz besonders in Auge sticht... das Wort Faden steht nämlich schon 16 (edit: nun 18) Mal im Thread Vielleicht können wir uns auf Gesprächsfaden oder Diskussionsfaden einigen wenn Thread schon nicht von allen hier gewünscht wird.Aber nur Faden schmerzt mich einfach immer wieder wenn ich es lese Gegen \"Faden\" habe ich zwar nichts einzuwenden (ist gemäß der Regeln im Anfangsbeitrag korrekt), da die Übersetzung ja ziemlich eindeutig ist aber Gesprächsfaden / Diskussionsfaden geht auch. Wenn dir Gesprächsfaden / Diskussionsfaden lieber ist, können wir das gerne so handhaben, sofern es insgesamt im Forum zu weniger unnötigem Denglisch führt.  Gibt es an anderer Stelle jedoch wieder unnötiges Denglisch, verwende ich auch wieder \"Faden\". @alleAußerdem geht es hier um Merit und nicht um die lokalen Regeln dieses selbstmoderierten Diskussionsfadens.  Beiträge, die nicht das Thema \"Merit\" diskutieren, sind zu unterlassen. So steht es in den selbstmoderierten Regeln. Quote from: mole0815 on March 06, 2023, 01:54:01 PMWie gesagt es gehört hier nicht zwingend hin und dieser neue Merit-Thread/Gesprächsfaden kann gerne angepinnt werden und die Position vom veralteten Thema übernehmen.Also meinetwegen kann der Beitrag von aundroid ruhig angepinnt bleiben, da es mir lediglich darum geht, neuen Forumsmitgliedern ein bisschen zu helfen, zu Beginn einfacher Merit zu verdienen. Das hier sehe ich also als normalen Diskussionsbeitrag, der nicht angepinnt werden braucht.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nathan_tek",
      "created_time": "March 06, 2023, 07:14:18 PM",
      "body": "Bis zum Full Member ists noch weit. Also dann, avanti, eines her, ein Merit, ein Merit mehr.Wem der kurze Reim gefiel der gebe mir ein Merit  und gebe es mir mit Stil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "5tift",
      "created_time": "March 06, 2023, 07:22:16 PM",
      "body": "Ich hab auch noch einen weiten Weg bis 970, wo Ratimov helfen würde  Am Ende wird es bestimmt ein 100 Slot FreeRaffle im Collectibles Bereich",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nathan_tek",
      "created_time": "March 06, 2023, 09:17:31 PM",
      "body": "Quote from: 5tift on March 06, 2023, 07:22:16 PMIch hab auch noch einen weiten Weg bis 970, wo Ratimov helfen würde  Am Ende wird es bestimmt ein 100 Slot FreeRaffle im Collectibles Bereich  Jetzt brauchst du einen merit weniger😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "March 06, 2023, 09:42:28 PM",
      "body": "Quote from: nathan_tek on March 06, 2023, 07:14:18 PMBis zum Full Member ists noch weit. Also dann, avanti, eines her, ein Merit, ein Merit mehr.Wem der kurze Reim gefiel der gebe mir ein Merit  und gebe es mir mit Stil.Zuerst einmal würde es mich sehr freuen, wenn man sich die Regeln im Anfangsbeitrag durchliest, denn dann merkt man, dass Pyramidenzitate weder in diesem Diskussionsfaden erlaubt noch im Forum gern gesehen werden, abgesehen davon, dass sie auch nach den Forenregeln nicht erlaubt sind...Quote from: 1miau on March 05, 2023, 05:50:48 PMIn diesem selbst-moderierten Faden gelten die allgemein anerkannten Regeln:- Kein Off-Topic- Keine Pyramidenzitate- Kein unnötiges Denglisch- Keine Beiträge oberflächlicher Qualität (Shitposts)- Keine Diffamierungen- Keine unnötigen Memes / GIFs- Kein GetrolleQuote from: mprep on July 21, 2014, 05:27:51 PM1. Such posts as \"SELL SELL SELL\", \"I agree\", \"+1\", \"Support\", \"Watching\", \"Interesting\", \"LOL\", \"SCAM\", \"LEGIT\", \"FAKE\", other one word posts, posts consisting mostly of swearing, quote pyramids, ....Außerdem gibt es hier einen guten Beitrag zu, Pyramidenzitate zu vermeiden: https://bitcointalk.org/index.php?topic=3749076.0Sowas (https://loyce.club/archive/posts/6186/61867725.html) wird daher direkt gelöscht. Und nein, 100 Merit für Full Member sind ziemlich wenig, wenn man konstruktive Beiträge liefert. Quote from: nathan_tek on March 06, 2023, 09:17:31 PMQuote from: 5tift on March 06, 2023, 07:22:16 PM...Jetzt brauchst du einen merit weniger😉Dann wäre es hilfreich, das Merit für Beiträge zu vergeben, für die das Merit-System eingeführt wurde: Quote from: 1miau on March 05, 2023, 05:50:48 PMFür neue Nutzer im Forum scheint es immer wieder schwierig zu sein, die ersten Merits zu sammeln. An dieser Stelle soll daher eine kleine Sammlung entstehen, auf die als Ressourcen zurückgegriffen werden kann. Merit wurde im Februar 2018 eingeführt, um die folgenden Punkte zu fördern: - Es sollen qualitativ gute Beiträge hervorgehoben werden. - Die Beitragsqualität im Forum soll insgesamt verbessert werden. - Der Spam und Missbrauch durch Signaturkampagnen soll verringert werden. Hier der originale Beitrag mit Begründung der Forumsleitung. ....Um der Intention des Merits gerecht zu werden, ist es daher wichtig, zu wissen, dass nicht jeder Beitrag Merit bekommen soll, denn wenn Merit systematisch für Beiträge verteilt wird, die dem ursprünglichen Gedanken der Einführung des Merits entgegen stehen, dann könnte das als Merit-Missbrauch gewertet werden. In schlimmen Fällen hat das in der Vergangenheit sogar zu negativem Trust geführt, heute kann es zu neutralem Trust führen oder Ausschluss in Signaturkampagnen. Auch das Betteln um Merit ist nicht gerne gesehen und kann mit Trust geahndet werden. Ansonsten sehe ich keinen Grund, Merit zu verteilen...  Zumindest das Lesen und Anwenden einfacher Regeln und Sachverhalte sollte schon drin sein...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "March 07, 2023, 01:00:11 AM",
      "body": "Quote from: 1miau on March 06, 2023, 09:42:28 PMAnsonsten sehe ich keinen Grund, Merit zu verteilen...  Zumindest das Lesen und Anwenden einfacher Regeln und Sachverhalte sollte schon drin sein...Das sehe ich genau so und es ist auch sehr schwer anhand seiner Beiträge da irgendwas brauchbares zu finden das Merit würdig wäre.Ich denke auch wie du schon geschrieben hast das man einfach versuchen sollte angemessen und ohne druck zu schreiben .Irgendwann wenn man sich gut eingefügt hat gibt es hier und da dann Merits.Ich bin auch bereit bei einer hilfe zur Aufdeckung von Fake Anns mit Malware Links oder jeder anderen runterladbaren Schadsoftware im Forum hier in meinem Topic : Report Malware and Suspicious Links here so Mods can take Action ! Merits zu spenden bei erfolgreicher Aufdeckung , wenn du willst kannst du das in deine Liste mit einfügen 1miau.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "March 08, 2023, 12:43:58 AM",
      "body": "Quote from: Lafu on March 07, 2023, 01:00:11 AMIch bin auch bereit bei einer hilfe zur Aufdeckung von Fake Anns mit Malware Links oder jeder anderen runterladbaren Schadsoftware im Forum hier in meinem Topic : Report Malware and Suspicious Links here so Mods can take Action ! Merits zu spenden bei erfolgreicher Aufdeckung , wenn du willst kannst du das in deine Liste mit einfügen 1miau.Klar, nehme ich ebenfalls gerne mit in die obige Liste auf. Danke für den guten Tipp!   Gegen die Verbreitung von Malware im Forum vorzugehen, ist eine wichtige Sache, wie bisherige Erfahrungen gezeigt haben, als auch Forumsmitglieder (wie Real-Duke hier) von solcher fiesen Malware betroffen waren und dadurch wertvolle Bitcoins verloren haben.  Merit dafür ist also definitiv einge gute Idee und sollte gefördert werden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 09, 2023, 10:26:11 AM",
      "body": "Es gibt noch zwei weitere Möglichkeiten, wie man sich Merit verdienen kann. In den beiden Diskussionsfäden von fillippone und GazetaBitcoin steht zwar nichts, das man auch wirklich Merit bekommt, aber in den meisten Fällen war dies der Fall und die Chance darauf ist sehr groß, daher passen diese Möglichkeiten hoffentlich auch gut hier rein.Beide fordern dazu auf, ihre besten Beiträge für die lokalen Boards zu übersetzen. Dabei muss man sich aber auch an die Regeln halten und z.B. kein Googleübersetzer oder Ähnliches nutzen. Außerdem muss der Hinweis dabei sein, dass es sich um eine Übersetzung von einem anderen Beitrag handelt. Auch sollte man vorher ankündigen, dass man einen Beitrag übersetzen will.Selbst wenn es von den beiden kein Merit gibt, was selten vorkommt, so hat man trotzdem die Chance, im lokalem Board dafür Merit zu erhalten, da es sich um einen guten Beitrag handelt. Wer also gut im Übersetzen ist, hat so die Möglichkeit, sich damit Merit zu verdienen.  Link: Help me translate my best posts in your Local Board (von fillippone)Link: Help me translate my best posts in your Local Board (von GazetaBitcoin)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "March 09, 2023, 11:37:41 AM",
      "body": "Quote from: 1miau on March 08, 2023, 12:43:58 AMKlar, nehme ich ebenfalls gerne mit in die obige Liste auf. Danke für den guten Tipp!   Gegen die Verbreitung von Malware im Forum vorzugehen, ist eine wichtige Sache, wie bisherige Erfahrungen gezeigt haben, als auch Forumsmitglieder (wie Real-Duke hier) von solcher fiesen Malware betroffen waren und dadurch wertvolle Bitcoins verloren haben.  Merit dafür ist also definitiv einge gute Idee und sollte gefördert werden.  Super dankeschön , eventuell liest es ja der eine oder andere neue Benutzer oder auch alte Benutzer hier im deutschen bereich und kann dafür begeistert werden die Augen mehr offen zu halten.Und hin und wieder daran zu erinnern , das es ganz schnell gehen kann wenn man nicht bedacht handelt so wie es leider auch Real-Duke erwischt hatte.War schon ein bisschen mit mir selbst am kämpfen da ich ja nicht wirklich hier im deutschen bereich nicht bei jeden Schadensprogram Link etwas schreibe.Also ich fördere aufjeden fall jede Hilfe mit Merit in dieser hinsicht wenn etwas aufgedeckt wird zu 100 prozent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "March 10, 2023, 01:21:18 AM",
      "body": "Quote from: CoinEraser on March 09, 2023, 10:26:11 AMEs gibt noch zwei weitere Möglichkeiten, wie man sich Merit verdienen kann. In den beiden Diskussionsfäden von fillippone und GazetaBitcoin steht zwar nichts, das man auch wirklich Merit bekommt, aber in den meisten Fällen war dies der Fall und die Chance darauf ist sehr groß, daher passen diese Möglichkeiten hoffentlich auch gut hier rein.Ja genau. Die Wahrscheinlichkeit, dass es da für Übersetzungen bestehender Themen in die lokalen Bereiche zumindest ein bisschen Merit von fillippone oder GazetaBitcoin gibt, ist überaus wahrscheinlich.  Das wäre auf jeden Fall eine leichte Möglichkeit, ohne viel Vorwissen über Kryptowährungen etwas Merit zu erhalten. Man müsste nur gut übersezten können, was allerdings auch nicht soo schwer ist, wenn man sich anstrengt. Nehme ich gerne mit auf.  Quote from: Lafu on March 09, 2023, 11:37:41 AMAlso ich fördere aufjeden fall jede Hilfe mit Merit in dieser hinsicht wenn etwas aufgedeckt wird zu 100 prozent.Das ist sehr nett und ich denke auch, dass praktisch alle Forumsmitglieder es sehr schätzen, dass im Forum so vehement gegen kriminelle Hacker vorgegangen wird. Die einzigen, die etwas dagegen haben, sind die Hacker selbst natürlich aber die sind ja auch böse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "March 10, 2023, 11:19:46 AM",
      "body": "Quote from: 1miau on March 10, 2023, 01:21:18 AMDas ist sehr nett und ich denke auch, dass praktisch alle Forumsmitglieder es sehr schätzen, dass im Forum so vehement gegen kriminelle Hacker vorgegangen wird. Die einzigen, die etwas dagegen haben, sind die Hacker selbst natürlich aber die sind ja auch böse.  Ich hoffe doch das es die Hacker nerft und das sie angepisst sind das eigentlich schon fast immer sobald sie was schreiben diese Beiträge reportet und gelöscht werden.Leider schreiben nicht sehr viele in den von mir eröffneten Faden und ich kann auch nicht wirklich sagen ob viele die sachen reporten.Fakt ist das ich aufjedenfall Merits vergebe wenn Forumsmitglieder dort hinweise oder sachen schreiben die dazu füren das sachen gelöscht werden.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CoinEraser",
      "created_time": "March 10, 2023, 12:36:33 PM",
      "body": "Quote from: 1miau on March 10, 2023, 01:21:18 AM-snip- Nehme ich gerne mit auf.  Sehr schön! Dann wird die Liste ja auch immer länger. Wenn mir noch mehr einfällt oder ich entdecke, gebe ich hier Bescheid.  Quote from: Lafu on March 10, 2023, 11:19:46 AMIch hoffe doch das es die Hacker nerft und das sie angepisst sind das eigentlich schon fast immer sobald sie was schreiben diese Beiträge reportet und gelöscht werden.Leider schreiben nicht sehr viele in den von mir eröffneten Faden und ich kann auch nicht wirklich sagen ob viele die sachen reporten.Fakt ist das ich aufjedenfall Merits vergebe wenn Forumsmitglieder dort hinweise oder sachen schreiben die dazu füren das sachen gelöscht werden.Das nervt die Hacker sicherlich! Ich schreibe zwar auch nicht viel in deinem Gesprächsfaden, aber sofern ich so was sehe, melde ich es schon gleich, damit es gelöscht wird. Gerade in den letzten Wochen ist so was ja sehr häufig vorgekommen und ich habe viele Meldungen gemacht. Denke jeder von hier, der so was sieht, würde es auch gleich melden. So oder so schön zu lesen, dass Beiträge in deinem Gesprächsfaden mit Merit belohnt werden. Dadurch werden sicherlich Leute motiviert, noch mehr darauf zu achten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "March 10, 2023, 01:00:35 PM",
      "body": "Quote from: CoinEraser on March 10, 2023, 12:36:33 PMDas nervt die Hacker sicherlich! Ich schreibe zwar auch nicht viel in deinem Gesprächsfaden, aber sofern ich so was sehe, melde ich es schon gleich, damit es gelöscht wird. Gerade in den letzten Wochen ist so was ja sehr häufig vorgekommen und ich habe viele Meldungen gemacht. Denke jeder von hier, der so was sieht, würde es auch gleich melden. So oder so schön zu lesen, dass Beiträge in deinem Gesprächsfaden mit Merit belohnt werden. Dadurch werden sicherlich Leute motiviert, noch mehr darauf zu achten.  Ich hoffe doch sehr das es die nervt und eventuell sind sie es irgendwann mal satt und haben genug ihre sachen zu schreiben.Wenn sich jemand die mühe macht gegen diese Bande von Hackern in form von Meldungen an die Moderatoren ist das sehr gut.Und wenn die benutzer es in meinen Faden schreiben dient dies erstens dafür das wenn jemand sucht wird es angezeigt.Daher wenn jemand dort schreibt und mich mit unterstützt gibt es Merits , und ja ich hoffe eventuell motiviert dies einige.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}