{
  "id": "topic_5429063",
  "title": "TryNinja",
  "author": "TryNinja",
  "created_time": "December 15, 2022, 08:52:31 PM",
  "content": "O Donald Trump lançou a sua coleção de NFTs, em formato de cartões colecionáveis: https://www.collecttrumpcards.comO que eu achei mais interessante foram os perks que esses NFTs dão para os seus hodlers. Alguns deles, mais raros e exclusivos, dão:- Uma tarde em Miami para um jantar exclusivo com o Trump.- Participar de um meet & greet com o Trump em um resort luxuoso em Palm Beach.- Um encontro privado com Trump no mesmo resort luxuoso em Palm Beach.- Jogar 1 hora de golf com Trump, podendo levar 2 amigos.- Conversar com Trump em uma chamava privativa via Zoom para perguntar o que quiser.Cada NFT custa $99. Comprando 45 NFTs (45 * 99 = $4455), você garante um ingresso para jantar com ele.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429063",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "December 16, 2022, 12:52:20 AM",
      "body": "Quote from: TryNinja on December 15, 2022, 08:52:31 PMCada NFT custa $99. Comprando 45 NFTs (45 * 99 = $4455), você garante um ingresso para jantar com ele. Isso a primeira vista, pode ser descabido, até porque estamos a falar do Trump.Agora, talvez esses $4500 podem valer a pena. Por mais doideiras que o homem tenha, ele não é parvo. Conhece muita gente, tem certo nível de influencia, e pode direcionar alguém para as pessoas certas, de modo a que essa pessoa consiga alcançar alguns objetivos.Imaginem se um Musk faz algo parecido, acredito que haveria muitas pessoas capazes de pagar 3 ou 4 vezes mais para conseguir 10 minutos com ele.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "non fungible anxiety",
      "created_time": "December 16, 2022, 01:57:28 AM",
      "body": "Eu imagino como o Trump escolheu o time de desenvolvedores e o porquê de ter demorado tanto pra fazer os seus NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 16, 2022, 06:04:12 AM",
      "body": "Quote from: TryNinja on December 15, 2022, 08:52:31 PMCada NFT custa $99. Comprando 45 NFTs (45 * 99 = $4455), você garante um ingresso para jantar com ele. Justin Sun já pagou milhões para jantar com Warren Buffett.. então esse jantar com Trump está bem barato  logo alguém aproveita isso para pumpar alguma shitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 17, 2022, 11:22:42 PM",
      "body": "Quote from: joker_josue on December 16, 2022, 12:52:20 AMAgora, talvez esses $4500 podem valer a pena. Por mais doideiras que o homem tenha, ele não é parvo. Conhece muita gente, tem certo nível de influencia, e pode direcionar alguém para as pessoas certas, de modo a que essa pessoa consiga alcançar alguns objetivos.A coleção dele já deu sold out e o preço já subiu mais de 7x. https://opensea.io/collection/trump-digital-trading-cardsUma das cartas foi revendida por 20 ETH ($23k): https://opensea.io/assets/matic/0x24a11e702cd90f034ea44faf1e180c0c654ac5d9/3752",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "December 17, 2022, 11:51:31 PM",
      "body": "Quote from: TryNinja on December 15, 2022, 08:52:31 PMO Donald Trump lançou a sua coleção de NFTs, em formato de cartões colecionáveis: https://www.collecttrumpcards.comO que eu achei mais interessante foram os perks que esses NFTs dão para os seus hodlers. Alguns deles, mais raros e exclusivos, dão:- Uma tarde em Miami para um jantar exclusivo com o Trump.- Participar de um meet & greet com o Trump em um resort luxuoso em Palm Beach.- Um encontro privado com Trump no mesmo resort luxuoso em Palm Beach.- Jogar 1 hora de golf com Trump, podendo levar 2 amigos.- Conversar com Trump em uma chamava privativa via Zoom para perguntar o que quiser.Cada NFT custa $99. Comprando 45 NFTs (45 * 99 = $4455), você garante um ingresso para jantar com ele. Mais um engravatado que estufava o peito para falar mal das criptos agora se rende à elas para conseguir aumentar sua fama e fortuna.Em todo caso, por mais irônico que seja situações assim, é interessante e muito bem vinda porque mostra a todos como gente \"poderosa\" estão acreditando nesse meio até em momentos em que tudo parece estar tomado de acontecimentos negativos.Aliás, jogada de marketing muito interessante esses \"benefícios\", mas eu sinceramente preferiria uma wallet recheada de Bitcoins do que jantar ou jogar golf com \"o cara\"Acho que o @Paredao é o tipo de cara que adoraria um momento descontraído com um político como Trump Enfim, além das regalias, vamos ver quanto esses tokens valerão daqui alguns anos... Ainda não será dessa vez que me farão perder a virgindade com os NFT~.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 18, 2022, 08:18:25 AM",
      "body": "Quote from: alegotardo on December 17, 2022, 11:51:31 PMEm todo caso, por mais irônico que seja situações assim, é interessante e muito bem vinda porque mostra a todos como gente \"poderosa\" estão acreditando nesse meio até em momentos em que tudo parece estar tomado de acontecimentos negativos.A questão é que a maioria desse pessoal que fala mal das criptos, é por questões de agenda politica ou interesses em agradar determinadas pessoas. Quando deixam de ter isso, acabam por até gostar da ideia.Existe muita gente que é super fã do modelo económico vivido no mundo, então tudo o que possa colocar em perigo esse modelo deve ser rejeitado. É tipo adeptos de clube de futebol, em que tem clubes que não deviam existir, esquecendo-se de que para o seu clube ser grande tem de existir um rival altura.Eu sou sempre contra a ideia de que para valorizar algo, tenho de rebaixar a concorrência. Se queres valorizar alguma coisa, mostra as qualidades daquilo que queres defender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 18, 2022, 01:56:21 PM",
      "body": "Eu achei particularmente bem barato para as recompensas em questão. A discussão do preço inicial das coleções é sempre algo polemico para desenvolvedores de projeto e sempre acho que a melhor opção é fazer o que o Trump fez, iniciar abaixo e deixar que o preço regule pra cima. Mas uma dúvida operacional, a pessoa que tem o NFT tem direito, mas ai quando ela transfere a outra ja tem o direito novamente? Imagina se rolar transferencias sempre, Trump não vai poder fazer mais nada da vida. Realmente o timing é algo curioso né. E sobre isso de ''querer ou não o encontro''. Pessoalmente eu não gosto nada dele, mas isso não significa que eu não achei que seria interessante o jantar. Eu acharia válido.e",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "December 18, 2022, 04:27:05 PM",
      "body": "Também achei barato para as recompensarImagino que tenha uma forma específica de claim. Ou um tempo limite. Nao?Curioso que acabei de ler a newsletter da dune que fala sobre o volume primário e secundário da coleção Caso alguém se interessehttps://dunedigest.substack.com/p/dune-digest-60?publication_id=525943",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 19, 2022, 08:32:48 PM",
      "body": "Quote from: Disruptivas on December 18, 2022, 01:56:21 PMMas uma dúvida operacional, a pessoa que tem o NFT tem direito, mas ai quando ela transfere a outra ja tem o direito novamente? Só deve ser possível usar o NFT uma vez. Depois fica a questão, se fica alguma informação registada ou não, para o caso de ser revendido o comprador não ser enganado.Mas sendo do Trump, também não estou a ver muita preocupação dele nesse respeito, é usado uma vez, os futuros compradores que falem com o vendedor anterior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 19, 2022, 08:47:28 PM",
      "body": "Quote from: Disruptivas on December 18, 2022, 01:56:21 PMMas uma dúvida operacional, a pessoa que tem o NFT tem direito, mas ai quando ela transfere a outra ja tem o direito novamente? Imagina se rolar transferencias sempre, Trump não vai poder fazer mais nada da vida. Com certeza não. Cada NFT tem um id único, então é algo trivial mudar o estado dele para \"claimed\", seja no on-chain ou off-chain. Mas isso me lembra o pessoal profissional da arbitragem pegando alguns BYACs emprestados via flashloan, recebendo os apecoins referentes a ele, e depois devolvendo para o dono.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "December 30, 2022, 11:05:39 PM",
      "body": "Achei essa notícia que me lembrou esse tópico:Quotehttps://livecoins.com.br/achei-eles-fofos-diz-donald-trump-enquanto-seus-nfts-despencam-80/\"Achei eles fofos\", diz Donald Trump enquanto seus NFTs despencam 80%Sem dúvidas a coleção de Donald Trump foi uma surpresa. Primeiro pelo fato do ex-presidente americano não gostar de criptomoedas, segundo pela facilidade em vender toda sua coleção em meio a um grande bear market....\"Olhei para eles e disse: \"Uau, isso é meio fofo, pode vender\". Eles pensaram que venderia em seis meses, vendeu em seis horas.\"Kkk Acho que o Trump está mais é zuando esse negócio de NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 30, 2022, 11:24:28 PM",
      "body": "Quote from: bitmover on December 30, 2022, 11:05:39 PMKkk Acho que o Trump está mais é zuando esse negócio de NFTs.Ele recebeu $$$ para dar permissão para que alguém utilizasse a sua imagem nos NFTs. O importante são os dólares entrando na conta bancária (nem crypto ele deve ter recebido) e não a tecnologia ou o que mais tiver por trás do projeto. \"A gente usa a sua imagem, você janta e joga golf com os caras, e te damos uma parte dos lucros\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 31, 2022, 12:59:41 PM",
      "body": "Quote from: TryNinja on December 30, 2022, 11:24:28 PMEle recebeu $$$ para dar permissão para que alguém utilizasse a sua imagem nos NFTs. O importante são os dólares entrando na conta bancária (nem crypto ele deve ter recebido) e não a tecnologia ou o que mais tiver por trás do projeto. \"A gente usa a sua imagem, você janta e joga golf com os caras, e te damos uma parte dos lucros\"No final, infelizmente eu ando percebendo que é das melhores formas de fazer as coisas em cripto. Querer que não nativos web3 façam parte da construção desses projetos é muitas vezes um super tiro no pé. Tem vários pequenos detalhes que demoramos anos pra entender os fundamentos e é difícil e até contra-intuitivo quando queremos explicar. Quando você pega um ''direito'' offline de renome e tem o conhecimento e a liberdade de um nativo da web3, acho que tende a funcionar melhor. E o 'detentor' do direito offline fica com os beneficios em dinheiro, mas sem se intrometer muito mais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "December 12, 2023, 08:51:38 PM",
      "body": "O caba voltou pra mais...Donald Trump Unveils New 'Mugshot' NFTs, Stirring Up Prices for His Previous NFTsIncluindo aquela famosa mugshot que foi tirada quando ele foi preso.https://twitter.com/CollectTrump/status/1734613275613057222Quote from: https://twitter.com/CollectTrump/status/1734637077763960971Trump Digital Trading Cards (NFTs) are intended as collectible items for individual enjoyment only, not for investment purposes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "December 12, 2023, 10:39:26 PM",
      "body": "Quote from: TryNinja on December 15, 2022, 08:52:31 PMO Donald Trump lançou a sua coleção de NFTs, em formato de cartões colecionáveis: https://www.collecttrumpcards.comO que eu achei mais interessante foram os perks que esses NFTs dão para os seus hodlers. Alguns deles, mais raros e exclusivos, dão:- Uma tarde em Miami para um jantar exclusivo com o Trump.- Participar de um meet & greet com o Trump em um resort luxuoso em Palm Beach.- Um encontro privado com Trump no mesmo resort luxuoso em Palm Beach.- Jogar 1 hora de golf com Trump, podendo levar 2 amigos.- Conversar com Trump em uma chamava privativa via Zoom para perguntar o que quiser.Cada NFT custa $99. Comprando 45 NFTs (45 * 99 = $4455), você garante um ingresso para jantar com ele. Mas esse gajo não é suposto estar preso? lol... Nem prisão domiciliária?Ao ler esses perks, só me faz lembrar uma coisa: portanto, mais um ponzi scheme!$4455 para jantar com ele... Só podem estar a gozar. Ainda ao menos se fosse com a mulher e filha, talvez pudesse pensar no assunto e mesmo assim, com 4500€ comprava uma boa quantia de Bitcoin para hodlar!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 13, 2023, 07:14:11 PM",
      "body": "O que é mais triste de toda essa situação é que o Donald Trump está elegível e pode voltara a governar os Estados Unidos em 2025. Depois de tudo que o sujeito aprontou e apronta naquele País. Uma pena que o Biden está muito velho. Não será páreo para o Donald Trump na próxima eleição.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "December 13, 2023, 09:48:53 PM",
      "body": "Quote from: Paredao on December 13, 2023, 07:14:11 PMO que é mais triste de toda essa situação é que o Donald Trump está elegível e pode voltara a governar os Estados Unidos em 2025. Depois de tudo que o sujeito aprontou e apronta naquele País. Uma pena que o Biden está muito velho. Não será páreo para o Donald Trump na próxima eleição.  E não só. Este tipo transpira corrupção, é mal educado, rancoroso, nada elegante (intelectualmente falando) e desrespeitador. Já o foi contra mulheres, nem quero saber como é, ou como pode ser contra homens! Este indivíduo tem tudo para ser um ditador de merda com ideias de merda!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 13, 2023, 11:06:34 PM",
      "body": "Hoje li umas projeções de que o Trump provavelmente vai ganhar as eleições. E que isso provavelmente vai marcar o fim da perseguição da SEC ao Bitcoin. Que ele vai vir mais BRABO com os temas polemicos e talvez com uma posição mais liberal. Eu particularmente não tenho ideia kkk mas não duvido. O que voces acham?Eu era bem contra o Trump no passado, mas hoje já acho até melhorzinho que o Biden, mas eu não consigo nunca gostar de políticos. Mas se ele for MENOR PIOR em termos de aumento do estado, pra mim já é um ponto. E considerando o envolvendo dele com NFTs, nao duvidaria de uns Ordinals de Trump",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "December 13, 2023, 11:11:31 PM",
      "body": "Quote from: Disruptivas on December 13, 2023, 11:06:34 PMHoje li umas projeções de que o Trump provavelmente vai ganhar as eleições. E que isso provavelmente vai marcar o fim da perseguição da SEC ao Bitcoin. Que ele vai vir mais BRABO com os temas polemicos e talvez com uma posição mais liberal. Eu particularmente não tenho ideia kkk mas não duvido. O que voces acham?Eu era bem contra o Trump no passado, mas hoje já acho até melhorzinho que o Biden, mas eu não consigo nunca gostar de políticos. Mas se ele for MENOR PIOR em termos de aumento do estado, pra mim já é um ponto. E considerando o envolvendo dele com NFTs, nao duvidaria de uns Ordinals de Trump E o que tens a dizer sobre a política das armas nos EUA? Achas um tema pouco sensível? Achas que ele vai apertar o cerco? Acho que ele já provou o contrário e que o armamento da população é benvindo! O Bolsonaro acho que era bem parecido neste tipo de posições. Mas olha o que acontece, mesmo sem o Trump? Os anos mais intensos do Covid foram uma desgraça em termos de atentados nos EUA! As posições que ele tomou relativamente a algumas políticas do Covid também não sei se foram as mais acertadas! Nomeadamente o não ter querido apertar o cinto, senão me engano na altura da Páscoa onde se observou um aumento brutal daquele índice que media quantas pessoas eram infectadas por uma pessoa infectada!O Biden é um velho senil, não há dúvida, mas o Trump é outro senil e muito mais novo. Imagina quando chegar à idade do Biden como estará!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}