{
  "id": "topic_5477262",
  "title": "Julien_Olynpic",
  "author": "Julien_Olynpic",
  "created_time": "December 10, 2023, 06:06:47 AMLast edit: March 13, 2024, 02:11:30 AM by Julien_Olynpic",
  "content": "Пишут, что, якобы, сотрудники аналитического сервиса Arkham обнаружили мегатрейдера, который заработал 275 иксов за 3 недели торгов. Он превратил 1 эфир, с которого начал торговать в 550 тысяч долларов. Об этом в своём твиттере сообщила сама аналитическая компания.https://twitter.com/ArkhamIntel/status/1732456756276523245  Конечно, было бы интересно проследить за динамикой торговой активности чела. И интересно было бы узнать его торговую систему. Явно человек торговал за пределами одного дня. Не исключаю также, что он мог пользоваться какими-то инсайдами. Ну или просто удачно поторговал с плечом.***--------------------------------------------------------------------------------1    Анонимный трейдер (обнаружило Arkham), который заработал 275 иксов за 2 недели, стартовав с 1 эфира.2.  Мегатрейдер dogwifhat 3.  Мегатрейдер bull (8 000%  на бессрочных фьчах на Бинанс с 125 плечом) 4.  Мегатрейдер собачьим солано-токеном BALLZ и 17 000 иксов за 10 марта 2024 года.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477262",
  "comments": [
    {
      "author": "Cryptmuster",
      "created_time": "December 10, 2023, 06:51:27 AMLast edit: December 11, 2023, 05:59:08 PM by Xal0lex",
      "body": "Quote from: Julien_Olynpic on December 10, 2023, 06:06:47 AMПишут, что, якобы, сотрудники аналитического сервиса Arkham обнаружили мегатрейдера, который заработал 275 иксов за 3 недели торгов. Он превратил 1 эфир, с которого начал торговать в 550 тысяч долларов. Об этом в своём твиттере сообщила сама аналитическая компания.https://twitter.com/ArkhamIntel/status/1732456756276523245  Конечно, было бы интересно проследить за динамикой торговой активности чела. И интересно было бы узнать его торговую систему. Явно человек торговал за пределами одного дня. Не исключаю также, что он мог пользоваться какими-то инсайдами. Ну или просто удачно поторговал с плечом.***Тут уже явно видно, что не случайность какая то, три недели чистого везения не бывает, но время сейчас хорошее растет почти все, видимо этим человек и воспользовался. Мне бы тоже было интересно посмотреть на количество сделок и как это все осуществлялось, но что то мне подсказывает что мы этого не узнаем.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "welik",
      "created_time": "December 10, 2023, 01:01:03 PM",
      "body": "Написано, что все его сделки видны в блокчейне - именно благодаря этому, его и нашли эти аналитики. Просканировали блокчейн и составили статистику игроков. У токенов один общий адрес \"кошелька\" и обычно на нём и ведётся вся активность относительно их владельца.Смотреть его движения можно тут.https://coinstats.app/address/0x456CF3c2C0f666823740A1A9D0De542F7E7B830F/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "December 11, 2023, 02:39:52 AM",
      "body": "Quote from: welik on December 10, 2023, 01:01:03 PMНаписано, что все его сделки видны в блокчейне - именно благодаря этому, его и нашли эти аналитики. Просканировали блокчейн и составили статистику игроков. У токенов один общий адрес \"кошелька\" и обычно на нём и ведётся вся активность относительно их владельца.Смотреть его движения можно тут.https://coinstats.app/address/0x456CF3c2C0f666823740A1A9D0De542F7E7B830F/Да, там туева хуча активов. И среди этого всего добра много шитков вообще малоизвестных. Жаль, что статистика кошелька не даёт представление о стратегии трейдера. Ну или её можно очень приблизительно даже не определить, а предположить. Возможно, здесь есть отголоски той стратегии, которую применял один удачливый кит, торгуя мем-койнами. Он скупал все мемы на определённую сумму вглубь до какого-то уровня. По-видимому, ему приходилось покупать много всякого говна. В итоге, выстрелило небольшое количество койнов. И прибыль по ним перекрыла все убытки, плюс очень хорошо насыпало сверху. Щас уже не найдё ссылку на твит, об этом рассказавший, но такая история действительно была.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "December 16, 2023, 05:04:36 AMLast edit: December 16, 2023, 05:33:08 AM by Julien_Olynpic",
      "body": "Совсем недавно Койндеск опубликовал статью, посвящённую ещё одному мегатрейдеру - Dogwifhat (WIF). Правда, он не совсем трейдер, скорее, удачный влошенец. Он купил недавно вышедший собачий токен, символ которого собака в вязаной шапочке. Вложив в покупку токена 1000 долларов, на выходе  Dogwifhat зафиксировал 100 000 долларов. Таким образом, он получил прибыль в размере 100 иксов.    Вот что сама Койндеск пишет об этом трейдере:Криптотрейдер превращает $1 тыс. в $100 тыс. на Dogwifhat (WIF), новейшем мемкоине Solana (coindesk.com) QuoteГлупые деньги возвращаются на криптовалютные рынки, и один трейдер превратил 1 000 долларов в более чем 100 000 долларов, сделав ставку на токен, талисманом которого является собака в шапочке.Криптоэнтузиаст под псевдонимом Blockgraze рассказал CoinDesk, что купил мемкоин Dogwifhat (WIF) в конце ноября, вскоре после того, как он дебютировал на рынках DeFi блокчейна Solana.«Я подумал, что собака в шляпе была очень забавной, и поэтому я купил немного», — сказал он, отметив, что с тех пор он получил прибыль в размере 25 000 долларов, в то время как остальная часть его азартных игр осталась в его кошельке.И это действительно азартная игра. Любой желающий может раскрутить криптовалюту, создать для нее рынок и надеяться, что она поймает какие-то ставки. Но те, которые ассоциируются с мемами, и особенно с мемами породы собак сиба-ину, имеют тенденцию раздуваться в цене, а иногда даже сохраняться.То же самое можно сказать и о главном мемкоине Solana, BONK. Он был запущен на прошлое Рождество в аирдропе и быстро сплотился, прежде чем заглохнуть. Он снова начал расти в октябре и только на этой неделе был включен в листинг Coinbase, сигнализируя о том, как смешные деньги могут принести большой бизнес.Тем не менее, 100-кратные сделки с мемкоинами — это скорее удача, чем мастерство, сказал Blockgraze, криптотрейдер, работающий неполный рабочий день, который сказал, что работает с потребительскими стартапами. Он сравнивает это с азартными играми.«Я думаю, секрет в том, чтобы быть идиотом», — сказал он.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "February 18, 2024, 06:07:31 AM",
      "body": "Пользователь под ником bull опубликовал твит, на котором видно, что он, якобы додержал позицию на Бинанс на бессрочных фьючерсах на биткойн с 125 плечом. Причём, если верить его скрину, то цена его входа в позицию составляла 15653 доллара, а продажа произошла при цене 50023 доллара. Таким образом, общая прибыль составила 8588%. Для такого плеча, конечно, маловато, но там, возможно, часть позиции отъедало по фондированию.     А как вы считаете, реально ли это — получить прибыль в торговле на споте или в перпетуалках с плечом 125х?) Возможно ли это сделать на любых торговых площадках или такое возможно не везде? Как насчёт децентрализованного плеча?***",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "February 18, 2024, 07:40:26 AM",
      "body": "Мне приходилось играть в казино и я на своем опыте убеждался, что там можно выкидывать комбинации, которые имеют невероятно низкую вероятность с точки зрения математической теории вероятности. Я на пример, выигрывал 20 раз подряд на комбинации красное / чёрное. В трейдинге все ещё более возможно, так как там ещё и можно считать вероятности в свою пользу, если твои интеллектуальные и ментальные способности работают на всю катушку. Другое дело, что таким образом работать долго у тебя не получится и главный твой враг это твой собственный мозг и твоя психика. Психологически такое очень тяжело, энергозатраты колоссальные, а мозг подключаясь к подсчёту вероятностей начнет тебе вредить, так как мозг приматов для этого эволюционно не приспособлен.Поэтому правильно тут выше написали, чтобы такое проделывать нужно быть слабоумным и отважным дураком на большом энтузиазме и драйве. Тогда может и получится.А вот вовремя уйти с прибылью и больше не играть - это 100 процентно не получится. Опять таки из-за особенностей функционирования человеческого мозга, который стремится все рационализировать.Человек не может себе сказать - я отважный и слабоумный идиот, я с дуру провернул эту комбинацию, а теперь мне нужно забрать профит и больше никогда такими вещами не заниматься! Потому что второй раз мне такого не повторить!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "February 18, 2024, 02:41:07 PM",
      "body": "Quote from: Julien_Olynpic on February 18, 2024, 06:07:31 AMПользователь под ником bull опубликовал твит, на котором видно, что он, якобы додержал позицию на Бинанс на бессрочных фьючерсах на биткойн с 125 плечом. Причём, если верить его скрину, то цена его входа в позицию составляла 15653 доллара, а продажа произошла при цене 50023 доллара. Таким образом, общая прибыль составила 8588%. Для такого плеча, конечно, маловато, но там, возможно, часть позиции отъедало по фондированию.     А как вы считаете, реально ли это — получить прибыль в торговле на споте или в перпетуалках с плечом 125х?) Возможно ли это сделать на любых торговых площадках или такое возможно не везде? Как насчёт децентрализованного плеча?***^ Информация выше это ложь, он не мог вывезти 125х плечо купив по 15653.Вот мой график с цитатой (для трушности). Я покупал на споте без плеча, хранил на холоде. Биткоин сильно проседал, никакое плечо не выжило бы без многократной \"докапитализации\" залога.Quote from: The0ldl_lser on August 16, 2023, 07:10:35 PMQuote from: FS2018 on August 16, 2023, 10:31:17 AMQuote from: tw0.625 on August 16, 2023, 09:45:59 AMШорти доллар  Так уже \"шорчу\" за битки. У меня были покупки даже по 15600 на последнем падении..Вот как надо торговать среднесрок   :https://bitinfocharts.comИ это не 15к а 16 с лихуемТут обсуждалось https://bitcointalk.org/index.php?topic=2235093.msg63032154#msg63032154",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Unsoldier",
      "created_time": "February 19, 2024, 12:41:24 PM",
      "body": "Quote from: The0ldl_lser on February 18, 2024, 02:41:07 PMQuote from: Julien_Olynpic on February 18, 2024, 06:07:31 AMПользователь под ником bull опубликовал твит, на котором видно, что он, якобы додержал позицию на Бинанс на бессрочных фьючерсах на биткойн с 125 плечом. Причём, если верить его скрину, то цена его входа в позицию составляла 15653 доллара, а продажа произошла при цене 50023 доллара. Таким образом, общая прибыль составила 8588%. Для такого плеча, конечно, маловато, но там, возможно, часть позиции отъедало по фондированию.     А как вы считаете, реально ли это — получить прибыль в торговле на споте или в перпетуалках с плечом 125х?) Возможно ли это сделать на любых торговых площадках или такое возможно не везде? Как насчёт децентрализованного плеча?***^ Информация выше это ложь, он не мог вывезти 125х плечо купив по 15653.Вот мой график с цитатой (для трушности). Я покупал на споте без плеча, хранил на холоде. Биткоин сильно проседал, никакое плечо не выжило бы без многократной \"докапитализации\" залога.Quote from: The0ldl_lser on August 16, 2023, 07:10:35 PMQuote from: FS2018 on August 16, 2023, 10:31:17 AMQuote from: tw0.625 on August 16, 2023, 09:45:59 AMШорти доллар  Так уже \"шорчу\" за битки. У меня были покупки даже по 15600 на последнем падении..Вот как надо торговать среднесрок   :https://bitinfocharts.comИ это не 15к а 16 с лихуемТут обсуждалось https://bitcointalk.org/index.php?topic=2235093.msg63032154#msg63032154Собсна, а почему нет? Если зайти на сам Бинанс и посмотреть график битка, то вполне все могло осуществиться.Парень дату входа сделки не указал, поэтому если предположить, что он угадал начало насоса биткоина, то вполне все сходится. Один из 10 тыс. угадал и додержал. Такое бывает. Тем более не видно на сколько он там купил, мож на 10 баксов. На фьючах же, вроде, ограничение стоит.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "February 19, 2024, 02:08:58 PM",
      "body": "^Да я вот тоже весь день думаю что типа до 20к условно, не проседал же особо. И мы получается с этим челом угадали. Там знаешь как было - действительно ниже 16к спускалось, но тогда какой-то инфошум был, мешал. Первый раз задумался о дне дна. Потом вроде как нашлись смельчаки - я подумал что прав значит раз нашлись. Ну типа сейчас и мир отупел да и так замедленно все везде как на слоумо. Значит шанс должен быть. А потом на следующий день когда по делам поехал, так сказать от быта отвлекся - хуяк и пришло осознание что \"это оно\". Ну типа просело наверно  не помню, может и 17к было, но стало опять 16к. Вот прям с телефона и купил. Жаль что мало оставил, основная часть в лонге была по убыточной на тот момент позиции. И все это происходило не более чем дней 4...6Мог он успеть выходит. Только все равно 15653 это на пиздежь похоже. Ну типа когда на графике ищешь цену чтобы подогнать. Все равно не верю. Поверил бы если бы он указал цену 16053",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "summonerrk",
      "created_time": "February 26, 2024, 01:38:09 PM",
      "body": "Quote from: Julien_Olynpic on December 10, 2023, 06:06:47 AMsnipДаже по теории вероятности должен был быть подобный трейдер, да и не один. Как никак даже в лотереях люди выигрывают, а там шансы в разы меньше чем в трейдинге. Ведь тут мы перетягиваем вероятность на свою сторону.Ну или думаю налицо удачная торговля с наивысочайшими плечами. Ну или как пишется в новости - все гораздо проще и это инсайды.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "March 06, 2024, 02:44:53 PMLast edit: March 07, 2024, 01:51:45 PM by Julien_Olynpic",
      "body": "Quote from: summonerrk on February 26, 2024, 01:38:09 PMQuote from: Julien_Olynpic on December 10, 2023, 06:06:47 AMsnipДаже по теории вероятности должен был быть подобный трейдер, да и не один. Как никак даже в лотереях люди выигрывают, а там шансы в разы меньше чем в трейдинге. Ведь тут мы перетягиваем вероятность на свою сторону.Ну или думаю налицо удачная торговля с наивысочайшими плечами. Ну или как пишется в новости - все гораздо проще и это инсайды.Всё возможно, конечно, но я всё же думаю, что такие \"Чудесные\" трейдеры, которые делают космические проценты прибыли, покупая строго на дне с убийственным плечом, невероятным образом избегая ликвидации или покупают строго на дне на споте - это или родственники-знакомые-друзья членов команды или сотрудники биржи или лица, аффилированные с биржей. По сути, одна из разновидностей инсайдеров. Чисто теоретически и обычный чел может получить близкую доходность... но вряд ли с такими большими плечами. Например, при плече х100 достаточно движения меньше  1% после открытия позиции против  трейдера, чтобы его ликвидировать... А обычно цены бывают гораздо более волатильными...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "March 07, 2024, 07:05:35 AM",
      "body": "Quote from: Julien_Olynpic on March 06, 2024, 02:44:53 PMQuote from: summonerrk on February 26, 2024, 01:38:09 PMQuote from: Julien_Olynpic on December 10, 2023, 06:06:47 AMsnipДаже по теории вероятности должен был быть подобный трейдер, да и не один. Как никак даже в лотереях люди выигрывают, а там шансы в разы меньше чем в трейдинге. Ведь тут мы перетягиваем вероятность на свою сторону.Ну или думаю налицо удачная торговля с наивысочайшими плечами. Ну или как пишется в новости - все гораздо проще и это инсайды.Всё возможно, конечно, но я всё же думаю, что такие \"Чудесные\" трейдеры, которые делают космические проценты прибыли, покупая строго на дне с убийственным плечом, невероятным образом избегая ликвидации или покупают строго на дне на споте - это или родственники-знакомые-друзья членов команды или сотрудники биржи или лица, аффилированные с биржей. По сути, одна из разновидностей инсайдеров. Чисто теоретически и обычный чел может получить близкую доходность... но вряд ли с такими большими плечами. Например, при плече х100 достаточно движения в 15 после открытия позиции против  трейдера, чтобы его ликвидировать... А обычно цены бывают гораздо более волатильными...Даже с плечами 100 такое можно провернуть, если очень сильно повезет. Везение это такая штука, которая лучше всяких других благ ...А если тебе повезет, то ты попадешь в статистические данные и все будут изумляться, как все лихо удалось и подозревать в тебе инсайдера.Это так называемая ошибка выжившего, из теории игр, когда мы не видим многие тысячи трейдеров, которые торговали с 100 кратными плечами и их выносило, но нашелся скромный герой, которому повезло.И этот скромный герой будет изумлять всех, все будут удивляться его результатам и называть его супер трейдером.А те кому не повезло будут забыты и ментально оплеваны, и никому до них дела не будет. И даже топик на форуме Bitcointalk в их честь не создадут...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "summonerrk",
      "created_time": "March 07, 2024, 08:09:07 AM",
      "body": "Quote from: Julien_Olynpic on March 06, 2024, 02:44:53 PMQuote from: summonerrk on February 26, 2024, 01:38:09 PMQuote from: Julien_Olynpic on December 10, 2023, 06:06:47 AMsnipДаже по теории вероятности должен был быть подобный трейдер, да и не один. Как никак даже в лотереях люди выигрывают, а там шансы в разы меньше чем в трейдинге. Ведь тут мы перетягиваем вероятность на свою сторону.Ну или думаю налицо удачная торговля с наивысочайшими плечами. Ну или как пишется в новости - все гораздо проще и это инсайды.Всё возможно, конечно, но я всё же думаю, что такие \"Чудесные\" трейдеры, которые делают космические проценты прибыли, покупая строго на дне с убийственным плечом, невероятным образом избегая ликвидации или покупают строго на дне на споте - это или родственники-знакомые-друзья членов команды или сотрудники биржи или лица, аффилированные с биржей. По сути, одна из разновидностей инсайдеров. Чисто теоретически и обычный чел может получить близкую доходность... но вряд ли с такими большими плечами. Например, при плече х100 достаточно движения в 15 после открытия позиции против  трейдера, чтобы его ликвидировать... А обычно цены бывают гораздо более волатильными...Тем более сейчас, когда, ну по крайней мере у меня - ощущение, что волатильность прибавилась из-за ETF и прихода новых пользователей. Часто стали видны пустые свечи, знаменующее неуверенность рыка, пусть и в очень активной фазе.Наверное мы ещё не раз услышим подобные success story, и зачастую это будут ребята, поднявшиеся на meme коинах, сейчас эта тема активно продается в массы.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "March 13, 2024, 02:07:53 AM",
      "body": "lookonchain опубликовала забавный твит про очередного мегатрейдера мем-токенами (мем-токене BALLZ в сети Solana). Это мегатрейдер сделал более 17 000 иксов, превратив 4 бакса в 63 тысячи, более того, он сделал это за один день 10 марта. То есть покупка и продажа мемкойна  BALLZ произошла 10 марта. По-видимому, инсайдер, настолько близкий к команде токена, что может это была и сама команда. Вот такой он, собачий альтсезон. https://twitter.com/lookonchain/status/1767229289374814670",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "March 13, 2024, 11:46:02 AM",
      "body": "Quote from: Julien_Olynpic on March 13, 2024, 02:07:53 AMlookonchain опубликовала забавный твит про очередного мегатрейдера мем-токенами (мем-токене BALLZ в сети Solana). Это мегатрейдер сделал более 17 000 иксов, превратив 4 бакса в 63 тысячи, более того, он сделал это за один день 10 марта. То есть покупка и продажа мемкойна  BALLZ произошла 10 марта. По-видимому, инсайдер, настолько близкий к команде токена, что может это была и сама команда. Вот такой он, собачий альтсезон. https://twitter.com/lookonchain/status/1767229289374814670 Неужели у члена команды не нашлось более 4 долларов США? Он конечно огромный куш отхватил, для меня это немыслимые деньги, но по меркам акул бизнеса - это совсем небольшая сумма.Мог бы не 4 доллара США вложить, а хотя бы 40 долларов США. Тогда и выигрыш был бы гораздо больше.Или у этого токена изначально капитализация такая маленькая, что такое трюк невозможно было провести?Ну если это так, повторит на каком-то другом токене. Может это разумное решение.А возможно, что это и чистая случайность. Закинул парень лишние 4 доллара США в токен, и случайно сорвал джекпот. Может быть он и в другие токены такую сумму закидывал, но ничего не выиграл. Мы же не знаем...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Julien_Olynpic",
      "created_time": "March 14, 2024, 02:31:33 AM",
      "body": "QuoteНеужели у члена команды не нашлось более 4 долларов США? Он конечно огромный куш отхватил, для меня это немыслимые деньги, но по меркам акул бизнеса - это совсем небольшая сумма.Мог бы не 4 доллара США вложить, а хотя бы 40 долларов США. Тогда и выигрыш был бы гораздо больше.Или у этого токена изначально капитализация такая маленькая, что такое трюк невозможно было провести?Ну если это так, повторит на каком-то другом токене. Может это разумное решение.А возможно, что это и чистая случайность. Закинул парень лишние 4 доллара США в токен, и случайно сорвал джекпот. Может быть он и в другие токены такую сумму закидывал, но ничего не выиграл. Мы же не знаем...Риск-менеджмент, бро). Зачем тратиться, если можно обойтись четырьмя долларами?  Но и 4 бакса оказалось достаточно. Может быть это и не член команды, а, к примеру, сын или жена или тёща фаундера. Да, мы не знаем, нам об этом никто не расскажет. Случайности, по идее, тоже могут быть такого рода. Но они всегда изначально сомнительны. И вопросы о принадлежности, пусть даже косвенном, к членам команды всегда будет незримо висеть в воздухе. Если бы аналитики поглубже копнули, то, глядишь, чего-нибудь и раскопали бы интересного.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fantazy999",
      "created_time": "April 26, 2024, 09:45:59 AM",
      "body": "Конечно, было бы интересно проследить за динамикой торговой активности чела. И интересно было бы узнать его торговую систему. Явно человек торговал за пределами одного дня. Не исключаю также, что он мог пользоваться какими-то инсайдами. Ну или просто удачно поторговал с плечом.***[/quote]Не когда в жизни тебе не кто ничего не расскажет,только в искл случаях и то не всё...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tesslanik",
      "created_time": "January 06, 2025, 08:43:51 PMLast edit: January 07, 2025, 03:30:55 PM by xandry",
      "body": "Сомневаюсь что стоит называть кого то мегатрейдером из-за одной удачной сделки.Сейчас приведу пару скринов за прошлый год, где было больше 30 безубыточных дней подряд на фьючах.И это не 1 сделка, а в среднем как минимум 10 сделок в день.https://i.ibb.co/r0gtqND/chart1.jpghttps://i.ibb.co/R0t8Z5v/chart2.jpgНе понимаю, почему картинки отображаются только в виде текстовой ссылки.Посмотрел по другим постам, вроде вставляю правильно.... Специально снизу привел движение BTC за этот же период.Для понимания что была обычная волатильность а не сплошной рост или падение.P.S. Вроде понял, несмотря на то что профилю 4 года, я все еще новичок, поэтому размещать картинки нормально мне запрещено.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FS2018",
      "created_time": "January 07, 2025, 01:34:55 PM",
      "body": "Quote from: tesslanik on January 06, 2025, 08:51:42 PMМожно так Комментарий по методу торговли дайте какой-то. Я вижу 2 отдельных периода, а в другое время что происходило?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}