{
  "id": "topic_5443825",
  "title": "tropicalwi",
  "author": "tropicalwi",
  "created_time": "March 07, 2023, 12:51:30 AMLast edit: March 08, 2023, 08:12:44 AM by tropicalwi",
  "content": "Hello, everyone.Two questions actually.1) Where do I go to discuss experiments with blockchain technology (for both Bitcoin and an altcoin).2) May I share my Twitter account?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5443825",
  "comments": [
    {
      "author": "BlackBoss_",
      "created_time": "March 07, 2023, 01:19:18 AM",
      "body": "Quote from: tropicalwi on March 07, 2023, 12:51:30 AM1) Where do I go to discuss experiments with blockchain technologu (for both Bitcoin and an altcoin).For newbies, Beginners & Help board is best for general questions.Specifically, for Bitcoin, you have Bitcoin Discussion and Bitcoin Technical SupportFor altcoins, you have Altcoin DiscussionQuote2) May I share my Twitter account?You can but what for?You can add it to your Profile page",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hallroom",
      "created_time": "March 07, 2023, 03:22:44 AM",
      "body": "In my opinion the topic you have created here is the best place. You can get all kinds of help from legends here. And you have the opportunity to discuss about various information in the whole place of this forum but the sections are different to discuss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "March 07, 2023, 03:52:43 AMLast edit: March 07, 2023, 05:49:18 AM by Asuspawer09",
      "body": "Quote from: tropicalwi on March 07, 2023, 12:51:30 AMHello, everyone.Two questions actually.1) Where do I go to discuss experiments with blockchain technologu (for both Bitcoin and an altcoin).2) May I share my Twitter account?If you're posting about bitcoin you could post it on bitcoin discussion, talking about bitcoin technology you could get easily make a good discussion about bitcoin technology there, Post here: Bitcoin Discussion As a beginner you should probably start a discussion on the topics there and then if you already have the idea on the format, you could start posting your own discussion.But for altcoins post it on altcoin discussion any discussion about altcoins post it there. Post it here :Altcoin Discussion Just make sure to only post altcoins-related topics the mods might delete or move your post if it is not related to altcoins.I think sharing a link to your Twitter account is not allowed, but sharing something that you post related to bitcoin, altcoins, or anything related to the discussion I think will do as a reference. I guess you can add your personal links to your profile. You could add different links on your profile here in the forum something like Skye, yahoo, Messengers, and even your website links or businesses. I mean you could do pretty much add whatever you want to add to your profile since it's your profile anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topman21",
      "created_time": "March 07, 2023, 06:57:14 AM",
      "body": "Quote from: tropicalwi on March 07, 2023, 12:51:30 AMHello, everyone.Two questions actually.1) Where do I go to discuss experiments with blockchain technologu (for both Bitcoin and an altcoin).2) May I share my Twitter account?For those who are new there is help and beginner side where they can present all their problems. And if there is any issue related to Bitcoin it can be presented in the Bitcoin Discussion Thread. If you have any question related to Altcoin you can submit problem by leaving Altcoin discussion thread. You don't have to worry or stress about it. But you can also share on your Twitter account. But you don't have to go anywhere else as we have simple solutions. Hope you understand, thank you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "March 07, 2023, 07:18:17 AM",
      "body": "Pretty simple. Bitcoin-related? Bitcoin Discussion section. Altcoin-related? Altcoin Discussion section. Don't overthink it as mods will move your topic if it's in the wrong section anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "March 07, 2023, 08:27:51 AM",
      "body": "Quote from: tropicalwi on March 07, 2023, 12:51:30 AM1) Where do I go to discuss experiments with blockchain technologu (for both Bitcoin and an altcoin).Welcome to the forum! It is definitely a great place for both learning and experimenting with the blockchain technology, but I am not quite sure what your definition of experimenting really is. If you are interested in the technical aspects of bitcoin technology and wish to learn how cryptocurrency works under the hood, or you are an active developer who wants to try yourself in a new field such as decentralized digital cash systems, then you should visit the following boards:Development & Technical DiscussionBitcoin Technical SupportProject Development",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "March 07, 2023, 01:04:16 PM",
      "body": "Quote from: Hallroom on March 07, 2023, 03:22:44 AMIn my opinion the topic you have created here is the best place. You can get all kinds of help from legends here.Leaving it here in Meta isn't appropriate. Basically, Meta is the board for discussing stuff directly related to this forum, its rules and regulations and the way it's run. Meta is a kind of \"I need to know\" section of this forum. To that effect, it's obvious OP's topic shouldn't belong here. User Blackboss_ has rightly pointed them to the board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonair",
      "created_time": "March 07, 2023, 04:29:55 PM",
      "body": "Quote from: tropicalwi on March 07, 2023, 12:51:30 AM1) Where do I go to discuss experiments with blockchain technologu (for both Bitcoin and an altcoin).This entire forum has a variety of Bitcoin topics but you can specially follow (Bitcoin Discussion, Bitcoin Technical Support, Wallet software) here you can discuss about bitcoin and Throughout the forum you can discuss Bitcoin topics for various needs. it will not any big problem Quote2) May I share my Twitter account?You can definitely use a Twitter account, be it on your profile, or to participate in a bounty or giveaway. There is no problem in this. But make sure you are not doing any spamming with your Twitter account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 07, 2023, 04:43:26 PM",
      "body": "Quote from: tropicalwi on March 07, 2023, 12:51:30 AM1) Where do I go to discuss experiments with blockchain technologu (for both Bitcoin and an altcoin).It depends on the aspects you are considering your discussion about, if it's about bitcoin focused then it's ok on bitcoin discussion board, if it's about the blockchain technology then beginners and help section, it it's centered on the technical aspects of blockchain in respect to bitcoin then using the development and technical supports ok, lastly if it's about the economy we can have with blockchain technology and businesses that can use this technology for the advancement of their enterprise, economics board is best.Quote from: tropicalwi on March 07, 2023, 12:51:30 AM2) May I share my Twitter account?As you've been told, it's something you can just add to your profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "March 08, 2023, 04:44:39 AM",
      "body": "There's no problem with sharing your twitter account, however if it has personal information that you would rather not shared with strangers, then don't share it.The best place to see and discuss bitcoin/blockchain related experiments/projects (blockchain projects either using bitcoin or incorporating it in some way in their development) then the best board is probably the Project Development board. If you are talking about Bitcoin specific developments (things involving the open source code of Bitcoin itself) then Development & Technical Discussion is what you are looking for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "March 08, 2023, 05:49:57 AM",
      "body": "Quote from: tropicalwi on March 07, 2023, 12:51:30 AMHello, everyone.Two questions actually.1) Where do I go to discuss experiments with blockchain technologu (for both Bitcoin and an altcoin).2) May I share my Twitter account?    The previous commentators here in the forum have almost answered your questions and the best thing to do is to follow the guidelines given to you about the thing you want to know. And what kind of experiments discussion are you talking about anyway?The only thing that is surprising is why you need to share your twitter account here in this forum? For what reason and purpose?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tropicalwi",
      "created_time": "March 08, 2023, 08:16:29 AM",
      "body": "To clarify, I'm talking about doing things with blockchain that nobody, to my knowledge, has done before.One thing I am interested in doing is creating a Layer 4 blockchain, and I wanted to talk to the community about this. And, simply, if BitcoinTalk isn't an ideal forum altogether for that sort of thing, does anyone know of any other place to do so?The Bitcoin-related experiment I suppose I could post about in one of the Bitcoin forums.I don't see a place that I can add my Twitter account on my main profile. Actually, I can't edit my profile yet, for some reason. I was going to add a signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "March 08, 2023, 08:22:02 AM",
      "body": "Quote from: tropicalwi on March 08, 2023, 08:16:29 AMOne thing I am interested in doing is creating a Layer 4 blockchain, and I wanted to talk to the community about this. And, simply, if BitcoinTalk isn't an ideal forum altogether for that sort of thing, does anyone know of any other place to do so?I don't see a place that I can add my Twitter account on my main profile. Actually, I can't edit my profile yet, for some reason. I was going to add a signature.You can create it on project development or altcoins discussion section. If you're looking other forums, maybe cryptotalk or altcoinstalk are another option, but I believe those forums are worst than Bitcointalk.There's a place you can add your twitter account just click profile > forum profile information > Other contact info:You're still a newbie, so you can't add a signature, you can add a simple text when you've ranked up to Jr. Member or just buy a copper membership.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Patrol69",
      "created_time": "March 13, 2023, 04:36:24 AM",
      "body": "Quote from: tropicalwi on March 07, 2023, 12:51:30 AMHello, everyone.1) Where do I go to discuss experiments with blockchain technology (for both Bitcoin and an altcoin).There are many discussion threads about Bitcoin and other coins where you can express your opinions.  But what you publish in which section is completely up to you.  However, for your convenience, I am giving the link of some sections to you at this place, I hope it will be useful for you.Bitcoin DiscussionAltcoin DiscussionAnnouncements (Altcoins)Mining (Altcoins)Marketplace (Altcoins)Speculation (Altcoins)Quote from: tropicalwi on March 07, 2023, 12:51:30 AM2) May I share my Twitter account?Yes of course you can share your Twitter account. Your BitcoinTalk account profile has a place called Website where you can share your Twitter account link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}