{
  "id": "topic_5462453",
  "title": "ComboWizard",
  "author": "ComboWizard",
  "created_time": "August 08, 2023, 05:44:17 AM",
  "content": "AbstractWe propose a new standard for Ordinal NFTs that leverages Recursive Inscription, enabling all Bitcoin users to collaboratively and cost-effectively create a pixelated image on a public canvas, with each contribution being recorded on the Bitcoin blockchain and represented by an inscription reflecting the canvas's latest state.MotivationRecursive Inscriptions allow us to generate a new inscription by referencing an existing one and making incremental modifications to it. This methodology is ideal for serial collaborative scenarios, such as collective coding, writing, and painting. In these scenarios, each contributor's effort can be tokenized through the creation of new inscriptions, which not only records these incremental efforts forever but also makes them tradable.Leveraging this feature of Recursive Inscriptions, BRC721Cofound is designed as a standard for collectively creating pixelated images on Bitcoin. This allows anyone to freely express themselves on the public on-chain canvas and gain a tradable token in return. We believe this will be an exciting and Bitcoin-suited, fully on-chain game that has the potential to inspire crypto users from around the world, who may not know each other, to co-create magnificent digital artwork.github repo: https://github.com/1nftopia/brc721cofound",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462453",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "August 08, 2023, 06:01:11 AM",
      "body": "Is this trying to implement Reddit's r/place but on a blockchain?If so, then I don't think that modifying an existing inscription with another one is possible, because there's no identifier in BRC.However, it is possible for you to create an inscription, which has several pieces of data in it, each having a counter and a proof-of-<something> or some kind, track all N inscriptions using software, and then users can increment that counter in a new inscription and place a new data in it in order to modify it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}