{
  "id": "topic_5403575",
  "title": "Robert518",
  "author": "Robert518",
  "created_time": "June 22, 2022, 07:40:23 AM",
  "content": "What is the best method for DCA Bitcoin? What platform are you using?It must be cheap.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403575",
  "comments": [
    {
      "author": "Maus0728",
      "created_time": "June 22, 2022, 08:00:01 AM",
      "body": "I don't know what platform you are talking about but I usually use dcabtc[1] to give me some stats/ visuals when using DCA strategy. Do note that I am also doing DCA strategy for years manually.[1] https://dcabtc.com/Edit: Personally, the best method depends on your preferred timeframe for stacking as well as your income/resources you have to consistently bag some stash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "June 22, 2022, 08:03:59 AM",
      "body": "Quote from: Robert518 on June 22, 2022, 07:40:23 AMWhat is the best method for DCA Bitcoin? What platform are you using?It must be cheap.I advise you use a trusted platform, not necessarily the cheapest.Some will recommend decentralized platforms like bisq or so, I have no experience with those.But if you prefer centralized exchanges, you can DCA on those too, just make sure you don't withdraw too often (withdraw only after your buys have passed a certain threshold the withdrawal fee no longer hurts s much).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 22, 2022, 01:00:11 PM",
      "body": "Quote from: Robert518 on June 22, 2022, 07:40:23 AMWhat is the best method for DCA Bitcoin? What platform are you using?It must be cheap.The thing you should focus on is security, deposit fees, and withdrawals, don't try to look for fees for security because you could end up losing your money.you can use exchange that provide cheap deposit fees >> buy bitcoin >> convert it to cheap withdrawal altcoin >> send it to other exchange >covert it to bitcoin >> withdrawalWhere do you live and how can you buy bitcoins? If all payment options are available, some options may be more expensive than others and vice versa.DCA strategy is considered successful in the long run and what increases its strength is buying in large quantities at the bottom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "June 22, 2022, 01:13:05 PM",
      "body": "It seems like you don't know what is DCA itself since you're ask \"best method\" while DCA is just a simple strategy without any consideration, the only thing you need to know is you need to be consistent enough to achieve successful DCA strategy.The cheapest and reputable centralized exchanges is FTX, as long as you don't have any problem with KYC, I'm recommend to use FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "June 22, 2022, 01:40:53 PM",
      "body": "If you're from the United States then Swan Bitcoin[1] seems to be a pretty good platform from what I've read.But really, an important factor is where you're from. A lot of times using a local platform is the better choice.[1] https://www.swanbitcoin.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "June 22, 2022, 01:53:14 PM",
      "body": "If you truly DCA for hodling, you will buy and withdraw your coin to your non-custodial wallet. Hence you will have to consider two fee: trading fee (when you buy Bitcoin) and withdrawal fee.Crypto exchange list (Cryptowisser.com)https://withdrawalfees.com/If you DCA with low capital, withdrawal fee will be expensive for you. Hence you will have to leave your coin on exchange and withdraw it it after a few times of DCA, to save withdrawal fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "June 22, 2022, 04:02:38 PM",
      "body": "Because many trading platforms charge a fee every time you make a transaction, you will be charged more trading fees with the dollar fee averaging strategy, and even if you want to use it, you must use a platform that is trusted and also very cheap.In my opinion DCA is a strategy where investors invest large sums of money gradually over time, not all at once. and the goal is to take advantage of market downturns without risking too much capital at any given time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sklopan",
      "created_time": "June 22, 2022, 05:24:56 PM",
      "body": "And what do you think about the fact that most often cheap is poor quality?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "June 23, 2022, 07:15:36 AM",
      "body": "Increasing your profits depends on your understanding of several things, the first of which is that it is a long-term investment that ignores market sentiments and sells only when you see a lot of green candles, to sell and reinvest again.Therefore, variables such as fees, taxes, and deposit method may enable you to inflate your profits by ignoring any unwanted fees.In short, choose a suitable platform, check the taxes, buy bitcoin, withdraw it to your wallet and wait for several years, sell at a high price, buy at a low price and stay like this for the longest time.Within 10 to 15 years, you will achieve a great fortune.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "June 23, 2022, 03:13:22 PM",
      "body": "Quote from: mk4 on June 22, 2022, 01:40:53 PMBut really, an important factor is where you're from. A lot of times using a local platform is the better choice.I agree on this. It depends where you are from because there could be a local exchange that's existing and operating in your choice. Buying and selling is easier if they're registered locally and for sure that payment methods, cash in and cash out are very convenient to do. Binance has its P2P platform so if you don't have the local exchange that you can prefer to use, you can give it a try if you want to or just trade on spot and DCA through its usual process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sklopan",
      "created_time": "June 23, 2022, 09:06:55 PM",
      "body": "Honestly, every day and with every new news it becomes more and more difficult for me to answer this question...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lixer",
      "created_time": "June 26, 2022, 08:30:30 PM",
      "body": "Quote from: NeuroticFish on June 22, 2022, 08:03:59 AMQuote from: Robert518 on June 22, 2022, 07:40:23 AMWhat is the best method for DCA Bitcoin? What platform are you using?It must be cheap.I advise you use a trusted platform, not necessarily the cheapest.Some will recommend decentralized platforms like bisq or so, I have no experience with those.But if you prefer centralized exchanges, you can DCA on those too, just make sure you don't withdraw too often (withdraw only after your buys have passed a certain threshold the withdrawal fee no longer hurts s much).Security shouldn't be compromised by quantity. You think you can save and buy more in these xx platform but you can find out later on that you cant withdraw your funds anymore. You can lose more money than the fees that you are trying to avoid. Bisq is a popular one but this one is p2p right?So, we still need to be careful if who we are dealing with. There are more famous centralized exchange but the only problem with them is they are in control of your funds. We will be storing our funds on them for a long time, if dca'ing is our strategy since we are only buying in smaller quantities and withdrawing them in an instant is not wise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}