{
  "id": "topic_5441311",
  "title": "Victorybit1",
  "author": "Victorybit1",
  "created_time": "February 26, 2023, 02:46:27 PM",
  "content": "I’ve heard about bitcoin talk for a while now, I’ve decided to come see, learn and know more about bitcoin for myself and I’m very impressed with what is happening here. I’m ready to learn from everyone and get to own a bitcoin wallet someday and invest in bitcoin. Hope is not too late and hope I’m welcome here. I will take every contribution, topic, thread and knowledge here seriously. Thanks for this learning platform for bitcoin talk.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441311",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "February 26, 2023, 02:58:11 PM",
      "body": "Op, welcome to bitcointalk forum the first thing I'll recommend for you is the forum's rules. You have to go through them and assimilate as much info as you can so as to prevent you from breaking any rules which might affect your account later on. And here is it Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQI'll also love to recommend a few threads and links to help start your learning journeyBeginners & Help Encyclopediahttps://www.bitcoin.com/get-startedhttps://coindesk.com/learnhttps://github.com/bitcoinbook/bitcoinbook#chaptershttps://theinternetofmoney.info/I believe those links above should be enough to get you started in your journey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "February 26, 2023, 03:03:28 PM",
      "body": "I suggest reading these if you want to familiarize yourself with the forumNewbies - Read before postingUnofficial list of (official) Bitcointalk.org rules, guidelines, FAQsince you mentioned that you want to learn more about bitcoin, I shared this post of FatFork on another thread, if you are curious, you can check the links on the quoted post.Quote from: FatFork on February 25, 2023, 12:55:13 PMI recommend starting with these introductory videos as a foundation, so you can continue from there.What is Bitcoin? (v2) from @weusecoinshttps://youtu.be/Um63OQz3bjoBitcoin explained and made simple from @theGuardianhttps://youtu.be/s4g1XFU8GtoThe Essence of How Bitcoin Works (Non-Technical) from @CuriousInventorhttps://youtu.be/t5JGQXCTe3cWhat Is Blockchain? from @wef (World Economic Forum)https://youtu.be/6WG7D47tGb0if you are curious about what wallet you should have, try reading this to get an idea of what wallet to look for, other members might give you a recommendation on what wallet you might need. [General] Bitcoin Wallets - Which, what, why?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victorybit1",
      "created_time": "February 26, 2023, 03:06:04 PM",
      "body": "Quote from: Cantsay on February 26, 2023, 02:58:11 PMOp, welcome to bitcointalk forum the first thing I'll recommend for you is the forum's rules. You have to go through them and assimilate as much info as you can so as to prevent you from breaking any rules which might affect your account later on. And here is it Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQI'll also love to recommend a few threads and links to help start your learning journeyBeginners & Help Encyclopediahttps://www.bitcoin.com/get-startedhttps://coindesk.com/learnhttps://github.com/bitcoinbook/bitcoinbook#chaptershttps://theinternetofmoney.info/I believe those links above should be enough to get you started in your journey.  Thank you very much for this information. I Will go through them one after the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajiz138",
      "created_time": "February 26, 2023, 03:10:06 PM",
      "body": "You are not late here, you can still learn about bitcoin knowledge in this forum or even out there which provides a lot for beginners as a basis.I'm sure others will provide links leading to it so you can learn and read more on the basis of it, even though the journey was not easy but I hope you will still not be bored to be interested in the knowledge about bitcoin and other things that are needed.Once again welcome friends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victorybit1",
      "created_time": "February 26, 2023, 03:22:19 PM",
      "body": "Quote from: acroman08 on February 26, 2023, 03:03:28 PMI suggest reading these if you want to familiarize yourself with the forumNewbies - Read before postingUnofficial list of (official) Bitcointalk.org rules, guidelines, FAQsince you mentioned that you want to learn more about bitcoin, I shared this post of FatFork on another thread, if you are curious, you can check the links on the quoted post.Quote from: FatFork on February 25, 2023, 12:55:13 PMI recommend starting with these introductory videos as a foundation, so you can continue from there.What is Bitcoin? (v2) from @weusecoinshttps://youtu.be/Um63OQz3bjoBitcoin explained and made simple from @theGuardianhttps://youtu.be/s4g1XFU8GtoThe Essence of How Bitcoin Works (Non-Technical) from @CuriousInventorhttps://youtu.be/t5JGQXCTe3cWhat Is Blockchain? from @wef (World Economic Forum)https://youtu.be/6WG7D47tGb0if you are curious about what wallet you should have, try reading this to get an idea of what wallet to look for, other members might give you a recommendation on what wallet you might need. [General] Bitcoin Wallets - Which, what, why? exactly what I needed, this is really helpful. Thanks for you contributions, I really do appreciate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bekuciwu9",
      "created_time": "February 26, 2023, 03:57:16 PM",
      "body": "Good luck with your journey. I was also newbie once here and i know that bitcointalk can be confusing place at the beginning, especially if you never visited other forums before.Take your time, don't rush and when in doubt ask question and more experienced members will help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "February 26, 2023, 05:42:18 PM",
      "body": "Quote from: Victorybit1 on February 26, 2023, 02:46:27 PM...Thanks for this learning platform for bitcoin talk.It's great that you decided to learn more about Bitcoin and registered on this forum. Try to familiarize yourself with the rules of this forum first, so that your journey into cryptocurrency on Bitcointalk is smooth: https://bitcointalk.org/index.php?topic=703657.0 And it will take time to study everything else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "February 26, 2023, 06:25:49 PM",
      "body": "Welcome to the board. Please read a few of the threads that other people have recommended. I'm glad you're considering investing in bitcoin. But, because you're new here, take your time and go through the forum more frequently to learn more about Bitcoin. Learn more about the safest wallets to use, then protect your funds. When you need to know something, you can use the search option here rather than starting a discussion. Simply keep reading some informative threads where you can learn from the forum people who are already quite helpful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "February 26, 2023, 07:01:44 PM",
      "body": "Congratulations for starting your Bitcoin journey on the right forum, reading consistently and quality response on forum threads would help keep you active on the forum, like other platforms you'll get reactions from members; merits and feedbacks regarding your activities on the forum. Given time you'll look back and see you've gone a long way and learnt many terms that makes up the network and market. They're different boards specifically made for a certain knowledge or information. Find the boards that'll interest you and fit in there, in few months the forum will get easier to navigate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 26, 2023, 07:38:39 PM",
      "body": "You are welcome here on the forum. This forum always welcomes members who are looking for learning and knowledge.We were all beginners when we registered here in the forum, and most of us did not know much about Bitcoin, but through this forum and through other good sites, we got to know Bitcoin well.Experience comes through knowledge and good follow-up that you gain with the days, through this forum you can learn well and get very good opportunities in the future by upgrading your rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "February 26, 2023, 07:44:17 PM",
      "body": "Welcome to the forum, Victorybit1! If you are thinking of investing in Bitcoin, do not worry, it is never too late to start. But before you jump in, make sure you understand the risks involved. Since you are new, it is best to start small; a few dollars a day (or a week) will do. As you learn more and gain confidence, you can gradually increase your investment over time. Once again, welcome onboard and good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fara Chan",
      "created_time": "February 26, 2023, 08:12:45 PM",
      "body": "Quote from: Victorybit1 on February 26, 2023, 02:46:27 PM Hope is not too late and hope I’m welcome here. I will take every contribution, topic, thread and knowledge here seriously. Thanks for this learning platform for bitcoin talk.I don't think anyone will say that you are too late to join and understand Bitcoin, the Forum is very wide, why won't they accept it, there are various features and options in the Forum, you can follow it by discussing it in Threads or contributing with other colleagues in Forum. Of course you will gain knowledge about Bitcoin and Forums, and there will be some people who will provide a selection of threads/links for your wider understanding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "savetheFORUM",
      "created_time": "February 26, 2023, 08:49:40 PM",
      "body": "Quote from: Victorybit1 on February 26, 2023, 02:46:27 PMI’ve heard about bitcoin talk for a while now, I’ve decided to come see, learn and know more about bitcoin for myself and I’m very impressed with what is happening here. I’m ready to learn from everyone and get to own a bitcoin wallet someday and invest in bitcoin. Hope is not too late and hope I’m welcome here. I will take every contribution, topic, thread and knowledge here seriously. Thanks for this learning platform for bitcoin talk.Welcome!Bitcointalk is surely a great place to learn about all aspects of Bitcoin, from its history to its current use cases and future potential. Owning a Bitcoin wallet and investing in Bitcoin can be a great way to get started. Always remember to do your research and understand the risks involved before making any investments.As you explore the forum, don't hesitate to ask questions and participate in discussions. There are many knowledgeable members on this forum who would be more than happy to share their experiences and insights with you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nurilham",
      "created_time": "February 26, 2023, 09:30:59 PM",
      "body": "You are in the right place to learn about Bitcoin and crypto.No, it is not too late. You can start your Bitcoin journey at any time.  The first thing you need to do is to read the pinned messages in this section. There are some threads above, those are very important to read first, mate.Anyway, it is very good that you have the intention to learn seriously. Not every newbie wants to learn seriously, many newbies just hurry to invest in or trade Bitcoin. I appreciate what you did now, you must focus on learning first and make sure you have sufficient knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "February 26, 2023, 10:19:05 PM",
      "body": "I admire your determination in seeking more knowledge by joining this forum; it demonstrates how serious and interested you are in learning more about bitcoin. You've taken a bold step, and I'm confident you won't be sorry if you follow and read/seek to learn more from the forum's members.Bitcoin may appear to you to be in its early stages of development, but believe me when I say that there is still a long way to go before the last bitcoin is mined into the blockchain, so I'll tell you that you are not late in any way. It's great that you started now, and there's no better time than now to start asides now. I wish you a prosperous journey here, and that you will not be sorry for joining this platform and investing in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "February 26, 2023, 11:14:28 PM",
      "body": "Quote from: Victorybit1 on February 26, 2023, 02:46:27 PMI’ve heard about bitcoin talk for a while now, I’ve decided to come see, learn and know more about bitcoin for myself and I’m very impressed with what is happening here. I’m ready to learn from everyone and get to own a bitcoin wallet someday and invest in bitcoin. Hope is not too late and hope I’m welcome here. I will take every contribution, topic, thread and knowledge here seriously. Thanks for this learning platform for bitcoin talk.At first i will appluad you coming to bitcointalk community, and secondly for the aspect of knowing the rudiments of Bitcoin, you have to devote out time to learn the basic things of Bitcoin through, observation, research, accepting of corrections and seriousness, so therefore i believe that with all these you will be able to excel in cryptocurrency sphere",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "February 26, 2023, 11:33:08 PM",
      "body": "Quote from: Victorybit1 on February 26, 2023, 02:46:27 PMI’ve heard about bitcoin talk for a while now, I’ve decided to come see, learn and know more about bitcoin for myself and I’m very impressed with what is happening here. I’m ready to learn from everyone and get to own a bitcoin wallet someday and invest in bitcoin. Hope is not too late and hope I’m welcome here. I will take every contribution, topic, thread and knowledge here seriously. Thanks for this learning platform for bitcoin talk.You are welcome here anytime, it is not to late to join bitcoin or in this forum. This is an open platform to learn and discuss bitcoin/blockchain and other topics so I ,think you have made correct decision to join us in this forum. QuoteI will take every contribution, topic, thread and knowledge here seriously.You will learn a lot and learn fast if you take this forum seriously, I think you have genuine interest about bitcoin so I suggest you to keep that intact through ups and downs of your bitcoin journey. Best of luck",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "February 27, 2023, 03:46:33 AM",
      "body": "Quote from: Victorybit1 on February 26, 2023, 02:46:27 PMI’ve heard about bitcoin talk for a while now, I’ve decided to come see, learn and know more about bitcoin for myself and I’m very impressed with what is happening here. I’m ready to learn from everyone and get to own a bitcoin wallet someday and invest in bitcoin. Hope is not too late and hope I’m welcome here. I will take every contribution, topic, thread and knowledge here seriously. Thanks for this learning platform for bitcoin talk.First, you come to the bitcoin forum, so you must focus on that. before continuing to anything, you must have a bitcoin address, before making a bitcoin address, you must have a bitcoin wallet. this is a very crucial thing that many newbies didn't note after coming to the forum. Many newbie learn which he should not learn. Newbie must learn how to save his bitcoin 1st before write post here. The newbie must know 1st how to create the wallet offline.So you don't have to journey anything before knowing what I said above. So, how can you follow the forum rule if can't create a wallet safe?believe me, you will be come a spammer, if can not create a bitcoin wallet offline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HajiBagi",
      "created_time": "February 27, 2023, 04:03:24 PM",
      "body": "You're welcome, it's not too late that you join here, and it's a good idea to join the forum and want to know more before starting to invest in cryto currency, it will be good if you read very carefully and understand any post on the forums and also contribute with your ideas, that can make you have more confidence to know what is right and wrong in cryto currency, you can ask as many questions as you want if you don't understand anything here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}