{
  "id": "topic_5467113",
  "title": "DYING_S0UL",
  "author": "DYING_S0UL",
  "created_time": "September 17, 2023, 04:16:11 PM",
  "content": "I have been on this amazing forum for some time. I learned a lot. But one thing I saw a lot of but didn't quite have a good understanding of was the trust list. My question is simple: \"What's a trust list?\" and \"What's an ignore list?\" and \"How do these work?\"First of all, I was previously messing with my profile settings, and I saw a bunch of user names on my ignore list. Later, I checked again and saw there was only one user name on my ignore list. I don't know if I was mistaken the first time. I never added any usernames to those lists or edited anything. So was it automatically added by the forum administration?I checked the username, and it was a real user. Probably some scammer or any red-tagged user. I honestly don't know. So these were my questions. Can anybody elaborate on how it works?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467113",
  "comments": [
    {
      "author": "_act_",
      "created_time": "September 17, 2023, 04:18:37 PM",
      "body": "If DT1 member add you to his trust list, you will become a DT2 member. It is theymos that will add you to DT1. If you trust a user on this forum, you can add the user to your trust list. Click on your profile > trust > trust settings to do that.If you put someone on ignore list, you will not be able to see the post that person make. If the person that you ignore mention you in a post, you will not get the notification. But if someone that you did not ignore quote the person that you ignore, you will get the notification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "September 17, 2023, 04:19:17 PM",
      "body": "I believe you can use LoyceV guide https://bitcointalk.org/index.php?topic=5191802.0 for the correct use of trust system in the forum. It covers the explanation of trust list pretty well. You should check that out to easily answer your question here.Simply Trustlist is the list of user that you trust in the forum. You simply trust their judgement by adding them to your list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "September 17, 2023, 04:20:23 PM",
      "body": "Check here[1] about trust list and trust system. About the ignore list, all user you had clicked the \"Ignore\" on the left side of every post/reply will be added there, you can add there manually too. It means you can't see their post/reply until you \"Unignore them\" or remove them on that list.[1] https://bitcointalk.org/index.php?topic=5191802.0Edit: Post above were faster than mine, check them too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "September 17, 2023, 04:26:54 PM",
      "body": "Quote from: DYING_S0UL on September 17, 2023, 04:16:11 PMI have been on this amazing forum for some time. I learned a lot. But one thing I saw a lot of but didn't quite have a good understanding of was the trust list. My question is simple: \"What's a trust list?\" and \"What's an ignore list?\" and \"How do these work?\"What is an ignore list?When someone makes a post or a reply. You can see an option to ignore at the left-sided profile picture. I mean under the picture. If you click that option, then you won't be seeing any messages from that person anymore. You can try that out. But by simply clicking that button under my profile, you will know what ignore lists mean. Once you do that, make sure to unignore me. If you want to get some good content, then follow me.What is a trust list?The one whom you trust the most. You can add anyone to your list. But you should add only those whom you think are good guys and will not scam other people. Because, let's say, a person has 20 positive feedbacks and zero negative feedback, a newbie or a person who is afraid to deal on BTT can easily trust that person and will be ready to make a deal with him or her. But if that person has 20 or 2 negative feedbacks, then one with a skeptical mind should avoid making a deal with that person. The trust system is not that old. I think it was added to the forum in 2018 if I am not mistaken. I read about the date of the trust system a few days ago, but now I forget when it was really introduced.https://bitcointalk.org/index.php?topic=5191802.0 check this thread out for more details about trust system",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z_MBFM",
      "created_time": "September 17, 2023, 04:36:36 PM",
      "body": "A trust list is a list where you can keep your trusted users.  And Ignore list is a list where you can keep the person you dislike, in this case you will not display any post of the person you put in your ignore list. But even if Ignore list works for you now, Trustlist won't work for you now because you are not a DT member.Another aspect is if a DT1 member puts someone in his trust list then that person will get DT2 power and if a DT2 member puts someone in his trust list then he will not get any DT power but if he has a positive feedback then the profile will have +1 green in trust. that's it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "September 17, 2023, 04:37:28 PM",
      "body": "Quote from: _act_ on September 17, 2023, 04:18:37 PMIf DT1 member add you to his trust list, you will become a DT2 member. It is theymos that will add you to DT1. If you trust a user on this forum, you can add the user to your trust list. Click on your profile > trust > trust settings to do that.If you put someone on ignore list, you will not be able to see the post that person make. If the person that you ignore mention you in a post, you will not get the notification. But if someone that you did not ignore quote the person that you ignore, you will get the notification.I think you should not start at the advanced level, as first a simple definition and examples will do the work, but you went straightforward, and that might confuse the OP, but still, your words are totally legit and valid and are important to know about too. However, it would be preferable if the explanation of the DT1 and DT2 were simplified.And just a confusion: we don't get notifications of mentioned people on BTT, but we did on Telegram Bot, so please add that too. We get notifications of someone mentioned on the Telegram app, and we have to ignore that person from there in order to not get any type of notification from some member.Or we only have to ignore a person from the BTT, and that person will be put on ignore on the Telegram app too. As far as I think that's not the case, but just in case I asked,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 17, 2023, 04:56:38 PM",
      "body": "Quote from: Z_MBFM on September 17, 2023, 04:36:36 PMA trust list is a list where you can keep your trusted users.Wrong. The Trust list is for \"users who you trust to have good trust ratings and good trust lists\".You can trust someone's judgement on others without trusting them with money.QuoteTrustlist won't work for you now because you are not a DT memberWrong again. Individual Trust lists work for everyone, even banned users.Quote from: dimonstration on September 17, 2023, 04:19:17 PMI believe you can use LoyceV guide https://bitcointalk.org/index.php?topic=5191802.0 for the correct use of trust system in the forum. It covers the explanation of trust list pretty well.Apart from my Beginners guide to correct use of the Trust system, my Personal Full Trust Depth viewer explains the (often misunderstood) recursive implications of adding users to your Trust list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "September 17, 2023, 05:21:44 PM",
      "body": "@DYING_S0UL, you can learn everything there is to know about Trust Lists and Trust Settings from these two links posted by LoyceV. As for the Ignore list, it's pretty self-explanatory. When you Ignore someone, their name will appear on your Ignore list. You can edit your Ignore list by removing or adding users to it. Admins will not affect it in any way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "September 17, 2023, 05:28:37 PM",
      "body": "Quote from: LoyceV on September 17, 2023, 04:56:38 PMQuote from: Z_MBFM on September 17, 2023, 04:36:36 PMA trust list is a list where you can keep your trusted users.Wrong. The Trust list is for \"users who you trust to have good trust ratings and good trust lists\".You can trust someone's judgement on others without trusting them with money.So I can add you in my trust list, right? Clearly you are a trust worthy person, someone who have a clear reputation in this community. [ Thank you all for all the links, I was able to finish till feedback system. And for trust list, if I try to go too deep/advance, it all messes my brain, Have to read again more and more to fully understand ]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "September 17, 2023, 07:08:31 PM",
      "body": "Quote from: DYING_S0UL on September 17, 2023, 04:16:11 PMI have been on this amazing forum for some time. I learned a lot. But one thing I saw a lot of but didn't quite have a good understanding of was the trust list. My question is simple: \"What's a trust list?\" and \"What's an ignore list?\" and \"How do these work?\"First of all, I was previously messing with my profile settings, and I saw a bunch of user names on my ignore list. Later, I checked again and saw there was only one user name on my ignore list. I don't know if I was mistaken the first time. I never added any usernames to those lists or edited anything. So was it automatically added by the forum administration?I checked the username, and it was a real user. Probably some scammer or any red-tagged user. I honestly don't know. So these were my questions. Can anybody elaborate on how it works?You probably clicked on the ignore button by accident when browsing the forum, it has happened to me on multiple occasions. Admin will never add someone to your ignore list, it is a feature that only you have access to on your account. Scam is not moderated on the forum so don’t expect them to fish out the scammers for you.Users you should add to your ignore list are those whom you feel have low value posts and you don’t want to see them in threads anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "September 17, 2023, 07:34:30 PM",
      "body": "Quote from: DYING_S0UL on September 17, 2023, 05:28:37 PMSo I can add you in my trust list, right? Clearly you are a trust worthy person, someone who have a clear reputation in this community. You can add anyone you want to your trust list without needing to get permission from them. I have not traded with LoyceV but with their interaction here and little we have had in pm, I can assume the user to be trustworthy, but that's not what you factor in when adding someone to your list.• Trustworthy; means someone you can bank on and comfortably enter a trade with with some assurance that they will see it to the end.• Trus list user; someone who hasgood judgement and knows how to judge in cases of dispute, extra points if they are very interested in the trust system and gives feedbacks often.A user can be trustworthy without having good judgement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 18, 2023, 05:28:48 AM",
      "body": "Quote from: DYING_S0UL on September 17, 2023, 05:28:37 PMSo I can add you in my trust list, right?That's entirely up to you. Ideally, you should do that if you trust the users on my Trust list, and the users on their Trust lists. But most people (including me) don't look that far down the line.QuoteClearly you are a trust worthy person, someone who have a clear reputation in this community.\"The community\" is what put me on DT. A custom Trust list should be based on your own interpretation: do you think I've left accurate feedback? If so, include me. If not: don't include me, or even ~exclude me. It's up to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "September 20, 2023, 05:43:50 PM",
      "body": "I know that other users have already told you things you should know about the trust list and also the ignore list, but I am only going to add a few things to things that have already been said. On this forum, mostly newbies and also a few junior-rank members complain of receiving criticism from high-ranking members, so if you are that user who cannot bear the criticism of a user in your post, you can just put them on your ignore list, although that is not the solution, because it's usually advised on the forum that for you to stay strong on the forum, you have to build a thick skin so that you wouldn't really have to overreact to some of those criticisms, because it's better to ignore a user rather than having to leave the forum because of the criticism you receive.Another thing is that if you see that a user is just nothing but a spammer and shitposter, and you know you don't even have anything educative to learn from the person, you can put the person on your ignore list. Also, ignoring a shitpost is not the best solution because you can make yourself useful on the forum and because a shitpost buster on the forum frequently reports those shitposts to moderators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}