{
  "id": "topic_5409494",
  "title": "MetaMii",
  "author": "MetaMii",
  "created_time": "August 11, 2022, 12:29:51 PM",
  "content": "There are few crypto use cases that are exactly like when people dream of flying cars, its been years that many dream of flying cars and back in college some pal said we will see flying cars in the future and it never happen, too much high expectations is bad, technology has the fastest growth in the world but some thing will just never work out because no one needs them.. Choose wisely.If Elon Musk can say that A.I is not something humans should mess with....haha you know the rest.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409494",
  "comments": [
    {
      "author": "Lucius",
      "created_time": "August 11, 2022, 12:47:30 PM",
      "body": "I understand in which direction you are thinking when you talk about I suppose the usefulness and meaning of most of what we call altcoins, but when it comes to flying cars you are wrong because they already exist and are fully functional. The question is whether we need such cars, given that a large percentage of drivers have problems driving on ordinary roads, and what would happen if they had flying cars.Here, enjoy the video -> The flying car completes first ever inter-city flight",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "August 11, 2022, 01:24:45 PM",
      "body": "Driving on a road is 2D.Flying on air is 3D...You guys do realize how infinitely more complicated is 3D vs 2D, right? Not to mention fuel consumption. Gasoline is already expensive as fuck.There's a reason flying cars aren't commodities yet.Maybe when AI takes over... along with nuclear energy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Takyeon",
      "created_time": "August 11, 2022, 03:27:41 PM",
      "body": "Let's use this for example Do you all know how noisy a drone can be? I bet you all do, so just imagine it's a car, the question is can you live very close to an airport? We know how crazy loud aeroplanes can be, flying cars? 🤣🤣🤣 no we aren't there yet and that's so far away, not until we can fix the loudness of drones and planes then we can start dreaming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "August 11, 2022, 03:43:57 PM",
      "body": "You're kinda right though op, we didn't see flying cars because it's been deemed too dangerous/difficult to implement (also hard to train for).Flying bicycles are another thing we've not seen much of due to lack of demand.Quote from: Takyeon on August 11, 2022, 03:27:41 PMWe know how crazy loud aeroplanes can be, flying cars?  no we aren't there yet and that's so far away, not until we can fix the loudness of drones and planes then we can start dreaming. I thought of this a few weeks ago .they could be made a lot quieter/smaller by having a container full of liquid helium that expands when the car wants to take off and compressed when it wants to land.There'd be a lot less of a risk for wings/prepellars colliding and perhaps less energy used if something could deliver enough of a force to recompress the container and keep it compressed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 11, 2022, 05:35:54 PM",
      "body": "Quote from: MetaMii on August 11, 2022, 12:29:51 PMThere are few crypto use cases that are exactly like when people dream of flying cars, its been years that many dream of flying cars and back in college some pal said we will see flying cars in the future and it never happen,Don't be too certain that there are no flying cars at the moment, there are many technology that are currently available and we are all unaware of them because they have not been introduced commercially for use. I understand that  there are some impossible things that people reason out from complete fantasy, but as the years go by, there will definitely be more uses and application of crypto beyond what we are currently seeing.Quote from: MetaMii on August 11, 2022, 12:29:51 PM technology has the fastest growth in the world but some thing will just never work out because no one needs them..You could say no one needs them yet, or no situation yet has warranted its need, not a conclusive statement that no one needs them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "August 11, 2022, 08:39:30 PMLast edit: August 12, 2022, 02:35:56 AM by libert19",
      "body": "Quote from: Lucius on August 11, 2022, 12:47:30 PMI understand in which direction you are thinking when you talk about I suppose the usefulness and meaning of most of what we call altcoins, but when it comes to flying cars you are wrong because they already exist and are fully functional. The question is whether we need such cars, given that a large percentage of drivers have problems driving on ordinary roads, and what would happen if they had flying cars.Here, enjoy the video -> The flying car completes first ever inter-city flightWouldn't call it car, it still pretty much looks/functions like an aeroplane.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "August 11, 2022, 09:39:31 PM",
      "body": "I won't say high expectations are actually bad but rather i think in the midst of high expectations there should always be room for alternative plans. The case of flying car might someday become a reality if only it hasn't been produced yet. In the crypto world altcoins sre double edged and always expecting the worst while investing in altcoin keeps the risk minimal and the expectations low. Life is an adventure of risky decisions and sometimes altcoins move cents to millions of dollars",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "August 11, 2022, 09:56:31 PM",
      "body": "Quote from: MetaMii on August 11, 2022, 12:29:51 PMThere are few crypto use cases that are exactly like when people dream of flying cars, its been years that many dream of flying cars and back in college some pal said we will see flying cars in the future and it never happen, too much high expectations is bad, technology has the fastest growth in the world but some thing will just never work out because no one needs them.. Choose wisely.I find your single example not sufficient enough. I just want to point out that what we have is not \"high expectations\" but hope. We have hope and it keeps us going. Bitcoin is here to stay and in the coming years we are going to see widespread adoption. It may not happen in all the countries of the world however, it will get some good level of recognition.Quote from: libert19 on August 11, 2022, 08:39:30 PMWouldn't call it car, it still looks pretty much looks/functions like aeroplane. I agree. It's still an aeroplane for me. No way we would have that on our roads and still in the air. It probably would have been okay if the blades had been retractable just like the wings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "August 11, 2022, 10:10:27 PM",
      "body": "Quote from: MetaMii on August 11, 2022, 12:29:51 PMThere are few crypto use cases that are exactly like when people dream of flying cars, its been years that many dream of flying cars and back in college some pal said we will see flying cars in the future and it never happen, too much high expectations is bad, technology has the fastest growth in the world but some thing will just never work out because no one needs them.. Choose wisely.If Elon Musk can say that A.I is not something humans should mess with....haha you know the rest.I totally do not understand the angle you are coming from, but I will react based on the industry we are into.First, technology is dynamic but it respects expectations. Expectations birth ideas as much as necessity does. However, most times technological innovations do not follow our expectations due to non common problems. While flying cars might be the problem of an over populated economy, there are people whose problem is that they can't get water from the under-ground and there are no rivers around.Then, in a related industries expectations are met. In cryptocurrency, I know more coins would continue to be created, many altcoins will die off and new ones will emanate. Bitcoin will continue to be the king for many years then it will be very necessary to make some changes in bitcoin. Blockchain will not fail and the world's finance will eventually depend on blockchain. What else are you expecting to know, a technology might come up to augment or eliminate bitcoin right? All is possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bhig Daddy",
      "created_time": "August 11, 2022, 10:14:48 PM",
      "body": "Having high expectations isn't a bad thing, but there should always be an alternative plan. Just in case. And about flying cars it has It own advantages and disadvantages too but bro flying already exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "August 12, 2022, 03:07:58 AM",
      "body": "That's why it is one solid basis for a crypto project to consider real-world problems first. It seems we are seeing a lot of developments in the crypto ecosystem in which solutions are provided to non-existent problems. That's absurd. There are projects that seem to offer nothing but a more beautiful world. I guess that's not what the people need. I guess what is being in demand are products and services that address actual problems on the ground. It should also be noted that problems are ranked according to how pressing they are. And this is probably the reason why crypto doesn't impress a lot of people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 12, 2022, 06:12:39 AM",
      "body": "I don't necessarily agree. The reason why we have all these innovative technologies and inventions today is because of the people that were highly ambitious, and ended up achieving their ambitious goals.^ What makes it somewhat slightly bad is talking about a goal (mostly accompanied by year predictions) as if it was guaranteed to happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "August 12, 2022, 06:39:26 AM",
      "body": "Quote from: Bhig Daddy on August 11, 2022, 10:14:48 PMHaving high expectations isn't a bad thing, but there should always be an alternative plan. Just in case. And about flying cars it has It own advantages and disadvantages too but bro flying already exist.Maybe the point is its not yet time. Future movies incorporating some high tech stuff like flying cars and many more. Although its fiction, people keen to believe that these will happen eventually and will be possible. Since its already possible to make it with various technology and innovations, but just like others said its not yet necessary or needed at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vvang",
      "created_time": "August 12, 2022, 06:56:44 AM",
      "body": "To me, high expectations is hope, you dream of making 200,000$ in crypto by 2025 and you end up with 120,000$, you are able to gain this because you hope for more, that's the power of dream/hope and expectations, always have high expectations in what you do mate, this will make you put in more effort.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "August 12, 2022, 09:57:49 AM",
      "body": "Quote from: libert19 on August 11, 2022, 08:39:30 PMWouldn't call it car, it still pretty much looks/functions like an aeroplane. Quote from: Davidvictorson on August 11, 2022, 09:56:31 PMI agree. It's still an aeroplane for me. No way we would have that on our roads and still in the air. It probably would have been okay if the blades had been retractable just like the wings. I hate to go so off-topic, but did you watch more than 10 seconds of the video? When all the parts are assembled (automatically), then this is a fully functional car, no less futuristic looking than some modern cars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "August 12, 2022, 10:54:03 AM",
      "body": "Quote from: MetaMii on August 11, 2022, 12:29:51 PMThere are few crypto use cases that are exactly like when people dream of flying cars, its been years that many dream of flying cars and back in college some pal said we will see flying cars in the future and it never happen, too much high expectations is bad, technology has the fastest growth in the world but some thing will just never work out because no one needs them.. Choose wisely.If Elon Musk can say that A.I is not something humans should mess with....haha you know the rest.Flying cars isn't possible? That might not be the topic but using it to make a point, I might as well borrow that to make a point of my own.Maybe not in your generation but, did you ever imagine that humans would fly in the air someday (using an aeroplane of course), fly with large cargos, that someone could talk to someone over millions of miles using frequencies frequencies signals on telephones?There are so many difficult to imagine innovations that have come to past and I think crypto is the least of it. The only difference between these innovations and cryptocurrency is the fact that, cryptos excludes the government in its operation by not being centralized. Even at that, we are still heading somewhere with it and it's sure to materialise with at least 2 countries to have adopted it for a legal tender. Good and sustainable things takes time to develop!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "August 12, 2022, 11:27:35 AM",
      "body": "Quote from: MetaMii on August 11, 2022, 12:29:51 PMThere are few crypto use cases that are exactly like when people dream of flying cars, its been years that many dream of flying cars and back in college some pal said we will see flying cars in the future and it never happen, too much high expectations is bad, technology has the fastest growth in the world but some thing will just never work out because no one needs them.. Choose wisely.Yah, I know about the crypto part and the unrealistic roadmaps and purported but unachievable usecases some of them brandish in their White Papers. It's called building castles in the air, knowingly. However, on the flying cars stuff; that isn't unrealistic. I've seen a few documentaries on that. If people could make aeroplanes and spaceships, I don't see anything hindering them from making flying cars if the pros outweighs the cons. The negative impact could be what interested parties are looking at and not going ahead with it, and not because it's not possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Takyeon",
      "created_time": "August 12, 2022, 06:57:09 PM",
      "body": "Quote from: Lucius on August 12, 2022, 09:57:49 AMQuote from: libert19 on August 11, 2022, 08:39:30 PMWouldn't call it car, it still pretty much looks/functions like an aeroplane. Quote from: Davidvictorson on August 11, 2022, 09:56:31 PMI agree. It's still an aeroplane for me. No way we would have that on our roads and still in the air. It probably would have been okay if the blades had been retractable just like the wings. I hate to go so off-topic, but did you watch more than 10 seconds of the video? When all the parts are assembled (automatically), then this is a fully functional car, no less futuristic looking than some modern cars.Is this going to be economic? Also imagine thousands of this cars in the air, lol 😆 its possible to make these cars but it makes no sense because its not needy, second point is how silent this car will be, they will be loud as fuck and imagine many flying at once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "August 12, 2022, 07:17:38 PM",
      "body": "IMHO, the comparison is vague. I know that it's all about the feeling but realistically speaking, there really are projects that are rocking it when it's all about the technology and what they're talking about. It is just us that are dreaming too much because of our emotions and the faith that we have in the investments that we have. Well, it could also be related to the predictions that we're having like bitcoin going to $1M or even $100k. But it's only a matter of time that we're heading to the latter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}