{
  "id": "topic_5472859",
  "title": "Ojima-ojo",
  "author": "Ojima-ojo",
  "created_time": "November 04, 2023, 09:58:28 PM",
  "content": "I know to lot of people, who may have invested money into the wrong investment platforms outside of Bitcoin but pirade themselves as Bitcoin investment may misunderstand the title of this thread, but that is the truth, and the best way to start your Bitcoin journey.I use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after that, I became more active innthe forum and reading comments and posts and doing other bitcoin related research,  and that made it easy for my to accumulate more bitcoin while studying, and this has helped me in much greater ways and I thought it could help others here, most especially newbies. So if you have the money to buy some Bitcoin,  why not buy first and thereafter learn along the way and keep practising the few things that you learn, e.g DCA approach, this approachable helped a lot of newbies to be able to have the right mindset and accumulation approach towards bitcoin, and they can accumulate a good amount within a short space of time, and also building a sustainable knowledge that helps you to have a better understanding of the market and to make good analysis.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472859",
  "comments": [
    {
      "author": "sotelorene",
      "created_time": "November 04, 2023, 10:14:50 PM",
      "body": "Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMI know to lot of people, who may have invested money into the wrong investment platforms outside of Bitcoin but pirade themselves as Bitcoin investment may misunderstand the title of this thread, but that is the truth, and the best way to start your Bitcoin journey.I use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after that, I became more active innthe forum and reading comments and posts and doing other bitcoin related research,  and that made it easy for my to accumulate more bitcoin while studying, and this has helped me in much greater ways and I thought it could help others here, most especially newbies. So if you have the money to buy some Bitcoin,  why not buy first and thereafter learn along the way and keep practising the few things that you learn, e.g DCA approach, this approachable helped a lot of newbies to be able to have the right mindset and accumulation approach towards bitcoin, and they can accumulate a good amount within a short space of time, and also building a sustainable knowledge that helps you to have a better understanding of the market and to make good analysis.Sorry to say this, everybody must not do what you do. Different people different strategies, if that's how you learn it and it Favor's you, it might/may not definitely favor other people",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "November 04, 2023, 10:30:05 PM",
      "body": "Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMI use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after that, I became more active innthe forum and reading comments and posts and doing other bitcoin related research,  and that made it easy for my to accumulate more bitcoin while studying, and this has helped me in much greater ways and I thought it could help others here, most especially newbies. This paragraph I quoted actually explains that you weren’t a total newbie before buying your first bitcoin you might have read about them before or some guided you, because a total newbie wouldn’t be aware that it is bad not to store coins on exchanges. In fact most newbies uses exchanges as their first wallet because the lack the knowledge. So for a total newbie they wouldn’t just jump into buying bitcoin yet but rather sort after knowledge on where to get and how to do it. They also need gain knowledge about wallets and which is what and why they should install any. So with this informations lacking at first, it is bad to acquire bitcoin then. So with that knowledge stated above, you can stick to only bitcoin and grow your knowledge before going out on Alticoins because they need extensive knowledge to do there personal research",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "November 04, 2023, 10:30:32 PM",
      "body": "Never invest in anything that you have zero knowledge even if it's Bitcoin.As a newbie, the first step is to DYOR about Bitcoin and then they need to plan about purchasing it and for sure they will eventually land at bitcointalk and Reddit while researching Bitcoin where they will learn more about it.After purchasing their Bitcoin they need to move it to an actual wallet, for a beginner I recommend Electrum which is available on both Android and Desktop platforms, for IOS bluewallet is a good choice.For multi crypto - Android/IOS = Unstoppable wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "November 04, 2023, 10:37:51 PM",
      "body": "Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMI use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after that, I became more active innthe forum and reading comments and posts and doing other bitcoin related research,  and that made it easy for my to accumulate more bitcoin while studying, and this has helped me in much greater ways and I thought it could help others here, most especially newbies. So if you have the money to buy some Bitcoin,  why not buy first and thereafter learn along the way and keep practising the few things that you learn, e.g DCA approach, this approachable helped a lot of newbies to be able to have the right mindset and accumulation approach towards bitcoin, and they can accumulate a good amount within a short space of time, and also building a sustainable knowledge that helps you to have a better understanding of the market and to make good analysis.Maybe some of us are very lucky that time at least in my time here when I was a beginner because I didn't buy bitcoin initially, just like the rest of us 5-6 years ago, we just work on signature campaigns and that's how we earn our bitcoin.And yeah, in due time you learn about wallet and how to secure them or practice good security hygiene later.After that it was DCA for everyone, slowly, week by week hard and grind and buying every opportunity we can. Everyone goes on education here I guess and others might have their own approach. But the lesson is that Bitcoin will really teach how to save and be financially motivated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "November 04, 2023, 10:40:30 PM",
      "body": "Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMSo if you have the money to buy some Bitcoin,  why not buy first and thereafter learn along the way and keep practising the few things that you learn, e.g DCA approach, this approachable helped a lot of newbies to be able to have the right mindset and accumulation approach towards bitcoin, and they can accumulate a good amount within a short space of time, and also building a sustainable knowledge that helps you to have a better understanding of the market and to make good analysis.The advise is the same across board. Buy Bitcoin. At the moment no person has any excuse on why he or she will not buy Bitcoin. In fact there are more reasons to buy bitcoin now than there has been last year or the year before. In terms of one of the best performing acts assets Bitcoin is the number one. In terms of future possibilities Bitcoin is the talk of the town. Good thing that there is no one compelling or mounting any pressure on anyone to buy 1 Bitcoin. You can buy the littlest fraction of Bitcoin and starts to build or from there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Myleschetty",
      "created_time": "November 04, 2023, 11:14:38 PM",
      "body": "Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMI use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after thatHaving your BTC saved in a personal wallet is still not safe or secure if you don't verify the wallet before using it.Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMSo if you have the money to buy some Bitcoin,  why not buy first and thereafter learn along the way and keep practising the few things that you learn, I think learning should be the first step. Not learning first before investing in BTC is like gambling without knowing the game rules and regulations such a person has to lose the game before even starting cause she will lack the knowledge on securing the investment, risk management, and taking a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "November 04, 2023, 11:24:19 PM",
      "body": "Quote from: Zaguru12 on November 04, 2023, 10:30:05 PMQuote from: Ojima-ojo on November 04, 2023, 09:58:28 PMI use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after that, I became more active innthe forum and reading comments and posts and doing other bitcoin related research,  and that made it easy for my to accumulate more bitcoin while studying, and this has helped me in much greater ways and I thought it could help others here, most especially newbies. This paragraph I quoted actually explains that you weren’t a total newbie before buying your first bitcoin you might have read about them before or some guided you, because a total newbie wouldn’t be aware that it is bad not to store coins on exchanges. In fact most newbies uses exchanges as their first wallet because the lack the knowledge. So for a total newbie they wouldn’t just jump into buying bitcoin yet but rather sort after knowledge on where to get and how to do it. They also need gain knowledge about wallets and which is what and why they should install any. So with this informations lacking at first, it is bad to acquire bitcoin then. Mate we are saying the same thing and when i say I started my Bitcoin journey I was a newbie, that doesn't mean I don't have basic knowledge of wallets and exchanges because without the two mentioned, there is no way I can buy or own the Bitcoin innthe first place.But even with that basic knowledge, a lot still needs to be done and learned in other to be able to securely orient the privacy and security of my Bitcoin holding and what the best way to take advantage and use many of the other features that come along with bitcoin, that aspect needs a lot of knowledge to be able to succeed in it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "November 04, 2023, 11:24:26 PM",
      "body": "Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMSo if you have the money to buy some Bitcoin,  why not buy first and thereafter learn along the way and keep practising the few things that you learn, e.g DCA approach, Buying before doing research is never a good idea, especially not with Bitcoin which has certain common pitfalls like keep coins on exchange, losing the backup, downloading a fake wallet, etc. But the amount of knowledge required to invest in Bitcoin is greatly overestimated. All that people NEED to know is the basics of how to not lose their coins and why they should just hold for long term and wait. That's it, there is no \"journey\" or \"learning\", more advanced topics aren't really needed for investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "November 04, 2023, 11:52:49 PM",
      "body": "Bitcoin is the safest cryptocurrency and is most recommended investment for a beginner in the crypto space. Unfortunately, newbies have a wrong perception of bitcoin, they believe it’s a short cut to making riches but in reality bitcoin investment do not give high yield profits as it’s made to look like on social media. It is a slow process that comes with lots of discipline many times when newbies learn that bitcoin isn’t going to make them rich overnight they oftentimes turn to investing in altcoins in the pursuit of making profits. That’s my personal experience with newbies in this space.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "November 04, 2023, 11:59:29 PM",
      "body": "If a person wants to invest in crypto or hold crypto. It isn't necessary to buy lots of BTC. That is the common mistakes from newbies where they thought that if you want to buy Bitcoin is that you should buy 1 BTC when you can buy Satoshi until the total of Bitcoin you reach to the target your aiming or your goal. It isn't a long time ago where a newbie thought that it isn't possible to buy bits of BTC but rather you must buy a whole BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "November 05, 2023, 02:42:34 AM",
      "body": "Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMI use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after that, I became more active innthe forum and reading comments and posts and doing other bitcoin related research,  and that made it easy for my to accumulate more bitcoin while studying, and this has helped me in much greater ways and I thought it could help others here, most especially newbies. I don’t think what you said here is true. How can you be a total newbie to bitcoin and go and invest without any prior knowledge of how the investment goes? You said that you store it in your personal wallet, which I think a total newbie won’t know about. Most newbies mostly store their first bitcoin in exchanges; they don’t get to know that there is a personal wallet until they enter the market. However, I think you join the bitcoin community with your knowledge but not much, and then you later start doing more research to know more things and how you can store your bitcoin safely.QuoteSo if you have the money to buy some Bitcoin,  why not buy first and thereafter learn along the way and keep practising the few things that you learn,People who jump into the market without knowledge are the ones who easily get scammed. Why will you decide to invest in bitcoin without knowledge? Bitcoin investment is not something you will rush and do; it’s a process you need to learn systematically before you make any move. If not, you will spoil what has been invested, and we all know how scammers have been attacking investors, so don’t you think advising someone to invest and later learn the process will lead them to another problem? For me, that is a bad idea, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "November 05, 2023, 02:48:30 AM",
      "body": "Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMI know to lot of people, who may have invested money into the wrong investment platforms outside of Bitcoin but pirade themselves as Bitcoin investment may misunderstand the title of this thread, but that is the truth, and the best way to start your Bitcoin journey.They are worrying about high price and high cost they have to pay to buy Bitcoin but they don't know they can buy any piece of Bitcoin like 0.5 BTC, 0.1 BTC or 0.01 BTC, even smaller.After worrying too much, they end with altcoins that are cheaper and more promising in their eyes. Unfortunately they don't know or ignore fact that altcoins are more risky.How many cryptocurrencies failed?Only in 2021, more than 3000 altcoin projects failed and the number is much bigger if we count all years so far of cryptocurrency market.QuoteI use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after that, I became more active innthe forum and reading comments and posts and doing other bitcoin related research,  and that made it easy for my to accumulate more bitcoin while studying, and this has helped me in much greater ways and I thought it could help others here, most especially newbies. If you started your Bitcoin journey by storing your coin in a personal wallet, I assume by this you mean you used a non custodial wallet, it's good and you are actually very scarce case among many Bitcoin newbies.I agree choosing a good wallet is key and very vital to secure your coins, your money and can help to increase your wealth too.Everyone can choose a good Bitcoin wallet with criteria like: Open source, non custodial, coin control feature, Segwit, Tor support.https://bitcoin.org/en/choose-your-wallethttps://walletscrutiny.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zanab247",
      "created_time": "November 05, 2023, 03:00:21 AM",
      "body": "As a newbies having the knowledge of BTC before buying BTC is the best way to grow higher in this BTC investment because, a lot of newbies has experienced massive losses in their investment just because they just followed crypto investors to buy BTC from the market without knowing when to sell to make a suitable profits at the end. If you have fiat investment knowledge, you still need to learn a lot of things that related to  BTC investment before you will be able to do well in your BTC investment because you must learn when to buy and when to sell your BTC which are very important to newbies to know in the community. You can invest in BTC when the price is low in the market and, continue learning from potential crypto users in the platform and it will help you to grow on how to make a good choice in some potential coins that will bring you good profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "November 05, 2023, 03:36:58 AM",
      "body": "Other than the basics of learning Bitcoin, such as how to set up a wallet, store seeds, how to send a transaction, and basics about the economy and Bitcoin, you do not need in-depth technical knowledge to buy Bitcoin, and since the price of Bitcoin continues to rise, after obtaining the basic knowledge, it is better to buy Bitcoin until you learn more, such as how to allocate fees. Broadcast the transaction to be confirmed in the shortest possible time and prepare a multi-signature wallet. Buying first and learning later is a good strategy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "November 05, 2023, 03:39:09 AM",
      "body": "People who want to buy Bitcoin must have their own way. And your method is good for those who want to invest in Bitcoin. They can follow the method you have used so they don't need to delay buying Bitcoin.By purchasing Bitcoin in the minimum amount allowed by the exchange and doing it regularly, they can immediately own Bitcoin. And they can also continue investing in the DCA method while learning more. However, most people will still delay investing in Bitcoin due to various considerations.Maybe they will invest in Bitcoin once they are truly ready. Who knows when they will start becoming Bitcoin investors? Only they know. The important thing is, before starting to invest, learn the basics needed so that they can make the right start.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "November 05, 2023, 04:00:59 AM",
      "body": "Quote from: Dzwaafu11 on November 05, 2023, 02:42:34 AMQuote from: Ojima-ojo on November 04, 2023, 09:58:28 PMI use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after that, I became more active innthe forum and reading comments and posts and doing other bitcoin related research,  and that made it easy for my to accumulate more bitcoin while studying, and this has helped me in much greater ways and I thought it could help others here, most especially newbies. I don’t think what you said here is true. How can you be a total newbie to bitcoin and go and invest without any prior knowledge of how the investment goes? You said that you store it in your personal wallet, which I think a total newbie won’t know about. Most newbies mostly store their first bitcoin in exchanges...Sounds like a made-up story to me to get merit. It would be nice if he specified what kind of \"personal wallet\" he used, because if it was a custodial wallet it's not a great idea, and if it's not, there are only two types: a paper wallet which is almost impossible for a newbie to have made, or a HW which is unlikely. He says he was a student when he bought. How much was he able to buy? $50? and did he spend more than that previously on a HW for his first purchase to have it available? Sounds pretty unlikely story to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 05, 2023, 04:36:39 AM",
      "body": "Quote from: Ojima-ojo on November 04, 2023, 09:58:28 PMI use myself as an example, be for I started to acquire knowledge about Bitcoin, I first bought some amount of Bitcoin and held it in my personal wallet, not an exchange wallet, and I had my wallet keys properly saved, and after that, I became more active innthe forum and reading comments and posts and doing other bitcoin related research,  and that made it easy for my to accumulate more bitcoin while studying, and this has helped me in much greater ways and I thought it could help others here, most especially newbies. I won't talk about someone who clearly doesn't know about Bitcoin, Average Joes aren't even know the difference between personal wallet and exchange wallet. That why most people hold their coins in exchange wallet, but you're know the difference? If the Average Joes have money and they want to start to invest, I believe they will choose centralized assets first e.g. stock, gold, etc and if they have interest with cryptocurrency, they will try to buy shitcoins.Most people who buy Bitcoin are mostly understand what is Bitcoin in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "November 05, 2023, 05:11:56 AMLast edit: November 05, 2023, 09:00:14 AM by Luzin",
      "body": "If i look at the story you wrote, it looks like you want to trade. So a beginner must be prepared to lose, even lose Bitcoin. If you are a beginner trading then you should learn, technicals, fundamentals and emotions. The fundamental way to see how news affects and emotions is how you should be able to control your psychology in making decisions. Master it from the ground up and light. Don't learn too hard at the beginning because maybe you will feel very difficult. Because there are so many things related to Bitcoinj. You have to study patiently.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 05, 2023, 08:26:40 AM",
      "body": "I see so many loopholes in your posts that could lead newbies into losing their money. For me i would advise that they learn a few things first about bitcoin and also how to not lose their coin or wallet before they proceed to owning some. If a newbie just comes into the crypto space without having a basic understanding of what bitcoin is then they’re most likely going to fall for some shit scams; from purchasing an altcoin with the name “bitcoin” to using a scam exchange to purchase their first coin. You story might be true for all that I know but I’m sure it won’t work well for everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}