{
  "id": "topic_5421133",
  "title": "Magic-Money",
  "author": "Magic-Money",
  "created_time": "November 15, 2022, 04:06:41 PM",
  "content": "FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421133",
  "comments": [
    {
      "author": "dlightag",
      "created_time": "November 15, 2022, 04:29:59 PM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. They are things need to know about future trading and liquidation point.1. It required knowledge to trade on future2. Risk Management and 3. Discipline.If you can overcome it, greed has also removed, because most time people think, trading on future can make them rich over night without following the process on How To Trade and When To Trade. above all, entry points matters, it determines the profits or lost when your in position either Short or Long, and also trade with a target by fixed Stop Loss and Take Profits when you are on trade, because future trade is difference from spots as well, hence your liquidated on the future that is the end. but spot trading can be recover back after a long term holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "November 15, 2022, 10:53:51 PM",
      "body": "Maybe you need to change your trading strategy to best suit how long you need to wait for your positions to be open. Avoid sideways markets and try only trending markets.Look at the time frames you are using and leverage. Also, in order to avoid disappointments such as liquidations, you need to properly manage your risk and set up meaningful stop losses where possible.Use a good risk reward ratio that can help you determine the stop loss and take profit which you can set up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "November 16, 2022, 03:43:07 AM",
      "body": "If you are just set newly into the world of trading don't get tired of analyzing your trades execution because by that you'll have an idea of what are your mistakes you could avoid in the future right now the market does not show an impulsive price movement if you want to push having a large amount of profit in just a small action higher leverage and higher balance is a must. Don't forget to have your fundamentals, such as the stop loss and take profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "November 16, 2022, 04:12:06 AM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. Maybe it is time to change your approach to trading the markets, do not you think? If you get bad results over and over again with a trading strategy then maybe you are not ready for it yet or it is a strategy that it does not suit you.Why not try to become a long term holder at first? It requires way less effort and it can still give you good profits if you buy bitcoin for a good price, it is not precisely the most exciting strategy in the world but when it comes to investing that should be completely irrelevant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "November 16, 2022, 10:47:41 AM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. I think future trading is not for everyone, if you don't really understand trading, you might endup losing money always that's why I don't really encourage people to trade future if you are not a professional yet, if you are trading futures, make sure you do your analysis well before entering a trade.Currently we are in bear market and future trading is kind of difficult now, maybe the reason why you get liquidated is because you are using high laverage in your trade, I know the higher your laverage, the higher your profit, but you don't have to be greedy so I think it's better you use a lower laverage in your trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "November 16, 2022, 12:44:37 PM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. No wonder futures trading has claimed many victims like what you are experiencing. But that's the risk when forcing yourself to jump into futures trading. If half and half understand futures trading you will just continue to be liquidated all the time. The fact is don't go into a hole you never know how deep it is. It's better to be considered a loser and not dare to take future trades than to have to sacrifice your ego.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "November 16, 2022, 12:53:31 PM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. First thing you have to consider is you have to determine by your self what kind of trader you are because there are majorly three types of trader and they are scalper, daily trader and swing trader and they all operate different ways. Example a scalper and daily trader are short time trader and they are not suppose to allow a spill over market. That is they ensure to close all orders before the next trading day.Another thing that you need to do is to reduce your leverage and risk appetite. This is about your money management, it is important.Your next and important step is to use stop loss. If you do these things and you keep trading gradually you will understand your challenges.Quote from: Issa56 on November 16, 2022, 10:47:41 AMCurrently we are in bear market and future trading is kind of difficult now,I don't think being in bear market is a reason for consistent loses. Bear market is a trend and if you understand the trend, you look out for such bear positions. So it is about the knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "roslinpl",
      "created_time": "November 16, 2022, 12:53:39 PM",
      "body": "Future trade is always very risky one.You should have an attitude of exit with minimum profit.Because it’s best option to do the future trading.You need to make use of 300% of liquidity with your investment.Then only you can regain the loss money and save from the full loss.You should use the strategy of 15x or 25x maximum.Using of more candles will helps to gain some good profit from the trade.You should find the least value and maximum rising value.It only helps your position to more stronger then other normal traders.Most of the time,the same value repeat the twice.So find the correct value of bottom,use the bottom position to get good profit from your investments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "November 16, 2022, 02:18:10 PM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. Futures trading is much more riskier than the traditional spot trading. I am not sure if you are using stop loss? Hmmmm…..This is why no matter how many times I am thinking of trying futures trading, I’m just being hesitant to try it even at 5 bucks. Arbitrage trading would be better if you just know how to keep yourself updated about the price difference of each exchange for some specific coins and tokens that you want to trade. It’s also risky, but not much as futures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoYar",
      "created_time": "November 16, 2022, 02:33:29 PM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more,  The problem is that you are not using stop losses. And you also consider it useless like most people. Although it is not useless, it protects you from a big loss. You should use it according to your risk to reward.Learn more about risk-reward-ratio:[Here]Quote from: Magic-Money on November 15, 2022, 04:06:41 PMwhich required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gainIf you keep your trade open for two or three days, there is nothing wrong with it, and you should stick to your plan. Either a stop loss or a target.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "November 16, 2022, 02:51:55 PM",
      "body": "Quote from: CryptoYar on November 16, 2022, 02:33:29 PMQuote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more,  The problem is that you are not using stop losses. And you also consider it useless like most people. Although it is not useless, it protects you from a big loss. You should use it according to your risk to reward.Learn more about risk-reward-ratio:[Here]Quote from: Magic-Money on November 15, 2022, 04:06:41 PMwhich required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gainIf you keep your trade open for two or three days, there is nothing wrong with it, and you should stick to your plan. Either a stop loss or a target.You really need to be a pro to try out futures. With a small movement of price, your stop loss will exit the position. We know the risk in the futures market. It really feels like someone wants you to get a margin call every time and a sudden move of price against your position is deliberately done for you to lose. The sad part is that in a bear market, people tend to risk more on futures which instead of profiting they lose more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "November 16, 2022, 03:57:35 PM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. Literally, Future Trading is risky and you could loose all your money just in a matter of minutes if you don't have good trading strategy.Having first getting a draw down when you place a trade is normal , in fact this happens 95% all the time after you have executed a trade and this happens sometimes as a result of the smart money guys play in the market, trying to induce fear on retail traders so they can close in a lost or either looking for stop hunts. But when have good set ups/stops in place most times you end up being in a profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "November 16, 2022, 05:35:25 PM",
      "body": "why don't you try spot trading and instead opt for futures trading?We all know the risk of futures trading is very high. if you are liquidated in future trades it indicates that you are unprepared and do not understand future trades. you will only waste your money. the original plan wanted to make a lot of profit from future trades, but instead made big losses. Don't try future trading if you are not ready and don't have the basic knowledge of trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "borovichok",
      "created_time": "November 16, 2022, 06:05:41 PM",
      "body": "Quote from: kamvreto on November 16, 2022, 05:35:25 PMwhy don't you try spot trading and instead opt for futures trading?We all know the risk of futures trading is very high. if you are liquidated in future trades it indicates that you are unprepared and do not understand future trades. you will only waste your money. the original plan wanted to make a lot of profit from future trades, but instead made big losses. Don't try future trading if you are not ready and don't have the basic knowledge of trading.Future trading is the crude oil of trading and it's very important that one knows the knots and tie of futures. Spot trading is what I use to practice trading and it's profits can be measured with future profits. There are countless accounts that have been liquidated and more still happen to be liquidate. Future have do many features unlike spot that have only key basics. Getting prepared for future trading would be good for newbies who see it as complex at first, but with constant practice, it becomes easier and is highly recommendable for traders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "November 16, 2022, 07:46:36 PM",
      "body": "Quote from: kamvreto on November 16, 2022, 05:35:25 PMwhy don't you try spot trading and instead opt for futures trading?We all know the risk of futures trading is very high.I think the main reason why most people want to involve their self in future trading is because of the high profit, most of them use high laverage in their trade so that they will make huge amount of money, but they didn't discover the risk attached to future trading. If you are in sport trading, even if a coin dump your coin will remain intact only the price will drop, not like future trading that immediately it gets to your liquidation price, all your funds are gone. Most people believe if you are not having enough money in sport trading then you won't really be making good amount of money, but in future trading with little amount you can be making good amount of money just use high laverage but it's kind of risky. Quote from: kamvreto on November 16, 2022, 05:35:25 PMDon't try future trading if you are not ready and don't have the basic knowledge of trading.If you are having basic knowledge about trading, you shouldn't even try future trading, the only people that should be in future trade are the professionals that understand the market. If you are having basic knowledge then you should be in spot trading and not futures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "November 16, 2022, 08:50:25 PM",
      "body": "How high is your leverage? It's not that profitable there if you're not used to the risk that it has. Most traders there are being rekt by liquidation and that's what you need to avoid the most. If your leverage is high then you'll surely going to be at loss most of the time. The higher it is, the higher chance that you'll get liquidated. And you need to be closely monitoring your futures trade so, don't get in if you can't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "November 16, 2022, 09:12:24 PM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. If you wanted to take profit at 10% then you should have stop loss at 10% too and not more than that. You can prolong that position in any given time but you should have a target or a plan always when you are trading. Don't say it was the worst, take it as a lesson instead and don't over leverage just my advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "November 16, 2022, 09:15:50 PM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. You have to set-up your cut loss price to avoid being trap and that 40% loss will not happen only if you manage your risk and have a strategy for this. On a very volatile market, doing futures for 2-3 days might not be ideal especially on a bear market like this. Learn from that mistake, and have a good strategy in trading to avoid being liquidated. This is a costly way of learning but you have to deal with it and address the problem now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "November 16, 2022, 09:19:58 PM",
      "body": "Quote from: Magic-Money on November 15, 2022, 04:06:41 PM                 FUTURE TRADING LIQUIDATIONMy worst crypto experience is to trading on Future Trade, I trading on future platform as a daily or two to three days trading position, before exit point position, I always find it difficult to make 10% profits, but rather, I always be on the lost side of -40% lost or more, which required me to stay in position 2-3 days or more before the correction of the candle stake to form towards my direction predicted to make  a little gain, and sometimes i will be liquidated from the market. This isnt only limited on futures but also in other types as well on which either spot etc... Whenever you're position is on negative sill and as long you arent liquidated or havent able to trigger your stop loss then waiting game would be definitely be on that endless and it would really be a test of patience which is really a must have as a trader.Futures is never been ideal specially for noobs who dont havesufficient experience with spot trading this is why its not recommendable.Its always been risky and way too moving and easily blown out or liquidated on your account if your positioning isnt really something good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}