{
  "id": "topic_5405539",
  "title": "Question:",
  "author": "Loco1887",
  "created_time": "July 07, 2022, 07:37:28 PM",
  "content": "Suppoman in youtube is rating them as best coins to buy in a bear market. I am interested in your opinion about those 3.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405539",
  "comments": [
    {
      "author": "RussianEnglishTranslation",
      "created_time": "July 08, 2022, 02:54:41 PM",
      "body": "NEAR is a buy but if you are building a portfolio, you should also add some microcap gems like CNDL and ATRI. Also, if you don't have that much money to invest, consider participating in bounties like the one from Candlelabsdotorg. Once you purchase your cryptos, like CNDL and NEAR, consider staking them to receive additional rewards. Don't just let them sit in your wallet not earning returns.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WalkerIVIV",
      "created_time": "July 08, 2022, 03:26:21 PM",
      "body": "Quote from: Loco1887 on July 07, 2022, 07:37:28 PMSuppoman in youtube is rating them as best coins to buy in a bear market. To be honest if i didn't trust the youtubers as the youtubers will always have his own agenda. im sure that if suppoman already bought those tokens. Quote from: Loco1887 on July 07, 2022, 07:37:28 PMI am interested in your opinion about those 3.Those 3 are good tokens for now but im thinking about sandbox was the most under valued token at this moment. The price already dumped so hard and the recovery was not so fast like the protocol coin. I think that will be a wise chose to be used as long term investment from now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "July 08, 2022, 03:44:31 PM",
      "body": "None of them I hold.But what I like in those three is Near Protocol. The entire project itself and just so you know folks, they're offering programs for developers and to those that want to learn more not just with their project but with blockchain.They have the learn feature, I don't know with the other two if they have but that's what I like with Near, not as an investor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 08, 2022, 03:52:06 PM",
      "body": "A little introduction about the three cryptocurrencies OP is talking about.NEAR:QuoteNEAR Protocol is a decentralized application (dApp) platform and Ethereum competitor that focuses on developer and user-friendliness. Its native NEAR tokens are used to pay for transaction fees and storage on the Near crypto platform.The SandboxQuoteSAND is the native cryptocurrency of The Sandbox; a popular 3D \"metaverse\" game built on the Ethereum network that users can explore, purchase land on and create structures that can be monetized. All items acquired in The Sandbox are 100% owned by the players themselves, creating revenue opportunities for gamers.MoonbeamQuoteMoonbeam is a crypto token based on the Polkadot blockchain. Polkadot allows users to create their own blockchains, called parachains, which are linked to Polkadot's main relay chain. The idea behind Moonbeam is that, while it operates on Polkadot, it is able to connect to and interact with the Ethereum blockchain.Looking at those three, I think Near is pretty much ambitious, but I would say the project is much more promising than the other two.  In terms of the price ratio from its all-time low to current price, I think Moonbeam is very much to give more profit when the market boom since it has grown around 23% from its all-time low price.  In terms of active development NEAR Protocol beats the two.  I leaned on the developers activity so I can say among the 3 Near Protocol is a good catch for investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "July 08, 2022, 04:02:43 PM",
      "body": "Quote from: Loco1887 on July 07, 2022, 07:37:28 PMSuppoman in youtube is rating them as best coins to buy in a bear market. I am interested in your opinion about those 3.If you have the conditions hold all 3 because all three are very good i like sandbox because i predict the next trend that will bring the market boom back is web3 and sandbox or mana top 2 coins of web trends3. But you should not put all your money into these 3 coins and forget  btc, although they are very good and potential, there is no guarantee that they will be able to recover or continue to exist if the market goes bad. So invest with your money ready to lose and should allocate your funds to bitcoin or top alt coins like ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}