{
  "id": "topic_5413704",
  "title": "crypto_krylov",
  "author": "crypto_krylov",
  "created_time": "September 15, 2022, 07:18:21 PM",
  "content": "Hello everybody! I am a new person in cryptocurrencies and am now looking for a decentralized exchange for myself. What do you say about this: https://crypto.ru/raydium / It would be interesting to hear your feedback. Thank you!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413704",
  "comments": [
    {
      "author": "Mbitr",
      "created_time": "September 15, 2022, 07:23:48 PM",
      "body": "Initial thoughts … it’s a Russian exchange …. So with all the sanctions etc,it’s not going to be very user friendly ! You wouldn’t be able to transfer any fiat for crypto and vice versa !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "September 15, 2022, 09:03:45 PM",
      "body": "Quote from: crypto_krylov on September 15, 2022, 07:18:21 PMIt would be interesting to hear your feedback. Thank you! To be honest, I've never heard of that exchange. It probably isn't well known because it's a Russian site. You might have better luck if you ask in the Russian part of the forum:https://bitcointalk.org/index.php?board=10.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 15, 2022, 11:21:08 PM",
      "body": "If you talking about the Raydium Defi exchange then it's a Solana-based exchange and it seems it's a legit website. The link you posted above when trying to click the link provided from your link I'm blocked but I believe the link will redirect you to this domain raydium.ioThey also have documentation here https://raydium.gitbook.io/raydium/ and it was listed on Solana Defi page here https://solana.com/developers/defiSo I guess it's legit Defi exchange.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 16, 2022, 02:03:55 PM",
      "body": "I wonder which coins you want to buy and why you need to use this swap platform instead of the other popular swaps? Swap exchange isn't decentralized exchange since they can record your IP address and where the coins belong to, the only 100% decentralized exchange I know is Bisq, nothing more.Quote from: Mbitr on September 15, 2022, 07:23:48 PMInitial thoughts … it’s a Russian exchange …. So with all the sanctions etc,it’s not going to be very user friendly ! You wouldn’t be able to transfer any fiat for crypto and vice versa !Nope, it's just a review site about crypto exchange using Russian language, so we can say the @OP was a Russian citizen and that's why he's looking for decentralized exchange in order to hide from sanctions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "September 17, 2022, 02:03:13 PM",
      "body": "Quote from: crypto_krylov on September 15, 2022, 07:18:21 PMIt would be interesting to hear your feedback. Thank you! Maybe Rydium exchange is a bit foreign to us here, I saw Rydium exchange was founded in 2021, they have their own token called RAY, I saw them listed on the exchange  Binance, Currently their token operates more and less around 87 exchanges spread across the country.Regarding Rydium exchange information, in this forum there is not much to look at, outside the forum there are several reviews about Rydium exchange, as this person said: Raydium Review: Solana’s DeFi Liquidity Mammoth, I don't think the Rydium exchange can be said to be good or bad, it's clear that some considerations and other information are needed, before you use it, for me there are no suspicious signs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}