{
  "id": "topic_5448919",
  "title": "BareACuda",
  "author": "BareACuda",
  "created_time": "April 15, 2023, 07:09:56 AM",
  "content": "I started this new website. Looking for thoughts and opinions. Any advice will be helpful. Check it out and let me know please   thank you for your time https://faucet-ninja.webador.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448919",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "April 15, 2023, 10:06:23 AM",
      "body": "Quote from: BareACuda on April 15, 2023, 07:09:56 AMI started this new website. Looking for thoughts and opinions. Any advice will be helpful. Check it out and let me know please   thank you for your time https://faucet-ninja.webador.com/I don't think running a faucet will give you any profits because nowadays we hardly see people that run faucets because they have all discovered that in the end running faucets is a waste of their time. But, if you have ways to get traffic to your faucets then it might profit you but if not then I'm afraid you won't be makng a single penny off it. Aside from faucets being a waste of time a lot of users now use adblocker so even if you manage to attract traffic their adblocker will still prevent them from participating.p.s. I haven't tried your faucet but I did noticed that you are using a free CMS for your faucet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "April 15, 2023, 11:12:37 AM",
      "body": "Quote from: BareACuda on April 15, 2023, 07:09:56 AMI started this new website. Looking for thoughts and opinions. Any advice will be helpful. Check it out and let me know please   thank you for your time https://faucet-ninja.webador.com/I'd like to ask compared to other faucets do you think your affiliate faucet is competitive enough, I visited your site for feedback and click one link, and was directed to a link shortener, that's enough to close the tab, and your website as well, it is your choice to retain the link shortener but shortener is a big turn off to website visitors.Since this is a faucet affiliate it's better to give reviews on the faucets that you are promoting, instead of just posting a link and using a link shortener to monetize your visitors.I'll give you a  grade of 2 out of 10 for your effort in launching your site but it's not worth visiting and not worth recommending either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 15, 2023, 12:20:58 PM",
      "body": "I'm not sure what is the purpose of your website. Is it a faucet website aggregator? I know some of the websites on your list but afaik they are not faucet websites. If your purpose is just to list some websites with ref links, with no further explanation on their services, no one would bother visiting your website. UI problems aside, there is little to no value to faucet aggregators nowadays. You're better off expanding your service to include airdrops aggregators or something similar. They are more popular nowadays but you need better research and control if you want to maintain visitors. You can also expand to include paid-to-click websites that don't support crypto if you're that desperate on increasing your visitors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 15, 2023, 05:11:25 PM",
      "body": "What is your goal of the project, is it profitable? If so, then the idea is old and no one expects a rewarding financial return from it. The site is slow and takes a long time to load, so the interface needs a lot of modifications, which are reasons for the user to neglect your site, regardless of the return on it.If not for profit, many links and redirects are not good for those who want to build a long-term project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "entebah",
      "created_time": "April 15, 2023, 06:29:03 PM",
      "body": "i just visited the website and i see no field to enter a bitcoin address and there is no way to register on your website. all I can see is your website full of ads for other faucets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "April 15, 2023, 06:50:43 PM",
      "body": "At first the site didn't open until I turned on the VPN.In any case, the site does not look much different from the faucet sites, although the faucets are no longer attractive to many users who can get a lot of free coins through airdrops.I don't want to disappoint you but I see it as a waste of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "April 15, 2023, 11:19:50 PM",
      "body": "Quote from: BareACuda on April 15, 2023, 07:09:56 AMI started this new website. Looking for thoughts and opinions. Any advice will be helpful. Check it out and let me know please   thank you for your time https://faucet-ninja.webador.com/Based on how you configure your website you are a newbie in website development, you have a poor choice of template the logo is more visible than the faucets that you are promoting, in my experience on promoting faucets you should give reviews of the faucets, like the rate of the faucets and if possible screenshots of your own withdrawals. Everything on your site did not look good you have to sit down and think a lot about how to properly set up a good website, especially for a faucet aggregator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "April 16, 2023, 12:03:47 AM",
      "body": "Quote from: BareACuda on April 15, 2023, 07:09:56 AMI started this new website. Looking for thoughts and opinions. Any advice will be helpful. Check it out and let me know please   thank you for your time https://faucet-ninja.webador.com/I don't think you are serious about creating a website you just set up your website to monetize your visitor not really promoting whatever you want to promote, it doesn't have good content and the template is not appealing, before posting your website here you should first ask yourself if this website is good enough, but your intention is to only generate clicks and earn from link shortener.If you're serious about launching a decent site get a good name and use a WordPress script, there are hundreds of tutorials about WordPress online, especially on Youtube I recommend this website for beginners https://www.wpbeginner.com/ and thank me later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "April 16, 2023, 02:07:42 AM",
      "body": "Quote from: BareACuda on April 15, 2023, 07:09:56 AMI started this new website. Looking for thoughts and opinions. Any advice will be helpful. Check it out and let me know please   thank you for your time https://faucet-ninja.webador.com/To be honest that's a terrible website and a terrible domain. If it's your first website I could say congrats, it was a nice step, but there is a lot to learn from you. Is the first time I see webador, and I don't know anything about them but for sure is one of those services that offer free hosting and a free domain, while they ad some random ads to your site. So, If your goal is to learn how the web business works again I would say is a good step. But the right way to do it is by getting hosting and a domain and then building the site under your own sources, that way you manage the adds and have total freedom in the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "April 16, 2023, 02:32:51 AM",
      "body": "Quote from: BareACuda on April 15, 2023, 07:09:56 AMI started this new website. Looking for thoughts and opinions. Any advice will be helpful. Check it out and let me know please   thank you for your time https://faucet-ninja.webador.com/Just like seoincorporation said, the domain and the website are terrible.Why don't you explain what it is? I know it is a faucet agregador,  but you have to mention it somewhere in the website.And faucets are dead today... you really should think about an agregador of something else which would really add value.At least put the characteristics and a summary of those faucets you are promoting",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "April 17, 2023, 10:27:00 PM",
      "body": "You have already received enough feedback, as far as I can see they are all roughly similar. Your site is awful. I assume that you are a complete beginner, without any knowledge about creating a website, but somehow you wanted to have your own website and that it brings you income. To begin with, try to avoid free domains as well as free website builders, it can never be something serious, even if you want to learn and improve, experience with free builders will not help you in the future. You're just wasting your time.you put the big picture dominantly, completely useless, but it seems to me that you only did it for the reason that you understood how to do it. At the end you have so many tutorials, including free ones. Take a look at them and try to recognize some basics of good practice, which elements a site should have in order to be considered serious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}