{
  "id": "topic_5428116",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "December 13, 2022, 12:21:56 AMLast edit: December 13, 2022, 12:40:32 AM by Hydrogen",
  "content": "QuoteThe cofounder and former CEO of bankrupt crypto trading firm FTX was arrested in the Bahamas after the U.S. attorney for the Southern District of New York shared a sealed indictment with the Bahamian government.His arrest is the first concrete move by regulators to hold individuals accountable for the multi-billion dollar implosion of FTX last month.Bankman-Fried is expected to be extradited to the United States.FTX founder Sam Bankman-Fried was arrested by Bahamian authorities this evening after the United States Attorney for the Southern District of New York shared a sealed indictment with the Bahamian government, setting the stage for extradition and U.S. trial for the onetime crypto billionaire at the heart of the crypto exchange’s collapse.Bankman-Fried was expected to testify before the House Financial Services Committee on Tuesday. His arrest is the first concrete move by regulators to hold individuals accountable for the multi-billion dollar implosion of FTX last month.Damian Williams, the U.S. Attorney for the Southern District of New York, said on Twitter that the federal government anticipated moving to “unseal the indictment in the morning.”Bahamas Attorney General Ryan Pinder said that the United States was “likely to request his extradition.”In a statement, Bahamian Prime Minister Philip Davis said, “The Bahamas and the United States have a shared interest in holding accountable all individuals associated with FTX who may have betrayed the public trust and broken the law.”“While the United States is pursuing criminal charges against SBF individually, The Bahamas will continue its own regulatory and criminal investigations into the collapse of FTX, with the continued cooperation of its law enforcement and regulatory partners in the United States and elsewhere,” continued the statement.Bahamian regulators and FTX’s attorneys had been engaged in a bruising battle in chambers and in the court of public opinion. Earlier Monday, FTX attorneys accused the Bahamian government of allegedly working with Bankman-Fried to spirit away FTX assets from company control and into into crypto wallets controlled by Bahamian regulators. Bankman-Fried’s arrest by Bahamas law enforcement, as well as his expected extradition, suggest that close cooperation between the Bahamas and the U.S. will continue to evolve throughout the bankruptcy proceedings.In November, FTX and its affiliates filed for bankruptcy and Bankman-Fried stepped down from his role as CEO. The crypto trading firm imploded in spectacular fashion following a run on assets similar to a bank run.FTX’s collapse was precipitated when reporting from CoinDesk revealed a highly concentrated position in self-issued FTT coins, which Bankman-Fried’s hedge fund Alameda Research used as collateral for billions in crypto loans. Binance, a rival exchange, announced it would sell its stake in FTT, spurring a massive withdrawal in funds. The company froze assets and declared bankruptcy days later. Reports later claimed that FTX had commingled customer funds with Bankman-Fried’s crypto hedge fund, Alameda Research, and that billions in customer deposits had been lost along the way.Bankman-Fried was replaced by John J. Ray III, who had overseen Enron’s bankruptcy. Ray is also scheduled to testify before Congress this week. In prepared remarks released Monday, Ray said that FTX went on a “spending binge” from late 2021 through 2022, when approximately ”$5 billion was spent buying a myriad of businesses and investments, many of which may be worth only a fraction of what was paid for them,” and that the firm made more than $1 billion in “loans and other payments...to insiders.”Ray also confirmed media reports that FTX customer funds were commingled with assets from Alameda Research. Alameda used client funds to do margin trading, which exposed them to massive losses, Ray said.Legal experts told CNBC that if the federal government pursues wire or bank fraud charges that Bankman-Fried could face life in prison without the possibility of supervised release. Such a severe punishment would be unusual but not extraordinary. Ponzi scheme mastermind Bernie Madoff was sentenced to 150 years in prison, an effective life sentence, for his massive ponzi scheme. FTX’s collapse has already triggered the demise of BlockFi Lending, and has thrown the entire space into disarray.https://www.cnbc.com/2022/12/12/ftx-founder-sam-bankman-fried-arrested-in-the-bahamas-after-us-files-criminal-charges.html....Wow. Stuff is going down. Will there be a \"free SBF\" movement, the way Ross Ulbicht and other crypto celebrities in prison have enjoyed public support? It seems that SBF was forewarned this was coming. His recent social media content has been very apologetic. And he did not attend that recent public hearing he was scheduled to have. At which time a subpoena was issued. And now it seems he has been arrested.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428116",
  "comments": [
    {
      "author": "The Sceptical Chymist",
      "created_time": "December 13, 2022, 01:45:48 AM",
      "body": "Quote from: Hydrogen on December 13, 2022, 12:21:56 AMWill there be a \"free SBF\" movement, the way Ross Ulbicht and other crypto celebrities in prison have enjoyed public support?  I'd be very surprised if that happened.  And if I understand it correctly, the outcry against Ulbricht being imprisoned isn't/wasn't exactly extensive.  It'd be much less so for someone like SBF, who lost so much money for so many people through incompetence and downright idiotic (and I'm assuming illegal) use of FTX customers' funds.SBF also hasn't been sentenced yet like Ulbricht has, so we'll have to see how this all plays out.  I figured it might take at least a few more weeks for a case to be brought against him, but I betcha the authorities were worried he might find a way to disappear.  It'd be hard to argue that he isn't a flight risk.Life in prison without the possibility of parole for a financial crime does seem extremely harsh, no matter how much money was lost.  I don't recall anyone getting that sentence after a big financial collapse.  The bankers and mortgage agencies didn't even get punished at all back in 2008-09, and if SBF's lawyers are any good they'll get him off with much less prison time.  Jesus, most murderers and rapists don't even get LWOP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "December 13, 2022, 01:52:24 AM",
      "body": "I just hope that this process that they are doing against SBF will continue because what he did to tamper with his investors' funds is not a joke. Maybe, SBF's recent interview on various social media platforms is what gave the people in charge the courage to charge him with a case because of the wrong he did to FTX investors.And may he continue to be imprisoned in the end until the trial against him is over so that at least justice can be given to the people he victimized in this matter. So don't let it happen in the end that he pays a lot of money to those who charged the case against SBF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 13, 2022, 03:44:45 AM",
      "body": "Quote from: Ben Barubal on December 13, 2022, 01:52:24 AM      I just hope that this process that they are doing against SBF will continue because what he did to tamper with his investors' funds is not a joke. Maybe, SBF's recent interview on various social media platforms is what gave the people in charge the courage to charge him with a case because of the wrong he did to FTX investors.And may he continue to be imprisoned in the end until the trial against him is over so that at least justice can be given to the people he victimized in this matter. So don't let it happen in the end that he pays a lot of money to those who charged the case against SBF.They process will likely carry on and the guy may even spend some time in prison, not much though. It seems that white collar crimes like this one are only worth a few years, he may spend 3 years if any. I assume he has some influential friends in Washington who may recall those juicy donations he gave away to their campaigns.On the other hand, I have no doubt in my mind this case will open an important precedent for future fraud cases (of this level) that happen to occur in USA jurisdiction, SBF will be the perfect subject to push more regulation within the crypto market and surveillance/control over addresses and wallets.The enemies of Bitcoin and decentralization have a lot to thank to SBF.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 13, 2022, 04:22:02 AM",
      "body": "It’s about time he got arrested. I am surprised it took this long honestly. Madoff was arrested in less than a day. What got him arrested was that he didn’t keep FTX US separate from FTX international. They were basically together and since he screwed over US customers, they proceeded to have him immediately arrested and will most likely extradite him into the US soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "December 13, 2022, 04:22:53 AM",
      "body": "Lol, I just posted about how SAM is an invincible man yesterday, saying maybe the government was benefiting from likes of him that's why they failed to have locked him up. This has proven the point invalid, what a good news, no one should be above the law in anyway, even if they are born of powerful families.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "December 13, 2022, 04:29:24 AM",
      "body": "This is how it should have been from the start. Leaving the SBF free has angered many people who have lost their money. Instead of apologizing to people, he has made showy tweets on Twitter. He also refused to appear for the Senate hearing at the friendly request of the congresswoman. . Now things are starting to go right.Leaving such people unpunished will encourage more fraudsters to steal people's money, so it is necessary to severely punish them for their misbehavior.At the same time, the enemies of bitcoin and cryptocurrency in the US government are also sure to find a great opportunity to pass more stringent laws.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "December 13, 2022, 04:53:54 AM",
      "body": "Quote from: Hispo on December 13, 2022, 03:44:45 AMQuote from: Ben Barubal on December 13, 2022, 01:52:24 AM      I just hope that this process that they are doing against SBF will continue because what he did to tamper with his investors' funds is not a joke. Maybe, SBF's recent interview on various social media platforms is what gave the people in charge the courage to charge him with a case because of the wrong he did to FTX investors.And may he continue to be imprisoned in the end until the trial against him is over so that at least justice can be given to the people he victimized in this matter. So don't let it happen in the end that he pays a lot of money to those who charged the case against SBF.They process will likely carry on and the guy may even spend some time in prison, not much though. It seems that white collar crimes like this one are only worth a few years, he may spend 3 years if any. I assume he has some influential friends in Washington who may recall those juicy donations he gave away to their campaigns.On the other hand, I have no doubt in my mind this case will open an important precedent for future fraud cases (of this level) that happen to occur in USA jurisdiction, SBF will be the perfect subject to push more regulation within the crypto market and surveillance/control over addresses and wallets.The enemies of Bitcoin and decentralization have a lot to thank to SBF. Couldn't the purpose of his giving large donations to influential people and politicians be to help SBF reduce the court's sentence for what he did in the FTX scandal? So, for example, instead of 10 years in prison, it will be a 3-year sentence?I hope this trial against SBF will be fair, we know big money can do different things in this kind of situation like this. And besides this, it is probably also one of the things that can be focused on to make things regulated in cryptocurrency. But let's see what can happen in this regard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "December 13, 2022, 06:11:53 AM",
      "body": "Here are my random thoughts on his arrest. He may have been the target of someone who lost all his life's savings, so his arrest was good to save his life. I guess he already knew his life was at risk. Secondly, will other actors be arrested too? I know he didn't work alone. How about those who promoted the project, like Kevin O'Leary, Tom Bradly, Stephen Curry, and others? They convinced a lot of people to invest in FTX. They made the assumption that FTX was a safe platform. Especially Kevin O'Leary, who made the public believe that he had done his due diligence before investing. On the other hand, I think it is about time, Do Kwon,  Alex Mashinsky  and Steve Erhrlich get to face the long arm of the law too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fara Chan",
      "created_time": "December 13, 2022, 07:16:31 AM",
      "body": "The law must be enforced against anyone who violates it, but until now the SBF has not been decided by the court what sanctions will be given to him, this opens space for the enactment of regulation on crypto.The case that happened to SBF must be thoroughly investigated, so that similar incidents become a concern for everyone, because committing fraud for whatever reason is not right. The big problem is actually happening because of this case, in the form of encouragement for rules that will begin to be developed for crypto, regulations will continue to appear and as if this will create a safety barrier for crypto users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 13, 2022, 02:16:04 PM",
      "body": "Quote from: Hydrogen on December 13, 2022, 12:21:56 AMWill there be a \"free SBF\" movement,Yeah, there will be one, free SBF from prison so we can hang him ourselves, that kind of movement.There is nobody right now other than probably his gangbang buddies that would dare to come in public and demand freedom for this guy, not only he lied and manipulated, used customers' funds at his own discretion but when everything was uncovered he acted like a  total piece of ***,  minimalizing what he has done, thinking that one \"sorry\" is enough for the lives he affected in some case beyond repair.Quote from: Hydrogen on December 13, 2022, 12:21:56 AMIt seems that SBF was forewarned this was coming. Common, everyone knew this was going to happen, the only thing was how long it would take, with good lawyers and acting smart, and collaborating with the police immediately he could have postponed this for months, Karpeless managed to avoid it for a year, Mashinsky is still free and Do Kwon is still in hiding.Seems like the self-proclaimed genius was the stupidest of all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harapan",
      "created_time": "December 13, 2022, 02:47:55 PM",
      "body": "Quote from: Outhue on December 13, 2022, 04:22:53 AMLol, I just posted about how SAM is an invincible man yesterday, saying maybe the government was benefiting from likes of him that's why they failed to have locked him up. This has proven the point invalid, what a good news, no one should be above the law in anyway, even if they are born of powerful families. I concur to what you've said how can you let SBF be after suffocating big investors of their billions and millions.I reakk feel like the government are in these together with because it was two weeks without any arrest and he was out there living a comfortable live after putting people's lives at risk.He isn't above the law and shouldn't escape it no matter the lawyer's and legal practitioner's backing him, all he did was pure harm and shouldn't go unpunished, he should serve as a scap-goat to others in the crypto sphere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "December 13, 2022, 05:35:27 PM",
      "body": "Quote from: adaseb on December 13, 2022, 04:22:02 AMIt’s about time he got arrested. I am surprised it took this long honestly. Madoff was arrested in less than a day. There was a delay maybe because the authorities involved were taking their time to build and get a solid case around him and to know exactly the criminal charges they will be charging him with before they issued a warrant for his arrest. People said that Sam had some strong friends in politics and that was why he was not arrested early, whatever it is, he has been arrested now and his friends in politics may not be able to save him from this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erep",
      "created_time": "December 13, 2022, 05:38:11 PM",
      "body": "Quote from: Fara Chan on December 13, 2022, 07:16:31 AMThe case that happened to SBF must be thoroughly investigated, so that similar incidents become a concern for everyone, because committing fraud for whatever reason is not right. The big problem is actually happening because of this case, in the form of encouragement for rules that will begin to be developed for crypto, regulations will continue to appear and as if this will create a safety barrier for crypto users.I have read some recent news that the facts of his crime have spread to the public and the news of SBF arrest has been awaited by all members of the crypto community, we will be waiting for some of the latest facts from his confession at the trial because he will not have the opportunity to say reasons to cover up his guilt. I will be waiting for answers on FTX financial management and relationships with some of the larger investors who have withdrawn funds from FTX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fara Chan",
      "created_time": "December 16, 2022, 08:04:39 AM",
      "body": "Quote from: erep on December 13, 2022, 05:38:11 PMI have read some recent news that the facts of his crime have spread to the public and the news of SBF arrest has been awaited by all members of the crypto community, we will be waiting for some of the latest facts from his confession at the trial because he will not have the opportunity to say reasons to cover up his guilt. I will be waiting for answers on FTX financial management and relationships with some of the larger investors who have withdrawn funds from FTX.The crypto community and investors are starting to wait for the decision that will be received by Samuel Bankman-Fried, after the trial of the verdict begins and will continue at the case decision stage, given his behavior which is very detrimental to many people. Samuel Bankman-Fried faces several serious charges, ranging from electronic fraud to money laundering.It is not clear how many years Samuel Bankman-Fried will be given his prison sentence and whether all damages will have to be recovered, as the US Attorney General has yet to decide anything until the process is complete.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "December 16, 2022, 09:49:18 AM",
      "body": "Quote from: Fara Chan on December 16, 2022, 08:04:39 AMQuote from: erep on December 13, 2022, 05:38:11 PMI have read some recent news that the facts of his crime have spread to the public and the news of SBF arrest has been awaited by all members of the crypto community, we will be waiting for some of the latest facts from his confession at the trial because he will not have the opportunity to say reasons to cover up his guilt. I will be waiting for answers on FTX financial management and relationships with some of the larger investors who have withdrawn funds from FTX.The crypto community and investors are starting to wait for the decision that will be received by Samuel Bankman-Fried, after the trial of the verdict begins and will continue at the case decision stage, given his behavior which is very detrimental to many people. Samuel Bankman-Fried faces several serious charges, ranging from electronic fraud to money laundering.It is not clear how many years Samuel Bankman-Fried will be given his prison sentence and whether all damages will have to be recovered, as the US Attorney General has yet to decide anything until the process is complete.It seems that there will be a lot of drama and parts that will appear related to the case that SBF is undergoing. Regardless that at this time he has been arrested or is indeed under investigation, in fact there are big things that make him so immune from the law. This is related to his political relations and SBF contribution to the campaign of one of the US presidents. So don't be surprised if this case will continue to be extended and bore us with drama episodes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fara Chan",
      "created_time": "December 17, 2022, 04:58:53 AM",
      "body": "Quote from: hyudien on December 16, 2022, 09:49:18 AMIt seems that there will be a lot of drama and parts that will appear related to the case that SBF is undergoing. Regardless that at this time he has been arrested or is indeed under investigation, in fact there are big things that make him so immune from the law. This is related to his political relations and SBF contribution to the campaign of one of the US presidents. So don't be surprised if this case will continue to be extended and bore us with drama episodes.The person behind the SBF will form a body for the case that happened to him, but I think the US Attorney General will consider other aspects of the legal process against him, considering the case he created has an impact on legal stability there. Many legal experts are starting to pay attention to this case, and monitor that SBF is given appropriate sanctions for his behavior.We hope that there won't be much drama during the examination, because this is pure fraud that the SBF is trying to do, so legal steps must be taken and given as fairly as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "December 17, 2022, 08:35:26 AM",
      "body": "This is more a good news for cryptocurrency family and for people losing their money on the scam. They will expect that they at least will get back some of the investment with the arrest done on him. I think if extradited to US the justice may be done because of the legal system there I think more strict to follow the low I don't know how it is with Bahamas but it is good he is arrested to get tried of his crime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tony116",
      "created_time": "December 17, 2022, 08:59:46 AM",
      "body": "Quote from: gantez on December 17, 2022, 08:35:26 AMThis is more a good news for cryptocurrency family and for people losing their money on the scam. They will expect that they at least will get back some of the investment with the arrest done on him. I think if extradited to US the justice may be done because of the legal system there I think more strict to follow the low I don't know how it is with Bahamas but it is good he is arrested to get tried of his crime.The new CEO of FTX also told the House of Representatives that FTX is unlikely to reimburse or partially compensate the victims of the FTX crash, only US users will most likely receive compensation, and worldwide users will receive nothing. This announcement doesn't surprise me as the crypto market doesn't have any regulation, it's a market hole exploited by scammers.I'm not sure if the SBF is extradited to the US, the law there will really punish him properly because he has connections with so many politicians in the US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "December 17, 2022, 11:14:57 AM",
      "body": "Quote from: Tony116 on December 17, 2022, 08:59:46 AMThe new CEO of FTX also told the House of Representatives that FTX is unlikely to reimburse or partially compensate the victims of the FTX crash, only US users will most likely receive compensation, and worldwide users will receive nothing.I have to keep to doubt this until you will have to provide the information where it was said. If that is so it will be a biase justice and that is not fair but bad way to treat the people. I understand that cryptocurrency has no regulation but doing that is not a solution. If FTX collapse remedy measure will be done it should be general not to select countries to be benefiting into it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}