{
  "id": "topic_5471357",
  "title": "TravelMug",
  "author": "TravelMug",
  "created_time": "October 23, 2023, 02:47:35 PMLast edit: October 25, 2023, 05:51:10 AM by TravelMug",
  "content": "Original: Important to know: Difference Coin / Token and shady marketing practicesAkda ni: 1miauMayroong malaking lamang ang Bitcoin sa Shitcoins: alam natin na ito'y isang de-kalidad na coin. Ang Bitcoin ay hindi kinakailangan ng isang malaking pagpapahayag (Ang Bitcoin ay walang kahit na isang pre-mined stash parang pondohan ang pagpapahayag nito dahil hindi na kailangan ng Bitcoin), Kalidad na mismo ang Bitcoin bilang isang coin. Ang Bitcoin ay hindi nangangailangan ng pananaliksik kung ito ay isang coin o isang token.Kaya mahalagang malaman natin ang pagkakaiba sa pagitan ng isang coin at isang token.Dahil sa mga bagong proyektong inilulunsad sa mga umiiral nang platforms, ang mga tao ay nagsisimulang malito sa mga termino at paano tatawagin ng tama ang isang cryptocurrency. At sa paksang ito, aalisin natin ang mga buzzword sa pagpapahayag, na madalas na ginagamit para palakasin ang mga shit cryptocurrencies sa isang mapanlinlang paraan.Sa ngayon, maraming mga bagong proyekto ay patuloy na  \"nagpapayaman\" sa atin mula sa industriya ng Shitcoin ngunit isang napakalaking problema ang lumutang sa paligid nito, ang iba't ibang mga termino tulad ng \"Coin\" o \"Token\" na nagdulot ng kalituhan sa lahat. At dahil dito, napakahalagang tingnan kung ano talaga ang isang \"Coin\" at isang \"Token\" at kung bakit mahalagang magsaliksik kung ang isang cryptocurrency ay isang coin o isang token.CoinAng isang coin ay isang orihinal na cryptocurrency batay sa isang malayang blockchain, na ang blockchain ay pinatatakbo nang hiwalay mula sa iba pang mga blockchain.Hindi mahalaga kung ang blockchain na ito ay inilunsad kaagad, kinopya o na-forked.Ang isang coin ay nagsisilbing medium para sa mga bayarin ng transaksyon sa orihinal na blockchain na iyon.Mga halimbawa ng mga coin ay: Bitcoin, Bitcoin Cash, Litecoin, Ethereum, Ethereum Classic, Cardano, Avalanche, Waves, Tezos at Dogecoin, atbp.TokenAng isang token ay batay sa isang blockchain na mayroon na bago pa nilikha ang token. Ang token na ito ay kailangang sundin ang lahat ng mga katangian ng blockchain na ito kung saan ito nakabatay, at kailangan mo ng ilang mga coin ng orihinal na platform para magpadala ng mga token at lahat ng mga transaksyon ng token na ito ay naitala din sa kasalukuyang blockchain na ito.Isa sa pinakakilala platform para sa mga token ay Ethereum [ETH]. Maaaring lumikha ng mga Ethereum token, na ang mga transaksyon ay naitala sa Ethereum blockchain. Ang bayarin ay binabayaran sa Ethereum Coins.Ang iba pang mga halimbawa ng mga token ang mga Waves token, na batay sa Waves [WAVES]. Ang mga bayarin ay binabayaran sa Waves Coins.Binance tokens, na nakabatay sa Binance [BNB]. Ang mga bayarin ay binabayaran sa Binance Coins.Kaya, pag gusto mo maglipat ng token, kailangan mo palagi ng ilang orihinal na platform coin.Ang lahat ng iba pang mga coin maliban sa Bitcoin ay tinatawag na \"Altcoins.\" Kung babalikan natin ang panahon na ang mga bagong proyekto ay palaging may sariling blockchain. Kaya ang terminong \"Altcoin\" ay nabigyang-katwiran.Ngayon, mula sa pagpapakilala ng Ethereum, maraming mga proyekto ang lumutang, na mananatili sa Ethereum blockchain sa kabuong ng kanilang pag-iral, o kalaunan ay lumipat sa kanilang sariling blockchain. Hanggang pagkatapos sila ay nasa Ethereum blockchain.Kaya, alang alang sa katotohanan, ang mga produktong ito ay tinatawag na \"Alttokens\" sa halip na \"Altcoins\" hangga't sila ay isang token pa rin. Ang sikat na termino para sa mga ganyang produkto ay magiging \"Shittoken\" sa halip na nararapat na \"Shitcoin\".Ang maling pagpapahayag na niloloko ang mga mamimiliHabang ang terminong \"Coin\" ay nagbigay ng mas mahahalagang katangian, ang \"Token\" ay mukhang mababa ang kalidad. Ang resulta, maraming mga proyekto ang nagpapahayag ng kanilang produkto bilang isang \"Coin\" ngunit sa katotohanan, ito ay (pa rin) isang \"Token\".Hindi dapat tayo malinlang sa pamamagitan nito dahil ang mga proyekto ay madalas na ginagawa ito upang itago ang kanilang walang kwentang proyekto.Ang mga proyektong gumagawa nito, ay dapat na iwasan dahil isa itong malaking red flag.Bilang karagdagan, mayroong mga bagong stratehiya mula sa mga naglalabanang proyekto na ibasura ang kalabang proyekto.Sa isang maling pagyari, ang magkakalaban na coin ay nilagyan ng label bilang isang token, ngunit sa katotohanan, ito ay isang coin dahil ito ay batay sa sarili nitong Blockchain.Ngunit ang mga magkakalabang proyekto ay nilalagyan ito ng label bilang isang token upang mapabasura ito a takutin at pigilan ang mga potensyal na mamimili na bilhin ang nakikipagkumpitensyang coin.Maaaring mangyari pa sa mga magkakalaban na  proyekto na kumuha ng \"mga ahente\" at ilagay sila sa mga departamento ng marketing ng mga kalaban, na kung saan ang mga materalyes sa pagpapahayag ang minamali at binago ng ahenteng ito ang terminong \"Coin\" sa \"Token\" upang magmukhang masama ang kakumpitensyang coin sa pamamagitan ng pagtawag ito ay \"Token\".  ICO, ITO, Shitcoin and ShittokenAng kadalasang ginagamit na na terminong \"token sale\" ay hinango nung panahon, na kung saan maraming ICO ang gumagamit ng Ethereum at and resulta, ang mga asset ay naging mga token sa panahon ng pagbebenta nito. Ngunit para maging tama, dapat itong tawaging ITO (Initial Token Offering) sa halip na ICO (Initial Coin Offering), dahil ang mga token ay inaalok sa sa karamihan sa puntong ito.  Ang mga ito ay nagiging coin lamang sa kalaunan.Bagama't maaari itong pagtalunan, na ang ICO, kung saan ito ay inaalok ang mga token ay nangangahulugan din, na ang mga tokens na ito ay tiyak na magiging mga coin sa kalaunan at ang kanilang estado bilang isang token ay pansamantala lamang at ang pagbebenta ay nagsisilbi lamang bilang isang kaganapan upang magkaroon ng pinakamaagang pagtatala ng cryptocurrency, at hindi pwedeng mapagtatalunan na ang isang token ay isang coin, kung walang itong natatanging Blockchain, kung saan ito nakabatay.Kaya, mahalagang maituwid natin nating ang katotohanan at tingnan ang isang cryptocurrency kung ito ay isang coin at kung ito ay basura (na para sa karamihan ng mga kaso), tawagin itong Shitcoin o Shittoken, ayon sa pagkakabanggit.Kailangan nating tugunan nang maayos ang lahat ng teknikal na detalye.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471357",
  "comments": []
}