{
  "id": "topic_5409350",
  "title": "Becassine",
  "author": "Becassine",
  "created_time": "August 10, 2022, 11:34:05 AM",
  "content": "Salut les copains,J'espère que vous allez bien, ça a l'air un peu chaud les histoires avec Nexo, j'ai même lu sur Twitter que Shulev (ex ceo de Nexo) était parti en 2019 avec une coquette somme et que, par ailleurs, il y avait eu une class action en Californie (mais les trucs juridiques c'est quand même compliqué je l'avoue).https://www.cointribune.com/analyses/investissements/otteroooo-la-crypto-balance-de-twitter-a-encore-frappe-nexo/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409350",
  "comments": [
    {
      "author": "galaxiekyl",
      "created_time": "August 24, 2022, 09:17:44 AMLast edit: August 24, 2022, 10:49:35 AM by galaxiekyl",
      "body": "ce genre de place en sait comment ça commence mais jamais quand et comment ça va finir y a qu'a voir celsius  je sais pas si certains ont ou avait des fonds dans se projet mais sa craint. apres nexo c'est peu plus ancien mais perso je déposerai pas toute ma fortune dessus.il y a ces sites qui font des classements et émettent des commentaires sur ce genre de places, ça peu aiguillé mais à prendre avec beaucoup de recule, et ne jamais investir plus que se que vous pouvez vous permettre de perdre, je rappel que je ne fais aucun conseil en investissement donc DYOR avant de plonger dans le bain : https://p2pempire.com/en ou celui ci dans un style plus sponsorisé mais un peu plus complet : https://bitcompare.net/ moi j'y vais surtout pour les news et les red flag , par ce que justement ça peu éviter de plonger dans un bain d'eau froide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Becassine",
      "created_time": "August 30, 2022, 01:36:57 PM",
      "body": "Quote from: galaxiekyl on August 24, 2022, 09:17:44 AMce genre de place en sait comment ça commence mais jamais quand et comment ça va finir y a qu'a voir celsius  je sais pas si certains ont ou avait des fonds dans se projet mais sa craint. apres nexo c'est peu plus ancien mais perso je déposerai pas toute ma fortune dessus.il y a ces sites qui font des classements et émettent des commentaires sur ce genre de places, ça peu aiguillé mais à prendre avec beaucoup de recule, et ne jamais investir plus que se que vous pouvez vous permettre de perdre, je rappel que je ne fais aucun conseil en investissement donc DYOR avant de plonger dans le bain : https://p2pempire.com/en ou celui ci dans un style plus sponsorisé mais un peu plus complet : https://bitcompare.net/ moi j'y vais surtout pour les news et les red flag , par ce que justement ça peu éviter de plonger dans un bain d'eau froide.Merci, merci pour les liens, je vais jeter un oeil.Bonne journée",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gregory57",
      "created_time": "September 06, 2022, 01:47:25 PM",
      "body": "Bonjour,En effet, avec ces genres de sites, il est toujours nécessaire de rester très prudent. Il faut faire un investissement intelligent, sinon les conséquences peuvent être très lourdes. En passant, merci @galaxiekyl pour les liens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "patrickus",
      "created_time": "January 13, 2023, 08:39:52 AMLast edit: January 13, 2023, 08:53:57 AM by patrickus",
      "body": "Si vous avez de l'argent sur Nexo, retirez le.https://cointelegraph.com/news/nexo-offices-reportedly-raided-by-police-in-bulgariahttps://www.msn.com/fr-fr/finance/other/une-enqu%C3%AAte-pour-fraude-a-%C3%A9t%C3%A9-ouverte-contre-la-plateforme-de-cryptomonnaies-nexo/ar-AA16gxBk?ocid=msedgdhp&pc=U531&cvid=1bd551fc011f44ea9d9c6fa499678a3a",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LeGaulois",
      "created_time": "January 13, 2023, 01:40:39 PM",
      "body": "Quote from: patrickus on January 13, 2023, 08:39:52 AM...Ca sent un peu la corruption contre Nexo.La plateforme ne propose aucun service aux résidents bulgares, justement pour éviter des problèmes avec le gouvernement local.Quote\"il s'agit de la bataille pour le prix du \"moment le plus honteux\" du bureau du procureur bulgare, qui a été impitoyablement cruel pendant des décennies, mais qui aujourd'hui se place également en haut du classement\". C'est pour cette raison que la plateforme de crypto-monnaies n'a pas proposé ses services sur le territoire de la Bulgarie, car ils se sont toujours attendus à ce qu'il soit possible de venir \"sous le bombardement de l'absurde\"...Si il s'agit d'une enquête \"internationale\", Nexo elle, affirme que l'opération ne l'est pas et relève plutôt de \"l'arbitraire local bulgare\".Elle s'est plainte de ne pas avoir reçu de mandat de perquisition pendant des heures et que les personnes venant perquisitionner ne se sont même pas identifiés. C'est louche. (Coindesk a oublié de le dire (ou ca s'est su après)). QuoteNous n'avons pas encore été présentés avec des documents officiels qui indiquent sans équivoque les revendications contre Nexo. Cependant, elle est compensée par une action inutilement ostentatoire, avec la participation de personnes qui refusent de s'identifier et qui, pendant des heures, n'ont pas présenté de mandat de perquisition\"Il est précisé également que des personnes sont détenues, avec aucun mandat d'arrêt nominatif à leur encontre. D'ailleurs Nexo a décidé de porter plainte en retour.Nexo utilise Chainalysis, ca leur permet que des employés passent une qualification spéciale aux USA contre le blanchiment d'argent. Alors pour ce qui est de blanchiment, ca tombe à l'eau, ou alors c'est du blanchiment vraiment bien fait, parce qu'utiliser des cryptos pour des trucs illégaux, c'est pas trop le top, et encore plus avec un compte vérifié KYC et KYTPar contre, il y a un article, en Russe, disantQuoteSelon certaines informations, les propriétaires de la société, qui sont bulgares, ont détourné une partie des actifs, qui s'élèvent à plusieurs milliards de dollarsPeut être un mensonge, il n'est pas mentionné ce point ailleurs, j'ai l'ai pas vu en tout cas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Melja",
      "created_time": "January 13, 2023, 04:58:54 PM",
      "body": "je pense que cela ne va pas aller très loin cette affaire. Par précaution j'ai tout retiré,et Nexo prend en charge les frais de transaction(signe qu'ils sont plutot confians)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}