{
  "id": "topic_5407156",
  "title": "Scripture",
  "author": "Scripture",
  "created_time": "July 21, 2022, 01:26:40 PM",
  "content": "Meron nabang MAYA BANK ang lahat dito?Isa ito sa mga bago at updated wallet na kung saan ay maari na tayong mag buy and sell ng major cryptocurrency.Sa ngayon, wala pa silang send and receive option pero panigurado in the future, baka mas mahigitan pa dito ang Coinsph.Ang major cons lang na nakikita ko dito is, mahirap magcash-in kase wala pang Instapay Option and most of the convenience store na napuntahan ko ay di pa nagaaccept na Maya wallet, if ever naman sa iba malaki na ang cash in fee. Sana isa ito sa mga iupdate nila. If ever na gusto mo ren mag savings, may offer sila ngayon na 6% Interest Per Annum, mas malaki di hamak kumpara sa mga bangko ngayon.picture from their site: https://www.maya.ph/Any thoughts about MAYA?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407156",
  "comments": [
    {
      "author": "rhomelmabini",
      "created_time": "July 21, 2022, 04:05:06 PM",
      "body": "Quote from: Scripture on July 21, 2022, 01:26:40 PMSa ngayon, wala pa silang send and receive option pero panigurado in the future, baka mas mahigitan pa dito ang Coinsph.I think confusing yung title tsaka sa statement na ito, tumatanggap na ba sila o hindi pa? So far mas Malaki sila kesa sa GCASH's gsave kasi nasa 2.6% p.a lang yung interest rate nila. Sa tingin ko, Isa itong magiging direct competitor of either gcash and coins.ph or both (I think both sa nakikita ko).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "July 21, 2022, 09:21:57 PM",
      "body": "Hinde pa ako pamilyar dito, and upon searching mukang totoo nga at panigurado isa ito sa magboboom once naging ok yung platform nila. If may mga ganyang problem pa sila, hopefully ma address nila ito at sana magkaroon na ren ng other option aside from buying and selling, siguro magantay muna ako ng mga updates bago ko subukan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 21, 2022, 09:38:14 PM",
      "body": "Madali lang mag open ng account dito, ay may referral program den sila. If ever nga na gusto mo mag open ng savings, valid id at selfie lang ay ok na. Though di ko lang den sure kung magaask paba sila ng other requirements bukod dito since parang local banks den ito. Hinde ko pa na try mag convert ng peso to BTC pero sana ok yung conversion rate nila. Natry mo naba ito OP?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "July 21, 2022, 09:49:04 PM",
      "body": "Ito ay ang Paymaya dati, nagrebrand lang sila since they are now accepting Cryptocurrency so panigurado marami naren ang user nito, and its good to have other wallet like this kase mabibigyan tayo nito ng maraming option. With that experience OP, sa tingin ko need nila iimprove yung cash in and cash out kase yan ang major concern ng mga user, para mas mapadali bila makuha yung pera nila galing sa crypto profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "July 22, 2022, 01:07:57 PM",
      "body": "Marami pang kailangang i improve nag maya bank, sa ngayon, coins.ph pa rin malakas kasi marami silang cash in and cash out option. pero hopefully balang araw dadami ang partners ng Maya Bank, pwede ng makipag compete sa coins.ph, baka gagawa na rin ako ng account. Anyway, good news din yan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "July 23, 2022, 11:25:08 AM",
      "body": "Quote from: crzy on July 21, 2022, 09:49:04 PMIto ay ang Paymaya dati, nagrebrand lang sila since they are now accepting Cryptocurrency so panigurado marami naren ang user nito, and its good to have other wallet like this kase mabibigyan tayo nito ng maraming option. With that experience OP, sa tingin ko need nila iimprove yung cash in and cash out kase yan ang major concern ng mga user, para mas mapadali bila makuha yung pera nila galing sa crypto profits.Eto nga ang Paymaya dati, not sure lang den kung automatic ba nagmigrate yung kanilang account or need pa magregister ulti. Kakagamit ko lang ng Maya, sa ngayon lahat ng offer nila grinagrab ko especially yung referral kase habang mas bago pa, panigurado marami pa ang gustong mag try.Quote from: Japinat on July 22, 2022, 01:07:57 PMMarami pang kailangang i improve nag maya bank, sa ngayon, coins.ph pa rin malakas kasi marami silang cash in and cash out option. pero hopefully balang araw dadami ang partners ng Maya Bank, pwede ng makipag compete sa coins.ph, baka gagawa na rin ako ng account. Anyway, good news din yan. Isa nga ito sa mga nakikita kong problem, limitado paren yung cash in option nila and nahirapan ako magpasok ng pera. Mukang mas ok pa yung ibang wallet pero let's see until next month if worth it ba yung sinave ko na pera just to try their 6% interest promo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "July 23, 2022, 01:01:02 PM",
      "body": "Quote from: Scripture on July 23, 2022, 11:25:08 AMQuote from: Japinat on July 22, 2022, 01:07:57 PMMarami pang kailangang i improve nag maya bank, sa ngayon, coins.ph pa rin malakas kasi marami silang cash in and cash out option. pero hopefully balang araw dadami ang partners ng Maya Bank, pwede ng makipag compete sa coins.ph, baka gagawa na rin ako ng account. Anyway, good news din yan. Isa nga ito sa mga nakikita kong problem, limitado paren yung cash in option nila and nahirapan ako magpasok ng pera. Mukang mas ok pa yung ibang wallet Kung pareha lang din sila ng coins.ph, di wala ng dahilan para lumipat. Tingin ko, hindi gaano kadali silang makakakuha ng partners para sa cash in and cash out, at saka sa laki ng network ng coins.ph, pwede silang mag adjust mag stay lang ang mga clients nila. Quotepero let's see until next month if worth it ba yung sinave ko na pera just to try their 6% interest promo. Mataas na nga yan, pero parang pantay lang din ng inflation rate sa pinas. https://www.reuters.com/markets/currencies/philippine-inflation-near-4-year-high-cements-prospect-more-rate-hikes-2022-07-05/QuoteThe consumer price index rose 6.1% in June from a year (PHCPI=ECI),",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 23, 2022, 08:04:19 PM",
      "body": "Akala ko talaga naga-accept na sila ng bitcoin. Soon, mangyayari talaga yan at magiging competitor sila ni coins.ph at iba pang local exchanges sa bansa natin.All in one app na siya tapos banko pa kaya madaming use ang magaganap kay Maya kapag naging ok na siya at pwede na deposit at withdrawal ng crypto sa kanila aside sa buy and sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 24, 2022, 07:56:25 AM",
      "body": "Quote from: blockman on July 23, 2022, 08:04:19 PMAkala ko talaga naga-accept na sila ng bitcoin. Soon, mangyayari talaga yan at magiging competitor sila ni coins.ph at iba pang local exchanges sa bansa natin.All in one app na siya tapos banko pa kaya madaming use ang magaganap kay Maya kapag naging ok na siya at pwede na deposit at withdrawal ng crypto sa kanila aside sa buy and sell.Yes, katulad ng haka haka natin sa isang thread na papasukin na rin to ng maya and lo and behold, nung July 21 nga nakatanggap ako ng email na ganito.Hindi ko pa sya sinisilip mabuti pero yun nga, mas marami sila sa market, coins, abra at maya mas maganda sa tin dahil makakapamili na tayo at hindi katulad dati ng isa lang at lahat tayo nandun at parang napipilitan lang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "August 03, 2022, 09:00:10 AM",
      "body": "so Nauna pa pala ang Maya sa Gcash sa crypto adoption , nababasa ko na ang mga news in the past regarding sa adoption ng Maya team sa crypto pero akala ko mas mauuna ang Globe since mas nauna silang maglabas ng mga news noon .Anyway , sana nga magkaron na din sila ng receive and sending options para naman mas magkaron ng kompitensya ang coins.ph at baka sakaling maramdaman na nilang nauubos na users nila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "August 03, 2022, 12:35:20 PM",
      "body": "Quote from: Baofeng on July 24, 2022, 07:56:25 AMQuote from: blockman on July 23, 2022, 08:04:19 PMAkala ko talaga naga-accept na sila ng bitcoin. Soon, mangyayari talaga yan at magiging competitor sila ni coins.ph at iba pang local exchanges sa bansa natin.All in one app na siya tapos banko pa kaya madaming use ang magaganap kay Maya kapag naging ok na siya at pwede na deposit at withdrawal ng crypto sa kanila aside sa buy and sell.Yes, katulad ng haka haka natin sa isang thread na papasukin na rin to ng maya and lo and behold, nung July 21 nga nakatanggap ako ng email na ganito.Hindi ko pa sya sinisilip mabuti pero yun nga, mas marami sila sa market, coins, abra at maya mas maganda sa tin dahil makakapamili na tayo at hindi katulad dati ng isa lang at lahat tayo nandun at parang napipilitan lang.Lumabas na yung balita na gcash na susunod pero same feature lang din sila ni Maya. Pero sana pagka release ng kay gcash, yung kay Maya naman beta na ng deposit at withdrawal ng cryptos para mas maging ok ang transition nila. Mas nauuna sila at sigurado ako yung mga existing exchanges na masyadong nagiging pabaya sa mga customers nila, biglang magkakaroon ng mga promo at pagandahan ng serbisyo. Tayo ang panalo sa mga ganito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 03, 2022, 12:48:20 PM",
      "body": "Sa ngayon pwede pa lang tayo ka buy ng Bitcoin at iba pang supported cryptocurrencies dyan sa Maya. Alam ko na need natin ng maraming options para mag buy and sell ng Bitcoin kagaya ni Coins PH, Abra, PDAX, Binance P2P, etc. Beneficial sa atin lahat kasi ang maraming options upang makabili ng crypto kagaya ni Bitcoin. So hindi pa natin alam kung kelan na tayu pwede ka deposit dyan from other 3rd party crypto wallets at same rin sa pag transfer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "August 06, 2022, 10:31:36 PM",
      "body": "Dumarami na ang digital banking sa atin, etong maya ngayon ko palang ito susubukan kase hinde ko pa pinasok yung paymaya before kase hinde pa naman sila ganoon kaganda before. Maganda kase may option na to buy and sell crypto, need lang siguro naten mag antay for the deposit and withdrawal feature ng crypto.Malaki ren ang kanilang interest rate compare sa mga ordinary bank. Maraming magagandang digital banking ang nagsisipasukan ngayon sa Philippine market, ok den subukan ang mga ito kase regulated naman sila ng BSP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "August 07, 2022, 11:34:33 AM",
      "body": "Quote from: samcrypto on August 06, 2022, 10:31:36 PMDumarami na ang digital banking sa atin, etong maya ngayon ko palang ito susubukan kase hinde ko pa pinasok yung paymaya before kase hinde pa naman sila ganoon kaganda before. Maganda kase may option na to buy and sell crypto, need lang siguro naten mag antay for the deposit and withdrawal feature ng crypto.Malaki ren ang kanilang interest rate compare sa mga ordinary bank. Maraming magagandang digital banking ang nagsisipasukan ngayon sa Philippine market, ok den subukan ang mga ito kase regulated naman sila ng BSP.For savings maganda siguro dahil sa magandang interest rate, kadalasan sa mga digital bank maganda ang interest na ino offer, like CIMB, sana mag accept na rin sila ng crypto. Well, kung local exchange din itong MAYA, sana matapatan nila ang coins.ph.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lienfaye",
      "created_time": "August 11, 2022, 03:12:31 AM",
      "body": "Quote from: crzy on July 21, 2022, 09:49:04 PMIto ay ang Paymaya dati, nagrebrand lang sila since they are now accepting Cryptocurrency so panigurado marami naren ang user nito, and its good to have other wallet like this kase mabibigyan tayo nito ng maraming option. What if may account kana sa paymaya dati, hindi ba sya ma update to maya or need gumawa ng bagong account?Meron kasi akong paymaya account noon pero di ko na sya nagagamit at inan install ko yung app.Anyway magandang balita ito para sa atin na gumagamit ng crypto. Meron na bang ibang available na alts o Bitcoin pa lang?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "August 11, 2022, 09:41:01 PM",
      "body": "Quote from: lienfaye on August 11, 2022, 03:12:31 AMQuote from: crzy on July 21, 2022, 09:49:04 PMIto ay ang Paymaya dati, nagrebrand lang sila since they are now accepting Cryptocurrency so panigurado marami naren ang user nito, and its good to have other wallet like this kase mabibigyan tayo nito ng maraming option. What if may account kana sa paymaya dati, hindi ba sya ma update to maya or need gumawa ng bagong account?Meron kasi akong paymaya account noon pero di ko na sya nagagamit at inan install ko yung app.Anyway magandang balita ito para sa atin na gumagamit ng crypto. Meron na bang ibang available na alts o Bitcoin pa lang? Ang pagkakaalam ko dito is you can use your old paymaya account though need mo lang den siguro mag update ng details mo, especially if gusto mo ng savings sa kanila at magtrade ng cryptocurrency. Wala pa akong naririnig na update with Maya kase sa totoo lang medyo mahirap pa syang gamitin ngayon, at hinde pa convenient ang pagcash in unlike ng mga other digital bank, mukang marame pa silang dapat iupdate dito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "August 13, 2022, 10:11:57 PM",
      "body": "Siguro yung biggest issue ko dito is yung lack of its feature of sending/receiving cryptocurrencies and conveniently converting them to your desired cash or outlet. Yun yung reason kung bakit patuloy ko pa rin ginagamit si coins.ph dahil sa convenient na feature na ito.Pero tama ka OP, in the future panigurado na ma-iimplement ito. The fact na nagkakaroon na ng competitor si coins.ph sa platform na ganito means na healthy ang magiging outcome ng BTC dito sa bansa. Siguro ang isa ko pang hinihintay is yung GCash wallet, which I think is going to be the main competitor of coins.ph once it releases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "August 15, 2022, 12:00:02 PM",
      "body": "Quote from: lienfaye on August 11, 2022, 03:12:31 AMAnyway magandang balita ito para sa atin na gumagamit ng crypto. Meron na bang ibang available na alts o Bitcoin pa lang? Base sa email na natanggap ko noong nakaraang buwan, may 14 pang cryptocurrencies sa app nila: ScreenshotQuote from: qwertyup23 on August 13, 2022, 10:11:57 PMSiguro ang isa ko pang hinihintay is yung GCash wallet, which I think is going to be the main competitor of coins.ph once it releases.Considering na magooffer sila ng similar features like Maya, I highly doubt makakapag compete sila with Coins [unfortunately].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "samcrypto",
      "created_time": "August 30, 2022, 10:57:08 AM",
      "body": "Quote from: qwertyup23 on August 13, 2022, 10:11:57 PMSiguro yung biggest issue ko dito is yung lack of its feature of sending/receiving cryptocurrencies and conveniently converting them to your desired cash or outlet. Yun yung reason kung bakit patuloy ko pa rin ginagamit si coins.ph dahil sa convenient na feature na ito.Eto ren talaga ang bad side ng Maya wallet when it comes to cryptocurrency, wala pang update kung kelan ba sila magaactivate ng ganitong feature pero sana pinaghahandaan na nila ito. Bago palang kase talaga si Maya, kakamigrate lang nila as far as I know and siguro, kailangan pa ng maraming license para maging crypto wallet totally. Marame naren naman ang gumagamit because of their higher interest sa savings, yung iba panigurado nagaantay lang sa magiging update ni Maya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}