{
  "id": "topic_5462287",
  "title": "Abbee",
  "author": "Abbee",
  "created_time": "August 06, 2023, 09:31:13 PM",
  "content": "I am a newbie who wants to learn Bitcoin trading. I came across an app called Exness. Exness is an online trading app use for trading cryptocurrency. I really wish you all could help me share more insight about this app and how I can get started with my cryptocurrency journey.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462287",
  "comments": [
    {
      "author": "nelson4lov",
      "created_time": "August 06, 2023, 09:38:30 PM",
      "body": "AFAIK, Exness is a trading platform or a broker that supports crypto and forex markets (mainly forex). With Exness, you can have access to trading terminals like Mt5 (note sure about Mt5). My experience with their deposits and withdrawals was flawless but I'll suggest you first start trading bitcoin and crypto with exchanges since they're a little more beginner friendly and wouldn't take lomg for you to get the hang of things. Exness has diverse market too I'd add.If you are new to crypto trading, try use crypto exchanges first. If you trade forex, then exness since you can trade both from same place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "August 06, 2023, 10:40:37 PM",
      "body": "Why would you use a broker (exness) yet we have crypto exchanges?There are very many crypto exchanges that you can use. This is one of the list of those that are not strict with KYC - https://bitcointalk.org/index.php?topic=5461920.0Then there is this - https://coinmarketcap.com/rankings/exchanges/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "August 06, 2023, 11:28:17 PM",
      "body": "Just give it a try if you want, a minimum of $1 deposit might be the amount that you can afford to lose, of course, don't expect that it will return not to get hurt when it isn't.  That headquarters on that app is from Russia, it could make a problem in the future if you didn't read the terms on it.I recommend using a very well-known trading app than these, it seems like Exness and OctaFx has almost the same features of copy trading but they have different origin.  I found this article comparing between them which I think isn't really good to use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "August 07, 2023, 12:03:24 AM",
      "body": "I tried the Exness app for trading and deposited USDT but I only use it for trading stocks only.On my first trade, I hate their UI/UX, it's really different from some current popular cryptocurrency trading apps. That's why I immediately withdrew my funds from the app.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "August 07, 2023, 01:38:36 AM",
      "body": "Quote from: Abbee on August 06, 2023, 09:31:13 PMI am a newbie who wants to learn Bitcoin trading. I came across an app called Exness. Exness is an online trading app use for trading cryptocurrency. I really wish you all could help me share more insight about this app and how I can get started with my cryptocurrency journey.you're a newcomer who still doesn't understand how bitcoin trading operates. You still lack the necessary supplies to suit your trading journey as a novice, therefore I wish you would calm down and learn thoroughly before choosing to start your trading voyage. As you can see, trading is different from investing, which you can do on a whim, therefore you need to calm down. Although I don't trade, but I believe that they are unsure of this app based on what other who understand trading have said earlier. Just remember what @GreatArkansas said on the Exness trading app you mentioned here; he has tried to use it in the past but it does not perform as well as other trading apps. For this reason, I believe you should start your trading career with a well-known trading app.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "August 07, 2023, 09:57:27 AM",
      "body": "Quote from: GreatArkansas on August 07, 2023, 12:03:24 AMI tried the Exness app for trading and deposited USDT but I only use it for trading stocks only.On my first trade, I hate their UI/UX, it's really different from some current popular cryptocurrency trading apps. That's why I immediately withdrew my funds from the app. There are also some fake trading apps/ websites. I don't remember if I have ever heard about Exness. Since I am not into forex trading, I never tried these apps. But, my friends keep telling me to try Expertoption and some other random apps. I have heard that some members lose their funds in those apps. Not by trading, but those apps never pay. So, I don't really know which one is trusted.I am glad that Exness was not fake and that you could withdraw your funds. There were some scam accusations against webulltradingbots later discovered that be a phishing website. There is another scam platform spreading called MTFE. They did not start scamming yet, but I am 100% sure they will scam and run away with billion dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "August 07, 2023, 10:14:09 AM",
      "body": "As a newbie, I will advice you not to trade with Exness app so that you can learn easily. You can use good exchanges to trade since that is what most traders that are experts uses. Don't rush into trading because there are so many things you need to learn first before you can understand how to read trading charts. You should learn the fundamental analysis and trading analysis of trading. Only if you want to go into stock then you can try Exness app. Don't see trading as a profitable business because you can run at loss. It is better to just hold on to your bitcoin for long in order to make good profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "August 07, 2023, 11:35:41 AM",
      "body": "Quote from: Abbee on August 06, 2023, 09:31:13 PMI am a newbie who wants to learn Bitcoin trading. I came across an app called Exness. Exness is an online trading app use for trading cryptocurrency. I really wish you all could help me share more insight about this app and how I can get started with my cryptocurrency journey.I am not a exness user and never used it before but after doing a little research i can say, its not a Crypto exchange only instead we can do Forex, derivatives and indices Trading here too. Which is not a good sign because as it is not a crypto exchanges only the details of liquidity are not shown on Coingecko and Coinmarketcap either. As a newbie, my recommendations are instead of sticking to brokers like Exness you should attach yourself to crypto exchanges like CEX or DEXs. For example Binance or any other.As you wanted to start your journey in Crypto so starting from other exchanges will be a good idea. But if you wanted to read some reviews then you should visit this site. https://www.exness.global/crypto/#standardQuote from: nelson4lov on August 06, 2023, 09:38:30 PMAFAIK, Exness is a trading platform or a broker that supports crypto and forex markets (mainly forex). With Exness, you can have access to trading terminals like Mt5 (note sure about Mt5).. I think you mistakenly wrote mt5 two times as second time i think you meant to write something else maybe mt6? whatever it might be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "August 07, 2023, 11:42:16 AM",
      "body": "Quote from: Abbee on August 06, 2023, 09:31:13 PMI am a newbie who wants to learn Bitcoin trading. I came across an app called Exness. Exness is an online trading app use for trading cryptocurrency. I really wish you all could help me share more insight about this app and how I can get started with my cryptocurrency journey.Exness is a broker for forex trading and that was their status few years ago I was using them. Whether they have incorporated crypto trading I do not know. When I was using them for forex trading, their deposit and withdrawals was seamless but on the long run when I started using  bot to trade, I felt there was kind of manipulation behind the scene. Although they gave me the opportunity to trade with Cents of Euro but my overall experience was disastrous because I lost all my capitals because of the bot usage.I will strongly advise that if you want to trade cryptocurrency,  you should use the exchanges for a start. Unless there is a strong commission offered you in exness that is tilting your attention to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "August 07, 2023, 12:56:28 PM",
      "body": "Exness application is the same as another trading platform; not only this, but also the Mexc and Binance have trading insight for beginners that helps them to make a trade, it's good to use these features so you can learn to trade, but it's not enough. There's a lot of information on the internet. Just one click away with your search engine search for the videos you want to learn. There are a lot of tutorials, and it is ideal not to limit yourself to those details. For sure, you want to learn more, and one of the idea that come up to you is to join groups but be careful with those scammers who pretends that want to help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "August 10, 2023, 02:16:16 PM",
      "body": "Quote from: Abbee on August 06, 2023, 09:31:13 PMI am a newbie who wants to learn Bitcoin trading. I came across an app called Exness. Exness is an online trading app use for trading cryptocurrency. I really wish you all could help me share more insight about this app and how I can get started with my cryptocurrency journey.If you want to learn Bitcoin trading, Exness is not the type of trading platform you will need as a beginner, often times without numbers I do see there advertisement from Google for reaching more audience which means they don't have more customers as it appears, and more over, without about numbers of trading exchanges that we have, you chose to use an exchange that focus of forex and some crypto tokens, you wouldn't last long in trading with such kind of exchange.If you are looking for better exchange for Bitcoin trading, use Coingecko to filter the top exchanges we have in crypto, by using their trust score, you can pick the best exchange for trading Bitcoin and other altcoins in the market. There is no point in using Exness except you have business with Forex but as you can see some above replies, the exchange is very sluggish and not fast from experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "August 10, 2023, 05:02:52 PM",
      "body": "Quote from: KingsDen on August 07, 2023, 11:42:16 AMI will strongly advise that if you want to trade cryptocurrency,  you should use the exchanges for a start. Unless there is a strong commission offered you in exness that is tilting your attention to them.They are even more trusted and secure than the crypto exchanges when it comes to regulation with security and exchange commission, FSC etc., but the issues are that they are brokers meant for forex trading and any trading done on the platform is basically a future contract, while exchanges gave us the opportunity to trade spot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "August 10, 2023, 05:30:39 PM",
      "body": "Quote from: KingsDen on August 07, 2023, 11:42:16 AMQuote from: Abbee on August 06, 2023, 09:31:13 PMI am a newbie who wants to learn Bitcoin trading. I came across an app called Exness. Exness is an online trading app use for trading cryptocurrency. I really wish you all could help me share more insight about this app and how I can get started with my cryptocurrency journey.Exness is a broker for forex trading and that was their status few years ago I was using them. Whether they have incorporated crypto trading I do not know. When I was using them for forex trading, their deposit and withdrawals was seamless but on the long run when I started using  bot to trade, I felt there was kind of manipulation behind the scene. Although they gave me the opportunity to trade with Cents of Euro but my overall experience was disastrous because I lost all my capitals because of the bot usage.I will strongly advise that if you want to trade cryptocurrency,  you should use the exchanges for a start. Unless there is a strong commission offered you in exness that is tilting your attention to them.I understand that people may want to try new things but they should also remember that there is no need for it. Realizing that this isn't a must is a big deal of the current situation, and I know that it will take a while for people to think that, because they will be hyped about all these marketing stuff and that's going to make it look like it's a big must you should do if you want to make money, but it's not like that at all.Just because there is a hype around something doesn't mean that it's going to be like that all the time. I think it's quite important that we could end up with some sort of situation where it's going to take some time, and because of that we need to make sure that things go a lot better on the long run as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 10, 2023, 08:09:32 PM",
      "body": "Quote from: Abbee on August 06, 2023, 09:31:13 PMI am a newbie who wants to learn Bitcoin trading. I came across an app called Exness. Exness is an online trading app use for trading cryptocurrency. I really wish you all could help me share more insight about this app and how I can get started with my cryptocurrency journey.I have seen the ads of the trading app Exness a couple of times, but I would not recommend such a nameless platform in the market, as if you are really a newbie and want to start your journey you can start with Binance and other leading names. BEcasue the top leading names offer greater stability and features. even though there are a lot of video tutorials for the beginner to start on.To can give it a try as well but don't go for the large deposits because I don't know how responsive this project is. After spending sometime in the centralized platform my advice to you is make a change to the DEx and explore a new self custodial word of this market which is more beautiful haha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}