{
  "id": "topic_5416462",
  "title": "fiulpro",
  "author": "fiulpro",
  "created_time": "October 09, 2022, 07:45:35 AM",
  "content": "Are we heading towards recession or are we in a recession ? According to IMF, International Monetary Find, we are directly heading towards recession and the economy is getting darker and darker. According to them even a positive growth in economy won't feel like a positive growth since : Quote We estimate that countries accounting for about one-third of the world economy will experience at least two consecutive quarters of contraction this or next year,\" said IMF Managing Director Kristalina Georgieva during a speech at Georgetown University, CNN reported.  \"And, even when growth is positive, it will feel like a recession because of shrinking real incomes and rising prices.\"   World can be expected to loose 4 trillion apparently between now and 2026, which is a huge amount. This was already expected to happen the shock waves of the Pandemic, then the War and then Natural disasters in certain Countries. Not only that, we cannot even lay our hands on the risk assets as well : Quote Overall, the economic environment for risk assets is deteriorating. Stagnating global industrial production, persistent cost pressures, and rising financing costs all suggest a prolonged period of low risk appetite Which means : Bonds, commodities, real estate may all fall drastically as well. How can we make sure to survive the fall ? - Can cryptocurrencies work in this environment? -The current ups and downs in cryptocurrencies have certainly made it hard to breathe for the investors-What can we do to make sure we survive the whole economic recession? ( Certainly don't put all your money in the banks ) Read the full article here :  https://www.google.com/amp/s/www.zeebiz.com/economy-infra/world-economy/news-world-could-lose-4-trillion-in-economic-output-between-now-and-2026-worth-size-of-german-economy-imf-202209/amp",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416462",
  "comments": [
    {
      "author": "DVlog",
      "created_time": "October 09, 2022, 08:01:26 AM",
      "body": "Quote from: fiulpro on October 09, 2022, 07:45:35 AMHow can we make sure to survive the fall ? - Can cryptocurrencies work in this environment? -The current ups and downs in cryptocurrencies have certainly made it hard to breathe for the investors-What can we do to make sure we survive the whole economic recession? ( Certainly don't put all your money in the banks ) If I am not mistaken the last bull run started after the worldwide spread of COVID-19. When the stock and forex market was collapsing crypto market was rising. The Crypto market is not like other markets though it has some impact related to those markets. If the stock, bond, and real estate market is going to shrink, people will have no choice but to buy gold, silver, or bitcoin. Everybody wants to keep their asset's PPP power stable.I have a feeling that crypto will get mass adoption within a few years due to hyperinflation. Worldwide, Govt will be forced to recognize crypto as another asset class. This is not the first time mankind had to face a recession so there is no doubt that we will overcome this but the big question will be at what price?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "October 09, 2022, 08:23:38 AM",
      "body": "It is said that recession is when a country enters the abyss of swelling inflation and increasing economic uncertainty, including the high cost of living. The recession allows each country to reduce the workforce. Since the rate hike it has clearly signaled that a recession is in sight.Cryptocurrency 50:50 in this case because of course we have to prepare more cash in order to survive in the midst of the existing recession. However, volatile cryptocurrencies are still an unbalanced value proposition. Currently centralized exchanges for disbursing funds into cash in the midst of a recession are banks likely to close? an example is the case of a woman at a local Lebanese bank, that during the recession they needed cash to support their daily needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "October 09, 2022, 10:30:15 AM",
      "body": "A recession was pretty much expected even without the pandemic and the war in Ukraine.The US economy was running on monetary steroids for over a decade. The amount of US dollars in circulation has reached a historical peak.The European Union got into the Russian gas \"trap\" decades ago, when the Russian gas was cheap. The nations in Europe will have to pay the price for gaining their energy independence. Gas prices in Europe will be higher for a while, but the EU countries will have to reduce gas consumption and find alternatives.Overall, I don't see a recession as a bad time. The economies need recession, in order to get rid of the market deviations and the toxic amounts of greed and optimism.Risk assets like Bitcoin most likely won't perform very well in this recession, which is kinda ironic, because Bitcoin was created after the 2007-2008 recession and Satoshi had the 2008 recession in mind, when he created BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 09, 2022, 11:41:43 AM",
      "body": "Quote from: davis196 on October 09, 2022, 10:30:15 AMA recession was pretty much expected even without the pandemic and the war in Ukraine.The US economy was running on monetary steroids for over a decade. The amount of US dollars in circulation has reached a historical peak.The European Union got into the Russian gas \"trap\" decades ago, when the Russian gas was cheap. The nations in Europe will have to pay the price for gaining their energy independence. Gas prices in Europe will be higher for a while, but the EU countries will have to reduce gas consumption and find alternatives.Overall, I don't see a recession as a bad time. The economies need recession, in order to get rid of the market deviations and the toxic amounts of greed and optimism.Risk assets like Bitcoin most likely won't perform very well in this recession, which is kinda ironic, because Bitcoin was created after the 2007-2008 recession and Satoshi had the 2008 recession in mind, when he created BTC.This is not the full truth. The European Union bought cheap resources in Russia and Russia bought a lot of goods in Europe, and most of the production in Russia used European components and European equipment. In Russia, rallies and strikes are very severely punished, but not in Europe, so they have more problems than in Russia.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "October 09, 2022, 12:07:34 PM",
      "body": "Quote from: naira on October 09, 2022, 08:23:38 AMwe have to prepare more cash in order to survive in the midst of the existing recessionMore cash printing is not a solution to recession because inflation will become high. The solution to recession is to encourage small businesses to grow. Production is a way that recession will not have major effect to the people. This is the time of scarcity but if government support minor businesses that will give families income to hold to until the situation is better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "October 09, 2022, 12:51:49 PM",
      "body": "Quote from: gantez on October 09, 2022, 12:07:34 PMQuote from: naira on October 09, 2022, 08:23:38 AMwe have to prepare more cash in order to survive in the midst of the existing recessionMore cash printing is not a solution to recession because inflation will become high. The solution to recession is to encourage small businesses to grow. Production is a way that recession will not have major effect to the people. This is the time of scarcity but if government support minor businesses that will give families income to hold to until the situation is better.Yes I agree that printing more cash would definitely not gonna be a good idea as inflation will got even more worse than expected. With the limited supply of cryptocurrencies, people are gonna turn into this one because it’s deflationary despite the wild bear and bull swings around the corner. Right now in the Philippines, we are bracing for the worst as we are hitting all-time new lows. Road to 60 Philippine peso per 1 dollar, which was never been reached in the history of our country. We’re feeling it now. As the commodities have increased their prices, but our salaries didn’t increase which is why it’s time not to stick to one income source only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 09, 2022, 01:01:34 PM",
      "body": "Quote from: fiulpro on October 09, 2022, 07:45:35 AMWorld can be expected to loose 4 trillion apparently between now and 2026, which is a huge amount.Note that it is only on paper! It's not as if 4 trillion dollars worth of houses disappears. It all just gets a slightly lower value, which creates new opportunities for others.To quote myself:Quote from: LoyceV on September 30, 2022, 06:24:05 PMI'd say a recession is long overdue.Quote from: LoyceV on September 30, 2022, 08:02:18 AMI blame the BRRR, and somehow they all worry more about a possible recession than about the huge inflation. The entire fiat money system is build on eternal growth, which can't go on forever.Recessions are normal! Negative interest is not. In the past years, it seemed like recessions aren't allowed to happen anymore, while they're just a normal part of a healthy economy. It separates the strong from the weak companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "October 09, 2022, 01:10:34 PM",
      "body": "Quote from: DVlog on October 09, 2022, 08:01:26 AMQuote from: fiulpro on October 09, 2022, 07:45:35 AMHow can we make sure to survive the fall ? - Can cryptocurrencies work in this environment? -The current ups and downs in cryptocurrencies have certainly made it hard to breathe for the investors-What can we do to make sure we survive the whole economic recession? ( Certainly don't put all your money in the banks ) If I am not mistaken the last bull run started after the worldwide spread of COVID-19. When the stock and forex market was collapsing crypto market was rising. The Crypto market is not like other markets though it has some impact related to those markets. If the stock, bond, and real estate market is going to shrink, people will have no choice but to buy gold, silver, or bitcoin. Everybody wants to keep their asset's PPP power stable.IIRC, Crypto dumps hard same as stocks and forex during that time even after the pandemic. The bull run starts same with stocks and forex recovery not what you implying that crypto is the only one pumping. I have both stocks and crypto that time so I’m certain that they are both gaining value at that particular moment. Crypto is just gaining fast that stock market that is why everyone in crypto overlook the event as crypto is only rising and the rest is dumping.I believe whales use this opportunity to create money on crypto since its too much volatile that time while the price is at the bottom. They will low risk of losing of they invest back then since most of the weak hands sold while they are freely scooping cheap tokens in the market like Microstrategy did last bull run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Swordsoffreedom",
      "created_time": "October 09, 2022, 01:12:52 PM",
      "body": "Quote from: davis196 on October 09, 2022, 10:30:15 AMA recession was pretty much expected even without the pandemic and the war in Ukraine.The US economy was running on monetary steroids for over a decade. The amount of US dollars in circulation has reached a historical peak.The European Union got into the Russian gas \"trap\" decades ago, when the Russian gas was cheap. The nations in Europe will have to pay the price for gaining their energy independence. Gas prices in Europe will be higher for a while, but the EU countries will have to reduce gas consumption and find alternatives.Overall, I don't see a recession as a bad time. The economies need recession, in order to get rid of the market deviations and the toxic amounts of greed and optimism.Risk assets like Bitcoin most likely won't perform very well in this recession, which is kinda ironic, because Bitcoin was created after the 2007-2008 recession and Satoshi had the 2008 recession in mind, when he created BTC.What you said reminds me, I also read some predictions by some economists in my area earlier that they predicted an economic crisis will happen in 2020-2021. Maybe the timing isn't completely accurate but what amazes me is that it actually happened and those predictions were made before the pandemic broke out and the war broke out. They say that world economic history always repeats itself and we cannot avoid it, just study history and you can read what will happen in the future. It's actually pretty vague to me but what you said reminds me of these predictions. Crisis or recession will be the end for many empires but an opportunity and opportunity for many others. Sometimes not all is bad, after the rain it will be sunny, so a lot of people are still looking forward to this day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "October 09, 2022, 01:16:40 PM",
      "body": "If we were to see all that has happened in the previous years, I think it is really due to all the issues that are with the world. The wars and saving of different governments for the people. It's going to collapse soon after. I hope no one will be damaged too much, making it hard for people to recover, but I  think it's due, as LoyceV said. If there are even more economic casualties, it will happen sooner, and I believe we are there already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nhazwrath",
      "created_time": "October 09, 2022, 01:22:28 PM",
      "body": "When you print too much money and make borrowing it risk free you are setting yourself up for a crash.  The risk free part lets people throw the money at any old stupid idea. 99% of which fail.So, yes the excess money Will be burnt one way, or another.   This is known as a recession. Its also healthy since bad ideas need to fail.   Supporting bad ideas with more money printing will make your recession worse.  Add in parasitic organizations to make that load heavy. The reason BTC exists at all is due to too much money being printed.  The money printing policy's from the 1970s still exists and we will continue to both benefit from the excess money being printed and thrown at the unicorn ideas and, suffer when they fail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obito",
      "created_time": "October 09, 2022, 01:34:07 PM",
      "body": "I guess the cracks in the system is showing again, if IMF is saying that we will be entering a recession, we probably are so I guess we just have to make sure that we're going to do some preparations, we never know how we are going to be hit with the recession, I just hope that not a lot would suffer so badly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "October 09, 2022, 01:36:43 PM",
      "body": "Quote from: crwth on October 09, 2022, 01:16:40 PMIf we were to see all that has happened in the previous years, I think it is really due to all the issues that are with the world. The wars and saving of different governments for the people. It's going to collapse soon after. I hope no one will be damaged too much, making it hard for people to recover, but I  think it's due, as LoyceV said. If there are even more economic casualties, it will happen sooner, and I believe we are there already. One of other reasons for this such of pending recession is the covid-19. This affected not only the financial aspect of the economy but the human capacity also was reduced and uptil now some countries and cities are finding it difficult to improve in that aspect. It is such a situation that the world is currently struggling with. During the time of covid-19, there were alot of death recorded and this are persons with family and breadwinners so surely it is a great blow to the economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 09, 2022, 02:57:09 PM",
      "body": "Quote from: fiulpro on October 09, 2022, 07:45:35 AMCan cryptocurrencies work in this environment? Let's call things by their right names, because we should be interested in how Bitcoin behaves in the current conditions, not how some alternatives (altcoins/tokens) behave, which are not actually that in the true sense. I would say that Bitcoin is doing quite well, regardless of the apocalyptic announcements of various experts and forum faketoshi trolls. If we look at everything exclusively through profit, Bitcoin was a phenomenal investment for those who know how to achieve maximum profit, and during every bear market, the same questions are always repeated - \"can Bitcoin survive?\"Quote from: fiulpro on October 09, 2022, 07:45:35 AMWhat can we do to make sure we survive the whole economic recession?To adapt to the current situation in all possible ways in order to eliminate from our lives everything that is not necessary. The average person who smokes, drinks alcohol and eats fast food spends a lot of money on these things that are not only unnecessary, but also dangerous to health. Furthermore, if we all complain that fuel is expensive, why not use more bicycles, electric scooters, public transport or walk more? Likewise, if you want to save on heating, you can do so if you dress a little better in your house/apartment and reduce the heating by a few degrees.In fact, recession is not something to be so afraid of, you just have to adapt and accept that nothing is and will not be like 2-3 years ago.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 09, 2022, 03:17:54 PM",
      "body": "If you happen to click the link, it should be going to this page https://www.zeebiz.com/economy-infra/world-economy/news-world-could-lose-4-trillion-in-economic-output-between-now-and-2026-worth-size-of-german-economy-imf-202209/ampThe debate of whether we are going to recession or not had cause wikipedia to suspend edit to its recession page. Recession was expected since the pandemic as Covid disrupted the supply chains and FED increasing and lowering interest rate to cope up with inflation. Jerome Pal kept denying we are in recession but eventually admitted it later on. Well sooner we may find the page of Depression in wiki might also be suspend for editing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 09, 2022, 03:35:27 PM",
      "body": "Quote from: fiulpro on October 09, 2022, 07:45:35 AMAre we heading towards recession or are we in a recession ? I think at a certain point in time we could say we all were onbthe edge to recession in a little bit of time and this can determine weather we go into it or we are out and far away from it, but to say the fact alot of things have gone wrongs in the world economy system and all the giants participants were mostly affected this time, but it has impressed me well as the US is getting it way out pulling the triggers to balance is when the UK begins to experience a tough time with theirs presently and the value of their GBP is almost getting equal to USD, what shall the strongs do when the weak were much already wallowing in economy hardtimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "October 09, 2022, 03:52:29 PM",
      "body": "I love crypto, but I also love realistic approaches! Crypto wont be able to life us up because the system is not readily available to the worldwide population. If we hit the recession then there would be unemployment everywhere and directly/indirectly we will run into chaos of pricey tags everywhere. There will be more holdings than expenditures every capita and thus government's treasury will go down. Food, water, clothes and housing will cost more than normal and thus it will bring down the investments from everywhere. People will start to sell off everything so that they can bear the cost of living. I am afraid but bitcoin wont be invested, rather it would be sold for the good, plus there is already disconnectedness with it from more than half of the population around the world. Definitely it would last resort.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 09, 2022, 05:37:20 PM",
      "body": "They might call it 'like a recession' and who knows, maybe they're even technically right, but if the effects are those of a recession and the economy will suffer similarly, then it's effectively a recession. Yes, I think we're entering one, and it's already pretty bad if we look at inflation that hit even some of the currencies that were considered strong before, but it's probably only the beginning. It's not a sharp drop, explosion-like thing; it's a slow downward slope that does not seem to have an end yet. And, unfortunately, despite the hopes some had that Bitcoin would do well when global economy gets down because people will use it to save what they had in those other markets which are going down, but that doesn't seem to be happening. Cryptos can work in such environment, yes, but they're not doing well as a way of saving people, at least not yet. Who knows, Bitcoin might recover in the middle of it, but it's hard to estimate in advance. I think we're in for tough several years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "October 09, 2022, 08:16:46 PM",
      "body": "Quote from: fiulpro on October 09, 2022, 07:45:35 AMAre we heading towards recession or are we in a recession ? According to IMF, International Monetary Find, we are directly heading towards recession and the economy is getting darker and darker. According to them even a positive growth in economy won't feel like a positive growth since : Quote We estimate that countries accounting for about one-third of the world economy will experience at least two consecutive quarters of contraction this or next year,\" said IMF Managing Director Kristalina Georgieva during a speech at Georgetown University, CNN reported.  \"And, even when growth is positive, it will feel like a recession because of shrinking real incomes and rising prices.\"   World can be expected to loose 4 trillion apparently between now and 2026, which is a huge amount. This was already expected to happen the shock waves of the Pandemic, then the War and then Natural disasters in certain Countries. Not only that, we cannot even lay our hands on the risk assets as well : Quote Overall, the economic environment for risk assets is deteriorating. Stagnating global industrial production, persistent cost pressures, and rising financing costs all suggest a prolonged period of low risk appetite Which means : Bonds, commodities, real estate may all fall drastically as well. How can we make sure to survive the fall ? - Can cryptocurrencies work in this environment? -The current ups and downs in cryptocurrencies have certainly made it hard to breathe for the investors-What can we do to make sure we survive the whole economic recession? ( Certainly don't put all your money in the banks ) Read the full article here :  https://www.google.com/amp/s/www.zeebiz.com/economy-infra/world-economy/news-world-could-lose-4-trillion-in-economic-output-between-now-and-2026-worth-size-of-german-economy-imf-202209/amp It's been said for some time now that a recession is around the corner and it is just about to hit. There was definitely a post Covid boom, but with the Russian war on Ukraine that has thrown everything back out of order after two years of slow recovery. China is still attempting their crazy zero Covid experiment at the same time, which is really not helping the situation and can result in megasize cities going into lockdown overnight on a regular basis. That is simply unsustainable disruption to all kinds of supply chains, but maybe it'll change when dictator Xi Jinping has his little ceremony again this month. Hopefully Russia will simply leave Ukraine and thing can start to go back to normal soon, which might help stabilize the situation, but it feels like wishful thinking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}