{
  "id": "topic_5434561",
  "title": "libert19",
  "author": "libert19",
  "created_time": "January 13, 2023, 07:15:03 AM",
  "content": "...if it isn't stated by casino beforehand, and sometimes it's stated only for dice and not for other games (examples being card games, roulette, slots), in such cases how is it to be calculated?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434561",
  "comments": [
    {
      "author": "swogerino",
      "created_time": "January 13, 2023, 07:21:23 AM",
      "body": "Quote from: libert19 on January 13, 2023, 07:15:03 AM...if it isn't stated by casino beforehand, and sometimes it's stated only for dice and not for other games (examples being card games, roulette, slots), in such cases how is it to be calculated? For the slot machines you have to check the \"Edge\" which is in the description of every slot page before you start playing it.For example if the edge says 3.96% it means that 3.96% of 100% will be for the casino and the rest for the players.However not to be confused that if you play 100 dollars you will get 96.04 dollars back,no,that edge is calculated for a huge number of spins,more than millions of spins in total from all players and from that amount 96.04% is returned to all players,the lucky ones make the big wins,as the slot machine uses RNG -random number generator to do their calculation and no one knows the moment when the slot machine will be in a pay mode.If this is not in the description,do not play at such casinos,the big ones all of them have it in their description page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "January 13, 2023, 11:04:44 AM",
      "body": "Hey @libert19If you playing on provider, they always give you the information like how many deck in the game (for example BJ/BACCARAT) but also they give you some overview for the RTP % too. You should try to see on the \"Information Game\".If you playing in Evolution Games, easy to be find. Just find the setting logo, and you can find it there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klidex",
      "created_time": "January 13, 2023, 04:56:02 PM",
      "body": "Quote from: ryzaadit on January 13, 2023, 11:04:44 AMHey @libert19If you playing on provider, they always give you the information like how many deck in the game (for example BJ/BACCARAT) but also they give you some overview for the RTP % too. You should try to see on the \"Information Game\".If you playing in Evolution Games, easy to be find. Just find the setting logo, and you can find it there.Previously, were you really able to understand and understand what the OP was asking.In essence the OP is asking how to calculate a winning percentage or RTP in a game in a casino. So I think you only need to answer what is asked, not instead offer a gambling or casino place.When it comes to RTP, I'm sure almost all casinos, whether they're trusted, popular or not, definitely have %RTP in every game description.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "January 13, 2023, 06:59:15 PM",
      "body": "Quote from: libert19 on January 13, 2023, 07:15:03 AM...if it isn't stated by casino beforehand, and sometimes it's stated only for dice and not for other games (examples being card games, roulette, slots), in such cases how is it to be calculated? Here's a good explanation of how house edge works and can be calculated. It contains examples for various games. https://easy.vegas/gambling/house-edge-calculationIf you don't want to do the math and the casino doesn't give any hints, your best option is to choose a different one that is a bit more transparent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "January 13, 2023, 09:27:00 PM",
      "body": "Quote from: libert19 on January 13, 2023, 07:15:03 AM...if it isn't stated by casino beforehand, and sometimes it's stated only for dice and not for other games (examples being card games, roulette, slots), in such cases how is it to be calculated? There are some site that offers a free simulator to check the house edge, and also asking the support can make things a lot more simple since the site should disclose it for them to be trusted by the gamblers. I’m not sure though if all the gamblers really concern about the house edge especially if they are already playing with the top site, because honestly I’m not making any effort to know this with the top sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fatunad",
      "created_time": "January 13, 2023, 09:36:32 PM",
      "body": "Some are already giving out links but some YT might be better if we do have this type of question.https://www.youtube.com/watch?v=P8l9FoV1z5ohttps://www.youtube.com/watch?v=Jk2cqYHnJHkHeres some relevant thread for some calculation.https://bitcointalk.org/index.php?topic=4487738.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KTChampions",
      "created_time": "January 13, 2023, 09:55:22 PM",
      "body": "Quote from: libert19 on January 13, 2023, 07:15:03 AM...if it isn't stated by casino beforehand, and sometimes it's stated only for dice and not for other games (examples being card games, roulette, slots), in such cases how is it to be calculated? In some games, the mechanics of the game (and the odds) are obvious - in card games, dice, roulette, etc. and you can make the calculation yourself, and in some games everything is not obvious at all (slots and similar games) and no calculation is possible so the chances (and the house edge) in them are set programmatically. In general, you need to know the probability of all events and the odds that the bookmaker gives if you guessed them - then you can make a calculation in order to understand what is the house edge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "January 13, 2023, 09:58:14 PM",
      "body": "Quote from: Johnyz on January 13, 2023, 09:27:00 PMQuote from: libert19 on January 13, 2023, 07:15:03 AM...if it isn't stated by casino beforehand, and sometimes it's stated only for dice and not for other games (examples being card games, roulette, slots), in such cases how is it to be calculated? There are some site that offers a free simulator to check the house edge, and also asking the support can make things a lot more simple since the site should disclose it for them to be trusted by the gamblers. I’m not sure though if all the gamblers really concern about the house edge especially if they are already playing with the top site, because honestly I’m not making any effort to know this with the top sites. That is true, usually the gambler doesn't check the HE if he is already playing on a reputable site.Not many gamblers are worried about HE. But sometimes it is still good to know the HE being offered by the site.Also, you can compare the HE from those top sites and decide which one of them is worth playing with.Most of the time, you can get the info by checking the details of the game. If not, ask the support of the site.It should readily be available anytime a customer should ask such info. If not, doubt the casino's operations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "January 13, 2023, 11:12:58 PM",
      "body": "It was stated that one of the formula of house edge isHouse edge = 1 - (payout percentage/100) or (1 - payout percentage) * 100%So if the payout percentage of a casino is around 96% then the house edge computation will be:1 - (96/100) = 1 -  .96 = .04 = (converting to percentage) 4%It is as simple as that ,IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hydrogen",
      "created_time": "January 13, 2023, 11:32:57 PM",
      "body": "There are different methods, with varying accuracy.Most calculate house advantage by the percentage below 1.00 a gambler can win at near even odds. Many books will offer 0.96 versus 0.96. Rather than 1.00 versus 1.00. In which case, the house advantage will be considered near to 4% per bet.But if I remember correctly, percentage gains compound over time. Which could carry a potential to negate the 4% house advantage. A more accurate way to calculate house advantage might be to determine bet win versus bet loss percentages. To a certain extent, the biggest advantage the house has is insider industry information and the power to set odds which can sometimes be misleading and inaccurate. There are sporting events where 2:1 underdogs should be betting favorites. The odds often do not reflect accurate statistics. Its a point bookmakers rely on, to fool gamblers who fail to realize odds often do not reflect mathematical probability.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "January 14, 2023, 06:09:22 PM",
      "body": "Quote from: TimeTeller on January 13, 2023, 09:58:14 PMQuote from: Johnyz on January 13, 2023, 09:27:00 PMThere are some site that offers a free simulator to check the house edge, and also asking the support can make things a lot more simple since the site should disclose it for them to be trusted by the gamblers. I’m not sure though if all the gamblers really concern about the house edge especially if they are already playing with the top site, because honestly I’m not making any effort to know this with the top sites. That is true, usually the gambler doesn't check the HE if he is already playing on a reputable site.Not many gamblers are worried about HE. But sometimes it is still good to know the HE being offered by the site.Also, you can compare the HE from those top sites and decide which one of them is worth playing with.Most of the time, you can get the info by checking the details of the game. If not, ask the support of the site.It should readily be available anytime a customer should ask such info. If not, doubt the casino's operations.Maybe those players do only care about having fun and usually the one that cares about the house edge are the gamblers who are serious about winning a profit. In each site, there must be a button or a tab to check the house edge of the games. Sometimes it is also stated on their ann thread here in the forum. If not then we can follow the advice of @Johnyz or by you, which is to inquire on the casino's customer support. There is no point of hiding the house edge since the player can still play that game as all can still be dependent on luck. As long as the gambler is lucky then he can win no matter how high the house edge was. He can also lose even if the house edge is at its lowest point already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "January 14, 2023, 09:29:46 PM",
      "body": "Quote from: Hydrogen on January 13, 2023, 11:32:57 PMThere are different methods, with varying accuracy.True there are lots of ways how to present house edge calculation some of it are:House Edge = 100% - Payout PercentageHouse Edge = (1 - (payout ratio / average bet)) x 100%House Edge = (odds against winning - 1) / odds against winningHouse Edge = (Probability of Losing x Loss per Loss) / (Probability of Winning x Payout per Win)House Edge = (Probability of Losing x Loss per Loss) / (Probability of Winning x (Payout per Win - 1))Quote from: Hydrogen on January 13, 2023, 11:32:57 PMA more accurate way to calculate house advantage might be to determine bet win versus bet loss percentages. To a certain extent, the biggest advantage the house has is insider industry information and the power to set odds which can sometimes be misleading and inaccurate. There are sporting events where 2:1 underdogs should be betting favorites. The odds often do not reflect accurate statistics. Its a point bookmakers rely on, to fool gamblers who fail to realize odds often do not reflect mathematical probability.In addition it is also stated that each game has its own house edge formula for calculating house edge like for example:Slot machines: House Edge = (100 - payout percentage) / 100Blackjack: House Edge = (total number of decks x (0.5% - 0.8%)) / (number of decks remaining in the shoe)Roulette: House Edge = (number of zero pockets on the wheel / total number of pockets on the wheel) x 100%Baccarat: House Edge = (number of decks x (14.36% - 1.17%)) / (number of decks remaining in the shoe)Craps: House Edge = (total number of bet possibilities x (1 - (payout ratio / average bet))) x 100%Video Poker: House Edge = (100 - payout percentage) / 100We can see more example in this link: https://easy.vegas/gambling/house-edge-calculation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 14, 2023, 09:44:35 PM",
      "body": "The casino has to provide what is the value of the house edge for their table games, like dice, roulette, plinko, mines, crash... I would contact support if I couldn't find this information anywhere.Slots, on the other hand, are provided by third party companies, so you have to search for the RTP (return to player) percentage of each of them. So you deduct the RTP value from 100 and reach the house edge result. Example: RTP is 98,5%, so 100 - 98,5 = 1,5% house edge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "January 14, 2023, 10:12:55 PM",
      "body": "Quote from: seleme on January 14, 2023, 09:49:27 PMQuote from: uneng on January 14, 2023, 09:44:35 PMThe casino has to provide what is the value of the house edge for their table games, like dice, roulette, plinko, mines, crash... I would contact support if I couldn't find this information anywhere.Slots, on the other hand, are provided by third party companies, so you have to search for the RTP (return to player) percentage of each of them. So you deduct the RTP value from 100 and reach the house edge result. Example: RTP is 98,5%, so 100 - 98,5 = 1,5% house edge.For pragmatic slots, house edge mentioned inside slot settings, users are able to check exactly set house edge with 2 clicks left below settings option. For other slot providers, checking slotcatalog.com is best idea, each slot has been listed on website has full details included max win, house edge, lines etc. if you can't find it, worry about the casino you are playing with. i also don't think there are players who are actually calculating the house edge if it is not given on their page. it should be readily available to its players. if you will create a poll on this forum about players who are actually calculating HE, i don't think you will get a number.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "January 15, 2023, 10:46:06 PM",
      "body": "Quote from: AmoreJaz on January 14, 2023, 10:12:55 PMQuote from: seleme on January 14, 2023, 09:49:27 PMQuote from: uneng on January 14, 2023, 09:44:35 PMThe casino has to provide what is the value of the house edge for their table games, like dice, roulette, plinko, mines, crash... I would contact support if I couldn't find this information anywhere.Slots, on the other hand, are provided by third party companies, so you have to search for the RTP (return to player) percentage of each of them. So you deduct the RTP value from 100 and reach the house edge result. Example: RTP is 98,5%, so 100 - 98,5 = 1,5% house edge.For pragmatic slots, house edge mentioned inside slot settings, users are able to check exactly set house edge with 2 clicks left below settings option. For other slot providers, checking slotcatalog.com is best idea, each slot has been listed on website has full details included max win, house edge, lines etc. if you can't find it, worry about the casino you are playing with. i also don't think there are players who are actually calculating the house edge if it is not given on their page. it should be readily available to its players. if you will create a poll on this forum about players who are actually calculating HE, i don't think you will get a number.True, I am one of those that are not calculating the house edge.  Too many numbers to consider and the house edge is already declared by the casino on their FAQ and I believe is verified by the one who is giving out licenses, and besides, the result of luck based games is still random. Quote from: seleme on January 14, 2023, 09:49:27 PMQuote from: uneng on January 14, 2023, 09:44:35 PMThe casino has to provide what is the value of the house edge for their table games, like dice, roulette, plinko, mines, crash... I would contact support if I couldn't find this information anywhere.Slots, on the other hand, are provided by third party companies, so you have to search for the RTP (return to player) percentage of each of them. So you deduct the RTP value from 100 and reach the house edge result. Example: RTP is 98,5%, so 100 - 98,5 = 1,5% house edge.For pragmatic slots, house edge mentioned inside slot settings, users are able to check exactly set house edge with 2 clicks left below settings option. For other slot providers, checking slotcatalog.com is best idea, each slot has been listed on website has full details included max win, house edge, lines etc. I think Play N' Go enable different RTP depending on the casino's preference.  Is that correct?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "January 15, 2023, 10:55:58 PM",
      "body": "Quote from: libert19 on January 13, 2023, 07:15:03 AM...if it isn't stated by casino beforehand, and sometimes it's stated only for dice and not for other games (examples being card games, roulette, slots), in such cases how is it to be calculated? May I ask for what purpose? It's just for verifying the fairness of the game?My answer will be considered as another part of the discussion and not related technically to how house edge for slots or RTPs for slots, and roulettes, was being computed, but trust these game providers under reputable gambling sites that everything is really fair at both ends. Not necessary to know things like that as long as you are playing on a well-established and reputable gambling site. Sometimes, a truly high expectation of winning big rises, especially for those confused about the real meaning and possible output of \"over 95% RTP on slots\", as an example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "January 15, 2023, 11:00:50 PM",
      "body": "Quote from: chaser15 on January 15, 2023, 10:55:58 PM~snip~May I ask for what purpose? It's just for verifying the fairness of the game?My answer will be considered as another part of the discussion and not related technically to how house edge for slots or RTPs for slots, and roulettes, was being computed, but trust these game providers under reputable gambling sites that everything is really fair at both ends. Not necessary to know things like that as long as you are playing on a well-established and reputable gambling site. Sometimes, a truly high expectation of winning big rises, especially for those confused about the real meaning and possible output of \"over 95% RTP on slots\", as an example.I think it's reasonable to know the odds of the games you're playing.That should really be one of the most important pieces of information for you to make a bet, but I think it's not that public.It's a good idea to play mostly on games where the odds for the house are the smallest possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 15, 2023, 11:13:24 PM",
      "body": "Quote from: chaser15 on January 15, 2023, 10:55:58 PMQuote from: libert19 on January 13, 2023, 07:15:03 AM...if it isn't stated by casino beforehand, and sometimes it's stated only for dice and not for other games (examples being card games, roulette, slots), in such cases how is it to be calculated? May I ask for what purpose? It's just for verifying the fairness of the game?My answer will be considered as another part of the discussion and not related technically to how house edge for slots or RTPs for slots, and roulettes, was being computed, but trust these game providers under reputable gambling sites that everything is really fair at both ends. Not necessary to know things like that as long as you are playing on a well-established and reputable gambling site. Sometimes, a truly high expectation of winning big rises, especially for those confused about the real meaning and possible output of \"over 95% RTP on slots\", as an example.Some players misinterpret RTP as the chance of winning which is why some of them are whining about not hitting for several bets.  Like ending up in 15 Deadspin while the RTP stated that it is a 96% lol.  Winning chance is different from a return to player and even different from hitting chance.I do agree that it all ends up in trusting the gambling platform on their announced house edge, after all, it is quite too tasky to verify if the housed edge implemented by the casino is the same on what is stated on their website.Quote from: nullama on January 15, 2023, 11:00:50 PMIt's a good idea to play mostly on games where the odds for the house are the smallest possible.True many says that this will give the player a good return in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "January 15, 2023, 11:51:04 PM",
      "body": "Quote from: libert19 on January 13, 2023, 07:15:03 AM...if it isn't stated by casino beforehand, and sometimes it's stated only for dice and not for other games (examples being card games, roulette, slots), in such cases how is it to be calculated? Stake.com has a fairness calculator. But I don't usually check that because I cannot even understand the numbers in it. I am one of those guys that don't care about these critical details and just go directly to gambling.I don't know how to calculate the house edge although, in provability checking, I do it manually by doing 10 rounds per seed. But it doesn't end up with my expectation most of the time because sometimes I win in a good streak or vice versa. Maybe contacting support will be the easiest way to get an explanation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}