{
  "id": "topic_5434659",
  "title": "letteredhub",
  "author": "letteredhub",
  "created_time": "January 14, 2023, 05:50:10 AM",
  "content": "It's being like close to two months now I started getting myself acquainted with the  cryptocurrency trading system, though it has been easy trying learning most things on by yourself but it's being more helpful than never. Yesterday I was given a task to perform on binance so to earn 5 BUSD, first of it kind for me, so I swiftly took up the task, done and dusted it was and I eventually redeemed my 5 BUSD.I had BTC worth of $20 already in my account that I current use to practice a few of the trading techniques and strategy I have been learning on YouTube, and wanted to convert  the 5 BUSD to add to the BTC it took me a very long time to figure it out, as I was back and forth hitting on swap for convert, Lol, cause that was my first time of trying to do conversion of currencies on binance. I have had some similar issues one of which I had to ask for help from the forum  https://bitcointalk.org/index.php?topic=5431865.msg61504029#msg61504029 but on this one I thought to myself hey bro this time you got to do it yourself without seeking for assistance on this very one from the forum else you might flood the forum with so much excessive support questions within a shart frame.I end up discovering the conversion area, and converted the BUSD to BTC at last, I was glad to have done it myself anyway.I guess there are newbies that goes through this difficulties as I do in these early stage of their using the crypto system and it's good seeking for support where there's difficult encountered but at times put in more effort to know it and do it yourself cause one thing I learned and observe from such is that it would help mitigate flooding of some posts/threads that could have been avoided in the forum. I don't know if my perspective is being understood   not that am saying seeking for support ain't necessary but at times put in more effort to do it and know it yourself.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434659",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "January 14, 2023, 06:15:13 AM",
      "body": "Yes, it often takes effort, but instead of striving to earn $25, try to strive to earn $250, and in the longer term, to earn $2,500. I guess you are very young and/or live in a poor country.Try to educate yourself, to have a good income and several sources of income. Besides investing long term in Bitcoin, not trading for $25.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "January 14, 2023, 06:39:21 AM",
      "body": "Quote from: letteredhub on January 14, 2023, 05:50:10 AMbut on this one I thought to myself hey bro this time you got to do it yourself without seeking for assistance on this very one from the forum else you might flood the forum with so much excessive support questions within a shart frame.You don't have to create a new thread each time you get confused, you first search through the forum archives to know if that inquiry has been made before, as it is highly possible someone else has been confused about your current issue.The forum also has a Google Search option you can use to check more broadly. There's a high chance there's an FAQ, or a medium article for what's confusing you.If after all these you do not get an answer, then you are clear to start a thread here on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "January 14, 2023, 10:53:06 AM",
      "body": "There is no effort that will not pay off, everyone must also have a story that will not be enough for one thread to tell how their exploration was when they were beginners. Sometimes have to experience some financial losses just to answer their own curiosity on a platform because other people's explanations are not enough. \"Practice makes perfect\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 14, 2023, 12:06:47 PM",
      "body": "A journey of a thousand miles start with a step, OP it will make more good for you to just begin from somewhere no matter how little because growth is a process that needs time and patience, but create that time to first invest on yourself, build a good and sound knowl in the field or areas you find interesting to you, create that value and it will make room for you in due time, but the learning process would have now been the sacrifice given to achieve the desirable means you have ever wanted to have or get to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "January 14, 2023, 12:12:39 PM",
      "body": "Quote from: Poker Player on January 14, 2023, 06:15:13 AMYes, it often takes effort, but instead of striving to earn $25, try to strive to earn $250, and in the longer term, to earn $2,500. We all have to start from somewhere, everyone won't start at same level. I strongly believe it's better to start with little you have than never started at all waiting for when the big one comes before you wanna start. Trust me, I might end up waiting forever.But as I have started am hopeful of going beyond $2,500 someday!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "January 14, 2023, 12:15:36 PM",
      "body": "In my experience, trading cryptocurrency is a lot like a rollercoaster ride: it takes a lot of effort to get on, but once you're strapped in, all you can do is hold on tight and hope for the best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wapfika",
      "created_time": "January 14, 2023, 12:26:43 PM",
      "body": "Quote from: letteredhub on January 14, 2023, 05:50:10 AMI end up discovering the conversion area, and converted the BUSD to BTC at last, I was glad to have done it myself anyway.I guess there are newbies that goes through this difficulties as I do in these early stage of their using the crypto system and it's good seeking for support where there's difficult encountered but at times put in more effort to know it and do it yourself cause one thing I learned and observe from such is that it would help mitigate flooding of some posts/threads that could have been avoided in the forum. I don't know if my perspective is being understood   not that am saying seeking for support ain't necessary but at times put in more effort to do it and know it yourself.Making your thread short and direct to the point will make reader easily understand your point. Use the bold feature to highlight your main point and split your post into several paragraphs to make your post presentable.Anyway, there’s a feature on Binance which is the lite version that gives a newbie a simple UI for an easy understanding. Probably you use the pro feature which is really a bit hard if you start from scratch. Binance itself has a Binance academy which teach newbie like you how to use the exchange in detailed explanation. It’s better than rely on someone because it’s your own money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "January 14, 2023, 12:40:55 PM",
      "body": "Quote from: letteredhub on January 14, 2023, 05:50:10 AM~ but on this one I thought to myself hey bro this time you got to do it yourself without seeking for assistance on this very one from the forum else you might flood the forum with so much excessive support questions within a shart frame.There is no flooding when you ask genuine questions!If they are all related to the same thing, for example, Binance, you can do it on the same topic, I don't see a problem with it!Of course, it's far better to do your own research than trust an anonymous person on the internet but speaking from a forum user point of view it's far better when topics with any kind of questions are created since not only can others read the solution before they encounter the problem but it also helps with further answers on that kind of problem, as some will take bits of information from this to answer another.To be honest, I would prefer everyone would ask any kind of question rather than falling for a scam or a trick or losing their coins in god knows what way, if it has already been answered someone will link the topic and that's it, far better than the ton of useless spam we have already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BRINIRHA",
      "created_time": "January 14, 2023, 02:04:18 PM",
      "body": "Yes, we always have to try harder at everything. because to gain experience and insight, of course, requires hard work and even we have to sacrifice time.about binance, actually it's been several months since I've also been trading on binance. or rather I bought bitcoin on binance before finally moving it to my personal wallet. But to be honest, I've never tried the converter feature to swap busd to BTC. and now I'm curious whether the swap process is free?maybe I'll give it a try after writing this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Onyeeze",
      "created_time": "January 14, 2023, 02:13:39 PM",
      "body": "As newbies when you have difficulties in your transaction of cryptocurrency, i think the best thing to do is to make a research both off the forum and in the forum before you will proceed of creating new thread, because some of our challenges we might have face, has already being given it's solutions here. So it's Left for us to use the search key to check from one section or board to another to find out the solution, because yesterday i used a search column, i find out many things. That means no cryptocurrency problem we face today that has not being discussed before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "January 14, 2023, 02:31:01 PM",
      "body": "Quote from: BRINIRHA on January 14, 2023, 02:04:18 PMBut to be honest, I've never tried the converter feature to swap busd to BTC. and now I'm curious whether the swap process is free?Trading BTC/BUSD is free on binance (i.e. no extra fee) since a very long time already. You can both buy and sell btc with no extra charges. There are 12 more pairs where you can have no trading fees. Check below reference link for more info.Ref: Binance Launches zero fee bitcoin trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "January 14, 2023, 03:22:13 PM",
      "body": "Quote from: letteredhub on January 14, 2023, 12:12:39 PMWe all have to start from somewhere, everyone won't start at same level. I strongly believe it's better to start with little you have than never started at all waiting for when the big one comes before you wanna start. Trust me, I might end up waiting forever.But as I have started am hopeful of going beyond $2,500 someday!Sometimes it is useful to ask people for their opinion and, of course, draw your own conclusions. If you are a beginner, they will always be able to help here, and no one will reproach you for asking questions.I agree about your strategy; while you are learning, you don't need to risk big sums. You can always earn more as you gain experience, so big sums will always be waiting for you if you are diligent and patient.Good luck!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "January 14, 2023, 06:30:26 PM",
      "body": "Quote from: letteredhub on January 14, 2023, 05:50:10 AM...but on this one I thought to myself hey bro this time you got to do it yourself without seeking for assistance on this very one from the forum else you might flood the forum with so much excessive support questions within a shart frame...This is correct, if you have figured out any issue on your own, it will never be forgotten by you. But in case it will be difficult for you to understand the question you are interested in, you can always use a hint on the forum or Google search. I used YouTube at an early stage of training, where it was possible to reproduce any action step by step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "January 14, 2023, 08:33:41 PM",
      "body": "OP you have unlocked a new difficulty level which will give you a higher reward in the future. I think you are a young guy who is just involved in this huge internet space. Seeking for assistance is not that bad either but first you need to try and find a way to solve the issue on your own. You can learn things quickly and you can grow by doing things by yourself. Quote from: decodx on January 14, 2023, 12:15:36 PMIn my experience, trading cryptocurrency is a lot like a rollercoaster ride: it takes a lot of effort to get on, but once you're strapped in, all you can do is hold on tight and hope for the best.  yeah, you have described it perfectly, once you are hooked into it you can't let it go. But OP is just using an example here with his BUSD converting story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 14, 2023, 08:38:47 PM",
      "body": "Binance is centralized you have to be warned about that, go do your research about decentralized and centralized exchange, I had once tried trading but I think I had more risk than reward facing me.Trading isn’t a flex, I know many people would just want to be known as traders for the pride and everytime they keep losing out in trading. But don’t let me discourage you, if you have learnt well and you feel ok with trading then go on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Outhue",
      "created_time": "January 15, 2023, 02:13:26 PM",
      "body": "20$ is almost nothing, if you want to boost this money up I suggest you should invest it into good altcoin, although many will say otherwise, find a AI project and buy then take profit after 20% or 40%, I managed to turn 20$ into 200$ doing this, most times buy the rumor sell the news always work.You can also start learning trading but it's riskier than the idea above, the choice is yours, there are ways to earn money with crypto but you have to give up something to earn something they say, learn something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "January 15, 2023, 05:01:27 PM",
      "body": "The OP could try as much as he/she wants, but seeking help might reduce the stress and make the realization of the dream faster. I remember when I started investing online, it was not easy, I drilled myself so much because the internet was not like this then where you can have access to information quickly. I knew how stupid I was in finding my path, though I made it eventually, yet I would have sought help if it were to be this time.Even if you know what you think is working for you now, you cannot know everything from a single source, you need multiple sources to gain more experience. So I see no reason why you should not reach out if need be instead of drilling yourself more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}