{
  "id": "topic_5468374",
  "title": "Natsuu",
  "author": "Natsuu",
  "created_time": "September 28, 2023, 03:00:26 AM",
  "content": "So here's the list:MACD = Buy and Sell SignalsRSI= shows when price is overbought and oversoldBollinger Bands= volatility levels9EMA= Short term trends21EMA= Entry and Exit points50 EMA= helpful for Stop loss placement200 EMA= Long-term trendVWAP= Intraday BreakoutsADX= strength of the trendKey note: Just because it is listed does mean you should use it all. All have their purpose and you can just use what resonates with your strategy whether you are a short-term or swing trader. You can just use EMA for signals and confirm it with buy/sell of MACD. The most important is you have a sample data that you're strategy is working and backtested.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468374",
  "comments": [
    {
      "author": "Husires",
      "created_time": "September 28, 2023, 03:51:14 AM",
      "body": "Without giving examples, it will be difficult to understand these indicators, but they are all confirmatory indicators to confirm support and resistance levels and ensure that stop loss orders are in their correct places.Sometimes these indicators are broken, for example, the 200 EMA, although it is a confirmatory measure, it was nevertheless broken when the price exceeded the 30k, reaching 16k.Change the topic content by adding examples so that everyone can enjoy the discussion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "September 28, 2023, 04:44:52 AM",
      "body": "Those indicators won’t help you to be profitable over time. You can plot a few of those on a chart and you will see that at the same time they give both long and short signals.Indicators for me are a good way to enter a trade but you need other methods first. With crypto it’s best to look at the funding rate and open interest. If funding rate is positive and open interest is going up then look for a long using moving averages.This way you cut out many losers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "September 28, 2023, 08:59:09 AM",
      "body": "I do not know why OP mention 9, 21, 50 and 200 EMA. What I expected is to just mention EMA when he has no examples or illustration to include. I see the OP to be a poor way of telling people about indicators, I can easily name more than 10 indicators that can I tell people to use in less than 10 seconds, but not telling the people how it works, that kind of post is a shit post.Even to mention one indicator and explain it indepth is better than to mention many but not explaining anything but them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "September 28, 2023, 09:15:52 AM",
      "body": "Quote from: Oshosondy on September 28, 2023, 08:59:09 AM-snip-I see the OP to be a poor way of telling people about indicators, I can easily name more than 10 indicators that can I tell people to use in less than 10 seconds, but not telling the people how it works, that kind of post is a shit post.I see it the same way. In addition, it must be said that these are standard indicators that are already very well described on all sorts of sites, for example here: 10 trading indicators every trader should know. Every other (online) trading tool usually describes them, too. OP could have taken the trouble to at least roughly describe these indicators or explain why he named exactly these and not others. It should also be pointed out that one indicator by itself is often not a good idea but they are usually combined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cookdata",
      "created_time": "September 28, 2023, 11:09:54 AM",
      "body": "Quote from: Natsuu on September 28, 2023, 03:00:26 AMSo here's the list:MACD = Buy and Sell SignalsRSI= shows when price is overbought and oversoldBollinger Bands= volatility levels9EMA= Short term trends21EMA= Entry and Exit points50 EMA= helpful for Stop loss placement200 EMA= Long-term trendVWAP= Intraday BreakoutsADX= strength of the trendYou made a list of indicators without giving more details about what they do, how to use it, when to use it and the implications. For your information, in that list you compiled, there are leading indicators and lagging indicators, using lagging indicators to confirm your trade without lagging indicators to comfirm your trade makes you lagger person or trader. You will not make anything and if you managed to make anyone, I will say you were lucky with it. The ones you mentioned are  are popular indicators on most exchanges and yet many don't know how to use them together.For indicators, we have the lagging and the leading, they all have their own merit and demerit, when to use them and when not to use them. The leading ones for example helps you comfirm a trend or direction of your trade before it happen while the lagging will only work after a trend has been confirmed. So, you see that when you choose lagging to comfirm trades, you will always be behind other trades, they always see dangers before you and will quickly exit and take profit before you in the market.The only leading indicator I know from your list is the RSI and the rest of them are lagging indicators. You don't need all of them to be an expertise in trading though.QuoteKey note: Just because it is listed does mean you should use it all. All have their purpose and you can just use what resonates with your strategy whether you are a short-term or swing trader. You can just use EMA for signals and confirm it with buy/sell of MACD. The most important is you have a sample data that you're strategy is working and backtested.200MA is not suitable for hourly or daily candle of a newly launched pair coins on exchange, it takes weeks of candles and monthly before they pop up. However, I think 21, 50 EMA, Bollinger Band, Macd and RSI are enough to enjoy trading except for premium indicators that you may want to add for professionalism, but they are not necessary to have them in your chart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BigBos",
      "created_time": "September 28, 2023, 01:07:00 PM",
      "body": "Quote from: Natsuu on September 28, 2023, 03:00:26 AMKey note: Just because it is listed does mean you should use it all. All have their purpose and you can just use what resonates with your strategy whether you are a short-term or swing trader. You can just use EMA for signals and confirm it with buy/sell of MACD. The most important is you have a sample data that you're strategy is working and backtested.OK, now you have given the list, so what is it just a name and not explaining further and its implementation in real trading conditions? If you really know and believe that each method or technique above is a powerful technique, you should be able to easily explain the advantages and disadvantages here.Looking for indicators is easy, just use the search field on Google, but implementing them clearly requires something more to master them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "September 28, 2023, 01:46:21 PM",
      "body": "@OP better you provide an example for all trading indicators so you can help other newbies too like how they understand the basic concept. Before I created a trading strategy with the MACD if you want you can check it, also indicators given can be adjustable base on the users trading habit. [GUIDE]Moving Average Convergence Divergence (MACD)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jeraldskie11",
      "created_time": "September 28, 2023, 02:40:02 PM",
      "body": "Honestly, if you don't know how to interpret the chart without these indicators, they won't function very well. Therefore, it is preferable to learn how to read candlesticks and recognize market structure before applying some of the indicators above so that you will know when to employ them.You might have also forgotten to include RSI and Volume. These are the best indicators I have ever used in trading. We have to learn how to use these indicators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "September 28, 2023, 07:49:33 PM",
      "body": "These are all good indicators but you also need to know the amount you need to use them with, not the names. There isn't an automatic calculation based on just names, like you know Bollinger bands but should you buy it when it's under 20, or 30 or 10? That matters and depending on who you ask, the answer may change.Or better yet, not all will show the same thing at all times, which means that you are not going to end up with something that could change on the short term, and that means you need to pick one of them and assume that is the one that shows the right one. So it's not that easy, knowing the names is the simplest start, takes a minute, but then the rest takes months even years to master being great at it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "September 29, 2023, 12:17:53 AM",
      "body": "Quote from: Natsuu on September 28, 2023, 03:00:26 AMKey note: Just because it is listed does mean you should use it all. All have their purpose and you can just use what resonates with your strategy whether you are a short-term or swing trader. You can just use EMA for signals and confirm it with buy/sell of MACD. The most important is you have a sample data that you're strategy is working and backtested.Exactly, using these basic indicators is already good, no need to use multiple indicators that the purpose or goal is the same. Some indicators these days are based on core indicators or basic indicators, so it's already fine to use these core indicators as it will also help you to understand the indicators from the basic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "September 29, 2023, 12:58:48 AM",
      "body": "Quote from: GreatArkansas on September 29, 2023, 12:17:53 AMExactly, using these basic indicators is already good, no need to use multiple indicators that the purpose or goal is the same. Some indicators these days are based on core indicators or basic indicators, so it's already fine to use these core indicators as it will also help you to understand the indicators from the basic.I mostly focus on trading volume and volume profile indicators (VPVR) which in my opinion, are enough to help me recognizing momentum of the market. Trading volume shows that the market can be nearly bottom or does it have enough momentum and force to move up more.Volume profile can help me to see cohorts where market will move up or down between peaks of volume profile and between two peaks, if the slope is high, market can have very big and quick movement between peaks that can be up or down but usually can cause short squeeze or long squeeze.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "September 29, 2023, 10:09:46 AM",
      "body": "Quote from: Natsuu on September 28, 2023, 03:00:26 AMSo here's the list:MACD = Buy and Sell SignalsRSI= shows when price is overbought and oversoldBollinger Bands= volatility levels9EMA= Short term trends21EMA= Entry and Exit points50 EMA= helpful for Stop loss placement200 EMA= Long-term trendVWAP= Intraday BreakoutsADX= strength of the trendKey note: Just because it is listed does mean you should use it all. All have their purpose and you can just use what resonates with your strategy whether you are a short-term or swing trader. You can just use EMA for signals and confirm it with buy/sell of MACD. The most important is you have a sample data that you're strategy is working and backtested.These basic indicators you posted—you just mentioned what they are, but you didn't give any illustrations of how to use them. And, it seems like you just made this a topic, and it doesn't seem to have helped others here on the forum platform either. I'm sorry, the information you gave here is a bit lacking; it's not wrong with what you posted.You really need to give an example of how the community here in the forum can understand this, especially the newbies entering this industry. You know that the issue of crypto trading here is very broad, and it is not just one night that everyone immediately knows everything about the issue of crypto trading. I hope you also understand what I want to point out to you here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "September 29, 2023, 07:44:45 PM",
      "body": "Quote from: GreatArkansas on September 29, 2023, 12:17:53 AMExactly, using these basic indicators is already good, no need to use multiple indicators that the purpose or goal is the same. Some indicators these days are based on core indicators or basic indicators, so it's already fine to use these core indicators as it will also help you to understand the indicators from the basic.Many advanced indicators have been developed and refined. I use a variety of indicators that are suitable for my own trading style. You can combine several indicators and it will be better. Basic indicators need to be known first before using advanced indicators. I am also still learning to analyze, and of course trading knowledge will continue to grow, basic is the basis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natsuu",
      "created_time": "September 30, 2023, 01:46:59 PM",
      "body": "I appreciate all your kind and straightforward feedback! I will surely repost this topic with enough illustrations of how to use it. I'm still gathering data so  I hope you have the patience to tag along when I publish it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "September 30, 2023, 02:10:37 PM",
      "body": "Quote from: Natsuu on September 30, 2023, 01:46:59 PMI appreciate all your kind and straightforward feedback! I will surely repost this topic with enough illustrations of how to use it. I'm still gathering data so  I hope you have the patience to tag along when I publish it. These all are the popular indicators which we learn about when we first come into trading. And, OP please Include some chart examples so we can understand easily how the inidcator looks and works on real charts.Share the win rate of specific indicator by backtesting 100trades so we can know which indicator have high win rate.Every indicator shows different signals on different charts because if their volatility, volume, etc.Like signals of indicator will very on stock market and bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 30, 2023, 02:16:01 PM",
      "body": "Good to know that you are sharing your knowledge. As a trader, I know those indicators and am quite familiar with it. The least indicator that I know is VWAP and I haven't used it too much. There are a lot of ways you could combine that. The best way that you could do this is to have an experiment and have different combinations like these.EMA and MACDBollinger Bands and MACD EMA and ADXBB and ADXAnything on the list would be great. It's up to the market and how you are going to use it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "September 30, 2023, 02:23:40 PM",
      "body": "In whatsoever indicator you have decided to use, always remember that there's always a risk in any of them and how we are able relate the informations on them will be the determination of what we are going to have, it's always easier when making use of the trading indicators to help us track the market to our own satisfaction and get the best results from it, bitcoin trading has alot of demands it requires to have the best speculation for it and part of them is what OP had just highlighted, we can also go through the use of the trading chart to understand more better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cute nmp",
      "created_time": "September 30, 2023, 03:07:18 PM",
      "body": "Best indicators i use are the moving averages ,Bollinger bands and the Rsi. I am not a fan of using much indicators on my chart but these are the few ones i use with basic price action and I'm able to make consistent profits from time to time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DVlog",
      "created_time": "September 30, 2023, 03:34:20 PM",
      "body": "Quote from: Natsuu on September 28, 2023, 03:00:26 AMSo here's the list:MACD = Buy and Sell SignalsRSI= shows when price is overbought and oversoldBollinger Bands= volatility levels9EMA= Short term trends21EMA= Entry and Exit points50 EMA= helpful for Stop loss placement200 EMA= Long-term trendVWAP= Intraday BreakoutsADX= strength of the trendKey note: Just because it is listed does mean you should use it all. All have their purpose and you can just use what resonates with your strategy whether you are a short-term or swing trader. You can just use EMA for signals and confirm it with buy/sell of MACD. The most important is you have a sample data that you're strategy is working and backtested.You have provided an EMA (Exponential Moving Average) indicator with custom settings without any explanation or strategy on how to use them. There are countless ways these custom settings can be used. Only by indicating their behavior won't you show a clear picture and as you have titled \"Basic indicators that are very helpful and you may don't know yet...\" will give the audience a false impression as these indicators are widely popular and known by most of the traders. I was expecting some basic but new type of indicator which these aren't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}