{
  "id": "topic_5477897",
  "title": "GazetaBitcoin",
  "author": "GazetaBitcoin",
  "created_time": "December 14, 2023, 02:41:31 PM",
  "content": "For a while now I keep receiving this warning when I am receiving some PMs, from various forum users:I started noticing this at the beginning of the year. At least, since then, quite often I see this warning displayed at the header of the PMs I receive. The warning is incorrect, as many of these PMs don't even contain a link. And I see this warning at PMs I receive from users I did not know before and also at the PMs I receive from users with very high reputation on the forum (which are very less likely to try such maneuvers).Furthermore, other users also told me they saw this warning, including at the PMs I sent to them.I believe that some signal is activating incorrectly at Cloudflare... maybe due to a recent change they made... I suspect it's that, because I did not see such warnings before 2023 (at least not so often). Are there other users encountering this? Or does anyone know the source of the issue?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477897",
  "comments": [
    {
      "author": "Mitchell",
      "created_time": "December 14, 2023, 02:54:05 PM",
      "body": "Has nothing to do with CloudFlare, which would be quite concerning. IIRC, this is something theymos added a while ago.I recently saw it as well when someone sent me a PM quoting an image + link that I added:Quote",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "December 14, 2023, 03:41:57 PM",
      "body": "This issue has already been discussed in this topic Warning in PM, is this a new feature?. There is also a comment from theymos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "December 14, 2023, 03:44:34 PM",
      "body": "Thank you. Time to lock the topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}