{
  "id": "topic_5419164",
  "title": "thanhdt",
  "author": "thanhdt",
  "created_time": "November 02, 2022, 09:50:17 AM",
  "content": "In a few days, we will release  Japanese gabling game call tabsai based on the TYEN token on MATIC network.The game rule is quite simple:- The game start with host game and players- The host will throw 3 dices - Base on the result of 3 dices, the host or players can be recorded as winner- The rule mostly based on the wiki site: https://ja.m.wikipedia.org/wiki/%E3%82%BF%E3%83%96_(%E8%B3%AD%E5%8D%9A)We are working with cryptogambling to get the certificate for a fair system.Before getting the certificate, we post here the algorithm to get the dice resultCode:function randomDice(seed, failPercent = 5) { // fail percent -> dice out of table  percentSeed = seed.slice(0, 4);  percentInt = parseInt(percentSeed, 16);  percent = percentInt % 100;  if (percent <= failPercent) {    return 0;  }  diceInt = parseInt(seed, 16);  return 1 + (diceInt % 6);}function throwDice(salt, msg) {  const hmac = crypto.createHmac(\"sha256\", salt);  hmac.update(msg);  seed = hmac.digest(\"hex\");  console.log(seed);  seed1 = seed.slice(0, 10);  seed2 = seed.slice(10, 20);  seed3 = seed.slice(20, 30);  dice1 = randomDice(seed1);  dice2 = randomDice(seed2);  dice3 = randomDice(seed3);  return [dice1, dice2, dice3];}Hope you enjoy the game.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5419164",
  "comments": [
    {
      "author": "AB de Royse777",
      "created_time": "November 02, 2022, 09:57:23 AM",
      "body": "Quote from: thanhdt on November 02, 2022, 09:50:17 AMThe game rule is quite simple:- The game start with host game and players- The host will throw 3 dices - Base on the result of 3 dices, the host or players can be recorded as winner- The rule mostly based on the wiki site: https://ja.m.wikipedia.org/wiki/%E3%82%BF%E3%83%96_(%E8%B3%AD%E5%8D%9A)The contents of the link are in Japanese language I assume. It's hard to get the idea of the game both from your description and the code you provided (or algorithm). Is there any YouTube version available online to watch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "November 02, 2022, 01:21:59 PM",
      "body": "Quote from: thanhdt on November 02, 2022, 09:50:17 AMIn a few days, we will release  Japanese gabling game call tabsai based on the TYEN token on MATIC network.The game rule is quite simple:- The game start with host game and players- The host will throw 3 dices - Base on the result of 3 dices, the host or players can be recorded as winner- The rule mostly based on the wiki site: https://ja.m.wikipedia.org/wiki/%E3%82%BF%E3%83%96_(%E8%B3%AD%E5%8D%9A)Although your link is in Japanese, but with a translator you can see that \"There is currently no element with this name in Wikipedia\" so either the description of the tabsai game was not added to the wiki, or it was deleted after editing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thanhdt",
      "created_time": "November 02, 2022, 01:40:52 PM",
      "body": "Hello,This game almost target to Japanese user because it is traditional game of Japanese.We are making the website with English version as well. We will keep it posted hereThanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "November 02, 2022, 02:00:03 PM",
      "body": "Quote from: thanhdt on November 02, 2022, 01:40:52 PMThis game almost target to Japanese user because it is traditional game of Japanese.We are making the website with English version as well. We will keep it posted hereI am not sure if there is a Japanese local board. You are saying it's targeting the Japanese users, then you may need to consider creating another thread in your language on the local board. You will get better response than here.I have no idea how to play the game. Not even form the rules you wrote on your OP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eureka_07",
      "created_time": "November 02, 2022, 02:27:14 PM",
      "body": "Quote from: thanhdt on November 02, 2022, 09:50:17 AM<snip>From your explanation, it looks like a hi-lo dice to me. Any specifics which differs this game from other games?Is the direct translation of the Japanese word \"tabsai\" is \"sure\"? I tried to look for this game but for some reason there are no results showing related to game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "November 02, 2022, 02:28:56 PM",
      "body": "Quote from: thanhdt on November 02, 2022, 01:40:52 PMHello,This game almost target to Japanese user because it is traditional game of Japanese.We are making the website with English version as well. We will keep it posted hereThanksThere are a lot of interesting things coming out of Japan and this one could be one of them, I'm looking forward to seeing how it works and the whole concept, it's better to see it when the site is up with the English version who knows if the game is really that good and game providers will add this game, looking forward to your official announcement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "QueenVera",
      "created_time": "November 02, 2022, 02:42:54 PM",
      "body": "Quote from: thanhdt on November 02, 2022, 01:40:52 PMHello,This game almost target to Japanese user because it is traditional game of Japanese.We are making the website with English version as well. We will keep it posted hereThanksJapan has been one of my most respected places, and having you guys getting involve in this, then I'm certain it will awesome .I hope an English version to everything you guys do is also published so as to enhance participation from none japanese speaking individuals.Wishing you guys goodluck and aso hoping to get the best out of what you have to offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "November 02, 2022, 02:49:12 PM",
      "body": "Wikipedia link is brokenQuote from: Eureka_07 on November 02, 2022, 02:27:14 PMQuote from: thanhdt on November 02, 2022, 09:50:17 AM<snip>From your explanation, it looks like a hi-lo dice to me. Any specifics which differs this game from other games?Is the direct translation of the Japanese word \"tabsai\" is \"sure\"? I tried to look for this game but for some reason there are no results showing related to game.My educated guess would be Sic Bo, although it's Chinese. Played with 3 dice as wellhttps://en.wikipedia.org/wiki/Sic_bo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "November 02, 2022, 05:29:52 PM",
      "body": "I don't know what game this is but I would like to know what this game will be once it is finished. Anyway, just base on the op like the game use three dice which UserU guess that it could be sicbo game which OP might be creating and my guess is kind of the same which also use three dice that is called ceelo. I might be wrong about my guess but I think it might be what op want to make since it is also played in japan too.https://en.wikipedia.org/wiki/Cee-loThe Wikipedia link is indeed broken. Even if it's Japanese language, I still have no problem with it as you can just change the \"JA\" in the link to \"EN\" to change it to english",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 02, 2022, 09:12:18 PM",
      "body": "This is new and the explanation OP provided did not provide anything I ask him to just gave a full description of the game while checking the internet for available information about this tabsai game I stumble this http://www.tabsai.com/do you own this website its a newly registered domain Domain:tabsai.comRegistrar:GMO Internet, Inc. d/b/a Onamae.comRegistered On:2022-09-08Expires On:2023-09-08Updated On:2022-10-13Status:okAnyway, it's better to wait I want a clear picture of the game, it can only happen when you launch your site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "November 02, 2022, 09:17:25 PM",
      "body": "Quote from: BitcoinGirl.Club on November 02, 2022, 02:00:03 PMQuote from: thanhdt on November 02, 2022, 01:40:52 PMThis game almost target to Japanese user because it is traditional game of Japanese.We are making the website with English version as well. We will keep it posted hereI am not sure if there is a Japanese local board. You are saying it's targeting the Japanese users, then you may need to consider creating another thread in your language on the local board. You will get better response than here.I have no idea how to play the game. Not even form the rules you wrote on your OP.Hopefully, this is just another of those \"lost in translation\", maybe what he meant is that of course they will target the Japanese audience, but it's better if they can expand their horizons for non-Japanese as well?I think it will be good though as many gamblers will like to try local games as well.So good luck to the OP and hopefully you will can some traction amongst gamblers here (Japanese and non-Japanese).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "November 02, 2022, 09:26:04 PM",
      "body": "This can be more interesting if it’s explained well and the site with the option of English language. Well, I hope you consider this OP as you are still at the stage of developing. Many will surely get interested here as long as they see the fun here. Create a good crypto gambling site, state everything on your terms and conditions and post here again for the highlights of the site, better also if you are going to add other game as well in the site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "November 02, 2022, 09:45:22 PM",
      "body": "Quote from: goaldigger on November 02, 2022, 09:26:04 PMThis can be more interesting if it’s explained well and the site with the option of English language. Well, I hope you consider this OP as you are still at the stage of developing. Many will surely get interested here as long as they see the fun here. Create a good crypto gambling site, state everything on your terms and conditions and post here again for the highlights of the site, better also if you are going to add other game as well in the site.Yes, the OP should read the suggestions here. And the basic one is to have english language for this game.As he posted this on this forum, I am also expecting that they will be listening to suggestions here. This is to expand their reach to get global players. We will see how this site will progress...The wiki link is in japanese, so let's wait if they will have english option on their game itself. Otherwise, they can post this on their local section. It is a new game for most people here, so it may attract interest once they launched it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 02, 2022, 10:59:53 PM",
      "body": "Quote from: thanhdt on November 02, 2022, 09:50:17 AMIn a few days, we will release  Japanese gabling game call tabsai based on the TYEN token on MATIC network.The game rule is quite simple:- The game start with host game and players- The host will throw 3 dices - Base on the result of 3 dices, the host or players can be recorded as winner- The rule mostly based on the wiki site: https://ja.m.wikipedia.org/wiki/%E3%82%BF%E3%83%96_(%E8%B3%AD%E5%8D%9A)We are working with cryptogambling to get the certificate for a fair system.Before getting the certificate, we post here the algorithm to get the dice resultCode:function randomDice(seed, failPercent = 5) { // fail percent -> dice out of table  percentSeed = seed.slice(0, 4);  percentInt = parseInt(percentSeed, 16);  percent = percentInt % 100;  if (percent <= failPercent) {    return 0;  }  diceInt = parseInt(seed, 16);  return 1 + (diceInt % 6);}function throwDice(salt, msg) {  const hmac = crypto.createHmac(\"sha256\", salt);  hmac.update(msg);  seed = hmac.digest(\"hex\");  console.log(seed);  seed1 = seed.slice(0, 10);  seed2 = seed.slice(10, 20);  seed3 = seed.slice(20, 30);  dice1 = randomDice(seed1);  dice2 = randomDice(seed2);  dice3 = randomDice(seed3);  return [dice1, dice2, dice3];}Hope you enjoy the game.hello thanhdt, I'm a casino developer and i fully understand the provably fair engines.The issue with your code is we don't know how you build your seed, and that process should involve the customer. Let me explain the difference.If the seed is build with sha256(ClientSeed+ServerSeed+BetNumber) then the site is provably fair.If the seed is provided only by the server, then it could be rigged by skipping to the next roll.I hope this information helps in your certification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fortunecrypto",
      "created_time": "November 02, 2022, 11:01:48 PM",
      "body": "Quote from: thanhdt on November 02, 2022, 01:40:52 PMHello,This game almost target to Japanese user because it is traditional game of Japanese.We are making the website with English version as well. We will keep it posted hereThanksSince you posted it here and introduced this Tabsai game, I'm sure you are going to have an announcement thread here to invite players to your English version, it's hard for us to relate to this kind of game because you did not post a clear description about the game I suggest that you create a Youtube video explainer for this so once the site is up we have a reference on what the game is all about, a video can explain what a thousand words can't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "November 03, 2022, 05:08:01 AM",
      "body": "Quote from: thanhdt on November 02, 2022, 01:40:52 PMHello,This game almost target to Japanese user because it is traditional game of Japanese.We are making the website with English version as well. We will keep it posted hereThanksinterested in the game, want to see what traditional japanese games can be played for gambling, i think you need to prepare also in several languages because it might be a unique game that has never existed on other gambling sites, at least english is also needed for the public, but whatever it is I will monitor this thread to see the progress of the tabsai game",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "delfastTions",
      "created_time": "November 03, 2022, 07:13:24 AM",
      "body": "Quote from: piebeyb on November 03, 2022, 05:08:01 AMQuote from: thanhdt on November 02, 2022, 01:40:52 PMHello,This game almost target to Japanese user because it is traditional game of Japanese.We are making the website with English version as well. We will keep it posted hereThanksinterested in the game, want to see what traditional japanese games can be played for gambling, i think you need to prepare also in several languages because it might be a unique game that has never existed on other gambling sites, at least english is also needed for the public, but whatever it is I will monitor this thread to see the progress of the tabsai gameI really like that with the help of your efforts, many people in the world just even learn about games that are popular in other countries.  Japan for most BTT users is a very mysterious, exotic and distant country.  And of course no one knows the culture of Japan well, and it goes without saying what traditional games of chance the Japanese play.  I will also follow this thread because it is interesting to try to play this new game for most of the BTT community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "November 03, 2022, 09:13:32 AM",
      "body": "Quote from: thanhdt on November 02, 2022, 09:50:17 AMHope you enjoy the game.Wow!!! Game that you have not even launched, and we have not even played to Know whether is good or not and you are asking, we enjoyed the game. Is it an imagination game? To answer your question, I didn't enjoy the game.By the way, be fair in dealing with customers to have good reputation in the casino space or world. Your yes should be your yes and your no should be your no. When the website is launched, you can still update this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "November 03, 2022, 11:39:53 AM",
      "body": "Quote from: robelneo on November 02, 2022, 09:12:18 PMDomain:tabsai.comIt's Japanese, no idea about the language. It could own by them or someone else. But I see Dice, money, game tables. Maybe it's their site since in the topic they have similar discussion for the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}