{
  "id": "topic_5439384",
  "title": "Queentoshi",
  "author": "Queentoshi",
  "created_time": "February 10, 2023, 07:42:57 PM",
  "content": "I felt like seeing a movie and opened my streaming app (Netflix) to make a selection of a movie to see and I became confused which to select because of the many choices that I saw. I immediately had this thought that it is the same way people who have the interest of investing in cryptocurrency become confused the one to invest in when they find out that there is bitcoin and many other altcoins. Many people become confused and make mistakes because of the many options they have in cryptocurrency, they fail to invest in bitcoins because they think that there are many other very good options. Do you agree that more people will choose to invest in bitcoins if there were not so many cryptocurrency choices although not all are good?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439384",
  "comments": [
    {
      "author": "bitmover",
      "created_time": "February 10, 2023, 07:57:34 PM",
      "body": "Quote from: Queentoshi on February 10, 2023, 07:42:57 PMDo you agree that more people will choose to invest in bitcoins if there were not so many cryptocurrency choices although not all are good?Bitcoin is unique. Those altcoins are 99% crappy, and the 1% that is better is not even similar to bitcoin.Bitcoin is the only one that is permitionless, borderless and censorship-resistant. And people need it, and they will chase it.Not to invest and become rich, but to protect themselves and their property.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "February 10, 2023, 08:02:04 PM",
      "body": "People buy bitcoin to escape fiat slavery & government control. People buy altcoins to get more fiat or to convert into bitcoin. They are not the same, bitcoin maxis are totally different to altcoin investors. Obviously if there are less alts it suggests the price of bitcoin will be higher.Sometimes altcoin guys need to get totally rekt first to give them the push to be bitcoin only. It’s a painful experience for some guys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "February 10, 2023, 08:08:21 PM",
      "body": "I don't think it's about the sheer number of coins. The main competitors of Bitcoin in terms of attracting investment are the large coins like ETH or DOGE. Some fresh shitcoin that was created 3 days ago will only attract thousands of dollars in investment, while the big shitcoins attract hundreds of millions.Shitcoins will remain popular because Bitcoin became too boring for trading addicts, they want more volatility and more opportunities to get rich quick. Perhaps many of such investors wouldn't invest in Bitcoin anyway, and would go for some other high risk assets like penny stocks or derivatives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BRINIRHA",
      "created_time": "February 10, 2023, 08:10:02 PM",
      "body": "if people really want a Decentralized system then even if the person sees more choices in cryptocurrencies (altcoins) but still the person will choose bitcoin. because only bitcoin is truly decentralized. while the others are mostly close to centralized systems. And now I think people are starting to realize the huge difference.But what makes people still choose altcoins is because they want profits that they can achieve quickly even with higher risks. but even now actually trust in bitcoin continues to grow bigger. maybe if the number of choices were fewer then of course bitcoin would really be the most chosen option. even though it's like that now. i.e. even now bitcoin remains the most widely chosen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "February 10, 2023, 08:12:19 PM",
      "body": "There are investors who will prefer altcoins because of the promises the dev team had laid upon. Why some investors buy more tokens is because they are also enticed by the rewards. I don't think its confusion, there is just an opportunity.They are aware there is BTC but when there is the hype about those altcoins and it's time for the bulls, they will allocate some of thier investment to altcoins. Come a time, they will still be back to buy BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "February 10, 2023, 08:14:33 PM",
      "body": "They'll learn from their mistakes soon enough. Bitcoin is well known, a lot of people buy alts for silly reasons too (like \"i can buy a whole one\" when talking about alts like bat and doge).Ultimately, if and when their coins start crashing they'll have to sell up and move to somewhere safer like bitcoin (or leave) but I'd assume those people would be more likely to pick bitcoin then anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "February 10, 2023, 08:21:40 PM",
      "body": "I think it is a thing of choice though. If you have made up your mind to do something and there it comes and you are doing another it seems though you are confused and you are yet to make up your mind for it but in respect to this topic you have raised, if it is someone who has knowledge of what they want then they can not be bothered with the numerous options they have seen. If at that stand, I think doing a little research would be ok to get insight of what they really want to invest in but if you have already done that, you should know that bitcoin has a big advantage over other Cryptos which must not be mistaken for a mismatch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "February 10, 2023, 08:48:22 PM",
      "body": "I don't find any reason to not invest in other altcoins, there are many potential coins around the crypto space. Quote from: Queentoshi on February 10, 2023, 07:42:57 PMMany people become confused and make mistakes because of the many options they have in cryptocurrency, they fail to invest in bitcoins because they think that there are many other very good options. Do you agree that more people will choose to invest in bitcoins if there were not so many cryptocurrency choices although not all are good?Not all are good but some of them are good, but not the best. There is only one best crypto which is bitcoin. If people fail to recognize bitcoin because of other options around them then they are doomed or they don't know what they are doing. A lot more cryptocurrencies will come in the future so there will be no lack of options for people. But choosing the right asset will secure their investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "February 10, 2023, 08:49:20 PM",
      "body": "I assume most people have their main investment in Bitcoin. Although some people invest in altcoins, I guess it is not their main investment but just a side investment. So, too many options of crypto coins won't affect much to people's choice for the main investment. I believe everybody knows that Bitcoin is the only safest coin to invest in for the long term. But since altcoins prices are more volatile that offer the potential for bigger profits, people diversify their assets. Investing in altcoins isn't the wrong choice as long as people know which altcoins deserve to invest in!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "February 10, 2023, 08:50:34 PM",
      "body": "The larger number of cryptocurrencies we have in the market does not stop people from choosing Bitcoin more than every crypto in the market. We know Bitcoin is the only true decentralized crypto and people just need to choose if they want the best or shitcoin.From my own understanding, Bitcoin is the most used cryptocurrency for payment globally and it has always maintained the dominance of 40 - 60% and it still does.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2double0",
      "created_time": "February 10, 2023, 09:01:00 PM",
      "body": "Buying and holding Bitcoins needs patience, a very long term patience that not every trader can afford, at least not the average ones, whereas most altcoins give short term quick profits and once the money gets out, they are done for years and will not perform till the next cycle or may even die. Bitcoin is different, it is out of the reach of these altcoins both in terms of value for money and respect it has due to its price. Comparison is impossible, so thinking that altcoins are hindering the people to choose Bitcoin over them is a myth. For those who love btc, they will buy btc only. And altcoins are good, because when there are no choices, even investors get bored which is why we also see new companies' stocks popping up each day to give us more opportunities or to fetch away our money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coolcoinz",
      "created_time": "February 10, 2023, 09:03:33 PM",
      "body": "I agree with you OP. I've said it years ago when I first joined the market that IMO most altcoins is just noise that's there to distract you and siphon some of the money away from bitcoin. Many of these coins exist only to decrease bitcoin's market cap and leach into it. You could see it in 2018 when a lot of these bitcoin imposters started to come out like BCG, BTG and so on. IMO people who are investing in altcoins are either looking for fast gain (pump and dump) ore are hedging against bitcoin, or at least trying to. A good example of a hedging altcoin is XRP but I don't think it's going to come out on top.  don't own any XRP, I see no reason to go against bitcoin. If bitcoin fails XRP and other hedges will fail as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "February 10, 2023, 09:08:01 PM",
      "body": "Why did you use Netflix though? You can't make money watching Netflix and people choose different type of crypto projects when building a money-making portfolio, we are told not to put all eggs in one basket just in case, but when it comes to Netflix there is no money involved, I can either watch adventure or action movies, just find what suits or hungry you.Bitcoin gives investors more confidence in doubt but one movie can't give you same thing because you can't keep watching one movie over and over, poor comparison IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "February 10, 2023, 09:14:24 PM",
      "body": "Quote from: Queentoshi on February 10, 2023, 07:42:57 PMDo you agree that more people will choose to invest in bitcoins if there were not so many cryptocurrency choices although not all are good?Can't agree with that. It is the same with all the other things in life too. There will always be people who will be willing to invest in other crypto or alts. Otherwise, how could someone know that if they are bad or good. Let's say from your example. Movies right. Even if you find one movie worth watching, are you going to watch that over and over? And also how are you going to make sure that particular one is good and others are bad if you haven't watched them yet? After sometime in crypto world, people who are investing in shit coins are also investing in bitcoin too. But they are spreading their vision towards other side. When there are only countable few left, after trying them, investors will move towards Bitcoin for sure if they are not making any profits from those alts, and they know the future what Bitcoin holds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "February 10, 2023, 09:18:16 PM",
      "body": "Quote from: Queentoshi on February 10, 2023, 07:42:57 PM Do you agree that more people will choose to invest in bitcoins if there were not so many cryptocurrency choices although not all are good?Obviously!If you have only two types of ice cream in the shop customers will for sure buy more of those brands than if you would have 100 different types.The moment there are multiple coins in which to invest even if the majority would keep most of their investment tied to bitcoin they will still spend a few $ here and there on altcoins, so cutting down that supply would for sure drive more money into BTCAnd there s another thing, some choose to invest in other tokens because they know that if they are lucky they will hit the jackpot, there is no way for BTC to get the same return as some of these tokens, for example, Shiba Inu went 46,000,000% in 2021, so some are thinking of selecting 100 coins, putting 1$ in one and if just one does the same they will earn far more than they could earn from BTC. At the same time, they could earn -100  , but that's another story. If those opportunities would not be there the 100$ would go to BTC or at least a part of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "February 10, 2023, 09:25:14 PM",
      "body": "Quote from: Queentoshi on February 10, 2023, 07:42:57 PMI felt like seeing a movie and opened my streaming app (Netflix) to make a selection of a movie to see and I became confused which to select because of the many choices that I saw. I immediately had this thought that it is the same way people who have the interest of investing in cryptocurrency become confused the one to invest in when they find out that there is bitcoin and many other altcoins. Many people become confused and make mistakes because of the many options they have in cryptocurrency, they fail to invest in bitcoins because they think that there are many other very good options. Do you agree that more people will choose to invest in bitcoins if there were not so many cryptocurrency choices although not all are good? Your analogy is sound but the way you made use of it is wrong. You are supposing as if bitcoin has the same amount of popularity and acclaim as any other altcoin in the market, which let's face it, is not true. Bitcoin is the top dog in the market since Day 1, and that will never change. The way you used your analogy sounded like I could confuse Stranger Things on Netflix with any other show in there which is just not the case. Even newbies know the difference between investing in bitcoin and investing on a god-knows-what coin, so it doesn't make sense to confuse bitcoin for other cryptocurrencies just because there's a sea of them now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "February 10, 2023, 09:35:33 PM",
      "body": "Quote from: Queentoshi on February 10, 2023, 07:42:57 PMMany people become confused and make mistakes because of the many options they have in cryptocurrency, they fail to invest in bitcoins because they think that there are many other very good options. Do you agree that more people will choose to invest in bitcoins if there were not so many cryptocurrency choices although not all are good?Even if there were fewer cryptocurrencies, people would still choose the one that best suits their needs or that they have high hopes for. Bitcoin is unlike any other altcoin; it is distinct in its own right and cannot be compared to others. If there were fewer cryptocurrencies, bitcoin would have more investors than it does now, and other altcoins would also have more investors than they do now. More cryptocurrencies allow for greater investment diversification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "February 10, 2023, 09:41:38 PM",
      "body": "People just want the fastest option to make money, newbie crypto investors believe it’s too late to invest in bitcoin so they are more interested in buying altcoins and investing in ICOs that have the probability of multiplying their investments ten times. Altcoins are the most unpredictable investment in my opinion, who would have thought meme coins would become so popular and people would become millionaires from it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "February 10, 2023, 09:44:52 PM",
      "body": "Not a Bitcoin maxi but aren't other altcoins needed considering it doesn't it doesn't cover the whole by Bitcoin? Yeah Bitcoin was likely the pioneer but I think other altcoins technology are needed as well these days. People will choose Bitcoin as if it was the basis of all but as humans, for sure it's best if there will be alternatives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}