{
  "id": "topic_5430119",
  "title": "Saisher",
  "author": "Saisher",
  "created_time": "December 19, 2022, 06:18:59 AM",
  "content": "What happened:: Potential ScamWebsite  Link: https://bit-hit.com/ Reference Link: Payment Method: Bitcoin / Ethereum/ Usdt/Binance/Litecoin/Doge /TronAdditional Notes: No way any platform can offer up to 25000% interest rates this project maybe running for many months now but they will soon scam you if no money is coming in anymore, They claim that investors' money has no risk which is impossible based on the interest rate they offerhttps://bit-hit.com/?a=faq QuoteCan I lose money?Your funds are 100% at safe place. There is ABSOLUTELY NO RISK for your investment and funds!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430119",
  "comments": [
    {
      "author": "coin-investor",
      "created_time": "December 19, 2022, 12:09:38 PM",
      "body": "I'm 100% sure that this high-risk investment and a potential scam anytime this project will go down even if it runs for 800 or 1000 days what I hate about this project is they are marked legit by one verifier they should know better, no company existing or have excited or will exist that will can give you 25000% profit if the time that this project shutdown, they have nothing to blame but https://www.getlei.com/ for supporting this scam.QuoteLegal Entity Identifier (LEI) code is one of the most robust and modern ways to identify any international company participating in financial transactions. The goal of LEI code is a significant help in the monitoring and measuring of systemic risk, support more inexpensive compliance with regulatory reporting requirements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "December 19, 2022, 04:00:13 PM",
      "body": "Quote from: coin-investor on December 19, 2022, 12:09:38 PMI'm 100% sure that this high-risk investment and a potential scamThere's nothing potential about is as this is as straight forward scam as it can be and it will disappear in a month or two. Quote from: coin-investor on December 19, 2022, 12:09:38 PMwhat I hate about this project is they are marked legit by one verifier they should know better, no company existing or have excited or will exist that will can give you 25000% profit if the time that this project shutdown, they have nothing to blame but https://www.getlei.com/ for supporting this scam.Since BitHit is registered in the UK, website that you have to check to see whether its legit business or not (even though in this case situation is obvious, but for the future reference) or is https://www.fca.org.uk/ which regulates all financial services companies in the UK and of course you won't find it there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "December 19, 2022, 04:04:16 PM",
      "body": "WTF 110% interest for just a day and it goes insane the longer the wait. Nice find on this Ponzi. It’s very rare for me to see such kind of investment since I started to unfriend those users that loves sharing ponzi website. I think many people will still fall on this scheme because they offer term period such as day investment plan in exchange for a huge return. How do you find such website like this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "December 19, 2022, 05:04:16 PM",
      "body": "Quote from: Beparanf on December 19, 2022, 04:04:16 PMWTF 110% interest for just a day and it goes insane the longer the wait. Nice find on this Ponzi. It’s very rare for me to see such kind of investment since I started to unfriend those users that loves sharing ponzi website. I think many people will still fall on this scheme because they offer term period such as day investment plan in exchange for a huge return. How do you find such website like this? I know that such ponzi schemes are scam and these websites don't last for long. They just scam people and run as long as funds are coming to them but stop paying once they see that they are no more profitable or have no chance of getting more money from the people.However, i am surprised that that OP mentioned that this project is now running for months, Quote from: Saisher on December 19, 2022, 06:18:59 AMthis project may be running for many months now  How can they be paying this high rate to those who join their program? Any why people think it is a legit scheme and keep on depositing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "December 19, 2022, 09:41:34 PM",
      "body": "Quote from: Beparanf on December 19, 2022, 04:04:16 PMWTF 110% interest for just a day and it goes insane the longer the wait. Nice find on this Ponzi. It’s very rare for me to see such kind of investment since I started to unfriend those users that loves sharing ponzi website.Some of my online friends on social media are investing and promoting this they even send me an invitation to invest I just decline and talk them out that these are scams because no way any company or platform can pay such a huge interest rate QuoteI think many people will still fall on this scheme because they offer term period such as day investment plan in exchange for a huge return. These investment schemes will continue to exist and proliferate because it's being supported and promotedQuoteHow do you find such website like this? There are many of these on social media groups like Facebook if you are a member of Cryptocurrency groups you will likely see this kind of scheme because this is Cryptocurrency related and the admins allow these schemes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}