{
  "id": "topic_5494584",
  "title": "The Hidebehinder",
  "author": "The Hidebehinder",
  "created_time": "April 28, 2024, 04:33:20 PM",
  "content": "I'm reading everywhere about them, how they drive up fees, how they are minted in blocks, but I don't understand what are they actually, own chains of transactions or just individual inscriptions, the FAQ from some sites are just to complicated for me nowhere is there some information on those without much technicalities involved for the simple bitcoin user to get an idea?I saw this site mentioned by a legendary user:https://ordiscan.com/runesWhat does this even mean?- There are 41 888  Runes each like an altcoin or a second layer?- What means minting, not mintable, if it's minting it means one tx for each new mint?- When these are transferred, it's again a transfer for each rune from one address to another?Going here, what is now trending according to them:https://ordiscan.com/rune/UNCOMMONGOODSQuoteMint status MintingTime limit 208,744 blocks until endBlock 840,000Block 1,050,000This thing will mint for 4 years runes continuously like a bot? I stopped scrolling because it seems like hundred over hundreds of transactions!Again avalanche of questions but I don't understand how these things work at all other than the fact that I need to pay 30 times more on my consolidations because of them!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5494584",
  "comments": [
    {
      "author": "Yamane_Keto",
      "created_time": "April 28, 2024, 06:24:57 PM",
      "body": "It is random data that is stored on the Bitcoin blockchain and instead of being stored randomly it is stored as OP_RETURN.You can create this data and try to sell it in the belief that someone will think that this data is valuable and worth buying, such as adding a meme pic on a halving day. It's trying to create something unique (add data) on the Bitcoin blockchain, pay a fee for it and hope that someone in the future will buy it. minting is the process of creating these tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "April 28, 2024, 06:30:20 PM",
      "body": "You have started a good topic, for the sake of your question I also did a little research and added information to my knowledge as well, which is to understand runes we have to understand the main difference between BRC-20, Ordinals, and Runes. Well, Ordinals are like NFT which is a non-fungible token and it is inscribed on the back of satoshi or btc transactions. While BRC-20 is like a coin that is fungible and it is placed inside the BTC blockchain, while ordinals are inscribed in it.And Runes is an advanced version of BRC-20 that uses the UTXO model, which means UTXO are Unspent transaction outputs, to understand UTXO, let's say you have some funds and you have spent them, the remaining ones are known as UTXO which are spendable. So, Runes are based on the UTXO model while BRC-20 is not based on the UTXO model. please CMIIW",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "April 28, 2024, 10:45:11 PM",
      "body": "I heard about runes a week or two before the Bitcoin halving event and I have had a had time figuring out how they work except for the fact that they are like an improvements to BRC20 token standard. Ngl but the only interesting thing I have seen about runes lately is the airdrop they give to users that hold runes in their wallet. I'll be on standby in this thread to learn as much as I can when members with more experience with runes chime into this thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "April 29, 2024, 01:50:49 AM",
      "body": "Similar to ordinals runes are bitcoin version of NFTs. I don't believe the core bitcoin devs had anything to do with the development of runes.I believe runes and ordinals were created by an independent third party. So don't waste your money on them. Just think of runes as any other altcoin that is no better than any of the other thousands of altcoins. Like any other countless altcoins or shitcoins they were made to scam you out of your money. Don't waste your time and money on them.Just stick to the real bitcoin. Runes and ordinals are just NFTs and memecoins by another name but they are all fools gold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "April 29, 2024, 04:33:59 AM",
      "body": "Quote from: The Hidebehinder on April 28, 2024, 04:33:20 PM- There are 41 888  Runes each like an altcoin or a second layer?- What means minting, not mintable, if it's minting it means one tx for each new mint?- When these are transferred, it's again a transfer for each rune from one address to another?This thing will mint for 4 years runes continuously like a bot? I stopped scrolling because it seems like hundred over hundreds of transactions!1. Yes, it's just a token that run in Bitcoin network, anyone can create their own unique token and create their own consensus. That's why there are tokens that have maximum at 100K mints, at 1,050K blocks etc.2. Minting means you can earn new token, not mintable means the token has reached maximum amount, yeah when you earn new token, you need to create one TX. Check this address, it's full of 546 satoshi transactions https://mempool.space/address/bc1pssfrmkfjdxkl55yh8axnxy7egmv99x52mxtyx2dljvgn98na36zqn5atju3. Yeah, except you stop minting.4. The limit to mint that token is 4 years (at block 1,050,000), you're free to keep minting or stop it. But you can't mint it anymore after block 1,050,000 even though no one mint it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Hidebehinder",
      "created_time": "April 30, 2024, 08:37:24 PM",
      "body": "Quote from: Solosanz on April 29, 2024, 04:33:59 AM1. Yes, it's just a token that run in Bitcoin network, anyone can create their own unique token and create their own consensus. That's why there are tokens that have maximum at 100K mints, at 1,050K blocks etc.Does that means everyone can mint on some runes that are mintable paying just the fees?I can just go there and mine one of each and anyone could do this for 1 million times as the limit says?Sounds insane when you picture the amount of space these would take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}