{
  "id": "topic_5410372",
  "title": "Ucy",
  "author": "Ucy",
  "created_time": "August 18, 2022, 02:04:17 PM",
  "content": "More than a third of the Georgian population is on the blacklist of gamblers who are banned from gambling.... according to a translated post from Sputnik publicationExcerpt from the post:QuoteSince March 1, a register has been operating in Georgia, including ludomaniacs, social workers, officials and persons under 25 who are prohibited from playing in online casinos.According to the Revenue Service of the Ministry of Finance, 1917 people themselves applied to restrict access to the games, another 23 citizens closed it on the basis of a court decision. In total, the register contains information about more than 1.44 million people with a population of 3.71 million.If this is true, I then wonder if there is Gambling epidemic there.Well, I have nothing against the ban as long as gambling(taking big risk - big betting risk) is concerned. I will only be against banning Betting/Prediction market that encourages or promote Safe Betting. By the way, there is no such thing as Safe or Responsible Gambling. Gambling is unsafe and irresponsible.Bet but don't gambleDo you need nothing but theTruth? Check out these very useful Threads: How to Bet without \"Gambling\" |My Faith-based Posts Compilation |Compilation of My Works on Bitcoin/Crypto  |Extraordinary ways to move Bitcoin price without money",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410372",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "August 18, 2022, 02:19:19 PM",
      "body": "I do not understand why 30% of Georgians are banned from gambling, I will like to read the news in details, can you please include the link to the news?Quote from: Ucy on August 18, 2022, 02:04:17 PMBy the way, there is no such thing as Safe or Responsible Gambling. Gambling is unsafe and irresponsible.There is probability that someone that has just started to gamble to become addicted, but there is responsible gambling, you can gamble responsibly. People should not see gambling as a way of making money, that is where gambling problem starts from, people should know the reality that gambling is risky. Assuming you are receiving $1000 weekly, you can use 1% of it which is $10 to gamble, but some people can use $500 or more to gamble. Gambling is totally risky, is that wise enough?Quote from: Ucy on August 18, 2022, 02:04:17 PMBet but don't gambleWhat does this suppose to mean? They literally means the same thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "royalfestus",
      "created_time": "August 18, 2022, 02:34:07 PM",
      "body": "You post does not give enough information for the topic. The number of registered population for gambling may have 2 or more registration from the same person, which may not indicate that number out of the whole population. Other information on the ban and restricted individual does not have a significant number in the population and does not align with the subject.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 18, 2022, 03:08:40 PM",
      "body": "Quote from: royalfestus on August 18, 2022, 02:34:07 PMYou post does not give enough information for the topic. The number of registered population for gambling may have 2 or more registration from the same person, which may not indicate that number out of the whole population. Other information on the ban and restricted individual does not have a significant number in the population and does not align with the subject. There's a chance someone might create 2 accounts or more, but almost of casinos is prohibited use of multiple accounts. Even the calculation isn't really accurate, but it's supposed to. But I wonder what the reason why Georgia only ban 30% people from gambling, the quote only talking about 1900+ people, which is tiny amount. Is gambling in Georgia is illegal?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "August 18, 2022, 03:17:36 PM",
      "body": "Quote from: Solosanz on August 18, 2022, 03:08:40 PMQuote from: royalfestus on August 18, 2022, 02:34:07 PMYou post does not give enough information for the topic. The number of registered population for gambling may have 2 or more registration from the same person, which may not indicate that number out of the whole population. Other information on the ban and restricted individual does not have a significant number in the population and does not align with the subject. There's a chance someone might create 2 accounts or more, but almost of casinos is prohibited use of multiple accounts. Even the calculation isn't really accurate, but it's supposed to. But I wonder what the reason why Georgia only ban 30% people from gambling, the quote only talking about 1900+ people, which is tiny amount. Is gambling in Georgia is illegal?Another question is why only 30% of the gamblers are banned in Georgia ?If gambling is illegal in Georgia then all of the gamblers should be banned and not just certain percentage of gamblers. I did a google about gambling status in Georgia and found this;QuoteGambling in Georgia is generally prohibited. Legalizing any form of gambling requires a constitutional amendment, which means that the local legislature isn't capable of reacting to country-wide trends promptly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "August 18, 2022, 03:21:36 PM",
      "body": "You should have at least include a link to the main article, this topic does.not have enough information to trigger up discussion. But if we should talk about the ban and from the information you quoted those that are under this restriction are public servant and under 25 of age and individuals who opt in for self-exclusion so in my own views the ban is still fair enough at least to reduce the risk and negative influence of gambling on those within that class that are limited most especially financial liability from gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "August 18, 2022, 03:27:44 PM",
      "body": "Quote from: Oshosondy on August 18, 2022, 02:19:19 PMI do not understand why 30% of Georgians are banned from gambling, I will like to read the news in details, can you please include the link to the news?I don't have the link to that article but in 2014, the lower quartile of age in the UK  was 21 - meaning a quarter of the population is below the age of 21. I think that's probably a good chunk (most) of the people on this list if Georgia is the same or lower.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "August 18, 2022, 04:08:56 PM",
      "body": "We can't actually justify a law from government from our country's perspective because the tradition and culture followed there may differ completely from what we have been experiencing in our life. However I do not agree with safe bet option like some countries banned luck based games so called casinos but allows or run their own lottery which brings huge revenue to the government so this is kind of tactical move to generate revenue not really as social responsibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "August 18, 2022, 04:31:03 PM",
      "body": "Quote from: Oshosondy on August 18, 2022, 02:19:19 PMQuote from: Ucy on August 18, 2022, 02:04:17 PMBet but don't gambleWhat does this suppose to mean? They literally means the same thing.I actually thought OP's statement to be controversial as well, that is to mean the same thing until I looked it up myself and surprisingly though they share some similarities, there's still some difference between \"betting\" and \"gambling\".For extensive reading, you can read more from the source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "August 18, 2022, 04:35:21 PM",
      "body": "As others have stated, I’m really curious as to why the ban was put in to place for such a large percentage of the population. I however don’t think there are very many circumstances where I would be okay with this ban. I believe gambling is a right, not a privilege, so really curious as to why the ban.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "August 18, 2022, 05:10:56 PM",
      "body": "Quote from: Ucy on August 18, 2022, 02:04:17 PMMore than a third of the Georgian population is on the blacklist of gamblers who are banned from gambling.... according to a translated post from Sputnik publicationExcerpt from the post:QuoteSince March 1, a register has been operating in Georgia, including ludomaniacs, social workers, officials and persons under 25 who are prohibited from playing in online casinos.According to the Revenue Service of the Ministry of Finance, 1917 people themselves applied to restrict access to the games, another 23 citizens closed it on the basis of a court decision. In total, the register contains information about more than 1.44 million people with a population of 3.71 million.If this is true, I then wonder if there is Gambling epidemic there.Well, I have nothing against the ban as long as gambling(taking big risk - big betting risk) is concerned. I will only be against banning Betting/Prediction market that encourages or promote Safe Betting. By the way, there is no such thing as Safe or Responsible Gambling. Gambling is unsafe and irresponsible.Bet but don't gambleDo you need nothing but theTruth? Check out these very useful Threads: How to Bet without \"Gambling\" |My Faith-based Posts Compilation |Compilation of My Works on Bitcoin/Crypto  |Extraordinary ways to move Bitcoin price without money Only 30% huh,where I live now there is a massive ban for everyone to not gamble online and offline,even 10 year kids were placing sports bet here with the money that their parents gave them to buy food for when they were in school,they kept the money,didn't buy food and after school placed sport bets which were shops every 50 meters for sport betting.This is what I can call a pandemic that luckily does not exist anymore,however gamblers play online with cryptos now as crypto casinos are not banned from DNS servers of the ISP-s here,at least yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "August 18, 2022, 05:26:45 PM",
      "body": "I have read all the comments to find a source of information that can explain the reason behind this ban. 30 percent is not a small number compared to the state's population, but this may mean users under the age of twenty, for example, which is a reasonable percentage of the number of teenagers in it. It remains a mystery until we find a source of information.If there are other reasons, such as that state governors want to keep citizens away from gambling addiction, I think that this is not their business and the ban becomes absurd without reason .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "August 18, 2022, 05:39:54 PM",
      "body": "I have just found this news from local website from Georgia that gives more details (probably OP has recovered this news from here... https://agenda.ge/en/news/2022/3147 see this link for reference... ) QuoteThe law has prohibited Georgian citizens receiving social assistance from the state, public servants and individuals on black lists - included based on court decisions following requests by family members - from engaging in gambling in both online form and at brick-and-mortar casinos.Probably they have one of the biggest restriction-gambling-law in Europe that I have ever seen... something really impressive! It is also effective? It could work also with crypto gambling",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "August 18, 2022, 06:13:58 PM",
      "body": "Over 1 mln individuals on gambling ban list in GeorgiaWhat are the new governmental regulations for the gambling business?This is the result after new regulations came into effect in Georgia. Minimum age for gamblers was raised to 25 years old.Citizens with access to welfare social programs, public agents and individuals requested to not be allowed to gamble by their respective families are included on that total number of 1,449,124, which correspond to 30% of the entire population.Taxes on gambling businesses will also increase considerably in 60%-70%, as the government says.In my opinion it can be an expressive booster for crypto gambling gaining more adepts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 18, 2022, 06:42:49 PM",
      "body": "Quote from: Ucy on August 18, 2022, 02:04:17 PMMore than a third of the Georgian population is on the blacklist of gamblers who are banned from gambling.... according to a translated post from Sputnik publicationExcerpt from the post:QuoteSince March 1, a register has been operating in Georgia, including ludomaniacs, social workers, officials and persons under 25 who are prohibited from playing in online casinos.According to the Revenue Service of the Ministry of Finance, 1917 people themselves applied to restrict access to the games, another 23 citizens closed it on the basis of a court decision. In total, the register contains information about more than 1.44 million people with a population of 3.71 million.If this is true, I then wonder if there is Gambling epidemic there.Well, I have nothing against the ban as long as gambling(taking big risk - big betting risk) is concerned. I will only be against banning Betting/Prediction market that encourages or promote Safe Betting. By the way, there is no such thing as Safe or Responsible Gambling. Gambling is unsafe and irresponsible.Bet but don't gamblePeople just go to the neighboring countries or gamble illegally. With crypto, it became easier than ever. Governments can't catch you if you use crypto. People in Georgia hopefully know that by now and purchase bitcoin immediately.If they ban purchasing bitcoin though, now that would create lots of problems. They can still buy bitcoin illegally but it won't be as easy as I pictured it earlier.Is bitcoin banned there? Hopefully not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "August 18, 2022, 06:47:41 PM",
      "body": "Quote from: Ucy on August 18, 2022, 02:04:17 PMMore than a third of the Georgian population is on the blacklist of gamblers who are banned from gambling.... according to a translated post from Sputnik publicationExcerpt from the post:QuoteSince March 1, a register has been operating in Georgia, including ludomaniacs, social workers, officials and persons under 25 who are prohibited from playing in online casinos.According to the Revenue Service of the Ministry of Finance, 1917 people themselves applied to restrict access to the games, another 23 citizens closed it on the basis of a court decision. In total, the register contains information about more than 1.44 million people with a population of 3.71 million.If this is true, I then wonder if there is Gambling epidemic there.Well, I have nothing against the ban as long as gambling(taking big risk - big betting risk) is concerned. I will only be against banning Betting/Prediction market that encourages or promote Safe Betting. By the way, there is no such thing as Safe or Responsible Gambling. Gambling is unsafe and irresponsible.Bet but don't gambleI am a little concerned about the idea of banning vast amounts of the population of a region based on the job that they choose to do - I get the theory behind banning social workers, but in reality these people should be encouraged rather than implicitly restricted. Is it an opt-out type situation, where by default the restriction will be applied and they can choose to avoid entering the list? These types of actions can have unintended consequences further down the line, like discouraging people from jobs as future social workers or officials because they like to visit a casino once a year or play the occasional lottery game. I also hope that they have very good security on that list of people, because new setups can often be rather vulnerable if poorly configured and managed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 18, 2022, 06:50:52 PM",
      "body": "Quote from: bitbollo on August 18, 2022, 05:39:54 PMI have just found this news from local website from Georgia that gives more details (probably OP has recovered this news from here... https://agenda.ge/en/news/2022/3147 see this link for reference... ) QuoteThe law has prohibited Georgian citizens receiving social assistance from the state, public servants and individuals on black lists - included based on court decisions following requests by family members - from engaging in gambling in both online form and at brick-and-mortar casinos.Probably they have one of the biggest restriction-gambling-law in Europe that I have ever seen... something really impressive! It is also effective? It could work also with crypto gambling  I'd dare to say it is effective for now by the fact the majority of those people who are blacklisted are not even aware of the use of Bitcoin and other cryptocurrencies to gamble online. Nonetheless, performing an quick investigation, it seems that Georgia seems to have harbored Bitcoin minning within her territory. It would be matter of time for people there to discover the desirable properties of cryptocurrencies in the gambling world, to avoid those restrictions.Quote from: uneng on August 18, 2022, 06:13:58 PMIn my opinion it can be an expressive booster for crypto gambling gaining more adepts.Indeed but at the same time it is a bit worrying what could happen if the government there realizes how efective Bitcoin is to avoid those harsh penalties/restriction. They do not seem to be joking around if they are willing to try to enforce all this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "August 18, 2022, 06:59:15 PM",
      "body": "Quote from: Hispo on August 18, 2022, 06:50:52 PMQuote from: uneng on August 18, 2022, 06:13:58 PMIn my opinion it can be an expressive booster for crypto gambling gaining more adepts.Indeed but at the same time it is a bit worrying what could happen if the government there realizes how efective Bitcoin is to avoid those harsh penalties/restriction. They do not seem to be joking around if they are willing to try to enforce all this. Governments can always adopt an hostile stance towards bitcoin once they realize cryptocurrency is helping common citizens to avoid regulations and impositions which aim strengthening personal interests of the people behind the public administration. But governments can't do much if people play at non-KYC websites using exchanges of the same kind to transact money on the internet. Even countries which openly forbid crypto usage, investment and adoption can't efficiently stop their citizens from using it. There have been several news of prohibitions in China, Russia and Nigeria, although we constantly see enthusiasts from those countries in different crypto sites, including this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 18, 2022, 07:18:54 PM",
      "body": "Quote from: jackg on August 18, 2022, 03:27:44 PMI don't have the link to that article but in 2014, the lower quartile of age in the UK  was 21 - meaning a quarter of the population is below the age of 21. I think that's probably a good chunk (most) of the people on this list if Georgia is the same or lower. I think you are be correct because 30% of a whole nation can be under under 25, that is probably it. Quote from: Rruchi man on August 18, 2022, 04:31:03 PMAccording to what is in OP, what is the difference between betting and gambling? That people can bet but they should not gamble. I hope you understand what I am talking about. Football, other sports, and casino games are all risky and the sites providing the service can be regarded as gambling sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "August 18, 2022, 07:46:47 PM",
      "body": "Quote from: Oshosondy on August 18, 2022, 07:18:54 PMQuote from: jackg on August 18, 2022, 03:27:44 PMI don't have the link to that article but in 2014, the lower quartile of age in the UK  was 21 - meaning a quarter of the population is below the age of 21. I think that's probably a good chunk (most) of the people on this list if Georgia is the same or lower. I think you are be correct because 30% of a whole nation can be under under 25, that is probably it. Quote from: Rruchi man on August 18, 2022, 04:31:03 PMAccording to what is in OP, what is the difference between betting and gambling? That people can bet but they should not gamble. I hope you understand what I am talking about. Football, other sports, and casino games are all risky and the sites providing the service can be regarded as gambling sites.Both are betting but the ones betting in the casino are gambling.  Gambling is a subset of betting. Meaning it is under the umbrella of betting which result is uncertain.  This somehow further explain it..QuoteBetting is the act of placing a wager. Whether that's laying chips on the table, putting a certain amount on a certain outcome with a bookmaker, or buying stock in a company that you think will become more valuable, the act of committing money to be held pending an outcome (where if it happens, you get paid, and if it doesn't, you lose your bet) is betting. If you are putting up money to possibly earn more with it based on the outcome of a future event, you are betting.Gambling is the act of betting, but on an uncertain outcome. Good examples include buying a lottery ticket (you don't know what numbers will come up), choosing red/black on roulette (you don't know where the ball will land), or selecting a winning horse (you don't know who is going to cross the finish line first).Anyway, I see the reason why 30% of the entire population of Georgia is banned from gambling.  It is the change in the Law where the age of the person who can gamble is adjusted to 25 years old.   I thought it was something else more concerning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}