{
  "id": "topic_5467811",
  "title": "OmegaStarScream",
  "author": "OmegaStarScream",
  "created_time": "September 23, 2023, 11:52:56 AMLast edit: September 23, 2023, 03:24:42 PM by OmegaStarScream",
  "content": "I have been trying to import a seedphrase to Coinbase wallet but to no avail. I keep getting the same error \"Something went wrong\" although I'm sure that the seedphrase is correct. The phrase belongs to Trustwallet, but that shouldn't be an issue since both use BIP39. Has anyone been facing the same problem lately?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467811",
  "comments": [
    {
      "author": "vv181",
      "created_time": "September 25, 2023, 02:41:53 PM",
      "body": "As far As I can recall, migrating from Trust Wallet to Coinbase Wallet is possible since I have tried it long ago. Both applications are a popular wallet, so they should be using the standard implementation. Upon trying to check it again, I did not even manage to successfully open up the Wallet. It shows the error as follows. So I believe this is the problem from their end. Have you checked other social media (Reddit/Twitter) in case someone has the same issue? Also, were you able to open up the wallet first or does the error displayed when you just open up the wallet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "September 26, 2023, 07:45:10 AM",
      "body": "Quote from: vv181 on September 25, 2023, 02:41:53 PM-snip-So I believe this is the problem from their end. Have you checked other social media (Reddit/Twitter) in case someone has the same issue? Also, were you able to open up the wallet first or does the error displayed when you just open up the wallet?I found the problem. Apparently, you need to be connected to the internet (strange for a wallet that claims to be non-custodial) in order to import the seedphrase.But to answer your questions, I was able to open the wallet just fine and my error was a bit than yours. Mine was only displaying a small text in red under the InputBox where I type the seed phrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "September 26, 2023, 10:15:08 PM",
      "body": "Quote from: OmegaStarScream on September 26, 2023, 07:45:10 AMQuote from: vv181 on September 25, 2023, 02:41:53 PMSo I believe this is the problem from their end. Have you checked other social media (Reddit/Twitter) in case someone has the same issue? Also, were you able to open up the wallet first or does the error displayed when you just open up the wallet?I found the problem. Apparently, you need to be connected to the internet (strange for a wallet that claims to be non-custodial) in order to import the seedphrase.But to answer your questions, I was able to open the wallet just fine and my error was a bit than yours. Mine was only displaying a small text in red under the InputBox where I type the seed phrase.I see. Regarding my problem, I am now able to open it up. And yep, they require an internet connection to import with the phrase, otherwise, the loading icon just infinitely circling. With the fact we were having some problems (\"Something went wrong\"), some of their services might be down back then. Surely a badly designed and built of a non-custodial wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 26, 2023, 11:50:33 PM",
      "body": "Quote from: OmegaStarScream on September 26, 2023, 07:45:10 AMI found the problem. Apparently, you need to be connected to the internet (strange for a wallet that claims to be non-custodial) in order to import the seedphrase.One of the worst \"noncustodial\" wallets. If I recall well, I think I tried testing it a while back by creating an account without an internet connection and failed, I had to even delete it off my phone.I would rather opt for an individual open source noncustodial wallet like metamask.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 28, 2023, 09:02:53 AM",
      "body": "Quote from: OmegaStarScream on September 26, 2023, 07:45:10 AMI found the problem. Apparently, you need to be connected to the internet (strange for a wallet that claims to be non-custodial) in order to import the seedphrase.Hello, does non custodial wallet works without internet fine? Cause Ive never tried to import a seedphrase to another app or wallet without internet. Cause I really think it needed to be connected in order to use the importation process. Or does this work on other coins? Cause we are using an app which almost all the times work with internet and rarely to function without it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "September 28, 2023, 09:16:17 AM",
      "body": "Quote from: Bitcoin_Arena on September 26, 2023, 11:50:33 PMOne of the worst \"noncustodial\" wallets. If I recall well, I think I tried testing it a while back by creating an account without an internet connection and failed, I had to even delete it off my phone.I would rather opt for an individual open source noncustodial wallet like metamask.I needed to use a specific dapp and I didn't have so many options. Trustwallet's WalletConnect never works properly. And MetaMask had way too many issues in the phone version, for example (just from my experience):- If you have biometrics set up, you won't be able to log in. It's like an infinite loop of constantly checking your biometrics after you put your finger on the fingerprint scanner. - The password is also \"incorrect\" even when I'm 100% sure it's correct. In fact, the password works fine when I want to switch from Biometric to PIN for example, but not when the wallet is automatically locked.I also noticed many issues with the mobile version a couple of years ago, and Google Play reviews reflected that at some point but after I saw a good increase in their score, I decided to give it a shot again, but it doesn't look like much has improved.Quote from: cryptoaddictchie on September 28, 2023, 09:02:53 AMHello, does non custodial wallet works without internet fine? Cause Ive never tried to import a seedphrase to another app or wallet without internet. Cause I really think it needed to be connected in order to use the importation process. Or does this work on other coins? Cause we are using an app which almost all the times work with internet and rarely to function without it. That should be possible yes. If you try it on MetaMask or Electrum, it will work with no issues. The private keys are derived from your seedphrase, so there should be no need to communicate with any server. Now, I understand that they might need an internet connection to fetch the prices and get the list of coins, etc. but I think that's bad UX. It's not what one would expect from a non-custodial wallet. They should allow users to import their wallets, and then just ask them to connect to the internet to get the rest of the functionalities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "September 28, 2023, 02:52:14 PM",
      "body": "Quote from: OmegaStarScream on September 28, 2023, 09:16:17 AMThat should be possible yes. If you try it on MetaMask or Electrum, it will work with no issues. The private keys are derived from your seedphrase, so there should be no need to communicate with any server. Now, I understand that they might need an internet connection to fetch the prices and get the list of coins, etc. but I think that's bad UX. It's not what one would expect from a non-custodial wallet. They should allow users to import their wallets, and then just ask them to connect to the internet to get the rest of the functionalities.Oh thanks. I really thought that even any non custodial dapps or apps needed internet to import seed phrase. But since you already mentioned it, maybe I'll try sometimes. Im not aware of this cause I thought internet is a must with processes like this. Whats other non custodial that works like that without even need net to work?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "September 30, 2023, 07:00:32 AM",
      "body": "Quote from: cryptoaddictchie on September 28, 2023, 02:52:14 PMOh thanks. I really thought that even any non custodial dapps or apps needed internet to import seed phrase. But since you already mentioned it, maybe I'll try sometimes. Im not aware of this cause I thought internet is a must with processes like this. Whats other non custodial that works like that without even need net to work? I would imagine that pretty much every wallet that claims to be non-custodial should allow that. I know that Exodus, Unstoppable, and MetaMask (as I mentioned earlier) do, and for Bitcoin-only wallets (they're all open source): Mycelium, Bluewallet, Sparrow, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rimueng",
      "created_time": "November 23, 2023, 01:22:11 AM",
      "body": "Quote from: OmegaStarScream on September 23, 2023, 11:52:56 AMI have been trying to import a seedphrase to Coinbase wallet but to no avail. I keep getting the same error \"Something went wrong\" although I'm sure that the seedphrase is correct. The phrase belongs to Trustwallet, but that shouldn't be an issue since both use BIP39. Has anyone been facing the same problem lately?After looking into it, there is also a thread on the same reddit so you are not the only one facing this problem. You has test your seed phrase in trustwallet? if the phrase works in trustwallet, it might help ensure that the issue is specific to the coinbase wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "November 25, 2023, 08:21:17 AM",
      "body": "Quote from: Rimueng on November 23, 2023, 01:22:11 AMAfter looking into it, there is also a thread on the same reddit so you are not the only one facing this problem. You has test your seed phrase in trustwallet? if the phrase works in trustwallet, it might help ensure that the issue is specific to the coinbase wallet.The seedphrase does work fine on Trustwallet but I wanted to switch to Coinbase wallet without having to create a completely new wallet with different addresses. But like I said, it turned out that my problem was related to me not being connected to the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "November 25, 2023, 11:31:09 PM",
      "body": "Quote from: OmegaStarScream on September 28, 2023, 09:16:17 AMI needed to use a specific dapp and I didn't have so many options. Trustwallet's WalletConnect never works properly. What Dapp are you trying to use in particular, I could help explore some other noncustodial wallets to see if they support it,I have seen people complain about trust wallet in the recent times too, including the functionality of some Dapps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}