{
  "id": "topic_5415304",
  "title": "BitcoinGirl.Club",
  "author": "BitcoinGirl.Club",
  "created_time": "September 29, 2022, 06:22:58 AM",
  "content": "I was reading forum funds topic by theymos and interested to check their digitally signed documents from the signers. I was expecting Master Public key instead of public key. What is a public key for multisig bitcoin address.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415304",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 29, 2022, 06:31:16 AM",
      "body": "If the wallet used for it is not hierarchical deterministic (HD) wallet, public keys or private keys can just be shared between the N-of-N people that created the wallet. And in this case, the public keys are shared and revealed to the public.For HD multisig wallet, it would have been master public keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "September 29, 2022, 06:56:21 AM",
      "body": "Quote from: Charles-Tim on September 29, 2022, 06:31:16 AMIf the wallet used for it is not hierarchical deterministic (HD) walletNow I understand the format. I was considering HD wallet. Quotepublic keys or private keys can just be shared between the N-of-N people that created the wallet. And in this case, the public keys are shared and revealed to the public.Are you sure about it?I don't think private keys should be shared. In the case, one cosigner can restore the wallet and spend the coin which eventually lose the idea of having a multisig wallet with different cosigners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "September 29, 2022, 07:08:25 AM",
      "body": "Quote from: BitcoinGirl.Club on September 29, 2022, 06:56:21 AMAre you sure about it?I don't think private keys should be shared. In the case, one cosigner can restore the wallet and spend the coin which eventually lose the idea of having a multisig wallet with different cosigners.It is not recommendable at all for private keys to be shared, but it is possible. Theymos can never do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}