{
  "id": "topic_5429784",
  "title": "Altcoins_Details",
  "author": "Altcoins_Details",
  "created_time": "December 17, 2022, 05:08:33 PM",
  "content": "In the first part that we studied, I simply explained to you the basic idea to understand Crypto trading or Trading easily. Now, what I am going to teach you is the different trading styles used by different traders in the world of cryptocurrency.Anyway, you already know the concept of basic trading that you buy at a low price and sell at a high price in a short period, easy. But there are many types of trading strategies that can be chosen, Every trader has his preferred style and it depends on their availability. So in this part 2 that I will discuss you will discover which trading strategy suits you, Let's get started.1. DAY TRADING     What is day trading? This is the way to trade in just one day. For example, A is a day trader, he will buy an asset today and after an hour or 2 hours, he will sell it. In short, in a short time A was able to profit from the market, easy money, isn't it? If you look at it, it seems very easy, but in reality, it is not.It is only suitable for experienced traders, but many novice traders are allowed to enter it. A day trader is kind of in or out of the market within the day. That's why day trading is quite stressful. Mostly because they trade in the lower time frame between 5mins - 1hr.It is also applicable to people who do not do much and can monitor the market movement at all times. Because execution is fast in this style like winning fast and losing fast. But the profit obtained here is not that big, unlike swing trading.2. SWING TRADING      The idea is to capture the swing, the trade can last a day or a week. This means that if I am a swing trader and I enter the trade now, I will not immediately exit the market later. Because it can take one, or two days, even a week before I exit the market.A swing trader also often trades in a higher time frame such as 4 hours or daily. It is not insignificant that the profit of a swing trader is greater because the trend that it follows is greater than that of a day trader. It's also not too stressful because they don't have to watch the market minute by minute. They can enter a position now and they will return to it tomorrow or the next day.This strategy applies to people who don't have time to watch the market minute by minute, it can be done part-time.3. POSITION TRADING     This is long-term trade, they are the traders who follow the trend. They aim for much higher profit, their trading takes a few months or a few years. They make the trade on a higher time frame daily to the weekly chart.What these traders look at is the big picture of the market. They use Fundamentals and Technical analysis in their trades. They also ignore price fluctuations in the lower time frame or what is called market noise. Because they believe that this is normal and that the value of their trading position will continue to increase.If the profit obtained by the swing trader is large, the profit obtained by a position trader is greater, because they ride while the market is trending. Position traders are patient people, they will not sell their assets immediately even if their value has increased, they aim for a higher price. And it is suitable for people who are busy in life and have a full-time job.4. SCALPING     Just think of this as the day trading extreme version, because these are the scalpers who participate in the smallest time frame like 1 min. or 5 minutes time frame. The motive of scalpers is to get a small profit but a lot, so if you combine the small profits it will be big. Anyway, scalping is not advisable for beginners. Because of this, you need to make quick decisions, and you also need to be well-versed in technical analysis. But many beginners trade as a scalper. You can't blame them either, \"People like to get rich quickly\" they are wrong here.Trading is not a quick rich theme, it takes time before you become a profitable trader. In today's time, especially in crypto, beginners can become scalpers, their experience will even be faster if they do scalping style. But they have to pay a higher price.As I mentioned, you must be well-versed in technical analysis. Because if you don't know anything about technical analysis and you enter scalping, you are not called a trader, but you are a certified \"Gambler\".These are the four trading styles, and they each have their pros and cons, some people are suited to day trading and there are also swing trading. It is based on a person's personality and situation. If you have a full-time job and want to trade, then you can start swing trading.If you don't do anything and just hang out at your house and you have a lot of money, then you can start day trading. Although this trading course is about trading, it is also important that you know the basic Investing strategy. So I included it here. Because most successful traders also have hidden investments, and the most common strategy in Investing is what is called Diversification.5. DIVERSIFICATION      This is the \"Don't keep all your eggs in one basket\"That means if you invest in something like Stocks, and you put all your money in it, then suddenly there was a market crash and the value of the stocks dropped, and you lost money immediately because you only invested in one asset.The idea of diversification is to diversify your money into different asset classes. Meaning, your investment is scattered, for example, if you have 100k$ capital and you want to invest, instead of investing in just one asset you invest in different asset classes. In stocks 10%, in Gold 30%, Bitcoin 50%, bonds 10%. In this example, you used the diversification way. If Gold crashes, stocks, and bitcoin may rise. Meaning, you can't be zero, This is your protection in unexpected scenarios.In the cryptocurrency market the idea is the same, you choose coins that you think have strong fundamentals. And the price may fly up in the future and you will divide it. It could be a combination of large-cap, mid-cap, or low-cap coins.When it is said Large cap, it is the one with a high market cap like Bitcoin and Ethereum. In the large market cap, the risk is lower, because it has been tested over time. So, here it is better to allocate a larger percentage of your investment.The Mid-cap is playing coins from 1Billion to 10 billion, For example here are Monero, Stellar, and others. Midcap coins are riskier than large-cap coins.Low-cap coins are anything below 1B market cap, these are the high-risk and high-reward coins. Because here the chance of the value becoming zero is higher than in midcap and large-cap coins. But the low-cap coins have a bigger growth opportunity, so this is what they call \"Moonshot coin\", there are also many scams in the low-cap area. So, be very careful in choosing a low-cap coin, as I mentioned in diversification, you can divide it into the asset you want, depending on your tolerance.6. BUY AND HOLD      This is the common strategy of investors, and the most famous for using this strategy is Warren Buffet (The greatest investor of all time) This is one of the richest investors in the world. His strategy is very simple, it is Buy and Hold, like he will buy stocks that are undervalued, then he will hold them for 10 years or more, and when he makes a profit, he will sell them.It's one of the easiest to do, it's not stressful, you don't need to pay attention to the fluctuation that happens in the market, and it's for people who have a lot of patience.Holdings are also a trend in cryptocurrency, crypto is very profitable when it comes to holdings. And the best example here is Bitcoin because its value in 2010 was only about a cent, just kidding, if there was bitcoin at that time, how much would it have been, so its variation today, it is indeed the best-performing asset in the decade, and another example is Ethereum, in 2015 its price was only about 1$, but look at the price now, so if you only invested at that time in ETH and held it until now, I'm sure it's profitable that and he's probably a millionaire. Trading and Investing are almost twins, and you can combine them as others do.Now you have an idea of the basics of trading and the basics of investing, which one suits you best? So, see you on the next part episode of this course.Part 1 episode Basic understanding in Trading",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5429784",
  "comments": [
    {
      "author": "palle11",
      "created_time": "December 17, 2022, 05:38:41 PM",
      "body": "I appreciate your ideas to this thread but I still believe that we have majorly three types of trading and they also cover this three that you added to it. Like for example with position trading, it is same as swing trading because it is a longer expectation of trade order. For diversification, I don't think this is specifically for trading. Or at most trading in different coins is expected in trading not just one coins. Buy and hold is not trading, it is just as DCA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 18, 2022, 07:05:08 AM",
      "body": "Educating people about trading is good, yet it should be done right to avoid misleading others. As much as I appreciate your effort, don't you think that your subheading in relation to the topic is not correct? Scalping is also a day trading style/method of trading, just as swing trading could be done daily, it's the timeframe used that would only be different. This makes me suggest that you reconstruct the whole topic and body as this does not reflect the style of trading but the behaviour of traders in trading, their style of trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ben Barubal",
      "created_time": "December 18, 2022, 11:30:23 AM",
      "body": "Quote from: EarnOnVictor on December 18, 2022, 07:05:08 AMEducating people about trading is good, yet it should be done right to avoid misleading others. As much as I appreciate your effort, don't you think that your subheading in relation to the topic is not correct? Scalping is also a day trading style/method of trading, just as swing trading could be done daily, it's the timeframe used that would only be different. This makes me suggest that you reconstruct the whole topic and body as this does not reflect the style of trading but the behaviour of traders in trading, their style of trading.     I don't think Op needs to do that, because when I read this topic according to the source link he gave, his opinion is not far from explaining or teaching the trading activity.And as far as I can see, OP also teaches according to his experience that he shares here for free, and I also think that I am not sure, that he is a good trader whether in crypto or another trading. Because every detail he said is not far from the meaning he gave to the source in his opinion, which I also think is based on his experience as a trader.     He just gives details to each one and I think that's good. Just like you give your opinion that you think is right for yourself, all of us here will disagree with what we say and some will support what we said. All in all for me what OP is doing is okay, it will help those who don't know about crypto trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "December 18, 2022, 11:50:21 AM",
      "body": "Cool OP! Would be awesome to identify also or indicate different risks of these \"styles\" or \"kinds\" of trading because I believe, it comes with different risk like there is some there that got low risk, but low reward or high risk, and high reward also.Overall, this is really not important to make you profitable but it's somehow good to identify which kind of trader of you and what's your goal, it will help you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}