{
  "id": "topic_5467862",
  "title": "Negotiation",
  "author": "Negotiation",
  "created_time": "September 24, 2023, 04:01:25 AMLast edit: September 25, 2023, 08:15:33 AM by Negotiation",
  "content": "I faced the problem of not sending my BTC, The old transaction is pending when I try to new transaction so i see the error message. Old transaction Hash ID: 355d261bc216ee04ac340630e6c62d71cfec41b0a18438d9b936e2d3dc42355dhttps://www.blockchain.com/explorer/transactions/btc/355d261bc216ee04ac340630e6c62d71cfec41b0a18438d9b936e2d3dc42355dhow can I solve this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467862",
  "comments": [
    {
      "author": "philipma1957",
      "created_time": "September 24, 2023, 04:23:57 AM",
      "body": "Quote from: Negotiation on September 24, 2023, 04:01:25 AMI faced the problem of not sending my BTC, The old transaction is pending when I try to new transaction so i see the error message. Old transaction Hash ID: 355d261bc216ee04ac340630e6c62d71cfec41b0a18438d9b936e2d3dc42355dhttps://www.blockchain.com/explorer/transactions/btc/355d261bc216ee04ac340630e6c62d71cfec41b0a18438d9b936e2d3dc42355dhow can I solve this? you under paid . maybe it will clear in a week or two.waiting it out may be all you can do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dictator69",
      "created_time": "September 24, 2023, 04:26:16 AM",
      "body": "This error shows a transaction conflict. This might me happening because the btc that you have tried to send from first transaction are in pending and when you made the second transaction the same coin means the same btc were to be called in that second transaction for making it happen. But hey, you have locked that amount for the first transaction but that is still in pending. That might be the reason of seeing it. Solutions are: wait for the first transaction to be completed. If first one is taking time then you are stuck because you might not make another transaction till the previous one not completes. To avoid such error, I prefer you to use Electrum because it have built in features to minimize this error. Like bumping the fee so you would increase the priority level of the first transaction and it would not make this error because there would be no TX in pending, or replacing a transaction with another one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "September 24, 2023, 05:10:49 AM",
      "body": "Quote from: Negotiation on September 24, 2023, 04:01:25 AMI faced the problem of not sending my BTC, The old transaction is pending when I try to new transaction so i see the error message. There's only one available UTXO aside from the one spent by your other unconfirmed transaction:a40fa4553208a4f2f49d44aca8103762c895fbedf06ad0a3e6c79a172799b8d6:10 (0.00095895 BTC)Since you managed to create a transaction with 0.00186771BTC amount, Trustwallet must have reused the same input as the previous transaction instead of only using your other unspent transaction outputs.That linked transaction isn't marked as replaceable and Trustwallet's mempool doesn't support full-rbf that's why it rejected the new transaction.Check your balance first; if it shows more than the correct amount, refresh the wallet tab or restart the app.If it now shows the correct balance, 0.00095895 BTC, you can now send without that error.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 24, 2023, 05:26:13 AM",
      "body": "Just like others have said, you’re trying to spend a transaction using same client as the one that broadcasted the first transaction which is yet to get confirmed and since the node already has it then it is a conflict transaction and is seeing as a double spending which could get it dropped. What you will do is to broadcast a new transaction from a different wallet so that it will be broadcasted by a node different from the first transaction. You can also broadcast the transaction from  https://blockchair.com/broadcast if you have raw transaction HEX. Or better still import the seed phrase into BlueWallet and try to get the old transaction RBFed or if you have the first transaction receiving address then import that wallet seed into wallet that supports CPFP and increase the transaction fee of the first transaction",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AprilioMP",
      "created_time": "September 24, 2023, 05:29:38 AM",
      "body": "Quote from: Dictator69 on September 24, 2023, 04:26:16 AMTo avoid such error, I prefer you to use Electrum because it have built in features to minimize this error. Like bumping the fee so you would increase the priority level of the first transaction and it would not make this error because there would be no TX in pending, or replacing a transaction with another one.At the same time, avoid using Trust Wallet so that problem after problem doesn't happen again. Electrum is indeed the best wallet as a bitcoin wallet with the available features. If you don't want to use Electrum, there are still other wallets that are good to use instead of Trust Wallet.If this problem happens to me and when this problem is solved, I will send assets to another wallet and delete Trust Wallet from my mobile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Negotiation",
      "created_time": "September 24, 2023, 05:45:43 AM",
      "body": "Quote from: nc50lc on September 24, 2023, 05:10:49 AMQuote from: Negotiation on September 24, 2023, 04:01:25 AMI faced the problem of not sending my BTC, The old transaction is pending when I try to new transaction so i see the error message. There's only one available UTXO aside from the one spent by your other unconfirmed transaction:a40fa4553208a4f2f49d44aca8103762c895fbedf06ad0a3e6c79a172799b8d6:10 (0.00095895 BTC)Since you managed to create a transaction with 0.00186771BTC amount, Trustwallet must have reused the same input as the previous transaction instead of only using your other unspent transaction outputs.That linked transaction isn't marked as replaceable and Trustwallet's mempool doesn't support full-rbf that's why it rejected the new transaction.Check your balance first; if it shows more than the correct amount, refresh the wallet tab or restart the app.If it now shows the correct balance, 0.00095895 BTC, you can now send without that error.it is my final balance now but the old balance has been instilled in my wallet, I tried 0.00095895 BTC to send this amount but the same error.@philipma1957 and @Dictator69 Thanks for the adviced I waiting for the solution, also shipped to using Electrum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "September 24, 2023, 05:55:52 AM",
      "body": "Quote from: Negotiation on September 24, 2023, 05:45:43 AMit is my final balance now but the old balance has been instilled in my wallet, I tried 0.00095895 BTC to send this amount but the same error.Trust wallet doesn't support coin control so manually sending certain amount of BTC wont cause it to spend a specific UTXO.Since it shows the total amount from those two UTXOs, then your wallet must be missing your old transaction (as seen in the history) but their node's mempool still has it.My suggestion above is to find a way to sync your transaction history to the blockchain so that your old transaction will showand at the same time, its input wont be used in your new transaction.And based from my test, they only have that scroll-down feature to refresh the wallet, try to find if there's any other way to rescan for transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Negotiation",
      "created_time": "September 24, 2023, 06:22:29 AM",
      "body": "Quote from: EL MOHA on September 24, 2023, 05:26:13 AMJust like others have said, you’re trying to spend a transaction using same client as the one that broadcasted the first transaction which is yet to get confirmed and since the node already has it then it is a conflict transaction and is seeing as a double spending which could get it dropped. What you will do is to broadcast a new transaction from a different wallet so that it will be broadcasted by a node different from the first transaction. You can also broadcast the transaction from  https://blockchair.com/broadcast if you have raw transaction HEX. Or better still import the seed phrase into BlueWallet and try to get the old transaction RBFed or if you have the first transaction receiving address then import that wallet seed into wallet that supports CPFP and increase the transaction fee of the first transaction I tried 'BlueWallet' bump fee but error masses. Quote from: nc50lc on September 24, 2023, 05:55:52 AMQuote from: Negotiation on September 24, 2023, 05:45:43 AMit is my final balance now but the old balance has been instilled in my wallet, I tried 0.00095895 BTC to send this amount but the same error.Trust wallet doesn't support coin control so manually sending certain amount of BTC wont cause it to spend a specific UTXO.Since it shows the total amount from those two UTXOs, then your wallet must be missing your old transaction (as seen in the history) but their node's mempool still has it.My suggestion above is to find a way to sync your transaction history to the blockchain so that your old transaction will showand at the same time, its input wont be used in your new transaction.And based from my test, they only have that scroll-down feature to refresh the wallet, try to find if there's any other way to rescan for transactions.Thanks, @nc50lc tried 'BlueWallet' import phrase but not solved,  so wait and see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "September 24, 2023, 07:45:35 AM",
      "body": "You have succeeded in creating and broadcasting a transaction paying the address you were trying to pay in your OP. It is here: https://mempool.space/tx/913859fb1eed893c79e6eb287c96eb94df2a18117602a2fd0897c11e0d9a7ed7Unfortunately, you have chosen an even lower fee than the previous transaction which is still unconfirmed. This transaction is around 40 MvB from the tip of the mempool and won't be confirmed any time soon. It is, however, opted in to RBF, so is easy to replace with a higher fee transaction if you want.Your address bc1qcsudyax32m3n2mdj83jdrme8c2m4t0znsgv99h now has two unconfirmed spends and no balance remaining should these transactions confirm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shasan",
      "created_time": "September 25, 2023, 02:02:54 AM",
      "body": "Quote from: Negotiation on September 24, 2023, 06:22:29 AMThanks, @nc50lc tried 'BlueWallet' import phrase but not solved,  so wait and see.Both of us waited too long and finally, it was confirmed. Now it is already 8 confirmations. And hopefully think another transaction will be confirmed ASAP which is still now unconfirmed. Which should be reached into the wallet mentioned on my profile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Negotiation",
      "created_time": "September 25, 2023, 08:14:16 AM",
      "body": "Quote from: shasan on September 25, 2023, 02:02:54 AMQuote from: Negotiation on September 24, 2023, 06:22:29 AMThanks, @nc50lc tried 'BlueWallet' import phrase but not solved,  so wait and see.Both of us waited too long and finally, it was confirmed. Now it is already 8 confirmations. And hopefully think another transaction will be confirmed ASAP which is still now unconfirmed. Which should be reached into the wallet mentioned on my profile.Thanks @shasan another transaction is as soon as possible.Also,Thanks all guys 'BlueWallet' is helped make another transaction on Emergency time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}