{
  "id": "topic_5460335",
  "title": "Olimp2009",
  "author": "Olimp2009",
  "created_time": "July 19, 2023, 01:51:37 PM",
  "content": "Our project is the launch of marketing strategy in Asia, India, Vietnam and Africa. We are looking for experienced professionals who understand cryptocurrency.We are a big ecosystem with many useful features. Our main bias is privacy. We have a unique browser and messenger with the best encryption system! We have our own content creation platform. And many other things that set us apart from other projects!What we need:- promotion of our messenger- Explaining the essence of the product- scaling the promotion- audience gathering- reporting- Attending conferences and all cryptocurrency related events in your region.Experience working with cryptocurrency-oriented audiences is a must.If you are located in Asia, India, Vietnam and Africa and think you would be a good fit for this position, please post your experience in this thread and leave your contacts. (this is the preferred method)You can also message me on Telegram @JoBraver",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460335",
  "comments": [
    {
      "author": "Olimp2009",
      "created_time": "July 26, 2023, 02:47:02 PM",
      "body": "If you are in the above regions you can contact to me, we are still looking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Olimp2009",
      "created_time": "October 14, 2023, 05:57:45 AM",
      "body": "We are continuing our search. If you are located in these regions, please contact me. Absolutely everyone is welcome and we are willing to consider any candidate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ravichnadra",
      "created_time": "January 02, 2024, 04:47:10 AM",
      "body": "Hey there!Commenting on your better search. How someone can reach you out ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nestex_one",
      "created_time": "January 02, 2025, 08:32:26 AM",
      "body": "Quote from: Olimp2009 on July 19, 2023, 01:51:37 PMWe are a big ecosystem with many useful features. Our main bias is privacy. We have a unique browser and messenger with the best encryption system! We have our own content creation platform. And many other things that set us apart from other projects!The privacy browser + messenger piece holds my interest. Can you share a link or something where we can try it out? I'm asking as a potential customer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}