{
  "id": "topic_5436326",
  "title": "Rigon",
  "author": "Rigon",
  "created_time": "January 22, 2023, 05:55:30 AMLast edit: January 22, 2023, 06:06:39 AM by Rigon",
  "content": "I joined the futures trading platform a few months ago. There I buy 50 SOL 6x. After I participated, a bad news hit the market. And the bad news is that FTX is bankrupt. Then there was a huge loss on my futures trading platform. I continued to liquidation there without giving up. At one point while adding liquidation my total balance became very high and liquidation also came down and loss went to high level. The bloody year 2022 ends and in 2023 the market is slowly pumping and all my losses are recovered and I see profit.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436326",
  "comments": [
    {
      "author": "un_rank",
      "created_time": "January 22, 2023, 06:26:42 AM",
      "body": "This is the internet. Do not reveal your trading or wallet balance here as it gives random people too much information about you.You could recognize breaking even after a long wait, without oversharing.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "January 22, 2023, 06:27:05 AM",
      "body": "Quote from: Rigon on January 22, 2023, 05:55:30 AMI continued to liquidation there without giving up.No stoploss? Be clear, you continued to \"gamble\" without giving up.Quote from: Rigon on January 22, 2023, 05:55:30 AMThe bloody year 2022 ends and in 2023 the market is slowly pumping and all my losses are recovered and I see profit.From your screenshot, it is clear that you again took a long entry at higher levels, and will get killed again if markets start to tank from next week. Please book profits or atleast start to have sl above your entry once it gets substantially above it. Do you have a target in mind ?Edit:Quote from: un_rank on January 22, 2023, 06:26:42 AMDo not reveal your trading or wallet balance here as it gives random people too much information about you.Agreed!, @OP you should remove those screenshots, you dont need to prove yourself to anyone, and neither any legit user is interested in seeing the screenshots of others' balance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "January 22, 2023, 08:02:42 AM",
      "body": "Quote from: Edwardard on January 22, 2023, 06:27:05 AMQuote from: Rigon on January 22, 2023, 05:55:30 AMI continued to liquidation there without giving up.No stoploss? Be clear, you continued to \"gamble\" without giving up.This is a common mistake for people who are new to trading. They always think that their trade will always go in a good way so they intend not to use any method of risk management like setting stop loss and target price.Another thing OP must learn is how much amount to allocate per trade, so you will still have some capital left once you need to trade again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "January 22, 2023, 09:36:42 AM",
      "body": "Congratulations to you for being able to recover your losses in trading. This proves that if we keep trying to trade, whether we use spot trading or futures trading, we can profit. This condition is not over yet because it looks like the market will shake and some coins can increase and give us profit. But we really have to be able to choose coins to trade futures because if we don't, we will incur losses. So be careful with your trading time and take your profit while you can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sterbens",
      "created_time": "January 22, 2023, 10:38:51 AM",
      "body": "It's rare to hear of traders getting their balances back after heavy losses hit them for some reason. You did very well and didn't give up to keep trading. But if I may give a suggestion, it's best that you avoid chasing losses like that, because your story makes me think that you want your money back after a loss. Lucky you got it back, that's good news of course. But if you don't get it back, then it's a bigger loss that will get.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "January 22, 2023, 11:03:51 AM",
      "body": "Maybe I am a little off, but I don't think this is a success yet until you close the position. You are only looking at \"unrealized\" profit. What id you wake up tomorrow and slow is down to $5, way past your liquidation price. Will it still look like a success?Please, put in some risk management too, it could have gone worse and all your big position might have all been wiped. I am not sure if you would talk about that big loss too here. Otherwise, good luck in your trades, it's a learning process all throughout",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "January 22, 2023, 11:10:39 AM",
      "body": "Assume that the nearest severe decline occurred last October, meaning that your position was minus for 2 months.Sorry, you didn't successful from my PoV, you fail your \"guess\", your strategy. And you also suffer from the worry of being liquidated during that floating loss by adding more positions (unexpectedly) which means adding more worries. I don't know if you can concentrate on any other activity without remembering trading at all, it all paid off with only $77 profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "January 22, 2023, 11:15:23 AM",
      "body": "Regardless of what your trading strategy looks like, it doesn't have a plan. I mean, you go with the flow of the market without having certain restrictions to place profits or losses. In addition, you trade futures that have a higher risk. Be warned that it doesn't always go as smoothly as you might think. Don't be complacent and always increase portfolio monitoring. You are in a futures trade so remember once again that this type of trade does not always end well if you rely solely on market instinct.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "January 22, 2023, 08:57:45 PM",
      "body": "It's good that you've shared that losing and recovering experience you've got. You really have to learn from it because you'll be able to apply that for your next trades.Those that I've seen that did futures and got liquidated with their first try, they've never comeback and stayed on the spot and so do I. That's why if you're able to earn from there and you're starting to learn, be consistent.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "January 22, 2023, 11:13:26 PM",
      "body": "Good for you and yet you recovered your heavy losses.But I think in future trading you still predict the market of your future trades, it's a coincidence that you opened a long position that exactly the market was resisted.  This is the advantage of future trading, you can hold a trade as long as you want but make sure you have enough margin to keep it open which I think you did it.Try to do the same pattern next batch of your future trade if they have the same result, my guess is not. But if the market price keeps growing, there will be a chance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "January 23, 2023, 05:31:29 AM",
      "body": "Quote from: naira on January 22, 2023, 11:15:23 AMRegardless of what your trading strategy looks like, it doesn't have a plan. I mean, you go with the flow of the market without having certain restrictions to place profits or losses. In addition, you trade futures that have a higher risk. Be warned that it doesn't always go as smoothly as you might think. Don't be complacent and always increase portfolio monitoring. You are in a futures trade so remember once again that this type of trade does not always end well if you rely solely on market instinct.I hold the same opinion, I am glad the OP recovered the money they had lost to the markets but it appears this was done by taking even higher risks with their account, and even if it went well this could change the next time they find themselves in a similar situation.After all just as the market has exhibited a good recovery during the last weeks, the market sentiment could change just as quickly and if at that time the OP is still trading futures then they may lose all the money they recovered and maybe even more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "January 23, 2023, 06:21:19 AM",
      "body": "Always in put stop loss. Yes you might be confident about the market direction but there are some certain whales who can induldge a very rapid short trade with huge volume to liquidate some small traders. It happened frequently cause they knew the orders and estimating the position you are. A slight movement could rekt a lot of traders especially retailers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "January 23, 2023, 07:08:49 AM",
      "body": "you did something very risky, you didn't put a stop loss and all you did was hold and of course you had no idea that the price would go so high that you would recover, that was all luck and the kind of luck that doesn't happen very often , so be very careful, the recommendation would be that you use stop loss in the next few times and don't rely on luckQuote from: cryptoaddictchie on January 23, 2023, 06:21:19 AMAlways in put stop loss. Yes you might be confident about the market direction but there are some certain whales who can induldge a very rapid short trade with huge volume to liquidate some small traders. It happened frequently cause they knew the orders and estimating the position you are. A slight movement could rekt a lot of traders especially retailers. That's why I always preferred to do normal trading, at least the profit is not high but it saves me a lot of unnecessary headaches, futures trading is something very risky that has made many people lose a lot of money and even kill themselves",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "January 23, 2023, 10:40:00 AM",
      "body": "Congratulations on recouping your losses and beginning to profit from your previous investments. Only the strongest and most determined will stay and watch the market recover after losing so much. You are a good example of a determined and focused trader, and you are to be addressed as a long term holder beneficiary. Given this, it is not advisable to make your earnings public; it is similar to a public market place, and you have no idea who is spying on you now and looking for a way to infiltrate into your savings. Be cautious and watchful with your investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "January 23, 2023, 11:51:16 AM",
      "body": "Not many traders can recover their losses because many will feel discouraged because their trades are not successful and end up losing even more. And if this happens to us, we have to learn to analyze more and more to improve our trading style and recover from losses.Congratulations @OP, you can do it. Regardless of whether you did not use the stop-loss facility on the exchange, you have successfully recovered your losses. But try to use stop-losses to offset bigger losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "January 23, 2023, 11:58:29 AM",
      "body": "Quote from: un_rank on January 22, 2023, 06:26:42 AMThis is the internet. Do not reveal your trading or wallet balance here as it gives random people too much information about you.You could recognize breaking even after a long wait, without oversharing.- Jay -I don’t see anything wrong for sharing balance here since his topic is about success on his trading. How can show the success if he didn’t show balance itself. Although a percentage growth can be shared but showing the amount will give an easy overview about his share. Besides he will be safe as long as he didn’t share personal information related to his login credentials. There’s a lot of whales on the collectibles section buying and selling premium items with insane amount same on lending section which lender has a list on how much other user borrowed them. @OP, nice trade with that future trading. I think your low leverage helps you to withstand more possible liquidation during the downtrend since SOL price swing is very strong that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "inthelongrun",
      "created_time": "January 23, 2023, 01:45:03 PM",
      "body": "You must have too much faith in Solana OP after you continued to inject more funds to avoid your position getting burned. Congratulations on your gain! Although I don't know if the stress you experienced is worth that gain. I would've imposed my stop loss without hesitation if I were in your situation earlier, the same thing when I sold my LUNA last year. That is really the downside of futures trading. I hope I won't get tempted to use that trade feature again this year. Usually, I lost most of my futures trades. Maybe I am so tight with my stop loss so it is not fit to my trading style. Anyways, I am content with my spot trades and it is better for a position trader.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "January 23, 2023, 02:09:08 PM",
      "body": "first, congratulations you have returned your losses with great effort.and then, you make trades by risking your luck with the capital you keep hitting.somehow you get your luck. but maybe it won't happen in your next trade.I remember how I started my futures trading very badly. but I'm not as lucky as you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GigaBit",
      "created_time": "January 23, 2023, 03:11:09 PM",
      "body": "Quote from: Rigon on January 22, 2023, 05:55:30 AMI joined the futures trading platform a few months ago. There I buy 50 SOL 6x. After I participated, a bad news hit the market. And the bad news is that FTX is bankrupt. Then there was a huge loss on my futures trading platform. I continued to liquidation there without giving up. At one point while adding liquidation my total balance became very high and liquidation also came down and loss went to high level. The bloody year 2022 ends and in 2023 the market is slowly pumping and all my losses are recovered and I see profit.The current market situation is very risky for futures traders. BTC price is now at $22,824.75 it can be bullish or bearish anytime. Whatever the future traders do, if it favor, there will be a chance of huge profit and if they are against, there will be a risk of big loss. Congratulations you didn't give up and getting green signal from there even after a long time. If it can be continued for a long time, good results can be expected from it. Cryptocurrencies are risky but even more risky is future trading. A high volatility can result in your balance going to zero any time. So it is necessary to research well before taking any new trade at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}