{
  "id": "topic_5397777",
  "title": "elevates",
  "author": "elevates",
  "created_time": "May 08, 2022, 02:16:24 PMLast edit: May 08, 2022, 02:56:19 PM by elevates",
  "content": "I am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages. Interesting way to get kids closer to bitcoin learning by introducing them to bitcoin wallet rather than the concept of ‘piggy bank’.It would be easy for them to correlate to bitcoin as a new type of digital money.We parent then find it easy to teach them the concept of bitcoin and decentralization in a simpler way with the help of realistic examples.Once they understand, they can start collecting Bitcoin all by themselves at the permissible age by doing tasks or work they would realize its potential.This would be a start to teaching kids the power of decentralization and accumulation which will increase its value over the time and will also help parents in inculcating the habit of managing good financial behavior and being financially independent at an early age.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5397777",
  "comments": [
    {
      "author": "Upgrade00",
      "created_time": "May 08, 2022, 02:21:33 PM",
      "body": "Quote from: elevates on May 08, 2022, 02:16:24 PMOnce they understand these tokens, they can start collecting different types of digital currency all by themselves,What do you mean \"collecting\"? Are you suggesting they do tasks or offer services in exchange for digital currencies?Your topic title highlights bitcoin, but the posts content is suggesting introducing kids to a wide range of coins and tokens, which in my opinion would be a bad idea.You can start impacting healthy financial knowledge in children from an early age. That's the concept of the book 'Rich Dad; Poor Dad'. There is a limit to what they can understand at a young age, so you need to take an extra effort to learn teaching methods suitable for different ages if you really want to impact useful knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "May 08, 2022, 02:26:44 PM",
      "body": "Different techniques will be applicable to different kids, some will still prefer the traditional piggy banks as they are more into physical money, but at a bit older age when they already gasp the knowledge of bitcoin or understands what their parents saying into it they might as well get interested. I have experienced savings thru doing chores at home that is rewarded by my parents and save it in piggy banks.  In the future I plan to put up a own bitcoin wallet for my child than putting savings in bank. It will be better to hold crypto than invest now or keep in banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "May 08, 2022, 03:00:27 PM",
      "body": "Quote from: elevates on May 08, 2022, 02:16:24 PMI am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages. Hello, teacher.You work as a teacher, you should teach students according to the curriculum and subjects at school, Bitcoin is digital currency, not good, teach and introduce children in school too early with money, what they need is knowledge, about school subject matter, and don't mix them with digital currency.Today is sophisticated with existing technology, the younger generation in general they are familiar with Bitcoin or crypto, without being taught at school they already know it, it's a fact, I think, teaching them professionally about general school knowledge, automatically they will easily get to know Bitcoin in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "May 08, 2022, 03:04:29 PM",
      "body": "Quote from: Upgrade00 on May 08, 2022, 02:21:33 PMQuote from: elevates on May 08, 2022, 02:16:24 PMOnce they understand these tokens, they can start collecting different types of digital currency all by themselves,What do you mean \"collecting\"? Are you suggesting they do tasks or offer services in exchange for digital currencies?Your topic title highlights bitcoin, but the posts content is suggesting introducing kids to a wide range of coins and tokens, which in my opinion would be a bad idea.By collecting I mean Bitcoin which I have edited now. But, the collection of different coins phase hac meant here that they do not have the liberty to choose as it depends on their parentsQuote from: Upgrade00 on May 08, 2022, 02:21:33 PMYou can start impacting healthy financial knowledge in children from an early age. That's the concept of the book 'Rich Dad; Poor Dad'. There is a limit to what they can understand at a young age, so you need to take an extra effort to learn teaching methods suitable for different ages if you really want to impact useful knowledge.It depends again! I am not referring to a baby here which should be understood. But, I did edit it for everyone to understand the age group.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "May 08, 2022, 03:36:22 PM",
      "body": "learning to value the money handed to them as they study from grade school to high school. economics will be a good subject for them to learn first.as much as possible i want my kid to also learn BTC, but i wouldn't want him to be financially independent right when he is still a kid because this will have an impact on them. kids today are very different than the ones from the 90s. today kids are more rebellious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "May 08, 2022, 04:08:56 PM",
      "body": "I think it's easier to explain what Bitcoin is to children than to \"closed-headed\" adults. Normally, the thinking of adults and the way they learn about new things is by association with old things, with what they have been through and know. When the goal is to explain something new, past load sometimes plays a counter-productive role.I think that to really explain to children, we can slowly work the concepts, use social networks, make metaphors that - in my experience - they understand very well. I feel like cryptocurrencies are the currency of this generation, of digital natives, so it's very easy for them to 'accept' the concepts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "May 08, 2022, 04:22:03 PM",
      "body": "Quote from: elevates on May 08, 2022, 02:16:24 PMI am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages. Nice one good teacher but first of all, make sure the school that employed you is aware of your plan so you don't lose your job in that process. I will suggest that you teach them the concept of Bitcoin after school hours maybe you set up an extra moral lesson just to teach them Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "P2PECS",
      "created_time": "May 08, 2022, 04:57:22 PM",
      "body": "Quote from: GiftedMAN on May 08, 2022, 04:22:03 PMQuote from: elevates on May 08, 2022, 02:16:24 PMI am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages. Nice one good teacher but first of all, make sure the school that employed you is aware of your plan so you don't lose your job in that process. I will suggest that you teach them the concept of Bitcoin after school hours maybe you set up an extra moral lesson just to teach them Bitcoin.Yeah. It is not clear to me that the director and the board, or the parents, will welcome the measure. Either he lives in a place with very open-minded and tech-friendly people, like Silicon Valley, or he could run into a problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "May 08, 2022, 07:01:05 PMLast edit: May 08, 2022, 07:12:14 PM by franky1",
      "body": "its been hundreds of years of bank notesits been 50 years of debit/credit cardsno primary school teaches kids the benefits of minimum wage or the risks of debt. (economics)at most the curriculum teaches them 'if they have $1 and an apple is $0.57 how much change will they get.'its more of a math lesson. not a economics lesson.unless you can find a way to actually make bitcoin a worthy curriculum lesson. you are just wasting time teaching them something they wont see, touch, need for 10 more years. what you should be doing is using some of your salary or a class resource budget to purchase 0.00xbtc.and instead of rewarding kids with shiny gold stars. reward them with Xsats. which they can convert into games/books/pencils at the end of each semester by using you as the 'shop keeper' this atleast gives them a demonstration of earning/saving/spending",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oluwa-btc",
      "created_time": "May 08, 2022, 09:34:44 PM",
      "body": "Wanting to inculcate that into them young kids is a nice thought from you Op. You should do your possible best to make it understable for them at all cost. Construction of the Alphabets into Bitcoin related worda won't be nice as they can start reciting in the classroom, also as a singable poem to be recited at home and in school, this will be the first guide to them as juvilines. I have a little nephew I have been trying too school! Hopefully schools can get to add this up in the school curriculum. With time though!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "May 08, 2022, 09:49:01 PM",
      "body": "Quote from: elevates on May 08, 2022, 02:16:24 PMI am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages.If I was a kid in primary school, this is how I would love to learn about Bitcoin. Start first with colourful visualizations and illustrations about Bitcoin. They say a picture tells a thousand words. These visualizations and illustrations may come in a hardcopy or softcopy format. Kids love colourful pictures and this is were you'd pique my interest. Remember, first impression matters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sterbens",
      "created_time": "May 08, 2022, 10:12:49 PM",
      "body": "Quote from: elevates on May 08, 2022, 02:16:24 PMI am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages. Interesting way to get kids closer to bitcoin learning by introducing them to bitcoin wallet rather than the concept of ‘piggy bank’.It would be easy for them to correlate to bitcoin as a new type of digital money.I will not forbid you to teach something about Bitcoin. However, as far as I know about learning in schools, everything has been arranged, and a learning implementation plan has been mutually agreed upon in the elementary school education curriculum. Where a teacher already has a learning plan according to the instructions listed. Regardless of the way you teach, it may be quite difficult if in the teaching and learning process you do not apply the curriculum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "doomloop",
      "created_time": "May 10, 2022, 06:22:43 PM",
      "body": "Quote from: Davidvictorson on May 08, 2022, 09:49:01 PMQuote from: elevates on May 08, 2022, 02:16:24 PMI am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages.If I was a kid in primary school, this is how I would love to learn about Bitcoin. Start first with colourful visualizations and illustrations about Bitcoin. They say a picture tells a thousand words. These visualizations and illustrations may come in a hardcopy or softcopy format. Kids love colourful pictures and this is were you'd pique my interest. Remember, first impression matters.Illustrations are usually the best way to teach almost everyone and not just kids. When you create something as an illustration, and people get to look at the picture, it sticks faster to their head and it wouldn’t be something that they would forget easily. So, this is definitely the best way to teach them.If you should just make use of words to teach them, some of them would even forget it right at this point, but by using an illustration, and them looking at the pictures, it would be something that would stick to their head and they would be able to remember it every time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "May 10, 2022, 09:40:39 PM",
      "body": "Quote from: Sterbens on May 08, 2022, 10:12:49 PMQuote from: elevates on May 08, 2022, 02:16:24 PMI am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages. Interesting way to get kids closer to bitcoin learning by introducing them to bitcoin wallet rather than the concept of ‘piggy bank’.It would be easy for them to correlate to bitcoin as a new type of digital money.I will not forbid you to teach something about Bitcoin. However, as far as I know about learning in schools, everything has been arranged, and a learning implementation plan has been mutually agreed upon in the elementary school education curriculum. Where a teacher already has a learning plan according to the instructions listed. Regardless of the way you teach, it may be quite difficult if in the teaching and learning process you do not apply the curriculum.Would really be that tough but doesnt mean that its impossible to be teach up into those young learners although it would really be that challenging since kids arent something that could easilyable to take good grasps which basically means that you would really need to have that patience on making them really learn up even with the very basic.Its true that better to teach up bitcoin wallet and dont  really make it as a concept of piggy bank but well its still fits on that area but of coursethere should really be some emphasis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 10, 2022, 10:22:18 PM",
      "body": "Kids around the age of 10 or 11 should find it easy to understand opening bank accounts in today's generation. Some of them may even have it already. I think that's better start than using piggy bank analogy since the process is done electronically. They also know about downloading apps for their social media and they shouldn't have a problem downloading bitcoin wallets on their mobile.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "May 10, 2022, 10:55:20 PM",
      "body": "Quote from: Yogee on May 10, 2022, 10:22:18 PMKids around the age of 10 or 11 should find it easy to understand opening bank accounts in today's generation. Some of them may even have it already. I think that's better start than using piggy bank analogy since the process is done electronically. They also know about downloading apps for their social media and they shouldn't have a problem downloading bitcoin wallets on their mobile.It's not quite good, at that age they should be guided by their parents.And also, educating them about Bitcoin is a good idea but I think it's also in storing Bitcoin, and mobile wallets aren't a perfect place to hold Bitcoin, it should always be on a hardware wallet.I like the OP's plan, sounds good and interesting but I think, it's good if for educational purposes only, understand the basic information on this technology and how it will work, and its usage on it.  That's it and there's no financial investment involved.IMO, it should be 18 years old or above is the right way to teach them and introduce Bitcoin, 10 or 11 isn't the right age, they're still young at that age.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "May 10, 2022, 11:15:46 PM",
      "body": "Quote from: YOSHIE on May 08, 2022, 03:00:27 PMQuote from: elevates on May 08, 2022, 02:16:24 PMI am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages. Hello, teacher.You work as a teacher, you should teach students according to the curriculum and subjects at school, Bitcoin is digital currency, not good, teach and introduce children in school too early with money, what they need is knowledge, about school subject matter, and don't mix them with digital currency.Today is sophisticated with existing technology, the younger generation in general they are familiar with Bitcoin or crypto, without being taught at school they already know it, it's a fact, I think, teaching them professionally about general school knowledge, automatically they will easily get to know Bitcoin in the future.That's right, the OP should do a good job of the role and duties of a teacher first. Children need to be nurtured, cared for and learned many things to have a good life later not just taught to earn money.10-11 years old is probably quite early to teach them about bitcoin or how to collect bitcoins, educating kids early on how to collect bitcoin will affect their learning process. I really don't like this idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arwin100",
      "created_time": "May 10, 2022, 11:21:09 PM",
      "body": "Quote from: elevates on May 08, 2022, 02:16:24 PMI am a teacher by profession and think of this interesting action plan to teach the concept of Bitcoin to our primary kids (10-11) in their early stages. Interesting way to get kids closer to bitcoin learning by introducing them to bitcoin wallet rather than the concept of ‘piggy bank’.It would be easy for them to correlate to bitcoin as a new type of digital money.We parent then find it easy to teach them the concept of bitcoin and decentralization in a simpler way with the help of realistic examples.Once they understand, they can start collecting Bitcoin all by themselves at the permissible age by doing tasks or work they would realize its potential.This would be a start to teaching kids the power of decentralization and accumulation which will increase its value over the time and will also help parents in inculcating the habit of managing good financial behavior and being financially independent at an early age. I think you can only stick on what curriculum you are teaching on unless government will allow or insert this information to education side. I understand that this is needed to be discuss early on new generation because digitalization is new thing in future and they should be financially literate before going on something very risky at the first place.Hopefully we can see this added on school in future since this give best knowledge about investments and technology to young people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "topman21",
      "created_time": "May 10, 2022, 11:27:36 PM",
      "body": "People can learn about Bitcoin in different ways.For example, if someone comes to me to learn about Bitcoin, then I give him a good knowledge about Bitcoin.I think the best approach would be if the school taught something about this bitcoin.If boys are introduced to this from an early age, then one day people will know better about Bitcoin.They will either learn about Bitcoin as Out Knowledge so they will be able to move forward in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}