{
  "id": "topic_5470682",
  "title": "danherbias07",
  "author": "danherbias07",
  "created_time": "October 17, 2023, 12:09:09 PMLast edit: October 19, 2023, 11:03:11 AM by danherbias07",
  "content": "Edit: Scratch that. https://bitcointalk.org/index.php?topic=5470682.msg63019973#msg63019973Roblox Debunks 'Inaccurate' XRP Support Claims, Says Crypto Payments Not AllowedGood news gamers and crypto enthusiast especially those who support both XRP and Roblox. QuoteOnline gaming platform Roblox now allows its over 200 million monthly active users to make in-game purchases with XRP cryptocurrency. This new payment option is enabled through a collaboration between Roblox’s in-game payment processor Xsolla and crypto payment provider BitPay.https://blockonomi.com/roblox-users-can-now-buy-in-game-items-with-xrp/Bitpay tweeted about it here. https://x.com/BitPay/status/1714092687945547943?s=20News Alert Quote@Xsolla now accepts XRP(@Ripple) with BitPay as a payment method for their games, such as @Smitegame and @Roblox. You can use your favorite cryptocurrency to buy, play, and enjoy gaming like never before.This is good news for XRP. It might help them climb the ladder again and gain their reputation back in the cryptocurrency industry. Roblox has a lot of users and they are spending a lot of money for avatars and in-game premium items especially the streamers who are using this platform as their means to make money too. Let's wait if this will be a success after a quarter or maybe a year. It should somehow reflect in the value of XRP.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470682",
  "comments": [
    {
      "author": "Yogee",
      "created_time": "October 17, 2023, 12:29:13 PM",
      "body": "This is most likely one of the positive effect of Ripple's 50-50 victory against SEC.I don't think players who originally use 'online fiats' would transition to using XRP unless there's a significant advantage like cheaper transfer and processing fees. The crypto people playing the game would most likely appreciate this though. Withdrawing XRP from exchanges to top up their Roblox account is probably cheaper than transferring from banks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "siedemtrzy",
      "created_time": "October 17, 2023, 01:24:13 PM",
      "body": "Lol. Roblox is mostly for kids. Are they just trying to promote crypto and especially their coin to the young generation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "October 17, 2023, 02:12:21 PM",
      "body": "Quote from: siedemtrzy on October 17, 2023, 01:24:13 PMLol. Roblox is mostly for kids. Are they just trying to promote crypto and especially their coin to the young generation.That's part of it I guess. I mean almost every business targets the younger generation anyway. They may not have the financial capability yet but they have their tricks to convince the adults to pay for their fun and leisure.I got curious to the age distribution so I tried searching and here's what came up:https://backlinko.com/roblox-usersData is from 202025% - Under 929% - 9-1213% - 13-1616% - 17-2414% - 25+Their 2022 annual report says average daily active users is 56 million so that would translate to roughly 7.8 million for players aged 25 years and above assuming the distribution didn't change much since 2020. It's about 16.8 million if you include the 17-24 range. That's not a bad number to promote crypto right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "October 17, 2023, 08:49:41 PM",
      "body": "Quote from: siedemtrzy on October 17, 2023, 01:24:13 PMLol. Roblox is mostly for kids. Are they just trying to promote crypto and especially their coin to the young generation.They probably will ask their parents to pay in XRP if they have heard somewhere that their dads or moms are into cryptocurrencies. Anyway, good news as it is for XRP, and can get the term about accepting crypto for a game since Roblox has hundreds of millions of players. It's better if they also allow Bitcoin to get accepted into this game and other altcoins that are mostly popular in the market. Since they're partnered up with Bitpay then it's most likely that every cryptocurrency that they support can be used for payments in-game purchases.As long as we get to understand the context of it as this game accepts now crypto, I guess that's the most important part of this news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Venik",
      "created_time": "October 18, 2023, 03:47:39 AM",
      "body": "That's... interesting. The choice of XRP is not the most obvious. I would understand BTC, ETH, or even DOGE. I mean, memecoin for a kid's game sounds like one of the most obvious things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "October 18, 2023, 06:54:39 AM",
      "body": "Collaborations like this can help cryptocurrencies gain more mainstream recognition and utility. It will be interesting to see how this partnership unfolds and whether it positively impacts XRP's reputation and value in the crypto industry. This move might encourage other gaming platforms to consider integrating cryptocurrencies, thereby promoting their use in real-world applications.Let's keep an eye on this development and see how it progresses over the coming months. It could be a step in the right direction for XRP's resurgence in the crypto space. Thanks for sharing this exciting update! It’s indeed an exciting development to watch!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 18, 2023, 07:48:54 AM",
      "body": "They are partnerships between three companies that have digital assets and bank accounts between them, and these companies are Ripple, Roblox and Bitpay. The final payments will be settled in dollars via Bitpay, and XRP is used as a token to conduct these transactions between the user and Roblox. It is not possible to adopt or accept cryptocurrencies as a means of payment, otherwise Bitpay can accept many pairs, including Bitcoin.Institutions have begun to treat these tokens as if they were money, and this will be a reason for additional pressure from the SEC on XRP rather than a positive thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "October 18, 2023, 08:09:44 AM",
      "body": "Quote from: wuant8anhh on October 18, 2023, 07:49:49 AMXRP is highly praised, especially for cross-border payments. However, I'm skeptical it can reach its all-time high during the next uptrend season. The circulating supply is too high, and I don't believe XRP can achieve a market capitalization of 300 billion dollars. We can't imagine all the challenges in the global economy by 2025, the war is ongoing, and government control over money is likely to tightenWhen XRP promised that it would be an alternative to Bitcoin or investment or that its price would be 100 dollars, on the contrary, they aim for their currency to be stable and for its fees to be very low. Increasing the price of XRP means increasing fees and its volatility, as they have a very large supply, so they are trying for the currency to be stable at 1 dollar or $10 at best, more than they care about it reaching $100 or that its price is constantly increasing.I expect that it will be a model of new stablecoin that is not tied to one dollar or less volatile cryptocurrencies and is not an investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 18, 2023, 02:35:55 PM",
      "body": "Quote from: watranguah8h on October 18, 2023, 10:28:10 AMAnd are you interested in investing in XRP? Or are we more interested in new projects with better profit potential? When it comes to XRP now, we're only talking about its practical applications, not the profit when buying XRP. It's certainly not on the investment list of small investorsIs it? But before the case with SEC many small or big investors are flocking in. Now that they are back they are trying to regain the trust of those who left them which made the value lesser and this is one of their move. I think XRP is doing well because they are proving they cannot be trampled easily and will rise again eventually. Quote from: siedemtrzy on October 17, 2023, 01:24:13 PMLol. Roblox is mostly for kids. Are they just trying to promote crypto and especially their coin to the young generation.I see a lot of teens and middle-aged players enjoying this game because of the wide options of different puzzles and games that they could play. Check the Roblox streamers, they ain't kids. Most of them spend a lot of money on this game so that they can be watched more and here is how it could go. YouTube pays streamers - Streamers buy Robux through credit cards and now they have a choice to use XRP, especially for the crypto enthusiast that plays the game. Why not promote it with the young generation? Is it that bad? You can hear kids now saying \"They will invest it in Bitcoin.\" I don't think there's a problem with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 18, 2023, 05:23:23 PM",
      "body": "Honestly XRP is nothing but Ripple is a great company that works awesome for themselves. If they built something else I can see myself using it because the yare doing amazing work as a company. The trouble for me is that just because Ripple is working awesome doesn't mean that XRP is doing awesome, that is not the case and it doesn't work that way at all, I know that it may sound like that for a while but that is totally unrelated.Company making profit means the company is making it, for you to personally gain from the success of the company that means you have to be a partner or shareholder, you are not, you are just buying XRP and the price of XRP only goes up when other people buy XRP to make it go higher and this has nothing to do with the company.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "October 18, 2023, 06:06:12 PM",
      "body": "Quote from: Venik on October 18, 2023, 03:47:39 AM-snip- I mean, memecoin for a kid's game sounds like one of the most obvious things.I have never played this game. But, if the presence of XRP will become a good business opportunity such as trading game items, I think it will eventually be able to absorb some adult players. The types of NFT games in the crypto industry are also mostly children's games, but are played by adults because they have business value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vitya1982",
      "created_time": "October 18, 2023, 07:40:31 PM",
      "body": "Quote from: noorman0 on October 18, 2023, 06:06:12 PMQuote from: Venik on October 18, 2023, 03:47:39 AM-snip- I mean, memecoin for a kid's game sounds like one of the most obvious things.I have never played this game. But, if the presence of XRP will become a good business opportunity such as trading game items, I think it will eventually be able to absorb some adult players. The types of NFT games in the crypto industry are also mostly children's games, but are played by adults because they have business value.But you won't be able to get XRP in the game, you can only spend it. People will not come to play this game just because of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "October 18, 2023, 10:00:04 PM",
      "body": "Quote from: siedemtrzy on October 17, 2023, 01:24:13 PMLol. Roblox is mostly for kids. Are they just trying to promote crypto and especially their coin to the young generation.I played Roblox a while ago you won't believe there are lots of games for adults as well and the money they are pouring into these games is huge, that's why Ripples wanted to liquidate their coins through this game industry as well. I just don't get how will they assured that those people will use XRP instead of the traditional way of paying for Robux and not only that, they also have some problem regarding 3rd party sellers on social media groups where you can buy Robux cheaply via Fpass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 19, 2023, 11:01:42 AM",
      "body": "Some bad news came out. Roblox Debunks 'Inaccurate' XRP Support Claims, Says Crypto Payments Not Allowedhttps://decrypt.co/202077/roblox-debunks-inaccurate-xrp-claims-says-crypto-payments-not-allowedQuote“Xsolla now accepts XRP with BitPay as a payment method for their games such as Smite and Roblox,” BitPay wrote in a now-deleted post. “You can use your favorite cryptocurrency to buy, play, and enjoy gaming like never before,” the post claimed.The problem here is, Bitpay is the one who tweeted it so it should be a reliable source. So, what the heck is happening? QuoteWhen asked why the tweet was deleted, BitPay CMO Bill Zielke told Decrypt via email: “There was an error in the tweet. We will have more tweets about merchants accepting crypto in the near future. Stay tuned.”QuoteXsolla also stated that it had nothing to do with the now-deleted BitPay post. According to Xsolla’s website, the tech firm provided a gift card solution for Roblox in 2020 and is listed as a payment provider on Roblox’s website for credit card charges. Xsolla also provides payment solutions for numerous other gaming companies like Valve, Twitch, Epic Games, and Krafton, to name a few.Why would Bitpay make such an error? The mistake of Cointelegraph about the Bitcoin Spot ETF just happened and now this. This ain't right, why are they trying to manipulate the market?And a \"sorry\" should not be good enough. There are investors who would jump in with one news heard and how can they pull out if the market would suddenly be dumped? I am kind of angry about this type of strategy.I am going to add this link to the first page so that no one will be a victim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "October 19, 2023, 11:22:06 AM",
      "body": "^^ Yes, obvious this is fake news, and it seems that we are getting it lately, just like the Cointelegraph news about the Bitcoin Spot ETF.I will assume that there are some entities who want's to make some quick bucks, a manipulation for this kind of news lately.In any case, another lessons should be learn from us, not just believed any crypto related news, we have to really check it out first and verify the source so that we will not fall for this kind of manipulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "October 19, 2023, 12:42:30 PM",
      "body": "I wouldn't be surprised if some groups ramps up the call for better crypto regulation and that would encompass these fake news disguised as errors. There are no real negative repercussions for releasing false and misleading articles at the moment so the likes of Bitpay can do it and still get away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "October 19, 2023, 09:39:47 PM",
      "body": "Quote from: Yogee on October 19, 2023, 12:42:30 PMI wouldn't be surprised if some groups ramps up the call for better crypto regulation and that would encompass these fake news disguised as errors. There are no real negative repercussions for releasing false and misleading articles at the moment so the likes of Bitpay can do it and still get away.They might escape this for now but soon, people will lose their trust especially if the report seems to be a fake news more often. Well, the regulation can’t still make punish these kind of site especially if there’s no report about it, we just need to be more cautious on our end because fake news can ruin everything especially if you believe on that easily.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fullhdpixel",
      "created_time": "October 21, 2023, 08:29:59 AM",
      "body": "Quote from: Yogee on October 19, 2023, 12:42:30 PMI wouldn't be surprised if some groups ramps up the call for better crypto regulation and that would encompass these fake news disguised as errors. There are no real negative repercussions for releasing false and misleading articles at the moment so the likes of Bitpay can do it and still get away.This is the recommendation I hear from some users last time. Regulation or an increase of it. They think it will curb these issues down. I think it's funny if they call it an error. That was too unusual.But, it can be more like of a manipulation. It's not expected though from someone who is established already in the crypto field. Really? They are risking their reputation only for some quick gains? Theses guys should be a good example so that we can encourage more crypto users but it looks like they are a big threat now. I think there is a repercussion already for the fake news because it's already an issue in the past on many social media sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}