{
  "id": "topic_5436095",
  "title": "tavintavan",
  "author": "tavintavan",
  "created_time": "January 20, 2023, 05:55:16 AM",
  "content": "Желаете ли вы инвестировать энергетику нового поколения?Представьте, что у каждой семьи есть свой энергетический реактор.Который снабжает электроэнергией и теплом дом.Вы не зависите от энергетических компаний.Вы свободно передвигаетесь по миру вместе со своим миниреактором. Какие вы видите в этом плюсы и минусы?Каким вы представляете себе миниреактор?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436095",
  "comments": [
    {
      "author": "bonfire66",
      "created_time": "January 20, 2023, 09:13:12 AM",
      "body": "Может быть сначала надо  разобраться с Йотафоном, Йомобилем и добычей гелия-3 на луне в 2019 году? А уж потом на реакторы замахиваться?Вот сколько проектов ЛИЧНО ВЫ уже успели довести до логического завершения с большим профитом?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tavintavan",
      "created_time": "January 20, 2023, 12:09:20 PM",
      "body": "QuoteВот сколько проектов ЛИЧНО ВЫ уже успели довести до логического завершения с большим профитом?Такие вопросы тоже задавали Сатоши Накамура в начале пути. И не только ему Генри Форд, Ламборджини, Рей Крок и масса прочих.Так ответ то будет от вас? Какой по вашему мнению должен быть реактор, который обеспечит вашу семью и ваш дом теплом и электричеством.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "January 20, 2023, 03:25:40 PM",
      "body": "Какие-то странные вопросы. Есть прототип? Если есть, отправьте в Украину, например. Если он работает, то будут вам и инвесторы.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tavintavan",
      "created_time": "January 20, 2023, 04:07:24 PM",
      "body": "QuoteКакие-то странные вопросы. Есть прототип? Есть или нет, какая разница.Все очень просто, незачем усложнять ситуацию.Простой вопрос - простой ответ!Или я прошу у вас о сложном?Наберись смелости, и ответь.Какой по вашему мнению должен быть реактор, который обеспечит вашу семью и ваш дом теплом и электричеством?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "January 23, 2023, 11:46:03 AM",
      "body": "Прежде всего,  реактор должен быть из сплава рутения с торием. И покрашен в розовый цвет. Который излучает именно в том диапазоне спектра, который необходим для выработки наибольшего количества флуктуаций энергии. Пульсации флуктуаций вводят в резонанс дополнительный резервуар из дейтерида водорода, и он начинает испускать вторичные волны, которые воздейсвуют напрямую на мозг читателей данного топика, минуя надетые шапочки из фольги, потому что дейтерид сука штука диков проникучая, и только  шапочки из плутониевой фольги могут его задержать, но поскольку такой фольги практически невозможно достать, то люди, в принципе, ничем не экранированы от альфа-волн реактора. Так что деньги они понесут. Можете не сомневаться. Надо будет только добавить интенсивности!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tavintavan",
      "created_time": "January 23, 2023, 05:00:08 PM",
      "body": "и что смелости только писатель-фантаст набрался?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pavel.Savelev",
      "created_time": "January 23, 2023, 09:29:06 PM",
      "body": "Если есть реально прототип или хотя бы чертеж-идея-схема, обращайтесь. Познакомлю с человеком, который ищет и готов подтягивать деньги под такие проекты.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tavintavan",
      "created_time": "January 24, 2023, 02:02:47 AM",
      "body": "Вроде бы задал простой вопрос.А прямой ответ не получаю.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pavel.Savelev",
      "created_time": "January 24, 2023, 01:17:09 PM",
      "body": "Quote from: tavintavan on January 24, 2023, 02:02:47 AMВроде бы задал простой вопрос.А прямой ответ не получаю.Посмотрите варианты Серла, Гребенникова, различные варианты холодного ядерного синтеза, какие разработки были у Райха. Для населения конечно в этом одни плюсы. А вот правительство уже не сможет так контролировать внутренние процессы в стране, это же очередная игла на которую подсадили население. Мы не должны платить только за воздух, пока. А если можно доить, значит можно обязывать пахать на них все больше и больше.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tavintavan",
      "created_time": "January 24, 2023, 02:06:16 PM",
      "body": "Я вроде бы другой вопрос задавал. Или у поклонников блокчейна уже профессиональный сдвиг, никогда не отвечать прямо на поставленный вопрос.Не возможно создать, а тем более продать продукт, если люди сами не знают чего хотят",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pavel.Savelev",
      "created_time": "January 24, 2023, 09:32:08 PM",
      "body": "Quote from: tavintavan on January 24, 2023, 02:06:16 PMЯ вроде бы другой вопрос задавал. Или у поклонников блокчейна уже профессиональный сдвиг, никогда не отвечать прямо на поставленный вопрос.Не возможно создать, а тем более продать продукт, если люди сами не знают чего хотятКаким вы представляете себе миниреактор? - я ответил в прошлом сообщенииКакие вы видите в этом плюсы и минусы? - так же ответил в прошлом письме.Желаете ли вы инвестировать энергетику нового поколения? - ответил пару сообщений до этого.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "January 25, 2023, 10:37:10 AM",
      "body": "Вот у меня, например, ученая степень в области химии. Я написал более 20 научных статей. И работал  по специальности в разных странах типа Америке, Германии или Бельгии. Так что меня сложно провести на этой теме. И в реакторах я тоже разбираюсь. Проектировал их еще в ВУЗе. А какая ученая степень и квалификация у ТС?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tavintavan",
      "created_time": "January 25, 2023, 11:26:57 AMLast edit: January 25, 2023, 11:43:12 AM by tavintavan",
      "body": "Quote from: bonfire66 on January 25, 2023, 10:37:10 AMВот у меня, например, ученая степень в области химии. Я написал более 20 научных статей. И работал  по специальности в разных странах типа Америке, Германии или Бельгии. Так что меня сложно провести на этой теме. И в реакторах я тоже разбираюсь. Проектировал их еще в ВУЗе. А какая ученая степень и квалификация у ТС?Уау.А просветите нас автор 20 научных работ. Как происходит рекомбинация на границе электрода и электролита. А главное рекомбинация чего?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "January 25, 2023, 01:10:58 PM",
      "body": "Блин. Ну тут ведь электрохимия и коллоидная химия? А меня учили проектировать реакторы органического синтеза, чтобы варить мет Аспирин и анальгин... Но всеж хотелось бы чуть больше данных. Ибо, мне кажется, что только я один из посетителей данного раздела форума сможет хоть как-то оценить гениальность вашего изобретения.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tavintavan",
      "created_time": "January 26, 2023, 08:30:19 AM",
      "body": "bonfire66 - 66 это год рождения?Электрохимия и коллоидная химия, это проверка.А вообще ни о какой химии речи нет. Физика рулит",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tavintavan",
      "created_time": "January 27, 2023, 05:25:52 AMLast edit: January 27, 2023, 05:45:01 AM by tavintavan",
      "body": "Мини реактор в банке.Разница между электролизом и процессом Мейераhttps://youtu.be/p7OIg2DBsq0На видео показано как отличается процесс Мейера расщепление молекулы воды при помощи электрического поля.и обычный электролиз когда расщепление молекулы происходит за счет рекомбинации электронов между электродами и ионами.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "January 27, 2023, 09:15:54 AM",
      "body": "А на научные работы ссылки есть? Не на ролики, а на работы? Если что - я разберусь. Хотя с физикой у меня не очень. И математика в жизни мне тоже не потребовалось, ни синусы ни косинусы. Так, на уровне 3-4-5 класса. Плюс преобразование Фурье. Это все.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tavintavan",
      "created_time": "January 27, 2023, 11:59:35 AM",
      "body": "Не разберешься!!!Теорию поля надо знать.Градиент, ротор, оператор Набла, дифференциалы, интегралы и прочее, знать надо.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pavel.Savelev",
      "created_time": "January 30, 2023, 09:46:36 PM",
      "body": "У меня Химия была в школе, а физика в институте. После этого почти 20 лет я слабо касался этих тем. как говорится \"очень интересно, но ничего непонятно\". Можете пояснить неученым умам в чем тут соль? это ваше изобретение или вы просто опыты ставите на основе чьих то теорий?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}