{
  "id": "topic_5452310",
  "title": "Willywoahbot",
  "author": "Willywoahbot",
  "created_time": "May 11, 2023, 01:32:29 AM",
  "content": "Generally speaking, I am hesitant to trust stablecoins because of their tendency to rely on centralized methods to maintain their pegs, in addition to censorship concerns. It seems that there’s no great solution in terms of a stablecoin and that each has trade-offs. While I do not claim this is better than any particular stablecoin, I have been brainstorming an alternative decentralized solution and would appreciate any feedback on the soundness of this concept… also, I have a hard to believing this idea is unique… which, if something similar exists, please let me know. My philosophy behind this project is simple, I’d personally rather hold ETH, even in times of heightened volatility over holding any stablecoin. And my approach is straightforward: instead of attempting to create a stablecoin, which is notoriously difficult, the objective is to establish a more stable method of holding ETH… This is what brings me to a Sovereign Alternative Reserve Token (or SART)SART establishes a mechanism for maintaining a relatively stable ETH backing, aiming to provide users with a more stable store of value compared to directly holding ETH. This design demonstrates the potential for alternative digital assets to serve as effective stores of value without relying on stablecoins or centralized entities of any kind. The ultimate goal of SART is to offer an alternative solution for those seeking stability and security amidst economic uncertainty and market volatility.Token: The value of the SART Token is backed by the ETH held in its smart contract. The backing ratio is not fixed and may change as users interact with the contract, but it aims to provide a relatively stable value.By leveraging an inflationary backing mechanism, SART tokens aim to maintain a relatively stable value in relation to ETH, while offering additional benefits such as fee redistribution and deposit limits.A quick rundown of some basic functions: ConstructorThe constructor function initializes the SART contract with an initial supply of 10 SART tokens and sets the initial Ethereum backing to 0.1 ETH.DepositThe deposit() function allows users to deposit Ether (ETH) into the smart contract, minting new SART tokens proportional to the deposited amount and the current ETH backing. Users can deposit ETH up to their current deposit limit, which is determined by the getDepositLimit() function.WithdrawThe withdraw() function allows users to burn their SART tokens and withdraw the corresponding amount of ETH from the contract. A withdrawal fee is calculated as 1.5% of the withdrawn ETH amount, which is then proportionally distributed among the remaining token holders. This incentivizes users to hold their tokens for longer periods and maintain the stability of the token value.Features-ETH BackingThe SART Token contract is backed by ETH. The value of each SART token is determined by the ETH backing in the contract. As more ETH is deposited into the contract, the ETH backing per SART token increases, creating a stable and inflationary token value.-Fee RedistributionThe SART Token employs a fee mechanism, charging a 1.5% fee on withdrawals. These fees are redistributed to all SART token holders proportionally based on their token balance, rewarding long-term holders and incentivizing token holding.-Deposit Limits and Incremental IncreasesTo prevent large deposits from significantly impacting the ETH backing and token value, the SART Token contract employs deposit limits. Users can initially deposit up to 1 ETH, with the deposit limit increasing every 30 days based on the user's deposit history. This feature helps maintain a stable token value and promotes gradual growth.Use Cases-Store of ValueSART tokens can act as a stable store of value during periods of market volatility and/or economic uncertainty. By maintaining a relatively stable ETH backing and having a limited supply, SART tokens *may* offer users more stability compared to directly holding ETH.-Fee RedistributionThe fee redistribution mechanism incentivizes users to hold SART tokens, as they receive a share of the withdrawal fees collected by the contract. This can generate passive income for long-term token holders.Fair Distribution/ Equality-No Special Privileges for Contract OwnerThe SART Token is designed with fairness in mind, ensuring that the contract owner has no special privileges or advantages over other users after the token deployment. The contract owner is subject to the same rules, deposit limits, fees, etc. as any other user. Once the token is deployed, the contract owner's control is limited to administrative tasks, such as upgrading the contract, and they’ll have no influence on the token's value or distribution. Once confirming that everything is working correctly, ownership of contract will be renounced. What’s the likelihood of this working as intended? Obviously would still be subject to ETH’s volatility, but could impacts be alleviated by SART’s stability mechanism? Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452310",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "May 11, 2023, 06:51:45 AM",
      "body": "Well we already have a decentralized stablecoin backed by other crypto with reserves significantly exceeding liabilities. Its called DAI.But I'm not entirely sure if that's what you meant because you went from stablecoin to \"more stable way to hold ETH\". If ETH volatility overwhelms you, I recommend simply reducing your exposure. Use remaining cash to buy gold/stocks/bonds/real estate or even interest-bearing bank deposit. Why should I need a separate asset to reduce ETH volatility with extra limitations, fees and questionable effectiveness if i can simply own less coins? And if I really want to own this much ETH .. I can hedge currency risk using options or futures without limitations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "terciduk123",
      "created_time": "May 12, 2023, 12:25:45 AM",
      "body": "I just heard about SART, Maybe you can add some links about SART, website, and social mediaIf you think about it in a simple way, 0.1 ETH support for 10 SART is pretty good and strong, but once it's running it's usually not that simple. Apart from that, can you ensure the security of the ETH you save.Personally, I prefer stablecoins that are backed 100% by fiat (1:1).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}