{
  "id": "topic_5469992",
  "title": "Parvati_j",
  "author": "Parvati_j",
  "created_time": "October 11, 2023, 12:14:13 PM",
  "content": "We are now at the two most bullish months ever recorded in the history of bitcoin meaning, its time to buy now and accumulate more coins for those who have already bought some satoshi. It time to increase our bitcoin portfolio by adding some satoshi to it because, history might repeat itself and if we are not on the buying part, we might end up in regret. And mind you it has been advised not to buy any crypto currency with borrowed money so as not to let your emotion make your decision for you.I found this post on telegram so I decided to share it with my fellow bitcoin talk members.https://t.me/bitcoin/8502Though I haven't bought some satoshi yet but I look forward to buying some by tomorrow.Please, which wallet do you recommend for holding of bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469992",
  "comments": [
    {
      "author": "elevates",
      "created_time": "October 13, 2023, 04:09:37 AM",
      "body": "Donot wait for Bitcoin to be bullish or bearish. Anytime is good to invest in Bitcoin. If anyone has already bought Bitcoin then anytime is good to accumulate more. The main objective is to have Bitcoin till it reaches to a price point which can make anyone financially independent. You should read this article about investing $1 in Bitcoin everyday for 9 years. It would give you rough  idea about Bitcoin's potential and prospects in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 13, 2023, 07:48:35 AM",
      "body": "Quote from: Parvati_j on October 11, 2023, 12:14:13 PMPlease, which wallet do you recommend for holding of bitcoin? A hardware wallet would be recommended. But even an airgapped device running an electrum wallet on a TailOS built is enough. Keeping your device safe and your private keys safe, electrum is not a bad option because the above method may not be feasible for everyone.No need to be paranoid and lose sleep over wallet, there are many depending upon the type of device you primarily would be using to spend/receive on. Suggest you read more about the wallets and then continue with more questions so others can chime in with their opinions too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Parvati_j",
      "created_time": "October 13, 2023, 09:38:56 AM",
      "body": "Quote from: TheUltraElite on October 13, 2023, 07:48:35 AM A hardware wallet would be recommended. But even an airgapped device running an electrum wallet on a TailOS built is enough. Keeping your device safe and your private keys safe, electrum is not a bad option because the above method may not be feasible for everyone.No need to be paranoid and lose sleep over wallet, there are many depending upon the type of device you primarily would be using to spend/receive on. Suggest you read more about the wallets and then continue with more questions so others can chime in with their opinions too.congrats to me guys, i just purchased my first set of bitcoin in satoshis and i am planing on going into long term holding of bitcoin due to the possibilities that the price of bitcoin will continuously go up as time flies. though my coins are still on an exchange but i dont plan to keep them there even till tomorrow. the option of using a hardware wallet for now seem too expensive for me to afford, maybe i'll go with the electrum mobile wallet for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "October 13, 2023, 03:41:13 PM",
      "body": "Quote from: Parvati_j on October 13, 2023, 09:38:56 AMthe option of using a hardware wallet for now seem too expensive for me to afford, maybe i'll go with the electrum mobile wallet for now. The availability of hardware wallet is also an issue in India because we have to buy from the authorized resellers, so in case if you are buying a hardware wallet keep that in mind.Electrum on Android is good for small amount, I would say upto 1lakh but you have to be careful while downloading apps and never ever download any apps apart from play store, keep the play protect always on for extra safety.Use strong password, for wallet file and keep the recovery seed stored in physical format (write down in paper).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Parvati_j",
      "created_time": "October 14, 2023, 08:06:01 AMLast edit: October 14, 2023, 02:06:43 PM by Parvati_j",
      "body": "Quote from: Bitcoin Smith on October 13, 2023, 03:41:13 PMUse strong password, for wallet file and keep the recovery seed stored in physical format (write down in paper). Is this the only option for storing ones mnemonic phrase because to me it isn't safe at all, I have heard of cases where the outbreak of natural disaster destroyed some mnemonic phrase writer in paper, though some persons recommend using water proof and fire proof safe to keep your written mnemonic phrase, but during unexpected natural disaster like that of Libya, when my life is at stake would I even think of saving my safe with me mnemonic inside? NoMy point is there must be a safe way to store you phrase online, maybe be encrypting a doc or PDF with you mnemonic inside and then saving it in your google drive, something like that or any other way but there must be a way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "October 14, 2023, 08:11:20 PM",
      "body": "Quote from: Parvati_j on October 14, 2023, 08:06:01 AMQuote from: Bitcoin Smith on October 13, 2023, 03:41:13 PMUse strong password, for wallet file and keep the recovery seed stored in physical format (write down in paper). Is this the only option for storing ones mnemonic phrase because to me it isn't safe at all, I have heard of cases where the outbreak of natural disaster destroyed some mnemonic phrase writer in paper, though some persons recommend using water proof and fire proof safe to keep your written mnemonic phrase, but during unexpected natural disaster like that of Libya, when my life is at stake would I even think of saving my safe with me mnemonic inside? NoMy point is there must be a safe way to store you phrase online, maybe be encrypting a doc or PDF with you mnemonic inside and then saving it in your google drive, something like that or any other way but there must be a way.There is no such thing in reality, cause anything that goes into online is not safe anymore, that is why it's recommended to store your recovery seeds locally.If you are worried about the single point of failure then multi signature wallet is an option like 2 of 3 or 2 of 4 and so on, so you create three recovery seeds and can store three in different places where you feel it will be safe then you can access your bitcoin wallet even if one of those seeds lost on such unfortunate instance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}