{
  "id": "topic_5441150",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "February 24, 2023, 08:31:36 PMLast edit: March 04, 2023, 07:52:54 PM by zasad@",
  "content": "https://www.minima.globalhttps://www.minima.global/aboutтокеномикаhttps://docs.minima.global/docs/about/tokendistributionО проектеhttps://docs.minima.global/docs/about/whatisminimaЧем понравился проект. Мобильный блокчейн, в который уже интегрированы слои как в Эфириуме для масштабируемости и скорости. Проект с 2019 года, партнерства с автопроизводителями. Оптимизирован для мобильных устройств, на которые можно установить ноду.Разжевывать токеномику не буду. Из 1,000,000,000 токенов 125,000,000 будут на блокчейне эфириума как обёрнутые ERC-20 токены, остальные в блокчейне минима. Вывод на биржи в нативном блокчейне планируют открыть в 3-4 квартале 2023 года.Покупки инвесторовДля криптанов будет продаваться от 21 до 30 центов, требуется КИС и РФ и Беларусь запрещены.Идея как с аптосом. Подождать пока хомяки продадут, дождаться снижения в область 10-15 центов и купить на любой бирже.  Не получится, забуду. После токенсейла много иксов не дадутНа  таблицу обратите вниманиеЧасть токенов инвесторов будут в блокчейне эфириума а часть в нативном блокчейне.Ноды и гайдыhttps://bitcointalk.org/index.php?topic=5441150.msg61825938#msg61825938____Не воспринимайте эту информацию как финансовый совет, проведите свое исследование. Я не имею отношения к проекту.RU телеграммhttps://t.me/minima_ru",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5441150",
  "comments": [
    {
      "author": "klarki",
      "created_time": "February 24, 2023, 10:41:14 PM",
      "body": "Долго я ждал появление треда о MINIMA   Учитвая токеномику, выглядит все очень печальненько(( у пресидов совсем нет лока, так что с большой вероястностью сразу после TGE и листинга Minima они начнут. сливать свои запасы. У тестнетеров все еще печальнее выходит(",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "February 25, 2023, 12:07:54 PM",
      "body": "Quote from: klarki on February 24, 2023, 10:41:14 PMДолго я ждал появление треда о MINIMA   Учитвая токеномику, выглядит все очень печальненько(( у пресидов совсем нет лока, так что с большой вероястностью сразу после TGE и листинга Minima они начнут. сливать свои запасы. У тестнетеров все еще печальнее выходит( Приват сид. После ТГЕ разлочится 33%, но торговаться на эфириуме будет только 10% их токеновИз 125,000,000 Приват сид         7 490 000сид                    15 700 000приват раунд 1   10 730 000приват раунд 2   5 250 000 паблик сейл        60 000 000Остальное, казначейство и тпСчитал на лету, мог ошибиться.https://docs.minima.global/docs/about/tokendistributionНакормить хомяков в начале по 40-60 центов возможно, но потом дамп и выкуп перед добавлением нативных токенов на биржи.__Но есть и другой сценарий, польют сразу вниз дешевле 20 центов и покупатели паблик сейла и приват раунда 2 в минусах.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "3meek",
      "created_time": "February 27, 2023, 06:00:28 AM",
      "body": "Я так понимаю что это новый убийца соланы и аптоса появляется...   Раз уж тут даже кларки ожидает что проект будет годный, то пожалуй и я тоже буду просматривать за ним... Интересно когда торги начнутся? Судя по тому что в локали появилась ветка, то ждать осталось немного...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "February 27, 2023, 09:04:10 AM",
      "body": "Долго же до Нас MINIMA добиралась. С проектом я косвенно знаком по соседствующему форуму. Там проект даже проводил подписную баунти кампанию с оплатой в долларах. В данном топике не хватает информации о получении MINIMA посредством работающей ноды. По данной ссылке можно найти инструкцию по установке ноды. Либо можно посмотреть инструкцию в виде видео гайда.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "February 27, 2023, 09:30:59 AM",
      "body": "Quote from: bakasabo on February 27, 2023, 09:04:10 AMДолго же до Нас MINIMA добиралась. С проектом я косвенно знаком по соседствующему форуму. Там проект даже проводил подписную баунти кампанию с оплатой в долларах. В данном топике не хватает информации о получении MINIMA посредством работающей ноды. По данной ссылке можно найти инструкцию по установке ноды. Либо можно посмотреть инструкцию в виде видео гайда.добавил в 1 пост.На каком форуме этот проект обсуждался?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "February 27, 2023, 01:51:20 PMLast edit: February 27, 2023, 06:27:39 PM by klarki",
      "body": "Quote from: zasad@ on February 27, 2023, 09:30:59 AMдобавил в 1 пост.На каком форуме этот проект обсуждался?Не знаю о каком форуме пишет bakasabo, но видел обсуждение на cryptotalk (форум от Yobit) + там же проводилась подписная кампания, он оплата была в тестовых монетах Minima.Quote from: bakasabo on February 27, 2023, 09:04:10 AMДолго же до Нас MINIMA добиралась. С проектом я косвенно знаком по соседствующему форуму. Там проект даже проводил подписную баунти кампанию с оплатой в долларах. В данном топике не хватает информации о получении MINIMA посредством работающей ноды. По Только одно но, разве регистрация в программе Incentive Reward Program открыта?Иформация о листинге на бирже Bitfinex: https://t.me/Minima_Global/132587Quote from: 3meek on February 27, 2023, 06:00:28 AMЯ так понимаю что это новый убийца соланы и аптоса появляется...   Раз уж тут даже кларки ожидает что проект будет годный, то пожалуй и я тоже буду просматривать за ним... Интересно когда торги начнутся? Судя по тому что в локали появилась ветка, то ждать осталось немного... Что  Я где-то писал, что считаю Minma годнотой?)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "February 28, 2023, 07:49:15 AM",
      "body": "Quote from: klarki on February 27, 2023, 01:51:20 PMQuote from: zasad@ on February 27, 2023, 09:30:59 AMНа каком форуме этот проект обсуждался?Не знаю о каком форуме пишет bakasabo, но видел обсуждение на cryptotalk (форум от Yobit) + там же проводилась подписная кампания, он оплата была в тестовых монетах Minima.Только одно но, разве регистрация в программе Incentive Reward Program открыта?Именно так, на Cryptotalk десятки страниц обсуждения (вперемешку полезные посты с водой), и программа вознаграждений сегодня завершается (можно было получать по 1 Minima в день). Начисления запланированы на март 2023. Купить сейчас Minima можно на https://switchere.com/ по 25 центов, либо на https://livepresale.minima.global/. Считаю что не лишним будет добавить в стартовый пост ссылка на ру сообщество в телеграмме https://t.me/minima_ru. Оно весьма отзывчивое. Много полезной инфы можно почерпнуть там.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "February 28, 2023, 04:00:59 PMLast edit: February 28, 2023, 04:33:04 PM by zasad@",
      "body": "Quote from: bakasabo on February 28, 2023, 07:49:15 AMQuote from: klarki on February 27, 2023, 01:51:20 PMQuote from: zasad@ on February 27, 2023, 09:30:59 AMНа каком форуме этот проект обсуждался?Не знаю о каком форуме пишет bakasabo, но видел обсуждение на cryptotalk (форум от Yobit) + там же проводилась подписная кампания, он оплата была в тестовых монетах Minima.Только одно но, разве регистрация в программе Incentive Reward Program открыта?Именно так, на Cryptotalk десятки страниц обсуждения (вперемешку полезные посты с водой), и программа вознаграждений сегодня завершается (можно было получать по 1 Minima в день). Начисления запланированы на март 2023. Купить сейчас Minima можно на https://switchere.com/ по 25 центов, либо на https://livepresale.minima.global/. Считаю что не лишним будет добавить в стартовый пост ссылка на ру сообщество в телеграмме https://t.me/minima_ru. Оно весьма отзывчивое. Много полезной инфы можно почерпнуть там.А что они продают? У них паблик сейл с 14 по 28 февраля и цена 28 февраля $0.30QuoteКак я получу свои $WMINIMA?Ваш Wrapped Minima ($WMINIMA) будет отправлен на адрес кошелька Metamask, с помощью которого вы приобрели монеты.Где я смогу продать $WMINIMA?Мы объявим об биржах, на которых Wrapped Minima ($WMINIMA) будут размещены в марте.https://livepresale.minima.global/faq.phpСмартконтракт. Пока монеты не движутсяhttps://www.coingecko.com/en/coins/wrapped-minimahttps://etherscan.io/token/0x669c01CAF0eDcaD7c2b8Dc771474aD937A7CA4AF",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "3meek",
      "created_time": "February 28, 2023, 07:01:25 PM",
      "body": "Так а что за проект-то вообще? Шумихи вроде бы покамест нигде не наблюдаю, кроме как в этой ветке полтора поста с не очень внятными ссылками... Кто-то вообще собирается вкидываться в этот щиток? Когда торги начинаются и на каких биржах?Короче надо дождаться шума, если такой будет, как например вокруг блёра было...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "March 01, 2023, 01:40:42 PM",
      "body": "Quote from: 3meek on February 28, 2023, 07:01:25 PMТак а что за проект-то вообще? Шумихи вроде бы покамест нигде не наблюдаю, кроме как в этой ветке полтора поста с не очень внятными ссылками... Кто-то вообще собирается вкидываться в этот щиток? Когда торги начинаются и на каких биржах?Короче надо дождаться шума, если такой будет, как например вокруг блёра было...Я писал кратко о проекте, давай назовем его мобильный эфириум. Торги начнутся 14 марта или немного позднее только токенами ERC-20.Мои планы сделать х2 если будет возможность, забрать вложенное и ждать.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "3meek",
      "created_time": "March 02, 2023, 08:14:06 AM",
      "body": "Quote from: zasad@ on March 01, 2023, 01:40:42 PMQuote from: 3meek on February 28, 2023, 07:01:25 PMТак а что за проект-то вообще? Шумихи вроде бы покамест нигде не наблюдаю, кроме как в этой ветке полтора поста с не очень внятными ссылками... Кто-то вообще собирается вкидываться в этот щиток? Когда торги начинаются и на каких биржах?Короче надо дождаться шума, если такой будет, как например вокруг блёра было...Я писал кратко о проекте, давай назовем его мобильный эфириум. Торги начнутся 14 марта или немного позднее только токенами ERC-20.Мои планы сделать х2 если будет возможность, забрать вложенное и ждать.То есть ты купил на пресэйле, я так понимаю... Прошёл кус? И как написал Ратимов, тебя не смутило то что они собирали бабки даже с российских карточек?   Я не глумлюсь и искренне желаю тебе поднять столько сколько возможно, но проект действительно вызывает подозрения...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "March 02, 2023, 10:37:56 AM",
      "body": "Quote from: Ratimov on March 02, 2023, 08:41:14 AM Не нашел инфы по фондам, кто стратегический инвестор вообще у этого проекта? Этого проекта даже на крипторанке нет.https://dropstab.com/coins/minima/fundraisingQuote from: 3meek on March 02, 2023, 08:14:06 AMТо есть ты купил на пресэйле, я так понимаю... Прошёл кус? И как написал Ратимов, тебя не смутило то что они собирали бабки даже с российских карточек?   Я не глумлюсь и искренне желаю тебе поднять столько сколько возможно, но проект действительно вызывает подозрения... Мои посты по диагонали читаешь  ?Какой в ..... КИС и покупка с банковских карточек? Я топлю за децентрализованную торговлю и возможно куплю эту монету только после снижения желательно на дексе по 10-15 центов чисто для спекуляций.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "March 02, 2023, 03:59:14 PM",
      "body": "Quote from: Ratimov on March 02, 2023, 10:48:58 AM~ А что по тестнету, кто в курсе?Насколько мне известно, нодоводы получат свои вознаграждения только после запуска нативного токена, а не эти обертыши эфировские, и судя по срокам это будет ближе к 3-4 кварталу 2023 года. Также участникам тестнета, которые прошли KYC предлагали участие в сейле по $0.21 за токен. На мой взгляд сообщество серьёзно так кинули. Поэтому лично я считаю что этот проект в топку.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "March 02, 2023, 05:10:27 PM",
      "body": "Любая продажа токенов сейчас это очень большой шанс получить свежих люлей от СЕК. 14 февраля по 21 цент у всех была возможность купить. И для верующих в проект 27 центов не большая цена.___Все о проекте слышали и все молчали",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "March 03, 2023, 02:34:10 PM",
      "body": "Quote from: Ratimov on March 02, 2023, 10:48:58 AMА что по тестнету, кто в курсе?Как и везде, кто ставил держал (держит) одну ноду получит сущие копейки (500-600 Minima). Настроение в комьюнити довольно пессимистичное, многие готовы сразу при возможность лить) О покупке на пресейле мало кто говорит.Хех, вот что вчера прилетело на мыло:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "March 03, 2023, 02:39:18 PM",
      "body": "Поэтому я не участвую во всяких тестнетах, читеров много и награда сомнительная.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klarki",
      "created_time": "March 03, 2023, 07:41:23 PM",
      "body": "Quote from: Ratimov on March 03, 2023, 04:07:21 PMQuote from: zasad@ on March 03, 2023, 02:39:18 PMПоэтому я не участвую во всяких тестнетах, читеров много и награда сомнительная.Читеры везде есть, где можно заработать, вряд ли это может быть объективной причиной тому, чтобы не участвовать в тестнетах... ну разве только с 1 аккаунта.  Это всё равно, что сказать, что я не участвую в крипте, так как там полно манипуляций. Только как это мешает заработать лично тебе. Награды порой крайне не сомнительны, тестнеты umee, canto, aptos, как бы намекают на это. В этом году отлично стрельнул тестнет ipor, где имея ферму, можно было неплохо поднять бабла. Как говорится, каждый мог...но не уделил внимания.А так, куда не плюнь, читеры везде, на всех стадиях проекта. В тестнете читеры, на сейле читеры, в ретродропе читеры, на бирже читеры, итд.Ну может ему проще сделать инвест в интересующий его проект, нежели заморачиваться со всякими там тестнетами и т.п. Но соглашусь, пока есть возможность кормиться с тестнетов и других активностей, даже совсем зелененькие могут начать свой путь с этого направления и заработать)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "madnessteat",
      "created_time": "March 04, 2023, 07:15:33 AM",
      "body": "Quote from: klarki on March 03, 2023, 07:41:23 PM^Абсолютно с вами согласен. Многие как раз на такого рода активностях поднимают свои первые серьезные деньги, т.к. определенные проекты оказываются достаточно щедры к своему сообществу. На мой взгляд начать свой путь в криптовалютном мире не вкладывая собственных денег это самый лучший вариант, т.к. в случае краха человек ничего не теряет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "March 04, 2023, 07:30:53 AM",
      "body": "Quote from: Ratimov on March 03, 2023, 04:07:21 PMQuote from: zasad@ on March 03, 2023, 02:39:18 PMПоэтому я не участвую во всяких тестнетах, читеров много и награда сомнительная.Читеры везде есть, где можно заработать, вряд ли это может быть объективной причиной тому, чтобы не участвовать в тестнетах... ну разве только с 1 аккаунта.  Это всё равно, что сказать, что я не участвую в крипте, так как там полно манипуляций. Только как это мешает заработать лично тебе. Награды порой крайне не сомнительны, тестнеты umee, canto, aptos, как бы намекают на это. В этом году отлично стрельнул тестнет ipor, где имея ферму, можно было неплохо поднять бабла. Как говорится, каждый мог...но не уделил внимания.А так, куда не плюнь, читеры везде, на всех стадиях проекта. В тестнете читеры, на сейле читеры, в ретродропе читеры, на бирже читеры, итд.Благодаря манипуляторам можно попробовать прокатится в ракете вмести с ними, как и с аптосом. В Суи, Сеи у меня есть по 1 аккаунту но тратить время на мульти аккаунты и аренду серверов на ноды, и ждать несколько лет я не хочу. ___И насчет потерь я не согласен, большая трата времени, много тупой работы, затраты на сервера и мульти аккаунты.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}