{
  "id": "topic_5444135",
  "title": "Wisdom O",
  "author": "Wisdom O",
  "created_time": "March 09, 2023, 02:56:52 PM",
  "content": "Hi everyone,As a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.Don't really know where to start but hopefully I will with your help.I thought an idea is really welcome.Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444135",
  "comments": [
    {
      "author": "examplens",
      "created_time": "March 09, 2023, 03:19:39 PM",
      "body": "Quote from: Wisdom O on March 09, 2023, 02:56:52 PMAs a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.Don't really know where to start but hopefully I will with your help.it would be best if you did not trust unknown people on the internet. you can ask for advice here or anywhere, but your money is at stake, so always think carefully about what you are doing.When you say, you are a newbie, what exactly do you mean? Two years ago you also asked for advice on investing in Bitcoin, what happened? Why are you still a beginner even after 2 years?Quote from: Wisdom O on July 11, 2021, 08:13:07 PMHi everyone, I want to learn about Bitcoin and investing. I need help on how to go about investing in Bitcoin which I don't know if I can take the risk. I have $3k which I want to keep in the bank but I'm thinking of investing it into Bitcoin. If I purchase Bitcoin now, is their any way I can profit from it from now till next year May? I am planning of using the money next year for business.Should I take the risk of investing in Bitcoin now or better still put it in the bank?Will I lose my money if I invest now?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "March 09, 2023, 03:21:26 PM",
      "body": "Do you still consider yourself a beginner, even though by your own admission you started trading in 2021?Quote from: Wisdom O on September 01, 2021, 11:03:46 PMI just started trading not that long now and I don't know why people doesn't always talk about Spot trading and how less risky it can be when compared to Future trading. I found more pleasure in spot trading that had given me peace of mind without bothering myself of the fear of losing trades. Although spot trading is not a get rich quick type of trading because I don't have to leverage, making it very slow to make good profits but best for me. ~snip~What I can give you as advice is not to invest more than you are ready to lose, and not to invest in something you don't fully understand. There is a lot of useful content on the forum, and it is best to start reading sticky topics in this board that can help you as a beginner, and it is not bad to visit the Meta board as well. After that, simply start from the top of the forum and scroll down in search of new content, in the end you will surely find something that interests you.What you certainly won't find is some kind of formula for success in life, because no one should or can make decisions for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 09, 2023, 03:26:36 PM",
      "body": "There is no perfect way to succeed in crypto but the first thing you should do is educate your self learn as much as you can about crypto, bitcoin history, trading, trends, etc...Crypto is too volatile so I'd like to suggest also learn risk management in trading you should learn when to buy and sell and the safest way to trade is always use stop-loss orders.And take note this does not get rich quick scheme so don't expect to get rich overnight. Trading requires long-term and patience.If you want a source to learn about trading then start reading this below.- https://github.com/SpiralDevelopment/Awesome-Crypto-Trading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "March 09, 2023, 03:34:01 PM",
      "body": "Quote from: Wisdom O on March 09, 2023, 02:56:52 PMHi everyone,As a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.Don't really know where to start but hopefully I will with your help.I thought an idea is really welcome.Thanks.All I know is knowledge and education, you will only become confident if you know what to do and how to address issues on whatever issue you are facing, and starts by reading a lot of searching for the truth, the trust will set you free and it will give you the confidence to proceed in the right decision, just like a doctor who is confident on what to prescribe to his patient, so do you if you are knowledgeable, knowledge is indeed power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "March 09, 2023, 03:35:03 PM",
      "body": "Quote from: Wisdom O on March 09, 2023, 02:56:52 PMAs a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.Don't really know where to start but hopefully I will with your help.If you aspire to learn, then you are in the right place. Or I can say that you are in the best place you can benefit from cognitively.If you are one of the pioneers of the forums and do not hesitate to share your experiences and ideas with others, then you will certainly not find many difficulties during your attempts to deal with Bitcointalk. The most important thing that I can advise you is to look at the fixed topics in each of the meta and beginners sections, and do not hesitate to publish a topic in which you raise any issue that you did not understand or any difficulties you encountered while trying to learn something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "March 09, 2023, 03:41:54 PM",
      "body": "Quote from: Wisdom O on March 09, 2023, 02:56:52 PMAs a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.1. Don't be over confident2. Calm down and learn crypto3. Avoid starting with altcoins, bitcoin should be your starting point4. Learn about bitcoin and cryptocurrency in general5. Never get tired of learning and making research to know more6. Invest on what you can afford to loose because everything is all about taking risk7. Don't be enticed by cryptocurrency influencers and promoters, the may push you into taking a wrong step8. Learn to keep things in secret especially your bitcoin investment access9. Avoid centralized exchanges if possible or don't put your main investment on them10. Be active onnthe forum and learn from what others pist or taughts11. Don't assume what you don't know, experience your learning ground and be well equipped12. Have confidence in yourself and take risk that's worth going for with bitcoin13. Invest or trade and monitors your asset and follow up the events and news happening in crypto worldQuote from: Wisdom O on March 09, 2023, 02:56:52 PMDon't really know where to start but hopefully I will with your help.You will be the one to help yourself by learning and here is a good ground for your learning process, why not take a step and every possible advantage to ensure you make a growth here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MaterialMouse69",
      "created_time": "March 09, 2023, 03:43:25 PM",
      "body": "Quote from: Wisdom O on March 09, 2023, 02:56:52 PMHi everyone,As a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.Don't really know where to start but hopefully I will with your help.I thought an idea is really welcome.Thanks.From my experience, I think you can say you can be confident and reliable on your decisions when you really trade by your own. Because you'll experience good and bad events in trading which can be part of your development in trading. But always do your own research and composed when making a decision, because your assets might gone in just a second. I suggest you to look up some ideas thru the internet, explore more so you can have ideas that makes you confident in decision you'll make. Having a connection like this with people would really help you since they'll give you ideas so I think it's smart asking here for tips and advices. Good luck in your trading journey!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "March 09, 2023, 04:51:36 PM",
      "body": "Quote from: examplens on March 09, 2023, 03:19:39 PMQuote from: Wisdom O on March 09, 2023, 02:56:52 PMWhen you say, you are a newbie, what exactly do you mean? Two years ago you also asked for advice on investing in Bitcoin, what happened? Why are you still a beginner even after 2 years?Lol... As funny as this may appear, it's still possible. It might be that the user is disguising as a newbie to attract sympathy or help or for whatever reason(s).But in a Real sense, some users open account here and may not find here friendly and hence abandoned it and may decide to return later, hence their newbie status remains.Again, some people can be here for more than 2yrs and even grow their account upto senior member rank, but the knowledge of bitcoin in their head is like that of a newbie. So, it would be correct if they address themselves as newbies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "March 09, 2023, 06:18:59 PM",
      "body": "Checked your post history. Your issue isn't anything concerning confidence and reliability — it's the lack of knowledge.If you're not willing to study a lot, then you're pretty much stuck.* If you like reading articles: https://coindesk.com/learn* If you like reading books: https://theinternetofmoney.info/* If you like watching videos: https://www.youtube.com/playlist?list=PLPQwGV1aLnTuN6kdNWlElfr2tzigB9NnjSecurity related:* https://chainsec.io* https://www.lopp.net/bitcoin-information/security.htmlIf you want to get more technical* https://github.com/bitcoinbook/bitcoinbook#chapters* https://github.com/ethereumbook/ethereumbook#chapters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "March 09, 2023, 06:40:59 PM",
      "body": "Quote from: KingsDen on March 09, 2023, 04:51:36 PMQuote from: examplens on March 09, 2023, 03:19:39 PMQuote from: Wisdom O on March 09, 2023, 02:56:52 PMWhen you say, you are a newbie, what exactly do you mean? Two years ago you also asked for advice on investing in Bitcoin, what happened? Why are you still a beginner even after 2 years?Lol... As funny as this may appear, it's still possible. It might be that the user is disguising as a newbie to attract sympathy or help or for whatever reason(s).But in a Real sense, some users open account here and may not find here friendly and hence abandoned it and may decide to return later, hence their newbie status remains.Again, some people can be here for more than 2yrs and even grow their account upto senior member rank, but the knowledge of bitcoin in their head is like that of a newbie. So, it would be correct if they address themselves as newbies. That may be true, but I think OP has spent enough years on the forum not to know how to use the search engine. I checked his post history and I don’t think OP should be making this kind of thread. For someone who started trading spots in 2021, he should have a decent knowledge of bitcoin. This may be another meriting fishing thread, if he doesn’t get merits we probably won’t see OP for another five months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "March 09, 2023, 07:47:13 PM",
      "body": "Firstly read all pinned post in your board of interest that’s a good way to start. And depending on your knowledge of crypto-currency you had before joining I Think making post should be less for you and only when you have some questions answered but always first research on it.And other things you need to do is follow the rules of the forum, if you had thought the forum as quick riches forum debunk those thoughts and work for your development.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AakZaki",
      "created_time": "March 09, 2023, 07:58:59 PM",
      "body": "It's actually quite simple, you just need to study harder and learn what you have to do in this forum. You can find a lot of knowledge through this forum. Being a successful newbie can start with being a good member who can contribute more to the forum. if you want to invest as a beginner make sure you do your research, because the research will determine whether you should do it or not. Crypto investment is quite risky, you should know that. But the benefits are also greater. You have to learn how to trade and such.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wisdom O",
      "created_time": "March 09, 2023, 08:01:33 PMLast edit: March 10, 2023, 07:03:54 PM by mprep",
      "body": "Quote from: examplens on March 09, 2023, 03:19:39 PMQuote from: Wisdom O on March 09, 2023, 02:56:52 PMAs a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.Don't really know where to start but hopefully I will with your help.it would be best if you did not trust unknown people on the internet. you can ask for advice here or anywhere, but your money is at stake, so always think carefully about what you are doing.When you say, you are a newbie, what exactly do you mean? Two years ago you also asked for advice on investing in Bitcoin, what happened? Why are you still a beginner even after 2 years?Quote from: Wisdom O on July 11, 2021, 08:13:07 PMHi everyone, I want to learn about Bitcoin and investing. I need help on how to go about investing in Bitcoin which I don't know if I can take the risk. I have $3k which I want to keep in the bank but I'm thinking of investing it into Bitcoin. If I purchase Bitcoin now, is their any way I can profit from it from now till next year May? I am planning of using the money next year for business.Should I take the risk of investing in Bitcoin now or better still put it in the bank?Will I lose my money if I invest now? Honestly, I wasn't serious with what I wanted at that time that made me abandon knowledge for pleasure, this single act of ignorance really make opportunity pass me by. actually am not a newbies like that but I want to start as one, I really want to make it right this time.Quote from: Pokapoka124 on March 09, 2023, 06:40:59 PMQuote from: KingsDen on March 09, 2023, 04:51:36 PMQuote from: examplens on March 09, 2023, 03:19:39 PMQuote from: Wisdom O on March 09, 2023, 02:56:52 PMWhen you say, you are a newbie, what exactly do you mean? Two years ago you also asked for advice on investing in Bitcoin, what happened? Why are you still a beginner even after 2 years?Lol... As funny as this may appear, it's still possible. It might be that the user is disguising as a newbie to attract sympathy or help or for whatever reason(s).But in a Real sense, some users open account here and may not find here friendly and hence abandoned it and may decide to return later, hence their newbie status remains.Again, some people can be here for more than 2yrs and even grow their account upto senior member rank, but the knowledge of bitcoin in their head is like that of a newbie. So, it would be correct if they address themselves as newbies. That may be true, but I think OP has spent enough years on the forum not to know how to use the search engine. I checked his post history and I don’t think OP should be making this kind of thread. For someone who started trading spots in 2021, he should have a decent knowledge of bitcoin. This may be another meriting fishing thread, if he doesn’t get merits we probably won’t see OP for another five months. Yes I started 2021 but those years are wasted years because I was doing nothing to improve the little I know so I abandon everything but now I want to  start a fresh Quote from: Doan9269 on March 09, 2023, 03:41:54 PMQuote from: Wisdom O on March 09, 2023, 02:56:52 PMAs a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.1. Don't be over confident2. Calm down and learn crypto3. Avoid starting with altcoins, bitcoin should be your starting point4. Learn about bitcoin and cryptocurrency in general5. Never get tired of learning and making research to know more6. Invest on what you can afford to loose because everything is all about taking risk7. Don't be enticed by cryptocurrency influencers and promoters, the may push you into taking a wrong step8. Learn to keep things in secret especially your bitcoin investment access9. Avoid centralized exchanges if possible or don't put your main investment on them10. Be active onnthe forum and learn from what others pist or taughts11. Don't assume what you don't know, experience your learning ground and be well equipped12. Have confidence in yourself and take risk that's worth going for with bitcoin13. Invest or trade and monitors your asset and follow up the events and news happening in crypto worldQuote from: Wisdom O on March 09, 2023, 02:56:52 PMDon't really know where to start but hopefully I will with your help.You will be the one to help yourself by learning and here is a good ground for your learning process, why not take a step and every possible advantage to ensure you make a growth here. I will take your advice to heart and make sure I do everything possible to ensure that I come or achieve my goal, thank you.[moderator's note: consecutive posts merged]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "March 09, 2023, 09:14:09 PM",
      "body": "Not to do- Don't be too reliant on others decision like asking what coins you should invest and whatever is suggested to you, you'll take them, just no.- Avoid those obvious too good to be true offers as they're likely a scam.To do- Believe in yourself that you'll eventually get there. The stairs might not be too easy and small but just initiate and do it.- Keep researching and learning, everyone here is no perfect and we've got things that we still need to learn.- DCA and buy bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengga Jati",
      "created_time": "March 09, 2023, 09:17:57 PM",
      "body": "Quote from: Wisdom O on March 09, 2023, 02:56:52 PMAs a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.Don't really know where to start but hopefully I will with your help.The first thing to do when someone is going to be more confident in something is by the learning process. The more you understand, the more you will become confident. Learning basically can lead you to understand about cryptocurrency, investment, and all things related to the crypto business. Learning will make you more careful and wiser in deciding something, especially in investment. Btw, learning here is not only about learning from some theory but also learning from some other explanation including someone's experiences. Secondly, I do agree with some members here that being a newbie is very risky to get scammed. That is why: Never trust anyone on the internet, moreover the one who contacts you and gives you a high promise to help you earn money. Don't trust those people because they are scammers that will scam and get your money, mostly like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "March 10, 2023, 05:40:46 AM",
      "body": "Quote from: Wisdom O on March 09, 2023, 02:56:52 PMAs a newbie in crypto what are the things to do and not to doTo do- Learn about Bitcoin- Invest in Bitcoin- Hodl it- Using non custodial wallet and backup it wellNot to do- Don't trade- If trade, don't use leverage, don't trade future- Don't store your bitcoin on centralized exchanges or in online accounts- Don't invest in altcoinsFirst thing to do, read this Reminder: do not keep your money in online accounts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "March 10, 2023, 05:54:11 AM",
      "body": "OP, you should definitely read all the forum rules. You wrote three posts in a row, which indicates ignorance of the rules. Try to respect the laws of the society you decide to join. Besides, you once found this forum, and you were interested in it for a while, but then you left. There are no problems with this; many people do not understand what they want the first time. But for now, try exploring the forum on your own. Read more; there is no need to create topics for each question with similar questions. Read not only the answers in this thread, but also move on, trying to explore the forum yourself.No one will lead you by the hand. Understand the rule: you need the forum, not the forum needs you. Therefore, act like a man by having goals and achieving them.How to use the forum search  : https://bitcointalk.org/index.php?topic=5276341.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 10, 2023, 05:55:45 AM",
      "body": "Quote from: Wisdom O on March 09, 2023, 02:56:52 PMHi everyone,As a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.Don't really know where to start but hopefully I will with your help.I thought an idea is really welcome.Thanks.For me if you want to be a good member here then youll focus on the goal of learning first from forum rules to different terms and concept must be understand first especially learning bitcoin concept and idea within the scope of its technology and other stuff. Dont extend yourself on altcoins if you dont know grasp the blockchaim tech first.  You could also be a good contributor here and be part of some signature campaign if you rank up. But thats not the matter only an additional perks if you become a quality poster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "March 10, 2023, 07:26:55 AM",
      "body": "Quote from: Wisdom O on March 09, 2023, 02:56:52 PMHi everyone,As a newbie in crypto what are the things to do and not to do that will make me attain to the level of being confident and reliable on the decision I make.Don't really know where to start but hopefully I will with your help.I thought an idea is really welcome.Thanks.Don't be afraid to make mistake in the early stages, be it on trading, or investing on crypto, every successful person out there have made mistakes but they never give up, they learn from their mistake, once you have gain experience, you will never doubt yourself again, since nobody is perfect.Never be afraid to tryOvercome your fears/doubtsApply what you learnBe patientfind a good mentoralways move forwardRead study the situationsLearn to Adapt",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}