{
  "id": "topic_5409360",
  "title": "mandown",
  "author": "mandown",
  "created_time": "August 10, 2022, 12:19:09 PMLast edit: August 10, 2022, 01:09:34 PM by mandown",
  "content": "Bu kadar cahilce bir hareket yok sorunun kaynağına inmek yerine alakasız tedbirler almak bu sorunu çözecek gibi durmuyor. QuoteTicaret Bakanı Mehmet Muş, sıfır araç satışı için planlanan yeni uygulamayı resmen duyurdu. Muş, \"İlk tescilden sonra şirketler, galeriler, rentacarlar 6 ay ve 6 bin kilometreyi geçmeden aldıkları sıfır araçları satamayacak\" ifadelerine yer verdi.https://www.cumhuriyet.com.tr/ekonomi/ticaret-bakani-mus-resmen-duyurdu-sifir-araclarda-6-ay-sarti-1967877Bir esnaf olarak böyle bir. çözüm sunulmasını tamamen saçma buldum. Ne yani kasap eti 6 ay beklettiğinde etin fiyatı mı düşecek? Ana sorun paranın değerinin kaybı paranın değerini. korumaya çalışma onun haricinde herşeye saldır hadi oradan.Serbest piyasa adı altında serbest piyasadan alakasız işler çevirirsen ekonomi dediğin şey canlı bir yapı değil karşılığını çatır çatır gösterir.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409360",
  "comments": [
    {
      "author": "ILuckyGuyI",
      "created_time": "August 10, 2022, 12:54:34 PM",
      "body": "Bu hareket başlı başına saçma bir şey zaten de ayrıca bizim ülkede bu taktik ters tepecektir. Çünkü ülkemizde arabalar durduğu yerde ucuzlayacağına yıllar geçtikçe daha da değer kazanıyor. Böyle saçma bir düzenin olduğu bir ortamda alınacak bu aksiyon insanların arabalara ulaşım gücünü iyice düşürecek. Ekonomiyi düzeltmek için adım atmak yerine ne kadar işe yaramaz adım varsa atılıyor. Bu ülkede kafayı yememek gerçekten elde değil kısacası.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xzone",
      "created_time": "August 10, 2022, 01:02:00 PM",
      "body": "Sorun şu ki galeriler ya da diğer ticari faaliyetlerde bulunanlar için böyle bir karar aldılar. Cahil adamlar galerilerin (lüks segment şirketlerden bahsetmiyorum) arabaları kendi üstlerine alıp sattıklarını zannediyorlar. Galeri arabayı sizden alır, emlakçı gibi bekler sonra birine sizin adınıza satar. Arabayı zaten kendi şirketine fatura ettirmez ve kayıt dışı paranın dibine vurur.Ekonomi ya da araç piyasası bu şekilde düzelmez, bu şekilde bayilerin elinde sıfır araç kalmamasının önüne geçemezler",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "August 10, 2022, 01:09:59 PM",
      "body": "Diyelim ki aracı gerçekten binici aldı ve acilen satması gerekti. Belki hastalandı belki sevdiklerine bir şey oldu. Olur mu olur. Bu durumda ne olacak? Acil satması gerektiği için satıcı galeri ile sözleşme yapacak ve ederinin altına aracını verecek. E bu durumda 6 ayın bir önemi mi kalıyor galerici 6 ayda yine yatırır arabayı mağazasında. Nasıl olsa ederirimin altına almış olacak. Yasaklama çözüm değil her yasak da daha fazla problem yaşıyor millet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "August 10, 2022, 01:52:28 PM",
      "body": "Cidden yapılan saçma sapan politikalar fiyatların düşmesinden çok fiyatların artmasına sebep oluyor. Daha önce ev kredisi vereceğiz dediler ve bu kredileri çok az kişi faydalanmasına rağmen ev fiyatları aşırı derece fiyatlandı. Bir ara ÖTV matrahlarında düzeltme yaptılar iyi hoş ama burada kaç tane gerçek kişi faydalandı merak konusu o dönem zaten galerilerde araç bulmakta meseleydi. Sıfır araçlar bayilerde artmadığı ve paramız değer kazanmadığı sürece fiyatların düşmesi imkansız. Bu yasağı delmek içinde şimdiden formülünü bulmuşlardır malum bizim milletin en iyi yaptığı işlerdir yalan dolan kılıfına uydurmak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Retro Harmony",
      "created_time": "August 10, 2022, 02:29:50 PM",
      "body": "Benim anlamadığım sıfır araçlarda 6 ay ve 6 bin km şartını nasıl getirecekler? 6 ay bekler de, 6 bin km yapmak için herhalde bir yere kiraya vermesi lazım. Araç sıfır km ayarından da çıkıyor. Sıfır km ile 6 bin km araç arasındaki fiyat farkı da galericiyi mağdur edecek. Bilmiyorum bana mantıklı gelmedi. Başka bir çözüm yolu olabilirdi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "August 10, 2022, 03:32:35 PM",
      "body": "Quote from: karabiber on August 10, 2022, 01:09:59 PMDiyelim ki aracı gerçekten binici aldı ve acilen satması gerekti. Belki hastalandı belki sevdiklerine bir şey oldu. Olur mu olur. Bu durumda ne olacak? Acil satması gerektiği için satıcı galeri ile sözleşme yapacak ve ederinin altına aracını verecek. E bu durumda 6 ayın bir önemi mi kalıyor galerici 6 ayda yine yatırır arabayı mağazasında. Nasıl olsa ederirimin altına almış olacak. Yasaklama çözüm değil her yasak da daha fazla problem yaşıyor millet.sıradan vatandaş için herhangi bir zaman ya da km kuralı yok.Quoteİlk tescilden sonra şirketler, galeriler, rentacarlar... [/b]ekşi sözlük'te mi ne vardı. adam 2019 model arabayı 0 km olarak satıyor. ahahah süre konusunda herhangi bir sorun yok da km açısından galericiler biraz mesai harcayacak gibi. paramız pul olmasından ziyade arabalar üzerinden alınan vergi biraz hafiflese insanlar rahat eder.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "emrecemsan",
      "created_time": "August 10, 2022, 05:16:59 PM",
      "body": "Bunun hiçbir şeye bir çözüm oluşturacağını düşünmüyorum. Zaten ülkemizde gerçekten de bir araba beklediği yerde ucuzlamıyor yok öyle bir şey. Böyle bir vaziyet varken sıradan bir vatandaş bu sefer daha da zorlanarak araç almış olacak. Böyle bir fikir üretmek yerine daha yapıcı fikirler bulunabilir. Örneğin ÖTV ve KDV oranlarını önemli ölçüde düşürmek gibi. Zaten enflasyonu osu busu derken artan fiyatlar varken bir de yüksek vergi dilimleri durumu iyice kötüleştiriyor. Hatta arabalar nerdeyse sırf vergiden oluşuyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Red Pie",
      "created_time": "August 10, 2022, 06:34:03 PM",
      "body": "Araçları toplu şekilde alıp bekleyenlere güzel oldu. bir gram üzülmüyorum. araçları bayilerden alıyorlar bekletiyorlar ve fahiş fiyata satıyorlardı. bu insanların yaptığı ticaret değil araç fiyatlarını yukarıya çekenler de bunlardı. araba gelmeyen dönemde ikinci el araçların sıfır araç fiyatlarını geçtiği dönemin mimarları da bunlardı. tabi en büyük sorunlardan birisi de artan döviz kuruydu ona çareyi bulsalar daha iyi önlem olurdu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "August 10, 2022, 07:31:41 PM",
      "body": "Bu çözüm değil, çözüm ülkenin tamamının çözümü yani ekonomiyi baştan düzeltmek, ekonomi baştan düzenledikten sonra değer kazanan Türk lirası ile birlikte sıfır araçlarda da, ikinci el araçlarda da, hayatın içinde de herşeyde ucuzlama görebiliriz, enflasyon resmî rakamlara göre yüzde 80 civarında, gayri resmî olarak yüzde 150 rakamlarında, araç fiyatlarının artması çok doğal, suç bu satıcılarda değil ki,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "forbidden",
      "created_time": "August 10, 2022, 07:55:07 PM",
      "body": "Yerinde bir karar. Galerici ve araç kiralama firmaları'nın arası bayiler ile iyi. Bayiye kısıtlı olarak gelen araçları alıp bayiden pahalıya millete iteklediler. Galeride 2. el araç satılır, sıfırla senin ne işin var? Kiralamacıysan veya şirketsen de sıfır aldığın aracı kullanırsın satmazsın, satacaksan başka amacın var demektir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "August 10, 2022, 08:07:43 PM",
      "body": "Galerilerin sifir araç alıp satmasına neden sasiriyorsunuz cidden anlamıyorum adamlarin mesleği bu ister sıfır alır satar ister ikinci el.Buradaki sorun 30.000 doların 500.000 TL den fazla yapmasıÜlkede stabilite yok. Bir malın fiyatı tek yönlü olarak her ay degisirmi ne buna satıcı dayanabilir nede alici. Paranın çoğunu dövizde de tutamiyorsun o aracı satsa zarar edecek satmasa zarar edecek. Böyle iş olur m. stabilite olmayınca suçlu galerici gibi görünüyor ama burada suçlu galericisiyse suçun belki %0.0001 i onundur.o da değil ya neyse.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OrtaDirek",
      "created_time": "August 10, 2022, 09:52:53 PM",
      "body": "ulan ortalama 35 40 bin dolar olan daireler 100 bin doları geçti 2 yıl önce de türkiyenin nüfusu hemen hemen aynıydı, tl de enflasyon var anlarım da dolar bazında bu kadar artış açıklanamaz.aynı şey araçlarda da var bayi satışı 40 bin dolar olan sıfır araç sarı sitede 50 bin dolarserbest piyasa işinin boku çıktı 399 dolar olan ps5 neredeyse 1000 dolara satılıyor mağazalarda her zaman yok ama sarı sitede yüzlerce ilan binlerce stok var eğer gerekli yaptırımlar yapılmaz ise ötv indirimi gelse dahi fırsatçılar yüzünden araç fln alamazsınız şunu bir anlayın..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LGD2Business",
      "created_time": "August 11, 2022, 02:50:56 AM",
      "body": "Kararın her tarafı yanlış da benim aklıma şu takıldı. Beyanda diyor ki 6 ay geçse bile 3000 km olmadan satılamazmış. Ben yeri geliyor yılda 1000 kmden az yapıyorum özellikle uzun yol yapmadığım zamanlarda km inanılmaz düşük kalıyor. Böyle saçma sapan bir karar mı olur? Bireyseli etkilemese de az km yapan egzotik vb. araçlarda bu kuralın nasıl işleyeceği konusunda ciddi tutarsızlıklar var. Buna yeniden düzenleme gelecektir, birçok şeyi resmen unutmuşlar. Alın size bir gecede düşünülmeden alınmış bir karar daha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "August 11, 2022, 07:27:15 AM",
      "body": "Ya bu kararları verenler Türk değil ve Türk halkını tanımıyorlar ya da biz yaptık demek için düzenleme yapıyorlar. 6 ayı aşmış ama 6bin kilometreyi geçmemiş tüm SIFIR araçların kilometresi ile oynanacak. Olan yine tüketiciye olacak. Üstelik 6 ay sınırını aşmak isteyen galericiler daha çok araba alacak, daha pahalıya satacak. Olan yine tüketiciye olacak. Bu esnada ilk 6 ay 2. el araçların fiyatları daha da artar, çünkü kanundan itibaren 6 ay boyunca sıfır araç satışı neredeyse hiç olmayacak. Zaten çip krizi nedeniyle araçlar 6-8 ayda anca geliyor. Olan yine tüketiciye olacak.Sizin yapacağınız işe güleyim 😀",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "August 11, 2022, 12:53:46 PM",
      "body": "Farklı bir yöntem tabi piyasadaki fiyatı düşürmek için. Bunu başaramayacaklar gibi çünkü piyasanın yükselmesinin ana sebepleri hem chip kriziyle az sayıda üretilen araç sayısı, hem de dövizin içinde bulunduğu yükseklik. İkinci el almak bile mucize olmuşken sıfır km arabaların en az 6 ay ve 6 bin km yapma şartı bence çözüm değil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}