{
  "id": "topic_5430988",
  "title": "CryptSafe",
  "author": "CryptSafe",
  "created_time": "December 22, 2022, 01:10:33 PMLast edit: December 23, 2022, 07:55:56 AM by CryptSafe",
  "content": "With the events going on and the past occurrences of banks and Crypto currency issues regarding to account closure and funds seized, it would be nice we furnish ourselves here with happenings around us with regards to banks and how they handle Crypto and bitcoin issues so we would know what is obtainable in our country Nigeria. We can post with reference and if possible, with pictorial excerpts available, it would be nice .  This will help us in many ways if there be any happenings or unfolding events and also we can share ideas on how to handle such situations so as not to have issues of pending transaction. I believe we do have active  bankers or ex-bankers here amongst us too who can furnish us with latest updates as well. I hope this opinion does not contradict any existing protocol.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430988",
  "comments": [
    {
      "author": "Agbe",
      "created_time": "December 22, 2022, 09:15:14 PM",
      "body": "Yes it is good so whenever you or anyone sees any good information on cryptocurrency bring it here. Even without picture you can bring the information as faras u drop di link of di site but picture make di tok matured. I don't think there is any banker her but I don't know sa. If they are here then dem fit bring come. Ur opinion is nice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 24, 2022, 08:27:46 PM",
      "body": "Concerning that CBN directive to banks to close  any account wey dey discover say dey into crypto, i think that directive will soon be a thing of the past since like in the latest update, it seems Nigerian government is now looking at how they can regulate and tax crypto transactions for the contiri, i be dey read that news for punch online sometime this week but i no get the link again, i don try to see if na wetin i go see quick quick but i no see am, i go take time find am, and once i see am, i go edit this post put the link here.my prediction now be say by 2023, probably before 2023 go end, cryptocurrency fit become legal means of transactions for we contiri Nigeria, make all of us cross our fingers for this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 24, 2022, 08:56:04 PMLast edit: January 02, 2023, 06:58:34 AM by Charles-Tim",
      "body": "Quote from: CryptSafe on December 22, 2022, 01:10:33 PMWith the events going on and the past occurrences of banks and Crypto currency issues regarding to account closure and funds seized, it would be nice we furnish ourselves here with happenings around us with regards to banks and how they handle Crypto and bitcoin issues so we would know what is obtainable in our country Nigeria.If you just want to exchange crypto to naira and naira to crypto, you have no problem, those that are taking it to business level are the ones that were affected. But we can see many ads on YouTube about people still advertising some local exchanges.Quote from: Fivestar4everMVP on December 24, 2022, 08:27:46 PMI be dey read that news for punch online sometime this week but i no get the link again, i don try to see if na wetin i go see quick quick but i no see am, i go take time find am, and once i see am, i go edit this post put the link here.I guess this is the news that you are talking about:Proposed cryptocurrency law to define CBN’s roles –RepsI remember your post on this local board on this thread we discussed about it: Naija Reps & Cryptocurrency Palava.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "December 25, 2022, 08:07:16 AM",
      "body": "Quote from: CryptSafe on December 22, 2022, 01:10:33 PMI hope this opinion does not contradict any existing protocol.It doesn't and I don't think we're having much cases of closed accounts anymore. As a enthusiast involved in the space, you have to be cautious to avoid having crypto related words in any transactions that you make. Also I for advise make we dey avoid the Kobo payment if we dey run P2P transactions, just round am up as banks dun notice say na crypto traders dey always add those kobo for their payments. Also try avoid using your main bank account for all this transactions, use any of this microfinance banks wey full everywhere like then Kuda dem so Incase your account get compromised and them close am, you fit access your other funds for your main account and move am to saved location before anything reach that side. The way I dey see things dey go self very soon banks go welcome the idea of cryptocurency investment that's if this bill them wan pass go through, already there were rumors of a particular Nigeria banks investing in the space but dem come online come clear the matter few weeks back say dem no dey investment in any cryptocurrency but remember what dey say, there's a fire behind any smoke you see. Crypto go soon dey friendly for Nigeria na him be the koko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 26, 2022, 08:03:28 AM",
      "body": "Quote from: CryptopreneurBrainboss on December 25, 2022, 08:07:16 AMAlso try avoid using your main bank account for all this transactions, use any of this microfinance banks wey full everywhere like then Kuda dem so Incase your account get compromised and them close am, you fit access your other funds for your main account and move am to saved location before anything reach that side.We have BVN that all banks are demanding for during registration which can link all your bank accounts that you have with different banks. There is possibility that if one of your account is freezed, be it commercial or microfinance bank, all other bank accounts that you are having in Nigeria will be freezed at once. While doing registration on Microfinance bank, like Kuda, BVN and KYC are requested for as well, just like how it is when using a commercial bank.Quote from: CryptopreneurBrainboss on December 25, 2022, 08:07:16 AMThe way I dey see things dey go self very soon banks go welcome the idea of cryptocurency investment that's if this bill them wan pass go throughDo not expect there will be banks in Nigeria that will invest in crypto, as long as CBN do not change their negative opinions about crypto, CBN is not friendly at all with crypto.Even if crypto is regulated by NSEC, that does not mean CBN will not follow their own stance, CBN will not still allow any bank to make any direct involvement in anything pertaining to cryptocurrencies, like investment.Quote from: CryptopreneurBrainboss on December 25, 2022, 08:07:16 AMalready there were rumors of a particular Nigeria banks investing in the space but dem come online come clear the matter few weeks back say dem no dey investment in any cryptocurrency but remember what dey say, there's a fire behind any smoke you see. Definitely, it would be a rumor, CBN stance on bitcoin and other cryptocurrencies is not in the positive direction at all and banks will follow the CBN regulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "December 26, 2022, 03:23:13 PM",
      "body": "Quote from: Charles-Tim on December 26, 2022, 08:03:28 AMWe have BVN that all banks are demanding for during registration which can link all your bank accounts that you have with different banks. There is possibility that if one of your account is freezed, be it commercial or microfinance bank, all other bank accounts that you are having in Nigeria will be freezed at once. While doing registration on Microfinance bank, like Kuda, BVN and KYC are requested for as well, just like how it is when using a commercial bank.All banks can't just closed your account without you commiting a seriously offense that demand your account details to be frozen. If kuda observe say you dey into crypto trading, dey can close your account while that of other banks are quite active. Excluding high profile users that the government targeted, anyhow users wey dey involved in the business, accounts weren't closed and only specific banks that notice your involvement in the space by either you or your  other party indicating that you're doing a crypto transaction did their account get closed but it didn't affect other account especially when they're microfinance banks. QuoteEven if crypto is regulated by NSEC, that does not mean CBN will not follow their own stance, CBN will not still allow any bank to make any direct involvement in anything pertaining to cryptocurrencies, like investment.Na dis country we go dey see say banks get Bitcoin and other cryptocurency for their balance sheet, e no go happen now but definitely in future it'll. I remember when MMM first start wey all banks were preaching against it but there came a time almost all the bankers in Nigeria got involved and there were statement of them receiving more customers during the peak of the ponzi scheme. U think say dem no like better thing too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 30, 2022, 07:02:12 AM",
      "body": "Quote from: CryptopreneurBrainboss on December 25, 2022, 08:07:16 AMQuote from: CryptSafe on December 22, 2022, 01:10:33 PMI hope this opinion does not contradict any existing protocol.It doesn't and I don't think we're having much cases of closed accounts anymore. As a enthusiast involved in the space, you have to be cautious to avoid having crypto related words in any transactions that you make. Also I for advise make we dey avoid the Kobo payment if we dey run P2P transactions, just round am up as banks dun notice say na crypto traders dey always add those kobo for their payments. Also try avoid using your main bank account for all this transactions, use any of this microfinance banks wey full everywhere like then Kuda dem so Incase your account get compromised and them close am, you fit access your other funds for your main account and move am to saved location before anything reach that side. The way I dey see things dey go self very soon banks go welcome the idea of cryptocurency investment that's if this bill them wan pass go through, already there were rumors of a particular Nigeria banks investing in the space but dem come online come clear the matter few weeks back say dem no dey investment in any cryptocurrency but remember what dey say, there's a fire behind any smoke you see. Crypto go soon dey friendly for Nigeria na him be the koko. Your advice is certainly a good one and wisdom demands it. I make sure that my main bank accounts are shielded from crypto transactions, I only move money from my accounts to the others. And to make it look smarter, I use one of the fintech for my crypto withdrawals and the subsequent transfer to my other accounts is free.Still, I don't know what is going on in Nigeria regarding this subject matter. Many companies are now using direct bank payments for crypto dealing and the so-called CBN does nothing about it. Could it be that this restriction is only for the poor and voiceless?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "January 01, 2023, 01:05:43 PM",
      "body": "Quote from: CryptopreneurBrainboss on December 26, 2022, 03:23:13 PMQuote from: Charles-Tim on December 26, 2022, 08:03:28 AMNa dis country we go dey see say banks get Bitcoin and other cryptocurency for their balance sheet, e no go happen now but definitely in future it'll. I remember when MMM first start wey all banks were preaching against it but there came a time almost all the bankers in Nigeria got involved and there were statement of them receiving more customers during the peak of the ponzi scheme. U think say dem no like better thing too. My broda-man wetin you just talk now na the naija future be that, banks na just busy body people for this we con3, Dem go dey publicly criticize sometin but secretly na them the bankers dey run am. If you look very well we fit see many bankers wey the operate in cryptocurrency underground cos dem wey dey into the financial system na know well well the big profits wey dey inside crpyto.One tin for sure, very soon for this we con3, we go dey walka enter banks for cryptocurrency business purposes just same way we doin wit fiat money. Mk we no worry!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "January 02, 2023, 05:15:26 PM",
      "body": "Quote from: Fivestar4everMVP on December 24, 2022, 08:27:46 PMmy prediction now be say by 2023, probably before 2023 go end, cryptocurrency fit become legal means of transactions for we contiri Nigeria, make all of us cross our fingers for this one. I’m also anticipating for that this year, but let’s see how things will unfold in the soonest since we just entered new year. In the past year, we saw how the Nigerian government introduced  blockchain technology to help the youths in becoming early solution providers in the fourth industrial revolution. That’s a positive sign that we hope to see the uplift of the ban on cryptocurrency in the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}