{
  "id": "topic_5411527",
  "title": "Oshosondy",
  "author": "Oshosondy",
  "created_time": "August 28, 2022, 05:26:10 PMLast edit: August 28, 2022, 05:36:57 PM by Oshosondy",
  "content": "I absolutely know that if using an exchange, you do not have the private key of the addresses the exchange give you, you do not have the complete control of your coins. I also know that even if 2FA protect your account from hackers that are specifically targeting you or few users instead of the exchange, that does not mean that the exchange can not be hacked, which could lead to loss of coins and that it is possible for the exchange not to be able to pay back their customer's money, or taking weeks, months or years if there would be any compensation.Please, let us specifically discuss about recommended Windows 2FA apps.The QuestionI was using two phones before, I have my 2FA app on the second phone. Now I am having just one phone and a laptop instead, I use my laptop for wallet because I do not use my laptop online often like phone. I decide to have my 2FA app on my laptop instead, including my wallet, but my exchange accounts are on my phone, I am still satisfied that if I have my 2FA on laptop, it would be difficult for anyone to access my exchange accounts. Presently, I only have the backups of my 2FA secret codes of the exchanges, I am looking for a Windows 2FA app that I can import it. I was using Aegis before because it is open source and highly recommended on this forum, but not on Windows, I searched Window's app store, I was only familiar with winOTP, but I do not know if it is recommended too? I checked https://getaegis.app/, they only have Android and F-Driod apps, no app for Windows. I do not want to have both 2FA and my exchange accounts on the same device. Is there any 2FA app that is recommended that I can use on Windows?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5411527",
  "comments": [
    {
      "author": "PowerGlove",
      "created_time": "August 28, 2022, 07:21:03 PM",
      "body": "Quote from: Oshosondy on August 28, 2022, 05:26:10 PMIs there any 2FA app that is recommended that I can use on Windows?KeePassXC is cross-platform and available for Windows (I've only used it on Linux). It's a password manager, so not exactly what you're looking for, but because it supports 2FA (I've tested the RFC 6238 / TOTP support and it works great) it can actually be misused as an authenticator app. Feel free to ask me how, if you're unsure.Another option on Windows is WinAuth. I used it briefly some time ago, and it's a little clunky, but it's open-source and worked well for my needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "August 28, 2022, 07:34:15 PM",
      "body": "Authy supports Windows as well but I don't think you can import from it so you'll have to go through your exchange's accounts one by one, disable the 2FA and enable it again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 28, 2022, 07:59:38 PM",
      "body": "Quote from: Oshosondy on August 28, 2022, 05:26:10 PMI do not want to have both 2FA and my exchange accounts on the same device. Is there any 2FA app that is recommended that I can use on Windows?KeePass would very good option like PowerGlove said, and you can use it as best password manager as well.There is one application for wiNd0ws called WinAuth that is open source, it is not maintained anymore but it works just fine:https://winauth.github.io/winauth/download.htmlHowever, I would suggest switching to linux os (fedora or debian) for several reasons, and they have different applications like OTPClient, Authenticator, etc.It's even better to use different device only for 2FA, this can be your old smartphone with Aegis app installed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "August 28, 2022, 09:57:13 PM",
      "body": "I use authy both phone and desktop after get disappointed on google auth. As OmegaStarScream said, you can't import your data from other 2fa app (mobile) to another 2fa app (desktop). You should use 2fa that has both phone an desktop compatible and resetting your accounts 2fa is the only way to do that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvell1",
      "created_time": "August 29, 2022, 02:41:50 AM",
      "body": "Quote from: OmegaStarScream on August 28, 2022, 07:34:15 PMAuthy supports Windows as well but I don't think you can import from it so you'll have to go through your exchange's accounts one by one, disable the 2FA and enable it again.I also use the Authy app for my authenticator, but yesterday I read an article about Authy being hacked. This is the first time Authy has been targeted by hackers. Authy representatives also confirmed this news and they said some customer information has been hacked.I'm also starting to wonder if Authy is still safe enough to continue using?By the way, besides Authy, do we have any other good 2FA apps for iOS and Android?https://www.digitaltrends.com/mobile/authy-hackers-breach-two-factor-authentication-2fa-codes/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "August 29, 2022, 04:57:20 AM",
      "body": "The most popular 2-Factor Authentication Windows applications that I know or heard of include but are not limited to:1. Authy https://authy.com/I didn't find the GitHub page for this project, which means the project is likely closed source and, therefore, highly discouraged for exploitation.2. WinAuth https://winauth.github.io/winauth/download.htmlAlthough WinAuth has a GitHub repo where the source code is published https://github.com/winauth/winauth it has not been updated since 2018, and it is no longer safe to use it.3. 2 Factor Authenticator https://www.microsoft.com/en-us/p/2-factor-authenticator/9nblggh5k7jn?activetab=pivot:overviewtabIs likely closed-source.4. WinOTP Authenticator https://apps.microsoft.com/store/detail/winotp-authenticator/9NF2RGQKX1MV?hl=en-us&gl=USIs open-source but no longer maintained: https://vladimirakopyan.github.io/Authenticator/5. 2fast – Two Factor Authenticator Supporting TOTP https://apps.microsoft.com/store/detail/2fast-%E2%80%93-two-factor-authenticator-supporting-totp/9P9D81GLH89Q?hl=en-us&gl=USIs open-source and actively maintained: https://github.com/2fast-team/2fastAs you can see, most of these projects have a codebase open to the public, but unfortunately, half of them are either abandoned or barely maintained by the developers. The only project that is both open-source and actively being worked on is 2fast, but I don't know how reliable it is because I have never tested it.Quote from: dkbit98 on August 28, 2022, 07:59:38 PMHowever, I would suggest switching to linux os (fedora or debian) for several reasons, and they have different applications like OTPClient, Authenticator, etc.Completely agree. Security cannot be built on top of insecure proprietary software users have no full control over.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "S3300",
      "created_time": "August 29, 2022, 08:35:50 AM",
      "body": "Google Auth works on PC too, this is what I use on my social media accounts and gaming-related platforms on PC like Blizzard, Steam and Activision, also I've seen hackers trying to jail break my email account before but they couldn't pass through because of 2FA Authentication.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 29, 2022, 08:45:45 AM",
      "body": "Quote from: Oshosondy on August 28, 2022, 05:26:10 PMPresently, I only have the backups of my 2FA secret codes of the exchanges, I am looking for a Windows 2FA app that I can import it. I was using Aegis before because it is open source and highly recommended on this forum, but not on Windows, I searched Window's app store, I was only familiar with winOTP, but I do not know if it is recommended too? I checked https://getaegis.app/, they only have Android and F-Driod apps, no app for Windows. I will go for another direction. It may worth at least a quick thinking.Since Aegis works only on Android and F-Droid and you have your data in there (and can be exported from Aegis and imported to another Aegis), maybe the direction you could take is to install on your Windows an Android Emulator and install Aegis there. It may be less hassle...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 29, 2022, 10:14:24 AM",
      "body": "Quote from: PowerGlove on August 28, 2022, 07:21:03 PMKeePassXC is cross-platform and available for Windows (I've only used it on Linux). It's a password manager, so not exactly what you're looking for, but because it supports 2FA (I've tested the RFC 6238 / TOTP support and it works great) it can actually be misused as an authenticator app. Feel free to ask me how, if you're unsure.Another option on Windows is WinAuth. I used it briefly some time ago, and it's a little clunky, but it's open-source and worked well for my needs.I will try KeePassXC, I can see on their website that it support Windows. I would like to use a 2FA app that is open source and which is constantly updated, according to what witcher_sense said, the app is open source though, but not updated since 2018, it is not good to use it.Quote from: OmegaStarScream on August 28, 2022, 07:34:15 PMAuthy supports Windows as well but I don't think you can import from it so you'll have to go through your exchange's accounts one by one, disable the 2FA and enable it again.I have known Authy on Android and I saw it on Windows app store, but what I do not like about it is the online data storage but which is encrypted though, but I am looking for a 2FA app that do not support anything related to online. Quote from: NeuroticFish on August 29, 2022, 08:45:45 AMI will go for another direction. It may worth at least a quick thinking.Since Aegis works only on Android and F-Droid and you have your data in there (and can be exported from Aegis and imported to another Aegis), maybe the direction you could take is to install on your Windows an Android Emulator and install Aegis there. It may be less hassle...It would be good if you can give me a link to a trustworthy android emulated that I can be able to use on Windows, if there are, it would be the best way to go for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "August 29, 2022, 10:27:04 AM",
      "body": "Quote from: OmegaStarScream on August 28, 2022, 07:34:15 PMAuthy supports Windows as well but I don't think you can import from it so you'll have to go through your exchange's accounts one by one, disable the 2FA and enable it again.You can export from authy. It is very easy and fast.  I imported all keys from authy to aegis.You need to download the desktop version and use the console on the browser. I shared  how to do so here:https://bitcointalk.org/index.php?topic=5405454.msg60524698#msg60524698",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "August 29, 2022, 10:32:00 AM",
      "body": "Quote from: Oshosondy on August 29, 2022, 10:14:24 AMIt would be good if you can give me a link to a trustworthy android emulated that I can be able to use on Windows, if there are, it would be the best way to go for me.I know that Android Studio - Google's development tool for Android - contains emulator for Android. Imho it cannot be any more trusted.But that (installing a full dev tool only for the emulator) may be a bit of overkill.I've lost contact with those tools many years ago, so I expect you can get better answers (tools, configuration) from others. I've just suggested a new direction for your actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uang_kartal",
      "created_time": "August 30, 2022, 05:49:04 AM",
      "body": "i'm not that intense with a2fa on windows just use it on android for main and interchange. i realized i don't use windows original again.I've tried authy and aegis but if people don't want to be complicated, it's better to use authy. Still go back to Google Authenticator. The good thing is that Winauth has a portable version at that time. Maybe the friends above are using Linux OS. the system is in order. but I chose windows again after using linux mint.authy in my opinion is quite ideal for windows.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}