{
  "id": "topic_5430110",
  "title": "crwth",
  "author": "crwth",
  "created_time": "December 19, 2022, 05:34:46 AM",
  "content": "Most people posting here probably know that there are a lot of trading bots out there, but does it work? How could you tell if one is working? Most of them probably have promises that you could gain profit, but that's different. People should understand that bots are told what to do and would react to what they have set in the parameters. It still depends on how the market would go and how the strategy you would have set would respond. What do you think about trading bots in general?[Shameless plug] Everybody who has checked out my profile knows I'm affiliated with Gunbot but check it out. Are you interested in trying it a bot out for free? Check it out on my site https://gunbot.ph and check the Gunbot Trial. You could try it for three days for free.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430110",
  "comments": [
    {
      "author": "Maus0728",
      "created_time": "December 19, 2022, 01:17:01 PM",
      "body": "I am not an active trader and a trading bot user, but people need to know that trading bots are just a tool that still requires you to have an actual trading plan that you follow religiously. Suppose you do not have any idea what you are doing. In that case, deciding to use a bot could do more harm than good because, in the first place, it isn't about knowing the bot's functionality alone but rather knowing how and when to effectively use it with respect to your trading plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "December 19, 2022, 04:13:53 PM",
      "body": "Quote from: crwth on December 19, 2022, 05:34:46 AMWhat do you think about trading bots in general?Trading bots will not guarantee you a successful trade all the time, else everyone will be using bots. Also you do not need to get too relaxed using trading bots because you are unaware the day it will cause you a big loss. Also over dependence on bots can take out the fun in the trading and turn the trader into a trader who doesn't advance or grow. You can use bots, but avoid the danger of becoming too accustomed to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "December 19, 2022, 04:27:26 PM",
      "body": "I personally don't have any experience with bots as I think it's time consuming to have one works or it's just a hassle in my opinion especially setting it up. It may eliminate the behavior towards trading especially the emotions but with market right now that's is not in good condition and volatility could spike in any moment I don't know if there's really a profitable one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 19, 2022, 04:29:07 PM",
      "body": "Expectation: you purchase a bot, you turn it on, and you make profit forever while relaxing at the beach in the BahamasReality: trading bots (at least the long-term successful ones) are used by active traders to automate some of the trades, and is constantly updated to fit the traders' needs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yawa2020",
      "created_time": "December 19, 2022, 04:37:26 PM",
      "body": "The problem is that most of the bots are not genuine and were built just to scam traders using them and causing them more losses. Finding a legit bot is difficult as telling btc price in the next minute. So in my opinion, you should learn to use your human knowledge and capacity to trade and gain exciting experience than relying on a bot with your hard earned money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "December 19, 2022, 04:56:09 PM",
      "body": "Quote from: crwth on December 19, 2022, 05:34:46 AMMost people posting here probably know that there are a lot of trading bots out there, but does it work? How could you tell if one is working? Most of them probably have promises that you could gain profit, but that's different. People should understand that bots are told what to do and would react to what they have set in the parameters. It still depends on how the market would go and how the strategy you would have set would respond. What do you think about trading bots in general?[Shameless plug] Everybody who has checked out my profile knows I'm affiliated with Gunbot but check it out. Are you interested in trying it a bot out for free? Check it out on my site https://gunbot.ph and check the Gunbot Trial. You could try it for three days for free. Before I say about my opinion of trading bots I have to first of all note that we always missunderstand bots and at some time use them beyond their scope.How do I mean by this? I have lost huge sum of money through bots not in cryptocurrency but in forex. While I was using the same bot with another person I was losing money and blowing my account on a daily basis while the other person claimed he was making some profits which I don't really know if he was being truthful .He had some extra skills of manipulating the bot to work with his strategy but I was just stocked with the strategy that was programmed into the bo. Bots are used for some temporary time when you have studied your strategy and then want to go off the screen for some hours you can use the bot. Hardluck is when you have decided to leave all the job meant for human and robots for bot to handle, because you will run into losses. This is because the market has institutional traders that can distructure the market at any time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "December 19, 2022, 06:22:32 PM",
      "body": "I have seen several trading bots and used very few. Future trading, spot trading, DCA. The one I like the most is DCA bot. Others come at a risk of losing funds.And I don't know what's the point of spot trading bot. You can just do it yourself. It makes sense if you are a busy person and can't give enough time in your trading, then if you can tell the bot what to do in a situation then it will be useful, otherwise I don't think we need it at all. And if you are in a loss then using the DCA bot properly could benefit. But as always, it won't be 100% profitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jaberwock",
      "created_time": "December 19, 2022, 09:01:54 PM",
      "body": "Quote from: tjtonmoy on December 19, 2022, 06:22:32 PMI have seen several trading bots and used very few. Future trading, spot trading, DCA. The one I like the most is DCA bot. Others come at a risk of losing funds.And I don't know what's the point of spot trading bot. You can just do it yourself. It makes sense if you are a busy person and can't give enough time in your trading, then if you can tell the bot what to do in a situation then it will be useful, otherwise I don't think we need it at all. And if you are in a loss then using the DCA bot properly could benefit. But as always, it won't be 100% profitable. Since you seem to have experience of the trading bots, can you tell how exactly do these work? Do I have to enter the data manually or it has some pre-determine strategy and I just have to add balance to make it work? I am always fascinated by the idea of a bot that can make money while I sleep but it's hard to believe and find one that works. I have used dice bots for gambling but apart from that I don't have much experience of using bots. I have heard copy trading and some say it's better than bot trading but again no idea how it works.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "December 19, 2022, 09:14:28 PM",
      "body": "Absolutely do not believe in some trading bots that promise consistent profits every time you trade. from the Bot that is currently running using an API that will be integrated with the trading platform that we use, so the bot will execute with the settings that have been made before. But do we really have to trust bots? it is very risky, because some trading bots that initially provide profits, in the end, give a lot of losses. and what you need to watch out for is trading bots which turn out to be scams and will take over the assets that we have. bots are used as a temporary replacement, not to execute trades fully.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tjtonmoy",
      "created_time": "December 19, 2022, 09:50:00 PM",
      "body": "Quote from: jaberwock on December 19, 2022, 09:01:54 PMSince you seem to have experience of the trading bots, can you tell how exactly do these work? Do I have to enter the data manually or it has some pre-determine strategy and I just have to add balance to make it work? As the name suggests, it's a bot and not an AI. So everything that it's capable of is already coded inside it. It can not learn from your continuous use or it can't learn by analyzing the market. So basically you just give it some command at what price you will enter the market (depending on the market condition, If indicates towards high then buy, if indicates towards low then sell). and exit at what certain % of profit or loss. You can set multiple assets at multiple target.You are giving it an order and if the conditions matches then it will fulfill it automatically. Totally based on your market analyzation. You are the one controlling what the bot will do. that's it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "December 19, 2022, 10:02:19 PM",
      "body": "I have used plenty of them, including gunbot and it's always the same result and same answer. If you are good trader who knows what they are doing then you could make money with bots, but if you are a newbie who has absolutely no idea how trading or bots work then you will not only fail to make profit but will lose money. As Gunthar will tell you, if people are idiots, then they are idiots and gunbot would only enhance their idiotic moves, and they should stay away from it.Only the people who knows what they are doing could use such a product and could use it well enough that they could make a profit because they already knew what they should do, and used the bot to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "December 19, 2022, 10:42:09 PM",
      "body": "I believe bots are only meant to help reduce the human emotions in trade plus maybe execute a well-thought-out strategy by the trader in order to reduce on screen time for the trader. So they still have to be often monitored where possible.I am looking forward to using bots in the future just for the above reasons. The reason I have not used a bot yet is because I feel I don't have enough technical knowledge when it comes to python and API (everything seems alien to me at the moment)I am just learning how to code strategies on trading view using pine script. My goal next year is to probably learning Python scripting language as I continue trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "December 19, 2022, 11:59:18 PM",
      "body": "Quote from: el kaka22 on December 19, 2022, 10:02:19 PMI have used plenty of them, including gunbot and it's always the same result and same answer. If you are good trader who knows what they are doing then you could make money with bots, but if you are a newbie who has absolutely no idea how trading or bots work then you will not only fail to make profit but will lose money. As Gunthar will tell you, if people are idiots, then they are idiots and gunbot would only enhance their idiotic moves, and they should stay away from it.Only the people who knows what they are doing could use such a product and could use it well enough that they could make a profit because they already knew what they should do, and used the bot to do it.Bots are for automation and it is really relevant and useful for those people who do know on how to use it but if not then it would really be totally pointless on doing so.Most of the common misconception specially noobs that bots are something that could help out for you to make money or profits which is really a very wrong belief to have in mind.When you are dealing with bots then you should really know on how to make use of it and you should really make yourself aware that it does still need up some knowledge for you to make these bots useful.Bots are useful when you are away from your pc or something in relation to this situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "December 20, 2022, 02:08:31 AM",
      "body": "Quote from: crwth on December 19, 2022, 05:34:46 AMMost people posting here probably know that there are a lot of trading bots out there, but does it work? How could you tell if one is working? Most of them probably have promises that you could gain profit, but that's different. People should understand that bots are told what to do and would react to what they have set in the parameters. It still depends on how the market would go and how the strategy you would have set would respond. What do you think about trading bots in general?[Shameless plug] Everybody who has checked out my profile knows I'm affiliated with Gunbot but check it out. Are you interested in trying it a bot out for free? Check it out on my site https://gunbot.ph and check the Gunbot Trial. You could try it for three days for free. Trading bots like any tool will be as effective as the person that wields them, so an expert trader can use a trading bot to automate part or all of their strategy, but they will still have to monitor that the bot is behaving as expected and making the necessary adjustments if needed, however newbies expect that somehow the bots are going to do all the work for them and make a fortune, and we know this is not going to work no matter how much those newbies wish for this to be true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sebas.tian",
      "created_time": "December 20, 2022, 04:21:39 AM",
      "body": "Quote from: crwthWhat do you think about trading bots in general?Trading bots are like equipment been set to control the affair of an organization for profits purpose. Many traders has used trading bots to reduced so much load from their businesses, which allow them to trade different coins in the market, and have something good to achieve at the end of the market. It make the owner to face a big risk by using the trading bots, because network can make the programing not to go smoothly or if there is a challenge along the trading,it will lead to damage that will affect the trader not to receive what he or she want to achieve from the trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "December 20, 2022, 05:57:05 AM",
      "body": "Many think of it as a money machine where it doesn't require any skills to get profit from trading, it makes sense because there are a lot of advertisements like that out there, especially for forex trading bots, even though for me bots are just a tool to help trade a little more efficiently because when we have set the appropriate with the desire and target will run automatically but success remains in our trading skills",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "December 20, 2022, 06:55:50 AM",
      "body": "When you heard that term for the first time, you will expect that a \"bot\" will just simply trade for you and will give you endless profits.  You will think that bots will help you not to lose money.Well, trading bots really will help you trade as it can execute trades faster than a human does and it does work 24/7 but it doesn't guarantee you to give profits. Trading bots might be helpful for those traders out there while executing their trades on their own, but these bots aren't a bot that will not make you lose money. It isn't 100% profitable and there will be times that you might get lose in your trades. Anyway, trading bots are still very useful for some traders out there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SirLancelot",
      "created_time": "December 20, 2022, 09:43:33 AM",
      "body": "Quote from: LogitechMouse on December 20, 2022, 06:55:50 AMWhen you heard that term for the first time, you will expect that a \"bot\" will just simply trade for you and will give you endless profits.  You will think that bots will help you not to lose money.Well, trading bots really will help you trade as it can execute trades faster than a human does and it does work 24/7 but it doesn't guarantee you to give profits. Trading bots might be helpful for those traders out there while executing their trades on their own, but these bots aren't a bot that will not make you lose money. It isn't 100% profitable and there will be times that you might get lose in your trades. Anyway, trading bots are still very useful for some traders out there. Yeah, I agree but I think there are truly bots which are pre-defined with a working strategy and all we gotta do is to push that trade button for them to work endlessly. Obviously, there is no way that they can guarantee you a secure profits. That will be an easy life for us people if there's such bots that work that way. The reason why is because the market is changing from time to time.Sometimes it is bear and sometimes it is in bull so we also need to adjust our bots accordingly depending on the market conditions. If there's one thing that a bot can guarantee then that would be to give you a freedom as they can do most of the trading work for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "December 20, 2022, 10:31:25 AM",
      "body": "Quote from: greengrassis on December 19, 2022, 09:12:32 AMWhile working in this industry for myself, I realized that manually the results can be many times better. For this reason, I just try not to use bots for work.If that's what you do for a living, I think there's nothing wrong with that. If it makes you improve yourself with trading with the use of a trading bot, why not?Quote from: Maus0728 on December 19, 2022, 01:17:01 PMI am not an active trader and a trading bot user, but people need to know that trading bots are just a tool that still requires you to have an actual trading plan that you follow religiously. Suppose you do not have any idea what you are doing. In that case, deciding to use a bot could do more harm than good because, in the first place, it isn't about knowing the bot's functionality alone but rather knowing how and when to effectively use it with respect to your trading plan.You are definitely right that you need to know a little bit about it. Bots can be a tool to improve and accelerate your learning with trading.Quote from: Bananington on December 19, 2022, 04:13:53 PMTrading bots will not guarantee you a successful trade all the time, else everyone will be using bots. Also you do not need to get too relaxed using trading bots because you are unaware the day it will cause you a big loss. Also over dependence on bots can take out the fun in the trading and turn the trader into a trader who doesn't advance or grow. You can use bots, but avoid the danger of becoming too accustomed to them. I think it would depend on how you set it because if you know the limits of your personal trading, like how much loss you are willing to take, it is easily programmed in the bot.Quote from: rhomelmabini on December 19, 2022, 04:27:26 PMI personally don't have any experience with bots as I think it's time consuming to have one works or it's just a hassle in my opinion especially setting it up. It may eliminate the behavior towards trading especially the emotions but with market right now that's is not in good condition and volatility could spike in any moment I don't know if there's really a profitable one.It's not going to be time-consuming if you are able to set it up for a moment. For sure you need to set it depending on the market condition but once you are done with that, I think it's possible to not configure it for a while. Quote from: mk4 on December 19, 2022, 04:29:07 PMExpectation: you purchase a bot, you turn it on, and you make profit forever while relaxing at the beach in the BahamasReality: trading bots (at least the long-term successful ones) are used by active traders to automate some of the trades, and is constantly updated to fit the traders' needsI agree. Continuous development is the key to adjusting to the current market conditions.Quote from: Yawa2020 on December 19, 2022, 04:37:26 PMThe problem is that most of the bots are not genuine and were built just to scam traders using them and causing them more losses. Finding a legit bot is difficult as telling btc price in the next minute. So in my opinion, you should learn to use your human knowledge and capacity to trade and gain exciting experience than relying on a bot with your hard earned money. I think it's easy to see who has an actual working bot and see that it works. Don't believe in bots that promise returns but see something that actually works and has a community behind it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}