{
  "id": "topic_5502164",
  "title": "The Hidebehinder",
  "author": "The Hidebehinder",
  "created_time": "July 06, 2024, 02:14:23 PM",
  "content": "After months of constantly checking the mempool, calculating fees, waiting for weekends, using coin control to save $2-3 on each tx, finally I can see the light, fees are down to just 6 sat/vb, and finally seems like there is no more spam! Not even these market swing haven't pushed people to move coins from and to exchanges, the mempool will be hopeful soon drained and we can finally not care anymore about sending even a few tens of dollars worth of BTC, consolidate our inputs with pennies and not having stuck funds cause somebody was a cheap bastard!6sat/vb or 50 cents for a simple tx is normal now, will we see it 6 times cheaper?How long do you think it will take to reach this target? Days, weeks, months?I'm so optimistic I will say two weekends from now!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5502164",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "July 06, 2024, 02:40:10 PM",
      "body": "The mempool was empty in October 2023, after that transactions with 1 sat/vbyte fees weren't confirmed till now. Even though the fees are down from time to time, but I don't think it will down to 1 sat/vbyte because Bitcoin is going to bullish in the next few months, so the fees would increase since people might sell Bitcoin at the ATH.You need to wait at least a year and half when Bitcoin is in bear season.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 06, 2024, 03:03:17 PM",
      "body": "Quote from: Solosanz on July 06, 2024, 02:40:10 PMYou need to wait at least a year and half when Bitcoin is in bear season.Bear market is mostly boring for most of us and demands to purchase Bitcoin, trade it or move it in bear market is usually significantly lower than in bull market. What you said is true but I bet that except if you plan to wait for bear market to purchase more bitcoin or fraction of bitcoin, you will less likely want to see a bear market.Zoom out and see Bitcoin mempools recent years, since 2017https://jochen-hoenicke.de/queue/#BTC%20(default%20mempool),all,weightOP can read my thread and apply some tips if see fit.Minimize your transaction fee with Electrum wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Hidebehinder",
      "created_time": "July 06, 2024, 03:07:14 PM",
      "body": "Quote from: Solosanz on July 06, 2024, 02:40:10 PMEven though the fees are down from time to time, but I don't think it will down to 1 sat/vbyte because Bitcoin is going to bullish in the next few months, so the fees would increase since people might sell Bitcoin at the ATH.They didn't on the last ATH at 72k in March according to your own graph, so why would they move coins at the other ATH?Quote from: Solosanz on July 06, 2024, 02:40:10 PM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "July 06, 2024, 03:10:25 PM",
      "body": "Quote from: The Hidebehinder on July 06, 2024, 03:07:14 PMThey didn't on the last ATH at 72k in March according to your own graph, so why would they move coins at the other ATH?ATH or not, there are always Bitcoin transactions in Bitcoin blocks except barely seen empty blocks.If there is no transaction in many Bitcoin blocks, what does it mean?The Bitcoin blockchain, at that time, is more like a dead blockchain similarly to many altcoin blockchains.Fortunately, we don't see it on Bitcoin blockchains and your logic is broken. People have many reasons to move their bitcoins and no reasons why they should not move their bitcoins around ATH price range.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Hidebehinder",
      "created_time": "July 06, 2024, 03:16:08 PM",
      "body": "Quote from: tranthidung on July 06, 2024, 03:10:25 PMFortunately, we don't see it on Bitcoin blockchains and your logic is broken. What part of my logic is broken?He said that Bitcoin reaching an ATH will trigger higher fees, he posted a graph that shows that during an ATH fees went down!So, whose logic is broken here?Quote from: tranthidung on July 06, 2024, 03:10:25 PMIf there is no transaction in many Bitcoin blocks, what does it mean?The Bitcoin blockchain, at that time, is more like a dead blockchain similarly to many altcoin blockchains.It's you with a broken logic!If you have empty or half empty blocks it doesn't mean the chain is broken or dead, otherwise Bitcoin would have been dead from 2009 till 2023!Was Bitcoin broken 18 months ago?https://mempool.space/block/00000000000000000004ea65f5ffe55bfc0adbc001d3a8e154cc9f19da959ba8",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "July 06, 2024, 03:20:00 PM",
      "body": "Quote from: The Hidebehinder on July 06, 2024, 02:14:23 PM6sat/vb or 50 cents for a simple tx is normal now, will we see it 6 times cheaper?How long do you think it will take to reach this target? Days, weeks, months?I'm so optimistic I will say two weekends from now!I agree. I also think we will see 1 Sat/vB soon!!Look at transactions from feebuddy  nowQuote from: FeeBuddy on July 06, 2024, 01:59:51 PM      fastestFee: 7 sat/vBhalfHourFee: 7 sat/vBhourFee: 7 sat/vBeconomyFee: 4 sat/vBminimumFee: 2 sat/vBNobody can say when, but it is likely we will see 1 sat vB within some months from now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "July 06, 2024, 03:24:14 PM",
      "body": "The fees are indeed very cheap lately. Some people probably think it is happening because less people are using bitcoin. That might actually be true but you can also take advantage of that moment and consolidate your inputs because tomorrow people may again like bitcoin a lot. These market cycles happen all the time it is nothing new. Bitcoin dumps, nobody likes it, fees go down… bitcoin rises, everyone likes it, fees go up. Right now it is time to accumulate and consolidate…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "July 06, 2024, 03:36:35 PM",
      "body": "Quote from: The Hidebehinder on July 06, 2024, 03:16:08 PMWhat part of my logic is broken?He said that Bitcoin reaching an ATH will trigger higher fees, he posted a graph that shows that during an ATH fees went down!So, whose logic is broken here?The thing is the bitcoin transaction fee is definitely not something anyone can actually predict when it will go up or come down it is just like the price itself, everything is just mere speculation and nothing more to me, you should always use the lower fees when it’s there. Concerning the chart I think what Solosanz wanted to point out is that there were high fees during the period of November last year until March this year, which was the same period we had the price of bitcoin to be very bullish and also got a new all time high, so logically it could be that people were selling off their profits. But to me that was just coincidental although during bull period there is high percentage of greed which means high movement of coins but this period of time we are talking was definitely caused by the ordinal inscription scams, so it was just coincidental then and nothing to do with the bullish price movementsBitcoin price isn’t in anyway correlated with the fees, it was just a speculation that Solosanz made that probably it could go up again when bulls set in. My advice is use this period well and don’t wait for lower fees, you never might know when the network spammers could come back again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fenixosup",
      "created_time": "July 06, 2024, 04:37:02 PM",
      "body": "Finally after half year we see good fee rates. Unfortunately, it mean that no one is transacting right now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 06, 2024, 05:01:42 PMLast edit: July 06, 2024, 05:48:01 PM by franky1",
      "body": "easier methods would be to get all wallet defaults to increment in bumps of 1sat/kb instead of current defaults that increment in larger amountsfor instancea wallet that bumbs in 1sat/b would see a 226byte tx jump from 226sat to 452sat just in one incrementhowever doing 1sat/kb would see a 226byte tx jump from 226sat to 227sat in just one incrementits like auctionsimagine a bidding war that starts at $50 but each bidder screams out $150, $250, $350.. instead of $52, $54, $56the larger the bump, the faster the average fee jumps to stupidly high numbersthe smaller the bump, the less the average fee jumps to stupidly high numbers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moreno233",
      "created_time": "July 06, 2024, 06:31:12 PM",
      "body": "Quote from: The Hidebehinder on July 06, 2024, 02:14:23 PMAfter months of constantly checking the mempool, calculating fees, waiting for weekends, using coin control to save $2-3 on each tx, finally I can see the light, fees are down to just 6 sat/vb, and finally seems like there is no more spam! Not even these market swing haven't pushed people to move coins from and to exchanges, the mempool will be hopeful soon drained and we can finally not care anymore about sending even a few tens of dollars worth of BTC, consolidate our inputs with pennies and not having stuck funds cause somebody was a cheap bastard!6sat/vb or 50 cents for a simple tx is normal now, will we see it 6 times cheaper?How long do you think it will take to reach this target? Days, weeks, months?I'm so optimistic I will say two weekends from now!It might look possible to achieve 1sat/vb if we consider how fast the fee was dropping few weeks ago but I do not think we will achieve it anytime soon. Now the fees have been fluctuating seriously in response to the market finding a support and the gradual recovery we are seeing after the dump. If the market continues upward, then the fees will follow it as well and the idea of 1sat/vb will only be a wish that will hardly come true. I would actually love a situation where the fees is that low because higher fees is one of the major reason hindering Bitcoin adoption in businesses. If that is address, we will see many people and business using Bitcoin in their daily needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 07, 2024, 03:01:48 AM",
      "body": "Just because fees are lower than months ago at the peak of the spam attack, it doesn't mean the attack itself has stopped. When looking at the mempool chart at a longer period like 2 weeks[1] I still see a persistent attack going on that is filling the blocks.Some people are still abusing the hell out of the protocol and are injecting junk into the chain[2] using different methods.Can we go back to 1 sat/vb? It's hard to predict as long as the spam/Ordinals family of attacks are not stopped. But it is not impossible. [1] https://jochen-hoenicke.de/queue/#BTC,2w,weight[2] https://mempool.space/tx/c605f1c28813b85e76a6f9abaaa4002a51792a0244addbfe13624761ba128173",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "July 07, 2024, 04:05:01 AM",
      "body": "Fees are lower now but there are still 188,290 unconfirmed TXs, according to mempool.space, people just don't pay big bucks to spam mempool anymore but I don't see the fees going down to 1 sat and even less when we are in the middle of a bull market and the price is likely to go up in the next months, as Solosanz points out. Expecting that to happen seems too optimistic to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "July 07, 2024, 08:43:19 AM",
      "body": "Quote from: The Hidebehinder on July 06, 2024, 03:07:14 PMThey didn't on the last ATH at 72k in March according to your own graph, so why would they move coins at the other ATH?Because they didn't expect Bitcoin would create new ATH before halving, people were expect the peak of Bitcoin around near end of this year or beginning in the next year.Quote from: The Hidebehinder on July 06, 2024, 03:16:08 PMHe said that Bitcoin reaching an ATH will trigger higher fees, he posted a graph that shows that during an ATH fees went down!ATH will trigger higher fees, but at that time ordinals were spamming the mempool. If there were no ordinals, I believe March 2024 should be the peak at that time.https://dune.com/dgtl_assets/bitcoin-ordinals-analysisHowever, the good news is the fees keep going down, now you can send transaction with 5sat/vbyte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "July 07, 2024, 08:54:33 AM",
      "body": "You don't want cheaper transactions in Bitcoin as miners are already struggling to stay alive with the block reward that was recently cut-off by 50%.The goal of Bitcoin is to have more expensive transactions with time.If you cheer the idea of \"There will only be 21M\" then you should also cheer whenever tx fee goes up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 07, 2024, 11:31:17 AM",
      "body": "Quote from: MeGold666 on July 07, 2024, 08:54:33 AMYou don't want cheaper transactions in Bitcoin as miners are already struggling to stay alive with the block reward that was recently cut-off by 50%.Every halving people make the same claim and every cycle we only see hashrate rising since miners are making more money than you think.QuoteThe goal of Bitcoin is to have more expensive transactions with time.Wrong. The goal of Bitcoin has always been to create a decentralized payment system.QuoteIf you cheer the idea of \"There will only be 21M\" then you should also cheer whenever tx fee goes up.If you want adoption to grow and Bitcoin not to be replaced by something else (and die) you should wish bitcoin remains usable. That requires low fees and no spam attacks exploiting the protocol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MeGold666",
      "created_time": "July 07, 2024, 11:44:43 AMLast edit: July 07, 2024, 12:24:25 PM by MeGold666",
      "body": "Quote from: pooya87 on July 07, 2024, 11:31:17 AMEvery halving people make the same claim and every cycle we only see hashrate rising since miners are making more money than you think.Far from the truth:https://www.youtube.com/watch?v=sw6aMxaNmXA&t=416sI don't know if you're familiar how difficulty works but tl;dr: More network hashrate = less profit for most miners.It's a fight for who eats most of the cake and it's getting centralized due to competition outperforming smaller miners.Quote from: pooya87 on July 07, 2024, 11:31:17 AMWrong. The goal of Bitcoin has always been to create a decentralized payment system.This does not make my statement wrong, the goal was simply not achieved and postponed due to endless promises of the failed project called Lightning Network.Quote from: pooya87 on July 07, 2024, 11:31:17 AMIf you want adoption to grow and Bitcoin not to be replaced by something else (and die) you should wish bitcoin remains usable. That requires low fees and no spam attacks exploiting the protocol.So how the network suppose to survive on low-fees when there will be not enough block reward to sustain the mining operation ?Miners are already shifting towards AI learning and replacing their ASIC machines with HPC in their facilities.This is the biggest problem of Bitcoin - instead of fixing known issues with known solutions, people just wish everything will be alright.Here's a little song for you:https://www.youtube.com/watch?v=mg5QAO72eLo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "July 07, 2024, 04:27:26 PM",
      "body": "Quote from: MeGold666 on July 07, 2024, 11:44:43 AMThis does not make my statement wrong, the goal was simply not achieved and postponed due to endless promises of the failed project called Lightning Network.Your statement is still wrong.  The goal of Bitcoin was never to have more expensive Transactions with time.  This was a problem that came up with time, not a goal.How did Lightning Network fail?  Because it did not bring enough Bitcoin users to be part of it until today?  Bitcoin is still pretty hard to learn, Lightning makes things even more complicated in my opinion.  This does not make Lightning a failure.  It was more of an experiment anyway.  Bitcoin is an experiment itself.Quote from: MeGold666 on July 07, 2024, 11:44:43 AMThis is the biggest problem of Bitcoin - instead of fixing known issues with known solutions, people just wish everything will be alright.You are free to contribute to Bitcoin at any given time if you think it is better than wishing.  Why are you not contributing and solving the known issues?  Many of us only wish because we do not possess the skills and knowledge to solve issues, even if we knew what the solution was.  From speaking an idea to writing the right lines of code to solve the problems AND have everybody else agree with your suggested changes, it is a long road.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "July 07, 2024, 04:44:31 PM",
      "body": "Quote from: The Hidebehinder on July 06, 2024, 02:14:23 PM6sat/vb or 50 cents for a simple tx is normal now, will we see it 6 times cheaper?I hope so. It's been so long since I've checked the fees and just because of this thread, was surprised to see it down to 6 sats/vB.Quote from: The Hidebehinder on July 06, 2024, 02:14:23 PMHow long do you think it will take to reach this target? Days, weeks, months?I'm so optimistic I will say two weekends from now!I don't want to guess but right now is totally fine for me and it will be better if we'd see that anytime in the next few days, months - anytime in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}