{
  "id": "topic_5452316",
  "title": "UchihaSarada",
  "author": "UchihaSarada",
  "created_time": "May 11, 2023, 03:19:57 AM",
  "content": "Electrum wallet software developers just made very great upgrade to Turn off (Disable) RBF option in their wallet.Now, with newest Electrum wallet version, RBF (Replace-by-Fee) is Enabled by default option in the wallet. You are no longer to turn it on or off like with older versions.With this change, people will not have to use Child-Pay-For-Parents with more complexity and more expensive transaction fee. They won't have to see their transactions stuck in mempools too long while they can not do anything.Previous versionsCurrent version 4.4.2Some more information about this upgrade in Electrum wallet.Mempools look better and now you can have your transaction at tip of mempool if you use 60 sat/vbyte rate for your transaction.Remove RBF from user visible settings #8088 Set the RBF flat to all transactions, and remove the 'use_rbf'Recent full-RBF replacements https://jochen-hoenicke.de/queue/#BTC%20(default%20mempool),1w,weightHow Replace-By-Fee (RBF) an Child-Pays-For-Parent (CPFP) can speed up confirmations[TUTORIAL]getting a low-fee transaction unstuck by creating a CPFP with electrum",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452316",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "May 11, 2023, 08:27:54 AM",
      "body": "Quote from: UchihaSarada on May 11, 2023, 03:19:57 AMNow, with newest Electrum wallet version, RBF (Replace-by-Fee) is Enabled by default option in the wallet. You are no longer to turn it on or off like with older versions.Replace-by-fee is by default on Electrum version 4.1.0 or so. RBF has been default since more than two years ago since when some older versions were released. I could not remember the exact version, but I know the version was released in 2020.Quote from: UchihaSarada on May 11, 2023, 03:19:57 AMWith this change, people will not have to use Child-Pay-For-Parents with more complexity and more expensive transaction fee. They won't have to see their transactions stuck in mempools too long while they can not do anything.That is true. But if you are sent a transaction and not yet confirmed, some wallets like Electrum and Bluewallet wallet makes it easy to use CPFP if the sender do not enable RBF, or if the sender sent it from wallets that does not support RBF. All you need to do is to click on the unconfirmed transaction, where you will see pump fee, you will see CPFP instead because the transaction does not support RBF.CPFP fee is more expensive. Also people should take note that there are situations CPFP is not advisable, especially if the outputs of the incoming unconfirmed transaction is high, I mean if the sender sent to many addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "May 11, 2023, 11:36:36 AM",
      "body": "Quote from: Charles-Tim on May 11, 2023, 08:27:54 AMReplace-by-fee is by default on Electrum version 4.1.0 or so. RBF has been default since more than two years ago since when some older versions were released. I could not remember the exact version, but I know the version was released in 2020.See differenceQuote from: UchihaSarada on May 11, 2023, 03:19:57 AMYou are no longer to turn it on or off like with older versions.Previous versionsCurrent version 4.4.2Options for Change address, Multiple change address, RBF, Batch RBF transactions, Spend only confirmed coins, Advance Preview were Turn off.They are Enabled by default and the newest version does not allow you to Disable it. It gives Newbies better Default, they will not have stuck transactions in mempools and can not do anything to bump fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "May 11, 2023, 01:59:24 PMLast edit: May 14, 2023, 03:37:27 PM by JeromeTash",
      "body": "Quote from: UchihaSarada on May 11, 2023, 11:36:36 AMOptions for Change address, Multiple change address, RBF, Batch RBF transactions, Spend only confirmed coins, Advance Preview were Turn off.Most of the options are still there once you click pay. They just moved them away from under preferences. What I see just missing is the RBF part. There is also a preview optionI can see this changes in version 4.4.1 as well, So I don't think it started with the latest update.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 11, 2023, 02:31:50 PM",
      "body": "Quote from: UchihaSarada on May 11, 2023, 11:36:36 AMThey are Enabled by default and the newest version does not allow you to Disable it. It gives Newbies better Default, they will not have stuck transactions in mempools and can not do anything to bump fee.Many users may not like these changes and therefore they will try to avoid updating as much as possible, and the reason for this is that some deposits (especially for gambling services) give you the possibility of instant deposits with zero confirmations as long as the transaction does not contain RBF enable.Generally, we should stop thinking about accepting zero-confirmation transactions in the future. However, many platforms rarely update their code regularly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "May 12, 2023, 03:59:06 PM",
      "body": "Quote from: hugeblack on May 11, 2023, 02:31:50 PMMany users may not like these changes and therefore they will try to avoid updating as much as possible, and the reason for this is that some deposits (especially for gambling services) give you the possibility of instant deposits with zero confirmations as long as the transaction does not contain RBF enable.Until they get a warning that their current software version may stop functioning properly, many users will not want to update their softwares because they sometimes cannot tell what to expect, they never check to see the upgraded features, and also because they know that with every update notification, they have to become careful with where they are updating their software from to avoid loss.Upgrades and updates to softwares are good, Quote from: hugeblack on May 11, 2023, 02:31:50 PMmany platforms rarely update their code regularly.I wonder if this is good? or what their reason behind it may be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}