{
  "id": "topic_5307057",
  "title": "rdbase",
  "author": "rdbase",
  "created_time": "January 05, 2021, 04:08:41 PM",
  "content": "Looks like Vaneck is proposing another go at getting an ETF approved by the SEC and they just might get it since the recent wins by them against ripple and getting major exchanges to delist their tokens.I think it gives them a sense of power of basically destroying xrp and any collaborations they once had with their backers.https://www.irishtimes.com/business/technology/revolut-warns-that-cryptocurrency-xrp-could-become-worthless-1.4449821Anyways, back to the news at hand..https://markets.businessinsider.com/currencies/news/bitcoin-etf-could-finally-become-a-reality-in-2021-after-vaneck-filing-2020-12-1029926923https://www.coindesk.com/vaneck-proposes-bitcoin-etf-againEven Anthony Scaramucci is getting into the act. https://www.thinkadvisor.com/2021/01/04/skybridge-capital-launches-bitcoin-fund-vaneck-tries-again-for-a-bitcoin-etf/Never heard of skybridge before and must of created it seeing when bitcoin mooned in the last couple of months and wanted a piece of the action on cashing in on it's success.A bitcoin fund?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5307057",
  "comments": [
    {
      "author": "BrewMaster",
      "created_time": "January 05, 2021, 05:32:40 PM",
      "body": "i don't think it has anything to do with the current price action because they (among others) have been trying to get SEC to approve their ETF for a very long time. it seems like they try at least once a year if not more. they did it even when price was falling in 2018 and 2019 and haven't given up yet.it is interesting that US keeps rejecting ETFs while the rest of the world is already celebrating the anniversary of their ETFs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "January 06, 2021, 05:30:55 AM",
      "body": "Quote from: BrewMaster on January 05, 2021, 05:32:40 PMi don't think it has anything to do with the current price action because they (among others) have been trying to get SEC to approve their ETF for a very long time. it seems like they try at least once a year if not more. they did it even when price was falling in 2018 and 2019 and haven't given up yet.it is interesting that US keeps rejecting ETFs while the rest of the world is already celebrating the anniversary of their ETFs. SEC news were used to raise or sink bitcoin price in 2017 to 2019. People used to think that SEC approval, disapproval, posititve or negative decisions will help bitcoin grows more or will kill bitcoin.What was demonstrated by the market? Bitcoin fell because of bear market and rose because of bull market. In different market, SEC news have different things to do with bitcoin price action.Obviously, the new attempt at Bitcoin ETF is absolutely a positive new.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "January 06, 2021, 12:23:21 PM",
      "body": "These ETF request denials happened so many times that I don't expect anything different from the SEC anymore. I don't know what's the main drive behind the price growth right now (I'm guessing it's FOMO), but I don't think such proposals are related to it. If anything, another denied request might trigger the collapse of the price (I think it happened before), even though it doesn't really matter IMO. So now is probably not a good time to try again and risk the FUD over the denial to spread and end the bull run swiftly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdbase",
      "created_time": "October 11, 2021, 08:02:41 PM",
      "body": "There were three more ETFs waiting for approval from the senate.This time one of them have to go through since bitcoin has raised in price by 10 fold since the last time they were looking at them.And the economic situation has changed so drastically with the collapsing of the debt ceiling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "October 11, 2021, 09:24:38 PM",
      "body": "Quote from: BrewMaster on January 05, 2021, 05:32:40 PMi don't think it has anything to do with the current price action because they (among others) have been trying to get SEC to approve their ETF for a very long time. it seems like they try at least once a year if not more. they did it even when price was falling in 2018 and 2019 and haven't given up yet.it is interesting that US keeps rejecting ETFs while the rest of the world is already celebrating the anniversary of their ETFs. For one, I like the fact that they haven't given up the fight against the SEC to get Bitcoin ETF approved. I've been hearing of these ETFs from Vaneck so I don't think it's because of the recent market recovery but it's also good timing as there's positivity in the space at the moment. No matter the number of times the SEC will reject these ETF proposals, I'm sure one day they will approve of it. Can't wait for that day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "October 11, 2021, 09:49:25 PM",
      "body": "Quote from: nelson4lov on October 11, 2021, 09:24:38 PMQuote from: BrewMaster on January 05, 2021, 05:32:40 PMi don't think it has anything to do with the current price action because they (among others) have been trying to get SEC to approve their ETF for a very long time. it seems like they try at least once a year if not more. they did it even when price was falling in 2018 and 2019 and haven't given up yet.it is interesting that US keeps rejecting ETFs while the rest of the world is already celebrating the anniversary of their ETFs. For one, I like the fact that they haven't given up the fight against the SEC to get Bitcoin ETF approved. I've been hearing of these ETFs from Vaneck so I don't think it's because of the recent market recovery but it's also good timing as there's positivity in the space at the moment. No matter the number of times the SEC will reject these ETF proposals, I'm sure one day they will approve of it. Can't wait for that day. And that day, maybe they finally realized that bitcoin will survive even without their intervention.Because right now, we are seeing that bitcoin is already doing great even without their approval of this bitcoin ETF. I am on the side that we will really see this in the traditional market exchanges in the very near future.I also believe that it is only a matter of time before we see that day. And once it happens, I guess, the value of bitcoin will further boost its worth in the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 12, 2021, 04:34:22 AM",
      "body": "Unrelated to price really! But I am particularly excited about VanEck's proposition because they had a plan to launch physical bitcoin backed ETF. And probably that's one of the reasons why their proposal is getting rejected over and over again by SEC. But if they finally get the approval to launch bitcoin ETF, that might become another trigger point in the market. But really I don't have high hopes this time as well especially after getting rejected so many times. Possible SEC is acting under some influence! Who knows!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amishmanish",
      "created_time": "October 12, 2021, 05:45:38 AM",
      "body": "Quote from: rdbase on January 05, 2021, 04:08:41 PM--snip--I think it gives them a sense of power of basically destroying xrp and any collaborations they once had with their backers.https://www.irishtimes.com/business/technology/revolut-warns-that-cryptocurrency-xrp-could-become-worthless-1.4449821People confusing Bitcoin with scams like XRP may well be the reason that SEC is taking so long on regulatory clarity. For example, if one talks about cryptocurrencies, then BTC is really the only one with PoW and zero central leadership such that it can be identified as a new entity.The Cacth-22 in front of SEC may well be about what to do with bullshit like XRP where some \"Foundation\" gave itself 60 Billion pre-mined coins and has been selling them to retail buyers since then with active support from centralized exchanges. I think they really want to set the record straight when it comes to \"Satoshi's inventions\" and these copies that were simply scams supported by slick marketing and bagholders who find these of value.They have to tread that fine line between corporate coins and actual cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdbase",
      "created_time": "October 12, 2021, 12:39:01 PM",
      "body": "Quote from: amishmanish on October 12, 2021, 05:45:38 AMQuote from: rdbase on January 05, 2021, 04:08:41 PM--snip--I think it gives them a sense of power of basically destroying xrp and any collaborations they once had with their backers.https://www.irishtimes.com/business/technology/revolut-warns-that-cryptocurrency-xrp-could-become-worthless-1.4449821People confusing Bitcoin with scams like XRP may well be the reason that SEC is taking so long on regulatory clarity. For example, if one talks about cryptocurrencies, then BTC is really the only one with PoW and zero central leadership such that it can be identified as a new entity.The Cacth-22 in front of SEC may well be about what to do with bullshit like XRP where some \"Foundation\" gave itself 60 Billion pre-mined coins and has been selling them to retail buyers since then with active support from centralized exchanges. I think they really want to set the record straight when it comes to \"Satoshi's inventions\" and these copies that were simply scams supported by slick marketing and bagholders who find these of value.They have to tread that fine line between corporate coins and actual cryptocurrencies.This is exactly why it is taking so long to secure approval in the US due to SEC seeing what is happening with XRP in the courts.Deeming them a security and with coins like Shiba-inu rising it's market cap by 170% in a week while having no use case other then for the lawls.https://investorplace.com/2021/10/shiba-inu-price-predictions-are-white-hot-as-shib-sniffs-out-new-highs",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 12, 2021, 12:43:06 PM",
      "body": "Quote from: rdbase on October 11, 2021, 08:02:41 PMThere were three more ETFs waiting for approval from the senate.That decision, however, is within the competence of the SEC, not the Senate. Yet the SEC certainly cannot operate without policy influence and will not approve an ETF until it receives a signal from the top.Quote from: avikz on October 12, 2021, 04:34:22 AMUnrelated to price really! But I am particularly excited about VanEck's proposition because they had a plan to launch physical bitcoin backed ETF. All the statements coming from the SEC go in the direction that a physically-backed ETF has very little chance, and that it is more likely that the first ETF will be futures-based. Although many different experts in their reflections have expressed doubts about the possibility of any ETF approved during 2021 - so I hope that people will not be too disappointed if this does not happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 13, 2021, 10:10:13 AM",
      "body": "I could care less about the Bitcoin ETF at this point, there's so many things out there that are already very similar. If somebody really cared they could invest in those already. But really ETF is just a psycho-trigger for \"number go up\" and I find that mantra dreadfully boring by now. If Bitcoin surpasses ATH before the end of year, its because it was time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdbase",
      "created_time": "October 14, 2021, 12:19:29 PM",
      "body": "Yes but on the whole world is watching scenario then it would cause more people in the investment sector to keep notice.And as governments work, they see it passing into senate of it done and dusted then they see uncle sam's seal of approval on it. Also they will have more of a sense of security in using it for their crypto policy bills to pass by those government officials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "October 14, 2021, 12:26:00 PM",
      "body": "You can check newly filing and waiting for approval Bitcoin ETFs with List of ETF filings this year in the US(NEW ETF ADDED) This year is like the year 2017 when Bitcoin Futures made the market hyped in October but the 2 official Bitcoin Future exchanges were launched in December. Bitcoin hit 2017 all time high and after that, well we know, the winter season that lasted in 3 years.This market is bigger now and with the participation of institutional investors and the growth of blockchain industry, I hope that the market cycle will be shorter, 2 years rather than 4 years. I only hope so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdbase",
      "created_time": "October 15, 2021, 04:12:39 PM",
      "body": "Since the price is going up some are mentioning it could be due to the impending approval of this ETF by US regulators.https://www.reuters.com/business/finance/us-sec-poised-allow-first-bitcoin-futures-etf-bloomberg-news-2021-10-15/Now there is a difference between the ProShares which is based on the futures market and the one from VanEk.Major media outlets are stating it could be by Tuesday next week according to CNBC.https://www.cnbc.com/2021/10/15/bitcoin-etfs-may-finally-make-their-debut-sort-of.html",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdbase",
      "created_time": "October 22, 2021, 02:32:29 PM",
      "body": "With two bitcoin ETF's launching it seems there are limits on these futures:https://www.bloomberg.com/news/articles/2021-10-21/bitcoin-etf-is-already-in-danger-of-breaching-a-limit-on-futuresThe one from valkyrie seems to have no effect as the first one did to the news involved for interest towards these offerings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blawpaw",
      "created_time": "October 23, 2021, 12:01:26 AMLast edit: October 23, 2021, 01:03:04 AM by Blawpaw",
      "body": "Plenty of good news coming out! A lot of ETFs are being prepared to set sail. Not only VanEck, Grayscale also announced it was looking to have NYSE filing a document requesting for their GBTC fund to be converted into an ETF:https://news.bitcoin.com/grayscale-convert-gbtc-into-bitcoin-etf/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdbase",
      "created_time": "October 26, 2021, 01:46:21 AM",
      "body": "Quote from: Blawpaw on October 23, 2021, 12:01:26 AMPlenty of good news coming out! A lot of ETFs are being prepared to set sail. Not only VanEck, Grayscale also announced it was looking to have NYSE filing a document requesting for their GBTC fund to be converted into an ETF:https://news.bitcoin.com/grayscale-convert-gbtc-into-bitcoin-etf/I've seen news of Valkyrie wanting to start two or three more ETF's but those are futures.Are these new ones offered from VanEck and Grayscale ones that are backed by bitcoin?That seems to be the ones everyone are waiting for from the US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 26, 2021, 05:23:23 AM",
      "body": "many bitcoin backed ETF are getting hit by the SEC decision wall. so some companies are trying to side set the application process with the unbacked-futures version.to then show proof of concept of meeting policy of different regulations the SEC want. to then prove the company has the capacity, ability and systems inplace to meet requirements. and then get SEC trust and approval to allow the company to then offer backed assets.after all the SEC dont wanna give licences to just any random company that has no history of ever handling an ETFits like brewing beer to prove you can make ethanol to then win a licence to make bio diesel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "October 26, 2021, 10:33:06 AM",
      "body": "These ETFs are kinda the top signal for Bitcoin? Hmmm, I don't think so, because as I can remember back to 2017-2018, ETFs are starting to pop before, and that's the time we experienced a very long bear run before we broke the old ATH which is $20,000.But for me this time, it is different, the market is more mature now compare to before that's why even ETF will not be approved, the market is not overreacting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}