{
  "id": "topic_5439466",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "February 11, 2023, 01:44:36 PM",
  "content": "Link to newshttps://www.theblock.co/post/210804/ethereum-cofounder-vitalik-buterin-donates-99-ether-to-ahbap-earthquake-supportHe has donated Ethereum worth $150000 to help people in Turkey and Syria because of recent earthquake. This is not the first time he had done this. He did a similar work in the past where he made big donation using crypto in India.When we talk about crypto and alt coins, so may people associate scams and bad people related to it. But this is an example that there are good people associated with crypto and crypto can be used for good work also in the society. Have you ever made any charity in crypto or plan to do so in future ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439466",
  "comments": [
    {
      "author": "abel1337",
      "created_time": "February 11, 2023, 03:10:05 PM",
      "body": "Quote from: krishnaverma on February 11, 2023, 01:44:36 PMLink to newshttps://www.theblock.co/post/210804/ethereum-cofounder-vitalik-buterin-donates-99-ether-to-ahbap-earthquake-supportHe has donated Ethereum worth $150000 to help people in Turkey and Syria because of recent earthquake. This is not the first time he had done this. He did a similar work in the past where he made big donation using crypto in India.When we talk about crypto and alt coins, so may people associate scams and bad people related to it. But this is an example that there are good people associated with crypto and crypto can be used for good work also in the society. Have you ever made any charity in crypto or plan to do so in future ? Actually we have a charity in this forum and there are funds in it but sadly it was mishandled by someone or rather the fund handler which is supposedly trusted. There are good people who donated on that charity funds but we all should care on who is the one handling the funds. There are couple of crypto donation in the history and one of the biggest funding I'm thinking is this event where Vitalik donated that kind of amount to the earthquake support. It's really helpful that Vitalik can easily send that kind of amount even if he is on the other side of the world comparing it to bank or fiat transfer which takes couple of steps and processes even if it's a donation. I hope that the one who is handling Vitalik Donation is a pure hearted one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "February 11, 2023, 03:32:40 PM",
      "body": "QuoteAhbap's official website says $4,207,562 in crypto donations has been collected.  they gonna need more than this.Vilatik can influence a lot of big investors in crypto, this initiative of him can help crypto make a good name. this is the kind of catastrophic event that should make the world unite than having a war that actually can be prevented. with cooler heads. we are not seeing big names yet but we might soon see Charles Hoskinson or CZ also donate a stash. hopefully.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "February 11, 2023, 05:11:39 PM",
      "body": "Yeah, he has done this before and it's not just a few amounts of money and ether but it's like a life savings of an individual since he's got really a lot of Ethereum on hold. Well, I've done charities before and still doing it silently and I don't want to speak about it because if ever I do good deeds such as donating or giving to charities, I want to keep it hidden and silent since that's the essence of helping for me. But at some point, when I see huge names having these news, it's a must to broadcast it so that it also encourages others to help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oneandpure",
      "created_time": "February 11, 2023, 05:25:56 PM",
      "body": "No doubt about fact with many cryptocurrency founder have real human right, this not first time about Ethereum developer Vitalik Buterin donates for every human right happened. I am so sad what happen with Ahbap's earthquake and many people have been pass away there. Have good contribution from Vitalik Buterin with his donation about 99 Ethereum or worth $150000 to help many people in Turkey and Syria.Could be good impact later with how human right from cryptocurrency will get space left for making Bitcoin or Altcoin as legal tender transaction and become easy with transparent from cryptocurrency and another donation for later.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "February 11, 2023, 08:30:09 PM",
      "body": "Quote from: krishnaverma on February 11, 2023, 01:44:36 PMLink to newshttps://www.theblock.co/post/210804/ethereum-cofounder-vitalik-buterin-donates-99-ether-to-ahbap-earthquake-supportHe has donated Ethereum worth $150000 to help people in Turkey and Syria because of recent earthquake. This is not the first time he had done this. He did a similar work in the past where he made big donation using crypto in India.When we talk about crypto and alt coins, so may people associate scams and bad people related to it. But this is an example that there are good people associated with crypto and crypto can be used for good work also in the society. Have you ever made any charity in crypto or plan to do so in future ? He did the right thing here as this move shows that crypto can be used to do really good deeds like this one,helping people affected by a really destructive earthquake who has already taken more than 20.000 people lives and over 75.000 are injured so Turkey and Syria need as much money as they can get.I have done charity using crypto several times but my amounts have never passed more than 100 dollars per charity as that is how much money I can afford for charity and I always use crypto because I want to be anonymous.Every time I see donations in Linkedin for example I post there (with my wife account of course) about why not making crypto available as a form of payment,everyone of us has to do his part to make crypto more widely accepted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "February 11, 2023, 08:52:44 PM",
      "body": "There’s a lot of donation drive that are being host by many platforms.Recently when I open my Trustwallet you will see a donation option right away which I think is a good gesture and initiative by many platforms. Vitalik seems to be more active when it comes to donations since this is not the first time from him and probably other big names are also making their donations privately. Crypto helps a lot of people in the past years, and will continue this good purpose in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "February 11, 2023, 08:56:54 PM",
      "body": "Vitalik Buterin has donated that amount of ether well that’s great, and it’s a bad time for the earthquake victims and any help is welcome, I sent mine yesterday although it was very small it would go along way.Great to see the crypto-currency community coming through for nations in distress and the easy to make donations in Crypto-currency shows more of the value it can add to the world.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "February 12, 2023, 03:41:13 PM",
      "body": "Quote from: krishnaverma on February 11, 2023, 01:44:36 PM...He has donated Ethereum worth $150000 to help people in Turkey and Syria because of recent earthquake. This is not the first time he had done this. He did a similar work in the past where he made big donation using crypto in India...Today Vitalik Buterin sent another 50 ETH https://etherscan.io/tx/0xafa5ab0ae04e045267210a95c69ca6ef1107e503717c9f2aa800150b64eb27ad to the Anka Relief wallet, which was created to support Turkey after the earthquakes. Thus, his donation for earthquake victims increased to 150 ETH. I want to remind you that last year Vitalik Buterin donated 1500 ETH to help Ukraine - https://twitter.com/Unchainfund/status/1511748918517899267",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "February 12, 2023, 05:22:25 PM",
      "body": "Quote from: krishnaverma on February 11, 2023, 01:44:36 PMWhen we talk about crypto and alt coins, so may people associate scams and bad people related to it. But this is an example that there are good people associated with crypto and crypto can be used for good work also in the society. Have you ever made any charity in crypto or plan to do so in future ? Yes the heroic moments are majorly ignored by the media. Media always want hateful and spicy news , that will gain themselves TRP and they really don’t care about the sentiment of the people. This is the main reason for which the people aren’t able to see the good side of the crypto. It would have been even better, If the Donation was made anonymously. Nevertheless I didn’t get any chance to till now help people with crypto, when I will have enough money or crypto, then definitely I will donate to the needy ones. For now I am following the principle of “Charity begins at Home”.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "February 12, 2023, 07:09:18 PM",
      "body": "Quote from: tvplus006 on February 12, 2023, 03:41:13 PMQuote from: krishnaverma on February 11, 2023, 01:44:36 PM...He has donated Ethereum worth $150000 to help people in Turkey and Syria because of recent earthquake. This is not the first time he had done this. He did a similar work in the past where he made big donation using crypto in India...Today Vitalik Buterin sent another 50 ETH https://etherscan.io/tx/0xafa5ab0ae04e045267210a95c69ca6ef1107e503717c9f2aa800150b64eb27ad to the Anka Relief wallet, which was created to support Turkey after the earthquakes. Thus, his donation for earthquake victims increased to 150 ETH. I want to remind you that last year Vitalik Buterin donated 1500 ETH to help Ukraine - https://twitter.com/Unchainfund/status/1511748918517899267No matter 50 or 100, Vitalik did not remain indifferent to the earthquake victims and made donations. I think the important thing is people's intention. If everyone is sensitive, we can help earthquake survivors without saying more or less. In addition, Vitalik raised awareness and became a role model for important others by donating to earthquake survivors. I think he did an important job that will always be remembered with respect.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "February 12, 2023, 07:28:41 PM",
      "body": "Cryptocurrencies have once again demonstrated their advantage over fiat money. It is much faster and more convenient if the same thing was tried with fiat money and the banking system.If we are talking about a good example of using altcoins, Ethereum is not the right example to say that altcoins are used for good things and not just associated with scams and bad people. Ethereum has never been associated with scam anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "onurgozupek",
      "created_time": "February 14, 2023, 08:48:33 AM",
      "body": "You can track Ahbap's (NGO) donation portfolio and support Turkiye to recover from the devastating earthquake. https://portfolio.nansen.ai/dashboard/APE-JBS8U7",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}