{
  "id": "topic_5408039",
  "title": "Queentoshi",
  "author": "Queentoshi",
  "created_time": "July 29, 2022, 12:26:51 PM",
  "content": "Hello everyone, I recently have started to develop an interest in sports. I saw a few games from the ongoing Euro women cup and liked the feeling of excitement watching the games gave me. I have asked around and I have been informed that a new football season will soon begin plus it is a great time to pick a team to support, so I'm here to ask, what criterias did you consider before choosing to support a team?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5408039",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "July 29, 2022, 12:51:13 PM",
      "body": "I am excited that top leagues in the world will soon start new season, it is all we have even waiting for.I think supporting team is natural, but people tend to go for a particular club that is leading when they started to know about football.I noticed I have natural likeness for Chelsea, but I do not know why, but I also like many clubs, especially winning clubs like Juventus, Bayern, PSG, Barcelona and Real Madrid, but which are winning clubs. Also I remember how I supported Leicester when the club won premier some years ago.Some people just like a club just because they like a particular player in the club and because of that, they support the club.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "July 29, 2022, 12:53:47 PM",
      "body": "I support the team I love because they have their training ground just 10 minutes away from where I live,a simple 10 minute walk and I can follow every training they do if I want.I go often to see the training as it inflicts in me some confidence that when I go to see the game in the stadium over the weekend I know they have trained hard and I expect only a win from them.This is not always the case as every team can lose games but overall I follow and support them because I have done so from quite many years until now,they even one time got relegated to 2nd division yet I kept following them,it is this that I call true love for a team,you follow them anywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "July 29, 2022, 01:05:33 PM",
      "body": "I guess the most exciting sports game is football because football has a large fan base and also several segments and tournaments on various levels, but the highest among them is the championship and premiere leagues and both will soon start and that period is one of the most entertaining periods. So you can spend some time to get yourself entertained and also place some bets if you have a team that you are supporting and trust their performance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 29, 2022, 01:11:49 PM",
      "body": "Quote from: Queentoshi on July 29, 2022, 12:26:51 PMHello everyone, I recently have started to develop an interest in sports. That's a great idea, many bettors nowadays are developing their skills in sports betting, especially football, I used to love doing slots betting but now I have switched to my talent for sports, Sports betting has its own charm and fun to bet on, you are taking the right steps for sports, I believe you can be successful in women's soccer betting.Quote from: Queentoshi on July 29, 2022, 12:26:51 PMso I'm here to ask, what criterias did you consider before choosing to support a team? Talking about the criteria, especially about the team, of course it can't be separated from the characteristics to build solidity in the team, there are many definitions that you need to pay attention to to consider a solid team before choosing a team to bet.The criteria you should consider a sports team to reach the level of a solid team include:First you have to look at the team in terms of.• Responsibility, Discipline, mutual support for each other, mutual trust in each other, vision and effective communication, these need to be considered for the progress of the team, For that in a sports team not only based on expertise, building solid relationships is also the most important factor in the world of sports, to achieve the team's success.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "July 29, 2022, 01:14:21 PM",
      "body": "Quote from: swogerino on July 29, 2022, 12:53:47 PMI support the team I love because they have their training ground just 10 minutes away from where I live,a simple 10 minute walk and I can follow every training they do if I want.I go often to see the training as it inflicts in me some confidence that when I go to see the game in the stadium over the weekend I know they have trained hard and I expect only a win from them.This is not always the case as every team can lose games but overall I follow and support them because I have done so from quite many years until now,they even one time got relegated to 2nd division yet I kept following them,it is this that I call true love for a team,you follow them anywhere.I am not from Europe but what you said make me think that most people in Europe may prefer to support the clubs that are in their location. In the state I am in my country, the club there is not that good but if any match will come up, I will still passionately just support my state club just because I was born in the state and also living in thee state.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rufsilf",
      "created_time": "July 29, 2022, 01:18:39 PM",
      "body": "if one member of the team is in my family, relatives, friends, or the same country. It is certainly you'll be doing this and they need support as well to boost their confidence knowing that someone or many people wants their success and victory. Another reason is that I know they have the potential and believe that they carry the sportsmanship.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "D-law",
      "created_time": "July 29, 2022, 01:20:23 PM",
      "body": "My Daddy made me support Manchester.I mean to say the red side of Manchester, You don't support red and you are like a traitor to the pack.Sisto's and brothers are all Manchester United fans till date. Out daddy had big influence on us",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "July 29, 2022, 01:20:38 PM",
      "body": "Quote from: Queentoshi on July 29, 2022, 12:26:51 PMHello everyone, I recently have started to develop an interest in sports. I saw a few games from the ongoing Euro women cup and liked the feeling of excitement watching the games gave me. I have asked around and I have been informed that a new football season will soon begin plus it is a great time to pick a team to support, so I'm here to ask, what criterias did you consider before choosing to support a team?In the NBA or other sports that are regional based team your loyalty should be to your city's team, the player is just secondary, but if it's an organization or company based I'll support a team with a big fighting heart I am a long loyal fan of a team with a very charismatic leader and fighting hearts and the legacy continues even though they keep changing their players I am still a supporter of their team because of the spirits they represent and that is never say die.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "July 29, 2022, 02:00:56 PM",
      "body": "Quote from: AbuBhakar on July 29, 2022, 12:42:55 PMI think most of us hear support there favorite team because of the players. For example in my case, My favorite NBA is Tim Duncan and right now my favorite team is Spurs even though they are already weak with there current roster. My fashion on basketball as a child is from idolizing Tim Duncan so I support this until now even though Tim is not active because I’ve been supporting them for a long time already because of the players that I like before. absolutely right mate we support the team if we feel that they will win their game and also we support our idols teams. Like you I am fan of basketball not only in my country, league which is PBA but also in NBA the biggest league in basketball as I support golden state warriors because of their players like Stephen curry and play Thompson who are my idols.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "D ltr",
      "created_time": "July 29, 2022, 02:15:46 PM",
      "body": "one thing that makes sense because we as fans of someone who is idolized must automatically support his or her club as well. For example, I used to idolize David Beckham when he joined Manchester United and after he left Manchester United I automatically supported the football club he was defending, even though I hated the club before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "July 29, 2022, 02:19:33 PM",
      "body": "Hello, I think this is one brilliant question, that I have never thought so deeply about till now. I used to love Thierry Henry of Arsenal so much that I became a fan of the club despite losing out on so many trophies. Then, I supported Barcelona during Ronaldinho's and through Messi's reign. Don't blame me if I say I chanted support for Real Madrid and for PSG. What am trying to say in total is this; I love my sports team for a certain energy or charisma either put on by a certain special player or a special manager. I love the game so much so that I would rather discover a team and player with a winning mentality for a season and cheer for them till my friends do same. Am still a fan of Arsenal till date only because of the persons who have imparted greatly into the team from the onset and the fact that they may one day reclaim the shine that they have lost. I am always hopeful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jakelyson",
      "created_time": "July 29, 2022, 02:33:16 PM",
      "body": "I support the teams that keeps me excited every time I see them play. Having a star in that team is an advantage and I will support them more if they play like a real team and no individual drama. Quote from: D ltr on July 29, 2022, 02:15:46 PMone thing that makes sense because we as fans of someone who is idolized must automatically support his or her club as well. For example, I used to idolize David Beckham when he joined Manchester United and after he left Manchester United I automatically supported the football club he was defending, even though I hated the club before.Some are like that but there are also some who supports the team not just the stars. Those are the real fans of the club who will stay even when the club is in an overhaul.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Despairo",
      "created_time": "July 29, 2022, 02:37:13 PM",
      "body": "Because when you're supporting the team before, it will biased your decision to bet the winner of a match. Most of the times I will bet my favorite team, but if I see my favorite team has almost no chance to win, I wouldn't bet since it's sound like stupid when you're not confident enough. But I'm not really fanatic about my favorite team, because I'm more fan about the player itself, so if he move to other club, sometime I will change my favorite team lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Balmain",
      "created_time": "July 29, 2022, 02:44:58 PM",
      "body": "Quote from: Despairo on July 29, 2022, 02:37:13 PMBecause when you're supporting the team before, it will biased your decision to bet the winner of a match. Most of the times I will bet my favorite team, but if I see my favorite team has almost no chance to win, I wouldn't bet since it's sound like stupid when you're not confident enough. But I'm not really fanatic about my favorite team, because I'm more fan about the player itself, so if he move to other club, sometime I will change my favorite team lol.I can't approach clubs that much emotionally, there are also players in the clubs I love. But there is not a team that I support until the end, there are a few teams that I sympathize with. they change every year according to their squads in the Premier league and the Spanish league. In my bets, I try to think purely statistically, I don't bet on any team like, if I approach this emotionally because I know I will lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GiftedMAN",
      "created_time": "July 29, 2022, 02:46:21 PM",
      "body": "Quote from: Queentoshi on July 29, 2022, 12:26:51 PM I have asked around and I have been informed that a new football season will soon begin plus it is a great time to pick a team to support, so I'm here to ask, what criterias did you consider before choosing to support a team?Sure, the new season will begin by August and all the leagues are expected to be active and the clubs ready to entertain their fans with an astonishing performance. For the question that the OP asked, I started supporting Manchester United because of their former coach Sir Alex Ferguson. The coach made me love football because of his coaching tactics and the way he structured the Manchester United team and the players in terms of their winning mentality and their ability not to give up even when the game is against them. I developed the love for the team and since then I have never stopped supporting and being a fan of Manchester United even though Sir Alex Ferguson is no longer the coach of Man United.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "molsewid",
      "created_time": "July 29, 2022, 02:56:01 PM",
      "body": "In my case the reason why I supporting them because of their dedication , skills and mental fortitude. I have this one team in Esports which is the first team I ever supported in this kind of game , they have the skills like everyone else in the field but they have this mental fortitude that makes them top among all the other teams, I never bet to any team since I saw knew them and I always follow every game they are competing internationally and locally, they never make me disappointed every they lose sometimes as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "July 29, 2022, 02:56:15 PM",
      "body": "Track record from the team. This is become my main consideration when piking the team. I meant if the team has a good track record and the chance to winning the competition will be more. There was also another thing just like the fundamental of the team, players in the club and many more. There are lots of variables. Mostly of people are seeing club with a very good history as their choice caused by they have very good track record. You must say how so many people are choosing manchester city as a team that will be winning the next EPL. It's caused by this club was winning EPL in a row.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tumanggor",
      "created_time": "July 29, 2022, 03:00:03 PM",
      "body": "Quote from: Queentoshi on July 29, 2022, 12:26:51 PMHello everyone, I recently have started to develop an interest in sports. I saw a few games from the ongoing Euro women cup and liked the feeling of excitement watching the games gave me. I have asked around and I have been informed that a new football season will soon begin plus it is a great time to pick a team to support, so I'm here to ask, what criterias did you consider before choosing to support a team?Of all the football clubs that exist, the one I like the most is Liverpool, so in all the matches Liverpool have played I am very sure they will always win despite the fact that they sometimes lose tooI can't express my feelings in detail (why I have so much faith in Liverpool and bet on them when they play) but this is a matter of loyalty as well as believe",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "July 29, 2022, 03:04:44 PM",
      "body": "It's mostly the players themselves. I'm more of an E-Sports type of guy, so let's take Apex. Big fan of TNC but during the last ALGS (Biggest official apex tourney afaik), FNC Yukaf did some insane sick movement techs which I love very much, so I started looking them up and cheering them on (they also performed rather well in the last tourney anyway). So yea, for me it's mostly the players and the teams whether I can relate to what they're doing or am super amazed at what they do sometimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}