{
  "id": "topic_5444478",
  "title": "chainpmtcom",
  "author": "chainpmtcom",
  "created_time": "March 11, 2023, 12:42:24 PM",
  "content": "FARGO, N.D. - March 11, 2023ChainPMT.Com has announced that they are out of development, have completed testing, and the site is now available to the public.The company was born with one purpose in mind: to provide a simple, secure, and cost effective method for website operators to pay users small amounts of cryptocurrency without major technical hurdles or exorbitant fees. ChainPMT.Com is not a wallet, but rather a payment aggregation tool for webmasters and site operators.Users who receive payments never have to log in, create an account, or worry about withdrawing, since interaction is based entirely on the user's existing crypto address. Payments received for the address are aggregated to reduce fees and then sent when the threshold for a given coin is reached.For site operators, the ease of payment, ability to accept payments, and low fees make it a cost effective solution any website to send and accept cryptocurrency.In addition, the company has released two free scripts - ChainFaucet and ChainPanel - to assist new and existing site operators with starting or converting their sites.ChainFaucet is a free, full-featured faucet script including a fully configurable faucet, shortlink system, multiple ad formats, 2FA claiming, referrals and contests, and more. It installs in under five minutes, and is ideal for rapid deployment.ChainPanel allows site operators to create a network of ChainFaucet sites and operate them from a single convenient dashboard.  All features and functions ChainFaucet can be edited through ChainPanel once set up is complete.The scripts are driven by the ChainPMT API, which is the backbone of the company's services.  This simple API allows all crypto payment functions to be handled programmatically from your site or service.Currently, the company utilizes Bitcoin (BTC), BitcoinCash (BCH), LiteCoin (LTC), and DogeCoin (DOGE). Additional coins will be added in the future as need demands.For more information, to download ChainFaucet or ChainPanel, or to integrate ChainPMT into your site or application, visit their website:Main Site: https://chainpmt.comDownloads: https://chainpmt.com/download-scriptsUser Address Check: https://chainpmt.com/checkAPI Documentation: https://chainpmt.com/api-docs.pdfFee Structure: https://chainpmt.com/fees",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444478",
  "comments": [
    {
      "author": "theblockdev",
      "created_time": "March 30, 2023, 04:02:44 PM",
      "body": "ChainPMT.com has launched a new network fee system for cryptocurrency transactions. The system offers recommended minimum, medium, high, and custom network fees, giving users more control over the fees they pay. This provides greater transparency and ensures users pay a fair price for their transactions.https://chainpmt.com/news/chainpmtcom-introduces-new-network-fee-system-allowing-users-to-control-their-transaction-fees",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "March 30, 2023, 07:47:42 PM",
      "body": "Do you have a demo somewhere where we can try these scripts, or do we have to do our own installation for test purposes?Also, Is there a plan to make a version for WordPress or even a WP plugin? there are really many WP sites and a good faucet plugin could significantly help increase the number of visitors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chainpmtcom",
      "created_time": "April 01, 2023, 10:51:27 AM",
      "body": "Quote from: examplens on March 30, 2023, 07:47:42 PMDo you have a demo somewhere where we can try these scripts, or do we have to do our own installation for test purposes?Also, Is there a plan to make a version for WordPress or even a WP plugin? there are really many WP sites and a good faucet plugin could significantly help increase the number of visitors.Thank you for your questions.   The demo is in the works and should be available Monday with full admin access, but you can check out a live site with the script at https://slotfaucet.xyz  until then.  We are working to release a set of additional tools later this month, including:Wordpress ChainFaucet plugin - a ready to run WP faucetWordpress ChainMerchant plugin - Easily accept crypto payments on your WP siteMagento ChainPMT class - send/receive payments in MagentoPrestashop ChainPMT class - send/receive payments in PrestashopStandalone ChainPMT PHP class - Universal PHP class for all features available.Please let us know if we can be of any additional assistance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}