{
  "id": "topic_5453293",
  "title": "l3pox",
  "author": "l3pox",
  "created_time": "May 19, 2023, 01:01:14 PM",
  "content": "Vi que esse tem sido um assunto quente no forum ultimamente, entre gritos de ódio e de amor (ou seria apenas lucro?)querem proibir, querem liberar e a polêmica chegou até o board em portuguêspensando sobre isso esses dias me deparo com o emblemático caso da Shiba INUmeme coin cópia da doge, mas como token na ethereumque foi doada aos montes pro Vitalik Buterin, ilustre criador da segunda maior criptomoeda do mundo.O que era uma brincadeira acabou valorizando um monte e Vitalik chegou a ter mais de 1 bilhão de dólares em Shiba e num belo dia fez uma doação de mais de 1 bilhão para combate da pandemia na Índia.Acho o tema da filantropia super interessante e com várias camadas para discutir, falamos pouco sobre ele aqui.Obviamente ocorreram alguns problemas pq não dava para dumpar todo esse valor para usd sem acabar com o mercadoe análises on chain mostram que \"apenas\" alguns milhões de dólares foram utilizados até agoramas isso não muda o fato de que uma memecoin já fez mais pelo mundo em termos de filantropia do que a maioria dos users da aba em Português no bitcointalk.Um pouco mais de respeito pelos cachorrinhos, sapos e animais fantásticos do mundo mágico da internet.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453293",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "May 19, 2023, 06:51:54 PM",
      "body": "Quote from: Lucasgabd on May 19, 2023, 01:01:14 PMmas isso não muda o fato de que uma memecoin já fez mais pelo mundo em termos de filantropia do que a maioria dos users da aba em Português no bitcointalk.Um pouco mais de respeito pelos cachorrinhos, sapos e animais fantásticos do mundo mágico da internet.Sabe que quando existem movimentos para ajudar em algum resgate, existe sempre muita gente pronta para doar dinheiro.Nesses caso, a memecoin apenas foi a ferramenta usada para fazer isso. As pessoas compravam porque alegadamente era para apoiar uma causa.Qualquer das formas, achei bem interessante analise, meio que positiva, sobre estas coins bem desvalorizadas por toda a comunidade cripto.Bem, nessa base, as memecoins podem ser comparadas aquelas ONGs que tem como objetivo ajudar a combater a fome em Africa, e na realidade 90% do dinheiro recebido é para pagar o nível de vida dos fundadores dessas ONGs.   (Neste campo o Paredao é especialista.)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "May 19, 2023, 08:15:36 PM",
      "body": "Mas continua sendo uma Pirâmide. Veja que a doação do Vitalik não pode nem ser transformada em moeda fiduciária por falta de liquidez. Não existe almoço grátis. Para alguém ganhar, outros tem que perder. Essa memecoins não geram riqueza alguma. Continuo com a mesma opinião. Sabe o faraó do Bitcoin ? Ele também doou milhões para a Igreja Universal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}