{
  "id": "topic_5412137",
  "title": "krandall",
  "author": "krandall",
  "created_time": "September 02, 2022, 01:28:28 PM",
  "content": "Buondi a tutti,ho bisogno di 2 consigli in merito a cosa minare considerando che il consumo energetico è completamente assente (impianto fotovoltaico aziendale con mega accumulo etc) ed ho 3 mesi per scegliere uno dei 3 scenari:- Primo scenario: budget 20k da investire in hardware (asic, schede video, etc)- Secondo scenario: budget di 10k con anche 6 XFX SPEEDSTER SWFT319 AMD Radeon™ RX 6800 CORE 16GB GDDR6 (già a terra).- Terzo scenario: acquisto diretto di crypto per 15kMi rendo conto del clima di incertezza che impervia nel settore anche con l'approssimarsi del merge di eth ma sforzatevi   a mettervi nei miei panni e provate ad indicarmi cosa fareste voi al posto mio, se acquistereste degli Asic invece di schede video xxxx invece di yyyy...Posso anche accettare un Roi di 2 anni senza problemi, l'importante è investire e farlo nei 3mesi.Grazie a tutti,Fabio",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412137",
  "comments": [
    {
      "author": "alexrossi",
      "created_time": "September 02, 2022, 07:10:27 PM",
      "body": "Quarto scenario: 75% in acquisto diretto e 25% in mining giusto per togliersi uno sfizio... anche 15% se post merge di eth c'è poco da minare",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krandall",
      "created_time": "September 03, 2022, 02:20:35 PM",
      "body": "Quote from: alexrossi on September 02, 2022, 07:10:27 PMQuarto scenario: 75% in acquisto diretto e 25% in mining giusto per togliersi uno sfizio... anche 15% se post merge di eth c'è poco da minareQuindi considerando una scelta all'interno dei 3 scenari, mi stai consigliando di seguire il terzo ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexrossi",
      "created_time": "September 05, 2022, 08:49:04 AM",
      "body": "Quote from: krandall on September 03, 2022, 02:20:35 PMQuote from: alexrossi on September 02, 2022, 07:10:27 PMQuarto scenario: 75% in acquisto diretto e 25% in mining giusto per togliersi uno sfizio... anche 15% se post merge di eth c'è poco da minareQuindi considerando una scelta all'interno dei 3 scenari, mi stai consigliando di seguire il terzo ?No perché vedo che hai volontà di minare e energia a basso costo, quindi qualcosina metterei in mining. Ma proprio qualcosina.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hymperion",
      "created_time": "September 06, 2022, 07:46:45 AM",
      "body": "se hai la certezza di andare sempre in compensazione con i KW puoi pensare di acquistare anche degli ASIC, il mining non è solo ETH, puoi minare altre monete e poi convertirle in quella che vuoi accumulare. Io mino LTC e DOGE ma ovviamente non voglio accumulare quelli, li converto in BTC o qualche altra moneta su cui mi voglio affidare, ho comprato quel tipo di asic perche avevano un ROI inferiore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}