{
  "id": "topic_5453821",
  "title": "22bits",
  "author": "22bits",
  "created_time": "May 24, 2023, 01:02:25 AM",
  "content": "I am just trying to understand the general setup for Armory.  To use an offline air gapped wallet you need two different machines, a view only and the air gapped computer that will hold the private key, correct?  On the view only machine you must download the entire bitcoin blockchain, around 450gb, correct?  Can both be done on ubuntu?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453821",
  "comments": [
    {
      "author": "goatpig",
      "created_time": "May 24, 2023, 07:49:53 AM",
      "body": "You are correct on all accounts. Armory runs on Windows but the target OS is Ubuntu originally.The online machine needs a local copy of the blockchain + disk space for its own DB (~2GB), and provisional room for chain growth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "May 24, 2023, 10:29:43 PMLast edit: May 24, 2023, 11:47:01 PM by BitMaxz",
      "body": "Quote from: goatpig on May 24, 2023, 07:49:53 AM~snip~.I just want to ask if there is a way to support the PSBT file of Electrum to Armory because downloading the entire blockchain takes days for a slow pc and the internet, unlike Electrum that doesn't need to download the blockchain.Is the Armory support PSBT file I search for almost 2 hours but I couldn't find the right answer if Armory supports PSBT file. I am planning to use offline Armory for long-term storage. Or I think hex or raw transactions generated from Electrum do armory support it?I don't see a hardware wallet as the best solution to protect your wallet those devices can be still hacked compared to a wallet that you created offline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goatpig",
      "created_time": "May 25, 2023, 07:20:47 AM",
      "body": "Quote from: BitMaxz on May 24, 2023, 10:29:43 PMIs the Armory support PSBT0.97 (WIP next version) has PSBT:https://github.com/goatpig/BitcoinArmory/blob/dev/cppForSwig/Signer/Signer.cpp#L4209",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}