{
  "id": "topic_5422524",
  "title": "muliyadi227",
  "author": "muliyadi227",
  "created_time": "November 21, 2022, 10:24:33 PM",
  "content": "Komunitas pasar crypto dihebohkan dengan kehadiran LegoCoin yang kerap menjadi bahan perbincangan. Mengambil nama dari sebuah perusahaan mainan ternama, koin kripto ini ternyata tidak memiliki afiliasi dengan Lego. Itu hanya sebuah penghargaan dari komunitas untuk mengembangkan ekosistem bagi para penggemar Lego.Banyak yang mempertanyakan apakah token crypto ini hanya koin sampah atau layak untuk diinvestasikan. Artikel ini tentang $LEGO.Di Thread/Topik Kali Ini1. Kenali LegoCoin2. Utilitas3. Tokenomik4. Peta Perjalanan5. Apakah LegoCoin Berafiliasi dengan Perusahaan Mainan LEGO?6. Siapakah Pengembang LegoCoin?7. Bagaimana Cara Mendapatkan $LEGO?8. Apakah Berinvestasi di LegoCoin Menguntungkan?9. Pertanyaan yang sering diajukan10. Referensi1. Kenali LegoCoinLEGOCOIN ($LEGO) adalah token meme atau micin dengan tujuan untuk berkontribusi pada penyebab sosial dan kreativitas di seluruh dunia melalui mainan favorit: LEGO.Token $LEGO ada di jaringan berbasis BEP20 dan semoga semua orang dapat menikmatinya. Pengembang proyek menyiapkan beberapa proyek dan fitur yang mencakup pengalaman digitalisasi yang menyenangkan, kreatif, imajinatif, dan berwawasan. Proyek ini menawarkan rasa memiliki yang tinggi bagi pemilik dengan tujuan membentuk komunitas yang solid dan suportif.2. UtilitasPemegang token $LEGO akan mendapatkan kesempatan untuk menikmati berbagai keuntungan dari komunitas ini. Ini termasuk menjadi bagian dari ekosistem yang lebih besar. Dengan demikian, LegoCoin bisa menjadi media pertukaran untuk aktivitas sehari-hari.Selain itu, pemegang token bisa mendapatkan biaya penarikan rendah hingga 0%, penggunaan token dengan berbagai aset valas dan komoditas, serta daftar putih untuk produk dan acara eksklusif.Dari sisi promo, pemegang $LEGO akan mendapatkan jumlah airdrop token yang lebih tinggi dan hadiah tambahan untuk dipertaruhkan, diperoleh, dan disimpan.3. TokenomikPemegang Token akan mendapatkan kesempatan untuk mengembangkan komunitas LegoCoin dari awal. Pengembang mengklaim ini akan menjadi taman bermain anggota komunitas. Nantinya, dalam ekosistem ini, mereka bisa bereksplorasi, berkreasi, dan menginspirasi pengembangan proyek ini.Pasokan maksimum token adalah 100.000.000 yang berjalan di jaringan BEP20. Nantinya, dari seluruh persediaan token, sebanyak 90% alokasi untuk promo hadiah, 5% untuk hadiah trading, 1% untuk hadiah staking, 1% untuk play to earn hadiah, 1% untuk pemasaran, 1% untuk pengembangan proyek, dan 1% sisanya untuk para pendiri.Mulai 8 November 2022, $LEGO berharga $0,060267, sehingga total kapitalisasi pasarnya menjadi lebih dari $6 juta. Menurut Coingecko, LegoCoin V2 berada di peringkat 1087th global crypto coin.Saat ini jumlah koin Lego yang beredar juga sudah mencapai 100 juta. Alias, sudah mencapai jumlah maksimal yang beredar di pasaran. Namun, dengan rencana untuk membakar atau menghilangkan sebagian dari peredaran, ada kemungkinan bisa mendongkrak nilainya.Jika kita analisa dari tokenomik LegoCoin, suplai maksimum koin kripto ini adalah 100 juta. Namun, sebagian besar atau 90% dari alokasi token adalah untuk promo hadiah atau airdrop. Memang ada ketentuan vesting atau periode lock, namun tentunya trader bisa dengan mudah menjual ketika periode vesting sudah berakhir.4. Peta PerjalananDari segi roadmap atau peta perjalanan, secara umum Lego V1 akan mengarah ke Lego V2. LegoCoin telah menyelesaikan pendaftaran token di sejumlah bursa crypto, yaitu Coinstore, Hotbit, Bitrue, Digifinex, Probit. Selain itu, mereka juga telah menyelesaikan audit dari CertiK.Adapun yang sedang berjalan saat ini adalah kampanye pemasaran, migrasi token V2, rencana pembakaran token, dan redenominasi. Sedangkan kedepannya akan ada staking pool, farming pool, INO (Initial NFT Offering), PTE (Play to Earn) dan kerjasama lainnya.5. Apakah LegoCoin Berafiliasi dengan Perusahaan Mainan LEGO?Tidak. LegoCoin adalah token berbasis komunitas, dan pengembang menyatakan bahwa ini tidak terkait dengan perusahaan LEGO mana pun. Menurut pengembangnya, LegoCoin merupakan bentuk apresiasi terhadap ekosistem dan komunitas Lego.6. Siapakah Pengembang LegoCoin?Jika dilihat dari websitenya, tidak ada nama atau sosok yang jelas terkait pengembang koin Lego tersebut. Hanya ada LEGO CEO, LEGO CMO, LEGO CBO, dan LEGO CTO anonim dengan figur figur mainan Lego. Uraian masing-masing posisi juga tidak spesifik.7. Bagaimana Cara Mendapatkan $LEGO?Token $LEGO saat ini tersedia di Coinstore, LBank, Digifinex, dan Probit. Pengembang proyek terus mencari mitra baru untuk bergabung dengan LegoCoin dalam menawarkan cara baru untuk mendapatkan $LEGO.Langkah terbaru LegoCoin untuk menjangkau investornya dengan lebih baik yang percaya pada visinya yang menarik adalah mendaftarkan token asalnya, $LEGO, di bursa cryptocurrency Coinstore.Token $LEGO sekarang tersedia di bursa Coinstore mulai 27 April 2022. Saat ini, pengguna Coinstore dapat melakukan penyetoran, penarikan, dan memperdagangkan token ini di platform. Jika Anda tertarik untuk mendukung proyek yang mendukung tujuan sosial dan kreatif, mungkin token $LEGO adalah aset kripto yang tepat.8. Apakah Berinvestasi di LegoCoin Menguntungkan?Karena sebagian besar cryptocurrency memiliki penggunaan yang sangat terbatas di dunia nyata, nilai cryptocurrency murni berdasarkan spekulasi belaka. Membeli dan menjual barang atau jasa dengan cryptocurrency belum banyak terjadi. Oleh karena itu, orang menggunakan istilah shitcoin hanya karena crypto coin tidak berguna untuk transaksi di dunia nyata.Cara mengidentifikasi shit coin sebenarnya mudah karena mengikuti pola yang sama. Pada saat koin dirilis mungkin sudah ada investor yang tertarik, namun harganya relatif tetap, tidak naik. Atau bisa saja harganya naik karena banyak investor yang tertarik. Namun, kemudian harganya turun drastis karena investor menjual koin mereka untuk mengambil keuntungan jangka pendek saja.Hal yang sama berlaku untuk LegoCoin. Pada awal September, pergerakan harga koin ini datar dengan kapitalisasi pasar yang sangat kecil. Kemudian, fluktuasi besar datang pada akhir September yang menyebabkan lonjakan harga.Harga LegoCoin di CoinMarketcap melonjak jutaan kali lipat hanya dalam hitungan jam. Jadi jika seorang trader memiliki US$1 di $LEGO, nilainya bisa mencapai $1,4 juta dalam 6 jam pada tanggal 27 September 2022.Padahal, di sisi lain, proyek crypto LegoCoin masih belum berkembang. Jadi, membeli $LEGO saat ini untuk tujuan investasi tampaknya merupakan spekulasi yang tinggi, karena belum jelas sejauh mana proyek Lego V2 berjalan. Bagi investor yang ingin membeli $LEGO, sebaiknya gunakan cold money dan jangan berharap terlalu banyak untuk mendapat untung. Ini karena nilai $LEGO tidak memiliki fundamental yang kuat.Ke depan sepertinya pengembangan altcoin seperti LegoCoin yang nantinya akan menjadi shitcoin sepertinya akan terus berlanjut. Hal ini terlihat dari minat pelaku pasar terhadap shit coin hanya untuk diperdagangkan. Beberapa pemerintah telah kehilangan minat dalam operasi penambangan cryptocurrency. Contohnya adalah Korea Selatan dan Cina. Sementara Jepang justru mendorong penggunaan mata uang kripto untuk pasar yang lebih luas.9. Pertanyaan yang sering diajukan     - Apakah LegoCoin memiliki afiliasi dengan perusahaan mainan LEGO?       Jawaban : Tidak. LegoCoin adalah token berbasis komunitas, dan pengembang menyatakan bahwa ini tidak terkait dengan perusahaan LEGO mana pun. Menurut pengembangnya, LegoCoin merupakan bentuk apresiasi terhadap ekosistem dan komunitas Lego.     - Bagaimana cara mendapatkan $LEGO?           Jawab : Token $LEGO saat ini tersedia di Coinstore, LBank, Digifinex, dan Probit. Pengembang proyek terus mencari mitra baru untuk bergabung dengan LegoCoin dalam menawarkan cara baru untuk menghasilkan $LEGO.10. Referensihttps://coinmarketcap.com/currencies/lego-coin/https://www.legocoinlive.com/https://bscscan.com/token/0x520EbCcc63E4d0804b35Cda25978BEb7159bF0CCCatatan bantuan : Saya membutuhkan bantuan Anda dan teman-teman semua agar saya dapat menyertakan gambar di setiap utas atau postingan saya, jadi saya sangat membutuhkan dari agan semua. Terima kasih atas perhatian dan bantuannya, dan bantuan dari kalian tidak akan saya lupakan.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5422524",
  "comments": [
    {
      "author": "len01",
      "created_time": "November 24, 2022, 07:42:36 PM",
      "body": "Saya menanggapi dari judul \"Kelihatan seperti menjanjikan\"Sepertinya volume selama 24jm masih rendah ya gan sekitar $4668 dan kalau dilihat masih sama aja kayak memecoin baru yang lain terlihat belum jelas kedepannya. Karena banyak sekarang manipulasi pada proyek baru terutama memecoin dan manipulasi tersebut ada pada harga di dalam market.QuoteSaya membutuhkan bantuan Anda dan teman-teman semua agar saya dapat menyertakan gambar di setiap utas atau postingan saya, jadi saya sangat membutuhkan dari agan semua. Terima kasih atas perhatian dan bantuannya, dan bantuan dari kalian tidak akan saya lupakan.Kalau cuma sebatas ingin menyertakan gambar pada utas lebih baik sertakan link gambarnya aja gan nanti bakal ada senior yang bantu quote untuk memperlihatkan gambarnya kok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "November 25, 2022, 12:21:32 PM",
      "body": "Quote from: muliyadi227 on November 21, 2022, 10:24:33 PMCatatan bantuan : Saya membutuhkan bantuan Anda dan teman-teman semua agar saya dapat menyertakan gambar di setiap utas atau postingan saya, jadi saya sangat membutuhkan dari agan semua. Terima kasih atas perhatian dan bantuannya, dan bantuan dari kalian tidak akan saya lupakan.Anda bisa melakukannya sendiri dengan menjadi Copper Member dengan mengikuti link ini .Kemudian, mengenai menjanjikan yang Anda perkirakan, apakah ada penjelasan lebih detail dengan hal tersebut? Karena yang Anda sampaikan pada thread sebatas pengenalan mengenai proyek dan tidak dapat mencerminkan masa depan yang menjanjikan.Bukan untuk mengirimkan FUD. Tapi sebagai saran, jika Anda memprediksikan token ini menjanjikan, harus bisa lebih rinci penjelasannya mengapa bisa demikian. Jadi, akan mendorong ketertarikan member (mungkin).Tetapi, menurut saya, token ini sedang dalam kondisi yang memprihatinkan. Pasalnya volume trading sedikit. Hanya $3-4K. Ini sudah berada di ujung tanduk. Holdernya cukup banyak, lebih dari 20K holders, tapi tidak memiliki volume, apakah mereka awalnya mendapatkan token ini dari airdrop atau bagaimana?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elda34b",
      "created_time": "November 25, 2022, 06:33:26 PM",
      "body": "Rata\" marketing manager atau sales di forum ini juga beli Copper member, mending ikuti saran di atas kalau agan cuma membuat postingan untuk beriklan tentang proyek tertentu. Kalau masih ga mau bayar juga (murah banget sebenarnya), ya usaha biar setidaknya dapet 1 merit dan naikin aktivitas.Btw ngeshill dengan cara seperti ini ga baik untuk nama proyek agan sendiri. Daripada bahas prospek harga mending agan membahas keunggulan proyek itu sendiri dibanding kompetitor yang sudah ada. Dengan menyebut token ini sebagai token micin ane rasa bukan jalan yang tepat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 26, 2022, 01:06:12 AM",
      "body": "Quote from: muliyadi227 on November 21, 2022, 10:24:33 PM8. Apakah Berinvestasi di LegoCoin Menguntungkan?Ane teringat beberapa tahun lalu ketika heboh meme coin yang cukup fenomenal di forum ini, namanya Elon coin. Kita dulu gak perlu susah payah beli ke sana kemari, cukup ikuti task tuk dapetin airdrop, dulu harganya lumayan pas lagi pom pom hasil airdrop bisa dibeliin permen, namun lama-lama tuh coin meme hilang dari peredaran (keterkenalan) dan tidak ada lagi riuh-riuh lagi, Jadi kalau berkaca pada pengalaman ane main di meme coin, boleh-boleh aja hype, tapi harus cepat take profit, kalau lambat dikit jadi zonk dan dana ente jadi abu.Quote from: muliyadi227 on November 21, 2022, 10:24:33 PMCatatan bantuan : Saya membutuhkan bantuan Anda dan teman-teman semua agar saya dapat menyertakan gambar di setiap utas atau postingan saya, jadi saya sangat membutuhkan dari agan semua. Terima kasih atas perhatian dan bantuannya, dan bantuan dari kalian tidak akan saya lupakan.Bantuan apa nih?, merit?, banyak tempatnya, tapi kalau mau ngemis jangan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blowon",
      "created_time": "November 26, 2022, 06:31:17 PM",
      "body": "Dari judul postingan agan menyarankan kami untuk membeli LegoCoin , ada banyak memecoin tetapi banyak juga yang tiba-tiba menjadi abu, memecoin seperti nya tidak hype lagi, lagi pula jika ber-invetasi di memecoin resiko sangat besar , memecoin hanya digunakan untuk perdagangan yang singkat resiko besar jika menyimpan terlalu lama Jika itu menjanjikan mengapa website tidak aktif ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luzin",
      "created_time": "November 27, 2022, 02:29:15 AM",
      "body": "Quote from: blue Snow on November 26, 2022, 01:06:12 AMnamun lama-lama tuh coin meme hilang dari peredaran (keterkenalan) dan tidak ada lagi riuh-riuh lagi, Jadi kalau berkaca pada pengalaman ane main di meme coin, boleh-boleh aja hype, tapi harus cepat take profit, kalau lambat dikit jadi zonk dan dana ente jadi abu.Sepertinya produk indonesiakah om? Beberapa token lokal yang udah hype belum lama udah hilang. Apalagi cap koin MEME dan buatan indonesia mungkin terlihat tidak meyakinkan untuk bertahan. Jika lihat di CMC volumnya juga kecil, selain itu setelah mencapai harga tertinggi $0,18 sampai saat ini masih trean bearish. Jadi saya setuju manfaatkan hype profit keluar. Quote from: Blowon on November 26, 2022, 06:31:17 PMJika itu menjanjikan mengapa website tidak aktif ?Penasaran dan coba saya cek ternyata bener. Sebenarnya mau spill produk koin apa ini. Developernya dari mana. Utilitynya apa. Tapi ga bisa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "November 27, 2022, 07:16:22 PM",
      "body": "Quote from: Luzin on November 27, 2022, 02:29:15 AMQuote from: blue Snow on November 26, 2022, 01:06:12 AM...Sepertinya produk indonesiakah om? Beberapa token lokal yang udah hype belum lama udah hilang. Apalagi cap koin MEME dan buatan indonesia mungkin terlihat tidak meyakinkan untuk bertahan. Jika lihat di CMC volumnya juga kecil, selain itu setelah mencapai harga tertinggi $0,18 sampai saat ini masih trean bearish. Jadi saya setuju manfaatkan hype profit keluar. ini adalah tampilan gambar yang saya ambil di CMC dan terlihat bahwa saat ini volume transaksi lego coin sangat rendah, bahkan saya mengunjungi akun twitter mereka dan melihat disana ada beberapa exchange yang pernah di janjikan pengembang legocoin akan menjadi tempat terbaru legocoin untuk listing namun itu tidak terjadi atau malah sudah de-list. pemasaran pengembang token dari indo termasuk sangat buruk makanya banyak token yang menjadi abu atau tidak diminati lagi.Quote from: Luzin on November 27, 2022, 02:29:15 AMQuote from: Blowon on November 26, 2022, 06:31:17 PMJika itu menjanjikan mengapa website tidak aktif ?...Penasaran dan coba saya cek ternyata bener. Sebenarnya mau spill produk koin apa ini. Developernya dari mana. Utilitynya apa. Tapi ga bisa. ini juga yang jadi pertanyaan besar di benak saya sih, kenapa situs legocoinlive sampai di suspend gitu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "November 29, 2022, 01:29:54 PM",
      "body": "Quote from: Luzin on November 27, 2022, 02:29:15 AMQuote from: blue Snow on November 26, 2022, 01:06:12 AMnamun lama-lama tuh coin meme hilang dari peredaran (keterkenalan) dan tidak ada lagi riuh-riuh lagi, Jadi kalau berkaca pada pengalaman ane main di meme coin, boleh-boleh aja hype, tapi harus cepat take profit, kalau lambat dikit jadi zonk dan dana ente jadi abu.Sepertinya produk indonesiakah om? Beberapa token lokal yang udah hype belum lama udah hilang. Apalagi cap koin MEME dan buatan indonesia mungkin terlihat tidak meyakinkan untuk bertahan. Jika lihat di CMC volumnya juga kecil, selain itu setelah mencapai harga tertinggi $0,18 sampai saat ini masih trean bearish. Jadi saya setuju manfaatkan hype profit keluar. sebagian ada dari Indonesia, sebagian lagi dari meme coin yang ngikutin si guk guk, tapi ya itu kalau mau main coin begini harus siap mental, dan bisa cepat ngambil peluang, selip sedikit aja langsung jadi ampas. Apa lagi coin-coin yang hanya fork dan copas dari github, cuma modal miripin ke coin yang terkenal dan ditopang oleh cuitan pesohor negeri dah pasti pom pom.Quote from: Renampun on November 27, 2022, 07:16:22 PMini juga yang jadi pertanyaan besar di benak saya sih, kenapa situs legocoinlive sampai di suspend gitu.Mungkin sudah habis modal sehingga domainnya tidak diperpanjang, mereka cuma ngarepin investor tuh hanya perpanjang domain kayaknya.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abhiseshakana",
      "created_time": "November 30, 2022, 09:31:15 AM",
      "body": "Quote from: muliyadi227 on November 21, 2022, 10:24:33 PMKomunitas pasar crypto dihebohkan dengan kehadiran LegoCoin yang kerap menjadi bahan perbincangan. Mengambil nama dari sebuah perusahaan mainan ternama, koin kripto ini ternyata tidak memiliki afiliasi dengan Lego. Itu hanya sebuah penghargaan dari komunitas untuk mengembangkan ekosistem bagi para penggemar Lego.Sekedar saran saja Gan, biar tambah heboh coba upayakan untuk bisa listing di exchange gede (syukur-syukur bisa listing di exchange global yg memiliki kredibilitas bagus), serta rangkul investor/partner yang subur dan prioritaskan \"real use case\" buat token ini  .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "muliyadi227",
      "created_time": "December 22, 2022, 08:22:03 PM",
      "body": "Quote from: masulum on November 25, 2022, 12:21:32 PMQuote from: muliyadi227 on November 21, 2022, 10:24:33 PMCatatan bantuan : Saya membutuhkan bantuan Anda dan teman-teman semua agar saya dapat menyertakan gambar di setiap utas atau postingan saya, jadi saya sangat membutuhkan dari agan semua. Terima kasih atas perhatian dan bantuannya, dan bantuan dari kalian tidak akan saya lupakan.Anda bisa melakukannya sendiri dengan menjadi Copper Member dengan mengikuti link ini .mahal gan, tidak terjangaku oleh saya",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "December 28, 2022, 04:29:05 AM",
      "body": "Quote from: muliyadi227 on December 22, 2022, 08:22:03 PMmahal gan, tidak terjangaku oleh saya Untuk saat ini saya pikir tidak begitu mahal kok om, karena mengingat harga Bitcoin sendiri yang masih berada dibawah 300 juta rupiah dalam per unitnya. Apalagi kalau om hanya mengeluarkan 0.00169076 BTC untuk Copper Member dalam sekali bayar dan coba bayangkan berapa jadinya kalau harga harga Bitcoin masih berada di 950 juta rupiah seperti yang pernah terjadi pada tahun lalu, pasti biaya yang harus om keluarkan jauh lebih mahal dari sekarang walaupun masih dalam kisaran 0.00169076 BTC. Sekarang coba lihat berapa jumlah yang harus om keluarkan untuk Copper Member pada saat ini. Yang jelas tidak sampai 500 ribu om",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "December 28, 2022, 06:42:12 AM",
      "body": "Quote from: CageMabok on December 28, 2022, 04:29:05 AMUntuk saat ini saya pikir tidak begitu mahal kok om, karena mengingat harga Bitcoin sendiri yang masih berada dibawah 300 juta rupiah dalam per unitnya. Apalagi kalau om hanya mengeluarkan 0.00169076 BTC untuk Copper Member dalam sekali bayar dan coba bayangkan berapa jadinya kalau harga harga Bitcoin masih berada di 950 juta rupiah seperti yang pernah terjadi pada tahun lalu, pasti biaya yang harus om keluarkan jauh lebih mahal dari sekarang walaupun masih dalam kisaran 0.00169076 BTC. Sekarang coba lihat berapa jumlah yang harus om keluarkan untuk Copper Member pada saat ini. Yang jelas tidak sampai 500 ribu om Kondisi finansial seseorang kan beda-beda om, mungkin beliau @OP tidak memiliki dana yang cukup untuk membeli status Copper Member sehingga meminta pertolongan anggota SFI lainnya untuk memberikan dia merit agar bisa insert gambar, walau caranya agak ekstrim, tapi saya cukup salut dengan keberanian beliau . Namun, tanggapan dari om @CageMabok juga sangat bagus, karena memberikan perbandingan jika membeli Copper Member saat harga $BTC berada di puncaknya.Catatan: Jika diteruskan, pembahasan disini mungkin akan menjadi off-topic, jadi lebih baik jangan ada yang membalas pesan ini lagi atau membahas seputar status copper member.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "January 30, 2023, 07:51:36 AM",
      "body": "Coin ini kalau ggak salah saya check naik turun kayak dongkrak. ketika thread ini dirilis, harga token berkisar Rp.1300 - 1500, dan hari berikutnya naik hingga Rp.1700-an. Lalu menjelang akhir tahunn semakin menurun dan terus turun hingga ke titik paling rendah Rp.500 di tahun baru. Lalu seminggu setelahnya, tanggal 7 dan 10 januari naik lagi ke Rp. 1200-an lalu makin turun dan turun hingga saat ini di sekitar 500-an perak. Menurutt kaliann apa akan terus kayak dongkrak?, kalau iya, ini kesempatan bagus buat beli, sapa tahu minggu depan naik ke harga 1000 lagi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "c0ldbrewz",
      "created_time": "January 30, 2023, 02:27:29 PM",
      "body": "denger2 kabar burung, ini project-an nya wahyu kenzo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "January 31, 2023, 03:55:43 PM",
      "body": "Quote from: Sarah Azhari on January 30, 2023, 07:51:36 AM-snip-Menurutt kaliann apa akan terus kayak dongkrak?, kalau iya, ini kesempatan bagus buat beli, sapa tahu minggu depan naik ke harga 1000 lagi.Sepertinya harganya memang sering loncat-loncat mas. Saya cek gap harga antara buy & sellnya memiliki jarak yang cukup jauh.dari pancakeswap juga ada perubahan harga yang cepat pula,Ya, kalau saya sih ga begitu yakin untuk entry, cuma kalau mas mau ngambil risiko sih itu terserah mas saja jika mau entry. Jujur saja, bagi saya sulit untuk mengatakan bagus atau tidak untuk beli koin beginian",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "derihendra",
      "created_time": "April 22, 2024, 06:35:47 AM",
      "body": "Koin meme hanya sebatas hyp saja, kalau sudah tidak viral lagi akan di tinggal investor, jika koin meme memiliki kekuatan komunitas, itu akan bertahan lama, jika tidak, koin meme tersebut akan tenggelam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "derihendra",
      "created_time": "May 03, 2024, 08:32:55 AM",
      "body": "Meme koin adalah proyek yang hanya menghandalah hyp saja,menjanjikan atau tidak nya suatu koin terletak dari team yang mengelola memekoin tersebut, kalau team bagus memekoin nya juga bagus",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}