{
  "id": "topic_5430801",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "December 21, 2022, 10:39:18 AM",
  "content": "Хотелось бы уточнить у его сторонников, чем он вас так конкретно привлекает как человек? Как мужчина-альфа-самец? Или как бета-самка? Или как кто? Ведь это же конкретный врун и лузер. Он почти просрал уже все что можно. Остались считанные месяцы его правления. Даже сравнивать с Зеленским его никак нельзя. Путин ни разу не посетил ни Херсон, ни ДНР и ЛНР. А вот Зеленский не побоялся, через 3 дня после освобождения посетил и Херсон и прочие отбитые у России города и села. И он не боится ни коронавируса, ни случайного прилета ракеты. Вчера он посетил даже Бахмут. А Путин Бахмут посетил? А Шойгу? Обосрался? Или другая причина? Шойгу, например, просто пролетел над Крымом. А пропаганда выдала это как инспекцию переднего края обороны. Да, Пригожин посетил затем тоже Бахмут, после Зеленского. Но кто такой Пригожин? У него есть официальная должность или титул? Даже Путин еще недавно лично признал, что Пригожин –это просто «никто» - частный человек. Так кто из них двоих, Зеленский или Путипн может считаться реальным лидером? Человек, который открыто общается со своими солдатами, или человек, которые общается с ряжеными сотрудниками ФСО под видом солдат или обычных людей?       Просьба при написании ответов на данный пост сначала написать, чем именно вам симпатичен Путин. Если будут другие ответы, просьба модераторов удалять любые другие ответы, не соответствующие начальному критерию. Ну, то есть, принимаются ответы начинающиеся со слов типа \"Я люблю Путина потому-то и потому-то\".... Другие ответы не принимаются.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430801",
  "comments": [
    {
      "author": "kotmolodec",
      "created_time": "December 22, 2022, 07:36:32 AM",
      "body": "Сейчас надеюсь из всех его сторонников остались только те кому выгодно подлизыватьсяИ чистым сердцев надеюсь что и вправду его провлению остались считанные месяца и Россия обретет свободу",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IgorS713",
      "created_time": "December 22, 2022, 11:14:11 AM",
      "body": "Только тем, что его ждет суд международный. Если свои не казнят быстрее его. Как может быть симпотичен человек, которого все ненавидят, только если они знают, что его будут судить. И поэтому желают ему еще пожить, что бы увидеть это.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "VKcams.com",
      "created_time": "December 22, 2022, 11:39:49 AM",
      "body": "Quote from: bonfire66 on December 21, 2022, 10:39:18 AM         Путин ни разу не посетил ни Херсон, ни ДНР и ЛНР.Кое-кто посещает ДНР и ЛНР ежедневно ракетами. С 14-го года.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BAIROT",
      "created_time": "December 22, 2022, 01:05:12 PM",
      "body": "Ничем. Плохой человек. Тоже кажется что его охранник когда-то его завалит.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vasyaebanvrot",
      "created_time": "December 22, 2022, 01:40:15 PM",
      "body": "Ни кто Настоящего Путина на убьет. По тихому спрячется в Китае, и будет там доживать свой век.А плебсу максимум покажут труп двойника, и придумают еще одну историю, как про Гитлера.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amantmaitresse",
      "created_time": "December 23, 2022, 04:16:54 AM",
      "body": "Quote from: vasyaebanvrot on December 22, 2022, 01:40:15 PMНи кто Настоящего Путина на убьет. По тихому спрячется в Китае, и будет там доживать свой век.А плебсу максимум покажут труп двойника, и придумают еще одну историю, как про Гитлера.Да не так его и в Китае любят. А если уж подумать как можно хайпануть на том что выдали настоящего.... шансов у плешивого нет...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "December 23, 2022, 10:05:22 AM",
      "body": "Quote from: vasyaebanvrot on December 22, 2022, 01:40:15 PMНи кто Настоящего Путина на убьет. По тихому спрячется в Китае, и будет там доживать свой век.А плебсу максимум покажут труп двойника, и придумают еще одну историю, как про Гитлера.Скорее КНДР или Венесуэла. Этот вопрос уже несколько недель обсуждается в сети.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crypto_trader#43xzEXrP",
      "created_time": "March 25, 2023, 03:06:28 AM",
      "body": "До того, как хуйло порвалось, предало народ СССР, и тупо начало шмалять по ком попало,мне было ваще похуй на это хуйло. Чё-то там пиздит с телека, умеет красиво пиздеть, да и хуй с ним.Крым отжало хуйло, да, было обидно немного, но Крым - автономная республика, и они хотели мира, и там был мир.Но когда хуйло начало возить туда всякие вундервафли пидорашкинские, и тупо шмалять,стало очевидно, что мы имеем дело именно что ни на есть - с хуйлом, которое спиздело ЯО СССР, и предало народ СССР,и убивает, сука мразь, народ СССР - советским, сука, оружием, блядь.И только тогда, когда хуйло продолжило свой голимый и гнилой пиздёж, я понял, что не только клятва пидорах говна не стоит,но и вся та пропагандистская хуета, которую затирает бункерный дед, своим хомякам, через зомбоящики.Быть может, именно красивый пиздеж хуйла, делает его симпатичным для пидорашек, раз у него рейтинг такой пиздатый.Но нас это ебать не должно, и если уж пидорашки поддерживают это рашистское хуйло, то коллективную ответственность никто не отменял, если чо.Пущай пока сосут сосанкции, затем платят репарации, а потом и контрибуции тоже.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pavel.Savelev",
      "created_time": "April 04, 2023, 08:44:54 PM",
      "body": "вообще ничем, но сейчас такой период, что его приходится поддерживать.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}