{
  "id": "topic_5459921",
  "title": "cryptogeniusdice",
  "author": "cryptogeniusdice",
  "created_time": "July 15, 2023, 02:59:08 PM",
  "content": "@stunna , i hope this video finds you at your best.Despite of your claims that stake.com is provably fair casino nothing can be manioulated , i have recorded a video where the bet id went to and fro to look like giving me a loss based on recording the pattern and using against me .on last few minutes if the video you can see the bet id changing . to a different result and recalculating back to original one to give me next bets as loss.https://drive.google.com/file/d/1ceSFd9d91OM7k_RFH_-lsyam--qeHAuy/view?usp=drivesdk",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459921",
  "comments": [
    {
      "author": "Tim1996",
      "created_time": "July 15, 2023, 03:33:50 PM",
      "body": "Your video is not clear",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptogeniusdice",
      "created_time": "July 15, 2023, 04:16:05 PM",
      "body": "i have made a new one see this . https://youtu.be/h1xy7S5FI3w",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptogeniusdice",
      "created_time": "July 16, 2023, 11:29:38 AM",
      "body": "Can anyone let me know why my previous post regarding stake.com was locked.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mahdirakib",
      "created_time": "July 16, 2023, 02:44:51 PM",
      "body": "Quote from: cryptogeniusdice on July 16, 2023, 11:29:38 AM~snip~Because, you are creating multiple thread with the same concept and spamming in the forum. Stunna (Stake representative) has already replied two times in your first thread. I have watched your video, seems like there was some glitch on Stake when you recorded the video. Stake server occasionally remains overloaded for so many active users and bets.Stop creating multiple topics for the same reason and avoid making consecutive posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptogeniusdice",
      "created_time": "July 21, 2023, 07:51:31 PM",
      "body": "no goitch its a scam .....they shuffle results to cover up on mines. fischer yates shit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "July 22, 2023, 01:51:02 AMLast edit: July 22, 2023, 10:47:34 PM by wwzsocki",
      "body": "Quote from: cryptogeniusdice on July 21, 2023, 07:51:31 PMno goitch its a scam ...why are you keep playing there? for your own personal health change casino because you wont be able to proof anything with these videos, no hard evidence here, everybody will answer you the same \"some glitch\", \"server overload\", \"too many players\" of course this shouldn't be an excuse and I understand your concerns but whiteout solid proof black on white there is no chance to convince anybody",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "July 22, 2023, 02:12:47 AM",
      "body": "I'm not following your logic at all.It takes a minute for the bet to show up in your bet history....are you trying to say that's proof they are cheating?  You don't need to rely on the bet history to determine whether or not the outcome was manipulated.  In fact, you shouldn't - that would defeat the point.Also the video quality is too low for the text.  Increase font or better yet just type out your point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptogeniusdice",
      "created_time": "July 23, 2023, 08:06:17 PM",
      "body": "just download the video and watch it. stake is a scam site. hence it was banned from twitch. morover its partner sue them for 500 million, so they are looting their money to kick.com. it wont be much time now stake.com wouldnt be live soon due to litigations which would be falling soon . stake owners father was caught and prosecuted scamming people in 90s, there is nothing legtimate about the site. they are basically paying off to endorse people from your money for the winning any one cant win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "July 23, 2023, 09:30:05 PM",
      "body": "Sorry for being too slow but I watched the two videos and didn't figure out what the issue is!If you want to make a proper accusation that anyone can understand then you need you explain how stake's provably fair system works and how they are cheating?Quote from: cryptogeniusdice on July 23, 2023, 08:06:17 PMstake owners father was caught and prosecuted scamming people in 90sDon't know how true this is but it's completely irrelevant. In fact, this makes you less credible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "July 24, 2023, 03:13:59 AM",
      "body": "Quote from: cryptogeniusdice on July 23, 2023, 08:06:17 PMjust download the video and watch it. stake is a scam site. hence it was banned from twitch. morover its partner sue them for 500 million, so they are looting their money to kick.com. it wont be much time now stake.com wouldnt be live soon due to litigations which would be falling soon . stake owners father was caught and prosecuted scamming people in 90s, there is nothing legtimate about the site. they are basically paying off to endorse people from your money for the winning any one cant win.I watched it.  Video doesn't show proof of any cheating.The lawsuit isn't proof stake is cheating.What the owners father did 30 years ago isn't proof stake is cheating.There is nothing legitimate about any of your accusations. If you have any actual proof stake is cheating, you should share it.  No need for all the bullshit, it only makes you less credible - not Stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "July 24, 2023, 06:55:48 AM",
      "body": "they don't need to create a fake bet id, they have already shown clearly all data. it's not cheating a \"delay\" to update your betting history.@cryptogeniusdice you can just verify seeds and your bets one by one. have you ever done a verification of your bets? it would explain a lot... and help to understand \"why this bet is a loss?\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "July 24, 2023, 09:00:17 AM",
      "body": "Quote from: khaled0111 on July 23, 2023, 09:30:05 PM[...]If you want to make a proper accusation that anyone can understand then you need you explain how stake's provably fair system works and how they are cheating?Quote from: cryptogeniusdice on July 23, 2023, 08:06:17 PMstake owners father was caught and prosecuted scamming people in 90sDon't know how true this is but it's completely irrelevant. In fact, this makes you less credible. And OP, cryptogeniusdice, while you're at it, you could probably explain your previous accusation of them utilizing motion sensors to cheat as well, I am not sure why you leave your other thread about this very issue unanswered, lock the other thread when the discussion moved there, and created this new one. Sorry, but I can't help but to start thinking you made baseless --and probably retaliatory-- accusations and run when pressed further to give strong evidences to back up your claim.It will also be very helpful if you can just focused into one topic instead of creating multiple threads with same accusations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptogeniusdice",
      "created_time": "July 24, 2023, 03:54:58 PM",
      "body": "the motion sensors are used to detect the pattern of gameplay. if they dont need that motion sensor, why they have it. why did they shut out the APi. right now i am confident that you are on stakes payroll. why are you not going with the fact that twitch and other streaminig website banned stake.com as it a scam machine. hence they launched kick. now they have a lawsuit coming in so they are moving the miney to kick.com thus by looting people. i have seen people who have not withdrawn from 30-49 deposits. on,y because stake originals is cheating them .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptogeniusdice",
      "created_time": "July 24, 2023, 04:02:03 PM",
      "body": "OMG.....I HAVE GIVEN VIDEOGRAPHIC PROOF THAT STAKE IS CHEATING. wtf is slow mode, slow mode is just to fuck you up. so that they can give you losses at appropriate time.at my last thread i have mentoined about length extension attack , like this in recursive they scam you. And hence there is no in detail calculation given about how mines results are calculated.https://prnt.sc/TbvB6Th0mB7cthe only third party verifier for stake mines is provablyfair.me , which is a subsidary of stake.com Meebit. Mladden sucker. and if you think stake.com is genuine , then you can contiune playing , but for me its a scam company associated with money laundering activites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptogeniusdice",
      "created_time": "July 24, 2023, 04:03:09 PM",
      "body": "and people who are on oayroll for stake.com , something will surely come to bite you soon. Stay tuned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "July 24, 2023, 05:08:11 PM",
      "body": "Quote from: cryptogeniusdice on July 24, 2023, 03:54:58 PMthe motion sensors are used to detect the pattern of gameplay. if they dont need that motion sensor, why they have it. why did they shut out the APi. right now i am confident that you are on stakes payroll. why are you not going with the fact that twitch and other streaminig website banned stake.com as it a scam machine. hence they launched kick. now they have a lawsuit coming in so they are moving the miney to kick.com thus by looting people. i have seen people who have not withdrawn from 30-49 deposits. on,y because stake originals is cheating them . And I asked again, how? If I may requote my entire question about this matter from your now-locked thread,Quote from: https://bitcointalk.org/index.php?topic=5458456.msg62554665#msg62554665[...] Like... they use accelerometer [that detect movement, tilt, and the orientation of the device], gyrometer [that detect device's angle and rotation] and, probably at the most stretched one, proximity sensor [that detect device's surrounding against object, mostly to help them turn the screen on and off] to detect our gambling pattern? How? How does these sensors being used to read our pattern? Like it read our PC's screen position? Or how close our face to the screen that could indicate the seriousness and intensity of our concentration against a bet?[...]of which you replied that, Quote from: https://bitcointalk.org/index.php?topic=5458456.msg62554897#msg62554897[...]2. i have explained you above how they manipulate bets. in theory , however i will be happy  to show you calculation at the correct time[...]of which instead of explaining and showing us the, \"calculation at the correct time\", you locked the thread. That's certainly did not evoke confidence on other people's mind about the basis of your accusation. So, let me ask again with your added info, how do you propose they use motion sensor to detect pattern? Accelerometer? Proximity? What pattern do they read and how?Quote from: cryptogeniusdice on July 24, 2023, 04:03:09 PMand people who are on oayroll for stake.com , something will surely come to bite you soon. Stay tuned. And lastly, please refrain from assuming everybody that did not agree with you right on the spot and, instead, demands further explanation as people on Stake's payroll. I am telling you this for your behalf as it'll just make you looks childish and your accusation more questionable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptogeniusdice",
      "created_time": "July 25, 2023, 03:56:02 AM",
      "body": "lol.....if you give me access to stake servers i would let you know. but stakr army just foff......let me know your stats on stake with timestamp n username",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TwitchySeal",
      "created_time": "July 25, 2023, 12:46:06 PM",
      "body": "Quote from: cryptogeniusdice on July 24, 2023, 03:54:58 PMthe motion sensors are used to detect the pattern of gameplay. if they dont need that motion sensor, why they have it. why did they shut out the APi. Do you think this because your brave browser had a pop up that said something about motion sensors? lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "July 25, 2023, 04:23:04 PM",
      "body": "Quote from: cryptogeniusdice on July 25, 2023, 03:56:02 AMlol.....if you give me access to stake servers i would let you know. but stakr army just foff......let me know your stats on stake with timestamp n usernameOk, so I stared at that post for few good seconds. So... you don't have a ground for that accusation? Any shred of evidence? Anything? It's all just a theory in your head, and when you said you'll give the correct calculation, you actually don't have anything other than a guess, and that's why you locked the thread?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}