{
  "id": "topic_5492395",
  "title": "JamesNZ",
  "author": "JamesNZ",
  "created_time": "April 11, 2024, 07:11:43 AM",
  "content": "A short educational video explains the difference between 'trading an item' and 'using an item' to show that there's no such thing as a 'Bitcoin use case': https://youtu.be/uNzs9JAKjMY",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5492395",
  "comments": [
    {
      "author": "nutildah",
      "created_time": "April 11, 2024, 07:47:07 AM",
      "body": "OK, so you're telling me all the times I ever got paid in Bitcoin for services/products, that wasn't a use?All the times I ever used Bitcoin to purchase any sort of physical or digital item, that also wasn't a use?Seems like the person who wrote the script for this video has extremely limited hands-on experience with Bitcoin. I don't even have an account on a single exchange anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesNZ",
      "created_time": "April 11, 2024, 08:05:00 AM",
      "body": "Quote from: nutildah on April 11, 2024, 07:47:07 AMOK, so you're telling me all the times I ever got paid in Bitcoin for services/products, that wasn't a use?All the times I ever used Bitcoin to purchase any sort of physical or digital item, that also wasn't a use?Seems like the person who wrote the script for this video has extremely limited hands-on experience with Bitcoin. I don't even have an account on a single exchange anymore.Exactly. That what you call 'use' is actually 'trade'. You just transfered the coin to another buyer or you were the buyer to whome the coin was transferred. None of you were 'using' the coin but just trade it. Whoever buys the coin is forced to sell it - to dump it on someone else, exactly because the coin cannot be used for anything. It's completely useless. That's the whole point demonstrated by the video.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "April 11, 2024, 08:30:02 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 08:05:00 AMQuote from: nutildah on April 11, 2024, 07:47:07 AMOK, so you're telling me all the times I ever got paid in Bitcoin for services/products, that wasn't a use?All the times I ever used Bitcoin to purchase any sort of physical or digital item, that also wasn't a use?Seems like the person who wrote the script for this video has extremely limited hands-on experience with Bitcoin. I don't even have an account on a single exchange anymore.Exactly. That what you call 'use' is actually 'trade'. You just transfered the coin to another buyer or you were the buyer to whome the coin was transferred. None of you were 'using' the coin but just trade it. Whoever buys the coin is forced to sell it - to dump it on someone else, exactly because the coin cannot be used for anything. It's completely useless. That's the whole point demonstrated by the video.In the video you said that you can not return bitcoin to its issuer but that is because no entity owns the entire bitcoin network. We, the society, get to decide whether we would want to own it or not. Calling bitcoin useless is a bit reaching. I do get the logic behind your ‘trade use’ but bitcoin being used to purchase something else is still useful. It might not exactly have the same meaning you keep saying of a use case but it’s also not fair to just straight up call it useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alone055",
      "created_time": "April 11, 2024, 08:33:23 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 08:05:00 AMExactly. That what you call 'use' is actually 'trade'. You just transfered the coin to another buyer or you were the buyer to whome the coin was transferred. None of you were 'using' the coin but just trade it. Whoever buys the coin is forced to sell it - to dump it on someone else, exactly because the coin cannot be used for anything. It's completely useless. That's the whole point demonstrated by the video.You definitely need to get your facts checked because a lot of people around the globe are successfully using Bitcoin for a lot of things and not just buying or selling it. Some months ago, there was news that people in Argentina were using Bitcoins to buy properties. What do you call that then? Isn't that a use case? And if not, then even fiat currencies don't have any use case because if you are using fiat to buy a property, you are trading it for another item and not using it, hence no currency in the world has any use case or anything in general.Bitcoin can be used just as any other currency in the world as long as there are people willing to accept it for goods and services, and there are some who are accepting Bitcoin which means that it does have use cases and isn't just a coin that is traded in the markets. You probably need to do more research before you reach conclusions or start making assumptions on things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "April 11, 2024, 08:34:15 AM",
      "body": "I don't need to further watching the video because the While I've gone was already fictional forgery of inaccuracy and misrepresentations.If bitcoin is not a Coin in used aside trading and holding for assets then I'd recommend you on a clear conscience to checkout on El Salvador Adopted Bitcoin as an Official Currency.You can also check out on most top trading firms which accepts bitcoin for means of payments such as the Microsoft, Newegg, Jamashop, Pacsun and many others evening my locality there are individual running small business firms who accepts bitcoin.What do you think is the used of multiple bitcoin installed there in Walmart for it it's not for payments and exchange purposes.I find this video clip irritating not because it's against bitcoin but it's illiciting of false rumours towards a bitcoin technology with series of potentials. I should just let you know that the primarily purpose of bitcoin is alternative means of payments before considering the other potentials of holding for assets.Don't be fooled for the dollar in question is also traded for assets uses in the local countries as the USD is a universal currency so also the bitcoin is not segregated to be limited in used to other countries unless the individual countries choose to have it on hold but yet it never changes the global attributes of bitcoin being a global digital currency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "April 11, 2024, 08:36:02 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 08:05:00 AM...Bitcoin is a P2P Electronic Cash System[1], its major use case is to allow people transact easily without the need for a third party.A use case broadly refers to a situation where a product offers a solution to its users. If I anted to trade with you, I would without Bitcoin, I will need to know which country you are in, register on a payment platform supported by both countries, pay good fees and sometimes wait for a while for the payment to be transferred, with Bitcoin I do not need any of that, does not matter if you are my next door neighbor or if you are all the way around the world. And no third party can stop or regulate our transaction.We are both also assured that our transactions are immutable.There is no other way to use a digital currency.[1] https://bitcoin.org/bitcoin.pdf- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "April 11, 2024, 09:04:23 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 08:05:00 AMexactly because the coin cannot be used for anything. It's completely useless. That's the whole point demonstrated by the video.I trade my useless paper i.e. fiat for Bitcoin.I use Bitcoin to stay away from useless paper, increase my privacy and have full control over my coins.If you think it's not the use case of Bitcoin, you need to tell me which asset that can be owned as much as possible and no one can see that, no one can access the asset except someone who know the password, can be carry in anywhere, and the value keep increase overtime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesNZ",
      "created_time": "April 11, 2024, 09:15:08 AMLast edit: April 12, 2024, 09:38:30 PM by Mr. Big",
      "body": "Quote from: btc78 on April 11, 2024, 08:30:02 AMQuote from: JamesNZ on April 11, 2024, 08:05:00 AMQuote from: nutildah on April 11, 2024, 07:47:07 AMOK, so you're telling me all the times I ever got paid in Bitcoin for services/products, that wasn't a use?All the times I ever used Bitcoin to purchase any sort of physical or digital item, that also wasn't a use?Seems like the person who wrote the script for this video has extremely limited hands-on experience with Bitcoin. I don't even have an account on a single exchange anymore.Exactly. That what you call 'use' is actually 'trade'. You just transfered the coin to another buyer or you were the buyer to whome the coin was transferred. None of you were 'using' the coin but just trade it. Whoever buys the coin is forced to sell it - to dump it on someone else, exactly because the coin cannot be used for anything. It's completely useless. That's the whole point demonstrated by the video.In the video you said that you can not return bitcoin to its issuer but that is because no entity owns the entire bitcoin network. We, the society, get to decide whether we would want to own it or not. Calling bitcoin useless is a bit reaching. I do get the logic behind your ‘trade use’ but bitcoin being used to purchase something else is still useful. It might not exactly have the same meaning you keep saying of a use case but it’s also not fair to just straight up call it useless. But it is true. Bitcoin is useless. Saying \"using Bitcoin to purchase something\" means \"trading Bitcoin.\"  You can as well say \"I am using my car to purchase dollars\" when you want to express the fact that you're selling your car. But that's nonsens because it is obvious that cars are used for driving. So, you are not using Bitcoin when you press sell button on your mobile app. You're just transferring its ownership to another holder. Bitcoin cannot be used. Quote from: EluguHcman on April 11, 2024, 08:34:15 AMI don't need to further watching the video because the While I've gone was already fictional forgery of inaccuracy and misrepresentations.If bitcoin is not a Coin in used aside trading and holding for assets then I'd recommend you on a clear conscience to checkout on El Salvador Adopted Bitcoin as an Official Currency.You can also check out on most top trading firms which accepts bitcoin for means of payments such as the Microsoft, Newegg, Jamashop, Pacsun and many others evening my locality there are individual running small business firms who accepts bitcoin.What do you think is the used of multiple bitcoin installed there in Walmart for it it's not for payments and exchange purposes.I find this video clip irritating not because it's against bitcoin but it's illiciting of false rumours towards a bitcoin technology with series of potentials. I should just let you know that the primarily purpose of bitcoin is alternative means of payments before considering the other potentials of holding for assets.Don't be fooled for the dollar in question is also traded for assets uses in the local countries as the USD is a universal currency so also the bitcoin is not segregated to be limited in used to other countries unless the individual countries choose to have it on hold but yet it never changes the global attributes of bitcoin being a global digital currency. Paying, buying, selling, transferring, exchanging... All that means trading Bitcoin. It means that Bitcoin can be exchanged among market participants, that it has a 'trade case'. But no one who buys it can use it for something. That means that Bitcoin lacks a use case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "April 11, 2024, 09:35:00 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 08:05:00 AMExactly. That what you call 'use' is actually 'trade'. You just transfered the coin to another buyer or you were the buyer to whome the coin was transferred. None of you were 'using' the coin but just trade it. Whoever buys the coin is forced to sell it - to dump it on someone else, exactly because the coin cannot be used for anything. It's completely useless. That's the whole point demonstrated by the video.So by that definition, money is useless, right? So, do you want to Venmo me, or go via PayPal...?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JamesNZ",
      "created_time": "April 11, 2024, 09:48:16 AM",
      "body": "Quote from: HeRetiK on April 11, 2024, 09:35:00 AMQuote from: JamesNZ on April 11, 2024, 08:05:00 AMExactly. That what you call 'use' is actually 'trade'. You just transfered the coin to another buyer or you were the buyer to whome the coin was transferred. None of you were 'using' the coin but just trade it. Whoever buys the coin is forced to sell it - to dump it on someone else, exactly because the coin cannot be used for anything. It's completely useless. That's the whole point demonstrated by the video.So by that definition, money is useless, right? So, do you want to Venmo me, or go via PayPal...? No, because money such as the dollar, besides being traded on the market, can also be used for returning it to its issuers - banks for satisfying loan or bond debt that was created by putting the dollar on the market. Money such as gold, besides being traded can also be used as jewellery, an electroplated coating, dental restorative material, etc. So, no, money is not useless. Only Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "April 11, 2024, 09:52:04 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 07:11:43 AMA short educational video explains the difference between 'trading an item' and 'using an item' to show that there's no such thing as a 'Bitcoin use case': https://youtu.be/uNzs9JAKjMYLol bitcoin wouldn’t have its price today if it did not have any real world use case, do you think investors are just passing off bitcoin to one another for no reason at all? The reason why people are so eager to buy bitcoin no matter how expensive it might get is because there is functionality if you own a coin. People are purchasing different kinds of goods that are only being sold in exchange of bitcoin so I wouldn’t call that exactly useless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "April 11, 2024, 09:57:09 AM",
      "body": "I see you're stilling creating new thread which recycle your points from many previous threads. I've also watched the videos since it's only 3:58 long.Source: https://bitcointalk.org/index.php?topic=5476352.0Quote from: JamesNZ on December 03, 2023, 05:44:37 AMYou've all probably heard the stories on Bitcoin's value. Stories that portray Bitcoin not only as valuable, but precious. Stories by which buying bitcoins is one of the smartest things you can do. Well, all of that is just cheap propaganda. A bait to lure you to buy something worthless.Source: https://bitcointalk.org/index.php?topic=5474861.0Quote from: JamesNZ on November 21, 2023, 08:05:11 AMFinally, crypto units cannot be drunk, eaten, built into products, worn as jewelry, viewed as a picture or movie, or listened to as music. In short, they do not have an intrinsic value that creates a certain amount of benefit through the fulfillment of human needs, for this benefit to serve as a reference for the value of these units.Source: https://bitcointalk.org/index.php?topic=5472154.0Quote from: JamesNZ on October 30, 2023, 05:59:29 AMLet's therefore assume that those 100 units are 100 apples. Apples can fulfill the purpose of nutrion. By knowing that purpose, you can evaluate whether it is worth giving your bike for those 100 units. The same is true for other products that have historically been money - livestock, grain, wine, fur, metals, etc. All these products were able to fulfill purposes beyond serving as a medium of exchange. That was then used for estimating how many other products to give for them.Source: https://bitcointalk.org/index.php?topic=5467415.0Quote from: JamesNZ on September 20, 2023, 05:13:05 AMFor example. By wheat having a nutritional purpose, speculators approximately know how valuable it is to consumers and whether prices are cheap or expensive. Similarly, by fiat currencies having the purpose of paying debt to the banks and by debtors facing foreclosures in case of default, speculators know these currencies are worth to debtors somewhere in the range of pledged collaterals. Meaning, they will not trade houses for a specific number of currency units if they see that banks take cars as collateral when issuing that number of units.Anyway, when i purchase something with Bitcoin, personally i consider it as usage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "B1-66ER",
      "created_time": "April 11, 2024, 10:05:10 AM",
      "body": "BTC>I think there are many facets and interpretations of the term ‘use case’. For instance, from a software design and engineering perspective (ISO/IEC/IEEE 42010:2011, Systems and Software Engineering — Architecture Description), the use case could be the problem bitcoin solved, which is ‘double-spending without a central authority.’ As far as my understanding goes, Satoshi was a great maestro in putting all the software stack together to achieve that goal, as we can learn in the research by Narayanan, A. and Clark, J. (2017) ‘Bitcoin’s Academic Pedigree: The concept of cryptocurrencies is built from forgotten ideas in research literature,’ ACM Queue, pp. 20–49. Available at: https://doi.org/10.1145/3134434.3136559. If I am not mistaken, the OP video reference has a more socio-economic application of Bitcoin. The core argument of the video is that the only thing you can do with Bitcoin is to trade it on the market, there is no actual use for Bitcoin.This argument ignores the great invention that Bitcoin represents solving the double-spending problem without a central authority. This is a breakthrough in computer science and cryptography that enables a new form of decentralised trust and digital scarcity. Bitcoin is not just a trading asset; it is a paradigm shift in how we can exchange value and coordinate with each other online.BTC>",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "April 11, 2024, 10:22:09 AM",
      "body": "I reckon you're the author of that video?You're just using false dichotomy to make an impression of creating some novel thought.Not to mention other things, you failed to explain why can't \"trade\" (of any sort) be considered a \"use\".You might as well \"debunk\" the use case of bicycles in your next video, creating a division between \"use\" and \"ride\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "April 11, 2024, 10:29:32 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 09:48:16 AMNo, because money such as the dollar, besides being traded on the market, can also be used for returning it to its issuers - banks for satisfying loan or bond debt that was created by putting the dollar on the market. Money such as gold, besides being traded can also be used as jewellery, an electroplated coating, dental restorative material, etc. So, no, money is not useless. Only Bitcoin.BTC is a digital currency, it does not have centralized issuers like fiat, neither is it a physical coin that can be forged into another thing of value, and so on that basis you conclude that it isn't useful. I don't know what's your own definition of use case, but to anyone with understanding, BTC is useful and has its own use cases, some of which i am sure you know of, but you just seem to be trolling here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "April 11, 2024, 10:31:40 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 07:11:43 AMA short educational video explains the difference between 'trading an item' and 'using an item' to show that there's no such thing as a 'Bitcoin use case': https://youtu.be/uNzs9JAKjMYOkay, we understood that Bitcoin's use case is a myth but does it really matter whether we use the term trade or use? I use Bitcoin to send money in a way that my privacy is more protected compared to fiat transaction. Is it also a use case when someone sends jpeg image with Bitcoin Ordinals?It seems that you have put some time in your video but don't ever think that such a video will go viral. They won't, because you touch the subject that no one cares about. I and billions of people will say \"I use Bitcoin\" because we call it an use when we can do something with it and that includes any kinds of trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "April 11, 2024, 10:33:15 AM",
      "body": "OP seems to advertise his Youtube channel like other posters discovered.Endthefud.org is a good website with collective comprehensive resources to debunk many fud against Bitcoin.There are many use cases with Bitcoin and it depends on people who use bitcoins. Bitcoin use cases aren't depended on Satoshi Nakamoto's vision or our opinion. Like Silk Road, people used bitcoins to buy things on Silk Road years ago and fact is, we can not deny that it is one of use cases of Bitcoin even for purchasing stuffs on dark markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "April 11, 2024, 10:41:55 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 09:48:16 AMQuote from: HeRetiK on April 11, 2024, 09:35:00 AMSo by that definition, money is useless, right? So, do you want to Venmo me, or go via PayPal...? No, because money such as the dollar, besides being traded on the market, can also be used for returning it to its issuers - banks for satisfying loan or bond debt that was created by putting the dollar on the market.By your definition returning it to its issuers for satisfying a loan or bond debt is only \"trade\" though, and not \"use\".You are not \"using\" the dollar for anything. You are \"trading\" it for something you bought in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "April 11, 2024, 10:45:42 AM",
      "body": "Quote from: JamesNZ on April 11, 2024, 07:11:43 AMA short educational video explains the difference between 'trading an item' and 'using an item' to show that there's no such thing as a 'Bitcoin use caseIts very simple to understand, you don't have to believe in whatever thing you watch on youtube, some are only there to gain followers and they will say all manners of things to get the attention of people like you, aal i  know is that the use case of bitcoin is multi-functional, you can use it as an asset and a digital currency in making payment, since people believed in its value and uses, we can make it applicable to any interesting aspect of the financial economy in solving our day to day problems, anything contrary to this and not also stated on it whitepaper should be disregarded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}