{
  "id": "topic_5435023",
  "title": "Obari",
  "author": "Obari",
  "created_time": "January 16, 2023, 08:49:12 PMLast edit: January 17, 2023, 06:44:38 PM by Obari",
  "content": "I've been in this crypto space for a while now and there is this mentality instilled in people that seems selling ones coin is bad and one is heading to failure which is very wrong at least from my perspective.I've always been on the track that investing in Bitcoin simply means buying low and selling high,  which I think is one of the keys to success in the crypto Industry. I always tell people that the moment you buy at a certain price and it starts rising possibly to a price that you feel ok and contented with, then you should feel free and confident to sell atleast to get the profit first and always use stop loss just incase the price drops, rather than having a little portion of Bitcoin and letting it get liquidated just because you want to preach and prove HODLing, trying not to feel odd.So my question is:~ Do people hodl just because others are HODLing?~ Why do people hodl rather than sell and buy again when low~ What is your major reason for HODLing and how do your survive the bear market?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5435023",
  "comments": [
    {
      "author": "tabas",
      "created_time": "January 16, 2023, 09:04:03 PM",
      "body": "Quote from: Obari on January 16, 2023, 08:49:12 PMSo my question is:~ Do people hodl just because others are HODLing?No, we all have target prices and as much as we can hold, we'll hold. But no one can stop us if there's a need to sell it because that's how the market works. We have to sell and make a profit out of it so, others are just doing nothing and chilling to hold it until they can see the window of selling it at the desired price that they may like.Quote from: Obari on January 16, 2023, 08:49:12 PM~ Why so people hold rather than sell and buy again when lowIt's because they know that in the future the price will be more expensive and higher. It's a matter of investing and just like any other assets that we know of, we don't want to sell it at a lower price. Holding requires less effort than being that type of buying low and selling high at most types and this is what traders do, trading and investing still have differences.Quote from: Obari on January 16, 2023, 08:49:12 PM~ What is your major reason for HODLing and how do your survive the bear market?Based on what I've experienced in the market, being patient is going to be paid off within the next years. I survived the bear market just as the usual, don't look at the charts that you don't like the projection of it and just be solid with your long term plans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "January 16, 2023, 09:11:09 PM",
      "body": "Ofcourse it is okay as long as it is yours. Either you regret it or not afterwards; you are selling your asset for a reason. Regardless whether you sold it early or late; as long as there is a reason from doing so, that would be fine. We have different circumstances as investors in the first place. Some people will say \"just hold\". There will jist be emergencies in our lives which are totally unexpected and those will be the times wherein you have to break your plans to cope or adjust with the situation. Believe me, this happpens a lot in this industry. I had tough times as well wherein same thing pushed me to sell before rhe previous all time high. It did not gave me any regret since selling was necessary on my end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "January 16, 2023, 09:18:27 PM",
      "body": "Maximalist hodlers are a cancer for the mass adoption of Bitcoin, if we truly believe that one day this widely scarce digital currency will become the only economic exchange in the world then we must inevitably start using it in our daily lives.  If you tell me that it's not easy at all, I can guarantee you that using services like bitrefill you can easily buy everything using Bitcoin.  So we must not become hungry Bitcoin hodlers, but as in classical finance we must set aside and spend at the same time, while those who hope to see bitcoins in the hundreds of thousands of dollars are wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "January 16, 2023, 09:20:42 PM",
      "body": "The main reason people HODL is because they believe in the long-term potential of the project and technology behind the cryptocurrency. This strategy is based on the idea that the market will eventually recover and the value of the asset will increase. This means that if you HODL at a time when the price is low, you can expect to make a profit when the prices go back up. However, it's important to note that HODLing isn't a foolproof method for success. In fact, this method is often criticized by investors who believe in more active trading strategies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "January 16, 2023, 09:21:29 PM",
      "body": "Quote from: Obari on January 16, 2023, 08:49:12 PMI've been in this crypto space for a while now and there is this mentality instilled in people that seems selling ones coin is bad and one is heading to failure which is very wrong at least from my perspective.I've always been on the track that investing in Bitcoin simply means buying low and selling high,  which I think is one of the keys to success in the crypto Industry. I always tell people that the moment you buy at a certain price and it starts rising possibly to a price that you feel ok and contented with, then you should feel free and confident to sell atleast to get the profit first and always use stop loss just incase the price drops, rather than having a little portion of Bitcoin and letting it get liquidated just because you want to preach and prove HODLing, trying not to feel odd.So my question is:~ Do people hodl just because others are HODLing?~ Why so people hold rather than sell and buy again when low~ What is your major reason for HODLing and how do your survive the bear market? Agreed. I noticed it too for quite some time and that mentality is pretty common and easily instilled amongst the newbies. Somehow the pros and the veterans aren't so much indoctrinated by said notion. Then again for me it's all a matter of capacity really. If you think you can still carry on holding coins despite the bear market, then by all means hold them til the bull market comes around. But if you greatly depend on the value of those coins you own then I highly suggest you pull out some, or maybe even all of it if ever. After all the not losing is still winning, and in this case we have to mitigate the losses you incur which will only be possible if you pull your coins out at an opportune time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "January 16, 2023, 09:32:25 PM",
      "body": "Quote from: Obari on January 16, 2023, 08:49:12 PM~ Do people hodl just because others are HODLing?No, everyone is independently holding base on his own approach and level of research he has taken while undergoing bitcoin price speculation, but should in case some people follows the crowd then don't be surprised that they may be loosing when other are making profits because they both goes on different strategies on holding.Quote from: Obari on January 16, 2023, 08:49:12 PM~ Why so people hold rather than sell and buy again when lowThis is very simple to know, buy when it's cheap, hold on till when it rises before selling, isn't this beautiful and easy to do without any fear of missing out.Quote from: Obari on January 16, 2023, 08:49:12 PM~ What is your major reason for HODLing and how do your survive the bear market? Investors hodl during the bear and sells during the bull, another means you could adopt to survive the bear is to adopt a profitable buying strategy like dollar cost averaging pattern for your buying by weekly places, you can decide to hold or sell on this because you bought already at dip and can still sell when little realization is being made from your buying rate.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Questat",
      "created_time": "January 16, 2023, 09:34:52 PM",
      "body": "In the current situation, selling is not the best option but of course, if it is really necessary to sell them, then just go.If you are buying them at the $18,000 you are earning already, it is somewhat not a bad decision either. If you can hold it long and wait for the next bull season, it is really more profit to get. But of course, we can't simply think that it goes high continuously this time that is why we can see that some people are selling some of their Bitcoin and I know they will still use it to reinvest when the price drops back again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "January 16, 2023, 09:59:29 PM",
      "body": "Quote from: Obari on January 16, 2023, 08:49:12 PMSo my question is:~ Do people hodl just because others are HODLing?People hodl because they believe in the long-term potential of the technology and believe that the price will eventually rise.  It is also possible that they wanted to avoid a short-term volatility of the market and possibly don't want to miss out on the potential profit.Quote from: Obari on January 16, 2023, 08:49:12 PM~ Why so people hold rather than sell and buy again when lowIt is possible that the investor may not have a clear strategy on when to sell or buy.  It is also possible that they are emotionally attached to their investment and don't want to missed out on the potential profit.Quote from: Obari on January 16, 2023, 08:49:12 PM~ What is your major reason for HODLing and how do your survive the bear market?The major reason I have why I hold Bitcoin is because I believe that there is a very huge potential on its market.  I am hoping that my investment will yield more than 3x of my initial capital.  If we have other sources of income and our belief is strong that the Bitcoin market will one day surge, ignoring the FUD and just going on with our life can make us survive the bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ebede",
      "created_time": "January 16, 2023, 10:02:25 PM",
      "body": "Quote from: Yatsan on January 16, 2023, 09:11:09 PMOfcourse it is okay as long as it is yours. Either you regret it or not afterwards; you are selling your asset for a reason. Regardless whether you sold it early or late; as long as there is a reason from doing so, that would be fine. We have different circumstances as investors in the first place. Some people will say \"just hold\". There will jist be emergencies in our lives which are totally unexpected and those will be the times wherein you have to break your plans to cope or adjust with the situation. Believe me, this happpens a lot in this industry. I had tough times as well wherein same thing pushed me to sell before rhe previous all time high. It did not gave me any regret since selling was necessary on my end.Selling off your bit going is good for the problem is that if bitcoin rise during the process or during the time you call for selling of it and it increases I will say that you have to keep your bitcoin until when the time or when will enter bullish market that you make your profit thanks to you can be able to sell some part of your bitcoin not all but if it is like altcoin I will advise you to sell or without any hesitation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "January 16, 2023, 10:13:02 PM",
      "body": "Selling off isn’t bad because it’s actually the sole purpose of having it in the first place. The problem is the manner or period you sell. Some investors sell off immediately when there is a little price rise and some when a dump happens. Selling under panic conditions isn’t good because it sometimes leads to loss.Quote from: Obari on January 16, 2023, 08:49:12 PM~ Do people hodl just because others are HODLing? Some investors actually do hodl because of people’s opinion on holdingQuote from: Obari on January 16, 2023, 08:49:12 PM~ Why so people hold rather than sell and buy again when lowMany investors believe this is still early days of bitcoin and every body Holds just to have bunch of it when it eventually hits the ground running as legal tender for some countries and at that time it’s scarcity will favour early holders just like those that have it in 2009 and those who are just getting to buy them now. People sell high and buy low to gain some profits and still be able to hold some for the future.Quote from: Obari on January 16, 2023, 08:49:12 PM~ What is your major reason for HODLing and how do your survive the bear market?My reason to hold is just base on what stated above. To survive bear market is easy if you can be patient to hold for long and the secret to holding for long is having a secondary sources of spending. That is when investing in bitcoin you set aside Some funds for emergency and also for daily use. That is why it’s best to use at least 20% of once income. This percentage looks more less easy to lose and at such you don’t panic when the market fluctuates",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcampaign",
      "created_time": "January 16, 2023, 10:13:42 PM",
      "body": "besides I bought it with unused money so it's not a problem to sell it anytime , let's just say I'm investing long term so there's no need to rush to sell it , I believe bitcoin can be worth 1 million dollars , until that time comes I continue to buy it gradually",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "January 16, 2023, 10:18:44 PM",
      "body": "Quote from: Obari on January 16, 2023, 08:49:12 PMI've been in this crypto space for a while now and there is this mentality instilled in people that seems selling ones coin is bad and one is heading to failure which is very wrong at least from my perspective.I've always been on the track that investing in Bitcoin simply means buying low and selling high,  which I think is one of the keys to success in the crypto Industry. I always tell people that the moment you buy at a certain price and it starts rising possibly to a price that you feel ok and contented with, then you should feel free and confident to sell atleast to get the profit first and always use stop loss just incase the price drops, rather than having a little portion of Bitcoin and letting it get liquidated just because you want to preach and prove HODLing, trying not to feel odd.So my question is:~ Do people hodl just because others are HODLing?~ Why so people hold rather than sell and buy again when low~ What is your major reason for HODLing and how do your survive the bear market?Firstly, one must consider the intention behind making such a decision as would any normal person whose money is involved. Money in any form is meant to be spent, but how it is spent is what matters. If I have immediate or pressing need for my Bitcoin, I don't see why I can't withdraw and sort myself out. If there isn't a need to do any of such thing at the moment other than save/invest, HODLing is a good option. If no time constraint, one can try out other DCA strategies suppose there is growth in gain of Bitcoin, both regarding saved up coin in wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 16, 2023, 10:24:08 PM",
      "body": "never \"sell all\"decide on a % to sell dependant on need of such funds and how much % the price has gone up bywith enough small events you can establish 2 reserves . of btc and fiat to take each opportunity of a up or down",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "January 16, 2023, 10:24:43 PM",
      "body": "Quote from: Obari on January 16, 2023, 08:49:12 PMDo people hodl just because others are HODLing?Some probably do and I do hope more people will follow others in that regard.Quote from: Obari on January 16, 2023, 08:49:12 PMWhy so people hold rather than sell and buy again when lowBecause in order to actually sell high and buy low on the regular basis you have to be a good trader, and majority of people simply aren't. I tried that tactic in the past and while it worked for a couple of times due nothing but luck, in the next few times I tried that I lost big part of the previous profit so I realized that trading is not for me and I sleep much better ever since i switched to hodl mode, not obsessing over price.Quote from: Obari on January 16, 2023, 08:49:12 PMWhat is your major reason for HODLing and how do your survive the bear market?I suck at trading and I have no time or will to learn it. Regarding how I survive bear market its simple: I don''t have any price tracking apps on phone and I very rarely visit Coingecko/CMC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "January 16, 2023, 10:25:05 PM",
      "body": "Op have a right view on the market rise of bitcoin. This mainly connect with the newbie users who have entered the market in a dilemma. For them it is advisable to enjoy the profit, because they were in a dilemma whether the growth will happen or not. When the growth have taken place, it'll give them the relaxation and the understanding about the market. Missing an opportunity to profit will once again cause them into panic of losing or missing out the opportunity to profit. People with such mind can go for selling, whereas the majority of the hodlers were the people who trust bitcoin and believe in its growth. They never look upon others and hodl. It is the reality of the market to have a bull market after bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ojima-ojo",
      "created_time": "January 16, 2023, 10:26:45 PM",
      "body": "It depend your motive behind owning Bitcoin, if tou are into bitcoin for it soul aim of being in bitcoin os just for short term investment then what you explain you accurately and taking profits and minimizing loses can be the perfect way to go.But to others, no matter what the price of bitcoin is it does not matter in their investmentand the are not looking at BTC vs DCA cost so their are at peace and whatever happens in the Bitcoin to dollar value it does not concern them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "January 16, 2023, 10:39:48 PM",
      "body": "Quote from: Obari on January 16, 2023, 08:49:12 PMI've always been on the track that investing in Bitcoin simply means buying low and selling high,  which I think is one of the keys to success in the crypto IndustrySo you're a trader. You want to enter the deal with fiat money and your goal is to have more fiat money in the end.I approach this in a different way. I haven't even obtained a lot of my bitcoins by buying it with fiat money. I got it by selling different things for bitcoin, participating in signature campaigns, getting altcoins for holding my bitcoin and selling it to get more bitcoin, like I did with BCH, BSV and many other small bitcoin-based altcoins. Ultimately I want to have as much bitcoin as possible and I don't care about holding fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "January 16, 2023, 10:58:03 PM",
      "body": "Whether to sell your bitcoin or not need to be decided by the owner. Bitcoin at the present market situation have bounced and users who wants to make some profit can sell it and wait for the opportunity to buy back when there is minor drops. This is quite risky at the moment as the market could make any unexpected move in no time. People mostly prefer to hold their accumulated bitcoins at these kind of market situations. Even now it looks like the market to accumulate than selling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "January 16, 2023, 11:16:34 PM",
      "body": "This is where most newbies fail to really take into account. It's okay to sell as long as you need it, or you are planning to sell high and buy low to add to your stash. I've sold my coins a lot of times but I always make it to a point that I can buy those back and keep them for long. But if you're not really trying to actively trade, then buying and holding is the play and it's much easier to do, plus it's less stress too. Whatever you want to do with your coins, it's yours after all, so don't feel bad if you feel the need to let go of your coins for a greater cause.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}