{
  "id": "topic_5402269",
  "title": "Lalas6378",
  "author": "Lalas6378",
  "created_time": "June 12, 2022, 11:10:03 AM",
  "content": "guys dont trust in arabic peoplerefernece https://bitcointalk.org/index.php?topic=5350034.msg57496913#msg57496913you can see that bert1587 just say Every year and all my Muslim brothers are finethis is nothingthen Merited by hugeblack (4), NotATether (2)why he get meritsIn the Arabic section they give merits as Compliment onlyto all have more meritsjust they idiotsif you enter this Bitcoin Forum > Local > العربية (Arabic) you will see that all get merits without any reasons just merit abuse",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402269",
  "comments": [
    {
      "author": "joeperry",
      "created_time": "June 12, 2022, 12:38:31 PM",
      "body": "Isn't that's a little bit racist? Not all Arabic people are like that and doesn't mean they merit that it means they cannot be trusted already. If you find it skeptical or unnecessary to merit you can make your complain in the reputation board and also, after all it is their merit and they wanted it to spend the way they like it such as giving merit to a post that wish good to his fellow brothers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "June 12, 2022, 02:00:19 PM",
      "body": "This is the translated version of his threadQuoteEvery year and all my Muslim brothers are fineOn the occasion of the blessed Eid Al-AdhaMay God bring you all good daysEid Al-Adha definitionQuote from: https://en.wikipedia.org/wiki/Eid_al-AdhaEid al-Adha (Arabic: عيد الأضحى, romanized: ʿĪd al-ʾAḍḥā, lit. 'Feast of the Sacrifice') is the latter of the two official holidays which are celebrated within Islam (the other being Eid al-Fitr).He's celebrating their own religion feast, most likely both hugeblack and NotATether is celebrating too, the reason why they merited his post is they want to say thank you or respecting each other as a Muslim. Do you really hurt to see someone gave 4 and 2 merit because of this reason?What about this he only make a simple draw and got 30 merit from theymos, should we not trust theymos because of this? NO.It's not a merit abuse though it's not recommendable to merit such post, but there are a lot posts who doesn't deserve any merit, but still got merited.If you want to report about merit abuse, no need to link them into their religion! That's a racism and racism never been allowed in every countries!Move this topic to Reputation section",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 12, 2022, 03:05:20 PM",
      "body": "Op belong to an army of alts created by user bert1587 who is a loan defaulter, just to leave negative feedbacks in my profile because i warned people about him asking for another loan using one of his alts. Check my trust page: https://bitcointalk.org/index.php?action=trust;u=2443746I created this topic on my local board (arabic) looking for support from other active users in the board: https://bitcointalk.org/index.php?topic=5401497.Unfortunately, just one user supported me by leaving a good feedback telling that i deserve a better evaluation.I know that nothing can be done to erase those false evaluations, but at least those accounts should be tagged as a warning for others not to deal with any of them and that they all belong to the same person. Other users from the Arabic section can confirm what i am saying here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sterbens",
      "created_time": "June 12, 2022, 03:49:24 PM",
      "body": "Forums don't need racists like you, because that's not what we're looking for here. If you want to contribute why not with a more educational argument? There is no need to make such comments here. You have the right to dislike someone, but mentioning a particular race, ethnicity, or class is not the attitude of an intellectual knight.I'm going to pull myself out of this thread, it's a waste of time!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "June 12, 2022, 03:58:01 PM",
      "body": "Quote from: Lalas6378 on June 12, 2022, 11:10:03 AMguys dont trust in arabic people.Don't take all of them the Arabs, maybe only about one or two people and I don't think it will represent everyone.The user you are talking about has a bad reputation about loans [defaulted on loan] - check references. But of course you can't blame him for posting something that is considered a big celebration like Eid or so and earns some merit. This is not an abuse of merit, and I don't think it will change his reputation much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 12, 2022, 04:37:49 PM",
      "body": "Quote from: _BlackStar on June 12, 2022, 03:58:01 PMThe user you are talking about has a bad reputation about loans [defaulted on loan] - check references. But of course you can't blame him for posting something that is considered a big celebration like Eid or so and earns some merit. This is not an abuse of merit, and I don't think it will change his reputation much.If you take a look at my trust feedback page, you can see clearly that the user  which op is talking about is his alt. Op is a newbie one day old account which was created for the reason just a try to debase my reputation.See under Untrusted feedbacks: https://bitcointalk.org/index.php?action=trust;u=2443746Lol. The only positive feedback in the list displayed in above image was made by the borrower who lost his money after lending it to user bert1587 (Actually banned for unknown reasons) and he is also the one who replied to the greetings of the Islamic Eid in the topic mentioned above by op.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "June 13, 2022, 12:54:06 AM",
      "body": "your reference doesn't make sense. merits can be used to tell someone that they appreciate their post. sending someone merits no matter how shallow you think the reason is, does not make someone untrustworthy. also, looking at what Kavelj22 posted, it looks like you are the one that should not be trusted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "June 13, 2022, 04:36:54 AM",
      "body": "The Arab section consists of a very small number of people, and it seems to have its own merit source. What's so outrageous about people sharing merits on their local bulletin board? I know that similar support exists in all locales. And I don't see anything wrong.You also need to stop being jealous and learn Arabic, in which case local users will reward you with their merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "June 13, 2022, 04:49:31 AM",
      "body": "I think you are too racist by making that title. believe it or not, you can reveal more account specifics. not all like that.out of context you mean, I believe not all Arabs are like you claim.most importantly, you accuse with a new account. it looks very uncool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "June 13, 2022, 05:50:21 AM",
      "body": "Since I am mentioned explicitly in this thread I must comment.Above mentioned thread was, as pointed out by other members, a post of celebrating a specific muslim holiday.It's like when Christmas comes around every year and the \"Happy Holidays\" thread on Meta board with tons of merits is bumped. There is nothing wrong with such merit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "June 13, 2022, 07:21:48 AM",
      "body": "Since I am a member of the Arab section so I am concerned with these racist accusations as well, thanks to all the members who answered you with what you really deserve, this topic is the least we can say about it as a petty racist, how do you describe everyone in Arabic section they idiots just because they gave some merits on a sacred religious occasion for them? This is complete nonsense!!!After all you are posting through a new account created yesterday, it is definitely an alternative account and not your main account, I advise you instead of bothering yourself with these things to bother learning and posting useful things until you get merits instead of wasting precious members time on these racist topics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "June 19, 2022, 06:02:52 AM",
      "body": "Quote from: Pandu Geddon on June 13, 2022, 04:49:31 AMI think you are too racist by making that title. believe it or not, you can reveal more account specifics. not all like that.out of context you mean, I believe not all Arabs are like you claim.most importantly, you accuse with a new account. it looks very uncool.The Arab section, like other local sections, includes a limited number of active members on a regular basis, and we act with great affection among us and with great respect. Almost there is a topic that comes down in the Arabic section to congratulate Muslims on the most important religious holidays because the vast majority of Arabic-speaking people are Muslims, and almost all Arab countries are countries that embrace the Islamic religion, with minorities from other religions and sects. Even members of other religions or non-religious people share congratulations on these occasions and I really don't see what the harm in that is.I do not understand what is the problem with members congratulating each other on a holiday or religious occasion, and what is the harm in having one of them obtain merit points based on those congratulations.This topic bears clear racist traces, and I doubt that the its author is a Muslim or an Arab in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 20, 2022, 09:59:31 AM",
      "body": "This topic Merry Christmas to the Forum is similar to the case mentioned above, however, it got about 9 merits from @CyrusA Crypto Christmas; Using Bitcoin to help feed the homeless got hugeblack (10), CryptopreneurBrainboss (, Pokapoka124 (6), Ratimov (5), Rruchi man (5), RickDeckard (5), buwaytress (2), Mpamaegbu (2), Darker45 (2), LogitechMouse (2), Halab (2), Smartvirus (2), mdayonliner (2), Accardo (2), davis196 (1), rhomelmabini (1), hyudien (1), levyashin (1), Jawhead999 (1), CryptocurencyKing (1), Poker Player (1) Merits.Therefore, we cannot describe the situation as a Merit abuse, and therefore we cannot generalize to Arabic local board or to all Arabs.If you give a more detailed Merit abuse topic, you may find some sympathy, but you are trolling for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "June 20, 2022, 11:34:31 AM",
      "body": "Quote from: Husires on June 20, 2022, 09:59:31 AMThis topic Merry Christmas to the Forum is similar to the case mentioned above, however, it got about 9 merits from @CyrusA Crypto Christmas; Using Bitcoin to help feed the homelessThe example you pointed out from the links you supplied and what the OP reported here aren't the same in any way. If anything, they're poles apart in miles. I believe what OP reported was a mere greetings of sort but what you pointed out isn't just mere greetings. The OP in your report used that season opportunity to showcase some charitable works they've done and the publicity that was involved, both for themselves and the entire forum as we can see the name of this forum there. It was based on that, I believe, users merited them.BTW, kindly check the links you supplied. Both contained the same thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "June 20, 2022, 12:27:00 PM",
      "body": "Quote from: Lalas6378 on June 12, 2022, 11:10:03 AMguys dont trust in arabic peopleFew individuals do not represent a county, not even a group of people too. Definitely not the entire Arabic group in bitcointalk. Your statement is bold and offensive to an entire nation who speaks Arabic and lives in Arabic mainland. I will not defiantly take any of your words seriously in the mean time I will mark you as racist. To be honest you do not belong to this forum too. We do not need you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "June 20, 2022, 01:38:33 PM",
      "body": "Only replying because I'm mentioned -- the thread I merited had very little to do with it being a Christmas greeting (which I don't even celebrate neither religiously nor culturally). I generally merit any kind of positive Bitcoin-related effort, in that case, guy was collecting Bitcoin to buy food to distribute to the needy.That said, I merit posts I think contribute in any kind of cheer, good will, positivity, and constructive feedback. If I think a meme captures the spirit of the post and makes me smile, hell that's a merit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "June 20, 2022, 02:42:31 PM",
      "body": "There are no rules and restrictions for each member who wants to share (Merit) to other members which they think is in accordance with their conscience and touched for members who want to give (Merit), whether it's local, arabic and so on, also from the word whether they say (Zzxxzz) or congratulations, that's their full right.Quote from: Lalas6378 on June 12, 2022, 11:10:03 AMguys dont trust in arabic peoplerefernece: https://bitcointalk.org/index.php?topic=5350034.msg57496913#msg57496913The words of @bert1587, have no value, it is for those of you who are not Muslims, but for a Muslim it is a word that has the best value, it is an honor and a Muslim tradition when Hari Raya arrives, Of course, if you are religious, you certainly don't want to demean the words of other religions, what you need to remember is, in this forum there are members who are Muslim, Christian, Buddhist, Hindu, there are also those who do not have a religion, but they all still respect each other, unlike you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "June 20, 2022, 02:56:19 PM",
      "body": "Quote from: Kavelj22 on June 19, 2022, 06:02:52 AMThis topic bears clear racist traces, and I doubt that the its author is a Muslim or an Arab in the first place.that's probably true, OP is not a Muslim. and s/he does not have good religious tolerance.that's why s/he used a new account to create this racist thread.I'm sure, the OP is also watching the discussion in this thread with his main account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "June 20, 2022, 02:57:46 PM",
      "body": "This forum has people from all over the world, of every religion and of no religion, and it's a better forum because of it (despite when members who can't write English try to do so for bounties/campaigns, but that's another story).  I've got nothing against Arabs myself, and simply because that post got merited wouldn't change my views one iota.  I've seen posts get merit for far less substantial sentiments than that.Quote from: buwaytress on June 20, 2022, 01:38:33 PMOnly replying because I'm mentioned -- the thread I merited had very little to do with it being a Christmas greeting (which I don't even celebrate neither religiously nor culturally).Bro, you don't need to defend your actions, believe me.  OP is either trolling or really just hates Arabs; I'm not seeing much support for his arguments here, so you needn't worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}