{
  "id": "topic_5475514",
  "title": "anubizz",
  "author": "anubizz",
  "created_time": "November 25, 2023, 09:35:57 PM",
  "content": "I found this virtual credit card service today:https://www.shido.io/cardThey offer a non-KYC virtual Visa and Mastercard that is working for worldwide purchases.Any reviews on this service? Are they legit???",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475514",
  "comments": [
    {
      "author": "dkbit98",
      "created_time": "November 25, 2023, 10:50:32 PM",
      "body": "Quote from: anubizz on November 25, 2023, 09:35:57 PMThey offer a non-KYC virtual Visa and Mastercard that is working for worldwide purchases.Any reviews on this service? Are they legit???It looks like they are using same service provider like some other virtual cards I used recently.I think they have misleading information for Lite cards, when they say that you can  withdraw $300 from ATM  per day.This is impossible from non-kyc virtual cards like this, but they claim this on website main page:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anubizz",
      "created_time": "November 26, 2023, 01:49:31 AM",
      "body": "Yes, you are right.But I would love to see a worldwide working non-KYC virtual card provider these days. I already gave up the hope for something like this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "November 27, 2023, 11:02:27 PM",
      "body": "Quote from: anubizz on November 26, 2023, 01:49:31 AMBut I would love to see a worldwide working non-KYC virtual card provider these days. I already gave up the hope for something like this.I don't know what you are talking about.There are plenty of legit non-kyc virtual cards available now to choose from, and much bigger problem is to find physical non-kyc card that work in real life scenarios, only few of them are available now and they sadly don't work in all countries/regions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "November 28, 2023, 08:10:02 AM",
      "body": "Quote from: anubizz on November 26, 2023, 01:49:31 AMYes, you are right.But I would love to see a worldwide working non-KYC virtual card provider these days. I already gave up the hope for something like this.You can find some, but the question will be how long this card will work, and there is a possibility that it will suddenly stop and you will lose all the money, as such services are against the regulations for issuing these cards. However, companies try to provide cards with a lower withdrawal limit than that imposed by AML in some countries, but soon those cards will be discovered, banned or restricted.The easiest solution is to buy gift cards with Bitcoin and spend them where available.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "anubizz",
      "created_time": "November 28, 2023, 08:07:08 PM",
      "body": "Quote from: dkbit98 on November 27, 2023, 11:02:27 PMQuote from: anubizz on November 26, 2023, 01:49:31 AMBut I would love to see a worldwide working non-KYC virtual card provider these days. I already gave up the hope for something like this.I don't know what you are talking about.There are plenty of legit non-kyc virtual cards available now to choose from, and much bigger problem is to find physical non-kyc card that work in real life scenarios, only few of them are available now and they sadly don't work in all countries/regions.Since the new edition of the money laundering guidelines in the EU regarding prepaid cards, I did not have luck to find some, beside shido.io and bit.store card (both issued by their partner Alchemy Pay). But I would be happy if you enlighten me   .The possibility of worldwide payments would be required in my case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "November 29, 2023, 04:47:44 PM",
      "body": "Quote from: anubizz on November 25, 2023, 09:35:57 PMI found this virtual credit card service today:It appears to be a debit card Quote from: anubizz on November 25, 2023, 09:35:57 PMAny reviews on this service? Are they legit???I saw a couple of reviews/complaints [e.g. fee deductions despite mentioning on their website that there's \"No fee on Spending & Consumption\", no cashback rewards, etc...] about their previous card offerings, but considering that this appears to be the second iteration of their virtual cards within the past year [refer to this page], none of those probably matter unless they were also issued by Alchemy Pay at that time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zakservers",
      "created_time": "December 13, 2023, 12:28:30 AM",
      "body": "Honestly never trust a non-KYC virtual card, since all cards are regulated by either VISA, Master or AMEX etc, and they do need a KYC, they are not like bitcoin, I think a few people offering them this way, is that they make their own account with a bank with their own KYC and then issue you a virtual card using their account, that method is very dangerous as the real owner always have full access to your funds, so I think there is nothing like a non-KYC virtual card, yes crypto can be non-KYC, web hosting can be same too, but not the virtual cards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbc.reporter",
      "created_time": "December 13, 2023, 03:53:00 AM",
      "body": "Quote from: anubizz on November 26, 2023, 01:49:31 AMYes, you are right.But I would love to see a worldwide working non-KYC virtual card provider these days. I already gave up the hope for something like this.Everyone would love to have a worldwide no KYC virtual card, however, these services that want to offer them will always come down to the reality of the compliance nightmare because regulators will for certain impose the KYC rule on them. The reason is moneylaunderers will find their way to the service if KYC is not enforced and the government can also threaten to accuse the service of being used for terrorist financing, drugs, tax evasion very much similar to many accusations they have made on bitcoin and the cryptospace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "December 13, 2023, 10:41:22 PM",
      "body": "Quote from: anubizz on November 26, 2023, 01:49:31 AMYes, you are right.But I would love to see a worldwide working non-KYC virtual card provider these days. I already gave up the hope for something like this.These are one of the dreams of crypto users just like what services offered before where there's no tight regulation. Although there are some but only have limited uses. You can check this list for virtual and physical card providers https://bitcointalk.org/index.php?topic=5208530.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}