{
  "id": "topic_5464566",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "August 25, 2023, 02:33:30 PM",
  "content": "Данный текст был написан после последних обстоятельств неудержимых сущностей восприятия воздействия текущих особенностей модерирования данного раздела форума. Прошу без обид. Но чем больше меня будут стирать из данной реальности – тем, возможно, моя абстракция будет воссоздаваться в других реальностях. Но там ваша власть не будет распространяться... Увы... Поэтому, рекомендую подумать прежде  чем... Ибо... кто знает... как оно в итоге обернется всуе!       У меня тут внезапно возникла идея. Как проверить тот факт, что народ РФ исторически ТУПОЙ по своей натуре. И в этом и есть все его проблемы. Как это сделать? И я решил наплодить и распространить  в Сети ряд зашкварных отборных кондовых фейков. Просто залить инет говном от души. Типа проверить, что если все на это поведутся – то все. «народ тупой». Если нет, то тогда... может быть... шансы еще есть...       Как показали мои социологические исследования, народ на мои фейки ведется плохо. Либо фейки чересчур заумные, либо я что-то сделал не так для распространения своих фейков. Но всеж ведется. И не только на этом форуме тоже. Прошу учесть этот фактор впредь. Не покупаются. Не повокупляются. Не совокупляются ни на какие провокации. Стойкость 90 lvl. Народ УСТОЙЧИВЫЙ. Или нет?   Или может быть не так? Может быть идея эксперимента была неправильна? Народ не ведется на провокации не потому что он тупой, а просто он НАСТОЛЬКО тупой, что даже не может понять, что его элементарно разводят?   То есть, поясняю простыми словами. Изначально планировалось уточнить тот факт, что народ такой умный, что не купится на тупой развод. Но он оказался такой тупой, что не понял, что это был тупой развод. Спасибо тем, кто не купился, и дочитал до этого момента. Хоть за это спасибо. Просьба отписаться тем, кто дочитал до этого момента и понял, что вся суть данного топика – просто развод. А не научный эксперимент. Спасибо. Каждый комментарий тут будет учитываться в расчете. Если комментариев не будет – то это будет означать, что «народ – ТУПОЙ» . Как-то так.  ИМХО.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464566",
  "comments": [
    {
      "author": "be.open",
      "created_time": "August 25, 2023, 02:58:55 PM",
      "body": "Чё там, опять с народом не повезло?  Народ в России не тупой, а временами и местами даже вполне себе демонстрирует некоторые зачаточные признаки мудрости толпы. С самосознанием вот у народа не очень, склонность к мета-мышлению оставляет желать лучшего. Хотелось бы видеть больше практических успехов в способности народа отслеживать неопределённость всякого рода, потому что это имеет фундаментальное значение для адекватного восприятия мира. Также хотелось бы видеть больше гибкости в алгоритмах самоконтроля и больше вариативности в выборе стратегий поведения. Но не исключено, что это моё персональное когнитивное искажение на фоне того, что у меня повышенные требования к биоразнообразию.Так что соберись, подотри сопли и не ной. Другого народа у тебя не будет, надо работать с тем, что есть, здесь и сейчас. Таков путь.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "August 25, 2023, 03:10:26 PM",
      "body": "Уважаю. Вы все правильно сказали. Человек-надежда. Тот, кто верит и мечтает. Что народ России (когда-нибудь) воспрянет ото сна, сбросит кандалы и ярмо, и вдруг внезапно прозреет и осознает, что последние примерно 300 лет он (Русский народ) был неправ. А прав был Чарльз Дарвин. Как0-то так, ИМХО... Поправьте меня, если я ошибаюсь...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "August 25, 2023, 03:31:56 PM",
      "body": "Quote from: bonfire66 on August 25, 2023, 02:33:30 PM      Данный текст был написан после последних обстоятельств неудержимых сущностей восприятия воздействия текущих особенностей модерирования данного раздела форума. Прошу без обид. Но чем больше меня будут стирать из данной реальности – тем, возможно, моя абстракция будет воссоздаваться в других реальностях. Но там ваша власть не будет распространяться... Увы... Поэтому, рекомендую подумать прежде  чем... Ибо... кто знает... как оно в итоге обернется всуе!Чем больше вы будете штамповать однотипных топиков, тем больше их будут удалять. Перестаньте клепать однотипные топики и никто ничего удалять не будет. Это во-первых. Во-вторых, ваш топик удалили, но содержимое удалённого топика было добавлено в ваш однотипный топик Как научиться троллингу. Если вы не можете следить за вашими топиками, то это ваша вина в первую очередь, а никак не модераторов.А стереть вас очень даже легко, просто забанив за систематическое нарушение правил форума. Так что если продолжите в том же духе, то ваш бан не за горами. Это не угроза, нет. Это просто чтобы вы понимали, что всё возможно.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "August 25, 2023, 03:51:22 PM",
      "body": "Quote from: be.open on August 25, 2023, 02:58:55 PMЧё там, опять с народом не повезло?  Народ в России не тупой, а временами и местами даже вполне себе демонстрирует некоторые зачаточные признаки мудрости толпы....И где эти признаки мудрости? Вместо того чтобы сплотиться и выбрать себе лидера-пацифиста (я уж не говорю привести его к власти в РФ)он дрочит на Пригожина и его \"марш\". То есть как ты раньше выразился, на еще более воинствующего чем пюрер. Все информационное поле забито этим покушением.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "August 25, 2023, 04:04:02 PM",
      "body": "Quote from: The0ldl_lser on August 25, 2023, 03:51:22 PMQuote from: be.open on August 25, 2023, 02:58:55 PMЧё там, опять с народом не повезло?  Народ в России не тупой, а временами и местами даже вполне себе демонстрирует некоторые зачаточные признаки мудрости толпы....И где эти признаки мудрости? Вместо того чтобы сплотиться и выбрать себе лидера-пацифиста (я уж не говорю привести его к власти в РФ)он дрочит на Пригожина и его \"марш\". То есть как ты раньше выразился, на еще более воинствующего чем пюрер. Все информационное поле забито этим покушением.Да прям таки дрочит. Это журналисты-хайпожоры дрочат, что и не удивительно - у них профдеформация такая, повышенная падкость к любого рода сенсациям. Причём от национальности это не зависит, на любой западный ресурс зайди, хоть на тот же The Telegraph - там тоже вся передовица в Пригожине.А про пацифизм это ты тоже зря, пацифисты в нынешнее непростое время хуже веганов. Выберешь себе лидера-пацифиста, а назавтра тебя тут же сожрут с говном и не подавятся. Так что пусть вон на Западе себе пацифистов выбирают и маются потом с ними. Потому что чем хуже для них - тем более это для нас богоугодная хуйня.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "August 25, 2023, 04:09:26 PM",
      "body": "Принято. То есть ты признаешь что журналистика в России хромает. Ну не могут хайповать журналисты \"от народа\" вне спускаемой сверху повестки). Тоже мысль, надо кому-то этим заняться. Первым делом предлагаю выдать каски Соловьеву со Скабеевой",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "August 25, 2023, 04:22:18 PM",
      "body": "Quote from: The0ldl_lser on August 25, 2023, 04:09:26 PMПринято. То есть ты признаешь что журналистика в России хромает. Ну не могут хайповать журналисты \"от народа\" вне спускаемой сверху повестки). Тоже мысль, надо кому-то этим заняться. Первым делом предлагаю выдать каски Соловьеву со Скабеевой  Журналистика во всём мире хромает, и Россия не исключение. Основная проблема журналистики как жанра - в эту кривую телегу запряжена всего одна хромая лошадь по кличке \"Интересно\".  И в условиях информационного изобилия она не вывозит. Раньше времена были другие, трава была более зелёная, а вместо информационного изобилия был информационный дефицит. А потом случилась революция, и вместо дефицита настало изобилие. А ёмкость человеческого внимания не слишком то изменилась. В результате этих пертрубаций дефицитным ресурсом стала не информация, а заинтересованное внимание аудитории, за которое среди средств массовой информации немедленно развернулась нешуточная борьба. И ставка в этой борьбе была сделана как раз на ту хромую лошадь по кличке \"Интересно\". С тех пор вся журналистика пошла по пизде. Потому что в жизни есть вещи малоинтересные, но слишком важные, чтобы их игнорировать. А современная журналистика слишком обуреваема жаждой хайпа, чтобы помнить об этом. Поэтому я на журналистов смотрю как на говно. Люди там может быть встречаются в принципе и неплохие, но с выбором профессии им как-то не повезло, и кроме самих себя винить в этом им в общем-то некого.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tw0.625",
      "created_time": "August 25, 2023, 04:26:55 PM",
      "body": "Quote from: be.open on August 25, 2023, 04:22:18 PMQuote from: The0ldl_lser on August 25, 2023, 04:09:26 PMПринято. То есть ты признаешь что журналистика в России хромает. Ну не могут хайповать журналисты \"от народа\" вне спускаемой сверху повестки). Тоже мысль, надо кому-то этим заняться. Первым делом предлагаю выдать каски Соловьеву со Скабеевой  Журналистика во всём мире хромает, и Россия не исключение. Основная проблема журналистики как жанра - в эту кривую телегу запряжена всего одна хромая лошадь по кличке \"Интересно\".  И в условиях информационного изобилия она не вывозит. Раньше времена были другие, трава была более зелёная, а вместо информационного изобилия был информационный дефицит. А потом случилась революция, и вместо дефицита настало изобилие. А ёмкость человеческого внимания не слишком то изменилась. В результате этих пертрубаций дефицитным ресурсом стала не информация, а заинтересованное внимание аудитории, за которое среди средств массовой информации немедленно развернулась нешуточная борьба. И ставка в этой борьбе была сделана как раз на ту хромую лошадь по кличке \"Интересно\". С тех пор вся журналистика пошла по пизде.А почему случилась революция, не напомнишь?   А главное где? Ну вот чего кацапня взбунтовалась и развалила СССР к хуям? Что же случилось?   Кто же это сделал?   И заметь, на 1991-й кацапня устроила революцию уже третий раз за 100 лет. Ну тоесть четвертого раза ведь не будет, правда?  При этом как-бы в США не хромала журналистика, но за 150 лет что-то там ни революций ни гражданских войн. Так может дело не в журналистике?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "August 25, 2023, 04:29:41 PM",
      "body": "Quote from: tw0.625 on August 25, 2023, 04:26:55 PMА почему случилась революция, не напомнишь?   А главное где? Ну вот чего кацапня взбунтовалась и развалила СССР к хуям? Что же случилось?   Кто же это сделал?  Революций в журналистике было две - сначала массово распространились телевизеры, а затем не менее массово распространился интернет. Почему это случилось сложно сказать - так стеклись обстоятельства.Quote from: tw0.625 on August 25, 2023, 04:26:55 PMПри этом как-бы в США не хромала журналистика, но за 150 лет что-то там ни революций ни гражданских войн. Так может дело не в журналистике?  Ты слишком политически ангажирован, чтобы отличать настоящую революцию от обычного переворота. А может просто туповат от природы.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tw0.625",
      "created_time": "August 25, 2023, 04:30:48 PMLast edit: August 25, 2023, 04:42:55 PM by tw0.625",
      "body": "Quote from: be.open on August 25, 2023, 04:29:41 PMРеволюций в журналистике было две - сначала массово распространились телевизеры, а затем не менее массово распространился интернет. Почему это случилось сложно сказать - так стеклись обстоятельства.Ну смотри, вот в США за 150 лет ни одной революции или гражданской войны, а на территории кацапии - 3 революции и хуева туча гражданских войн и межнациональных войн за последние 123 года. Ну как же так?  Да, США тоже не безгрешны, но по крайней мере они не срут там где едят и живут - ну тоесть они не нападают на Канаду или на Мексику... хотя могут из \"демилитализировать\" в два счета.Так может все дело не в телевизоре, ведь телевизор есть и у гражан сша и у кацапов. А дело в кацапах? Может просто надо кацапов уничтожить и в Европе наступит тысячелетний Мир?   Ну а как блядь можно развиваться в стране, которую к хуям обнуляют и разносят в военном конфликте в среднем каждые блядь 30 лет. Ну сука как?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "August 25, 2023, 04:43:32 PM",
      "body": "Quote from: tw0.625 on August 25, 2023, 04:30:48 PMQuote from: be.open on August 25, 2023, 04:29:41 PMРеволюций в журналистике было две - сначала массово распространились телевизеры, а затем не менее массово распространился интернет. Почему это случилось сложно сказать - так стеклись обстоятельства.Ну смотри, вот в США за 150 лет ни одной революции или гражданской войны, а на территории кацапии - 3 революции и хуева туча гражданских войн и межнациональных войн за последние 123 года. Ну как же так?  Да, США тоже не безгрешны, но по крайней мере они не срут там где едят и живут - ну тоесть они не нападают на Канаду или на Мексику... хотя могут из \"демилитализировать\" в два счета.Так может все дело не в телевизоре, ведь телевизор есть и у гражан сша и у кацапов. А дело в кацапах? Может просто надо кацапов уничтожить и в Европе наступит тысячелетний Мир?  Знаешь какая будет следующая революция? Когда квантовое программирование скрестят с искусственным интеллектом на генеративных нейросетях и делегируют ему полномочия далеко за пределами его компетенций. То есть решения в повседневной жизни повсеместно начнут принимать самообучающиеся \"чёрные ящики\", основанные на нечёткой логике, которые будут с доверительной вероятностью точными и у которых нельзя (да и некому) будет спросить \"почему?\" было принято то или иное решение. Это будет новым вызовом самосознанию и метамышлению хомо сапиенса как биологического вида. Успеваешь там конспектировать то?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tw0.625",
      "created_time": "August 25, 2023, 04:45:54 PM",
      "body": "Quote from: be.open on August 25, 2023, 04:43:32 PMЗнаешь какая будет следующая революция? Когда квантовое программирование скрестят с искусственным интеллектом на генеративных нейросетях и делегируют ему полномочия далеко за пределами его компетенций. То есть решения в повседневной жизни повсеместно начнут принимать самообучающиеся \"чёрные ящики\", основанные на нечёткой логике, которые будут с доверительной вероятностью точными и у которых нельзя и некому будет спросить \"почему?\" было принято то или иное решение. Это будет новым вызовом самосознанию и метамышлению хомо сапиенса как биологического вида. Да хуй его знает что будет. Будущего не видит никто. Но все технологические прорывы за последние 150 лет происходили в США. Ибо кацапня в среднем раз в 30 лет любит обнулять свой капитал, резьебывать страну к хуям и создавать все условия чтобы элита бежала нахуй из этой дурки. Так что единственный мой прогноз на будущее - если кацапня еще останется вживых после войны с Украиной, то она и дальше продолжить обнуляться среднем раз в 30 лет и дообнуляется до мышей.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "August 25, 2023, 04:55:39 PM",
      "body": "Quote from: tw0.625 on August 25, 2023, 04:45:54 PMQuote from: be.open on August 25, 2023, 04:43:32 PMЗнаешь какая будет следующая революция? Когда квантовое программирование скрестят с искусственным интеллектом на генеративных нейросетях и делегируют ему полномочия далеко за пределами его компетенций. То есть решения в повседневной жизни повсеместно начнут принимать самообучающиеся \"чёрные ящики\", основанные на нечёткой логике, которые будут с доверительной вероятностью точными и у которых нельзя и некому будет спросить \"почему?\" было принято то или иное решение. Это будет новым вызовом самосознанию и метамышлению хомо сапиенса как биологического вида. Да хуй его знает что будет. Будущего не видит никто. Но все технологические прорывы за последние 150 лет происходили в США. Ибо кацапня в среднем раз в 30 лет любит обнулять свой капитал, резьебывать страну к хуям и создавать все условия чтобы элита бежала нахуй из этой дурки. Так что единственный мой прогноз на будущее - если кацапня еще останется вживых после войны с Украиной, то она и дальше продолжить обнуляться среднем раз в 30 лет и дообнуляется до мышей.В США эта революция уже произошла, только последствия ещё не полностью проявились, но это только вопрос времени. Чего ты на самом деле не понимаешь - это того, что в этой революции выиграют ретроградные аутсайдеры, которым прикольно по олдскулу. Поэтому за санкции всему прогрессивному Западу большое человеческое спасибо, эта была единственная возможность отсоединиться от локомотива прогресса, который уже летит прямо в пропасть и даже сам знает об этом. Поэтому и бесится.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "August 25, 2023, 05:04:46 PM",
      "body": "Quote from: be.open on August 25, 2023, 04:55:39 PM... Поэтому за санкции всему прогрессивному Западу большое человеческое спасибо, эта была единственная возможность отсоединиться от локомотива прогресса, который уже летит прямо в пропасть и даже сам знает об этом. .Ну ага, так летит, что Доля доллара в мировых платежах достигла рекордного уровняQuoteРезкое увеличение объема платежей в долларах по системе SWIFT ставит под вопрос движение за прекращение господства доллара в глобальных платежах и переводах средств.Китай, Россия и Индия, активно выступают против доллара, особенно после того, как несколько российских банков были исключены из SWIFT в рамках западных санкций.В частности, в течение последнего года эти три страны осуществляли торговлю энергоносителями в юанях, рупиях и рублях, стремясь снизить зависимость от доллара. Между тем страны БРИКС также изучают возможность создания единой валюты, которая могла бы бросить вызов доллару....походу темой ошибся",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tw0.625",
      "created_time": "August 25, 2023, 05:09:24 PM",
      "body": "Quote from: be.open on August 25, 2023, 04:55:39 PMВ США эта революция уже произошла, только последствия ещё не полностью проявились, но это только вопрос времени. Чего ты на самом деле не понимаешь - это того, что в этой революции выиграют ретроградные аутсайдеры, которым прикольно по олдскулу. Поэтому за санкции всему прогрессивному Западу большое человеческое спасибо, эта была единственная возможность отсоединиться от локомотива прогресса, который уже летит прямо в пропасть и даже сам знает об этом. Поэтому и бесится.   Ты ебанулся.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "August 25, 2023, 05:16:19 PM",
      "body": "Quote from: The0ldl_lser on August 25, 2023, 05:04:46 PMQuote from: be.open on August 25, 2023, 04:55:39 PM... Поэтому за санкции всему прогрессивному Западу большое человеческое спасибо, эта была единственная возможность отсоединиться от локомотива прогресса, который уже летит прямо в пропасть и даже сам знает об этом. .Ну ага, так летит, что Доля доллара в мировых платежах достигла рекордного уровняQuoteРезкое увеличение объема платежей в долларах по системе SWIFT ставит под вопрос движение за прекращение господства доллара в глобальных платежах и переводах средств.Китай, Россия и Индия, активно выступают против доллара, особенно после того, как несколько российских банков были исключены из SWIFT в рамках западных санкций.В частности, в течение последнего года эти три страны осуществляли торговлю энергоносителями в юанях, рупиях и рублях, стремясь снизить зависимость от доллара. Между тем страны БРИКС также изучают возможность создания единой валюты, которая могла бы бросить вызов доллару....походу темой ошибся Хаха, а за счёт чего доля доллара в системе СВИФТ выросла там не рассказывают по ссылке? Так я тебе расскажу за счёт чего - за счёт пропорционального и резкого снижения доли евро. Это и был коварный план США по разжиганию конфликта на Украине - нагнуть Европу раком и на фоне и за счёт проблем Старого Света чтобы американский ёбаный пиздец выглядел бы чуть менее пиздецово. Тоже мне новости.Quote from: tw0.625 on August 25, 2023, 05:09:24 PMТы ебанулся.Чё у тебя там картина мира треснула, болезный? Не благодари, бывает.Quote from: tw0.625 on August 25, 2023, 04:45:54 PMБудущего не видит никто. Я самый крутой визионер и архитектор будущего в русском локале, ёпта.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The0ldl_lser",
      "created_time": "August 25, 2023, 05:34:55 PM",
      "body": "^За счет отключения РФ от Свифт надо полагать Quote from: be.open on August 25, 2023, 05:16:19 PMЯ самый крутой визионер и архитектор будущего в русском локале, ёпта. а на этот счет тебе еще придется посоревноваться",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "August 25, 2023, 05:37:14 PM",
      "body": "Quote from: bonfire66 on August 25, 2023, 03:10:26 PMА прав был Чарльз Дарвин. Как0-то так, ИМХО... Поправьте меня, если я ошибаюсь... Поправляю тебя, Бонифаций:Если бы Чарльз Дарвин был бы прав, то ты, как очевидная тупиковая ветвь эволюции, в этом мире даже и не появился бы на свет.Но, как я понял, твоя врожденная тупость передалась тебе от твоих родителей (и ты в этом точно не виноват ни разу).Которые (в силу тупости, переданной им твоими туповатыми бабушками и дедушками (ну, или от кого уж твои бабушки там того ... если ты понимаешь, о чём я  даже и не знали о методах предохранения, чтобы ты никогда не появился на свет ...Но! С учетом твоего:Quote from: Azrieli on June 29, 2022, 02:37:46 PMbonfire666Все жду, когда этот дятел в теме отметится - но видимо оно сильно занято, бухает. А что делать делать, когда седина в ребро (66 - видимо год рождения) и жить просрана, конечно винить Россию - она виновата, никто иной. Старый маразмадик, любитель побухать, почти уверен без семьи, без накоплений, но с большой обидой на страну - потому что ... 0 по жизни. Агрессивный на форумах, даже не понимает ... что ходит под статьей и находится в России, но кому нужны психи-старики, чтобы отлавливать и перевоспитывать? Живет безусловно в МСК, но каждой клеточкой ненавидит Россию. https://www.youtube.com/channel/UCNXuOCOHpHlJGOWKM8PzSIw/videosМыло - bonfire66@yandex.ru https://bitcointalk.org/index.php?topic=5401431.msg60297371#msg60297371 - тут коммент дятла понравился, процитирую:QuoteСамоудовлетворяться полезно. Все всегда под рукой. Дешево и сердито. Я вообще не вижу большого смысла в финансировании плотской похоти. Хотя, возможно, это старческое... Но зато имеет место экономия денег, которую можно потратить на бухло. А оно действует дольше, и по-совокупности, торкает не хуже.Как бы диагноз понятен? Позволь, Бонифаций, мне высказать тебе тебе свою личную (и всего человечества) бдагодарность за то, что ты - тупой старый дрочер, который не даст своего тупого и бесполезного потомства уже никогда Quote from: Xal0lex on August 25, 2023, 03:31:56 PMА стереть вас очень даже легко, просто забанив за систематическое нарушение правил форума. Так что если продолжите в том же духе, то ваш бан не за горами. Это не угроза, нет. Это просто чтобы вы понимали, что всё возможно.Хотелось бы верить, что это не просто угроза.Наш Бонифаций ничего кроме кучи мусорных топиков на нашем форуме не состоянии сгенерировать от слова \"совсем\".Но, прошу отметить: лично он в этом ваще не виноват.Виноваты лишь его туповатые родители, которые не знали про презервативы.Но и его родители, если подумать, тоже ведь не виноваты ни разу.Во всём виноваты лишь их туповатые родители.И т.д. и т.п. ...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "August 25, 2023, 05:38:53 PM",
      "body": "Quote from: The0ldl_lser on August 25, 2023, 05:34:55 PM^За счет отключения РФ от Свифт надо полагать А ты не полагай, ты на график глянь, там всё предельно наглядно видно за чей счёт весь банкет.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}