{
  "id": "topic_5468519",
  "title": "Bullethead21",
  "author": "Bullethead21",
  "created_time": "September 29, 2023, 07:55:13 AM",
  "content": "Hallo Zusammen,hat einer schon mal etwas dazu gelesen wie es aussehen würde Miner direkt an große Windparks/Solarparks zu hängen?Wahrscheinlich im ersten Step unrentabel wenn man von den wenigen Benutzungsstunden ausgeht, aber vielleicht eine Alternativewenn man die externen Effekte/Kosten mit einrechnen würde?Die Idee kam mir vor längerem schonmal nachdem ich gelesen hatte, dass durch Redispatch Maßnahmen rund 2,3 Mrd Euro verbraten wurden. Dies könnte man sich ja sparen wenn man statt die Anlagen abzuschalten und den Betreiber zu Entschädigen die Anlagen weiter laufen lassen würde und dann Bitcoin Mining betreibt. Das Netz wäre ebenfalls entlastet, man würde sich aber Mrd von Euros der Entschädigung sparen.Gleichzeitig wären die Energiekosten die dann eingesetzt werden würden relativ günstig, da zum einen der großteil entfallen würde aufgrund der Situation, dass kein Netz genutzt würde und damit Netzentgelte unnötig wären.Gibts hierzu schon irgendwo Lesestoff?Ich meine, aktuell ist man in der Diskussion Wasserstoff Elektrolyzer an Windparks zu installieren um die Abschaltungen zu vermeiden und dannin den Einsatzzeiten Wasserstoff zu produzieren. Meiner Meinung nach dürfte der Aufwand und das Invest einen Miner mit ähnlicher Leistungsaufnahme zu realisieren an selbigen Ort geringer sein. Vor allem Frage ich mich hier immer, selbst wenn vor Ort Wasserstoff produziert wird, wie soll dieser abtransportiert werden, die Erdgasbestandsnetze vertragen derweil ja nicht viel von diesem flüchtigen Gas.Beim Bitcoin Mining wäre das Thema abtransport auch nicht notwendig.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468519",
  "comments": [
    {
      "author": "MaxMueller",
      "created_time": "September 29, 2023, 10:26:01 AM",
      "body": "Genau Quote from: Bullethead21 on September 29, 2023, 07:55:13 AMHallo Zusammen,hat einer schon mal etwas dazu gelesen wie es aussehen würde Miner direkt an große Windparks/Solarparks zu hängen?Wahrscheinlich im ersten Step unrentabel wenn man von den wenigen Benutzungsstunden ausgeht, aber vielleicht eine Alternativewenn man die externen Effekte/Kosten mit einrechnen würde?Welche externen Effekte/Faktoren meinst du denn? Ob der Strom nun verschenkt und verbraucht oder gar nicht erst erzeugt wird, macht ja für den Stromerzeuger keinen Unterschied.Und für den Miner lohnt sich der Betrieb ja selbst bei geschenktem Strom nicht dann nicht, wenn er durch stationären Betrieb dann nur auf 500h p.a. kommt. Ich meine aber dazu mal einen Artikel gelesen zu haben, bei dem ein skandinavischer Energieversorger so eine Kooperation mit einer Miningfarm eingegangen ist. Konzept war da die Mining-Container mittels Schiff zu den großen Offshore Windparks zu transportieren und dort während der Bauphase den Strom zu nutzen der mangels Stromleitungen zum Land noch nicht abtransportiert werden konnte. Das war dann aber quasi Dauerbetrieb und nicht nur das entnehmen der Spitzen.Im kleinen Maßstab und an Land (=höhere Transportkosten) kann ich mir nur schwer vorstellen, dass man da ein rentables Konzept hinbekommt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tux1975",
      "created_time": "October 03, 2023, 06:47:14 AM",
      "body": "@Bullethead21Die Frage ist eher wie willst Du den Schaden für den Energiekunden / Steuerzahler vermeiden / reduzieren ,wenn Du keinen Einfluss drauf hast ... Oder anders gesagt, Anlage per RCS in Pause bei voller Bezahlung was besseres kann Dir als Betreiber doch gar nicht passieren   Nun ja ,damit wirst Du höchstens bei älteren kleineren Anlagen & Einzel Betreibern auf Interesse stoßen die vielleicht einen Mining Container aufstellen würden... aber diese betreiben die Wasserstoffhybrid Varianten inzwischen ganz gerne weil es problemlos funktioniert und sie damit ihre Altanlagen wieder Bonusfähig bekommen da flexibel steuerbar. Nächstes Problem dürfte zudem die Internet Anbindung werden weil die meisten WKA Anlagen ja nicht gerade im Stadtzentrum stehen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bullethead21",
      "created_time": "October 04, 2023, 10:23:21 AM",
      "body": "Quote from: tux1975 on October 03, 2023, 06:47:14 AM@Bullethead21Die Frage ist eher wie willst Du den Schaden für den Energiekunden / Steuerzahler vermeiden / reduzieren ,wenn Du keinen Einfluss drauf hast ... Oder anders gesagt, Anlage per RCS in Pause bei voller Bezahlung was besseres kann Dir als Betreiber doch gar nicht passieren   Nun ja ,damit wirst Du höchstens bei älteren kleineren Anlagen & Einzel Betreibern auf Interesse stoßen die vielleicht einen Mining Container aufstellen würden... aber diese betreiben die Wasserstoffhybrid Varianten inzwischen ganz gerne weil es problemlos funktioniert und sie damit ihre Altanlagen wieder Bonusfähig bekommen da flexibel steuerbar. Nächstes Problem dürfte zudem die Internet Anbindung werden weil die meisten WKA Anlagen ja nicht gerade im Stadtzentrum stehen. Meinst Du etwa auf dem Ländle haben wir kein Internet?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}