{
  "id": "topic_5459269",
  "title": "mailsats",
  "author": "mailsats",
  "created_time": "July 10, 2023, 12:33:51 AM",
  "content": "Using a ColdcardI really like this idea... sometimes I can be too paranoid for my own goodSo I bought a Coldcard ( with hardshell case and magnetic usb cable )I sent a few sats, using Sparrow wallet... worked flawlessly... nothing connected... just sign the transaction on device, save to mini sd card, then load that file onto your PC, and into Sparrow to finalize.Are you proud of me?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459269",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "July 10, 2023, 01:09:18 AM",
      "body": "Quote from: mailsats on July 10, 2023, 12:33:51 AMAre you proud of me?Did you do it to impress anyone?Why do you care if anyone is proud of how you set that up? To me, what matters is wallet security. The ability for anyone to be able to control his own wallet without it getting compromised is everything to me. I don't care how it's done. Since you are asking, yes, I will probably be proud of you considering that you might have done something that I have not thought of trying before. But I think I might have come across a similar situation under the technical board, where I asked about questions relating to hardware wallet acquisition and setup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mailsats",
      "created_time": "July 10, 2023, 01:15:44 AMLast edit: July 10, 2023, 01:26:08 AM by mailsats",
      "body": "Quote from: Nwada001 on July 10, 2023, 01:09:18 AMQuote from: mailsats on July 10, 2023, 12:33:51 AMAre you proud of me?Did you do it to impress anyone?Why do you care if anyone is proud of how you set that up? To me, what matters is wallet security. The ability for anyone to be able to control his own wallet without it getting compromised is everything to me. I don't care how it's done. Since you are asking, yes, I will probably be proud of you considering that you might have done something that I have not thought of trying before. But I think I might have come across a similar situation under the technical board, where I asked about questions relating to hardware wallet acquisition and setup.Thank you for being proud of me.Seriously though, I wasn't being that serious with that comment.You are correct that wallet security is all that matters. I think air gapping is a great idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "July 10, 2023, 03:36:21 AM",
      "body": "I actually never heard of this hardware wallet yet and it seems secure what you did however are you sure it’s considered air gapped?You said you saved the signed transaction onto an SD card and you later put that SD card inside a online computer to broadcast. So that’s not air gapped.Air gapped would be if you used QR codes back and forth. Honestly it really shouldn’t matter because it would be very difficult to infect the SD card and hack the Hardware wallet but it’s a precaution you can take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mailsats",
      "created_time": "July 10, 2023, 04:02:28 AM",
      "body": "Quote from: adaseb on July 10, 2023, 03:36:21 AMI actually never heard of this hardware wallet yet and it seems secure what you did however are you sure it’s considered air gapped?You said you saved the signed transaction onto an SD card and you later put that SD card inside a online computer to broadcast. So that’s not air gapped.Air gapped would be if you used QR codes back and forth. Honestly it really shouldn’t matter because it would be very difficult to infect the SD card and hack the Hardware wallet but it’s a precaution you can take.Thanks for telling me about this.I never thought about this... I mean it's a whole new level of paranoia... but... I like it...I think it does give you qr codes, but it has no camera... hmmm .. I know they have a new wallet coming out, the Coldcard Q1, which will  have a camera for scanning qr codes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 10, 2023, 04:27:59 AM",
      "body": "This is the first time I'm hearing about Coldcard hardware wallet, but since it's a hard bitcoin wallet it's better to move the topic to the hard wallets section.In any case, although I do not know the specifications of Coldcard, hard wallets in general are more secure than the rest of the wallet, so it is a good option.The only point that caught my attention is to transfer the transaction to the sd card and then Sparrow to transfer it. You have to pay close attention to cleaning your device from viruses before connecting the sd, otherwise this method becomes dangerous.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "July 12, 2023, 08:07:58 PM",
      "body": "Quote from: mailsats on July 10, 2023, 12:33:51 AMAre you proud of me?Airgapped wallets are great but Coldcard is not the best option in the market today, and devices with camera plus qr codes are much better in my opinion.This is Passport, Keystone, Jade and some DIY devices anyone can make at home (SeedSigner, Krux, etc).There are also few closed source wallet options that are airgapped  but I am not going to recommend that to anyone.If you are interested in topic of AirGapped wallets you can join the conversation here in one of my topics:https://bitcointalk.org/index.php?topic=5361456.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "July 12, 2023, 09:17:56 PM",
      "body": "I'm glad that some have realized the importance of having a good hardware wallet and storing their private keys. I also like the coldcard sparrow pairing although my favorite is always electrum. But even if I understand your happiness in having reached this important milestone, perhaps opening a thread seems too excessive to me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "July 13, 2023, 02:59:50 AM",
      "body": "Insisting the use of QR codes to transfer information would just be unfounded paranoia. Any form of attack with that form of complexity would be quite expensive would require too much effort to execute. Besides, ColdCard doesn't execute any code within the PSBT, should be quite easy to verify that. ColdCard is a great wallet, nothing to worry about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "July 13, 2023, 11:05:10 AM",
      "body": "Quote from: ranochigo on July 13, 2023, 02:59:50 AMInsisting the use of QR codes to transfer information would just be unfounded paranoia. Any form of attack with that form of complexity would be quite expensive would require too much effort to execute. Besides, ColdCard doesn't execute any code within the PSBT, should be quite easy to verify that. ColdCard is a great wallet, nothing to worry about.No one talked about the possibility of losing your coins but about the experience of an air-gapped transaction as it did not happen air-gapped in the case of the SD card. I agree with you about the difficulty and complexity of carrying out such an attack, even if SD card contains viruses, but as an experiment, QR is better and faster, except in cases where it is difficult to convert the signature into a QR code.@OP We are proud of you but keep learning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "July 13, 2023, 11:26:07 AM",
      "body": "Quote from: yhiaali3 on July 10, 2023, 04:27:59 AMThis is the first time I'm hearing about Coldcard hardware wallet, but since it's a hard bitcoin wallet it's better to move the topic to the hard wallets section.In any case, although I do not know the specifications of Coldcard, hard wallets in general are more secure than the rest of the wallet, so it is a good option.The only point that caught my attention is to transfer the transaction to the sd card and then Sparrow to transfer it. You have to pay close attention to cleaning your device from viruses before connecting the sd, otherwise this method becomes dangerous.Coldcard is considerably popular like similar to Ledger and trezor in the hardware wallet cause we don't have to connect the device to internet or even with any device which makes it one of the secured wallet to avoid attacks using the devices we own. But it looks like the technology is evolving like no need of copying the signatures, we can simply do it with QR codes but what OP did is good too and can say really airgapped wallet with coldcard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "July 13, 2023, 12:10:04 PM",
      "body": "Quote from: mailsats on July 10, 2023, 12:33:51 AMAre you proud of me?You should rather be proud of yourself for making the right decision, many have never been presented with such opportunity than to make use of anything they got introduced with by someone close to them, your decision to make use of a hardware cold storage is one of the best means to keep safe, ensure that you keep to this and handle your device well against any form of external damage or loss, then try as much as possible to introduce such to those around you interested to learn from you in like manners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 13, 2023, 04:14:32 PM",
      "body": "Quote from: jrrsparkles on July 13, 2023, 11:26:07 AMColdcard is considerably popular like similar to Ledger and trezor in the hardware wallet cause we don't have to connect the device to internet or even with any device which makes it one of the secured wallet to avoid attacks using the devices we own. But it looks like the technology is evolving like no need of copying the signatures, we can simply do it with QR codes but what OP did is good too and can say really airgapped wallet with coldcard.Thank you in fact I'm familiar with Ledger and trezor , I've never dealt with Coldcard before , I have a trezor wallet model T this model is several years old , so I don't think my wallet has the ability to use QR codes to copy and transfer signatures.In fact, the addition of the QR feature for transferring signatures is a major development towards increasing security so that you can transfer the signature without a cable or Internet connection.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "July 13, 2023, 05:07:33 PM",
      "body": "Quote from: mailsats on July 10, 2023, 12:33:51 AMAre you proud of me?I'm proud of you, even though I don't know much about Coldcard. Completing a transaction using an air-gapped device is very good and the of an SD card to broadcast your transaction on your online PC sounds like a good approach.I'm not exactly sure how the Coldcard works, but I assume it's similar to using an Electrum wallet offline. However, I could be mistaken tho. Regardless, what you did is great but I encourage you to continue learning more about enhancing your security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "July 14, 2023, 12:36:39 AM",
      "body": "The part where you said that save to mini sd card got me worried for you, this isn't how air-gapped crypto wallets works, if anything happens to the sd card it's over for you. Anyways I don't know much about ColdCard but I do know more about Keystone, since someone else verified that ColdCard is a good one then it's no problem, just make sure that no problem comes from your side.Don't empty your mind about wallet enhancement and keep doing more research on how to keep your wallet safe offline, there is no too much knowledge of anything, knowledge is endless.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "July 14, 2023, 02:14:46 AM",
      "body": "Quote from: mailsats on July 10, 2023, 12:33:51 AMAre you proud of me?Lol, no but I thank you for sharing your experience with one of the more popular replacements for Ledger devices.  It might not be the best option, as dkbit98 said, but I've been reading threads on the Ledger subreddit and there are a lot of people discussing what they've replaced their Ledgers with (and that's funny given that that subreddit ought to be pro-Ledger).  Good luck with it.  I've never used one of the QR code reader HW wallets, but I was thinking about getting a Keystone and might have to learn.Quote from: adaseb on July 10, 2023, 03:36:21 AMYou said you saved the signed transaction onto an SD card and you later put that SD card inside a online computer to broadcast. So that’s not air gapped.I thought the SD card was only used for firmware updates, not for sending coins or signing messages.  It could be I'm thinking of a similar wallet, but I've never heard of a HW wallet that works that way.  That would be an enormous pain in the ass.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "July 14, 2023, 04:00:52 AM",
      "body": "Quote from: The Sceptical Chymist on July 14, 2023, 02:14:46 AMI thought the SD card was only used for firmware updates, not for sending coins or signing messages.  It could be I'm thinking of a similar wallet, but I've never heard of a HW wallet that works that way.  That would be an enormous pain in the ass.SD Card is just a way to transmit information, and technically anything that allows for a bidirectional transmission would suffice as a medium for transfer of signed and unsigned transactions. You can connect your computer directly to ColdCard through MicroUSB but SD card is just an alternative. IMO, it's just as about convenient as using a USB cable and the transfer is done in a jiffy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "July 14, 2023, 06:12:32 AM",
      "body": "Quote from: mailsats on July 10, 2023, 12:33:51 AMUsing a ColdcardI really like this idea... sometimes I can be too paranoid for my own goodSo I bought a Coldcard ( with hardshell case and magnetic usb cable )I sent a few sats, using Sparrow wallet... worked flawlessly... nothing connected... just sign the transaction on device, save to mini sd card, then load that file onto your PC, and into Sparrow to finalize.Are you proud of me?If you hadn't done it before then good for you, at least the experience is now under your belt and thanks for sharing, others too might try this one out and see how it goes for them.In seems though that for beginners, it looks like it's a complicated process. So maybe it's better to just try for a few sats and see how it goes for you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "July 14, 2023, 10:47:30 AM",
      "body": "Quote from: Dave1 on July 14, 2023, 06:12:32 AMIn seems though that for beginners, it looks like it's a complicated process. So maybe it's better to just try for a few sats and see how it goes for you.They can try to familiarise how it works with other tools like Electrum with an air-gapped setup before they buy a dedicated wallet for this kind of setup IMO. The cost might be lower depending on what tools are available to them (an unused PC or phone, a live OS on a USB stick, and so on). Maybe I'm just more familiar with it but I don't think it is that complicated unless you don't know anything about making transactions with Bitcoin. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "July 14, 2023, 10:56:10 AM",
      "body": "Quote from: mendace on July 12, 2023, 09:17:56 PMI'm glad that some have realized the importance of having a good hardware wallet and storing their private keys. I also like the coldcard sparrow pairing although my favorite is always electrum. But even if I understand your happiness in having reached this important milestone, perhaps opening a thread seems too excessive to meI think the OP just wanted to share his experience though he just didn't say it well because he seems to rush when he created his thread and most users didn't get his point. Maybe if he could just share his experience with some kinds of tutorials on how to easily do it, I guess he will earn himself some huge numbers of positive responses. nevertheless, I know how it feels when you finally reached another milestone in your crypto journey and it seems like you are ready now to secure a huge amount of bitcoins in the future if you happened to get them in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}