{
  "id": "topic_5398418",
  "title": "GrLinkey",
  "author": "GrLinkey",
  "created_time": "May 13, 2022, 06:18:33 AM",
  "content": "Здравствуйте,Раньше я писал на этом форуме под ником Aposeopesis, и меня забанили за плагиат:https://bitcointalk.org/index.php?topic=5366102.msg58199864#msg58199864http://forum.chemigrant.com/viewtopic.php?f=2&t=119803???history=0&pfid=1&sample=5&ref=1На самом деле я продублировал собственный пост с другого форума. Я пытаюсь стать блогером, пока не очень получается, и я создаю одинаковые посты на разных форумах, например на форумах программистов.Вот мой сайт и блог:https://grandrienko.comhttps://grandrienko.livejournal.comЕсли вы прочитаете мои статьи, вы убедитесь что я автор этих постов на форумах, потому что они достаточно похожи. У меня получается генерировать разные идеи, и в каждой статье излагается какая-то новая идея.Извиняюсь если выбрал не тот раздел, нужно ли мне продублировать этот пост в административном разделе на английском?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5398418",
  "comments": [
    {
      "author": "xandry",
      "created_time": "May 13, 2022, 07:53:57 AM",
      "body": "Quote from: GrLinkey on May 13, 2022, 06:18:33 AMЕсли вы прочитаете мои статьи, вы убедитесь что я автор этих постов на форумах, потому что они достаточно похожи.Ещё раз: что конкретно в вашем блоге может доказать, то что аккаунт или текст на другом форуме принадлежит вам?Мы с вами общались по этому поводу и вам достаточно было бы просто как-то обозначить, что аккаунт на форуме, откуда был скопирован текст, принадлежит вам. Казалось бы дело на пару минут: отредактировать там текст и добавить ссылку на блог или скриншот выложить из ЛК форума, можно ссылку дать на старую запись в блоге, где вы про тот форум пишете.Попробуйте самостоятельно прогнать текст на проверку плагиата, покажет лишь другой форум, более ранних ссылок на ваш блог не находится.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "May 13, 2022, 10:07:28 AM",
      "body": "Quote from: xandry on May 13, 2022, 07:53:57 AMQuote from: GrLinkey on May 13, 2022, 06:18:33 AMЕсли вы прочитаете мои статьи, вы убедитесь что я автор этих постов на форумах, потому что они достаточно похожи.Ещё раз: что конкретно в вашем блоге может доказать, то что аккаунт или текст на другом форуме принадлежит вам?Ну пожалуйста: завтра я на форуме chemigrant.com создам тему \"Русская 'Идиократия'\" под своим ником Vit Nhoc. Сейчас тут этой темы нет:http://forum.chemigrant.com/viewforum.php?f=10Текст будет про отрицательный естественный отбор при тоталитаризме. Устроит так?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 13, 2022, 01:00:05 PM",
      "body": "Quote from: GrLinkey on May 13, 2022, 10:07:28 AMНу пожалуйста: завтра я на форуме chemigrant.com создам тему \"Русская 'Идиократия'\" под своим ником Vit Nhoc. Сейчас тут этой темы нет:http://forum.chemigrant.com/viewforum.php?f=10Текст будет про отрицательный естественный отбор при тоталитаризме. Устроит так?Не знаю как насчёт завтра, но сегодня меня форум встречает вот такой заставкой:Ну и так, к слову P.S. Вы можете дать ссылку вашего профиля на форуме chemigrant?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "May 13, 2022, 02:00:10 PM",
      "body": "Quote from: Ratimov on May 13, 2022, 11:48:42 AMМне вот интересно, человек был забанен в прошлом году, в этом году создал новый аккаунт по-тихому и продолжил свободно общаться в локале, не создав не единого поста в мете с апелляцией, как того требуют правила. А если этот вопрос с плагиатом не решится, пользователь GrLinkey также свободно продолжит общаться в локале, несмотря на то, что это чистый п.25 правил, уклонение от бана?Извините, я правила не читал. Сейчас пытался их найти и не смог.Мне форум предложил перевести немного биткоинов для разблокировки моего ip, я это сделал и завёл новый аккаунт, думал тут за деньги разбанивают (или это типа налог).Quote from: Xal0lex on May 13, 2022, 01:00:05 PMНе знаю как насчёт завтра, но сегодня меня форум встречает вот такой заставкой:Да, у меня это сегодня тоже появилось, а с VPN на форум сейчас выхожу.Quote from: Xal0lex on May 13, 2022, 01:00:05 PMНу и так, к слову На форуме gamedev.ru админ специфичный. Не хочу писать подробнее, т.к. боюсь вдруг он прочитает.Quote from: Xal0lex on May 13, 2022, 01:00:05 PMP.S. Вы можете дать ссылку вашего профиля на форуме chemigrant?http://forum.chemigrant.com/memberlist.php?mode=viewprofile&u=61447",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "May 13, 2022, 02:23:58 PM",
      "body": "Quote from: Xal0lex on May 13, 2022, 01:00:05 PMНе знаю как насчёт завтра, но сегодня меня форум встречает вот такой заставкой:У меня открывается, хотя и ругается браузер, что без SSL соединение. Зарегистрировал на другом форуме тестовый аккаунт и попросил пользователя отправить мне сообщение в личку, вопрос принадлежности ему того аккаунта, считаю, можно считать закрытым и подавать заявку на разбан.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 13, 2022, 02:36:46 PM",
      "body": "Quote from: xandry on May 13, 2022, 02:03:58 PMQuote from: Xal0lex on May 13, 2022, 01:00:05 PMНе знаю как насчёт завтра, но сегодня меня форум встречает вот такой заставкой:https://i.imgur.com/F7n3uFU.pngУ меня открывается, хотя и ругается браузер, что без SSL соединение.Ну да, у меня включена функция разрешать только сайты https://  Выключил и зашёл.Quote from: GrLinkey on May 13, 2022, 02:00:10 PMИзвините, я правила не читал. Сейчас пытался их найти и не смог.Как можно не заметить я даже не представляю. Темы практически рядом.Quote from: GrLinkey on May 13, 2022, 02:00:10 PMQuote from: Xal0lex on May 13, 2022, 01:00:05 PMНу и так, к слову https://i.imgur.com/3jTVCpA.pngНа форуме gamedev.ru админ специфичный. Не хочу писать подробнее, т.к. боюсь вдруг он прочитает.Ну да, ну да. Весь мир против меня. Другого ответа я и не ожидал Quote from: GrLinkey on May 13, 2022, 02:00:10 PMQuote from: Xal0lex on May 13, 2022, 01:00:05 PMP.S. Вы можете дать ссылку вашего профиля на форуме chemigrant?http://forum.chemigrant.com/memberlist.php?mode=viewprofile&u=61447Чтобы посмотреть ваш профиль, нужно регистрироваться на форуме. Сказать об этом трудно?Вот объясните мне вашу логику. На том форуме смотрим ваши топики:1. Мистика в истории. Ссылка на источник присутствует;2. О европейских революциях. Ссылка на источник присутствует;3. О войнах, деградации и мизантропии. Ссылка на источник присутствует.Значит там вы посчитали нужным указать ссылки на источник. Чем же этот форум так плох, что вы не удосужились указать источник? Тем более, что пост размещён здесь гораздо позже, чем на том форуме.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "May 13, 2022, 03:10:09 PMLast edit: May 13, 2022, 03:40:12 PM by Xal0lex",
      "body": "Quote from: Xal0lex on May 13, 2022, 02:36:46 PMВот объясните мне вашу логику. На том форуме смотрим ваши топики:1. Мистика в истории. Ссылка на источник присутствует;2. О европейских революциях. Ссылка на источник присутствует;3. О войнах, деградации и мизантропии. Ссылка на источник присутствует.Значит там вы посчитали нужным указать ссылки на источник. Чем же этот форум так плох, что вы не удосужились указать источник? Тем более, что пост размещён здесь гораздо позже, чем на том форуме.Потому что ссылка на источник - это ссылка на мою статью на сайте grandrienko.com. А когда мне приходят идеи, недостаточно проработанные чтобы писать по ним отдельную статью, я пишу только посты на форумах.Quote from: xandry on May 13, 2022, 02:23:58 PMУ меня открывается, хотя и ругается браузер, что без SSL соединение. Зарегистрировал на другом форуме тестовый аккаунт и попросил пользователя отправить мне сообщение в личку, вопрос принадлежности ему того аккаунта, считаю, можно считать закрытым и подавать заявку на разбан.Что касается разбана, мне больше нравится ник GrLinkey чем Aposeopesis, т.е. к старому нику я возвращаться не хочу, но если под старым аккаунтом накопилась какая-то карма/репутация, я хотел бы её подключить к новому нику. Извините, я очень бестолковый и не знаю, есть ли на этом форуме карма или репутация, и что она даёт, так что может быть я прошу ни о чём.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 13, 2022, 03:34:55 PM",
      "body": "Quote from: GrLinkey on May 13, 2022, 03:10:09 PMQuote from: Xal0lex on May 13, 2022, 02:36:46 PMВот объясните мне вашу логику. На том форуме смотрим ваши топики:1. Мистика в истории. Ссылка на источник присутствует;2. О европейских революциях. Ссылка на источник присутствует;3. О войнах, деградации и мизантропии. Ссылка на источник присутствует.Значит там вы посчитали нужным указать ссылки на источник. Чем же этот форум так плох, что вы не удосужились указать источник? Тем более, что пост размещён здесь гораздо позже, чем на том форуме.Потому что ссылка на источник - это ссылка на мою статью на сайте grandrienko.com. А когда мне приходят идеи, недостаточно проработанные чтобы писать по ним отдельную статью, я пишу только посты на форумах.Это отговорка. Я задал конкретный вопрос. Идеи, статьи, посты - не важно. Если вы размещаете на этом форуме текст и он присутствует где либо в интернете, причём размещённый гораздо раньше, нужно указывать ссылку. Авторский текст, не авторский... Без разницы. Чтобы не возникало вот таких вот ситуаций.Думаете, по каждому случаю модераторы будут проверять принадлежит ли тот или иной профиль кому-то где-то там, в интернете? Нет, конечно. А так, была бы ссылка и вопросов бы не возникло.Quote from: GrLinkey on May 13, 2022, 03:33:29 PMЧто касается разбана, мне больше нравится ник GrLinkey чем Aposeopesis, т.е. к старому нику я возвращаться не хочу, но если под старым аккаунтом накопилась какая-то карма/репутация, я хотел бы её подключить к новому нику. Извините, я очень бестолковый и не знаю, есть ли на этом форуме карма или репутация, и что она даёт, так что может быть я прошу ни о чём.Такое на форуме невозможно. Я правильно понял, что снимать бан с вашего старого профиля Aposeopesis не нужно?P.S. И прочтите пожалуйста, хотя бы бегло, правила форума. Особенно пункт 32",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "May 13, 2022, 06:03:39 PM",
      "body": "QuoteЭто отговорка. Я задал конкретный вопрос. Идеи, статьи, посты - не важно. Если вы размещаете на этом форуме текст и он присутствует где либо в интернете, причём размещённый гораздо раньше, нужно указывать ссылку. Авторский текст, не авторский... Без разницы. Чтобы не возникало вот таких вот ситуаций.Думаете, по каждому случаю модераторы будут проверять принадлежит ли тот или иной профиль кому-то где-то там, в интернете? Нет, конечно. А так, была бы ссылка и вопросов бы не возникло.Объясняю ещё раз: я не могу дать ссылку в посте, потому что мне не на что ссылаться. Я в посте излагаю какую-то идею, и это занимает пару абзацев, больше ссылаться не на что.Пример: у меня есть идея, что в чатах работает \"Закон Парето\": грубо говоря, 20% участников пишут 80% постов, остальные 80% участников пишут 20% постов. Причём первые 20% участников всегда навязывают остальным неинтересный формат, например срутся друг с другам, а \"80-процентникам\" это наблюдать неинтересно. Эту идею я изложил на нескольких форумах, включая этот:https://bitcointalk.org/index.php?topic=5396479.msg59989914#msg59989914https://www.woman.ru/psycho/socialization/thread/5628515/https://mathhelpplanet.com/viewtopic.php?f=57&t=77232https://gamedev.ru/flame/forum/?id=268676https://forum.ixbt.com/topic.cgi?id=77:23901https://forum.guns.ru/forummessage/68/2784663.htmlЯ надеюсь, такое поведения нельзя назвать спамом, поскольку на каждом форуме никто особо против моих постов не возражает. Мне кажется, если рассказать какую то идею достаточному количеству человек (критической массе), произойдёт качественный скачок и эту идею поймут все. Это называется эффект сотой обезьяны, не знаю верите ли вы в это.Про разбан: я прошу всё-таки разбавить аккаунт Aposeopesis, чтобы я мог подписаться \"GrLinkey aka Aposeopesis\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 13, 2022, 06:30:33 PM",
      "body": "Quote from: GrLinkey on May 13, 2022, 06:03:39 PMQuoteЭто отговорка. Я задал конкретный вопрос. Идеи, статьи, посты - не важно. Если вы размещаете на этом форуме текст и он присутствует где либо в интернете, причём размещённый гораздо раньше, нужно указывать ссылку. Авторский текст, не авторский... Без разницы. Чтобы не возникало вот таких вот ситуаций.Думаете, по каждому случаю модераторы будут проверять принадлежит ли тот или иной профиль кому-то где-то там, в интернете? Нет, конечно. А так, была бы ссылка и вопросов бы не возникло.Объясняю ещё раз: я не могу дать ссылку в постеВы что, действительно не понимаете, что я написал? Или вы притворяетесь?Ещё раз внимательно перечитайте фразу:Если вы размещаете на этом форуме текст и он присутствует где либо в интернете, причём размещённый гораздо раньше, нужно указывать ссылку. Авторский текст, не авторский... Без разницы. Чтобы не возникало вот таких вот ситуаций.А теперь посмотрите сейчас на ваш топик. Сразу нельзя было вот так сделать, не? https://bitcointalk.org/index.php?topic=5366102Quote from: GrLinkey on May 13, 2022, 06:03:39 PMПро разбан: я прошу всё-таки разбавить аккаунт Aposeopesis, чтобы я мог подписаться \"GrLinkey aka Aposeopesis\".xandry уже подал заявку.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "May 14, 2022, 03:02:39 AM",
      "body": "Quote from: Xal0lex on May 13, 2022, 06:30:33 PMВы что, действительно не понимаете, что я написал? Или вы притворяетесь?Ещё раз внимательно перечитайте фразу:Если вы размещаете на этом форуме текст и он присутствует где либо в интернете, причём размещённый гораздо раньше, нужно указывать ссылку. Авторский текст, не авторский... Без разницы. Чтобы не возникало вот таких вот ситуаций.А теперь посмотрите сейчас на ваш топик. Сразу нельзя было вот так сделать, не? https://bitcointalk.org/index.php?topic=5366102Ну и какой смысл в этой ссылке на chemigrant, если там точно то же самое что в посте? А если я разместил пост на десяти форумах, на них всех надо ссылаться? Я не понимаю вашей логики.Ещё раз: если на десяти форумах можно найти одинаковый мой пост, логично предположить что их создал один человек, а не так что первый написал от себя а второй сплагиатил на девяти оставшихся форумах. Теме более что ники часто совпадают.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "~DefaultTrust",
      "created_time": "May 14, 2022, 08:41:33 AM",
      "body": "Quote from: GrLinkey on May 14, 2022, 03:02:39 AMQuote from: Xal0lex on May 13, 2022, 06:30:33 PMВы что, действительно не понимаете, что я написал? Или вы притворяетесь?Ещё раз внимательно перечитайте фразу:Если вы размещаете на этом форуме текст и он присутствует где либо в интернете, причём размещённый гораздо раньше, нужно указывать ссылку. Авторский текст, не авторский... Без разницы. Чтобы не возникало вот таких вот ситуаций.А теперь посмотрите сейчас на ваш топик. Сразу нельзя было вот так сделать, не? https://bitcointalk.org/index.php?topic=5366102Ну и какой смысл в этой ссылке на chemigrant, если там точно то же самое что в посте? А если я разместил пост на десяти форумах, на них всех надо ссылаться? Я не понимаю вашей логики.Ещё раз: если на десяти форумах можно найти одинаковый мой пост, логично предположить что их создал один человек, а не так что первый написал от себя а второй сплагиатил на девяти оставшихся форумах. Теме более что ники часто совпадают.Когда вы на десятке форумов постите один и тот же текст, то это называется \"спам\". Многие админы такого не любят даже если есть ссылка на оригинал. Со ссылкой даже хуже - это будет очевидный ссылочный спам, предназначенный не для прочтения и обсуждения посетителями форума, а для индексации поисковиками. Нормальные админы нормальных форумов заботятся о том, чтобы у них писали реальные люди, а не автоботы от школоспаммеров.Ну и так, на всякий случай, для тех кто из анабиоза: за прошедшие двадцать лет, поисковики, из наколеночных программулек, превратились в мощные системы искусственного интеллекта. Ваши примитивные методы раскрутки их не обманут.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "May 14, 2022, 09:23:14 AM",
      "body": "Quote from: Xal0lex on May 13, 2022, 06:30:33 PMЕсли вы размещаете на этом форуме текст и он присутствует где либо в интернете, причём размещённый гораздо раньше, нужно указывать ссылку. Авторский текст, не авторский... Без разницы. Чтобы не возникало вот таких вот ситуаций.А, так это правила форума? Я сходу здесь этого не нашёл.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "May 14, 2022, 09:31:47 AM",
      "body": "Quote from: GrLinkey on May 14, 2022, 09:23:14 AMА, так это правила форума? Я сходу здесь этого не нашёл.Шутите что ли так? Там есть 33-й пункт про плагиат про который выше пишет Xal0lex. И прям подробное примечание ниже:Quote from: xandry on March 17, 2015, 06:10:35 PM33. Заниматься плагиатом запрещено.Плагиат запрещён, в том числе в виде копирования, либо перефразирования чужих сообщений или текстов из сети Интернет. Если выкладываете копипасту, то обязательно указывайте ссылку на источник. Допускается использование текста со сторонних источников, если вы упоминаете об этом и/или выделяете чужой текст каким-либо образом отдельно от ваших слов. Публикация новостей о bitcoin только - в разделе \"Новости\"; об \"альтернативных криптовалютах\" - в соответствующем разделе, в соответствующих темах; В иных случаях, если копируете текст из Интернета, помимо ссылки на источник, следует поделиться вашим конструктивным мнением об этом, поэтому если вам нечего сказать, то и публиковать чужие тексты незачем.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "May 14, 2022, 11:43:47 AM",
      "body": "Quote from: xandry on May 14, 2022, 09:31:47 AMQuote from: GrLinkey on May 14, 2022, 09:23:14 AMА, так это правила форума? Я сходу здесь этого не нашёл.Шутите что ли так? Там есть 33-й пункт про плагиат про который выше пишет Xal0lex. И прям подробное примечание ниже:Quote from: xandry on March 17, 2015, 06:10:35 PM33. Заниматься плагиатом запрещено.Плагиат запрещён, в том числе в виде копирования, либо перефразирования чужих сообщений или текстов из сети Интернет. Если выкладываете копипасту, то обязательно указывайте ссылку на источник. Допускается использование текста со сторонних источников, если вы упоминаете об этом и/или выделяете чужой текст каким-либо образом отдельно от ваших слов. Публикация новостей о bitcoin только - в разделе \"Новости\"; об \"альтернативных криптовалютах\" - в соответствующем разделе, в соответствующих темах; В иных случаях, если копируете текст из Интернета, помимо ссылки на источник, следует поделиться вашим конструктивным мнением об этом, поэтому если вам нечего сказать, то и публиковать чужие тексты незачем.Ну тут же чётко написано - чужие сообщения, чужие тексты. А у меня собственные.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xandry",
      "created_time": "May 14, 2022, 12:01:55 PM",
      "body": "Quote from: GrLinkey on May 14, 2022, 11:43:47 AMНу тут же чётко написано - чужие сообщения, чужие тексты. А у меня собственные.В том то и дело, что вы никак не обозначаете своё авторство на вышеперечисленных форумах, к тому же пишете под разными никами. Хотя бы подпись какую-нибудь бы придумали тогда с псевдонимом.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "May 14, 2022, 12:15:17 PM",
      "body": "Quote from: GrLinkey on May 14, 2022, 11:43:47 AMНу тут же чётко написано - чужие сообщения, чужие тексты. А у меня собственные.Это уже до смешного доходит  Вы или действительно не понимаете, о чём идёт речь, или просто решили заняться троллингом.Кто кроме ВАС в этом мире и, в частности, на этом форуме знает, что размещённый на форуме текст принадлежит именно ВАМ? Кто кроме ВАС знает, что профиль на том форуме принадлежит именно ВАМ? Если вы не понимаетет этого, то я вам скажу - никто. Здесь нет ясновидящих.Модератор получил репорт на плагиат. Ссылка на источник в репорте есть. Получите бан. Проверять, принадлежит ли вам профиль на другом форуме, который разместил такой же текст, никто не будет. Вот для этого и нужно указывать ссылку на более раннее размещение ВАШЕГО текста где либо в другом месте в интернете.Хух. Если и сейчас не поймёте, я умываю руки Quote from: xandry on May 14, 2022, 12:01:55 PMВ том то и дело, что вы никак не обозначаете своё авторство на вышеперечисленных форумах, к тому же пишете под разными никами. Хотя бы подпись какую-нибудь бы придумали тогда с псевдонимом.Полностью согласен.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "May 16, 2022, 03:46:33 PM",
      "body": "Quote from: GrLinkey on May 14, 2022, 11:43:47 AMНу тут же чётко написано - чужие сообщения, чужие тексты. А у меня собственные.Не важно чей текст чужой иди ваш собственный, но с другого ресурса: текст нужно выделить каким-либо образом. Либо дать на него прямую ссылку, либо обозначить самоцитированием, либо просто выделить курсивом. Все нормальные авторы так делают, ибо это стилистически и логически правильно. Даже когда автор пишет книгу и в ней приводит свои собственные цитаты из других своих книг, то он это четко обозначает. Он может написать название книги или ресурса, или просто выделит текст другим шрифтом. Представьте, если он будет заниматься скрытым самокопированием в каждой книге, тупо перенося целые главы в другие книги: да его посчитают шарлатаном, мошенником и любителем легкой наживы! Это немыслимо и должно пресекаться на корню. Этот форум и так достаточно заспамлен, чтобы тащить сюда обезличенные куски текста с других форумов: просто играйте по правилам и к вам не будет никаких претензий.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GrLinkey",
      "created_time": "May 17, 2022, 06:15:51 AM",
      "body": "Quote from: ~DefaultTrust on May 14, 2022, 08:41:33 AMКогда вы на десятке форумов постите один и тот же текст, то это называется \"спам\". Многие админы такого не любят даже если есть ссылка на оригинал. Со ссылкой даже хуже - это будет очевидный ссылочный спам, предназначенный не для прочтения и обсуждения посетителями форума, а для индексации поисковиками. Нормальные админы нормальных форумов заботятся о том, чтобы у них писали реальные люди, а не автоботы от школоспаммеров.Полагаю, всё будет определяться тем, насколько мои темы интересны или полезны участникам каждого форума. Я делаю посты на нескольких десятках форумов, и пока меня забанили только на трёх.Кстати, из всех форумов только на bitcointalk такое трепетное отношение к плагиату. Ну я понимаю конечно что в чужой монастырь со своим уставом не лезут.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}