{
  "id": "topic_5432092",
  "title": "Jennifer Walters",
  "author": "Jennifer Walters",
  "created_time": "December 28, 2022, 01:42:06 AM",
  "content": "This man is very busy   but now he will stop reproducing. But is this too many?https://www.dailystar.co.uk/news/world-news/man-102-children-orders-12-28819130",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432092",
  "comments": [
    {
      "author": "mich",
      "created_time": "December 30, 2022, 07:51:18 AM",
      "body": "This man certainly ‘doesn’t believe in television’. If he did, he would have at least watched a documentary on the history of the Mormons and polygamy. He would have at least stopped having kids earlier in life. He would have seen ‘The Brady Bunch’ six children were more than a handful.  At age 67 has 102 children and someone is bound to take good care of him, especially if he has health issues. Absolutely contraception will stop his growing family. Education should be instilled upon those children and a whole lot of psychiatric evaluations should start immediately. This can help them financially and their education can be used to have a better job. This can maintain the family farm for many years to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ModestyKK",
      "created_time": "December 30, 2022, 08:54:24 AM",
      "body": "That must be too much. He can no longer afford the expenses of the children. It would be irresponsible if the children are born but cannot be properly raised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "December 30, 2022, 09:06:38 AM",
      "body": "He may want to create a cult     I hope for this guy that this is not true.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "December 30, 2022, 11:17:12 AM",
      "body": "I think this guy needs to slow down & find a hobby. Maybe a vasectomy is in order, he is lucky he doesn’t live in a First World country because child welfare payments would bankrupt him.Seriously we can all have a laugh & a joke about this but we have responsibilities in life. Having children is a gift, I think our Ugandan friend needs to put something on the end of it if he wants to continue his life of promiscuity & debauchery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fretum",
      "created_time": "December 30, 2022, 02:41:19 PM",
      "body": "Quote from: DeathAngel on December 30, 2022, 11:17:12 AMI think this guy needs to slow down & find a hobby. Maybe a vasectomy is in order, he is lucky he doesn’t live in a First World country because child welfare payments would bankrupt him.Seriously we can all have a laugh & a joke about this but we have responsibilities in life. Having children is a gift, I think our Ugandan friend needs to put something on the end of it if he wants to continue his life of promiscuity & debauchery. I think he has already found a hobby and he is even very good at it  You said it yourself, he lives in a completely different society - many children are good because they have to take care of you in old age. There are not only no child welfare payments but also no pension payments. Somehow you have to be able to live in old age. This is not only the case in Africa, but also in many Asian countries. Maybe he exaggerated a little:)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}