{
  "id": "topic_5434252",
  "title": "GitSwarm",
  "author": "GitSwarm",
  "created_time": "January 11, 2023, 05:58:00 PMLast edit: January 14, 2023, 08:20:41 PM by GitSwarm",
  "content": "Hello everyone,We are announcing the alpha stage of our project, GitSwarm.com.GitSwarm aims to provide an all-in-one platform for project owners, freelancers, and investors to connect and collaborate on projects. Since we are in Alpha, we are using our private Ethereum testnet and you can get testnet ether for safely trying out our features. You can create and manage private or public projects, with ownership and voting power determined by the percentage of the project's token owned. We connect project owners, freelancers, and investors, offering features such as the ability to create and use ERC-20 tokens for governance, the ability to create proposals that impact the direction of projects, the ability to assign roles and permissions, automated payrolls, and auctions for raising funds. The platform also offers a job board for project owners to post job listings for developers and contributors. It's also a great tool for boosting your project's visibility by having it listed on our index.Project funds are stored in open source smart contracts. We have made them public on https://github.com/GitSwarmOrg/contracts. Moving project funds can only be done through proposals.Project management is a breeze with our kanban-style board task system (like Trello) and time tracking features. In the near future we plan on implementing two-way syncing with Trello boards and/or Github issues for task management with GitSwarm.Our website's roadmap will keep you up to date with upcoming features, but do subscribe to our newsletter to receive future announcements.Keep in touch using our Discord server and Twitter.We're looking forward to our mainnet launch after more in-depth security audits of our contracts.Any feedback is appreciated.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434252",
  "comments": []
}