{
  "id": "topic_5406647",
  "title": "throwaway_help",
  "author": "throwaway_help",
  "created_time": "July 17, 2022, 06:06:54 PM",
  "content": "Not sure if the title explains it, but I've been tasked with finding a launchpad for our project that charges money but so far, I find all those crazy requirements and no talk about money at all, for us, it'd be easier to pay a fee and work on our project gradually than try to fix everything before being allowed into a launchpad or any similar platform.If anyone can point me in the right direction this would be so nice.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406647",
  "comments": [
    {
      "author": "JeromeTash",
      "created_time": "July 17, 2022, 09:30:46 PM",
      "body": "Quote from: throwaway_help on July 17, 2022, 06:06:54 PMNot sure if the title explains it, but I've been tasked with finding a launchpad for our project that charges money but so far, I find all those crazy requirements and no talk about money at all, for us, it'd be easier to pay a fee and work on our project gradually than try to fix everything before being allowed into a launchpad or any similar platform.If anyone can point me in the right direction this would be so nice. It kind of makes sense when the launchpads need a project to fulfil certain requirements rather than just money, which is an easy way out for scammers who create fake projects.If your project can go through the required criteria, then it does not deserve to be listed anywhere.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "July 18, 2022, 09:09:47 AM",
      "body": "Quote from: throwaway_help on July 17, 2022, 06:06:54 PMNot sure if the title explains it, but I've been tasked with finding a launchpad for our project that charges money but so far, I find all those crazy requirements and no talk about money at all, for us, it'd be easier to pay a fee and work on our project gradually than try to fix everything before being allowed into a launchpad or any similar platform...If you do not intend to change anything in your project, then you can independently list on a decentralized exchange. But in this case, you will need to independently bear the costs associated with the promotion of your project, which will be difficult to do without qualified management.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erep",
      "created_time": "July 18, 2022, 10:37:40 AM",
      "body": "Quote from: tvplus006 on July 18, 2022, 09:09:47 AMIf you do not intend to change anything in your project, then you can independently list on a decentralized exchange. But in this case, you will need to independently bear the costs associated with the promotion of your project, which will be difficult to do without qualified management.Trying to find alternative to registering on the launchpad dex is not the best solution than not fixing anything in the whitepaper that meets the standard requirements of the popular launchpad application. If the token uses the smartchan network (bsc), then the alternative can be to learn from the requirements on the pinksale, some projects on the top launchpad list on average have received funds of up to thousands of BNB collected from investor funding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "July 18, 2022, 10:44:05 AM",
      "body": "Quote from: tvplus006 on July 18, 2022, 09:09:47 AMQuote from: throwaway_help on July 17, 2022, 06:06:54 PMNot sure if the title explains it, but I've been tasked with finding a launchpad for our project that charges money but so far, I find all those crazy requirements and no talk about money at all, for us, it'd be easier to pay a fee and work on our project gradually than try to fix everything before being allowed into a launchpad or any similar platform...If you do not intend to change anything in your project, then you can independently list on a decentralized exchange. But in this case, you will need to independently bear the costs associated with the promotion of your project, which will be difficult to do without qualified management.They really need some sacrifice because successful projects came from the team that already paid some huge amount of cash for their promotions because you need to work on promoting your project before the actual launch and it really requires a insane amount of money cause you need to pay for everybody involves promoting it. Most of the time when the project is competitive enough to make it to the crypto market, it also needs to be promoted to other social media as well as some crypto communities like this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}