{
  "id": "topic_5462209",
  "title": "teoliya33",
  "author": "teoliya33",
  "created_time": "August 05, 2023, 10:07:25 PM",
  "content": "Hello everybodyThe first I heard about Bitcoin when a big organization hack some platform and ask to get paid by bitcoinof course everything comes with a reason but isn't Bitcoin a Heaven for Hackers as well?Im not against it its just i hear here and there that they create BTC for that purpose in the first place so they can get paid anonymously !! even governments and their spies  !! send payment to killers and cuts deals in the black market and so on.So .. even if Bitcoin saves us from the bank's thieves and governments who control our money system still their are many mysteries about it I love bitcoin and i think its the best currency ever !! its helps !! it's fast and all of that but still I'm afraid of this DARK side of it Can someone make me calm about it ? maybe i think too much or maybe im wrong please dont judge me.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462209",
  "comments": [
    {
      "author": "Coyster",
      "created_time": "August 05, 2023, 10:34:58 PM",
      "body": "Quote from: teoliya33 on August 05, 2023, 10:07:25 PMThe first I heard about Bitcoin when a big organization hack some platform and ask to get paid by bitcoinof course everything comes with a reason but isn't Bitcoin a Heaven for Hackers as well?Bitcoin can be used by absolutely anybody, it is free and there is no censorship in the network, hackers and criminals also use other payment options, including fiat/cash.Quote from: teoliya33 on August 05, 2023, 10:07:25 PMIm not against it its just i hear here and there that they create BTC for that purpose in the first place so they can get paid anonymously !! even governments and their spies  !! send payment to killers and cuts deals in the black market and so on.The bitcoin blockchain is open, so you cannot get paid in Bitcoin anonymously, the blockchain can be analysed by chain analysis corporations and transactions can be tracked to the people who made them if the coins are in one way or another tied to their identity. Having said that, cash would be the most convenient way to pay for what you mentioned above and not Bitcoin, yet somehow people are more concerned about Bitcoin being used for illicit activities than cash.Quote from: teoliya33 on August 05, 2023, 10:07:25 PMSo .. even if Bitcoin saves us from the bank's thieves and governments who control our money system still their are many mysteries about it I love bitcoin and i think its the best currency ever !! its helps !! it's fast and all of that but still I'm afraid of this DARK side of it There are no dark sides to it, and the only mystery is we are yet to find out who Satoshi is. The thing is, Bitcoin is a currency used for payments like every other currency, the network does not police who uses it or for what purpose, as long as they are following the networks rules and have a valid signature to make transaction, then they can use Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 05, 2023, 10:55:06 PM",
      "body": "I don't know what you mean by the dark side of Bitcoin but I don't see that Bitcoin is heaven for hackers(like the above said hackers can also do it on fiat/cash) it is just likely the same as Fiat which you can use anywhere online the difference is Bitcoin does not have physical currency compared to fiat and Bitcoin does not controlled by governments due to decentralization.Bitcoin is just digital money only users made it to have a dark side of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jon_Hodl",
      "created_time": "August 05, 2023, 10:55:17 PM",
      "body": "The same thing has been happening with fiat money for centuries. Just because someone uses bitcoin to do something illegal doesn't mean that there is anything wrong with the money itself. If a hacker group wants to get paid with bitcoin, they will have trouble moving any large sum of money without it being monitored and prevented from being converted into any fiat money. In fact, if a company ever pays a ransom for malware, their insurance companies will not pay out unless the ransom is paid with a transparent blockchain like Bitcoin because it is relatively easy to follow the money. Of course, there are ways that you can use bitcoin anonymously but if you ever move money into an exchange and attempt to sell it for fiat and then move that fiat into your bank account, you will need to verify the source of those funds.Using bitcoin for illicit activities like ransomware is a terrible idea. It is best to only use it as money for trading normal everyday goods and not extorting multinational companies with a small army of lawyers who specialize in prosecuting extortionist hacker groups and other bad actors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "August 05, 2023, 11:55:55 PMLast edit: August 06, 2023, 06:30:34 PM by Saint-loup",
      "body": "Most of this stuff is not new, and it was paid with cash money before, gold or through offshore half blinded banks. However I agree it makes more easy for hackers to be safely paid for ransomwares attacks though. They can stay completely anonymous, hidden and able to quickly receive very large amounts of money, without any risks of getting the funds locked but I am sure we will find more efficient ways to counter those attacks in the coming years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "August 06, 2023, 12:14:49 AM",
      "body": "It's just a currency people will use it for their own liking, it is no different to a bad guy asking a ransom with a fiat currency then they can launder the money, and government wouldn't be able to trace the money. The different is that fiat money can be manipulated 'legally' by the central bank and they wouldn't got any consequences, no one can do that to Bitcoin,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "August 06, 2023, 03:01:14 AM",
      "body": "Quote from: teoliya33 on August 05, 2023, 10:07:25 PMThe first I heard about Bitcoin when a big organization hack some platform and ask to get paid by bitcoinCrypto ransom attacks rise in first half of 2023, Chainalysis saysRansomware payments in Bitcoin ecosystemHow Bitcoin has fueled ransomware attacks?The history of hacking ransoms and cryptocurrencyQuoteof course everything comes with a reason but isn't Bitcoin a Heaven for Hackers as well?No it is not the only choice of hackers and not their heaven. They have many other choices for their ransom attacks and how they want to get payment. Don't let the rumors beat you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "August 06, 2023, 03:30:20 AM",
      "body": "I don't think it's heaven for hackers since Bitcoin can't be hacked easily. I would say that it could be a heaven for scammers because they are finding different ways to scam people and even create a malware to steal your wallet information so that they can access your wallet. There are some cases where  a platform is hacked and the hacker was able to steal the wallet and get the Bitcoin stored in the wallet that the company have used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 06, 2023, 04:30:53 AM",
      "body": "Bitcoin is a tool, and a tool can be used both for good purposes and bad purposes. Just like how a hammer can be used to repair stuff, but at the same time it can be used to bash someone’s head in; and just like how physical cash can be used to pay wages and buy groceries, but at the same time can be used to pay hired killers and to receive payments from kidnappings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aioc",
      "created_time": "August 06, 2023, 05:17:18 AM",
      "body": "Quote from: teoliya33 on August 05, 2023, 10:07:25 PMI love bitcoin and i think its the best currency ever !! its helps !! it's fast and all of that but still I'm afraid of this DARK side of it Can someone make me calm about it ? maybe i think too much or maybe im wrong please dont judge me.Your opinion is no different from other people who think that Bitcoin is bad and those ignorant ones who think that Bitcoin is a scammer and just based it on hearsay, every good thing can be abused, and Bitcoin payment is no different from fiat being paid to scammers and hackers.Bitcoin's positive features outweigh its negative features Bitcoin is transparent and decentralized because of its decentralization and no central authority its appealing to use in modern technology where the concept of freedom and transparency is what the generation wants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Peanutswar",
      "created_time": "August 06, 2023, 06:34:29 AM",
      "body": "Seems like you are overthinking too much with Bitcoin or too much movie watching related to hacking with the use of Bitcoin, bitcoin is decentralized so people use this to make themselves still anonymous, we can't deny that there's some illegal activity with the use of the bitcoin but in the other hand you can use that bitcoin today with the different mode of payment or even in a daily basis for transactions, now it will depends on the users. If they want to do this just to scam other people or use in an effective way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Y3shot",
      "created_time": "August 06, 2023, 06:42:51 AM",
      "body": "Is there anything made good and serve for good purposes that criminals and scammers can't also benefit from it?  If bitcoin  is good and some people use it for other purpose that may not be good it doesn't make bitcoin to be bad. The fiat we use in our daily transactions is still use by scammers,  this doesn’t make money to be bad because it is a tool that benefit humanity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "August 06, 2023, 07:23:40 AM",
      "body": "Quote from: teoliya33 on August 05, 2023, 10:07:25 PMI love bitcoin and i think its the best currency ever !! its helps !! it's fast and all of that but still I'm afraid of this DARK side of it Can someone make me calm about it ? maybe i think too much or maybe im wrong please dont judge me.The terms privacy and anonymity need to be studied more deeply. Crimes that occur such as robbery and criminality are caused by the perpetrator knowing that something is in the victim which invites the perpetrator's suspicion to take it from the victim. When the wealth assets that you have are not known by other people, criminal acts will be far away from you so that you can be calm with the wealth that you have.Bitcoin is the currency in a transaction to pay for something like any other currency. Its use can also be used as an investment asset. Bitcoin has a much easier system without any third party involvement.So, have no fear. Bitcoin privacy is highly protected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "August 06, 2023, 07:24:56 AM",
      "body": "Statistically speaking the law enforcement have been catching those who ask for ransom in bitcoin a lot faster than those who do it using fiat. For example they caught the Twitter hackers who scammed people and took their bitcoins, were caught by FBI so fast that they released an statement about the record they had set in catching cyber criminals and they were super happy about it!So, if anything bitcoin is the worst tool for majority of criminals because of its transparency that gets them caught quickly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "August 06, 2023, 07:27:25 AM",
      "body": "It's just currency, there aren't any good sides or bad sides. It's the people who are good or bad depending on how they use it. The only difference I see between fiat and crypto is fiat is being controlled/backed by the government, on the other hard cryptocurrency doesn't have any central government rather it's being backed by a decentralized blockchain technology. And you mentioned about illegal activities. It doesn't matter whether it's fiat or crypto. They are everywhere. If there are good deeds there will always be bad deeds. They co-exists and without the first one the second one won't have any any value. It' all about the people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "August 06, 2023, 07:27:39 AM",
      "body": "It's not like bitcoin launched a never before seen crimewave once it was introduced more than a decade ago. Criminals and fraudsters always had ways to make money, bitcoin offers a new and perhaps easier way to do that. Semi-anonymity that could even be complete anonymity if used with the right tools or in connection with privacy coins. Of course it's going to be appealing for criminals and hackers to use something like that. But every nasty thing bitcoin is used for today, cash, gold, precious stones, etc. were used for in the past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DYING_S0UL",
      "created_time": "August 06, 2023, 07:35:30 AM",
      "body": "Quote from: pooya87 on August 06, 2023, 07:24:56 AMStatistically speaking the law enforcement have been catching those who ask for ransom in bitcoin a lot faster than those who do it using fiat. For example they caught the Twitter hackers who scammed people and took their bitcoins, were caught by FBI so fast that they released an statement about the record they had set in catching cyber criminals and they were super happy about it!So, if anything bitcoin is the worst tool for majority of criminals because of its transparency that gets them caught quickly.You are totally right. Tracking crypto is rather easy then tracking fiat. Because crypto always leaves a trace. One the other hand fiat count be spread very distribute. If you know the right person/organization it's very easy. It's not like it's 1969 or anything. We are living in 2023. Everything could be tracked or monitored if it's connected to the internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "August 06, 2023, 07:39:16 AM",
      "body": "Incorrect, Bitcoin isn't used to be an anonymous currency, if someone is looking for an anonymous currency, they must be use Monero.You're not wrong, neither think too much. But there's no point to take care about that because if someone use Bitcoin for illegal thing, you're not entirely become a criminal. Just believe in what you doing, if you want to be a good person, then use anything including Bitcoin for a good thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "August 06, 2023, 06:41:01 PM",
      "body": "Quote from: pooya87 on August 06, 2023, 07:24:56 AMStatistically speaking the law enforcement have been catching those who ask for ransom in bitcoin a lot faster than those who do it using fiat. For example they caught the Twitter hackers who scammed people and took their bitcoins, were caught by FBI so fast that they released an statement about the record they had set in catching cyber criminals and they were super happy about it!So, if anything bitcoin is the worst tool for majority of criminals because of its transparency that gets them caught quickly.Could you share the link of the article claiming that please. Because it's very interesting but very surprising too. If cryptocurrencies were more risky to use for criminals than fiat, black markets on the darknet wouldn't use cryptocurrencies, they would use solutions based on fiat money instead. In addition, many hacks of platforms and scams have never been elucidated till now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 06, 2023, 07:22:13 PM",
      "body": "Hmm, Dark side Bright side I don't what to say or where to choose I think it really depends on nature's recognization as BTC is not by nature recognized as Money Laundering way or something like that, Bitcoin is globally recognized as the P2P effective safe and decentralized payment mode and that's why I'm here and many people are here with Bitcoin. BTC is the source of money laundering these phrases were used back in time a few years ago the Blockchain brings transparency so the people who didn't know what a public edger is used to believe these shit rumors. In the current timeline, most of us know how public and transparent data is on the blockchain.Fiat is a currency or you can say that Cash is the more efficient source of money laundering by which for years the Black money holders are securing their funds. Becasue there is no transparency and records available for the cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}