{
  "id": "topic_5409309",
  "title": "nullama",
  "author": "nullama",
  "created_time": "August 10, 2022, 02:37:05 AM",
  "content": "You can now manage your own Bolt Cards to make lightning transactions by just tapping with a card, just like you're used to do normally, but instead of relying on third parties like banks, you send the funds directly to the merchant through lightning.Here's the repository for the management of the Bolt Cards: https://github.com/boltcard/boltcardThese Bolt Cards have a more secure chip than other standard NFC cards. Here's where you can buy one of these NFC cards, they ship worldwide and no KYC is needed: https://www.coincorner.com/TheBoltCardAnd here's a bit more information about the usage of these cards, with some videos: https://stacker.news/items/29647Any merchant that has a NFC enabled store, like https://btcpayserver.org for example, should work with these cards.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409309",
  "comments": [
    {
      "author": "SFR10",
      "created_time": "August 10, 2022, 09:06:03 AM",
      "body": "Quote from: nullama on August 10, 2022, 02:37:05 AMThese Bolt Cards have a more secure chip than other standard NFC cards.Can you share a bit more information with regards to the bolded part?Quote from: nullama on August 10, 2022, 02:37:05 AMthey ship worldwideJust checked and despite their claims, some countries were missing on the checkout page... It's worth noting that there's no limit in shipping their product to unsupported countries [apart from what I already mentioned] and that leads to not utilizing the full functionality of the card [regardless of it being dirt cheap, it's still a strange decision]:Quote from: https://support.coincorner.com/hc/en-us/articles/5600580995346-The-Bolt-CardIn order to benefit from the full functionality of the card you’ll need to make sure you live in a territory that is currently supported by CoinCorner, which are listed here. The Bolt Card is available for sale worldwide, including to countries that we do not currently support.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 10, 2022, 12:46:15 PM",
      "body": "Quote from: nullama on August 10, 2022, 02:37:05 AMthey ship worldwide and no KYC is neededno KYC?funny thing is if they dont ask your name and where you live and a contact email if things go wrong, you will never receive the parcel (real world physics of delivering goods applies)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "August 11, 2022, 12:04:11 AM",
      "body": "Quote from: SFR10 on August 10, 2022, 09:06:03 AMQuote from: nullama on August 10, 2022, 02:37:05 AMThese Bolt Cards have a more secure chip than other standard NFC cards.Can you share a bit more information with regards to the bolded part?These cards use NXP NTAG 424 DNA, which allows you to generate a new LNURL every time, so that replay attacks are not possible. More details about the chip: https://www.nxp.com/products/rfid-nfc/nfc-hf/ntag-for-tags-labels/ntag-424-dna-424-dna-tagtamper-advanced-security-and-privacy-for-trusted-iot-applications:NTAG424DNAQuote from: franky1 on August 10, 2022, 12:46:15 PMQuote from: nullama on August 10, 2022, 02:37:05 AMthey ship worldwide and no KYC is neededno KYC?funny thing is if they dont ask your name and where you live and a contact email if things go wrong, you will never receive the parcel (real world physics of delivering goods applies)It can be delivered to your office, a PO-BOX, a friend's home, etc. It doesn't have to be linked to you, as any standard KYC requires.Quote from: ETFbitcoin on August 10, 2022, 01:05:32 PMRegardless of how secure/insecure of this chip, there's bigger security concern with merchant honestness. It's possible what showed on customer display is different with what sent to the NFC card.Does anyone know whether KYC apply to their debit card feature on this bolt card? Their website don't say anything about it.Since it's open source you have access to the management of the card  so you could setup an \"accept amount\" sent to your phone first if you're paranoid. But that kinda defeats the purpose. You can also set a maximum spending for example in the card and it won't send any more sats than that.The debit card feature of coin corner requires an account there, so that means it requires KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "August 11, 2022, 09:52:17 AM",
      "body": "Quote from: franky1 on August 10, 2022, 12:46:15 PMno KYC?funny thing is if they dont ask your name and where you live and a contact email if things go wrong, you will never receive the parcel (real world physics of delivering goods applies)From that point of view though, wouldn't that be at your discretion? If you wanted to provide those things you could in the comment box while checking out, or by contacting the company directly. I haven't taken a look at the check out since I'd not all that interested in this, but it would make sense to include that information by default, the only problem with having those fields by default, means people automatically assume they're required, even when there's a clear key stating an asterisk is the only fields required. Also, parcels don't go missing often. At least, from a individual view point. Obviously, millions of parcels get misplaced each year, but from one company that doesn't have a massive amount of exports, it's unlikely to be that many that it causes a massive problem. Obviously, as long as the company would be willing to replace those cards, no questions asked if undelivered.Obviously, its been pointed out that KYC is required from a third party, but delivery I don't necessarily believe it would be absolutely required if you don't mind the risk of losing the parcel. Something like this, could probably be sent out without too much additional charge too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "August 11, 2022, 11:31:00 AM",
      "body": "Quote from: nullama on August 11, 2022, 12:04:11 AMQuote from: franky1 on August 10, 2022, 12:46:15 PMQuote from: nullama on August 10, 2022, 02:37:05 AMthey ship worldwide and no KYC is neededno KYC?funny thing is if they dont ask your name and where you live and a contact email if things go wrong, you will never receive the parcel (real world physics of delivering goods applies)It can be delivered to your office, a PO-BOX, a friend's home, etc. It doesn't have to be linked to you, as any standard KYC requires.Quote from: Welsh on August 11, 2022, 09:52:17 AMQuote from: franky1 on August 10, 2022, 12:46:15 PMno KYC?funny thing is if they dont ask your name and where you live and a contact email if things go wrong, you will never receive the parcel (real world physics of delivering goods applies)From that point of view though, it was more of a tongue in cheek thing(funny thing) about saying you pretend to ask nothing about the customer. but then need to know where to deliver it to, thus asking something about the customer.it was not about the legality of double checking against some ID database how valid the customer info was.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Welsh",
      "created_time": "August 11, 2022, 11:51:38 AM",
      "body": "When are we actually going to break into this realm, without requiring KYC? Never? Too many government imposed regulations, meaning that KYC will always be needed? I see the benefit for many people of a system like this, not something I'd be that interested in myself, but I see how this would increase the convenience of Bitcoin, as well as attract new people to Bitcoin. I just have a hard time supporting anything which relies on a third party, especially when that third party isn't exactly transparent about how they go about things. Quote from: franky1 on August 11, 2022, 11:31:00 AMit was more of a tongue in cheek thing(funny thing) about saying you pretend to ask nothing about the customer. but then need to know where to deliver it to, thus asking something about the customer.it was not about the legality of double checking against some ID database how valid the customer info was. Fair enough, that went over my head.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "January 18, 2023, 07:19:40 PM",
      "body": "Quote from: DenVinces on January 18, 2023, 04:19:28 PMWow, that's really cool to manage your own Bolt Cards to make lightning transactions! It's interesting to see how technology is advancing to make transactions more secure and efficient.more secure?giving a merchant a LNURL where he can make multiple deductions from your balance..yea fun stuff, just dont accidentality tap 3 times or it will cost you 3x",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "January 18, 2023, 09:22:36 PMLast edit: January 26, 2023, 06:02:59 PM by Accardo",
      "body": "Quote from: franky1 on January 18, 2023, 07:19:40 PMQuote from: DenVinces on January 18, 2023, 04:19:28 PMWow, that's really cool to manage your own Bolt Cards to make lightning transactions! It's interesting to see how technology is advancing to make transactions more secure and efficient.more secure?giving a merchant a LNURL where he can make multiple deductions from your balance..yea fun stuff, just dont accidentality tap 3 times or it will cost you 3xWhile setting up the bolt card you can limit the daily amounts to how much money you'll wish to spend a day or weekly. So, users are expected to put their daily limitation in smaller amounts to avoid such things like you pointed out. Moreover Boltcards are more secure compared to the static LNURLW in terms of deducting money from clients balance with the help of this Boltcard extension or the Bold card NFC card creator app on google play store, the bolt card can be erased, so far the key is backed up the person can re-create another one to maintain the security of the card.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "January 18, 2023, 10:26:47 PM",
      "body": "Quote from: franky1 on January 18, 2023, 07:19:40 PMQuote from: DenVinces on January 18, 2023, 04:19:28 PMWow, that's really cool to manage your own Bolt Cards to make lightning transactions! It's interesting to see how technology is advancing to make transactions more secure and efficient.more secure?giving a merchant a LNURL where he can make multiple deductions from your balance..yea fun stuff, just dont accidentality tap 3 times or it will cost you 3xAdding on top of what Accardo already said, the Bolt Card comes with a special NFC chip that is more secure than standard NFC chips.In particular, they come with the NXP NTAG 424 DNA chip. This prevents attacks such as multiple transactions with the same LNURL, because it adds a hash on every LNURL, and the server then is able to verify it's the correct transaction, and invalidate any other attempt. Note that you have full control to the server as well, as it's open source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "March 21, 2023, 09:59:07 AM",
      "body": "Quote from: nullama on August 10, 2022, 02:37:05 AMAny merchant that has a NFC enabled store, like https://btcpayserver.org for example, should work with these cards.So basically merchants need to have a service that supports this payment, right? I think this is very innovative because people can send their bitcoin quickly by just tapping their card, but for countries that prohibit using Bitcoin as payment, like mine, it seems this service can't be used.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}