{
  "id": "topic_5469345",
  "title": "eugenplay",
  "author": "eugenplay",
  "created_time": "October 05, 2023, 09:06:21 PM",
  "content": "I want to raise a topic among crypto enthusiasts regarding online games and the fact that these games harbor their own small markets for trading items and services among players. Why do I want to discuss this here? It's because this market shares regulatory nuances with cryptocurrencies. To be precise, many game developers are against this trend, meaning not all game creators appreciate players earning something while playing their games, but in my opinion, they are infringing on the rights and freedom of players with this stance.Imagine this scenario, suppose I am a crypto-trader, I spend a major part of my time on the computer, and sometimes I want to play something. But the keyword is \"sometimes\", as time is not always sufficient. However, when I step into a game like World of Warcraft, the game demands a huge time investment from me. The game literally says, either you run around in the open world killing easy and uninteresting foes, and then yes, you can play for an hour a day. But if you want engaging gameplay, first spend 100 hours gearing up your character, then don't forget to perform the mandatory daily activity every day (otherwise, you'll fall behind other players), and then you need to join a guild, and to go with them into challenging group dungeons, you need to show up like a job for 4 hours a day, 6 days a week. And only then, you'll find it interesting.For such players, there's a solution. These are known as Boosting Service Providers. They are online shops that offer to sell a \"ticket\" for going through that very dungeon with a group of professional players. Meaning, you don't have to spend hundreds of hours on the game to see interesting game content, you simply go to one of the platforms selling boosting services, and hire a group of players to help you accomplish any of your gaming tasks. And these players, who provide such services, earn a living from this. It's a win-win situation, both for the player purchasing it and the one selling it. To ensure fair and scam-free transactions, these online shops act as intermediaries. They ensure that the buyer gets what they ordered, and the seller gets paid for their work.I own such an online shop (mmonster.co), we sell such services, for example, WoW Boosting Services (raid and dungeon runs, performing various gaming routines, and so forth) and we operate quite officially. That is, we have a registered company, people are working, we pay taxes, we have payment systems, and we have many positive reviews from our customers. But we regularly face pressure from game publishers, they extremely dislike what we do and the fact that players can earn something from it. So, I want to know what people from the cryptocurrency world think about this. As cryptocurrencies are also largely subject to regulatory pressure, depriving us of a degree of freedom.But since we are already on a crypto forum, I must say that cryptocurrencies have greatly helped players engage in such activities. PayPal constantly bans people for any such activity, and getting paid for your \"work\" became a real pain, especially for people from less developed countries. But thanks to cryptocurrencies, the problem was solved, and now anyone can earn a living, or even support their family, just by helping someone advance in video games, and I think that's great!And what do you think about this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469345",
  "comments": [
    {
      "author": "Ucy",
      "created_time": "October 06, 2023, 09:43:13 AM",
      "body": "Well, it reminds me of certain paid services that help students do their homeworks, which is more like cheating to pass ones homework since the teachers may want them to learn from solving the home work problems themselves or with the help of their family, and without charge.. But the homeworks are now probably fully done by people who are more motivated by money and the students prevented from learning to solve the problems. So the teachers end up not achieving the goal for setting up the homework. Have you wondered what the goals of the developers are, and whether they want the players to go through the challenge themselves to help them become better players and the developers could use the opportunity to discover or map out talented/skilled players worldwide? If this is close to what they want to achieve then the sellers maybe messing things up for them. .Better to make money morally and from good business",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "julerz12",
      "created_time": "October 06, 2023, 03:12:11 PM",
      "body": "So it's kinda like pilot services too. I played old-school RAN online way back in my college days and since that game needs you to grind your character so hard just to level-up and keep up with the rest of your clanmates, you're better off hiring someone to play and grind your character for you (a pilot). The only difference is that, back then, the payment didn't have to go through a 3rd-party merchant or service provider since most transactions happen in person. I guess you could say, you really have to 100% trust someone if you're gonna hire them as a pilot. RAN Online has its own in-game economy and hiring Pilots for you to level-up doesn't affect the in-game economy. I guess that might be one of the reasons the devs back then didn't care about it.So, I think as long as having such services doesn't affect the overall in-game experience of everybody, that would be fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}