{
  "id": "topic_5436769",
  "title": "I_Anime",
  "author": "I_Anime",
  "created_time": "January 25, 2023, 06:55:45 PM",
  "content": "CEX deserves all the hates it getting now but doesn't mean it has also not been helpful to bitcoin and crypto space. I know that most issues that affected bitcoin and crypto space as a whole was mainly from Centralise exchange in 2022 but that can't just make us stop using it  instead we should be more cautious on the centralise exchange we use and since the whole issues happened , Government are going to strengthen the regulation of centralise and there will be more transparency from the exchange to their customers, especially with regards to custody of customers assets and proof of reserves .Apart from the from this issues CEX has really helped in increasing bitcoin and crypto investors because most investors are not scared of buying coins from them because they are too many crypto scammers online and I myself got scammed last year,After that I come to the conclusion that if not CEX am not buying any coin.Though I buy from CEX but I am always careful on the one's I use and I also use binance p2p. Some of the trusted one's are :Binance CoinbaseKucoinKrakenBybit There are definitely others and they may be better than this I listed but this are the ones I have used After the whole issues of FTX my advice is though buying from CEX is safer but storing all your funds there should be avoided and for holders just stick with DEX.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436769",
  "comments": [
    {
      "author": "Z-tight",
      "created_time": "January 25, 2023, 07:03:33 PM",
      "body": "Quote from: I_Anime on January 25, 2023, 06:55:45 PM After the whole issues of FTX my advice is though buying from CEX is safer but storing all your funds there should be avoided and for holders just stick with DEX.Storing your funds in any exchange, either centralized or decentralized exchange isn't safe; exchanges are platforms for trading cryptocurrencies, and funds should be transferred immediately into your self custody wallet afterwards. Long term holders should use hardware wallets or set up Electrum wallet as a cold storage on an air-gapped device, while if you have a small amount of BTC you want to use for spending daily or weekly, you can just hold it on electrum as a hot wallet, and spend when you want to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "January 25, 2023, 07:08:37 PM",
      "body": "There is no convincing me that CEX centralized exchange hasn’t been bad for Crypto-currency, we has seen how centralized exchanges has affect the ecosystem in ways that are right now not redeemable.I am not sure of the year but there was a year centralized exchanges were locking up people’s funds without any concrete reasons and government of countries who are against Crypto-currency where using centralized exchange as a pivotal point to get Crypto-currency enthusiast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "January 25, 2023, 08:12:16 PM",
      "body": "Quote from: I_Anime on January 25, 2023, 06:55:45 PMAfter the whole issues of FTX my advice is though buying from CEX is safer but storing all your funds there should be avoided and for holders just stick with DEX.Why it should be adviseable after Just because of the FTX incident because it should be avoided all the time that centralized exchangers should not hold large funds. Because this is not the first collapse that has happened to the FTX exchanger, this has also happened to the cryptocurrency world, if we think back to mt.gox in 2014. That happened there too.Moreover, I think that the original purpose of Bitcoin is not complete by centralized exchanges because its control is not managed in a decentralized way. I would suggest using a centralized exchanger just to exchange currencies, which will only be temporary. Because even before the Collapse, FTX Exchange was in a very good position in terms of ranking and usage So we should learn from FTX exchanger incident and also from the previous incidents before it is too late.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "January 25, 2023, 09:52:44 PM",
      "body": "You are correct that centralized exchanges (CEX) have played a significant role in the growth and development of the bitcoin and crypto space, despite some issues that have affected the industry in recent years. Centralized exchanges have provided a convenient and accessible way for people to buy and sell cryptocurrencies, which has helped to increase the number of investors in the space. However, it's important to be aware of the risks associated with using centralized exchanges, such as the potential for hacking or mismanagement of funds.The issues that have affected the crypto space in recent years have led to increased government regulation and more transparency from exchanges. This will help to ensure that customers' assets are protected and that exchanges are held accountable for their actions.As you pointed out, it's important to be cautious when choosing a centralized exchange to use. Some of the most trusted exchanges include Binance, Coinbase, Kucoin, Kraken, and Bybit. However, it's important to do your own research and only use exchanges that you trust.Another point you made is the importance of not storing all your funds on centralized exchanges, but instead using decentralized exchanges (DEX) for holding your assets. This can reduce the risk of funds being lost or stolen, but it's important to note that DEXs may not have the same level of liquidity or user-friendly experience as CEXs.In summary, it's important to be aware of the risks associated with using centralized exchanges, but also not to overlook the benefits they have provided to the crypto space. It's crucial to be cautious and selective when choosing an exchange to use and to be aware of the best practices for safeguarding your assets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "January 25, 2023, 10:17:22 PMLast edit: January 25, 2023, 10:51:03 PM by Die_empty",
      "body": "Centralized exchanges have played some positive roles in the publicity or advertisement of bitcoin because most of them allocate huge resources to cryptocurrency awareness. Most people in my area became aware of bitcoin and others through the advertisements by CEXs. But it is also clear that it's disadvantages is really higher than it's advantages. These exchanges cannot be trusted because they are runned or controlled by humans that can make severe mistakes like in the case of FTX. I am not also recommending these CEX for even bitcoin trading because they totally limits the basic reasons why Bitcoin was created. People might claim that it is convenient, but there are many DEX platforms that can also offer the same services centralized exchanges offers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "January 25, 2023, 10:28:49 PM",
      "body": "Quote from: I_Anime on January 25, 2023, 06:55:45 PMCEX deserves all the hates it getting now but doesn't mean it has also not been helpful to bitcoin and crypto space.Don't you think Bitcoin could be more better without centralized exchanges than when we have them since all they could contribute is adding up alot of altcoins to pile up the whole crypto space and get people distracted towards investing on some of these coins at the end of their look for Bitcoin, to the best of my knowledge Bitcoin will be more under best of interest without them which will encourage having personal wallet that could be non custodial.Quote from: I_Anime on January 25, 2023, 06:55:45 PMSome of the trusted one's are :Binance CoinbaseKucoinKrakenBybit There are definitely others and they may be better than this I listed but this are the ones I have used After the whole issues of FTX my advice is though buying from CEX is safer but storing all your funds there should be avoided and for holders just stick with DEX.If you're doing this then know it's all at your own risk because there's nothing that can change from their being centralized, hacked or backrupt and lastly in revealing your private details to anyone to track you down.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "January 25, 2023, 10:52:52 PM",
      "body": "Trusting them is subjective. You can use them yet not trust them because of the issues that you're aware of. Yeah, you can trust them at the same time have doubts about them as you use them. Getting the hate that they've got is all due to the outcome of what FTX has made and it's not limited to just last year's timeline. We may still see some of it in the future but hopefully, most of the users are aware of it that when they say trusting these exchanges, it's not up to the point that you'll store all that you've got in them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "January 25, 2023, 10:57:28 PM",
      "body": "Storing all your funds on any CEX is stupid & asking for trouble. Having limit buy or sell orders on exchanges is fine but just do not leave them on there too long term. I don’t have any problem with buying from CEX, there is no  problem if you don’t mind KYC & paying your taxes etc.Please be sensible though & refrain from getting too comfortable by leaving too much money on these exchanges. Self custody is the way to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "milewilda",
      "created_time": "January 25, 2023, 11:24:24 PM",
      "body": "Quote from: DeathAngel on January 25, 2023, 10:57:28 PMStoring all your funds on any CEX is stupid & asking for trouble. Having limit buy or sell orders on exchanges is fine but just do not leave them on there too long term. I don’t have any problem with buying from CEX, there is no  problem if you don’t mind KYC & paying your taxes etc.Please be sensible though & refrain from getting too comfortable by leaving too much money on these exchanges. Self custody is the way to go. It had been said for thousands or even million times that never ever make yourself that believe storing up your funds on any centralized or custodial wallets or platforms is safe because it is really the opposite.There are people who are just becoming that too much confident when it comes into their approach in towards these centralized platforms until things get messed up.On the positive side which we know that evenwe do really have these kind of criticisms and prompts which it cant really be ignore that we do really need up their services because this is where trading and conversion to fiat do takes place.This is why i cant really blame out totally on why people do really get that much confidence in them or into these places.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoPanda",
      "created_time": "January 26, 2023, 12:01:52 AM",
      "body": "For the umpteenth time it’s been said to never store your bitcoins on exchanges. You forget centralized exchanges demand KYC and have reserve the  rights to freeze your bitcoins if there is any suspicious activity on your account, it could be they don’t trust the source of your income e.t.c. The risks of using centralized exchanges are too great, the cons overweigh the pros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Captain Corporate",
      "created_time": "January 26, 2023, 01:18:45 AM",
      "body": "I have been using Binance personally for a long time, since they started out first. It started out with trying to get some affiliates and making money, which soon turned into using it myself. They also have a turkish website where we can put our fiat in and out as well, so they basically allow us to not just trade, but get involved from scratch as well. All in all, I really like them and I think they are super awesome, not saying there is zero chance it could ever be bad, but it is definitely something I will use until there is a big problem. Not that there will be one for sure, maybe it will be problem free forever like it has been so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "January 26, 2023, 02:07:40 AM",
      "body": "I personally don't hate CEX, the way they work I think is quite clear along with some of the risks.But both the criticism and hatred deserved by certain brands when they have abused custody and authority over user assets, and when they start behaving strangely contrary to the simplicity of all the processes described in the beginning, especially user verification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "January 26, 2023, 03:25:52 AM",
      "body": "Quote from: I_Anime on January 25, 2023, 06:55:45 PMI know that most issues that affected bitcoin and crypto space as a whole was mainly from Centralise exchange in 2022 Wrong, centralized exchange has been got hacked since 2011 until now Hacked Exchanges since 2011 actually Mt.Gox insolvency is more have bigger effect than FTX because Mt.Gox is like Binance at that time.QuoteGovernment are going to strengthen the regulation of centralise and there will be more transparency from the exchange to their customers, especially with regards to custody of customers assets and proof of reserves .When the government strengthen the regulation of the centralized exchange, it will increase the possibility all of exchange will ask to every users to complete the identity verification. Some people might accept it, but since I have an option to use decentralized exchange, why I need to use centralized exchange then? anyone need to read Why KYC is extremely dangerous – and uselessSo you think it's good for the exchange to custody of customers assets? exchange is used to buy and sell your coin, it's not used to hold your coin.QuoteApart from the from this issues CEX has really helped in increasing bitcoin and crypto investors because most investors are not scared of buying coins from them because they are too many crypto scammers online and I myself got scammed last year,After that I come to the conclusion that if not CEX am not buying any coin.When you got scammed, it doesn't mean all of P2P and decentralized exchange are scam. Most likely you're not follow the exchange's instructions, example you're only allowed to complete the trade inside the exchange, but the scammer contact you via telegram and you just trust to trade it via P2P without escrow.QuoteAfter the whole issues of FTX my advice is though buying from CEX is safer but storing all your funds there should be avoided and for holders just stick with DEX.Don't use decentralized exchange to hold your coin, you must use hardware wallet because you will have a seed phrase that can be used to access your coin even you lost your hardware wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "January 26, 2023, 04:04:00 AM",
      "body": "Quote from: I_Anime on January 25, 2023, 06:55:45 PMCEX deserves all the hates it getting now but doesn't mean it has also not been helpful to bitcoin and crypto space. CEX will always be there and will help us buy and sell not only Bitcoin but all of the cryptocurrency the particular exchange has been listed.What happened to FTX did have a contagion effect not only to CEX but all of the companies and projects that has a connection with FTX. CEX being criticized is pretty normal already especially with the exchange this huge will turn out to be a fraud exchange. Investors can hate the CEX as well but that is temporary only and in the end, most who are hating those CEX are the ones who will use them as well. Where they will buy crypto if they wanted to? DEX probably but you can't buy Bitcoin on DEX'es right?Quote from: I_Anime on January 25, 2023, 06:55:45 PMAfter the whole issues of FTX my advice is though buying from CEX is safer but storing all your funds there should be avoided and for holders just stick with DEX.It's the same as \"Don't store your coins in a CEX\" that's all. Even though we are saying this all the time, there are still investors who still prefer storing their coins in an exchanges. Maybe they have a personal reason why they are doing it, but it's riskier than just storing it on your own wallet that you have the private keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "January 26, 2023, 04:21:13 AM",
      "body": "I generally agree with the subject you bring up that at the end of the day CEX is still useful and people should learn to use it with more caution (at least until better solutions are found and DEXes are improved more) but I don't see the following happening:Quote from: I_Anime on January 25, 2023, 06:55:45 PMGovernment are going to strengthen the regulation of centralise and there will be more transparency from the exchange to their customers, especially with regards to custody of customers assets and proof of reserves .There are two problems with this.1. Even if the exchange has revenues (which they all have) it still doesn't guarantee they won't get hacked or scam their users and run away. So the said proof doesn't solve any thing.2. Governments don't regulate exchanges to save users. They do it to save themselves! They want full control and surveillance and more importantly taxes, all of which is possible if the CEX enforces KYC and reports all their user activities to the authorities. Majority of the exchanges that have been hacked over the past couple of years were regulated and that didn't change a thing!QuoteApart from the from this issues CEX has really helped in increasing bitcoin and crypto investors because To be fair we don't want bitcoin investors we want more bitcoin users to help the ecosystem as the only decentralized payment system. The altcoin investors are also simple gamblers who do more harm than good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "January 26, 2023, 04:29:28 AM",
      "body": "Always use CEX with a reasonable portion only means that you should not trust any CEX to be a place for you to trust large funds there especially to store them because all online platforms are as trustworthy as they are today will be able to harm their users in the future it's only a matter of time until it happens including all the CEXs you mentioned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wxa7115",
      "created_time": "January 26, 2023, 05:07:37 AMLast edit: February 01, 2023, 04:57:56 AM by wxa7115",
      "body": "Quote from: milewilda on January 25, 2023, 11:24:24 PMQuote from: DeathAngel on January 25, 2023, 10:57:28 PMStoring all your funds on any CEX is stupid & asking for trouble. Having limit buy or sell orders on exchanges is fine but just do not leave them on there too long term. I don’t have any problem with buying from CEX, there is no  problem if you don’t mind KYC & paying your taxes etc.Please be sensible though & refrain from getting too comfortable by leaving too much money on these exchanges. Self custody is the way to go. It had been said for thousands or even million times that never ever make yourself that believe storing up your funds on any centralized or custodial wallets or platforms is safe because it is really the opposite.There are people who are just becoming that too much confident when it comes into their approach in towards these centralized platforms until things get messed up.On the positive side which we know that evenwe do really have these kind of criticisms and prompts which it cant really be ignore that we do really need up their services because this is where trading and conversion to fiat do takes place.This is why i cant really blame out totally on why people do really get that much confidence in them or into these places.Since it is common knowledge that if you are not holding your private keys then you are not really holding any bitcoin, and despite this knowledge we have many investors and traders which are still leaving their coins for long periods of time at exchanges, we must conclude they are doing this willingly.Traders do not want to pay the fees to send their coins out and into the exchange each and every day, and they seem to believe they are saving a few cents each day by keeping their coins there, but when a case like FTX emerges they realize that whatever money they thought they were saving now belongs to the exchange, this is the moment when they realize they would have saved way more money by taking full custody of their coins, but it is too late to do anything when the collapse of the exchange they were using has already happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "January 26, 2023, 05:09:40 AM",
      "body": "Quote from: I_Anime on January 25, 2023, 06:55:45 PMCEX deserves all the hates it getting now but doesn't mean it has also not been helpful to bitcoin and crypto space. True. Most people in crypto can't handle the responsibility for their funds let's be honest. CEX's and banks are there for this purpose mostly. To fix the stupid stuff you do. In an ideal world, banks and cex's shouldn't exist but we don't live in an ideal world. It is not even a matter of stupidity sometimes. Sometimes clever people make mistakes too.People hate the CEX and banks so much but they can't imagine what would happen without them. It would be catastrophic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "January 26, 2023, 05:49:45 AM",
      "body": "tl;dr Centralized exchanges are good for traders, and for buying and selling if you're fine with AML/KYC; and that's pretty much it. Total utter crap for storing coins for the long-term.https://cryptosec.info/exchange-hacks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}