{
  "id": "topic_5407723",
  "title": "Jumperman4",
  "author": "Jumperman4",
  "created_time": "July 26, 2022, 09:12:45 PM",
  "content": "If MicroStrategy and Grayscale use Coinbase as a custodian, and Coinbase's policy and agreement with their users is if they are 'bankrupt' client's funds/ assets become Coinbase's in order to pay off debts wouldn't that mean 2 of the biggest publicly traded companies are reliant on Coinbase's ability to not screw up?But what is so hard about purchasing a ledger/ trezor and just adding a passphrase and custodian your own coins off exchanges?I ask because I have a Roth IRA and would like the exposure to bitcoin there as well as in my private wallets. For all the NYKNYC people, I'm not closing my Roth Ira to buy bitcoin, and also pay taxes and fees.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407723",
  "comments": [
    {
      "author": "BlackHatCoiner",
      "created_time": "July 26, 2022, 09:13:57 PM",
      "body": "Quote from: Jumperman4 on July 26, 2022, 09:12:45 PMIf MicroStrategy and Grayscale use Coinbase as a custodianCould you provide some evidence that proves they do?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jumperman4",
      "created_time": "July 26, 2022, 09:14:53 PM",
      "body": "Quote from: BlackHatCoiner on July 26, 2022, 09:13:57 PMQuote from: Jumperman4 on July 26, 2022, 09:12:45 PMIf MicroStrategy and Grayscale use Coinbase as a custodianCould you provide some evidence that proves they do?Their most recent 10k?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 26, 2022, 09:25:03 PM",
      "body": "Quote from: Jumperman4 on July 26, 2022, 09:14:53 PMTheir most recent 10k? What does that mean?Last time I checked microstrategy did not reveal how they store their assets (and I've not really looked into Grayscale) the.But, there is no evidence to support that either of them actually use coinbase for storage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 26, 2022, 09:53:54 PM",
      "body": "well greyscale is part of this grouphttps://dcg.co/portfolio/whom own alot of bitcoin businesses. including coinbasethough due to the large group of sister companies. expect that those sister companies would keep a sister that messed up 'afloat' in bad timesbut if they couldnt stay afloat. EG if greyscale super messed up had no backup resources/drain the spare resources of sister companies to the bone to previously stay afloat and then had to go bankrupt. expect lots of things to be affected, including coinbase",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 27, 2022, 01:03:44 PM",
      "body": "As far as I know from the discussion in MicroStrategy Buys $250M in Bitcoin, Calling the Crypto ‘Superior to Cash’, MicroStrategy does not use a custodial wallet to store Bitcoin. We discussed this somewhere in the thread, and recently @fillippone wrote this \"And as long as he wants to accumulate bitcoin, which is the only strategy, according to his interviews, we can be sure no Bitcoin will leave Microstrategy self custody.\"As for Grayscale, last year they claimed to be using Coinbase Custody Trust Company, and I don't know if anything has changed in that regard until today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "July 27, 2022, 01:37:28 PM",
      "body": "Quote from: Lucius on July 27, 2022, 01:03:44 PMAs far as I know from the discussion in MicroStrategy Buys $250M in Bitcoin, Calling the Crypto ‘Superior to Cash’, MicroStrategy does not use a custodial wallet to store Bitcoin. We discussed this somewhere in the thread, and recently @fillippone wrote this \"And as long as he wants to accumulate bitcoin, which is the only strategy, according to his interviews, we can be sure no Bitcoin will leave Microstrategy self custody.\"As for Grayscale, last year they claimed to be using Coinbase Custody Trust Company, and I don't know if anything has changed in that regard until today. I cannot elaborate too much on this, but I know someone who spoke directly to Micheal Saylor, exactely about custody, and he said to me they do self custody. As per Grayscale, yes,  I didn’t recently check, but I think they go with Coinbase Custody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "witcher_sense",
      "created_time": "July 27, 2022, 02:31:41 PM",
      "body": "As a publicly traded company, Microstrategy is required by the US laws to submit 10-Q report to SEC quarterly, where they disclose financial information associated with company's business operations. The 10-Q SEC form dated 10.28.2021 https://www.microstrategy.com/content/dam/website-assets/collateral/financial-documents/financial-document-archive/form-10-q_10-28-2021.pdf contains an interesting warning (emphasis mine):QuoteSecurity breaches and cyberattacks are of particular concern with respect to our bitcoin. Bitcoin and other blockchain-based cryptocurrencies have been, and may in the future be, subject to security breaches, cyberattacks, or other malicious activities. For example, in October 2021 it was reported that hackers exploited a flaw in the account recovery process and stole from the accounts of  at least 6,000 customers of the Coinbase exchange (our principal market), although the flaw was subsequently fixed and Coinbase  reimbursed affected customers. Nonetheless, a successful security breach or cyberattack could result in a partial or total loss of our  bitcoin in a manner that may not be covered by insurance or indemnity provisions of the custody agreement with a custodian who holds  our bitcoin. Such a loss could have a material adverse effect on our financial condition and results of operations.They state pretty clearly that they have an agreement with some custodian (probably Coinbase Custody https://www.coinbase.com/custody) that holds at least part of their bitcoin holdings. It may well be that later they recognized the importance of self-custody and withdrew bitcoin from Coinbase, but initially it seems they were using Coinbase both to buy https://blog.coinbase.com/coinbase-is-helping-corporate-companies-diversify-with-crypto-444e8d91ebca and store their bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 27, 2022, 03:13:37 PM",
      "body": "due to the SEC slow efforts to allow crypto businesses.. the 'insurance' sector cannot even begin to try to offer crypto insurance to custodian services. so those showing quotes of greyscale/microstrategy warning that coinbase has no insurance provisions is obvious. yes crypto is not secured/isnured. so people should not trust custodians to re-reimburse its costumers if there is a hack.however coinsbase and greyscale are sister companies so coinbase wont steal from greyscale because they are both owned by DCGmicrostrategy has more of a headache if something bad happened with coinbase, because microstrategy is not a company of DCG he would have to try suing coinbase(DCG) to get any reimbursement if a internal theft or hacker theft occurred",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "July 27, 2022, 03:23:21 PM",
      "body": "Even if you can see what is the end user agreement with coinable you can never know what is written in the contract between Coinbase and MSTR or GBTC. They will not just register a account on coinable under normal terms, but they will get a special contract with probably hundreds of pages.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "July 27, 2022, 03:50:57 PM",
      "body": "Quote from: witcher_sense on July 27, 2022, 02:31:41 PM<…>.This is an interesting piece of information. I will try to double neck this with my “source”.Also will try to figure out is this statement is still present in their documents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "July 27, 2022, 04:16:37 PM",
      "body": "Quote from: fillippone on July 27, 2022, 01:37:28 PMI cannot elaborate too much on this, but I know someone who spoke directly to Micheal Saylor, exactely about custody, and he said to me they do self custody. As per Grayscale, yes,  I didn’t recently check, but I think they go with Coinbase Custody.Cool, that’s interesting. Obviously not first hand information myself but I have seen somewhere that Saylor & MSTR self custody. It really is the only way, we’ve all seen the well publicised horror stories. You just can not risk leaving your stash in the control of any other centralised entity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "July 27, 2022, 04:21:17 PM",
      "body": "Quote from: LFC_Bitcoin on July 27, 2022, 04:16:37 PM You just can not risk leaving your stash in the control of any other centralised entity.Even if you leave them in the custody of coinable you can have an special agreement that they will only care for the security which is very difficult with this large sum. It does not mean that they control any private key or passwords and that they could spend the coins. Maybe they only manage the hardware wallets etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "July 28, 2022, 10:32:40 AM",
      "body": "Quote from: fillippone on July 27, 2022, 01:37:28 PMI cannot elaborate too much on this, but I know someone who spoke directly to Micheal Saylor, exactely about custody, and he said to me they do self custody. If Saylor entrusts someone else to keep such a large amount of BTC, then we can conclude that he does not understand Bitcoin to the extent that he tries to show it to the public. According to the statement posted by @witcher_sense, we see that even last year they were aware of the risk arising from the custody service, and it would be strange if they did not do something about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "July 29, 2022, 07:01:13 AM",
      "body": "Quote from: Lucius on July 28, 2022, 10:32:40 AMQuote from: fillippone on July 27, 2022, 01:37:28 PMI cannot elaborate too much on this, but I know someone who spoke directly to Micheal Saylor, exactely about custody, and he said to me they do self custody. If Saylor entrusts someone else to keep such a large amount of BTC, then we can conclude that he does not understand Bitcoin to the extent that he tries to show it to the public. According to the statement posted by @witcher_sense, we see that even last year they were aware of the risk arising from the custody service, and it would be strange if they did not do something about it.The extra bit of information I have from my source, who is currently not available for personal issues, is that, yes, Microstrategy (or Macrostrategy) is actually doing self-custody. Of course, they have an elaborate system to avoid the loss of private keys (details of which are obviously not known to him),  with multiple levels of security (whatever this means). The sentence on the 10K form might be related to the bitcoin they purchased via the Lombard debt issue, and their bitcoin used as collateral for this. Those Bitcoin actually are not under direct Microstrategy custody, as far as I understood.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}