{
  "id": "topic_5477506",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "December 12, 2023, 12:01:15 AM",
  "content": "Semana passada foi publicado um documento bem interessante pelo Banco Central Europeu analisando a performance e volatilidade do BTC em relação a 44 moedas fiduciárias. Oestudo teve uma conclusão que achei muito sensata. Ele destaca que sim, as negociações de Bitcoin são motivadas pela especulação, mas que o Bitcoina pode oferecer benefícios significativos para países em desenvolvimento com moedas nacionais enfrentando processos de desvalorização e pode funcionar como uma reserva de valor em nações que enfrentam uma perda no poder de compra de suas moedas.Ele trás uma perspectiva de ''valor'' que depende da referencia em questão. Pra quem quiser ler: https://www.ecb.europa.eu/pub/pdf/scpwps/ecb.wp2868~0c2ad2e6e7.en.pdf?d6c30bb110bfb610a1f23569a7bc920c",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477506",
  "comments": [
    {
      "author": "thiagothx1370",
      "created_time": "December 12, 2023, 10:52:11 AM",
      "body": "Quote from: Disruptivas on December 12, 2023, 12:01:15 AMSemana passada foi publicado um documento bem interessante pelo Banco Central Europeu analisando a performance e volatilidade do BTC em relação a 44 moedas fiduciárias. Oestudo teve uma conclusão que achei muito sensata. Ele destaca que sim, as negociações de Bitcoin são motivadas pela especulação, mas que o Bitcoina pode oferecer benefícios significativos para países em desenvolvimento com moedas nacionais enfrentando processos de desvalorização e pode funcionar como uma reserva de valor em nações que enfrentam uma perda no poder de compra de suas moedas.Ele trás uma perspectiva de ''valor'' que depende da referencia em questão. Pra quem quiser ler: https://www.ecb.europa.eu/pub/pdf/scpwps/ecb.wp2868~0c2ad2e6e7.en.pdf?d6c30bb110bfb610a1f23569a7bc920cEntão a conclusão é muito simples. Se o bitcoin pode funcionar como reserva de valor em localidades onde a moeda circulante perde poder de compra, então é reserva de valor mundial.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 12, 2023, 07:38:36 PM",
      "body": "Sabes uma coisa curiosa Disruptivas?É vários membros do BCE já deram varias indicações que o Bitcoin é algo positivo, mas sempre foram desconsiderados.Talvez este esboço de proposta, seja o primeiro sinal que as coisas pode realmente ter uma perspectiva diferente.Se realmente a UE e o BCE querem rivalizar com a economia dos EUA, eles precisam mesmo de apresentar propostas diferentes dos EUA. Muitos economistas europeus estão fartos de dizer, que o BCE tem de começar a ser mais autonomia e não estar sempre a seguir o que o FED faz nos EUA. Eles tentaram fazer isso com as taxas de juros, por adiar o seu aumento, mas depois acabaram por usar um politica ainda pior que o FED usou.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "December 13, 2023, 12:44:16 AM",
      "body": "Quote from: thiagothx1370 on December 12, 2023, 10:52:11 AMQuote from: Disruptivas on December 12, 2023, 12:01:15 AMSemana passada foi publicado um documento bem interessante pelo Banco Central Europeu analisando a performance e volatilidade do BTC em relação a 44 moedas fiduciárias. Oestudo teve uma conclusão que achei muito sensata. Ele destaca que sim, as negociações de Bitcoin são motivadas pela especulação, mas que o Bitcoina pode oferecer benefícios significativos para países em desenvolvimento com moedas nacionais enfrentando processos de desvalorização e pode funcionar como uma reserva de valor em nações que enfrentam uma perda no poder de compra de suas moedas.Ele trás uma perspectiva de ''valor'' que depende da referencia em questão. Pra quem quiser ler: https://www.ecb.europa.eu/pub/pdf/scpwps/ecb.wp2868~0c2ad2e6e7.en.pdf?d6c30bb110bfb610a1f23569a7bc920cEntão a conclusão é muito simples. Se o bitcoin pode funcionar como reserva de valor em localidades onde a moeda circulante perde poder de compra, então é reserva de valor mundial. Então, sim e não. Um ponto importante que acho que vale citar é que eles identificam esses beneficios para países emergentes e economias em desenvolvimento (EMDEs) porque nesses paises as opções de investimento são restringida por fatores institucionais, porque as criptomoedas mesmo voláteis são mais sólidas que as moedas difuciárias de alguns desses paises e que as criptomoedas são muito melhores para transações internacionais e muito mais baratas também. Mas o mesmo não é necessariamente verdade para paises com moeda melhores. Ou seja, não seria tão global. Seria uma moeda reserva de valor para paises ferrados. Quote from: joker_josue on December 12, 2023, 07:38:36 PMÉ vários membros do BCE já deram varias indicações que o Bitcoin é algo positivo, mas sempre foram desconsiderados.Talvez este esboço de proposta, seja o primeiro sinal que as coisas pode realmente ter uma perspectiva diferente.Eu já li vários documentos de bancos centrais e vários pareceres de grandes economistas tradicionais sobre o Bitcoin e as criptomoedas. Mas esse artigo foi um dos que mais gostei, que achei mais sensatos e realmente apontam questões relevantes. A abordagem também é bem inovadora. Espero que realmente seja considerado mesmo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}