{
  "id": "topic_5465249",
  "title": "Lida93",
  "author": "Lida93",
  "created_time": "September 01, 2023, 03:13:49 AM",
  "content": "What is the one behaviour you noticed in a gambler and  you dislike it? You don't need to have a reason for disliking it but you just do.As for me I dislike when gamblers complain of their losses, meanwhile you hear them complain when they are getting winnings.What about you, what do you dislike ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465249",
  "comments": [
    {
      "author": "Yaunfitda",
      "created_time": "September 01, 2023, 03:50:47 AM",
      "body": "Quote from: Lida93 on September 01, 2023, 03:13:49 AMWhat is the one behaviour you noticed in a gambler and  you dislike it? You don't need to have a reason for disliking it but you just do.As for me I dislike when gamblers complain of their losses, meanwhile you hear them complain when they are getting winnings.What about you, what do you dislike ?Blaming someone when they lost. Like if you are playing slots in a traditional land base casinos and then by accident you are sitting beside someone who got a bonus unfortunately he didn't get a huge payout. And then they are going to complain that they have bad luck because the one sitting beside them has some bad omen.Of course, we will hear them whine and complain and everything but didn't understand that everything is based on your luck. Also some gamblers who just show or flash their winnings, but you will never hear anything when they have a big lost the previous days and that his current winnings might just be break even for him. But still he feels like he has won big that day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "September 01, 2023, 04:10:20 AM",
      "body": "I dislike it when a gambler comes up with a betting strategy. He thinks he may beat the house if he does that. Obviously that’s not possible because of the house edge. I see many gamblers every day trying complicated gambling patterns and I have never seen any of them winning anything in the long run. These losers will stay losers forever as long as they don’t change their minds. The same goes to people that do technical analysis. To me, doing TA and creating betting patterns are the same thing. They never work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "xSkylarx",
      "created_time": "September 01, 2023, 04:18:57 AM",
      "body": "Not giving tips when they win? Lol. But serious note: mostly when they are blaming someone when they lose and also when they keep murmuring when they lose, this kind of thing kills my momentum on playing, and at the same time, it's too noisy that they are complaining about it. Also accusing you or others of cheating even if they don't have any proof; they just want to ruin the game. There are tons, but this is mostly what I've experienced recently when I played with some people in our neighborhood.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "September 01, 2023, 04:28:38 AM",
      "body": "Quote from: Lida93 on September 01, 2023, 03:13:49 AMWhat is the one behaviour you noticed in a gambler and  you dislike it? You don't need to have a reason for disliking it but you just do.As for me I dislike when gamblers complain of their losses, meanwhile you hear them complain when they are getting winnings.What about you, what do you dislike ?I really don't like gamblers who become aggressive when they are on a losing streak. It's like he knows the risk that he will keep losing and lose a lot of money, but he still plays and loses and takes his anger out on other people, this is what I hate the most.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "September 01, 2023, 04:38:07 AM",
      "body": "I dislike when compulsive gamblers start blaming gambling for their losses and trying to turn the practice illegal because they can't control themselves. In my opinion this is the most disgusting behavior a gambler can have, as it shows egoism from his side: since gambling doesn't work for him, he also doesn't want it working for everyone else.Then we have lots of bans and censorship against gambling in different countries using as excuse the examples of those few gamblers who act like this and trigger authorities to regulate the industry in the most harsh possible ways, including crypto virtual casinos which are already on their aim as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "September 01, 2023, 04:47:25 AM",
      "body": "Quote from: xSkylarx on September 01, 2023, 04:18:57 AMNot giving tips when they win? Lol.I know you're joking with this, but some people actually hates someone who win and not giving them any tip. Well, I am the one who hates and gets annoyed to the people who's waiting for someone to win to beg for a tip. I knew a lot of people who's like this in a physical casino. When they're drained they just don't go straight to their homes to rest, instead they will come and gather around you and try to give you some advices while you are trying to place a bet so when you eventually win, they'll going to ask for a tip then until they can pool enough money to play another for round. I don't know if people like these exist in other countries, but this seriously annoys me. Having an online casino where we can play at the comfort of our home is an advantage to avoid this kind of people lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "September 01, 2023, 05:17:15 AM",
      "body": "I don't like it when a gambler can't accept his loss due to gambling. It was a risk they had to accept, whatever the loss.If they don't complain about not getting a win from gambling or losing their money because of gambling, don't gamble because that is the risk. And when you decide to gamble, you accept all the risks.I also don't like it if someone gambles too often because it can make him an excessive gambler. He wouldn't think about anything else except gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "September 01, 2023, 05:21:46 AM",
      "body": "Same. Complaints about their losses. But I do try to not answer them whenever they rant in the chatbox. It's their method of taking out all the anger from losing so much in either casino games or sports betting. If ranting helps, who are we to stop them from making a little noise? It's not like it's going to affect our lives, our bets, or our luck. I just let them be although there are gamblers who rant too long and won't stop saying the same thing over and over again for an hour or two. That's a big eyesore for me. One or two rants should be fine, just letting the bad emotions out and maybe it could make them feel better but doing it nonstop is like a child asking for his money back after he ate his candy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "September 01, 2023, 05:24:54 AM",
      "body": "Quote from: Oasisman on September 01, 2023, 04:47:25 AMQuote from: xSkylarx on September 01, 2023, 04:18:57 AMNot giving tips when they win? Lol.I know you're joking with this, but some people actually hates someone who win and not giving them any tip. Well, I am the one who hates and gets annoyed to the people who's waiting for someone to win to beg for a tip. I knew a lot of people who's like this in a physical casino. When they're drained they just don't go straight to their homes to rest, instead they will come and gather around you and try to give you some advices while you are trying to place a bet so when you eventually win, they'll going to ask for a tip then until they can pool enough money to play another for round. I don't know if people like these exist in other countries, but this seriously annoys me. Having an online casino where we can play at the comfort of our home is an advantage to avoid this kind of people lol. Ya when you cheer for him in a dice wheel and he wins, you expect a tip from them, right?  In the movies set in the 70s where people wear a fedora, they always tip anyone in the casino even the ones who bring them their drinks. People who give tips somehow are prioritized by the servers. This is not happening anymore, that was in the 70s. This time the only one who gets a tip in the casino worthy of it I think is the dealer. But he also gets the blame when the gambler loses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zuzie",
      "created_time": "September 01, 2023, 05:27:41 AM",
      "body": "Quote from: Oasisman on September 01, 2023, 04:47:25 AMQuote from: xSkylarx on September 01, 2023, 04:18:57 AMNot giving tips when they win? Lol.I know you're joking with this, but some people actually hates someone who win and not giving them any tip. Well, I am the one who hates and gets annoyed to the people who's waiting for someone to win to beg for a tip. I knew a lot of people who's like this in a physical casino. When they're drained they just don't go straight to their homes to rest, instead they will come and gather around you and try to give you some advices while you are trying to place a bet so when you eventually win, they'll going to ask for a tip then until they can pool enough money to play another for round. I don't know if people like these exist in other countries, but this seriously annoys me. Having an online casino where we can play at the comfort of our home is an advantage to avoid this kind of people lol. I agree with this, I also don't like gamblers who blame other people when playing slots and losing, even though those who play gambling cannot accept the true reality, that they actually know the risks that gamblers will experience. And I I don't like it when gamblers use too much of their money to gamble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nheer",
      "created_time": "September 01, 2023, 05:52:37 AM",
      "body": "Quote from: Lida93 on September 01, 2023, 03:13:49 AMAs for me I dislike when gamblers complain of their losses, meanwhile you hear them complain when they are getting winnings.Lol this is true, you will never hear their complains when they are winning but come to think of it when you are winning it means everything is going right and there is nothing to complain about and when you are losing that means somethings are not right so that’s where the complaints are coming from. Well i also don’t like the fact that they complain when experiencing a loss, i feel tgey should be aware that the game can go either way so in every game they play they should be expecting a loss. Quote from: Lida93 on September 01, 2023, 03:13:49 AMWhat is the one behaviour you noticed in a gambler and  you dislike it? You don't need to have a reason for disliking it but you just do.What irritates me about them is when they make claims that they are aware that a team would win or lose but they can't explain what made them predict a different outcome. This frequently happens to my brother whenever his predictions goes wrong he would be furious about  how he knew this was going to be the outcome but then why did he pick a different outcome. Whenever he does that it annoys me alot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "September 01, 2023, 05:59:12 AM",
      "body": "Quote from: Lida93 on September 01, 2023, 03:13:49 AMWhat about you, what do you dislike ?There are 2 of behaviors that I don't like from a gambler, regardless of whether there is a strong reason behind it or not, as follows:1. Assume the winnings are yoursOf course, the winnings we make are our money, but do gamblers stop there? the answer is no, this has a negative impact on money allocation management in gambling (this is my personal experience)2. Blaming someone for gambling lossesI come across a lot of people like this, as if all the movements of the people around the gambler have an impact, when the gambler loses in gambling activities, gambler blames everything including the people around.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "September 01, 2023, 06:02:29 AM",
      "body": "I dislike gamblers who are very confident to win such games, so they tend to bet high and expect huge profits. But when they start losing, they end up blaming someone for the losses they incurred when in fact it's their own gambling habit and attitude that made them lose their money. Gambling always depends on pure luck, so at least they should know that they're not just lucky enough to win and never blame others for their unexpected losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 01, 2023, 06:08:52 AM",
      "body": "What kind of behavior is that? Complaining because they are getting winnings? Or are you saying that they are just being arrogant and complain all the time about the situation that they have? That's pretty weird complaining. Can you give me a certain situation that that happened? I think if it's up to me, I would dislike it because of the arrogance thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 01, 2023, 06:29:24 AM",
      "body": "Quote from: Lida93 on September 01, 2023, 03:13:49 AMWhat about you, what do you dislike ?It has something to do with gamblers asking for exclusion and then asking to open their account again and when the casino grants their request they deposit and play and when they lose they ask for a refund because they violated their terms, I don't think they are going to file a complaint if they win a bigger amount.Gamblers should be responsible for all their action, and they should not resort to blaming when losing you just make yourself appear that you lack discipline and have no control over your actions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "September 01, 2023, 06:38:12 AM",
      "body": "You did not say if you wanted information on online or brick n mortar casinos.... so I am going to give you a few on gamblers in brick n mortar casinos. 1. Gamblers that are loud2. Gamblers leaving their casino card in the slot to \"reserve\" it for them ...until they get back from wherever they were. 3. Gamblers that are rubbing the slot screen. (hygiene and they are making it dirty for other people) 4. Gamblers standing behind you and watching you play5. Gamblers sitting next to you and just talking nonsense and not playing. These are just some of the things that irritate me, when I play at a physical casino.... so I prefer to gamble online in the privacy of my own house, where I am not bothered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hirose UK",
      "created_time": "September 01, 2023, 06:55:40 AM",
      "body": "Quote from: Lida93 on September 01, 2023, 03:13:49 AMWhat is the one behaviour you noticed in a gambler and  you dislike it? You don't need to have a reason for disliking it but you just do.As for me I dislike when gamblers complain of their losses, meanwhile you hear them complain when they are getting winnings.What about you, what do you dislike ?There is only 1 thing about gambler behavior that I don't really like namely when a gambler has become an addict and prioritizes gambling more than meeting the needs of his family.From the first time I got to know about gambling until now I have seen quite a lot of cases of the head of a family not paying attention to the economy or finances to support his children and wife but still being able to continue to prioritize gambling so it creates a feeling of pity or being moved by cases like that, actually it's none of my business but when I look at it a child and wife were abandoned because the husband was addicted to gambling there was an emotional feeling and did not accept the incident.A child and wife are the most precious things so that when they see them abandoned anyone who still has pity or conscience will never be able to accept them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "September 01, 2023, 07:07:32 AM",
      "body": "There is this one thing I hate about gambling and it almost make me a no gambler at the time, until I found out that getting addicted to gambling is by choice. Married gamblers that became irresponsible because they believe that gambling was the only way they could have a good home and good life, and as time goes on they end up losing their home, the wife and the children.After all this they still learn nothing, they don't feel bad with the decision they made, like they don't care about the children they had with their wife.It's fine to make mistakes, but not learning from the mistake is very bad, this is a true life experience, one in the family and one outside the family, they acted the same way, they show no remorse, why should their gambling lives affect the future of their children?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "September 01, 2023, 07:10:05 AM",
      "body": "I dislike these gamblers who're saying they're prefer to gamble in No KYC casino and then they actually promoting or gambling in mandatory KYC casino This is completely bullshit, how can your mind and your activity aren't synchronize when you only have one soul. Let's accept the fact you don't have any problem with KYC since you're gamble in KYC casino, so privacy isn't a big thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}