{
  "id": "topic_5456635",
  "title": "shouts",
  "author": "shouts",
  "created_time": "June 17, 2023, 08:22:00 AM",
  "content": "Have you heard of Shouts - Decentralized social network?Recently appeared, looking way more powerfull than Mastadon, Bluesky or any other.Check it out and tell me what you think: https://shouts.social",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456635",
  "comments": [
    {
      "author": "coin-investor",
      "created_time": "June 17, 2023, 09:37:01 AM",
      "body": "Quote from: shouts on June 17, 2023, 08:22:00 AMHave you heard of Shouts - Decentralized social network?Recently appeared, looking way more powerfull than Mastadon, Bluesky or any other.Check it out and tell me what you think: https://shouts.socialIf you are the official representative I'm sure you are, you should create an official announcement for your token and post it here Announcements. Get a copper account and hire a designer to design your announcement, this is the right thing to do if you want to introduce your token here, much more important if you are doing a presale, it will not reach investors if you do not promote your token sale properly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "June 17, 2023, 10:52:13 AM",
      "body": "Good name honestly and if you're trying to develop that, it's going to be a long way to go until you reach a certain number of members that are actively joining your social media.I've seen a lot of social media projects that didn't become successful and that's why this is like a hard niche of focus for a project. I mean every niche is hard when there are big existing companies that are already dominating it. You'll be having a hard time introducing it to the market but you'll need certain time and activeness for you guys to get a lot of active users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "June 17, 2023, 05:50:22 PM",
      "body": "A Web 3.0-based social media platform that provides absolute anonymity would make all the people on this forum happy, but these things don't interest the rest of the world too much. For this reason, such projects that have been tried before did not succeed. People persist in using crappy places like Twitter or Facebook. To be honest, I don't think you can get people's attention because of the strong influence of concepts like popularity and habit.Also, there are known websites like Coinmarketcap and Coingecko in our partners section of your website. I couldn't find any verification on Coinmarketcap and Coingecko. Being listed on Coinmarketcap and Coinecko is commonplace for cryptocurrencies. I don't think it's the right thing to show this as a partnership. However, I would like to say that I like the design of Shouts. I think you did a good job on this. I wish you and your project the best of luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "June 17, 2023, 07:36:24 PM",
      "body": "Quote from: shouts on June 17, 2023, 08:22:00 AMHave you heard of Shouts - Decentralized social network?Recently appeared, looking way more powerfull than Mastadon, Bluesky or any other.Check it out and tell me what you think: https://shouts.socialIf you are this project representative, I recommend that you create another trend that can be qualified as announcement thread since you are obviously doing this to promote your project.I have saw so many social media type project but I haven't seen one that really succeed or made people use their platform constantly. Most of them are old simply copycats of our current social media which doesn't really make people become interested since a established social media is always available.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kemarit",
      "created_time": "June 17, 2023, 08:32:29 PM",
      "body": "Quote from: shouts on June 17, 2023, 08:22:00 AMHave you heard of Shouts - Decentralized social network?Recently appeared, looking way more powerfull than Mastadon, Bluesky or any other.Check it out and tell me what you think: https://shouts.socialHaven't heard of it, not downplaying though, but it's going to be a lot of work on your end if you wanted to be the next Twitter. And we have seen a lot of social media's way back in 2017-2018 era wherein they also says that they are the \"next this and that\". But after the hype of 2017, everything just died down and most of them are gone now or have reinvented themselves.So again, just keep the fire burning in you if you really wanted to compete on this very tough niche.Competitions everywhere so your marketing is a big part of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "June 17, 2023, 08:35:35 PM",
      "body": "even once the title is a failure situation. Because if you want to create a social network, you should create it uniquely, not as an alternative to another social media. As soon as you say this, people automatically become cold. If you want to be successful, you must first get rid of these illusions and similarities. In general, many projects emerged under the name of social media and disappeared from the market with failures. I hope you can be successful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "June 17, 2023, 08:36:02 PM",
      "body": "Quote from: shouts on June 17, 2023, 08:22:00 AMHave you heard of Shouts - Decentralized social network?Recently appeared, looking way more powerfull than Mastadon, Bluesky or any other.Check it out and tell me what you think: https://shouts.socialIf you’re connected with the team better to make a formal announcement, this could be a great project so we want to see the highlights of this site and of course the advantage of a decentralized social platform. We know how Twitter is being corrupted by many scammers, so I think this is a good idea to have a decentralized platform where scammer can no longer be allowed. Though Twitter is too bit to be replaced that easily but I think there’s still a chance for a new social platform, you just need to be more innovative and secured.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 17, 2023, 09:04:25 PM",
      "body": "Quote from: shouts on June 17, 2023, 08:22:00 AM...Check it out and tell me what you think: https://shouts.socialMaybe it would be easier for you to make a full-fledged presentation yourself, telling about all the advantages of this social network? Otherwise, it's all like a task for testers to find something useful that distinguishes shouts.social from other social networks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "20kevin20",
      "created_time": "June 17, 2023, 09:15:07 PM",
      "body": "I think a social network that pays you to post is quite a bad idea and attracts spam and very unnecessary posts. There’s already a lot of people trying to make themselves famous online - imagine you told them they could monetize their Twitter posts lol..Anyway, didn’t we have a lot of attempts at creating such a network in the past? One of them being Faketoshi’s? I honestly think there isn’t much potential there tbh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "June 17, 2023, 09:23:03 PM",
      "body": "Wow it pretty much cool but why not make the site a bit lighter because is very heavy to load completely from my end, I don't know if is from my network or a general problem which everyone is experiencing from their end. Few people above had already made the right suggestion for you on what to do.. Although this isn't the right way to launch your project over here, it should be more concise instead posting for people to view it, I doubt if percentage of people will visit it because they might be afraid of phishing site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "June 17, 2023, 09:26:44 PM",
      "body": "Quote from: tvplus006 on June 17, 2023, 09:04:25 PMQuote from: shouts on June 17, 2023, 08:22:00 AM...Check it out and tell me what you think: https://shouts.socialMaybe it would be easier for you to make a full-fledged presentation yourself, telling about all the advantages of this social network? Otherwise, it's all like a task for testers to find something useful that distinguishes shouts.social from other social networks.The funny thing is that the platform is not fully launched yet and is still at the developmental stage,  this is something we have to look at as one of the weak points and set back self-acclaimedcclaimed Twitter replacer on the decentralized web that will allow users of their platform to monetize their activities on the social media,  my advice to ops is that,  he should concentrate on gaining more userbase before trying to pay users to post to avoid exploitation of that gesture.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "June 17, 2023, 09:39:23 PM",
      "body": "Is this a post to earn social platform? This could be a good idea but I hope it is being regulated well to avoid spam post. Twitter is irreplaceable for now but if there is someone to challenge its superiority then I think it will take a lot of money to do this. This site looks promising though, do you have a plan for any marketing strategy here? Is there any token for this site?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "20kevin20",
      "created_time": "June 18, 2023, 02:04:38 PM",
      "body": "Quote from: Johnyz on June 17, 2023, 09:39:23 PMIs this a post to earn social platform? ..Is there any token for this site? You literally could’ve had your answers if you clicked that website. Yes, there’s a token and yes, it’s a post to earn platform. It took you longer to write your post than it would’ve taken you to click the link and read lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shouts",
      "created_time": "June 19, 2023, 08:12:26 AM",
      "body": "Quote from: blockman on June 17, 2023, 10:52:13 AMGood name honestly and if you're trying to develop that, it's going to be a long way to go until you reach a certain number of members that are actively joining your social media.I've seen a lot of social media projects that didn't become successful and that's why this is like a hard niche of focus for a project. I mean every niche is hard when there are big existing companies that are already dominating it. You'll be having a hard time introducing it to the market but you'll need certain time and activeness for you guys to get a lot of active users.I completely agree with your answer.And also Shouts doesn't want to establish itself as just another Twitter Alternative... the main point is that it's very different from that even if in a way looks a bit similar.Just recently the application has opened where early investors can apply for Shouts Founders Nodes whitelist. If accepted, they get a chance to buy Shouts Founders Nodes early by a starting price. The nodes price will increase for each 100 nodes sold so over a while they may become very expensive.Running Shouts Founders Nodes will help support Shouts Network and each node will generate daily passive rewards in $SHO tokens and random NFT drops from Web3 games from Shouts ecosystem.You can find more information about Nodes and other aspects of the project in DOCS here: https://shouts-1.gitbook.io/shouts-create-grow-earn/You can find Shouts Founders Nodes application form here: https://shouts.social/#/nodesPlease keep in mind that current website is just initial presentation and Shouts is working on a completely new website to allow it's users to create their account, add purchased Founders Nodes licences, 2FA, buy $SHO, withdraw, and will act as your official Shouts Social Network app account.Since Shouts just shown it's presence, any help in terms of sharing and exposure is more than welcome.We can build the next big thing together.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shouts",
      "created_time": "June 19, 2023, 08:24:27 AM",
      "body": "$SHO token sale has not started yet.There will be IFO with MagicFox.fi - which will be accessible trough Shouts official website i think in around 5 days the sale should start. After that $SHO will be added on CoinMarketCap and CoinGecko (Already discussed)Here: https://shouts.social/#/sales$SHO tokens will become tradeable as soon as sale ends.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shouts",
      "created_time": "June 25, 2023, 07:29:02 PM",
      "body": "$SHO token sale is now live on https://app.magicfox.fi/sale/launchpad/shoutsJoin the movement and help rebuild the social networking by supporting Shouts.Any support and help is more than welcome at our early stage as it can help us grow faster.In what area of Shouts are you interested the most?:1. Social network (daily passive income simply by using the platform)2. Shouts Nodes (high daily passive income by running Shouts Nodes to support Shouts network)3. Games (NFTs, Game nodes with daily passive income by supporting game ecosystem)4. Marketplace (Trade and earn)5. Jobs feature (Similar to Fiverr)6. Total DecentralizationLet's build together! We take and consider all suggestions seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shouts",
      "created_time": "June 28, 2023, 04:43:46 AMLast edit: June 28, 2023, 11:23:45 AM by shouts",
      "body": "Announcement:We released new submission form for Shouts Founders and Game Nodes.Current Founders Node price: 1100$ / NodeYou can apply here: https://docs.google.com/forms/d/e/1FAIpQLSf7Lh2zROj2tamcRz3ywxW2FRbimUTNCWT1k8FGfVm92CmG0Q/viewform",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}