{
  "id": "topic_5466910",
  "title": "JohnBitCo",
  "author": "JohnBitCo",
  "created_time": "September 15, 2023, 03:16:47 PM",
  "content": "I was shocked to see Mempool block 807829 took only 1sat/vbyte, when these days we hard to find anything below 12sat/Vbyte.How possible that only this block got confirmed with so less fee  https://mempool.space/block/00000000000000000004ac2c001487440e461a79f249f28af8bf3e7b40494980",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466910",
  "comments": [
    {
      "author": "Bitcoin Smith",
      "created_time": "September 15, 2023, 03:32:35 PM",
      "body": "The block is mined by ViaBTC pool and its a known fact that ViaBTC offers free bitcoin transaction accelerator and paid one too so probably one of the TX with low fee was included in that block.Usually miners prefer the TX with higher fees but it doesn't mean it's always in that way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "September 15, 2023, 03:37:09 PM",
      "body": "Quote from: JohnBitCo on September 15, 2023, 03:16:47 PMI was shocked to see Mempool block 807829 took only 1sat/vbyte, when these days we hard to find anything below 12sat/Vbyte.How possible that only this block got confirmed with so less fee  https://mempool.space/block/00000000000000000004ac2c001487440e461a79f249f28af8bf3e7b40494980I rush to check my pending transaction for more than a week after reading this thread. You got me excited for seeing 1sat/vbyte in there while my transaction is still pending until now with 9sat/vB fee.  I thought the amount of pending transactions will slow down yet it’s volume is stuck withing 500K range that makes the average transaction fee won’t go down below 10sat/vB. I hope this madness already end next week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 15, 2023, 03:49:25 PM",
      "body": "Miners are free to include any valid transactions they want. They usually prioritize transactions based on their fee rate to maximize their profit, but there's nothing prevent them from including transactions with lower fee rates.Take note that miners can even include transactions not paying any fee. A miner (or a mining pool) may include a transaction with lower fee if that's their own transaction or they have been paid for that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 15, 2023, 03:51:00 PM",
      "body": "Quote from: Eternad on September 15, 2023, 03:37:09 PMI rush to check my pending transaction for more than a week after reading this thread. You got me excited for seeing 1sat/vbyte in there while my transaction is still pending until now with 9sat/vB fee.  I thought the amount of pending transactions will slow down yet it’s volume is stuck withing 500K range that makes the average transaction fee won’t go down below 10sat/vB. I hope this madness already end next week. Like Bitcoin Smith said Viabtc offers a free accelerator but we know they don't accept transactions with 1sat/vb on the free accelerator so possible someone who had a stuck transaction with 1sat/vB use their paid service to speed up the transaction.However, not all transactions included on the block are paid in 1sat/vB.Quote from: hosseinimr93 on September 15, 2023, 03:49:25 PMMiners are free to include any valid transaction they want. They usually prioritize transactions based on their fee rate to maximize their profit, but there's nothing prevent them from including transactions with lower fee rates.Take note that miners can even include transactions not paying any fee. Yes, but not all miners since it was mined by Viabtc only the pool operator can do what transactions they want to include on the block they mined not their miners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "September 15, 2023, 04:40:26 PM",
      "body": "Quote from: BitMaxz on September 15, 2023, 03:51:00 PMYes, but not all miners since it was mined by Viabtc only the pool operator can do what transactions they want to include on the block they mined not their miners.Well, there is another block mined with 1 Sat/VB;  block no 807837 and it is again mined by Viabtc.If you notice both of these blocks 807829 and 807837 included only 264 and 159 transactions only, while the other blocks mined in excess of 12+ Sat/VB have thousands of transactions included in them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 15, 2023, 05:22:32 PM",
      "body": "Looks like they have a deal with a conjoin companyhere is the tx idhttps://mempool.space/tx/12a80fa353a38ffba5d94bc85e82208781cb627bec1e5090f69377e91405c75bhundreds of tiny inputs to this addresshttps://mempool.space/address/37Q3iz1k8FCo2DfssdcCHf3MfLT8ckBSg2and this address has had 1800+ points sent to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 15, 2023, 05:32:01 PM",
      "body": "Well viabtc is one of those miners that do things a little different, they allow to some TX to be included in their mined block if they have some minimum fee of 10 Sat/vBBut this is only 1 Sat/vB seems it was some private deal if you look the block in mempool.space All the TX had the label as \"Added\" That means two things- They took those TX from the pending transacctions on mempool.- The transactions were sent privately directly to viasat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 15, 2023, 06:05:49 PM",
      "body": "Quote from: philipma1957 on September 15, 2023, 05:22:32 PMhttps://mempool.space/tx/12a80fa353a38ffba5d94bc85e82208781cb627bec1e5090f69377e91405c75bJust a guess:Maybe, they were consolidating their outputs and they included their own transaction. Quote from: albert0bsd on September 15, 2023, 05:32:01 PMWell viabtc is one of those miners that do things a little different, they allow to some TX to be included in their mined block if they have some minimum fee of 10 Sat/vBIf you are referring to their free accelerator service, the minimum fee rate to be eligible for using their free service is 10 sat/byte, not 10 sat/vbyte. The other requirements are that the transaction size must be less than or equal to 500 bytes and there isn't any unconfirmed parents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albert0bsd",
      "created_time": "September 15, 2023, 06:14:44 PM",
      "body": "Quote from: hosseinimr93 on September 15, 2023, 06:05:49 PMIf you are referring to their free accelerator service, the minimum fee rate to be eligible for using their free service is 10 sat/byte, not 10 sat/vbyte. Yes, my bad, you are correct, I forgot that. One day i try to accelerate a segwit TX with exact 10 Sat/vB but the page said that the TX fee wasn’t enough, in that moment i realize that the minimum fee amount was int Bytes and not in vBytes",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 15, 2023, 06:34:40 PM",
      "body": "Quote from: hosseinimr93 on September 15, 2023, 06:05:49 PMQuote from: philipma1957 on September 15, 2023, 05:22:32 PMhttps://mempool.space/tx/12a80fa353a38ffba5d94bc85e82208781cb627bec1e5090f69377e91405c75bJust a guess:Maybe, they were consolidating their outputs and they included their own transaction. Quote from: albert0bsd on September 15, 2023, 05:32:01 PMWell viabtc is one of those miners that do things a little different, they allow to some TX to be included in their mined block if they have some minimum fee of 10 Sat/vBIf you are referring to their free accelerator service, the minimum fee rate to be eligible for using their free service is 10 sat/byte, not 10 sat/vbyte. The other requirements are that the transaction size must be less than or equal to 500 bytes and there isn't any unconfirmed parents. Yeah I thought that at first. They offer a lot of services. They also have a relationship with coinex so maybe it was something to do with them.  the 450plus deposit were conjoined to a single address for about 0.26 btc deposit.i can check the deposit address to see if it belongs to viabtc as I mine with them and I have a list of some of their payout addresses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "September 15, 2023, 06:45:50 PM",
      "body": "Quote from: philipma1957 on September 15, 2023, 05:22:32 PMLooks like they have a deal with a conjoin companyhere is the tx idhttps://mempool.space/tx/12a80fa353a38ffba5d94bc85e82208781cb627bec1e5090f69377e91405c75bhundreds of tiny inputs to this addresshttps://mempool.space/address/37Q3iz1k8FCo2DfssdcCHf3MfLT8ckBSg2and this address has had 1800+ points sent to it.That's not a coinjoin because there would also need to be hundreds of recipients instead of one and there is also lots of address reuse on the input and output side. This is a dust consolidation from Coinex. It can be quite a headache dealing with thousands of small UTXOs so partnering with a mining pool can be a good idea to prevent this situation from becoming unmanageable and having coins stuck for a very long time because paying the normal mining fee in times of congestion would consume almost the entirety of your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 15, 2023, 10:35:34 PM",
      "body": "Quote from: FinneysTrueVision on September 15, 2023, 06:45:50 PMQuote from: philipma1957 on September 15, 2023, 05:22:32 PMLooks like they have a deal with a conjoin companyhere is the tx idhttps://mempool.space/tx/12a80fa353a38ffba5d94bc85e82208781cb627bec1e5090f69377e91405c75bhundreds of tiny inputs to this addresshttps://mempool.space/address/37Q3iz1k8FCo2DfssdcCHf3MfLT8ckBSg2and this address has had 1800+ points sent to it.That's not a coinjoin because there would also need to be hundreds of recipients instead of one and there is also lots of address reuse on the input and output side. This is a dust consolidation from Coinex. It can be quite a headache dealing with thousands of small UTXOs so partnering with a mining pool can be a good idea to prevent this situation from becoming unmanageable and having coins stuck for a very long time because paying the normal mining fee in times of congestion would consume almost the entirety of your funds.Nice work I think you nailed it perfectly.Coinex and viabtc have partnered for years so it only makes sense that coinex has a consoldating setup with them.I used to use coinex but they no longer accept usa customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 16, 2023, 02:33:52 PM",
      "body": "If it was CoinEx the question is why would they pay a fee at all? As pointed out they are very tightly integrated with VIABTC. CoinEx would just have to create a 0 fee TX and send them the hash and have VIA mine it. Would in theory never even have to be broadcast and put in the mempool.Probably does not really matter in the end.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "September 16, 2023, 03:10:14 PM",
      "body": "Quote from: DaveF on September 16, 2023, 02:33:52 PMIf it was CoinEx the question is why would they pay a fee at all? As pointed out they are very tightly integrated with VIABTC. CoinEx would just have to create a 0 fee TX and send them the hash and have VIA mine it. Would in theory never even have to be broadcast and put in the mempool.Probably does not really matter in the end.-DaveA conjecture that I have is that their mempool doesn't accept zero-fee transaction given how it is non-standard for most nowadays. It would be far easier to broadcast the transaction directly to their nodes and use the TXID to filter those into a block, as opposed to having them manually inserted into their mempool.It likely wouldn't have gotten a good propagation regardless, if their intent was to broadcast to the network, instead of directly to their mempool. The minrelayfee is certainly far higher than 1sat/vbyte.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "September 16, 2023, 03:38:33 PMLast edit: September 16, 2023, 03:52:02 PM by philipma1957",
      "body": "Quote from: DaveF on September 16, 2023, 02:33:52 PMIf it was CoinEx the question is why would they pay a fee at all? As pointed out they are very tightly integrated with VIABTC. CoinEx would just have to create a 0 fee TX and send them the hash and have VIA mine it. Would in theory never even have to be broadcast and put in the mempool.Probably does not really matter in the end.-Davethey may want it to be broadcast and put in the mempool so that chinese government can easily see it.Low cost and nice paper trail would be attractive if they need to account to chinese government.I am assuming viabtc has to deal with government of china 🇨🇳 not sure about coinex.under 20 bucks clear paper trail. I wonder if they do 10 or 15 of these a month. Small cost to keep a government accepted set of records.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "September 16, 2023, 06:26:27 PM",
      "body": "Quote from: philipma1957 on September 16, 2023, 03:38:33 PMQuote from: DaveF on September 16, 2023, 02:33:52 PMIf it was CoinEx the question is why would they pay a fee at all? As pointed out they are very tightly integrated with VIABTC. CoinEx would just have to create a 0 fee TX and send them the hash and have VIA mine it. Would in theory never even have to be broadcast and put in the mempool.Probably does not really matter in the end.-Davethey may want it to be broadcast and put in the mempool so that chinese government can easily see it.Low cost and nice paper trail would be attractive if they need to account to chinese government.I am assuming viabtc has to deal with government of china 🇨🇳 not sure about coinex.under 20 bucks clear paper trail. I wonder if they do 10 or 15 of these a month. Small cost to keep a government accepted set of records.Mempool really does not matter, it's what is in the mined block. That is the permanent record of what happened. There are 1000s of TX in the mempool at the moment that will never be mined. So either CoinEX creates a TX and passes the TXID to VIA to be mined.Or they create a TX and pass the raw info to VIA to be mined. Either way there is an email / Telegram conversation / WhatsApp / whatever between them.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 17, 2023, 05:58:47 AM",
      "body": "ViaBTC does have a Paid Service for their so called \"accelerator\" that accepts the payment (the fee that won't show up in the block) in BTC, BCH or LTC. So it is possible that such low paying transactions in these blocks paid the additional fee in a shitcoin like bcash to get their bitcoin transactions included in the block. In fact this is a good way to get rid of your shitcoins without having to sell them...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "September 17, 2023, 09:35:49 AM",
      "body": "Quote from: DaveF on September 16, 2023, 02:33:52 PMIf it was CoinEx the question is why would they pay a fee at all? As pointed out they are very tightly integrated with VIABTC. CoinEx would just have to create a 0 fee TX and send them the hash and have VIA mine it. Would in theory never even have to be broadcast and put in the mempool.They are not just tightly integrated, they are almost the same company, both founded by Haipo Yang who acts as both their CEO.Probably they just wanted to avoid the troubles and play as close as to the book possible, they could have done it for 0 or 100sat/b the cost would eventually the same, the difference is only which pocket pays for the other.The funny thing is that maybe Coinex is scrapping for all the dust they can find now, without ViaBTC those consolidations might be something they really can't afford after that hack. Or maybe it's ViaBTc sending everything they can find to cover the balance sheet!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "September 17, 2023, 02:50:46 PM",
      "body": "Quote from: JohnBitCo on September 15, 2023, 03:16:47 PMI was shocked to see Mempool block 807829 took only 1sat/vbyte, when these days we hard to find anything below 12sat/Vbyte.How possible that only this block got confirmed with so less fee  https://mempool.space/block/00000000000000000004ac2c001487440e461a79f249f28af8bf3e7b40494980Never get fooled by when you see such a low transaction fee in block, always check audit status. In this case, you can clearly see Audit status: Added, that means, transaction was manually added by pool.If you want to calculate transaction fee yourself, always check the audit status of transactions in new generated blocks, otherwise you'll think that 1 sat/vByte transaction fee managed to get confirmed in that block, so, you may send transaction with such a low fee and finally will be forced to increase transaction fee if you send it RBF enabled, otherwise you'll have to wait till it gets forgotten by nodes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}