{
  "id": "topic_5446401",
  "title": "digaran",
  "author": "digaran",
  "created_time": "March 26, 2023, 09:08:56 PMLast edit: January 20, 2024, 07:36:52 AM by digaran",
  "content": "🖤",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446401",
  "comments": [
    {
      "author": "navisilver",
      "created_time": "March 27, 2023, 08:40:51 AM",
      "body": "An FPGA miner is a type of cryptocurrency mining hardware that uses FPGAs to perform the computational work required to mine cryptocurrencies.FPGAs are integrated circuits that can be programmed after manufacture to perform specific functions.Unlike ASICs, which are designed for a specific cryptocurrency algorithm, FPGAs can be reprogrammed to mine different cryptocurrencies or different algorithms. To program an FPGA crypto miner to mine a specific algorithm, you would need to write code in a Hardware Description Language (HDL) such as Verilog or VHDL.There are also open-source FPGA development platforms and communities that can provide resources and support for learning HDL programming.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "navisilver",
      "created_time": "March 27, 2023, 08:07:30 PM",
      "body": "not from google noob",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "March 27, 2023, 11:28:08 PM",
      "body": "Usually FGPA mining is profitable before ASICs and becomes unprofitable right after. Usually they are a scale up from GPU mining because depending on the hardware or how its coded, it can use much less power than a power hungry GPU. However once an ASIC hits the market then its game over for any GPUs or FGPA.FGPA is also very expensive and there is a supply issue, its difficult to buy in large quantities.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "March 27, 2023, 11:53:07 PM",
      "body": "Quote from: navisilver on March 27, 2023, 08:07:30 PMnot from google noob Don't try to act smart, lolWe all know your text is likely from a chatbot or some search engine. Copied and pasted information is very easy to identify. If you don't know about something that is being asked. It's better you just ignore it rather than embarrass yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "March 28, 2023, 03:38:12 AMLast edit: March 28, 2023, 05:31:50 AM by JayDDee",
      "body": "Quote from: Bitcoin_Arena on March 27, 2023, 11:53:07 PMQuote from: navisilver on March 27, 2023, 08:07:30 PMnot from google noob Don't try to act smart, lolYet it was the only post (including this one) that answered the questions as asked. Maybe the questions is the problem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "March 28, 2023, 11:15:52 AM",
      "body": "Even if you don’t like Google, it’s better to start studying miners from well-known manufacturers1) Xilinx Inc.2) Altera Corporation.3) Lattice Semiconductor.4) Achronix.5) QuickLogic Corporation.6) Microchip Technology.7) Microsemi Corporation. Efinix.Study FPGA from each manufacturer, calculate the payback and purchase cost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "March 28, 2023, 03:23:26 PM",
      "body": "FPGAs are good for new algorithms when time or funds aren’t available to develop an ASIC miner for that algorithm. They were a big part of mining for the short period in time between GPU mining and ASIC mining. Back in 2012 if you had an FPGA BTC miner you were printing money. The evolution of mining went from…CPU->GPU->FPGA->ASIC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "March 29, 2023, 09:26:43 AM",
      "body": "Quote from: digaran on March 28, 2023, 08:33:24 PMWow, really appreciate the replies.What I understand is that we could repurpose a FPGA device to do whatever we want. The idea of an ASIC is that you hard code it physically to do the only one task which is mining, but FPGA is like a raw ASIC, where you could introduce whatever functions you want.I'm interested in using them for brute force and new revolutionary attack methods in order to improve the security of cryptocurrencies. Just in case you haven't noticed, nobody is going to share their findings about vulnerabilities because this is a decentralized jungle where knowing about weaknesses is considered as a score against the rest of the world.~dig.There are also asics that can mine several algorithms. These are Baikal asics, but not all mining modes are profitable. If you buy an FPGA, then you will depend on the development team and on the speed of releasing new updates to mine new coins. And it's not free, many manufacturers charge you to upgrade your FPGA software if you need maximum performance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "April 02, 2023, 01:37:51 PM",
      "body": "E300 14Gh/s Kaspa Hash Rate - analogue of 14 video cards RTX3080https://www.ospreyelectronics.io/product-page/e300-180m-eth-hash-rateIt seems that the first FPGA miner (not an ASIC) for mining KASPA (KAS) and its kHeavyHash algorithm might be out now — the Osprey Electronics E300. The device is apparently capable of 14 GH/s hashrate on the kHeavyHash algorithm with power usage of 250–500 Watts depending on settings with future support for ERG and RXD claimed. According to the manufacturer of these devices the E300 is based on Xilinx UltraScale+ VU35P FPGA technology and each miner comes with 3 Hash Boards + 1 Control Board, with each hash board having one Xilinx VU35P (872K LUT, 224Mb on-chip RAM, 8GB HBM2, 420 GB/s Bandwidth) and the control board is based on Xilinx Zynq 7010. The price of the miner on the official website is $4999 USD and it is currently listed as out of stock.https://medium.com/crypto-blog/the-first-kaspa-fpga-miner-osprey-electronics-e300-14-gh-s-kheavyhash-miner-2a8e5908cd1dKaspa FPGA Mining - Xilinx C1100https://www.youtube.com/watch?v=HAsa49iDMmY",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "April 04, 2023, 11:54:56 AM",
      "body": "Quote from: digaran on April 03, 2023, 04:20:31 PMQuote from: safar1980 on April 02, 2023, 01:37:51 PME300 14Gh/s Kaspa Hash Rate - analogue of 14 video cards RTX3080https://www.ospreyelectronics.io/product-page/e300-180m-eth-hash-rateIt seems that the first FPGA miner (not an ASIC) for mining KASPA (KAS) and its kHeavyHash algorithm might be out now — the Osprey Electronics E300. The device is apparently capable of 14 GH/s hashrate on the kHeavyHash algorithm with power usage of 250–500 Watts depending on settings with future support for ERG and RXD claimed. According to the manufacturer of these devices the E300 is based on Xilinx UltraScale+ VU35P FPGA technology and each miner comes with 3 Hash Boards + 1 Control Board, with each hash board having one Xilinx VU35P (872K LUT, 224Mb on-chip RAM, 8GB HBM2, 420 GB/s Bandwidth) and the control board is based on Xilinx Zynq 7010. The price of the miner on the official website is $4999 USD and it is currently listed as out of stock.https://medium.com/crypto-blog/the-first-kaspa-fpga-miner-osprey-electronics-e300-14-gh-s-kheavyhash-miner-2a8e5908cd1dKaspa FPGA Mining - Xilinx C1100https://www.youtube.com/watch?v=HAsa49iDMmYThat is 14GH/s for another algo, what I want to know is the best FPGA for SHA-256, as ASIC is out of reach to configure for something other than mining, I figured the best option is FPGA, which I would like to know more about.Why use an FPGA for bitcoin mining when there are many modern ASICs out there? FPGAs work better for altcoins until ASICs came along.FPGAs outperform video cards in mining, but in appearance, FPGAs in a box look like ASICs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "April 05, 2023, 07:15:33 PM",
      "body": "Quote from: digaran on April 05, 2023, 06:00:35 PMBecause I'm not interested to mine bitcoin, however I want something more powerful than GPUs to do double hashing, but I want to change the inputs and the software, since we can't change ASIC to do something other than mining.Are you an FPGA developer? Of course not because you wouldn't be asking such naive questions if you were.But you need to be to do what you want, or pay someone who is to do it for you.Just because FPGA programs are written in code it doesn't mean it's software.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "April 06, 2023, 11:06:24 AM",
      "body": "Quote from: digaran on April 05, 2023, 06:00:35 PMBecause I'm not interested to mine bitcoin, however I want something more powerful than GPUs to do double hashing, but I want to change the inputs and the software, since we can't change ASIC to do something other than mining.Do you want to code better than FPGA manufacturers to mine coins?It may happen that the equipment becomes obsolete and you have to buy new equipment. And you will not be able to recoup the old equipment. But I haven't seen anyone write code better than hardware developers yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babymethyl2013",
      "created_time": "April 13, 2023, 02:35:58 AM",
      "body": "All the new coins pumping this round Nexa, Radiant, Dynex, and kaspa have one thing in common....they are being mined by FPGAs and the people mining it are the same ones pumping the price.All of these algos are \"unique\" and that's right they are!....they are unique and the Devs and backers to the coins have had the bitstreams required to mine them since day 1. The few coins GPU miners get and sell are their costs to pump. They make money from the non-miners and Binance degens they suck in from all the youtube \"MaKe 100x ToDaY\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "April 13, 2023, 12:56:20 PM",
      "body": "Quote from: babymethyl2013 on April 13, 2023, 02:35:58 AMAll the new coins pumping this round Nexa, Radiant, Dynex, and kaspa have one thing in common....they are being mined by FPGAs and the people mining it are the same ones pumping the price.All of these algos are \"unique\" and that's right they are!....they are unique and the Devs and backers to the coins have had the bitstreams required to mine them since day 1. The few coins GPU miners get and sell are their costs to pump. They make money from the non-miners and Binance degens they suck in from all the youtube \"MaKe 100x ToDaY\"Share information about Nexa, Radiant, Dynex mining with FPGA. Not all coins are profitable to mine using FPGA, because mining on video cards is more profitable and cheaper. But you can mine Casp and buy another coin after the sale. But you won't interfere with GPU miners.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "April 13, 2023, 03:14:24 PM",
      "body": "Quote from: navisilver on March 27, 2023, 08:07:30 PMnot from google noob Thats right noob , not from Google but from a other Webpage and source without the Links that should be normal added !Quote from: navisilver on March 27, 2023, 08:40:51 AMAn FPGA miner is a type of cryptocurrency mining hardware that uses FPGAs to perform the computational work required to mine cryptocurrencies.FPGAs are integrated circuits that can be programmed after manufacture to perform specific functions.Unlike ASICs, which are designed for a specific cryptocurrency algorithm, QuoteAn FPGA miner is a type of cryptocurrency mining hardware that uses FPGAs to perform the computational work required to mine cryptocurrencies.FPGAs are integrated circuits that can be programmed after manufacture to perform specific functions.Unlike ASICs, which are designed for a specific cryptocurrency algorithm,Source : https://preview.grandoil37.ru/miweb2/kaspa-fpga-mining.htmlQuote from: navisilver on March 27, 2023, 08:40:51 AMThere are also open-source FPGA development platforms and communities that can provide resources and support for learning HDL programming.QuoteThere are also open-source FPGA development platforms and communities that can provide resources and support for learning HDL programming.Source : https://zotmdqe.toplandriskmanagement.com/post/achronix-fpga-development-board/49170038So yeb this can be seen as plagiarism / copy and paste thing as you not have added the Source Links from where you have the Information.Quote from: Bitcoin_Arena on March 27, 2023, 11:53:07 PMDon't try to act smart, lolWe all know your text is likely from a chatbot or some search engine. Copied and pasted information is very easy to identify. If you don't know about something that is being asked. It's better you just ignore it rather than embarrass yourself. Yeb you are right it was copied and pasted",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "April 13, 2023, 04:13:08 PM",
      "body": "Quote from: Lafu on April 13, 2023, 03:14:24 PMSo yeb this can be seen as plagiarism / copy and paste thing as you not have added the Source Links from where you have the Information.I'm leaning more toward sarcasm than plagiarism, a case of if you want a better answer ask a better question.Plagiarism implies the \"author\" intends to take credit for what was written by others because it has value. The plagiarisedtext is so generic it could be considered obvious and not worthy of copyright protection, but IANAL so just speculating.Although it may have technically been plagiarism I think it was intended sarcastically and not an attempt to show off any expertisein the subject.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lafu",
      "created_time": "April 13, 2023, 04:26:46 PM",
      "body": "Quote from: JayDDee on April 13, 2023, 04:13:08 PMI'm leaning more toward sarcasm than plagiarism, a case of if you want a better answer ask a better question.Plagiarism implies the \"author\" intends to take credit for what was written by others because it has value. The plagiarisedtext is so generic it could be considered obvious and not worthy of copyright protection, but IANAL so just speculating.Although it may have technically been plagiarism I think it was intended sarcastically and not an attempt to show off any expertisein the subject.Makes no difference if it was meant to be intended sarcastically or not , if there is no source link to the webpage or article its plagiarised.But you know that and i guess if you add something to your miner code from somewhere you also add the Info from where you have it or ?I just wanted to point it out and show that it was not his words and work what a FPGA miner is , so sorry for possible off topic.Its also a reason for getting banned here on the Forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JayDDee",
      "created_time": "April 14, 2023, 12:59:50 AM",
      "body": "Quote from: Lafu on April 13, 2023, 04:26:46 PMMakes no difference if it was meant to be intended sarcastically or not , if there is no source link to the webpage or article its plagiarised.But you know that and i guess if you add something to your miner code from somewhere you also add the Info from where you have it or ?I just wanted to point it out and show that it was not his words and work what a FPGA miner is , so sorry for possible off topic.Its also a reason for getting banned here on the Forum. Banning is harsh. This isn't a published paper, just a flippant reply stating the obvious answer to a foolish question.Plagiarism is a matter of ethics unlike copyright with is a matter of law. Intent and context matter for both.Regarding the code I import and the code others import from me, I make an effort but I can't guarantee there are no violations.I'd hate to be condemned for any. What I find offensive is importing open source code then not publishing the source for thederived product.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "April 14, 2023, 01:28:38 PM",
      "body": "Another FPGA miner-U50C Minerhttp://www.midaslabs.net/#/homeFPGA bitstream is a file that contains the programming information for the FPGA chip. midasminer_u50c is our specific bitstream for FPGA to behave as a miner. U50c with HBM can mine Ethereum faster because HBM allows the accelerators to perform memory-hard compute tasks much faster than existing technology.https://github.com/midaslabs/midasminer_u50cv1.3.2 Latest@midaslabs midaslabs released this Sep 12, 2022https://github.com/midaslabs/midasminer_u50c/releases/tag/v1.3.2But I was very interested in this information.https://hashrate.no/fpgas/U50C/KASHashrate   3980.00 Mh/sEfficiency   40.61 Mh/WPower   98 wattExcellent performance for mining!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}