{
  "id": "topic_5469776",
  "title": "Ar1111",
  "author": "Ar1111",
  "created_time": "October 09, 2023, 04:15:01 PM",
  "content": "A preview:AbstractBitVM is a computing paradigim to express Turing-complete bitcoin contracts.This requires no changes to the network's consenus rules. Rather than executing computations on Bitcoin, they are merely verified.....Discussion and full paper herehttps://stacker.news/items/278962/r/02b7622c79 Some Pictures of the paper https://image.nostr.build/cbf26ea78c1fa9c29a99ebdd043badc71a8c6abe3797f908d91b617add80b101.jpg",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469776",
  "comments": [
    {
      "author": "cygan",
      "created_time": "October 09, 2023, 05:27:15 PM",
      "body": "this is probably the most exciting discovery in the history of Bitcoin scripting. it seems to knock down virtually every door, giving us access to agreements, sidechains, and powers similar to liquid or evm, all at once, with no forks required.you can read the whole whitepaper from Robin Linus in the link belowhttps://bitvm.org/bitvm.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "October 09, 2023, 05:56:05 PM",
      "body": "Why do we need to compute any thing on chain? I mean if there is something useful for a simple end user, sure but why do we need to have smart contracts on chain?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HmmMAA",
      "created_time": "October 09, 2023, 06:51:38 PM",
      "body": "Quote from: cygan on October 09, 2023, 05:27:15 PMthis is probably the most exciting discovery in the history of Bitcoin scripting. it seems to knock down virtually every door, giving us access to agreements, sidechains, and powers similar to liquid or evm, all at once, with no forks required.you can read the whole whitepaper from Robin Linus in the link belowhttps://bitvm.org/bitvm.pdfWe wasted many years as this concept was mentioned for the first time about 8 years ago . Probably i will get attacked but pointing facts isn't a bad thing  https://youtu.be/LdvQTwjVmrE?t=1004 Pay attention to the part that Szabo says : \" I have not heard that opinion before . I've never heard anyone call the bitcoin script turing complete , i don't believe that's accurate \"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "satscraper",
      "created_time": "October 09, 2023, 07:07:55 PM",
      "body": "Purely for academic interest so far, as the proposed model relies on off-chain computations between two sides  one of which is a  prover while the other - a verifier. Extension of the  proposed model   to the parallel computation  with multiple parties involved would be the  challenging task. Do we really need such contracts in the existing  well functioning  mainnet? I don't think so. If academics wanna practice in the testnet, why not. Testnet will endure their jackboot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kruw",
      "created_time": "October 10, 2023, 04:10:56 AM",
      "body": "What sort of useful things can you do with Turing completeness?  They mention games like Chess, Poker, and Go.  I know of a crude version Bitcoin chess that already exists - https://www.youtube.com/watch?v=FHwgr8gzzT0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 10, 2023, 09:11:31 AM",
      "body": "This basically unlocks smart contracts.However, as noted in the paper, it is very inefficient to express everything in logic gates. A single gate, which would be expected to be used along with thousands or millions of other gates to work an instruction (depending on how small your transistors are), takes so many opcodes to calculate. I am not sure what the solution to this would be in terms of implementing higher-level instructions - at the very least, ASM instructions like the ones used in the Etherum virtual machine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "October 10, 2023, 10:39:06 AM",
      "body": "Does Ethereum have a future if this pans out?First NFTs (Ordinals) and now Turing-complete smart contracts... it seems BTC can do everything ETH can, but with a much stronger network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 10, 2023, 10:49:14 AM",
      "body": "Quote from: cryptosize on October 10, 2023, 10:39:06 AMDoes Ethereum have a future if this pans out?First NFTs (Ordinals) and now Turing-complete smart contracts... it seems BTC can do everything ETH can, but with a much stronger network.Well we already saw headless chickens people rush to create a token layer (BRC20) on top of Bitcoin using experimental pieces of software and design practices that were not even reviewed properly, so I guess you can expect people to do just about anything with these \"bitcoin smart contracts\" once they gain traction.Having said that though, there's already a lot of deployments of contracts onto Ethereum and people are not just going to drop their bags and switch, especially if they already have a good business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "October 10, 2023, 11:09:56 AM",
      "body": "Quote from: cygan on October 09, 2023, 05:27:15 PMhttps://bitvm.org/bitvm.pdfI only skimmed it, but i find this part is interesting.Quote from: https://bitvm.org/bitvm.pdfThe Taptree might become huge and have a billion Tapleaf Scripts, but its on-chain footprint is minimal.Billion sounds impossible and after re-reading BIP 342 there are 3 resource limit regarding Taproot,Quote from: https://github.com/bitcoin/bips/blob/master/bip-0342.mediawiki#user-content-Resource_limitsSigops limit The sigops in tapscripts do not count towards the block-wide limit of 80000 (weighted). Instead, there is a per-script sigops budget. The budget equals 50 + the total serialized size in bytes of the transaction input's witness (including the CompactSize prefix). Executing a signature opcode (OP_CHECKSIG, OP_CHECKSIGVERIFY, or OP_CHECKSIGADD) with a non-empty signature decrements the budget by 50. If that brings the budget below zero, the script fails immediately. Signature opcodes with unknown public key type and non-empty signature are also counted..Stack + altstack element count limit The existing limit of 1000 elements in the stack and altstack together after every executed opcode remains. It is extended to also apply to the size of initial stack.Stack element size limit The existing limit of maximum 520 bytes per stack element remains, both in the initial stack and in push opcodes.In particular, it looks like sigops and stack limit would be main limitation about complexity of script/smart contract.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "October 10, 2023, 12:29:37 PM",
      "body": "There are a few summary articles already out there for the less technical like myself:The Big Deal With BitVM: Arbitrary Computation Now Possible on Bitcoin Without a Fork and LightningNetworkBitVM: Ushering in a New Era of Bitcoin ComputationsA simple explanation of BitVMPing me if you see any other valuable resource.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "October 10, 2023, 04:08:32 PM",
      "body": "Quote from: cygan on October 09, 2023, 05:27:15 PMthis is probably the most exciting discovery in the history of Bitcoin scripting. it seems to knock down virtually every door, giving us access to agreements, sidechains, and powers similar to liquid or evm, all at once, with no forks required.you can read the whole whitepaper from Before we become interested in any open-source/Bitcoin project, we have to check how easily the developer is able to explain the concept, otherwise we become more careful or suspicious. If it can't be explained clearly & simply to the understanding of most Bitcoin users, it's a sign they don't really want it to be public/opensource & it could end up centralized/private, if it's not already is... Or they really don't understand what they are talking about...so we need to be really careful with projects the developers don't clearly/simply explain. Smart-contract, Sidechains, VMs etc, can exist together, independent of the Bitcoin Mainchain without compromising on any of the Bitcoin principles... *Not compromising* makes it part of the Bitcoin Network. Most important of all is that it can be light weight, easy-to-run & easy-to-understand by any user....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ar1111",
      "created_time": "October 10, 2023, 05:55:16 PM",
      "body": "An explanation of how BitVM works:https://bitcoinmagazine.com/technical/the-big-deal-with-bitvm-arbitrary-computation-now-possible-on-bitcoin-without-a-forkAnother one there:https://stacker.news/items/279945/r/02b7622c79",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "October 11, 2023, 09:29:29 AM",
      "body": "Thanks for the \"simple explain\" links for people like me.My recurring questioning goes down this line though: I enjoy reading these developments but am far more interested in simple tools that make use of these kinds of tech easy to use without technical knowhow. I'm not a fan on inscriptions but the way ordinalswallet and others made it easy for dumbos to inscribe is an example of a useful tool making use of a tech for dummies.I've been waiting/looking for yonks for the simplest use case of smart contracts on Bitcoin I can think of: escrow. After a decade on this forum, we're still using human trust for the simplest escrows.Why not make a simple escrow tool following the concept of Peggy's timelocked bet in the explanation linked by fillippone? I'm not smart enough to know it's doable but if Peggy's condition can be verified by Bitcoin's network, couldn't it also, with the right coding, prove conditions for many of the things we use on this forum for escrow? Or must it only rely on computable outcomes?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 11, 2023, 05:12:49 PM",
      "body": "Quote from: buwaytress on October 11, 2023, 09:29:29 AMWhy not make a simple escrow toolThe problem with escrow is that it needs \"some input\" from real life. If I buy a collectible coin, the only way for the escrow to know for sure the seller sent it, is by personally verifying it. I don't think this can be automated in case there's a dispute.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "October 11, 2023, 09:49:52 PM",
      "body": "Quote from: digaran on October 09, 2023, 05:56:05 PMWhy do we need to compute any thing on chain? I mean if there is something useful for a simple end user, sure but why do we need to have smart contracts on chain?Because we have decentralized money but have very few ways to usebit aside from the standard sending and receiving of UXTOs. If we can get compute on chsin, native applications can be built directly on bitcoin without needing to needing to wrap/unwrap bitcoin just because you want to take part in a decentralized lending protocol on an EVM chain for example.Imo, this is huge for Bitcoin. It was impossible before now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 12, 2023, 11:07:13 AM",
      "body": "Quote from: nelson4lov on October 11, 2023, 09:49:52 PMQuote from: digaran on October 09, 2023, 05:56:05 PMWhy do we need to compute any thing on chain? I mean if there is something useful for a simple end user, sure but why do we need to have smart contracts on chain?Because we have decentralized money but have very few ways to usebit aside from the standard sending and receiving of UXTOs. If we can get compute on chsin, native applications can be built directly on bitcoin without needing to needing to wrap/unwrap bitcoin just because you want to take part in a decentralized lending protocol on an EVM chain for example.Imo, this is huge for Bitcoin. It was impossible before now. Well, the foundation is there, but as has already been mentioned in this thread, this in its current form is prohibitively slow.This development is akin to the years when research papers discovered the modern capabilities of AI, but there was no infrastructure to take advantage of that at the time, so it was largely an academic thing, like today with the BitVM whitepaper.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "October 12, 2023, 12:53:32 PM",
      "body": "Quote from: NotATether on October 12, 2023, 11:07:13 AMQuote from: nelson4lov on October 11, 2023, 09:49:52 PMQuote from: digaran on October 09, 2023, 05:56:05 PMWhy do we need to compute any thing on chain? I mean if there is something useful for a simple end user, sure but why do we need to have smart contracts on chain?~Snipped Well, the foundation is there, but as has already been mentioned in this thread, this in its current form is prohibitively slow.This development is akin to the years when research papers discovered the modern capabilities of AI, but there was no infrastructure to take advantage of that at the time, so it was largely an academic thing, like today with the BitVM whitepaper.Affirmative. I was only elaborating on the potential benefits if it was actually implemented. Since BitVM is akin to a limited version of the EVM and also the restrictions with scripting, It would be a long ride to launch but it's just intriguing to know it is possible to do compute on bitcoin even if it's just theoretically now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cygan",
      "created_time": "October 12, 2023, 01:48:03 PM",
      "body": "i have 4 interesting slides for you, which take up this new topic and maybe show it to us with an example in a visual way to understand it better:  https://twitter.com/BTCillustratedi also don't want to keep this tweet from @BobBodily from you. in this tweet he does a first update in which he describes some very interesting things - but see and read for yourself:https://twitter.com/BobBodily/status/1711942512603181145",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 12, 2023, 04:01:59 PM",
      "body": "Quote from: LoyceV on October 11, 2023, 05:12:49 PMQuote from: buwaytress on October 11, 2023, 09:29:29 AMWhy not make a simple escrow toolThe problem with escrow is that it needs \"some input\" from real life. If I buy a collectible coin, the only way for the escrow to know for sure the seller sent it, is by personally verifying it. I don't think this can be automated in case there's a dispute.I agree. I understand the idea and objective of this BitVM, but what is its real use for Bitcoin users' daily lives?Honestly, it seems more noise than anything else to me. This is not to say that it is not good for new proposals to appear to do different things. But, I've read a lot of information about the purpose of BitVM and I can't see what the use of it is.OK. They will say it is to make smart contracts, like other networks do. But why have to do it on the Bitcoin network?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}