{
  "id": "topic_5465583",
  "title": "Fivestar4everMVP",
  "author": "Fivestar4everMVP",
  "created_time": "September 04, 2023, 08:15:37 AM",
  "content": "First, let me mention that this is supposed to be a  post for the gambling board, but since Waje games is only serving Nigerians, and maybe some parts of Africa only, I decided our local community will be the best appropriate place to post this, this my personal review of this new gaming/gambling app..Waje games is a new and very popular gaming/gambling app any one can download from Google play store or iphone app store, they have their Google ads running and this ads is shown or displayed on almost every app on your phone that supports display of Google ads, they also have ads running on Facebook and some other social media platforms, so if you have not come across Waje games ad on the internet, then it probably means you are not an aggressive user of the internet like myself ..I cam across Waje games through their ad, and after seeing same ads for several weeks, I decided to download and try the game, interestingly , the app contained various type of very interesting games like whot-whot (which is my personal favorite and I am also very good at this game) Roulette and several others , I quickly signed up and if I still remember , I was given a 50 naira sign up bonus, I used the 50 naira to play whot-whot, I won several of the games and in just 3 or four games , 50 naira became 500 naira and more, but i went all in one round and it turned bad, I was beaten by my opponent and I lost all the money ..Finding the game very interesting by now, I had to deposit 3000 naira to still continue trying the game, after my deposit was successfully recorded in the app., I discovered that the system/game set up completely changed, now the minimum I can bet on each round of the game was 100 naira, on like before when I can bet any amount, even 5 naira if I want,  and also , previously , they paired me with just one other player which made winning the whot-whot game pretty easy for me, now that they had my real money, the system now paired me with extra three players which drastically reduced my winning chances by more than 99 percent, and the worst part is, those extra 3 players they paired me with, 2 are always bots, a computer program, while only 1 will be a real person/player..  The long story short is that, I played and played, this computer program was always winning and winning, until my entire 3000 naira was gone in just about 1 to 2 hours, they don't allow you to choose the number of players you want to be paired with, they just impose a four man game on you and make sure you never win until your whole balance is drained..After my bankroll became empty, I personally knew the entire game was super rigged and refused to deposit money anymore, but rather, I start playing the game in free mode, after 3 rounds of playing in free mode, they locked me out and asked me to deposit money if I want to continue playing 🎴🎴🎴.. Conclusion is - Waje game is a complete rigged game, I think it is not out of place to say that this gaming app was developed by scammers to use as a medium to defraud Nigerian gamblers, avoid this gaming app if you gave never tried it before and want to or have plans to one day, try them out ..If you have actually tried this gaming app, what is your experience like?, Please share .",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465583",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 04, 2023, 08:27:27 AM",
      "body": "The game was luached late last year, 2022. I have not tried any play to earn game before and I thought you will not deposit anything but play for free from how I did saw the ad pop ups with those girls and a guy with sugar-coated mouth. I did not know that it is gambling. Although, I should have known, but I am just knowing right now.I always disregard anything that I see about money online, especially the ones that do not look real. Example is the Waje game that those advertisers keep saying they did not deposit anything but won over ₦70000 in a week. Another example which is not about this discussion are those loan apps that give fake rate like you can borrow ₦50000 to pay ₦50250 back after 30 days. All these fakes look fake from their ads.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "September 04, 2023, 08:46:04 AM",
      "body": "Smiles But naturally you supposed know say nothing dey free for 9ja wey we dey like this and boys dey hustle left right center to  make sure they have money by all means. If it was mean that deposited that amount and they swipe my 1500 from that 3000 you deposited I would had stopped playing and take back my remaining balance because plus or minus the money go still finished inside there if you no removed or moved am out from that place. Usually me no like games we go occupy my phone space, like free mining apps, gaming app and the rest all less na wallet to store my funds just as I dey use Electrum app for my phone and my laptop. Anyway sorry for your ugly experience with that app, and thank you for sharing at least we go dey very careful now if we see am or even have any body around us wey wan download am at least we go tell am the little experience wey our brother get from that game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 04, 2023, 09:14:54 AM",
      "body": "Boss putting my thoughts together to make a useful and informative comment here I will edit this comment with the full personal essay on this topic,  of play-to-earn games popping up now in our country and their dangers,  I still researching some facts and data,  permits me to reserve this spot for that comment because it deserved to stay on the first page. Thanks always, my able colleague Fivestar4everMVP .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "September 06, 2023, 08:09:20 PM",
      "body": "As Waje game be \"Play to earn games'' as Wiwo take put am(correct definition of it), na wetin person suppose to avoid totally. I follow for people wey d Waje game chop their money. You know as we Nigeria d so, we d dey easily to d enter or start-up anything relating to money without making any research on it.  I noticed of recent sae, majority of Nigerians are withdrawing from the play to earn games of a thing(Em no d as before), their involvement with am don reduced drastically since many don know sae the \"play to earn games\" no carry better thing come for we Nigerians than in a way to siphoning people of their money wey dem d manage for this bad economy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 06, 2023, 08:17:59 PM",
      "body": "Quote from: Marykeller on September 06, 2023, 08:09:20 PMAs Waje game be \"Play to earn games'' as Wiwo take put am(correct definition of it), na wetin person suppose to avoid totally. I follow for people wey d Waje game chop their money. You know as we Nigeria d so, we d dey easily to d enter or start-up anything relating to money without making any research on it.  I noticed of recent sae, majority of Nigerians are withdrawing from the play to earn games of a thing(Em no d as before), their involvement with am don reduced drastically since many don know sae the \"play to earn games\" no carry better thing come for we Nigerians than in a way to siphoning people of their money wey dem d manage for this bad economy. I know now that their format os begging to cast to many Nigerians their next target now na to enter crypto use crypto collect people money,  I know say very soon we will see many of them launching new crypto casinos with a touch of Ponzi inside because that format no dey tire them at all. But now we're we for here done know all this thing so,  e go help us to avoid all this kind thing and na one of the advantage of bitcoin talk forum be that,  the way this play to earn take enter the gambling market for 9ja eeeeh e long and the thing done dey tire people already because no gain inside and their system is far from being probably fair and sure say some of them dey control game outcome from the backend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "September 06, 2023, 11:41:05 PM",
      "body": "Make I tell you the truth, as it stands now and as you don yan us about this game, me lie lie no go near am if i see am any where as add na sharp sharp deleting because i no want anything wey go begin give me stress to dey fight to collect my money back. That stress no be weytin person go take gum body now wey the country dey somehow. This kind of thing naim dey make person dey avoid all these naija winning games because na so so drama full am finish. Me i know say that game matter na their own hustle but no be to dey use am dey do akawo for people head because na so the settings be. Person godey play dey think say him go win but one person dey one place dey control and manipulate the whole game so that players go think say na real actions dey go on not knowing say na one person dey one corner dey run him hustle. Naija don wise o not to talk of person wey don dey this platform and crypto for long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "September 06, 2023, 11:59:14 PM",
      "body": "I'm one of those that have test this \"Waje Game\" of a thing, due to the fact that whenever I visited Facebook, it was one of the top video ads with different people giving testimonies on how legit it is and fun way to make money doing the things you love playing game, which I fell for it, and gave it a try, and deposited #1000, played first, second and in my third time, was lucky enough to win #3000 extra, which I got excited, and tried to withdraw and to my greatest surprised the fund arrived in my bank account very fast. So I got carried away, deposited that same amount to play more, and never did I know that was my end, as from then, I lost all the whole funds. And since then I stopped playing \"Waje Game\". Which I think it's program to let you win first and then later your chances of winning gets slim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "September 08, 2023, 10:00:31 PM",
      "body": "Waje game is a programmed game to defraud people off their funds in disguise to be a casino. It is not a provably fair casino as they are full of cheat and they pay people on social medias to help them advertise the site and talk good about the site just to hype it. This will make people fall for it and give it a trial. Una know we Naija people na new thing dey shark us.It is when you have register with them and bet,that is when you will see the cheat side of the game. I don't think that there is any gambler that played once on that site that continued with playing there. I fear my head I no go lie you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jessie2121",
      "created_time": "September 12, 2023, 04:10:57 PM",
      "body": "Hehehe, they say if something never do you for this life you no go learn lesson at all and I believe say the sand wey this waje game don put for people eyes nai make this alert come up like this. I mean how pesin go just play one nonsense game abi nah card con collect plenty money, any time I see that ad for any site I enta e dy pain my body eh, with that girl wey get big nose. I just hope say them neva tackle plenty of us here oh",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "September 13, 2023, 01:31:18 PM",
      "body": "Quote from: Jessie2121 on September 12, 2023, 04:10:57 PMHehehe, they say if something never do you for this life you no go learn lesson at all and I believe say the sand wey this waje game don put for people eyes nai make this alert come up like this. I mean how pesin go just play one nonsense game abi nah card con collect plenty money, any time I see that ad for any site I enta e dy pain my body eh, with that girl wey get big nose. I just hope say them neva tackle plenty of us here oh This guy, you go sabi insult person Wella ooh   .., which one be say the girl get big nose  ..Anyways, I reason the thing exactly same way you reason am, me personally been think say the game na indeed a probably fair game where players fit compete with other players and the best player wins, I no know say na totally another crap wey some group of greedy scammers put together just to like legitly scam people off their hard earned money.Me personally don try am and I don see and learn, my job now na to make sure say no body wey I come across fall for their stupid trick or their useless advertisements .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "September 14, 2023, 09:57:39 PM",
      "body": "Quote from: Wiwo on September 04, 2023, 09:14:54 AMBoss putting my thoughts together to make a useful and informative comment here I will edit this comment with the full personal essay on this topic,  of play-to-earn games popping up now in our country and their dangers,  I still researching some facts and data,  permits me to reserve this spot for that comment because it deserved to stay on the first page. Thanks always, my able colleague Fivestar4everMVP .  Like dis I dey look forward to your write up because I believe e get one or two things we fit learn. Hungry dey di land already and people dey desperate to make ends meet. Our social media influencers, no come dey try, di rate wey dem dey promote dis games come dey make people think say na there be di source of their wealth. Naso one influencer wey dey promote NGAWIN upandan, na him I say make I see wetin di platform dey all about. As I click their facebook page, wetin I see no really make sense, ah just dey see complaints upandan for di page. Di small money wey person wan collect, naso dis men go collect am from you, people really need to wise up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "September 14, 2023, 10:11:58 PM",
      "body": "Quote from: sokani on September 14, 2023, 09:57:39 PMLike dis I dey look forward to your write up because I believe e get one or two things we fit learn. Hungry dey di land already and people dey desperate to make ends meet. Our social media influencers, no come dey try, di rate wey dem dey promote dis games come dey make people think say na there be di source of their wealth. Naso one influencer wey dey promote NGAWIN upandan, na him I say make I see wetin di platform dey all about. As I click their facebook page, wetin I see no really make sense, ah just dey see complaints upandan for di page. Di small money wey person wan collect, naso dis men go collect am from you, people really need to wise up.Thank you,  e get one information where I dey look for like that,  if I get am I go drop the boom make we all for put eye, the sake of say,  the way we're celebrities take the promotes all this play to earn games and their reality is a bit worrisome and we all have one responsibility which is the sensitized the general public on the risk there are exposed to,  and also how not to take the words of those influencers for it since all of them are after the own pocket a d they get paid regardless. So no worries before next week end,  I go drop my personal my contribution,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "September 14, 2023, 10:34:13 PM",
      "body": "Quote from: Wiwo on September 04, 2023, 09:14:54 AMBoss putting my thoughts together to make a useful and informative comment here I will edit this comment with the full personal essay on this topic,  of play-to-earn games popping up now in our country and their dangers,  I still researching some facts and data,  permits me to reserve this spot for that comment because it deserved to stay on the first page. Thanks always, my able colleague Fivestar4everMVP .   I see a lot of advertisements for this waje game popping up, especially when I'm watching Facebook videos; they will make it appear as if it's another great opportunity to make money, play, and earn, but I was not interested from the start because I knew something was fishy about it you earn by just playing games, not by taking surveys or doing anything else. I don't trust everyone in this country because they can do anything to make money. And I like the information because I'm sure a lot of people would have believed their scheme and began playing if you had found more information, as they say information is power, and we can also tell people outside the forum about it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Salahmu",
      "created_time": "September 15, 2023, 03:59:14 PM",
      "body": "Quote from: Charles-Tim on September 04, 2023, 08:27:27 AMThe game was luached late last year, 2022. I have not tried any play to earn game before and I thought you will not deposit anything but play for free from how I did saw the ad pop ups with those girls and a guy with sugar-coated mouth. I did not know that it is gambling. Although, I should have known, but I am just knowing right now.I always disregard anything that I see about money online, especially the ones that do not look real. Example is the Waje game that those advertisers keep saying they did not deposit anything but won over ₦70000 in a week. Another example which is not about this discussion are those loan apps that give fake rate like you can borrow ₦50000 to pay ₦50250 back after 30 days. All these fakes look fake from their ads.That game they trend all over social media but me I no say no free thing for this our 9ja so I no kuku reason am but the way they are going about this waje game is something else oh imagine they even went as far as editing someone conversation and program it to sound as if they are talking about waje game and how to make money from it, those guys have actually edited so many celebrities comments making it to look as if is them in other for people to join the waje game so people should just be careful with those kind of games.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "September 15, 2023, 07:07:20 PM",
      "body": "Quote from: Salahmu on September 15, 2023, 03:59:14 PMQuote from: Charles-Tim on September 04, 2023, 08:27:27 AMThe game was luached late last year, 2022. I have not tried any play to earn game before and I thought you will not deposit anything but play for free from how I did saw the ad pop ups with those girls and a guy with sugar-coated mouth. I did not know that it is gambling. Although, I should have known, but I am just knowing right now.I always disregard anything that I see about money online, especially the ones that do not look real. Example is the Waje game that those advertisers keep saying they did not deposit anything but won over ₦70000 in a week. Another example which is not about this discussion are those loan apps that give fake rate like you can borrow ₦50000 to pay ₦50250 back after 30 days. All these fakes look fake from their ads.That game they trend all over social media but me I no say no free thing for this our 9ja so I no kuku reason am but the way they are going about this waje game is something else oh imagine they even went as far as editing someone conversation and program it to sound as if they are talking about waje game and how to make money from it, those guys have actually edited so many celebrities comments making it to look as if is them in other for people to join the waje game so people should just be careful with those kind of games. OMO this game tire me, I don see for almost all the social media platforms and the most surprising thing be say opay don even put them as a direct deposit option under gambling or funding of betting account. No be say I no wan try this game out ooo but the way all the advertising they go about the game sef come dey make me even dey suspicious about the this and plus say anything for this naija dey always turn out to be format to use scam people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "September 16, 2023, 10:59:01 PM",
      "body": "I have not heard and seen such game name before. Op I was looking for the link of the game but you didn't put it so I went further to search for it and when I saw it, the game (casino) is familiar with me and I came to discovered that the casino is Nigerian-based casino which has different games to play with. And the casino is not for web browser but for Android App. When you visit the site, it will ask you to download the app to play the game. And the site explain everything you need to know about the game. Look at the site https://wajegame.com/  Fivestar4everMVP, I will want you to add this link to the OP.We all know Nigeria projects, nothing dey good for di country. Dem no go ever do something wey go benefits. look at other casinos running smoothly in di forum and me I never see any of our own here. Op thank you for information, I no go ever play their games sef. see wey dem even tok for the site sef and wen I see am sef I know sae na di oppsite dem dey tok.QuoteWorld Class Anti-Fraud systemStrict Fair Play PolDaily Deposit Limit All these na di opposite of di game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "September 17, 2023, 10:53:45 AM",
      "body": "Quote from: Mate2237 on September 16, 2023, 10:59:01 PMQuoteWorld Class Anti-Fraud systemStrict Fair Play PolDaily Deposit Limit All these na di opposite of di game.Well, no just any of those things wey dem talk for their site, all that one na for marketing purposes, nothing more, at least, you and I go bear each other withness say nobody wey dey do business go condemn his or her own business, anybody wey do that one, they go need to do medical checkup on the person to make sure say him brain still correct..On the surface, they go surely paint the whole thing with very bright color to make sure say they capture as many as they can , on the inside, na them know wetin they build, unfortunately for we the players, the surface does not determine anything, na the inside na im be the Koko .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}