{
  "id": "topic_5470230",
  "title": "l3pox",
  "author": "l3pox",
  "created_time": "October 13, 2023, 05:20:49 PM",
  "content": "Vamos supor que a binance quebraalgo que parece altamente improvável agora mas quando a FTX quebrou ninguém esperava também.O que vocês esperam que aconteça?eu imagino caos e gritos de \"crypto está morta! é o fim!\" para todos os ladosfogo e sangue nas ruasfamílias destruídasmas como sabemos que tudo que desce, sobe um dia e tudo que sobe, desce. Uma hora a indústria se reergue e a tecnologia só tem um ponto de chegada: mais alto.Quantos anos de atraso acreditam que uma quebra da binance traria?imagino que uns 4 ou 8 mas talvez menos.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470230",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "October 13, 2023, 05:25:18 PM",
      "body": "Mandei minha bola de cristal para o conserto, então fica difícil te dar uma resposta. Puro exercício de adivinhação. Na minha vida já vi empresas de vários ramos se recuperarem de grandes problemas e também vi empresas quebrarem por causa de pequenos problemas. Então não tem como dar uma resposta sobre sua pergunta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "October 13, 2023, 05:41:24 PM",
      "body": "Quote from: Lucasgabd on October 13, 2023, 05:20:49 PMmas como sabemos que tudo que desce, sobe um dia e tudo que sobe, desce. Uma hora a indústria se reergue e a tecnologia só tem um ponto de chegada: mais alto.O que está acontecendo com a Binance nos últimos meses é o mais saudável para o mercado todo, e quem sabe pra ela mesmo, parece que perdeu um bom espaço nesse tempo, tendo que sair de alguns países e tendo alguns serviços interrompidos em outros.Como eu disse, talvez seja bom para que a Binance não tenha o domínio absoluto que vinha alcançando e não prejudicar o mercado todo em caso de algo ruimNum cenário ideal a Binance perde força e fica equivalente às outras exchanges do mercado (Coinbase, Kraken, Kucoin, e aqui no BR a Foxbit entre outras)Vou até responder sua pergunta também, se a Binance somente acabar, não iria retroceder em nada o mercado, mas se sofresse um hack ou desse um exit scam ou ainda algum escândalo igual da FTX, aí sim iria prejudicar muito.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "October 13, 2023, 06:13:22 PM",
      "body": "Pra mim não vai acontecer nada a longo prazo. Quando eu entrei, a maior exchange era a poloniex, tudo mundo usava lá. Todo mundo ficava esperando as moedas serem lançadas lá esperando um pump. O volume era muito bom em qualquer moeda, tinha margin trade e tudo. Hoje ninguém nem fala mais dela. A segunda alternativa era a Bittrex, tinha mais moedas mas também tinha um bom volume, entrei algum tempo atrás e ela está praticamente morta, tem moeda que não movimenta nem 10k dol por dia. Se a binance cair vai sugir uma outra que vai dominar, simples assim. Vai ter uns dumps com FUD da galera mas depois tudo volta ao normal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 13, 2023, 06:39:44 PM",
      "body": "Para mim acho que seria mais preocupante que o Coinbase falir do que a Binance. E eu nunca usei Coinbase. Mas, a Coinbase é a verdadeira referencia para o mercado cripto, pois é a exchange que existe quase desde o inicio do Bitcoin.Em caso de queda da Binance, acho que não iria demorar muito tempo para o mercado recuperar. Não totalmente, pois as perdas nas shitcoins não tinham volta a dar. Agora, para as grandes moedas, em especial o Bitcoin, o impacto não seria assim tão devastador, digo eu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "October 13, 2023, 06:50:19 PM",
      "body": "Quote from: joker_josue on October 13, 2023, 06:39:44 PMPara mim acho que seria mais preocupante que o Coinbase falir do que a Binance. E eu nunca usei Coinbase. Mas, a Coinbase é a verdadeira referencia para o mercado cripto, pois é a exchange que existe quase desde o inicio do Bitcoin.A Coinbase também é a cara da legitimidade das cryptos. É a maior empresa certinha, no centro financeiro do mundo (EUA), listada na bolsa, fortemente observada por todas as empresas e governos. Se ela cai, é um grande sinal de \"crypto falhou\", especialmente para quem está em cima do muro. Provavelmente seria acompanhada de regulamentações bem menos amigáveis para as cryptos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "October 13, 2023, 11:18:11 PM",
      "body": "Quote from: Loganota on October 13, 2023, 06:13:22 PMPra mim não vai acontecer nada a longo prazo. Quando eu entrei, a maior exchange era a poloniex, tudo mundo usava lá. Todo mundo ficava esperando as moedas serem lançadas lá esperando um pump. O volume era muito bom em qualquer moeda, tinha margin trade e tudo. Hoje ninguém nem fala mais dela. A segunda alternativa era a Bittrex, tinha mais moedas mas também tinha um bom volume, entrei algum tempo atrás e ela está praticamente morta, tem moeda que não movimenta nem 10k dol por dia. Se a binance cair vai sugir uma outra que vai dominar, simples assim. Vai ter uns dumps com FUD da galera mas depois tudo volta ao normal.Eu usava as duas, Poloniex e Bittrex e acredito que foi a obrigatoriedade de KYC que matou elas na época... Foi só a partir desse momento que eu criei conta na Binance e acho que foi isso que a grande maioria dos usuários dessas exchanges dos EUA fez migrando massivamente para a Binance e tornando ela uma potencia que estava pronta para receber toda essa demanda e funcionar de forma \"menos\" alinhada com a regulamentação.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "October 14, 2023, 01:43:45 AM",
      "body": "Quote from: tg88 on October 13, 2023, 11:18:11 PMQuote from: Loganota on October 13, 2023, 06:13:22 PMPra mim não vai acontecer nada a longo prazo. Quando eu entrei, a maior exchange era a poloniex, tudo mundo usava lá. Todo mundo ficava esperando as moedas serem lançadas lá esperando um pump. O volume era muito bom em qualquer moeda, tinha margin trade e tudo. Hoje ninguém nem fala mais dela. A segunda alternativa era a Bittrex, tinha mais moedas mas também tinha um bom volume, entrei algum tempo atrás e ela está praticamente morta, tem moeda que não movimenta nem 10k dol por dia. Se a binance cair vai sugir uma outra que vai dominar, simples assim. Vai ter uns dumps com FUD da galera mas depois tudo volta ao normal.Eu usava as duas, Poloniex e Bittrex e acredito que foi a obrigatoriedade de KYC que matou elas na época... Foi só a partir desse momento que eu criei conta na Binance e acho que foi isso que a grande maioria dos usuários dessas exchanges dos EUA fez migrando massivamente para a Binance e tornando ela uma potencia que estava pronta para receber toda essa demanda e funcionar de forma \"menos\" alinhada com a regulamentação. Pegamos a mesma época e também tenho esse pensamento de que outras exchanges estão prontas para assumir o lugar da Binance.. bem diferente do que aconteceu com a MtGox em 2013.Mas como o @rdluffy disse, no caso de um hack seria bem diferente.. além de muitos players grandes perderem dinheiro, deixando o mercado sem liquidez, também teria o risco de um grande despejo.Estava procurando quando foi a primeira vez que falamos sobre a Binance aqui na nossa aba e encontrei esse tópico, realmente o crescimento dela foi inesperado: https://bitcointalk.org/index.php?topic=2235301.0Até onde lembro comecei a usá-la por conta do suporte rápido.. As outras corretoras eram muito ruins nesse sentido..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "October 14, 2023, 04:56:47 AM",
      "body": "Quote from: sabotag3x on October 14, 2023, 01:43:45 AMEstava procurando quando foi a primeira vez que falamos sobre a Binance aqui na nossa aba e encontrei esse tópico, realmente o crescimento dela foi inesperado: https://bitcointalk.org/index.php?topic=2235301.0Até onde lembro comecei a usá-la por conta do suporte rápido.. As outras corretoras eram muito ruins nesse sentido..Bela sacada ir atrás desse tópico @sabotag3x, até que eu não estava muito por fora na época  Quote from: Loganota on October 08, 2017, 01:37:18 AMBinance é bem conhecida sim, parece que é tipo uma poloniex asiática. [...]Podem ver que o quote confirma meu comentário, o meu padrão de comparação era a poloniex. Caramba, me deu até um saudosismo esse post ai, estamos ficando velhos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "October 14, 2023, 11:29:20 AM",
      "body": "Quote from: Lucasgabd on October 13, 2023, 05:20:49 PMVamos supor que a binance quebraalgo que parece altamente improvável agora mas quando a FTX quebrou ninguém esperava também.O que vocês esperam que aconteça?eu imagino caos e gritos de \"crypto está morta! é o fim!\" para todos os ladosfogo e sangue nas ruasfamílias destruídasmas como sabemos que tudo que desce, sobe um dia e tudo que sobe, desce. Uma hora a indústria se reergue e a tecnologia só tem um ponto de chegada: mais alto.Quantos anos de atraso acreditam que uma quebra da binance traria?imagino que uns 4 ou 8 mas talvez menos.Fogo e sangue nas ruas não sei. Mas não digo que não. Famílias destruídas, não tenho dúvidas. E até pessoas a suicidarem-se por causa de dívidas e penhoras e sabe-se lá mais o quê.Mas não percebi a pergunta. Atraso relativamente a quê?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "criptoevangelista",
      "created_time": "October 15, 2023, 01:58:20 PM",
      "body": "Pode gerar um FUD de curto / médio prazo sim, e uma baita oportunidade de comprar mais barato.a um tempo atrás tinha até visto no Polymarket a galera apostando sobre isso: https://polymarket.com/event/binance-insolvent-in-2023",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "October 15, 2023, 02:13:23 PM",
      "body": "Quote from: darkv0rt3x on October 14, 2023, 11:29:20 AMFogo e sangue nas ruas não sei. Mas não digo que não. Famílias destruídas, não tenho dúvidas. E até pessoas a suicidarem-se por causa de dívidas e penhoras e sabe-se lá mais o quê.Mas não percebi a pergunta. Atraso relativamente a quê?Não sei se vocês utilizam esse termo aí em Portugal também, mas quando falamos nesse tipo de atraso, seria pelo fato do mercado regredir em várias coisas que já conquistou nesse tempo e pelo fato de demorar mais para atingir algo no futuro.Exemplo simples, podemos falar que a FTX nos atrasou alguns anos em relação ao preço do BTC por exemplo, já que derrubou a faixa de preço que estava antes. Podemos falar também que a FTX atrasou a adoção maior do BTC pelo fator de desconfiança que gerou, e por aí vai",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "October 15, 2023, 02:21:46 PM",
      "body": "Quote from: criptoevangelista on October 15, 2023, 01:58:20 PMa um tempo atrás tinha até visto no Polymarket a galera apostando sobre isso: https://polymarket.com/event/binance-insolvent-in-2023Parece que as criptomoedas ficaram no segundo plano.. só tem coisas sobre a guerra na página inicial do Polymarket Não sabia que dava para ver os holders das apostas.. seria o 'Ninja777' o @TryNinja apostando na queda da Binance? Legal que também dá pra ver PnL dos usuários.. o chinês ali está com US$ 89k de lucro após um volume de US$ 1,6kk.. nada mal, deve ter algumas oportunidades boas ali (risco baixo e retorno ok)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "October 15, 2023, 03:30:27 PM",
      "body": "Quote from: rdluffy on October 15, 2023, 02:13:23 PMQuote from: darkv0rt3x on October 14, 2023, 11:29:20 AMFogo e sangue nas ruas não sei. Mas não digo que não. Famílias destruídas, não tenho dúvidas. E até pessoas a suicidarem-se por causa de dívidas e penhoras e sabe-se lá mais o quê.Mas não percebi a pergunta. Atraso relativamente a quê?Não sei se vocês utilizam esse termo aí em Portugal também, mas quando falamos nesse tipo de atraso, seria pelo fato do mercado regredir em várias coisas que já conquistou nesse tempo e pelo fato de demorar mais para atingir algo no futuro.Exemplo simples, podemos falar que a FTX nos atrasou alguns anos em relação ao preço do BTC por exemplo, já que derrubou a faixa de preço que estava antes. Podemos falar também que a FTX atrasou a adoção maior do BTC pelo fator de desconfiança que gerou, e por aí vaiSe fogo e sangue significa algo como \"a muito custo\" ou que \"é preciso um esforço enorme para algo\", nós usamos uma muito parecida que é \"a ferro e fogo\". Confirmas @joker_josue??? Só me lembro de outra mas é capaz de não ser bem no mesmo contexto, embora se pudesse adaptar que é algo como \"com a casa a arder\". Pode usar-se por exemplo para dizer que alguém só se preocupa com alguma coisa quando já não tem outra saída. \"Agora com a casa a arder é que vai pagar a multa...\" Como quem diz que, por exemplo, recebeu um aviso do tribunal que ia ser penhorado caso não pagasse e só agora é que decide ir pagar a multa.Com sangue, lembro-me da seguinte expressão: \"sangue, suor e lágrimas\" quando queremos dizer que algo nos custou imenso a fazer/obter/comprar/etc...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "October 15, 2023, 10:48:21 PM",
      "body": "Quote from: darkv0rt3x on October 15, 2023, 03:30:27 PMQuote from: rdluffy on October 15, 2023, 02:13:23 PMQuote from: darkv0rt3x on October 14, 2023, 11:29:20 AMFogo e sangue nas ruas não sei. Mas não digo que não. Famílias destruídas, não tenho dúvidas. E até pessoas a suicidarem-se por causa de dívidas e penhoras e sabe-se lá mais o quê.Mas não percebi a pergunta. Atraso relativamente a quê?Não sei se vocês utilizam esse termo aí em Portugal também, mas quando falamos nesse tipo de atraso, seria pelo fato do mercado regredir em várias coisas que já conquistou nesse tempo e pelo fato de demorar mais para atingir algo no futuro.Exemplo simples, podemos falar que a FTX nos atrasou alguns anos em relação ao preço do BTC por exemplo, já que derrubou a faixa de preço que estava antes. Podemos falar também que a FTX atrasou a adoção maior do BTC pelo fator de desconfiança que gerou, e por aí vaiSe fogo e sangue significa algo como \"a muito custo\" ou que \"é preciso um esforço enorme para algo\", nós usamos uma muito parecida que é \"a ferro e fogo\". Confirmas @joker_josue??? Sim é isso.Logicamente qualquer ação negativa no mercado, vai gerar uma demora no desenvolvimento do mesmo, visto que tem de se repetir algum tipo de caminho que antes já tinha sido realizado.E nesse sentido, caso ocorra algo de errado com a Binance, logicamente vão obrigar o mercado dar uns passos atras, para poder seguir em frente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "October 15, 2023, 11:42:06 PM",
      "body": "Quote from: Lucasgabd on October 13, 2023, 05:20:49 PMVamos supor que a binance quebraalgo que parece altamente improvável agora mas quando a FTX quebrou ninguém esperava também.O que vocês esperam que aconteça?eu imagino caos e gritos de \"crypto está morta! é o fim!\" para todos os ladosfogo e sangue nas ruasfamílias destruídasmas como sabemos que tudo que desce, sobe um dia e tudo que sobe, desce. Uma hora a indústria se reergue e a tecnologia só tem um ponto de chegada: mais alto.Quantos anos de atraso acreditam que uma quebra da binance traria?imagino que uns 4 ou 8 mas talvez menos.Cara, eu acho que depois da quebra da Binance a galera esvaziou legal os valores que tinham em carteiras não custodiadas, wallets e outras do tipo.Ou será que eles voltaram pro barco após a passagem da turbulência? Enfim, não tenho certeza da bobagem que estou falando... mas creio que primeiramente as stables-coin seriam as mais afetadas no caso da Binance cair. Afinal, quem precisa delas se não for para utilizar nas exchanges?Sobre os anos de Binance? Eu chutaria um longo prazo, mas quando se fala de cripto tudo muda muito rápido, então prefiro me abster-se também de uma previsão.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 16, 2023, 08:22:57 AM",
      "body": "Quote from: Loganota on October 13, 2023, 06:13:22 PMPra mim não vai acontecer nada a longo prazo. Quando eu entrei, a maior exchange era a poloniex, tudo mundo usava lá. Todo mundo ficava esperando as moedas serem lançadas lá esperando um pump. O volume era muito bom em qualquer moeda, tinha margin trade e tudo. Hoje ninguém nem fala mais dela. Também acho isso.Talvez algumas shitcoins tb morram junto c ela, mas fora isso não fará diferença alguma no longo prazo.AA binance oferece um serviço de altíssima qualidade, mas muitas outras também oferecem.Eu mesmo uso a bitstamp e a Kraken há anos e acho tão boas quanto a binance.A vantagem da binance é a grande oferta de criptos e fiat. Mas nada q ela faz não pode ser substituído no mesmo minuto.Pessoalmente,  se a binance quebrar eu começo q usar outra exchange brl e prontoDaí no curto prazo vai ter achando que o bitcoin vai acabar , o preço desaba 30%, mas 6 meses depois ngm vai mais nem falar nisso... hoje em dia ftx aparece mais notícias dos crimes do que notícias relacionadas ao bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "October 16, 2023, 10:41:47 AM",
      "body": "Quote from: joker_josue on October 15, 2023, 10:48:21 PMQuote from: darkv0rt3x on October 15, 2023, 03:30:27 PMQuote from: rdluffy on October 15, 2023, 02:13:23 PMQuote from: darkv0rt3x on October 14, 2023, 11:29:20 AMFogo e sangue nas ruas não sei. Mas não digo que não. Famílias destruídas, não tenho dúvidas. E até pessoas a suicidarem-se por causa de dívidas e penhoras e sabe-se lá mais o quê.Mas não percebi a pergunta. Atraso relativamente a quê?Não sei se vocês utilizam esse termo aí em Portugal também, mas quando falamos nesse tipo de atraso, seria pelo fato do mercado regredir em várias coisas que já conquistou nesse tempo e pelo fato de demorar mais para atingir algo no futuro.Exemplo simples, podemos falar que a FTX nos atrasou alguns anos em relação ao preço do BTC por exemplo, já que derrubou a faixa de preço que estava antes. Podemos falar também que a FTX atrasou a adoção maior do BTC pelo fator de desconfiança que gerou, e por aí vaiSe fogo e sangue significa algo como \"a muito custo\" ou que \"é preciso um esforço enorme para algo\", nós usamos uma muito parecida que é \"a ferro e fogo\". Confirmas @joker_josue??? Sim é isso.Logicamente qualquer ação negativa no mercado, vai gerar uma demora no desenvolvimento do mesmo, visto que tem de se repetir algum tipo de caminho que antes já tinha sido realizado.E nesse sentido, caso ocorra algo de errado com a Binance, logicamente vão obrigar o mercado dar uns passos atras, para poder seguir em frente.Mas quando vocês se referem a atraso, querem dizer atraso no que o mercado estaria para fazer se não houvesse a tal situação hipotética do falhanço da Binance? Se for isso, pode nem ser um atraso. Pode ser uma trajectória completamente diferente e nem se repetir mais as previsões que podiam estar na calha aí dos traders!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "October 16, 2023, 10:54:33 AM",
      "body": "Quote from: darkv0rt3x on October 16, 2023, 10:41:47 AMMas quando vocês se referem a atraso, querem dizer atraso no que o mercado estaria para fazer se não houvesse a tal situação hipotética do falhanço da Binance? Se for isso, pode nem ser um atraso. Pode ser uma trajectória completamente diferente e nem se repetir mais as previsões que podiam estar na calha aí dos traders!Exemplo: O pensamento é que o Bitcoin vai se tornar o próximo ouro ou o próximo dólar.. e a quebra desses grandes players (MtGox, FTX, etc) faz com que essa projeção demore mais a acontecer.. Então é um \"atraso\"..(meu exemplo foi hipotético, cada um tem suas próprias projeções para o Bitcoin)Além do preço também há outras questões como demora na aprovação dos ETFs, maior pressão dos reguladores/mais desconfiança dos usuários sobre as exchanges que sobraram.. então o mercado demora mais a chegar ao seu ápice.Outro exemplo foi a quebra da stablecoin da LUNA, a LUNA USD (UST).. marketcap das stablecoins despencou com tanta desconfiança do mercado, levou um ano para voltar onde estava, algumas nem voltaram.. poderia estar muito maior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "October 16, 2023, 11:14:30 AM",
      "body": "Quote from: sabotag3x on October 16, 2023, 10:54:33 AMQuote from: darkv0rt3x on October 16, 2023, 10:41:47 AMMas quando vocês se referem a atraso, querem dizer atraso no que o mercado estaria para fazer se não houvesse a tal situação hipotética do falhanço da Binance? Se for isso, pode nem ser um atraso. Pode ser uma trajectória completamente diferente e nem se repetir mais as previsões que podiam estar na calha aí dos traders!Exemplo: O pensamento é que o Bitcoin vai se tornar o próximo ouro ou o próximo dólar.. e a quebra desses grandes players (MtGox, FTX, etc) faz com que essa projeção demore mais a acontecer.. Então é um \"atraso\"..(meu exemplo foi hipotético, cada um tem suas próprias projeções para o Bitcoin)Além do preço também há outras questões como demora na aprovação dos ETFs, maior pressão dos reguladores/mais desconfiança dos usuários sobre as exchanges que sobraram.. então o mercado demora mais a chegar ao seu ápice.Outro exemplo foi a quebra da stablecoin da LUNA, a LUNA USD (UST).. marketcap das stablecoins despencou com tanta desconfiança do mercado, levou um ano para voltar onde estava, algumas nem voltaram.. poderia estar muito maior.Ah ok, já percebi. Sim, nesse caso pode haver sempre o sentimento de desconfiança a apoderar-se dos mais cépticos ou nervosos ou de quem tem muito valor investido neste mercado. E até porque quando há estes problemas, há sempre processos em tribunal que levam por vezes anos a serem resolvidos, quando o são. E durante esse tempo, se calhar os investidores relaxam um bocado e não investem enquanto não virem estes casos resolvidos!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}