{
  "id": "topic_5425064",
  "title": "Question:",
  "author": "meser#",
  "created_time": "December 02, 2022, 12:38:16 AMLast edit: December 03, 2022, 05:54:10 PM by meser#",
  "content": "With this content I have prepared, you will test how well you know the bitcointalk forum. Your knowledge of the events taking place in this forum and your search skill will show you what rank you are hypothetically. This content consists of 15 questions and the answer to each question is waiting for you to find it among the pages of the forum. The purpose of preparing the questions was to learn about the events that took place in the forum, to be informed and to raise awareness. The first wrong answer you give will directly calculate your rank. By the way, some questions may seem too easy. But is it really so? I advise you to be careful  So take a good look at the pages:) And one more rule thanks to @SFR10, All the questions must be solved in order LET'S START1) Which of the following is not included in the forum rules?a) Discussions in the main boards must be in english. All other language discussions should be posted in the appropriate Local board.b) Bumps, \"updates\" are limited to once per 12 hours per thread.c) Old bumps should be deleted.d) Using automated translation tools to post translated content in Local boards is not allowed.2) The new feature that came to the forum in 2022 started to be indicated with the text (OP) next to the thread's owner nickname. Which of the following is our member that makes this update viable?a) theymosb) PowerGlovec) LoyceVd) Welsh3) Which of our moderators won the best moderator award at the \"Bitcointalk Community awards\" held by icopress in 2021 last year?a) EFSb) hilariousandcoc) mprep d) Welsh4) We have hidden heroes who keep the forum well-organized and kept safe from scammers, spammers etc and they are called SpamBuster. In the light of the published latest data by theymos, which member is SpamBuster, which ranks first with 38580 reports?a) Ratimovb) eaLiTyc) actmynamed) GazetaBitcoin5) With the telegram bot known as BitcoinTalk SuperNotifier V2, you can be notified when you are mentioned, when one of your message is quoted, when you earn merit or when the phrase you defined to the bot is shared. Who is our member who offers this bot to bitcointalk members?a) PowerGloveb) theymosc) TryNinjad) fillippone 6) On what date was the merit system introduced so that our forum can have better quality content?a) Jan 7 2018b) Jan 14 2018c) Jan 17 2018d) Jan 24 20187) In which year was the joke involving the KYC obligation, one of the traditional April Fools' jokes, made by theymos?a) 2021b) 2020c) 2019d) 20188 ) Which of the following members did not win a badge at the 10th anniversary art competition?a) dannybrownb) meser#c) Kalemderd) Yatsan9) What is the date with the highest number of online members in the forum history?a) April 8 2013b) April 10 2013c) April 12 2013d) April 14 201310) God saves us, if your account has been stolen or you cannot access your account due to a problem, what is the e-mail address you should contact? a) security[at]bitcointalk.orgb) hackedaccounts[at]bitcointalk.orgc) recoveries_2021_xxlgg[at]bitcointalk.orgd) accountrecoveries_2022[at]bitcointalk.org11) What is the meaningful signature / avatar / social media campaign launched by NotATether?a) To future with Bitcoinb) Bitcoin is the financial saviorc) BitcoinCleanupd) Let's make our voice heard!12) Which of the following threads received the least merit?a)  Welcome to the new Bitcoin forum!b)  Pizza for bitcoins?c)  I AM HODLINGd)  10th anniversary art contest13) Building your trust list is important. You can play a role in maintaining the order of the forum by adding people you trust and do not trust. So, with which of the following symbols do you indicate people you do not trust in your trust list?a) -b) Xc) ~d) &14) Which of the following is a badge that is not included in the forum?a) Bitcoin expertb) Top reporterc) The Gliderd) Bitcoin-Qt core developer15) Which of the following accounts was the first account of the bitcointalk forum?a) satoshib) theymosc) admind) sirius    Oh you are just a brand new user ha? Then welcome to bridge of financial freedom. You gotta learn many thing bro. Don't quit to building you future! History writes those who don't give up↑START OVER!↑How nice to see you are trying, my friend. Hey, you can do better ↑START OVER!↑How quickly time flies, right? It was like yesterday when you signed up and now you're Jr.Member. You will get better over time!↑START OVER!↑You look so tired, my friend, what's wrong with you? Ok, being a member is not easy, but you are not weak, remember that!↑START OVER!↑Your avatar is on fire dude, as soon as you became a full member, you immediately put it! I see that light in your eyes, soon you'll be Sr.Member!↑START OVER!↑Weeks, posts, threads and many merits, here's our precious Senior Member! I never doubted you, but how about doing better?↑START OVER!↑Once upon a time, in a distant land, there was a famous hero. The messages he wrote and the topics he create became so popular. Merits? We stopped count it, because he is more talented on earning it than our calculate skill. Here is the famous Hero Member! Go aheaad maaan ↑START OVER!↑HOOOOLD THE DOOR HODOOOOOOOR! HOOLLD THE DOOOR! There's a legendary member on the horizon, if you don't stop him, he's going to conquer this place! Thank you so much for your effort dear Legendary Member! You've made this a better place with your efforts!I hope you enjoyed while spending time in my thread. I would like to thank them (@satoshi @theymos @admin @sirius @PowerGlove @LoyceV @Welsh @EFS @hilariousandco @mprep @Ratimov @eaLiTy @actmyname @GazetaBitcoin @TryNinja @fillippone @icopress @dannybrown @Kalemder @Yatsan @NotATether ) for their contribution to the forum, their efforts and being a part of the history of bitcointalk. Topic can be translated into other languages. In this regard, I can help how to implement it. And also if you have another idea with usage of anchors to be efficient for our community i'll love to help you about it. Just fill my message box",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5425064",
  "comments": [
    {
      "author": "Edwardard",
      "created_time": "December 02, 2022, 01:13:03 AM",
      "body": "Quote from: meser# on December 02, 2022, 12:38:16 AM7) In which year was the joke involving the KYC obligation, one of the traditional April Fools' jokes, made by theymos?a) 2021b) 2020c) 2019d) 2018This one was my fav. part, it always makes me laugh reading that thread by theymos again. 😜Btw kudos to you meser for making this! Must have taken a lot of effort..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "December 02, 2022, 01:37:21 AM",
      "body": "Quote from: Edwardard on December 02, 2022, 01:13:03 AMQuote from: meser# on December 02, 2022, 12:38:16 AM7) In which year was the joke involving the KYC obligation, one of the traditional April Fools' jokes, made by theymos?a) 2021b) 2020c) 2019d) 2018This one was my fav. part, it always makes me laugh reading that thread by theymos again. 😜Btw kudos to you meser for making this! Must have taken a lot of effort..theymos and his amazing humor  Indeed, these jokes he has made add a different atmosphere every year. But how do we not have the most online members stat on April 1, that's surprising  Let's see what kind of joke awaits us next year It was like drowning in code soup  But it's not boring when dealing with something valuable. Thats the spirit for move forward",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "actmyname",
      "created_time": "December 02, 2022, 02:20:23 AM",
      "body": "Clever use of anchors.Wish you would've used a difference of several months or years when it came to dates! I couldn't even make an estimated guess on merit deployment",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "December 02, 2022, 02:06:03 PM",
      "body": "Quote from: actmyname on December 02, 2022, 02:20:23 AMClever use of anchors.Wish you would've used a difference of several months or years when it came to dates! I couldn't even make an estimated guess on merit deployment yeap, it's clever but not easier  Many different contents can be prepared with anchors and count is depend on your imagination. I have one more content idea, and I'll most likely post it at Christmas. In this way, it will not be in the test logic, I will not give spoilers anyway  Wait and see. You'll have fun I believe  I chose the dates close because I wanted it to look a little bit tricky. However, if there will be a similar content from now on, I will keep the range of dates wide  And every question can be find by searching it through the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "December 02, 2022, 02:33:28 PM",
      "body": "Thanks to my weak memory, I can never pass this test.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "December 02, 2022, 02:45:44 PM",
      "body": "Quote from: krishnaverma on December 02, 2022, 02:33:28 PMThanks to my weak memory, I can never pass this test. you can pass this test by searching mate. This is not just a test. As I cleared before, purpose of this content is \"to be informed, raise awareness and learn about what happend in the history here\". Try your best and pass it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "December 02, 2022, 06:59:14 PM",
      "body": "Quote from: meser# on December 02, 2022, 02:45:44 PMQuote from: krishnaverma on December 02, 2022, 02:33:28 PMThanks to my weak memory, I can never pass this test. you can pass this test by searching mate. This is not just a test. As I cleared before, purpose of this content is \"to be informed, raise awareness and learn about what happend in the history here\". Try your best and pass it I agree that this is not just a test to see if your true rank is hero member as what is shown in the account or not. I would say that this is more than just a test since the questions are history about Bitcointalk like the day that theymos implemented merit, Bitcointalk Bot Notifier and more. To some people, this surely bring back memories of the day it happen like the April Fools' Day. This could also be to test your knowledge if that's what they are looking for and also for fun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "December 03, 2022, 01:58:56 PMLast edit: December 03, 2022, 02:56:25 PM by Agbe",
      "body": "My true rank is Sr. Member and it can be seen from the result below. There are some questions that are complicated so I choose randomly. These questions are logical to deal with. OP, you will be a good examiner in your time. You really tried for objective question to test the for ranks.Thank for the test, it was fun and time consuming. Score me and rate me as well let me see my performance",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "December 03, 2022, 02:47:20 PM",
      "body": "Quote from: meser# on December 02, 2022, 02:45:44 PMyou can pass this test by a searching mate. This is not just a test. As I cleared before, the purpose of this content is \"to be informed, raise awareness and learn about what happened in the history here\". Try your best and pass it Yes you are right that mate this thread test is very useful to us here in our community. because it is part of our history or let's say to test ourselves if we know what's happening like in question number two which this year implemented (OP)  next month author of the thread which is for me it will help to know immediately if who is the author of the thread.Quote from: krishnaverma on December 02, 2022, 02:33:28 PMThanks to my weak memory, I can never pass this test. Mate Try your best don't give up easily cause after you answering the test then you can search it if you got it right and also remember that it will help you to know more about in our community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "December 03, 2022, 03:04:07 PM",
      "body": "Quote from: Agbe on December 03, 2022, 01:58:56 PMScore me and rate me ~Dont post answers openly, you'll be treated as a party pooper 😁",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "December 03, 2022, 05:12:06 PM",
      "body": "Quote from: meser# on December 02, 2022, 12:38:16 AMBy the way, some questions may seem too easy. But is it really so?I don't mean to brag, but despite answering a single question it insists I'm a Legendary member [I wonder what it'd say if I answer the rest (first 14) ] On a serious note, I don't think we should ignore the massive missing data [roughly eight and a half years] for question #9 to base it on the limited data that we have...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "December 03, 2022, 05:37:43 PM",
      "body": "Quote from: SFR10 on December 03, 2022, 05:12:06 PMQuote from: meser# on December 02, 2022, 12:38:16 AMBy the way, some questions may seem too easy. But is it really so?I don't mean to brag, but despite answering a single question it insists I'm a Legendary member [I wonder what it'd say if I answer the rest (first 14) ] On a serious note, I don't think we should ignore the massive missing data [roughly eight and a half years] for question #9 to base it on the limited data that we have...Thanks to your feedback I will add one more rule  As all mothers say that the plate will be finished, all the questions must be solved in order     Honestly, this is one missing part that I couldn't find a solution for this situation. When I want to do something interactive in this cms, this is the max thing that i could. For the 9th question, yes, such a situation may be in question, I do not know the full details. But as lawyers says, everyone is innocent until proven guilty; until proven we have another day which has higher online member this is the most online member's day",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 03, 2022, 05:51:39 PM",
      "body": "Quote from: meser# on December 02, 2022, 12:38:16 AM11) What is the meaningful signature / avatar / social media campaign launched by NotATether?a) To future with Bitcoinb) Bitcoin is the financial saviorc) BitcoinCleapupd) Let's make our voice heard!It's BitcoinCleanup with an n, not a p.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "December 03, 2022, 05:55:36 PM",
      "body": "Quote from: NotATether on December 03, 2022, 05:51:39 PMQuote from: meser# on December 02, 2022, 12:38:16 AM11) What is the meaningful signature / avatar / social media campaign launched by NotATether?a) To future with Bitcoinb) Bitcoin is the financial saviorc) BitcoinCleapupd) Let's make our voice heard!It's BitcoinCleanup with an n, not a p. Thank you very much for the correction and I apologize for making such a mistake",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "December 06, 2022, 02:40:01 PM",
      "body": "Interesting!I didn't want to conduct any research when I started the test, and I only wanted to rely on my memory. I messed up with the 4th question. I could swear that I read not that long ago that Ratimov was on top of some list of users with the most successfully handled reports. I guess that's old news and the new leader is ... take the test and find out yourself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "December 06, 2022, 04:37:21 PM",
      "body": "Quote from: actmyname on December 02, 2022, 02:20:23 AMClever use of anchors.Dang, great to see you active--I don't know if you took a break or I've just been missing your posts, but either way....we were both negging shitposters into the graveyard before the merit system was created so you'll always have a place in my heart.I've been here for years and still suck at forum trivia, even the date of the merit system creation (which is important to me).  I know it was in Jan. 2018 but always forget the exact date.  Ah, well.  At least it exists no matter if I can remember dates.To all you newbies: if you stick around bitcointalk long enough, you'll be as senile as I am--and I'm not even old enough to be senile.  There's just so much going on here with so many personalities that it's nearly impossible (except for the geniuses we have here) to keep track of info like the facts in the OP.  Or maybe it's just me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "December 06, 2022, 06:31:07 PM",
      "body": "Quote from: The Pharmacist on December 06, 2022, 04:37:21 PMDang, great to see you active--I don't know if you took a break or I've just been missing your posts, but either way....we were both negging shitposters into the graveyard before the merit system was created so you'll always have a place in my heart.I've been here for years and still suck at forum trivia, even the date of the merit system creation (which is important to me).  I know it was in Jan. 2018 but always forget the exact date.  Ah, well.  At least it exists no matter if I can remember dates.To all you newbies: if you stick around bitcointalk long enough, you'll be as senile as I am--and I'm not even old enough to be senile.  There's just so much going on here with so many personalities that it's nearly impossible (except for the geniuses we have here) to keep track of info like the facts in the OP.  Or maybe it's just me.I'm here for the free education. You are an extension of those around you. OP loved this presentation, very creative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 06, 2022, 07:02:02 PM",
      "body": "Interesting thread.I happen to know the right answers to a greater number of the questions even without searching, but each time, or which ever answer I click, right or wrong, it takes me to either brand new or newbie  , I want to believe that this is probably because am on mobile, I will check again when I am on my PC.Overall, this is indeed very educative and as well, informative, kudos",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "meser#",
      "created_time": "December 06, 2022, 08:14:04 PM",
      "body": "I'm glad to hear that many of you like this thread Quote from: Pmalek on December 06, 2022, 02:40:01 PMInteresting!I didn't want to conduct any research when I started the test, and I only wanted to rely on my memory. I messed up with the 4th question. I could swear that I read not that long ago that Ratimov was on top of some list of users with the most successfully handled reports. I guess that's old news and the new leader is ... take the test and find out yourself.I tried to find latest official announcement for top reporters and I adapted the last official announcement to question which published by @theymos. But as @Ratimov said, this information is little bit old. I think the top of the list has already changed Quote from: Fivestar4everMVP on December 06, 2022, 07:02:02 PMInteresting thread.I happen to know the right answers to a greater number of the questions even without searching, but each time, or which ever answer I click, right or wrong, it takes me to either brand new or newbie  , I want to believe that this is probably because am on mobile, I will check again when I am on my PC.Overall, this is indeed very educative and as well, informative, kudos Nope, because you are secretly brand new or newbie don't hide it from us  Jokes aside, it's probably a mobile issue. I tried with 2 different devices and its happen only once and when I refresed the page its resolved..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}