{
  "id": "topic_5464984",
  "title": "BADecker",
  "author": "BADecker",
  "created_time": "August 29, 2023, 04:48:24 PM",
  "content": "Simply start a patriot website, and show all the things that the OWO (One World Order) is pushing. These things are scary, and they deprive people of their freedom. So, advertise for the OWO so that people are aware of what is really going on behind the scenes. Maybe you will even get Soros pay if you do it the right way.I mean, if you are going to make big changes around the world, people will have to know what those changes are going to be - all about them - so that they can take their rightful place in the OWO (whether they want to or not). So, to get OWO pay, advertise in ways that make the people feel that they can't do anything about the trouble that is coming on them. Make the people become fearful. They fall much easier that way.After all, in America, it is the good, solid family Americans who are stalling the OWO from coming into being. As long as they don't believe in OWO propaganda and conspiracy theories, they will go to football games, take their kids to school every day, play in the tiny lotteries at work and the big ones authorized by the States, and go on living normal lives. It will take a lot longer to convert them to the OWO without all kinds of tiny, patriot, conspiracy-theory advertising... advertising done for the OWO.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464984",
  "comments": [
    {
      "author": "suchmoon",
      "created_time": "August 29, 2023, 05:07:06 PM",
      "body": "I guess Soros is paying you a lot for making maga jesus putin conspiratards look so immensely dumb.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 29, 2023, 06:04:22 PM",
      "body": "Quote from: suchmoon on August 29, 2023, 05:07:06 PMI guess Soros is paying you a lot for making maga jesus putin conspiratards look so immensely dumb.I've been thinking of starting a total Jesus thread, and adding to it daily with all kinds of Jesus truth. If Soros paid me, he'd expect that I promote Jesus lies. So, I wouldn't accept.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 31, 2023, 12:35:22 AM",
      "body": "I am kind of confused by this thread. I thought that One world order was basically the same or pretty similar to globalization or the ultimate goal of the so called globalists, also similar to the 2030 agenda, ect. All those talking points are mostly used together as Soros being the big benefactor as a conspiracy theory by people from the political right.So it would not make sense that Soros offered money for spreading what he is allegedly is doing behind the scenes to get rid of the freedom of the western society   Or perhaps this is a completely ironic thread and the joke just get over my head.  Quote from: suchmoon on August 29, 2023, 05:07:06 PMI guess Soros is paying you a lot for making maga jesus putin conspiratards look so immensely dumb.Our friend's moral standing does not seem to be for sale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 31, 2023, 04:12:16 PM",
      "body": "Quote from: Hispo on August 31, 2023, 12:35:22 AMI am kind of confused by this thread. I thought that One world order was basically the same or pretty similar to globalization or the ultimate goal of the so called globalists, also similar to the 2030 agenda, ect. All those talking points are mostly used together as Soros being the big benefactor as a conspiracy theory by people from the political right.So it would not make sense that Soros offered money for spreading what he is allegedly is doing behind the scenes to get rid of the freedom of the western society   Or perhaps this is a completely ironic thread and the joke just get over my head.  Quote from: suchmoon on August 29, 2023, 05:07:06 PMI guess Soros is paying you a lot for making maga jesus putin conspiratards look so immensely dumb.Our friend's moral standing does not seem to be for sale.  Simply said, Soros does a bunch of advertising about his big plans. So, when patriots tell about his big plans, as a warning to people, they are still advertising for him. They are saying the same things he does, even though they include warnings.Soros doesn't care how his plans get out into the public. If they don't get out there, nobody will fall in line with them, because nobody will know what the plans are.So, Soros thanks patriots who advertise for him. Maybe he even pays some of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "September 01, 2023, 07:00:01 PM",
      "body": "Quote from: BADecker on August 31, 2023, 04:12:16 PMQuote from: Hispo on August 31, 2023, 12:35:22 AMI am kind of confused by this thread. I thought that One world order was basically the same or pretty similar to globalization or the ultimate goal of the so called globalists, also similar to the 2030 agenda, ect. All those talking points are mostly used together as Soros being the big benefactor as a conspiracy theory by people from the political right.So it would not make sense that Soros offered money for spreading what he is allegedly is doing behind the scenes to get rid of the freedom of the western society   Or perhaps this is a completely ironic thread and the joke just get over my head.  Quote from: suchmoon on August 29, 2023, 05:07:06 PMI guess Soros is paying you a lot for making maga jesus putin conspiratards look so immensely dumb.Our friend's moral standing does not seem to be for sale.  Simply said, Soros does a bunch of advertising about his big plans. So, when patriots tell about his big plans, as a warning to people, they are still advertising for him. They are saying the same things he does, even though they include warnings.Soros doesn't care how his plans get out into the public. If they don't get out there, nobody will fall in line with them, because nobody will know what the plans are.So, Soros thanks patriots who advertise for him. Maybe he even pays some of them.So if we consider that theory to be true (which is basically that saying of \"there is no such thing as bad advertisement\") it would not matter if people talk about those things or now. Because it we do not talk about it, then it turns out to be a secret evil plan to change the way society functions, on the other hand if we talk about it we are advertising the plan so it somehow benefits the person behind the curtain moving the chess pieces. That is rather a fatalistic way of thinking, in my eyes.So does not matter what one does the person doing evil deeds are supposed to succeed in the end? Also, I am not convinced yet Soros is the one funding all the movements and changes which conservatives deem to be negative in society, would not be too much to be only in the hands of a single man in the final years of his life?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iBaba",
      "created_time": "September 05, 2023, 07:37:26 PM",
      "body": "Whether OWO pay or not. I feel what's more important for us to focus on is to promote unity, respect, and an equitable equality across the continents of the world instead of spreading fear. Let's propagate open dialogue and shared understanding amongst numerous perspectives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pingrapole",
      "created_time": "September 06, 2023, 04:27:48 AM",
      "body": "Let us all stand united and stand against any conspiracy and campaign against injustice by removing the stigma of the mind Then all problems can be easily removed.What we are talking about is the kind of advertising that they are profiting from across the door Coming out of different perspectives we are now.The One World Order prevents people from acting or expressing themselves freely That is why we need to discuss more and more advertisements so that their secrets are revealed, and their veils are exposed.Putin's new plan to Soros give money It can be nothing but a big advertisement Helping people from false propaganda and people should not be helped to spread false propaganda because false propaganda helps the person behind the screen to earn illegal money and his misdeeds. I first thought of it as an advertising medium and thought it would play a big role in the age of globalization, but now it is acting as an advertisement for the unethical activities of political leaders And making huge money their real purpose is slowly coming to light it is now being used as a tool of political intrigue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "September 06, 2023, 03:45:20 PM",
      "body": "^^^ This is kinda unfair, isn't it? I mean, you want to keep your stuff private from the One-Worlders, yet you want them to reveal their private stuff to us. Looks like they have us. After all, we're trying to do to them the same things that they are trying to do to us, right? So, maybe we all are the One-Worlders.I wonder if Jesus was thinking of this when He said, \"Do unto others as you would have them do unto you.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "September 06, 2023, 05:32:39 PM",
      "body": "Quote from: iBaba on September 05, 2023, 07:37:26 PMWhether OWO pay or not. I feel what's more important for us to focus on is to promote unity, respect, and an equitable equality across the continents of the world instead of spreading fear. Let's propagate open dialogue and shared understanding amongst numerous perspectives.How can such unity be propagated and solidify when there is renewed scrabble for Africa? It seems like mission impossible to achieve after US had a turn of imposition on some East countries, Russia invaded Ukraine and African leaders are fingered to be carrying out the bidding of their foreign friends. The fear syndrome is what will not keep the dialogue on because you don't just trust who is dialoguing with you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "September 08, 2023, 01:31:11 PMLast edit: September 08, 2023, 01:57:12 PM by franky1",
      "body": "due to dollar domination... the OWO has existed for 70+ years already.. your a bit late to the pumpdue to the whole inception recently of the amero vs brics the OWO is about to cease.. so you are definitely too late to the pumpthe dollar is losing its control. the US is withdrawing from invading countries.. its losing its empire status. in short your 70 years behind on history",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}