{
  "id": "topic_5349270",
  "title": "aysg76",
  "author": "aysg76",
  "created_time": "July 14, 2021, 02:45:07 PMLast edit: March 14, 2022, 11:13:45 AM by aysg76",
  "content": "I am away from my home working in an office and it is hard to manage both work and house at the same time for me as i came late from office. So most of the time I order food online say 3-4 times in week and was happy with that until the point i realised that i was wasting lot of money on junk food. So i decided to have my future plans as i was already investing in bitcoin so i decided to reduce my weekly budget for ordering online food and decided to invest that money into bitcoin despite the prices and just go on investing till the time being. But i made a plan that every time i would add on the fixed budget of $10 extra to btc investment and from next month increased my intial investment by $10 also.For example say my weekly budget or food expenditure was $40-$50 weekly on my 3-4 order i would reduce it to half and say invest $25 weekly and next week it would be turned to $35.Along with this I was also planning to buy some gaming stuff for my time pass but i dropped that idea for the same reason and decided that i would keep on investing in bitcoin only not any other altcoin also .So this was my plan and investment was done every week.1st Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1: $25                 0.0005                   $49150.53Week 2: $35                 0.00094                  $37002.44Week 3: $45                 0.00114                  $39294.20Week 4: $55                 0.00147                  $37575.18Total 1st month bitcoin investment in my portfolio stood at : $160 How much btc were bought:  0.004052nd Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1:  $35                 0.00093               $37345.12Week 2:  $45                 0.00117               $38347.06Week 3:  $55                 0.00163               $33723.03Week 4:  $65                 0.00185               $35040.84Total 2nd month bitcoin investment in my portfolio stood at :  : $200How many btc were bought:  0.005583rd Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1:  $45                 0.00132               $33855.33Week 2:  $55                 0.0018                 $30456.06Week 3:  $65                 0.00162               $40111.19Week 4:  $75                 0.0018                 $41524.96Total 3rd month bitcoin investment in my portfolio stood at :  : $240How many btc were bought:  0.006544th Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1: $55                 0.00115                   $47786.53Week 2: $65                 0.00094                  $46389.44Week 3: $75                 0.00114                  $49291.20Week 4: $85                 0.00147                  $48989.18Total 4rd month bitcoin investment in my portfolio stood at :  : $280How many btc were acquired this time : BTC 0.00585th Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1: $65                 0.00152                   $42711.63Week 2: $75                 0.00157                  $47675.47Week 3: $85                 0.00154                  $54978.20Week 4: $95                 0.00153                  $62034.18Total 5rd month bitcoin investment in my portfolio stood at :  : $320How many btc were acquired this time : BTC 0.006166th Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1: $75                 0.00131                   $57014.35Week 2: $85                 0.00131                  $64801.47Week 3: $95                 0.00154                  $61422.50Week 4: $105               0.00177                  $58453.49Total 6th month bitcoin investment in my portfolio stood at :  : $360How many btc were acquired this time : BTC 0.005937th Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1: $85                 0.00149                   $56792.53Week 2: $95                 0.00185                  $50582.63Week 3: $105               0.00226                  $45894.85Week 4: $115               0.00243                  $46880.28Total 7th month bitcoin investment in my portfolio stood at :  : $400How many btc were acquired this time : BTC 0.008038th Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1: $95                   0.002                       $47414.53Week 2: $105                 0.00227                  $45752.44Week 3: $115                 0.00277                  $41407.20Week 4: $125                 0.00349                  $35791.18Total 8th month bitcoin investment in my portfolio stood at : $400 How much btc were bought:  0.010539st Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1: $100                 0.00276                   $36211.53Week 2: $100                 0.0024                      $41748.44Week 3: $100                 0.00234                  $42586.20Week 4: $100                 0.0027                    $37075.18Total 9th month bitcoin investment in my portfolio stood at : $400 How much btc were bought:  0.0102Total Bitcoins aqquired with $2800 = 0.06282I got bonus from my office this month for extra performance along with my paycheck so i decided to to go mile extra this time with bitcoin investment and invested another $100 from the same bonus to bitcoin investment and will make some bonus investments as I get them with my paycheck.BONUS $100 INVESTMENT AT $43600 = BTC0.00229 I have doing this from past three months now and planning it to carry on for long time as i know that my returns will be high in long run and my wasting that money on my food items would have given me happiness and relaxation for few time but this investment at this time would be long lasting and give me pleasure and joy for lifetime. So I decided to compromise my that things for bitcoin investments as it will surely have more value in future when every other assest will be depreciated with inflation but my this investment will prove worthy at that time.Speaking frankly I was happy at this dip as i was getting big share at small prices and they don't even matter for me because i was not into trading and my sole motive was to invest and hold for long time no matter what the prices are and will be.I have decided to follow this plan for atleast 6 months and will keep posting the updates on this thread. So i am constantly reducing my miscellaneous expenses and allocating that funds towards bitcoin and i will not panic with any price dumps and afford to loose that money(but it will not happen as i am optimistic) and will hold that coins until i need to use them.Till then my 6 months chart is on for investments  EDIT: The thread has been updated with this month DCA investments and Bonus investments made by me and will keep this in same manner.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5349270",
  "comments": [
    {
      "author": "BlackHatCoiner",
      "created_time": "July 14, 2021, 03:11:07 PM",
      "body": "Quote from: aysg76 on July 14, 2021, 02:45:07 PMI have doing this from past two months now and planning it to carry on for long time as i know that my returns will be high in long runYou'll probably be inflationarily secure, but I'm just adding some wise words from John Maynard Keynes:  “In the long run we are all dead”.Quote from: aysg76 on July 14, 2021, 02:45:07 PMSpeaking frankly I was happy at this dip as i was getting big share at small prices and they don't even matter for me because i was not into trading and my sole motive was to invest and hold for long time no matter what the prices are and will be.I think that calling the thirty thousands a dip is nothing, but bullishly misleading, except if you dare to call every price a dip after the ATHs. Bitcoin made a correction three months ago and some people still call this a dip.I wonder until when, we'll measure with dips and ATHs this currency... Maybe forever...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "July 14, 2021, 03:37:22 PM",
      "body": "Congrats! You'll make it a habit if you keep this up. I hope you get a raise or have a side job since you're increasing your BTC investment per month. You cannot keep on reducing your food budget can you?Quote from: aysg76 on July 14, 2021, 02:45:07 PM...I was also planning to buy some gaming stuff for my time pass but i dropped that idea for the same reason and decided that i would keep on investing in bitcoin only not any other altcoin also .Have you explored blockchain games with \"play to earn\" feature? Rewards are in altcoins but you can always trade them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mckinleeanael07",
      "created_time": "July 14, 2021, 03:50:40 PM",
      "body": "Quote from: aysg76 on July 14, 2021, 02:45:07 PMI am away from my home working in an office and it is hard to manage both work and house at the same time for me as i came late from office. So most of the time I order food online say 3-4 times in week and was happy with that until the point i realised that i was wasting lot of money on junk food. So i decided to have my future plans as i was already investing in bitcoin so i decided to reduce my weekly budget for ordering online food and decided to invest that money into bitcoin despite the prices and just go on investing till the time being. But i made a plan that every time i would add on the fixed budget of $10 extra to btc investment and from next month increased my intial investment by $10 also.For example say my weekly budget or food expenditure was $40-$50 weekly on my 3-4 order i would reduce it to half and say invest $25 weekly and next week it would be turned to $35.Along with this I was also planning to buy some gaming stuff for my time pass but i dropped that idea for the same reason and decided that i would keep on investing in bitcoin only not any other altcoin also .So this was my plan and investment was done every week.1st Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1: $25                 0.0005                   $49150.53Week 2: $35                 0.00094                  $37002.44Week 3: $45                 0.00114                  $39294.20Week 4: $55                 0.00147                  $37575.18Total 1st month bitcoin investment in my portfolio stood at : $160 How much btc were bought:  0.004052nd Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1:  $35                 0.00093               $37345.12Week 2:  $45                 0.00117               $38347.06Week 3:  $55                 0.00163               $33723.03Week 4:  $65                 0.00185               $35040.84I feel this is a pretty good long term investment plan and I am getting an idea for my future, this long term investment habit is a pretty good habit, it doesn't give us returns in short term, but in the long run, it will definitely be a good future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dark1234",
      "created_time": "July 14, 2021, 03:57:21 PM",
      "body": "If investment is your goal, then the price drop from month to month doesn't matter even if it's an advantage, because holding in the future is the real goal, one that will make you feel at a loss. without looking at the price",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "July 14, 2021, 04:30:43 PM",
      "body": "Interesting.Ofcourse, it's better to invest in Bitcoin than on junk food, things that are bad for you or things you don't need. It's important to still invest what you can afford risk, so you don't get too attached to you coins. There should be other important things in life that can be profitable to you when you invest in them. Wish lots of the important things can be solved with bitcoin (decentrally) for the benefit of Bitcoin economy",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "July 14, 2021, 04:46:54 PM",
      "body": "As long as you are eating healthy and putting some money aside to invest in Bitcoin.. then I will be happy with your strategy. I know a lot of people dropped some bad habit like smoking and they invested that into Bitcoin ..and that is truly commendable. Fast food is also a bad habit and it is expensive too.... There is nothing wrong with some cheaper home made food... so why should we have to dump thousand of Dollars into unhealthy fast food.    Will you be editing and updating this thread or will you be creating a new thread?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 14, 2021, 05:05:29 PM",
      "body": "A great decision ever. It's because by reducing junk food you are saving your health and on the other hand by saving Bitcoin your building your wealth. It's quite interesting and I appreciate your decision. Better once you can leave eating junk foods permanently. It's really not useful for your health rather than it's harmful to your health & wealth as well. There is something that we can take a lesson from your story. For those who are familiar with Bitcoin, it's a golden opportunity for us to save Bitcoin for our future. And saving small amounts will not make a difference in our current lifestyle. But it will impact in our future like.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TopTort777",
      "created_time": "July 14, 2021, 05:11:27 PM",
      "body": "Indeed interesting. Did fees eat a significant part of your purchases? You did not invest huge sums frankly speaking. I remember buying Bitcoin on coinbase and paid 1 euro for every action on an exchange. 1 euro for eur>btc exchange, 1 euro for btc transaction. If I would have bought Bitcoin for 25$ there, fees would eat 10% of my investment… That is hell of a lot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "July 14, 2021, 05:28:26 PM",
      "body": "Quote from: aysg76 on July 14, 2021, 02:45:07 PM1st Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1: $25                 0.0005                   $49150.53Week 2: $35                 0.00094                  $37002.44Week 3: $45                 0.00114                  $39294.20Week 4: $55                 0.00147                  $37575.18Total 1st month bitcoin investment in my portfolio stood at : $160 How much btc were bought:  0.004052nd Month InvestmentsWeek     Investment    Bitcoin aqquired       At priceWeek 1:  $35                 0.00093               $37345.12Week 2:  $45                 0.00117               $38347.06Week 3:  $55                 0.00163               $33723.03Week 4:  $65                 0.00185               $35040.84Total 2nd month bitcoin investment in my portfolio stood at :  : $200How many btc were bought:  0.00558Total Bitcoins aqquired with $360 = 0.00963I love it, people complain all the time that bitcoin is too expensive and that is why they are buying altcoins, they forget that you do not need to buy a full bitcoin, if you only have a 50 dollars a week or a month then you can invest that, obviously you are not going to become a millionaire with that kind of investment in a single year but you will earn money, and even more importantly your wealth will be safe from the inflationary measures imposed by the governments and that is invaluable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shenzou",
      "created_time": "July 14, 2021, 05:33:32 PM",
      "body": "I really encourage your enthusiasm and your persistent, and to come to think of it there are a lot of unnecessary things that we spend our money on that we can allocate or it is better for us to invest it in other things like bitcoin, i like you started with trying to put some of my extra money and invest in bitcoin by avoiding all the unhealthy and unnecessary things, and now even though the rate at which i invest has gone down but it still do it it. and i encourage any one who wants to invest in bitcoin to do it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "izsara",
      "created_time": "July 14, 2021, 07:33:03 PM",
      "body": "I really appreciate and am happy for you because you managed to collect bitcoins at a price that I think is like a very big discount and you are directly one of the ones I want to follow right now I think in the future you will get tremendous profits if you are not tempted to sell your current assets. at least for a few months or a few years hold on to the assets you currently have and if necessary add more little by little I'm sure you will avoid inflation in yourself and your family.Hopefully this will be a reference and an example for me and the people here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2double0",
      "created_time": "July 14, 2021, 07:39:05 PM",
      "body": "Highly inspiring for those who say they don't have money to buy btc. People don't need a lot of money, in fact they have got 8 decimals available as Satoshi units to buy btc for their low portfolio if they can't afford a big chunk of btc. Applause to you for sharing such an inspirational story and give newbies a new way of looking towards investing in btc. For some good that we expect for our tomorrow, we must sacrifice something today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mistafreeze",
      "created_time": "July 14, 2021, 08:55:29 PM",
      "body": "I like your courage and focus in achieving your goals which had really helped you to save some good cash which could be more than your expectations as time goes on. Keep it up cause it is a challenge to everyone of us that spend exorbitantly without thinking of saving, maybe because their is substantial funds to play around with. It is not wise spending without planning but you have really showed us a way out of the addiction of extravagant spending.I bet you, you are still going to be surprised after all this Savings that looks like nothing to you now because it is brought out of nothing, excess spending which may not be noticed because of your saving ideology. Bitcoin is falling and rising which might affects the market now and the price you are buying it, but just be patient to hold your coin cause it can be a good source of revenue for you in the future. It is very certain that the price of Bitcoin is still going to break the $65k resistance skyrocketing the price if that eventually happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "July 14, 2021, 09:23:23 PM",
      "body": "You'll have a great future if you continue accumulating consistently and if you hold it in for the long term. For me, this is an effective strategy and I like it because you are buying regardless of the price of bitcoin. The timing now is really good because bitcoin is in the correction stage and we might see it dump even more, below $30k.With that, you'll be able to accumulate more BTC due to the cheap bitcoin price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "July 14, 2021, 09:25:27 PM",
      "body": "Good plan indeed, it just shows with good financial planning you can go and stacks sats in our own little way. And this also proves that for average Joe like us, who can't afford to buy 1 whole btc, which by the way is the mindset of newbies, and very wrong by the way. We can just accumulate in small portions or at least save with proper planning just like what the OP is doing in the last two months or so. This bitcoin investment is a long game, a marathon and not a sprint. And the winner is those who have patience and mental focus, so congrats and hopefully others might follow what the OP is doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "July 14, 2021, 10:20:08 PM",
      "body": "Congratulations for this decision and thanks for sharing your personal investment's strategy with the public. If people realized how much money they waste in superfluous things they would understand why they aren't able to improve their financial life. Details like not spending in games or street food (that is a lot more expensive than cooking at home) make all the difference.And it's not about being a miser person, it's just a responsible decision to save money for the future and present a progressive line of financial development along the years, what is really good for our welfare and self-esteem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lanatsa",
      "created_time": "July 14, 2021, 10:42:32 PM",
      "body": "Slowly but surely as long those funds aren't used for living or expenses or savings then it should be fine.Im having the same move on accumulating bitcoin but only on monthly purchasesand everything would be random in terms of amount because I do make use of those extra money I do have after I had paid up the bills and everything is already organized.Somewhere in between $100-300 depending if there are no other expenses or unexpected ones.Yes, it is just small compared to others but at least you are saving up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CaVO32",
      "created_time": "July 14, 2021, 10:49:51 PM",
      "body": "Quote from: Lanatsa on July 14, 2021, 10:42:32 PMSlowly but surely as long those funds aren't used for living or expenses or savings then it should be fine.Im having the same move on accumulating bitcoin but only on monthly purchasesand everything would be random in terms of amount because I do make use of those extra money I do have after I had paid up the bills and everything is already organized.Somewhere in between $100-300 depending if there are no other expenses or unexpected ones.Yes, it is just small compared to others but at least you are saving up.As long as you are using funds that you can afford to lose, no matter how big or small, that would be fine. At least, you are not relying on that funds for your daily expenses. Because the volatility that you will encounter everyday will make you panic if you are relying on those funds and you may sell at a loss. But if you are looking for long-term investments, you will not be agitated by everyday movement. And with small investments, in time, you will find out that it is already a hefty amount.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rengga Jati",
      "created_time": "July 14, 2021, 11:11:16 PM",
      "body": "I really appreciate the effort you have done this. Reducing daily or monthly spending or by moving the expenditure to buy Bitcoin, of course, is not an easy thing. Because I also ever experienced it. There are times when we lose to our desire to buy something and finally don't buy Bitcoin at a certain moment. This is the usual thing.However, as long as we are consistent and have the responsibility to do what we have planned from the beginning, we will enter all routes, the path according to what we planned, namely investing in Bitcoin.Of course, deciding on investment in Bitcoin is also not a trivial case. Because we must be truly brave and ready to take risks of price volatility and also the funds we invest.Short-term or long-term investment certainly has the same goal, namely getting a profit. But the way and the risk will certainly be different. Here we are, according to the strategy we use.And finally, keep it up. You can make a spreadsheet to register your investment in order to manage and monitor well and wise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}