{
  "id": "topic_5451767",
  "title": "viljj",
  "author": "viljj",
  "created_time": "May 06, 2023, 06:59:34 PM",
  "content": "I transfered from 3rd party platform Litecoin via \"Bitcoin network\" to Bitcoin address. For some reason the transaction was succesfull, but i obviously didnt receive the funds.However, i managed to track down the Litecoin wallet (which was apperantly created just for this transaction, since there is only 1 transaction done)So how is it possible that i send Litecoin to Bitcoin address, bitcoin transaction didnt arrive,  but a new LTC wallet was created with my funds, where i have no access of.Have i lost my funds?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451767",
  "comments": [
    {
      "author": "Zaguru12",
      "created_time": "May 06, 2023, 07:21:22 PM",
      "body": "I don’t quite get the question but if you have actually tried to send a litecoin to a bitcoin address, most wallet will warn you off it that it is a wrong network but should the transaction actually go to though just like you said then this fund is lost forever. Although according to some suggestions, if the bitcoin address starts from 1 and litecoin L then it could be possible to import your bitcoin wallet into a litecoin wallet and then spend the funds. Although I am not sure it works Check this past thread for further information https://bitcointalk.org/index.php?topic=5120510.msg52066780#msg52066780",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "May 06, 2023, 07:21:43 PMLast edit: May 06, 2023, 07:34:31 PM by lionheart78",
      "body": "Did you swap your Litecoin to Bitcoin using a third-party site like Changely or something like that?  It is possible that the swap is successful and you need some time for the swap to process so waiting a bit longer may help.  If it still doesn't appear on your BTC address after some time of waiting, then there is a possibility that you already lost the fund.As far as I know, you cannot send Litecoin to a Bitcoin network nor Bitcoin to the Litecoin network directly because they have different protocols, unless you use some swap or converter where you send your LTC to the LTC address provided by the site then the site will convert it to BTC, and process it transfering the equivalent fund to your Bitcoin address.  This process may take some time for the equivalent balance to appear in your Bitcoin address unless the site you used is a scam site.If it is a scam site then it is more like that your fund is lost, or if it is a human error then it is more likely a lost fund already.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 06, 2023, 07:26:11 PM",
      "body": "Quote from: viljj on May 06, 2023, 06:59:34 PMI transfered from 3rd party platform Litecoin via \"Bitcoin network\" to Bitcoin address. For some reason the transaction was succesfull, but i obviously didnt receive the funds.Each cryptocurrency has it own blockchain and the address had to be on the particular network you're sending to, which means you can't send bitcoin to another network except a bitcoin address and same applies to other cryptocurrencies except for the once that share thesame network on blockchain, when you send to a wrong address, you're most likely to miss the fund and loose everything, you would have exchange it first using p2p or rather provide me them with the litecoin receiving address.Quote from: viljj on May 06, 2023, 06:59:34 PMSo how is it possible that i send Litecoin to Bitcoin address, bitcoin transaction didnt arrive,  but a new LTC wallet was created with my funds, where i have no access of.When using a centralized institution or websites or casino, they will generate you an address which will have in custody your coin they are offering you, remember those you're dealing with too were also custodial channel, they have your wallet keys with them, once they offer their address, you will transfer the coin they gave you to an exchange using the same address on the same network from the exchange and receive you coin into it.Quote from: viljj on May 06, 2023, 06:59:34 PMHave i lost my funds?Obviously Yes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "May 06, 2023, 07:30:12 PM",
      "body": "Quote from: viljj on May 06, 2023, 06:59:34 PMI transfered from 3rd party platform Litecoin via \"Bitcoin network\" to Bitcoin address. For some reason the transaction was succesfull, but i obviously didnt receive the funds.Have you tried contacting the customer support of the platform you sent the funds from? What do they say?Quote from: viljj on May 06, 2023, 06:59:34 PMHowever, i managed to track down the Litecoin wallet (which was apperantly created just for this transaction, since there is only 1 transaction done)May I know how you were able to track down the Litecoin wallet (presumably the address) where the funds are being held? It's worth noting that it's possible for an address to receive funds even without a corresponding wallet created for it. This means that there's a chance that the funds might have been sent to an address that no one has access to.Quote from: viljj on May 06, 2023, 06:59:34 PMSo how is it possible that i send Litecoin to Bitcoin address, bitcoin transaction didnt arrive,  but a new LTC wallet was created with my funds, where i have no access of.Have i lost my funds?It would be best if you directed that question to the platform through which you transferred the funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "viljj",
      "created_time": "May 06, 2023, 07:33:32 PM",
      "body": "Thanks so much for your answers.So this is exactly what happend. I transfered Litecoin \"via bitcoin network\" from a Casino site. The transaction fee was huge (like 5€) compared to normal Litecoin fee(bitcoin fee like). I entered a Bitcoin address. And the Coins were succesfully sent. After a few hours i understood that i wont be getting any bitcoin to the given address. So i searched from my Profile history the \"hash\" and the \"address\". The hash ID guides me to Blockchain page, where i can actually see that i was sent litecoins succesfully to some address that i do not have acces of. But in the history page the \"Adress\" guides me to unconfirmed Blockchain page where my Bitcoin address has no transactions. LTC->BTC(creates some new LTC) address which i dont have acces to. It shows as unspent",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "May 06, 2023, 07:33:38 PM",
      "body": "How were you able to send Litecoin to a bitcoin wallet address that’s so not possible. Bitcoin wallet can’t hold any hold Litecoins and vice Verse.Can you please drop the transaction iD I would be interested to see it. The bitcoin network has several types addresses and none of which can accept Litecoin.Where did you send the funds form? Was it on an exchange because some exchanges would one if you send a coin to a wrong address like you just did the chances are high that you have lost your coin. Be more careful read about bitcoin wallet.https://bitcointalk.org/index.php?topic=1631151.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "viljj",
      "created_time": "May 06, 2023, 07:40:59 PM",
      "body": "Sorry for not knowing how to quote. Yes, i have reached both the senders customer support, and the other place, where the Bitcoin address that i entered was generated. None of them could have helped. They were just bouncing me back and forth.MAmXpLVK2Py7p6oum5S918UW2YWntwvTdi Is the where the funds were sent toi have never entered this LTC address. Its not mine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "May 06, 2023, 07:46:19 PM",
      "body": "Quote from: viljj on May 06, 2023, 07:33:32 PMThanks so much for your answers.So this is exactly what happend. I transfered Litecoin \"via bitcoin network\" from a Casino site. The transaction fee was huge (like 5€) compared to normal Litecoin fee(bitcoin fee like). I entered a Bitcoin address. And the Coins were succesfully sent. After a few hours i understood that i wont be getting any bitcoin to the given address. So i searched from my Profile history the \"hash\" and the \"address\". The hash ID guides me to Blockchain page, where i can actually see that i was sent litecoins succesfully to some address that i do not have acces of. But in the history page the \"Adress\" guides me to unconfirmed Blockchain page where my Bitcoin address has no transactions. Have you checked your withdrawal if it is still in pending status?  Since it is a casino, I can say it is possible to transfer the funds in Bitcoin even if you deposited Litecoin on the platform since there are casinos that enable this kind of transfer.Another question, did the casino you played have a wagering requirement for a deposit to be able to be withdrawn?  If yes, did you meet the requirement?Quote from: viljj on May 06, 2023, 07:33:32 PMLTC->BTC(creates some new LTC) address which i dont have acces to. It shows as unspentThis is normal in centralized services, even exchanges do this.  they transfer the deposited funds to another wallet for security purposes.  Quote from: viljj on May 06, 2023, 07:40:59 PMSorry for not knowing how to quote. Yes, i have reached both the senders customer support, and the other place, where the Bitcoin address that i entered was generated. None of them could have helped. They were just bouncing me back and forth.MAmXpLVK2Py7p6oum5S918UW2YWntwvTdi Is the where the funds were sent toi have never entered this LTC address. Its not mine.It looks like there is no pending withdrawal in your side since if there were, the casino staff should have told you that the fund is still in pending status or your balance is on hold if the casino is suspicious of your account.  Now it baffles me how could the casino staff failed to give you the information about your withdrawals.  The staff should know about the information of your withdrawal at least the staff can give you details about what happened on your withdrawal request.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 06, 2023, 07:59:17 PM",
      "body": "Get the bitcoin address private key. It should start from 5, K or LOpen https://www.bitaddress.org/. Click on 'wallet datails' and enter the bitcoin private key. Copy the hexadecimal bitcoin private key.Open https://liteaddress.org/. Click on wallet details and enter the bitcoin hexadecimal private key. (If you do not see the wallet details, enter random numbers to generate a paper wallet so that you will be able to see wallet details and click on it). You will be able to see the normal and compressed litecoin WIF litecoin private key and their addresses. You can usethe private key to spend your coins.Litecoin private key start from 6Litecoin compressed private key start from T.You can use those sites offline or use their source code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "viljj",
      "created_time": "May 06, 2023, 08:03:15 PM",
      "body": "Quote from: Charles-Tim on May 06, 2023, 07:59:17 PMGet the bitcoin address private key. It should start from 5, K or LOpen https://www.bitaddress.org/. Click on 'wallet datails' and enter the bitcoin private key. Copy the hexadecimal bitcoin private key.Open https://liteaddress.org/. Click on wallet details and enter the bitcoin hexadecimal private key. (If you do not see the wallet details, enter random numbers to generate a paper wallet so that you will be able to see it). You will be able to see the normal and compressed litecoin WIF litecoin private key and their addresses. You can usethe private key to spend your coins.Ok, are you sure that it will work? Will i ask the site that generated the Bitcoin wallet address for the private key?And thanks a lot for help!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 06, 2023, 08:06:33 PMLast edit: May 06, 2023, 08:20:28 PM by Charles-Tim",
      "body": "Quote from: viljj on May 06, 2023, 08:03:15 PMOk, are you sure that it will work? Will i ask the site that generated the Bitcoin wallet address for the private key?Read what that I posted above for it.You can read this guide here: https://bitcointalk.org/index.php?topic=5283568.msg55426544#msg55426544It is about sending from bitcoin address to litecoin address. They have the same hexadecimal private key which you can use to recover your coins as I explained above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "viljj",
      "created_time": "May 06, 2023, 08:16:58 PM",
      "body": "They wont give me that private key  Oh well, atleast the amount was small. Wont do the same mistake twice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 06, 2023, 08:24:24 PM",
      "body": "Quote from: viljj on May 06, 2023, 08:16:58 PMThey wont give me that private key  You send the litecoin to a bitcoin address. That bitcoin address has a private key which your owns and it is what you need for the recovery. You will need the bitcoin address private key which you will convert to hexadecimal private key using https://www.bitaddress.org/ by inputting your bitcoin address private key after you click on wallet details. Check hexadecimal bitcoin private key and use it on https://liteaddress.org/ wallet details to generate you the litecoin private key and address that you need to spend your litecoin. Try and follow the step. Use those site source codes for safety reasons which you can see on the website in zip. Using the website is not safe unlike using it offline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "viljj",
      "created_time": "May 06, 2023, 08:34:20 PM",
      "body": "Quote from: Charles-Tim on May 06, 2023, 08:24:24 PMQuote from: viljj on May 06, 2023, 08:16:58 PMThey wont give me that private key  You send the litecoin to a bitcoin address. That bitcoin address has a private key which your owns and it is what you need for the recovery. You will need the bitcoin address private key which you will convert to hexadecimal private key using https://www.bitaddress.org/ by inputting your bitcoin address private key after you click on wallet details. Check hexadecimal bitcoin private key and use it on https://liteaddress.org/ wallet details to generate you the litecoin private key and address that you need to spend your litecoin. Try and follow the step. Yes, sorry if i mistunderstood, but i asked the site which gave me this Bitcoin address, if i could have the private key. They said no, they wont give me this private key.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "May 06, 2023, 08:36:48 PM",
      "body": "Quote from: viljj on May 06, 2023, 08:34:20 PMYes, sorry if i mistunderstood, but i asked the site which gave me this Bitcoin address, if i could have the private key. They said no, they wont give me this private key. I thought you only send litecoin from third party site, I did not know you send also to third part address. If you do not have the private key, you can not recover your coins. Third party sites can not give you any private key, it is theirs. Assuming you send the coin to your noncustodial wallet, you will be able to recover it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "viljj",
      "created_time": "May 06, 2023, 08:40:20 PM",
      "body": "Quote from: Charles-Tim on May 06, 2023, 08:36:48 PMQuote from: viljj on May 06, 2023, 08:34:20 PMYes, sorry if i mistunderstood, but i asked the site which gave me this Bitcoin address, if i could have the private key. They said no, they wont give me this private key. I thought you only send litecoin from third party site, I did not know you send also to third part address. If you do not have the private key, you can not recover your coins. Third party sites can not give you any private key, it is theirs. Assuming you send the coin to your noncustodial wallet, you will be able to recover it.Ok. Understood. Will email them if they can do the process themselves. If not, nevermind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "May 06, 2023, 09:37:45 PM",
      "body": "Quote from: BIT-BENDER on May 06, 2023, 07:33:38 PMBitcoin wallet can’t hold any hold Litecoins and vice Verse.It is both possible.Quote from: BIT-BENDER on May 06, 2023, 07:33:38 PMCan you please drop the transaction iD I would be interested to see it. The bitcoin network has several types addresses and none of which can accept Litecoin.You can pretty much searching up for such cases. For example, take a look at: https://www.reddit.com/r/litecoin/comments/6xpxg1/accidentally_sent_litecoin_to_bitcoin_address.In such cases, the LTC coins do not mean magically popped on the Bitcoin blockchain, it does still on the LTC network. What is happening is due to how the LTC P2SH address is derived, it is possible to send it to a \"bitcoin address\". The prefix was '3' before it changed to 'M', to maintain backward compatibility, both prefixes are accepted so that is why the transaction got through. And due to a similar prefix with bitcoin, that is the reason why it got changed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "viljj",
      "created_time": "May 06, 2023, 10:12:27 PM",
      "body": "The crypto gambling site was \"Owl.Games\". They use \"web3\" technology. Nice. https://ibb.co/J5x3ytRHere you can see that you could only have chosen network as \"Bitcoin\", when withdrawing LTC. Also the \"Gas fee\" was 0.059 LTC, which is about 5$. That is Bitcoin Gas fee. LTC is something like 0.10$They also couldnt answer Live chat for 2 hours so i took my chances. https://ibb.co/QfWqn3sThis photo shows that it was sent to given BTC address, with \"hash\" for LTC chain. So they just sent LTC to some new address that i have no acces off  https://ibb.co/KsqC8zmThis is the Hash page. Hash ID 477e408eb19521d33460651a93df92fd10d7045636c134234c17e18f9c5a6e2c",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "May 06, 2023, 10:30:59 PM",
      "body": "^^ If that is the case then I don't think that you can get it back since you don't have control of the senders adddress, which belong to Owl.games. And I also doubt that they can do something in their end. I had the same experience way back in 2019, it was a ETH->ETC transfer though, and it should be ETH->ETH but I might have pressed the wrong symbol. Anyhow, I reach to the casinos and the 3rd party custodial wallet that I did send the ETC. So neither is willing to help or at least it's a long process and so I didn't bother. It's not that big amount though, so I just took it as a lessons learned.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}