{
  "id": "topic_5466694",
  "title": "Well, ok",
  "author": "Well, ok",
  "created_time": "September 13, 2023, 05:32:55 PM",
  "content": "I have a btc wallet that received Bitcoin Cash in the 2017 hard fork.If I sweep the private key into my Electrum Bitcoin wallet, do the BCH, Bitcoin SV and other airdrops remain attached to the private key?Once I sweep the key into Electrum, can I then sweep the same private key into another client that supports BCH and etc?Many thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466694",
  "comments": [
    {
      "author": "Findingnemo",
      "created_time": "September 13, 2023, 05:36:57 PM",
      "body": "Quote from: Well, ok on September 13, 2023, 05:32:55 PMIf I sweep the private key into my Electrum Bitcoin wallet, do the BCH, Bitcoin SV and other airdrops remain attached to the private key?Yes, Sweeping the private keys into electrum will give access to the Bitcoins associated with that address.Quote from: Well, ok on September 13, 2023, 05:32:55 PMOnce I sweep the key into Electrum, can I then sweep the same private key into another client that supports BCH and etc?Yes.You can import the same private keys on Coinomi to access the BCH.If you need any help regarding claiming the hard-forked coins then use : LoyceV's Bitcoin Fork claiming guide (and service)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "September 13, 2023, 05:53:02 PM",
      "body": "Quote from: Well, ok on September 13, 2023, 05:32:55 PMI have a btc wallet that received Bitcoin Cash in the 2017 hard fork.That's not really what happened. It was not an \"airdrop\". In simple terms, Bitcoin Cash duplicated the existing Bitcoin block chain at the time. So, for all the Bitcoin addresses you control, you also control the equivalent Bitcoin Cash addresses and the BCH they might contain.Quote from: Well, ok on September 13, 2023, 05:32:55 PMIf I sweep the private key into my Electrum Bitcoin wallet, do the BCH, Bitcoin SV and other airdrops remain attached to the private key?Nothing you do with Bitcoin affects Bitcoin Cash, Bitcoin SV, or any of the many other forks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "September 13, 2023, 05:56:39 PM",
      "body": "Quote from: Well, ok on September 13, 2023, 05:32:55 PMOnce I sweep the key into Electrum, can I then sweep the same private key into another client that supports BCH and etc?Yes and no: yes you can do this, but no it might not work as you expected. Not all Forkcoins have replay protection, which means they can move on multiple chains when you send one of them. Getting some Forkcoin dust and including it in your transaction prevents that.Sweep your Bitcoin to a new address first, then the most valuable Forkcoin and continue down from there. Also be careful in installing Fork wallets, people have lost their funds by using compromised wallets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Medusah",
      "created_time": "September 13, 2023, 08:02:20 PM",
      "body": "For Bitcoin Cash use electroncash.  For Bitcoin SV there is electrumsv.io, but I have never used it and since BSV is a scam, I would not install that in my main computer.  Better load it in a virtual machine.  (if we are talking about lots of money, otherwise BSV is worthless so do not get into the trouble)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 13, 2023, 08:17:16 PM",
      "body": "Quote from: Well, ok on September 13, 2023, 05:32:55 PMI have a btc wallet that received Bitcoin Cash in the 2017 hard fork.If I sweep the private key into my Electrum Bitcoin wallet, do the BCH, Bitcoin SV and other airdrops remain attached to the private key?Once I sweep the key into Electrum, can I then sweep the same private key into another client that supports BCH and etc?Many thanks!I created this guide long ago (2018) but it still works and you can still download coinomi. This guide was created when forks still had some value, now they are all worthless,  except for bch.Remember just to move your coins (btc) to another wallet, before claiming the bchhttps://bitcointalk.org/index.php?topic=3064698.0Quote from: bitmover on March 04, 2018, 06:28:24 PMTo claim them, follow these steps:1 - Move all your Bitcoin (BTC) to another wallet, with a different seed phrase. (Most Important Step)2 - Download Coinomi wallet:https://play.google.com/store/apps/details?id=com.coinomi.wallet2 - In Coinomi, add these coins: Bitcoin Cash, Bitcoin Gold, Bitcore, Bitcoin Atom and Bitcoin Private.3 - In browser private mode  or in a offline computer, go to this website (BIP39 Mnemonic Code):   https://iancoleman.io/bip39/    insert you recovery phrase (Remember to move all your bitcoin from this wallet first!! Step 1)   In Coin textbox, choose Bitcoin.   Still in BIP39 Mnemonic Code website, scroll down to Derived Address.4 - Open your Coinomi Wallet and open each of your forked coins wallet. Click on QR Code Icon (top right corner) and scan each Private Address QR Code shown on bip39 website you just opened, until you have claimed them all.5- Do this to every forked coin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "September 14, 2023, 06:58:47 AM",
      "body": "Quote from: Well, ok on September 13, 2023, 05:32:55 PMIf I sweep the private key into my Electrum Bitcoin wallet, do the BCH, Bitcoin SV and other airdrops remain attached to the private key?Your private key is one, but generating the public key from it and broadcasting the transaction in the network requires that the software used supports it. Electrum is a Bitcoin-only wallet, you will need to download Electron Cash wallet to scan BCH and spend from it.https://electroncash.orgPerform this step after withdrawing all your Bitcoin balance.Quote from: bitmover on September 13, 2023, 08:17:16 PMI created this guide long ago (2018) but it still works and you can still download coinomi. Does the CoinOmi wallet keep syncing, I thought it stopped?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 14, 2023, 09:27:22 AM",
      "body": "Quote from: Yamane_Keto on September 14, 2023, 06:58:47 AMQuote from: Well, ok on September 13, 2023, 05:32:55 PMIf I sweep the private key into my Electrum Bitcoin wallet, do the BCH, Bitcoin SV and other airdrops remain attached to the private key?Your private key is one, but generating the public key from it and broadcasting the transaction in the network requires that the software used supports it. Electrum is a Bitcoin-only wallet, you will need to download Electron Cash wallet to scan BCH and spend from it.https://electroncash.orgPerform this step after withdrawing all your Bitcoin balance.Quote from: bitmover on September 13, 2023, 08:17:16 PMI created this guide long ago (2018) but it still works and you can still download coinomi. Does the CoinOmi wallet keep syncing, I thought it stopped?It still works normally.  It doesn't get software updates anymore, since 2022.But it still works",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Well, ok",
      "created_time": "September 22, 2023, 05:09:41 PM",
      "body": "Thanks everyone! Do I need to prepend the private key (starts with 5) with anything when sweeping it into electrum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 22, 2023, 06:19:11 PM",
      "body": "Quote from: Well, ok on September 22, 2023, 05:09:41 PMThanks everyone! Do I need to prepend the private key (starts with 5) with anything when sweeping it into electrum?  I think Electrum has an information or question mark button that shows examples of the prefixes you need to enter before the private keys. Just make sure you enter one key per line and not one after the other or with commas in between or something like that. The prefix you need to enter will depend on the type of address you have and with what character it starts. I am guessing that you are using legacy addresses starting with \"1\". In that case, I think you need to enter \"P2PKH:\" But click the info button to be sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Well, ok",
      "created_time": "September 22, 2023, 06:29:11 PM",
      "body": "Yea, it's a legacy address beginning with 1. Thank you for the help.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 22, 2023, 06:30:54 PM",
      "body": "Quote from: Pmalek on September 22, 2023, 06:19:11 PMI am guessing that you are using legacy addresses starting with \"1\". In that case, I think you need to enter \"P2PKH:\" But click the info button to be sure. Right. With using the prefix \"p2pkh:\" when importing/sweeping a private key, you tell electrum that you want the legacy address. If your address is legacy, you can also enter the private key without any prefix. That works whether the private key is uncompressed (starts with 5) or it's compressed (starts with K or L).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "September 24, 2023, 07:50:02 AM",
      "body": "Quote from: Medusah on September 13, 2023, 08:02:20 PMFor Bitcoin Cash use electroncash.  For Bitcoin SV there is electrumsv.io, but I have never used it and since BSV is a scam, I would not install that in my main computer.If you are a Bitcoiner or Bitcoin maximalist, you will consider all Bitcoin forks as scam coins. They borrow Bitcoin blockchain, duplicate it at a random block and make their shitcoins. Their shitcoins does not have anything good than a part of their coin names with Bitcoin.It is unfair if you consider Bitcoin SV is scam but Bitcoin Cash is non-scam. They are from scammers like Roger Ver and Craig Wright.QuoteBetter load it in a virtual machine.  (if we are talking about lots of money, otherwise BSV is worthless so do not get into the trouble)Sweep your Bitcoin first and use a device does not store any bitcoin on it, to claim scam coins. After you done, wipe out the operating system.OP, where are you since 2017, 6 years a long enough to just think of claming forks like Bitcoin Cash or Bitcoin SV?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Medusah",
      "created_time": "September 24, 2023, 09:48:44 AM",
      "body": "Quote from: ETFbitcoin on September 14, 2023, 09:52:44 AMWith crazy requirement to run BSV full node, i wonder how many Electrum server (for BSV coin) still running today. Even blockchair.com (block explorer) which support many altcoin, 2nd layer and token give up on BSV.That is true.  A year ago it exceeded 7 TB[1].  Have we any idea how much is it now?Quote from: dzungmobile on September 24, 2023, 07:50:02 AMIt is unfair if you consider Bitcoin SV is scam but Bitcoin Cash is non-scam. They are from scammers like Roger Ver and Craig Wright.Sure, both are scams.  I do not disagree.  But BCH is at least worth something and you can run your own Bitcoin Cash node with less than a terabyte of storage, not with 7+.[1]: https://x.com/lopp/status/1577741709693403159",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rickorick",
      "created_time": "September 24, 2023, 12:14:00 PM",
      "body": "Remember that you'll need to split the bsv from bch as they did not enable replay protection after the fork. You may also have other form coins to claim as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}