{
  "id": "topic_5464370",
  "title": "Question:",
  "author": "nutildah",
  "created_time": "August 24, 2023, 06:15:51 AM",
  "content": "Merit farming in the WO thread has gotten way out of hand.Its been a problem for years now but really ramped up this year. Although I can't prove it, I strongly suspect we're now seeing merit farmers creating alt accounts which they use to send merits back to their main accounts, with the end goal being to enroll as many alts in signature campaigns as they can.The typical merit farmer post is a copy/pasted tweet from a large bitcoin-focused Twitter account, complete with picture and (often in smaller text) the word \"source\" with a link to the tweet. These accounts are literally just taking popular tweets and pasting them in WO for no other reason than to get merits. You'll see them on just about every single page of the thread this year.This type of post is bad for a few reasons: - It is a distraction that dilutes honest conversation between good faith participants. - It is lazy, dishonest, and often wholly unnecessary. - It lends to promotion of a culture of cheating.The meriting of these posts is creating a positive feedback system where merit farmers are encouraged to continue this behavior... as a result the only skill they're actually developing is how to extract merits from senior WO posters.The simple solution to the problem is to disable the meriting of WO posts. Much like how signatures were disabled in that thread, it will discourage spammers from flooding the thread.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464370",
  "comments": [
    {
      "author": "_act_",
      "created_time": "August 24, 2023, 06:38:44 AM",
      "body": "You can see some posters that are on WO that are established even since long time ago but not really active on other threads than to post about just the price of bitcoin. There are also good posts on WO that are given merit. Merit system is not something that is totally accurate on bitcointalk, but it helps against spamming.Should merits be disabled in the WO thread? No",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "August 24, 2023, 06:59:25 AM",
      "body": "Quote from: nutildah on August 24, 2023, 06:15:51 AMThe simple solution to the problem is to disable the meriting of WO posts. Much like how signatures were disabled in that thread, it will discourage spammers from flooding the thread.What would also discourage that kind of behaviour is people not meriting those kind of posts as its not that hard at all to differentiate a legit one from merit fishing if you spend some time there (or at any other board/topic). My question is, why regulars there are not more selective when meriting as its in their best interest in order to keep the thread clean from that thrash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 24, 2023, 07:35:19 AM",
      "body": "It's been a while since I've been on the WO thread but I remember this being a problem for some time, I guess it's been exacerbated now. I remember naim027 and several of his alts getting merit there. And then other Bangladeshi accounts that were discussed a month or two ago on Reputation had also received merit there.As soon as you visit the thread you know that saying bullish statements about the price, especially if we are in bull market, or saying you have bought a certain amount of Bitcoin is quite likely to get you merit there.I think theymos thinks very hard before setting changes, but I hope he takes this into consideration, although I would like to know what the regulars there think, if they share the opinion or not. Maybe it's making the righteous pay for the sinners and they take away some of the fun they have there.Quote from: Rikafip on August 24, 2023, 06:59:25 AMMy question is, why regulars there are not more selective when meriting as its in their best interest in order to keep the thread clean from that thrash.My guess is that they don't give it much thought. Many of them have accumulated a lot of Bitcoin for a long time, notice that few of them participate in signature campaigns and 90% or more of what they write is in the WO thread, so I don't think they give it more importance than clicking for a like on Instagram or Facebook.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "August 24, 2023, 08:25:52 AM",
      "body": "How people choose to distribute the merit which they earned is completely up to them. If they want to give it to people in the WO thread for some posts that made them laugh, or because they are friendly, then that's their choice. Eventually they will run out and the problem will dissipate itself.I can see how it may seem unfair or that the thread needs to have merits disabled because of how much is distributed there, however I don't think that disabling merits there is the way to go. Of course if people are intentionally abusing or farming merit with evidence to back, just isolate those users and report them. Farming merit for the sole purpose of feeding each other merit is against the rules at the end of the day, right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "August 24, 2023, 08:31:09 AM",
      "body": "I have to disagree with your request because when you're disable merit in WO thread, it's will be unfair for high quality user since how good is his post, he will not get merit in that thread. I think the better way is limiting only full member and above allowed to post in WO thread.However you can use report to moderator since posting an image with source is considered as pointless/low value post or you can click ignore in his profile.Quote from: BenCodie on August 24, 2023, 08:25:52 AMFarming merit for the sole purpose of feeding each other merit is against the rules at the end of the day, right?There's no rule about farming merit, it's unethical and unfair to the other, but as long as they're not joining a signature campaign or abuse trust list, there's no point about farming merit, isn't?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PeRo",
      "created_time": "August 24, 2023, 08:42:23 AM",
      "body": "I think merit farming should be more moderated, so it's better to report individuals who do that and let moderators check and issue a warning/punishment rather than disabling merits in a whole thread. There are many good and informational posts there so I think they shouldn't be discredited because of others.I've seen a lot of merit farms in local boards/threads that accumulate even more merits and I haven't seen any action taken. It is probably because it would be hard to moderate every single thread and user manually so the system can't really be accurate and ideal.Quote from: Plaguedeath on August 24, 2023, 08:31:09 AMThere's no rule about farming merit, it's unethical and unfair to the other, but as long as they're not joining a signature campaign or abuse trust list, there's no point about farming merit, isn't?I'm pretty sure it is forbidden to farm merits? And it is mostly used for what you've said, sig campaigns and probably to seem trustworthy on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "August 24, 2023, 08:49:14 AM",
      "body": "Quote from: PeRo on August 24, 2023, 08:42:23 AMI think merit farming should be more moderated, so it's better to report individuals who do that and let moderators check and issue a warning/punishment rather than disabling merits in a whole thread. There are many good and informational posts there so I think they shouldn't be discredited because of others.I've seen a lot of merit farms in local boards/threads that accumulate even more merits and I haven't seen any action taken. It is probably because it would be hard to moderate every single thread and user manually so the system can't really be accurate and ideal.How can that be enforced though, I don't know much about stuff regarding merit farms but there are a lot of MS that have threads that they open to share your posts that you think is worth the merit and it just so happens that there are some people that's active on posting on those threads so no one can really blame them if they get chosen to get those merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PeRo",
      "created_time": "August 24, 2023, 08:55:28 AM",
      "body": "Quote from: Latviand on August 24, 2023, 08:49:14 AMHow can that be enforced though, I don't know much about stuff regarding merit farms but there are a lot of MS that have threads that they open to share your posts that you think is worth the merit and it just so happens that there are some people that's active on posting on those threads so no one can really blame them if they get chosen to get those merits.Those threads are legit, you get merit if the OP of the threads thinks you should and that's okay. But there are threads which are just for farming, literally everyone merits everyone without worrying about the quality of the post or the actual thread/topic.Maybe only thing that would help is more forum staff, but I don't know if that's possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Erumo",
      "created_time": "August 24, 2023, 09:01:58 AM",
      "body": "Quote from: nutildah on August 24, 2023, 06:15:51 AMMerit farming in the WO thread has gotten way out of hand.Giving merit in WO should be equaled to giving merit for a bounty report",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "August 24, 2023, 09:28:10 AM",
      "body": "Quote from: Poker Player on August 24, 2023, 07:35:19 AMAs soon as you visit the thread you know that saying bullish statements about the price, especially if we are in bull market, or saying you have bought a certain amount of Bitcoin is quite likely to get you merit there.I've visited that thread a few times and had sort of noticed that the merit distribution was like the booze at a billionaire's cocktail party, free-flowing and copious.  All the shitposters who figured out where that party was are like filthy vagrant gatecrashers dressed up in tuxedos they don't actually own.Quote from: nutildah on August 24, 2023, 06:15:51 AM - It is a distraction that dilutes honest conversation between good faith participants. - It is lazy, dishonest, and often wholly unnecessary. - It lends to promotion of a culture of cheating.While I agree wholeheartedly with all of those points, I'm of the opinion that there should be less \"government\" on bitcointalk and thus I don't think there should be restrictions set by fiat from Theymos.  I think the names of the biggest offenders from the WO thread (the ones who are handing out merits to posts that don't deserve it) should be compiled into a list and then someone should PM them with a request to visit and comment in this thread.  That way if they didn't realize this was a problem that's being noticed by the community, they'll have no excuse in the future.And after that, if the behavior isn't stopped perhaps DT members can come up with a plan of action--or not.  I don't actually know how bad the problem is in the WO thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "August 24, 2023, 09:33:15 AM",
      "body": "Quote from: The Sceptical Chymist on August 24, 2023, 09:28:10 AMI think the names of the biggest offenders from the WO thread (the ones who are handing out merits to posts that don't deserve it) should be compiled into a list and then someone should PM them with a request to visit and comment in this thread.  That way if they didn't realize this was a problem that's being noticed by the community, they'll have no excuse in the future.And after that, if the behavior isn't stopped perhaps DT members can come up with a plan of action--or not.  I don't actually know how bad the problem is in the WO thread.I agree on the part that goes to good. Tell those who give merits too blithely to come to this thread to be aware of the problem because some of them may not even be. But I don't know what strength you think DTs can have over people who don't participate in signature campaigns, are loaded with Bitcoins, and practically their participation in this forum is limited to that thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "August 24, 2023, 09:50:09 AM",
      "body": "If merit senders are merit sources, you can request a review about their distribution methods, otherwise merit farmers will find another solution.  Also you need to find where those merits come from originally.😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "August 24, 2023, 10:55:12 AM",
      "body": "Quote from: _act_ on August 24, 2023, 06:38:44 AMYou can see some posters that are on WO that are established even since long time ago but not really active on other threads than to post about just the price of bitcoin. There are also good posts on WO that are given merit. Merit system is not something that is totally accurate on bitcointalk, but it helps against spamming.Should merits be disabled in the WO thread? NoI don't see it in your way and most of what you even narrated are very good reasons for it to be disabled if possible. Merit earning and sharing are not all about whether or not you are established or whether you can redistribute it better, the first requirement is for you to share value through quality posts.I've read through WO many times and posted there about two times, but the truth is you will hardly see anyone sharing value there. The thread has degenerated from what @infofront created it for.Imagine someone who did not share value earning 32 merits in a single post. This is alarming. Should it be disabled? I say Yes if it continues like this. But No if they can return to the reason why it was originally created, and it should be better moderated with strict rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 24, 2023, 10:55:23 AM",
      "body": "Although I share your opinion on WO topic but I don't agree with you that merit should be disabled in WO topic. Disabling merit can reduce spam but it can also be a little unfair to other good members. Also, it restricts the personal freedom of merit senders members, and this is contrary to the principles of the forum.I see that the responsibility lies primarily with the merit senders, they should give the merit only to the deserving and I believe that the top WO posters really have the ability to differentiate between good and bad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "August 24, 2023, 11:07:27 AM",
      "body": "Isn't the problem with the people who Merit them? The WO-thread has been very lenient on sharing Merit for years, not only for new users, but also for \"the regulars\". They don't need Merit, and in my opinion many of the Merited posts don't deserve it. But, as far as I know, several of \"the regular WO-users\" are Merit sources too, which must mean \"upper management\" approves. And many of the Merited posts are actually worth it. So I don't think disabling Merit is a good solution, and voted No.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ibminer",
      "created_time": "August 24, 2023, 11:09:41 AM",
      "body": "Quote from: The Sceptical Chymist on August 24, 2023, 09:28:10 AMI've visited that thread a few times and had sort of noticed that the merit distribution was like the booze at a billionaire's cocktail party, free-flowing and copious.  All the shitposters who figured out where that party was are like filthy vagrant gatecrashers dressed up in tuxedos they don't actually own.   They probably do own the tuxedos. You can grab a tuxedo costume for ~.002BTC.. hat, bow tie & cane sold separately, but I'm sure the advertisers have provided enough funds for it.... I'd wear it.    (<- I'm joking btw)Who aggravates you all more.. those throwing the booze/merit around to the shitposters, or those shitposters trying to get the booze/merit being thrown around?I don't spend a huge amount of time at WO, but I do find various posts of interest, and enjoy the (sort of) laid-back atmosphere. Outside of the twitter re-posts, and the (illogical) failed meme attempts which sometimes get merit, I can't say I even fully understand why a short statement echo'ing what the market is doing on any given day, or throwing out any wild speculation, would get 5-10+ merit, even for \"senior\" members, but I try not to judge.. it is a speculation thread after all, and, for sources, I'm sure it feels much easier to drop this type of merit when a constant flow is coming in.Some of it can be entertaining, and some of them seem completely useless, to me at least. But I'm not sure if merit should be the issue here, I'd lean more towards moderation of the useless posts until they get the hint those posts are not welcome.. in this case, would that be infofront?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 24, 2023, 01:54:10 PM",
      "body": "You can test disabling merit in the WO branch. I'm sure once merits are disabled, interest in posting in this thread will drop by half if not more. There are accounts that constantly publish posts there, after which they send merits to other accounts. I won't point fingers; however, local sections such as Pakistan and the Philippines are notable for frequent visits to this thread. I exclude the old-timers who just live there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "August 24, 2023, 02:13:39 PM",
      "body": "Quote from: Poker Player on August 24, 2023, 07:35:19 AMMy guess is that they don't give it much thought. Many of them have accumulated a lot of Bitcoin for a long time, notice that few of them participate in signature campaigns and 90% or more of what they write is in the WO thread, so I don't think they give it more importance than clicking for a like on Instagram or Facebook.You are probably right, so maybe those who are annoyed with all those merit farming account should raise awaraness inside WO thread (if it hasn't been done already) so maybe people will stop meriting them. Quote from: Erumo on August 24, 2023, 09:01:58 AMGiving merit in WO should be equaled to giving merit for a bounty report  Not all WO posts are equal (some are actually great), unlike bounty reports. Quote from: The Sceptical Chymist on August 24, 2023, 09:28:10 AMAnd after that, if the behavior isn't stopped perhaps DT members can come up with a plan of action--or not. I don't know what DT members could do to try stop that, without abusing trust system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "August 24, 2023, 02:42:46 PM",
      "body": "I don't support disabling merit on WO,because the regulars are the ones giving out these merits and they are some of them that are merit source who attached themselves to that thread only. I think that the regulars are enjoying or entertaining themselves with the post from those shit posters which is making them to merit their post.The high rank users and merit source that is focused only on that thread attention should be drawn to this thread as suggested early by @Skeptical Chymist and @Poker Player so that they can minimize the way they give out merits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}