{
  "id": "topic_5472628",
  "title": "SmartGold01",
  "author": "SmartGold01",
  "created_time": "November 02, 2023, 08:54:21 PM",
  "content": "I never wanted to post this here but for the sake that it has consumed my time all day needs to shared among us to know how you feels telling your fellow female about this forum. On a short and brief discussion with my girlfriend today since I traveled to her place to visit today on getting there we exchange pleasantries at a long the line she carried my baby from me and screemed loudly saying \"madam what have you been feeding your baby that she looks very healthy and beautiful\". That I should give her update so that she can start looking like me and daughter, though I never wanted to be that open to her because with the kind of country I found myself anyone caught putting much attention on phone or computer are always classified as fraudsters, but for my friend I skipped her and changed the discussion to something else but yet she keeps insisting I should put her on business so that she can start at least doing what I am doing that is making me and my baby looks this way.After much more I told her whenever I am chance I will come or will asked her to come my house so I can go ahead with her but before that could likely happened I will like to seek the opinion of people over here if such desperate person deserved to be carried along considering the environmental and economical factor what it would result if people thinks she's doing an online business and whatever concerned online are often seen as defrauding people people.The thing is I am willing to introduce my fellow gender but I am always considering the security aspects if this will land me into something I will regret at the later end.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5472628",
  "comments": [
    {
      "author": "Z-tight",
      "created_time": "November 02, 2023, 09:24:27 PM",
      "body": "It is not even about your security in this situation, it is that you want to tell someone that BTC and bitcointalk is a way for them to make money, which you know is not always true. If your friend had an interest in BTC and wanted to learn about this p2p electronic cash, that is a different scenario and if that was the case you would tell them what you know about BTC and introduce them to the forum to learn much more. But in this situation, your friend is directly asking you for a means to make money and neither BTC nor bitcointalk is a source of income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mst.Wangdan$",
      "created_time": "November 02, 2023, 09:30:40 PM",
      "body": "I want to tell you that it is your personal matter and you should decide what is best for you.I want to say something to your friend before starting bitcoin ask him to read some books and because of reading books your friend will gain a lot of intelligence and words which will be very useful in his future and bitcoin is a different place for a man to earn surely a man's life is short. May change over time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "November 02, 2023, 09:37:15 PM",
      "body": "It depends on the level of your trust in people if you share this forum and Bitcoin and how it really helps you. It's not hard to share this with someone you trust a lot.But since that's how you feel, it's obvious that the person you're talking about on this topic is a bit doubtful. Then you can feel and notice if someone is sincere or not in what he wants to do. Don't say you don't know how to know if someone is sincere or not.When I shared this forum that is close to me, he just said that I should study it, that it can help me with financial problems, and that it can also be an opportunity to get money. And he said I'd just ask him about things I don't understand. So that's what I did; I studied with interest and determination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "November 02, 2023, 09:40:27 PM",
      "body": "I do not think that there is a risk in sharing the forum as source of Bitcoin and cryptocurrency information unless the person bragged about his earnings and financial savings to other people.  It is normal to have a forum that can be a source of information and a blessing if it is a source of extra income.One thing to remember is to never expose your financial earnings to other people.  This is also the reason why I don't hesitate Bitcointalk.org to other people as share of cryptocurrency information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "November 02, 2023, 09:58:44 PM",
      "body": "Regardless of the idiosyncrasy, the culture, always has to know how to express itself, I think that the people who have responded to OP before, surely, only read the title, since in the context  OP, there is a tendency to dissociate the idea, something strange , but whatever, it's simple, \"Common Sense.\"I mentioned it in another thread, security and anonymity is not something that only has to be had with the online environment, the offline environment is perhaps the most complicated to protect. In any case, no matter who you tell what you do about forum, the security of your bitcoin depends on you, but anyone with a $5 wrench attack can obtain what you protect so much online, so, privacy in reference not only to the Bitcoin, if not your finances, is something you have to know how to manage.(this seems like a social board topic to me)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "November 02, 2023, 10:35:21 PM",
      "body": "This shouldn't involve anyone but you and your own discretion. Normally, people here will tell you to share with your friend the word about bitcoin and this forum. However, if you're not feeling safe or okay with this, why would you want to pressure yourself, then? If I were in your situation, I'd deflect the insistence with some vague words like \"I'm working as a freelancer for a client overseas\" or something along those lines. What you do for a living and how much you make should not be anyone's business, even if it's a friend. Money burns bridges, and I assure you, if you do not share what you really do with that person, you'll be a goner to her especially since you offered her to show what it is and you're going to back out the last second. IMO, better keep it to yourself if you're engaged in bitcoin, be it trading or just simple forum posting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "November 02, 2023, 10:36:05 PM",
      "body": "For me, introducing bitcoin and bitcointalk forum to provide her a source of income will not actually work. What she needs is a rich quick investment or job that will give her immediate profits, and we all know that bitcoin and this forum are not capable of that. Although this is one way of promoting bitcoin and its forum but certainly, the timing is not right. However, you can still educate her about bitcoin and this forum so that she will be able to do some research of her own and will not jump into conclusion that this could be the answer to all her problems.I have experience this sharing about bitcoin and this forum to my friend because I think this will help him to be more open to the opportunities that bitcoin has to offer. But since he's in need of immediate source of income and has no time to study about bitcoin, then my suggestion for him didn't work. I found it later on that he was victimized from a scammer online because of his eagerness to make money and profits at a short time duration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "November 02, 2023, 11:13:50 PM",
      "body": "There's no problem if you're truthful to say that you're a man or a woman on the forum. Someone can say that she's a woman but in real life, he's a he. What matters and the most important part is on your physical life just like dothebeat said about keeping things you do to yourself especially with investments that you have. You don't want to be the next victim of $5 wrench attack just because people have known that you're engaged in Bitcoin investing or trading. That's what you should be careful when you're trying to keep up or catch up with other people. Don't trust them wholly when they build up a conversation that lies to what are you up to and what ventures you have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "November 03, 2023, 01:08:49 AM",
      "body": "Quote from: SmartGold01 on November 02, 2023, 08:54:21 PMI never wanted to post this here but for the sake that it has consumed my time all day needs to shared among us to know how you feels telling your fellow female about this forum.Depends on what you want to tell your female friends about the forum.Your husband told you about the forum but did not teach you basics and you came here to ask. If you tell your female friends about the forum, let's do something better than your husband.QuoteThat I should give her update so that she can start looking like me and daughter, though I never wanted to be that open to her because with the kind of country I found myself anyone caught putting much attention on phone or computer are always classified as fraudstersReally?Because I don't see connection of being online and being scammers. With development of computer, laptop, smart phone, mobile devices and Internet, e-commerce and more, people can work online, remotely nowadays and they have nothing to be considered as scammers by working remotely, online as freelancers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "November 03, 2023, 01:34:53 AM",
      "body": "i’m confused as to why gender plays a part in this if you don’t feel secured or confident about telling your friends about bitcoin then don’t, easy as that even if you try your best to explain everything about bitcoin and make them aware of the pros and cons, the risks and things like that they might still blame you if things go wrong it’s good to help sure but sometimes keeping things to yourself can save you from trouble especially if you don’t want to be responsible for whatever happens to your friend",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "November 03, 2023, 01:54:05 AM",
      "body": "I know you want to share the good and positive experiences you've had with Bitcoin on this forum with her, but don't forget to also inform her about the risks involved, aside from the benefits of owning and using Bitcoin. Your interests may be different, so what works for you may not work for her. I have friends who have asked me what I'm doing, whether they are male or female, and I just refer them to this forum and let them explore. If they are genuinely interested, they will come back to me with more questions, and I am ready to provide additional information and be a support system to the best of my ability and knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lombok",
      "created_time": "November 03, 2023, 02:58:00 AM",
      "body": "Quote from: Text on November 03, 2023, 01:54:05 AMI know you want to share the good and positive experiences you've had with Bitcoin on this forum with her, but don't forget to also inform her about the risks involved, aside from the benefits of owning and using Bitcoin. Your interests may be different, so what works for you may not work for her. I have friends who have asked me what I'm doing, whether they are male or female, and I just refer them to this forum and let them explore. If they are genuinely interested, they will come back to me with more questions, and I am ready to provide additional information and be a support system to the best of my ability and knowledge.Correct. If you want to provide information, you should include the benefits and risks. This should be a consideration for those who want to get involved or are interested in investment or the Bitcoin/cryptocurrency realm. Most newbies who enter the crypto realm and experience losses are only interested in fast money or large investment returns but are not introduced to the risks and losses that may be experienced as much as 100 percent of capital. Educating is a useful thing and I support it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "November 03, 2023, 03:16:32 AM",
      "body": "This varies from one country to another. If you reside in a country that does not ban Bitcoin, it is your duty to offer Bitcoin to your colleagues and family. However, if you reside in a country that prohibits Bitcoin, it is best to avoid talking or telling anything about your work with your colleagues or people you do not know.As for me, I was initially talking to my colleagues and relatives about Bitcoin and trying to convince them, but then I discovered that this could be very dangerous, so I stopped talking except to very trusted people. In the end, your personal safety should be number one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "November 03, 2023, 03:39:27 AM",
      "body": "Quote from: Text on November 03, 2023, 01:54:05 AMI know you want to share the good and positive experiences you've had with Bitcoin on this forum with her, but don't forget to also inform her about the risks involved, aside from the benefits of owning and using Bitcoin. Your interests may be different, so what works for you may not work for her. I have friends who have asked me what I'm doing, whether they are male or female, and I just refer them to this forum and let them explore. If they are genuinely interested, they will come back to me with more questions, and I am ready to provide additional information and be a support system to the best of my ability and knowledge.That's right, because what we think is best for us and maybe for other people, is not necessarily suitable or good for them and they like it.And I experienced this with good intentions so that he could learn and be like me, but in reality after entering this forum he didn't like it. Moreover, people who are lazy about reading will not be able to learn and develop because they get bored quickly and leave, and I always ask about their progress to discuss but there is no change and I think this forum is not suitable for them because if it wasn't for their wishes they would be confused.So it's best to ask first and give a general idea about this forum, as well as give an idea of what they will get in it and so on. If he has a serious interest, that's okay because that interest will develop after he starts studying it until he can actually do it, understand the risks involved and so on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "November 03, 2023, 04:10:21 AM",
      "body": "I wouldn't have a problem telling people basic information about the forum but I would never give them enough details where they can find my account and start snooping on my addresses. I'm usually careful about not reusing addresses for campaigns and contests and using other techniques to preserve my privacy, but there is still a concern that with enough motivation somebody could discover sensitive information about past and future BTC holdings and who I'm transacting with.Just because somebody is close to you doesn't mean they're entitled to every detail. There are many forums and online communities I've been a part of but I've never found it necessary to tell anyone about my involvement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "November 03, 2023, 04:30:17 AM",
      "body": "Quote from: SmartGold01 on November 02, 2023, 08:54:21 PMThat I should give her update so that she can start looking like me and daughter, though I never wanted to be that open to her because with the kind of country I found myself anyone caught putting much attention on phone or computer are always classified as fraudsters, but for my friend I skipped her and changed the discussion to something else but yet she keeps insisting I should put her on business so that she can start at least doing what I am doing that is making me and my baby looks this way.After much more I told her whenever I am chance I will come or will asked her to come my house so I can go ahead with her but before that could likely happened I will like to seek the opinion of people over here if such desperate person deserved to be carried along considering the environmental and economical factor what it would result if people thinks she's doing an online business and whatever concerned online are often seen as defrauding people people.The thing is I am willing to introduce my fellow gender but I am always considering the security aspects if this will land me into something I will regret at the later end.There is nothing wrong with introducing your friend to Bitcoin if she is really interested. Bitcoin trading or investment is not just for the male sex, women can also be a part of the sector and succeed. You need to give her a comprehensive lecture about the Bitcoin industry and she should know that the sector is not a get-rich-quick scheme. Teach her how to protect her investment from hackers and fraudsters. It is also important to distinguish between Bitcoin and altcoin in the course of the discussion. Don't force her to join the Bitcoin space and encourage her to do her own research before putting in any money. She should be allowed to take her decision and take full responsibility for her actions.I assume Bitcoin is legal in your country, so there is no issue of breaking the law. If it's legal you don't have any problem. People will always assume until they get the clear picture of what you do. I know in some countries there is high rate of internet fraud that make people assume that everyone engaging in any online job is a fraudster. But that's not a problem because you can always prove that your income or return from investment is genuine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "November 03, 2023, 04:57:40 AMLast edit: November 03, 2023, 05:24:01 AM by Plaguedeath",
      "body": "Quote from: btc78 on November 03, 2023, 01:34:53 AMi’m confused as to why gender plays a part in this if you don’t feel secured or confident about telling your friends about bitcoin Yep, it's like man is can be trusted than woman when the reality there's no difference.Quote from: Z-tight on November 02, 2023, 09:24:27 PMIt is not even about your security in this situationyour friend is directly asking you for a means to make money and neither BTC nor bitcointalk is a source of income.I think the @OP is using this forum as a source of income considering the campaign he joined is long term project, yeah he could be kicked or the campaign could suddenly stop whenever the owner want, but it's still long term.Why the @OP thought sharing this forum would harm his security? because his friend might able to take his campaign position or joined better campaign lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "November 03, 2023, 05:09:32 AM",
      "body": "Some time teaching your friend to know more with bitcointalk will be your compete in the future exactly many participants applying in signature campaign service and will less opportunity for your chance accepting. Based on my experience when teaching many people earn income trough online there are never give good respond, always talk bad behind of my self and its my reason never teaching any other exactly with bitcoin who have bigger risk when trading or investing. I think depend on your trust level, if your friend looks trusted you can teach him and talk all side with bitcointalk forum advantage and how to start it from zero. But don't forget to tell your friend its not instant way to start or earn passive income trough bitcointalk forum exactly have to build from newbie account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "November 03, 2023, 05:44:17 AM",
      "body": "Your English are not very good, so I am not 100% sure what your concerns are about this platform? Anyone can access this forum, but some countries ban access through firewalls to access the site. (We have complete freedom of speech here, so some countries see that as a threat) So, if this platform are banned in your country.. then I will not share this information with anyone... because you do not know who to trust. You are free to share information that you gathered here, but you should not reveal your source. I hope this is what you are looking for.... right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}