{
  "id": "topic_5454426",
  "title": "Little Mouse",
  "author": "Little Mouse",
  "created_time": "May 29, 2023, 06:21:49 PM",
  "content": "I have seen a lot of txs add messages to Bitcoin transactions. They are publicly visible through the explorer. If I can remember correctly, there was a message in a block where the miner has written something about the price.How I can add such a message too in a tx created by me? This has been always my curiosity but I forgot when I'm in the forum lol. Can someone share with me the way to do so? I'm using Electrum only now as I had my pc crashed and I have to download the core and whole chain once again   Can I add a message with Electrum? If not, which wallet should I use for this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454426",
  "comments": [
    {
      "author": "OmegaStarScream",
      "created_time": "May 29, 2023, 06:27:51 PM",
      "body": "Yes, you can do that using OP_RETURN. I'm not sure about other wallets, but I know Electrum supports it. Here's a step-by-step guide for it:https://armantheparman.com/op_return/Make sure to read the warnings.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "May 29, 2023, 11:00:02 PM",
      "body": "Well detailed tutorial here.Quote from: OmegaStarScream on May 29, 2023, 06:27:51 PMYes, you can do that using OP_RETURN. I'm not sure about other wallets, but I know Electrum supports it. Here's a step-by-step guide for it:https://armantheparman.com/op_return/Make sure to read the warnings.I want to re emphasis from the article, the two places where you can lose all your bitcoin or 90% of it to miners so that you will be more careful at this stages.QuoteFirst, select any UTXO you wish to spend (Learn more on what a UTXO is). In the address window (or coins window), right-click the particular UTXO (or address), and select “spend from”:Then in the “Send” tab, enter an address you wish to send the UTXO balance to (Otherwise it all goes to the miner! Be very careful!).QuoteFinal warning: To spell it out further, if you have for example a 1.0 bitcoin UTXO to spend, and you set the OP_Return value to zero sats (good), and an payment of 0.1 bitcoin to an address, and nothing else specified, then the remainder (0.9 bitcoin) will be sent to the miner! Don’t do thatCongratulations LM, looking forward to seeing it in Flush.com campaign payment next week.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "May 30, 2023, 01:27:46 AM",
      "body": "Sorry, if it is a little bit out of topic, but I find all this very interesting, because I've always wondered how you can technically write a message in the coinbase transaction when you find a block as a mining pool ?Is it just the pool that defines a message in their node that will be displayed in all the coinbases of the blocks it finds? How did it work in the past, when we solo mined with Bitcoin Core? Was it possible to choose a text  that was integrated into the coinbase transaction?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "May 30, 2023, 04:11:50 AM",
      "body": "Quote from: OmegaStarScream on May 29, 2023, 06:27:51 PMYes, you can do that using OP_RETURN. I'm not sure about other wallets, but I know Electrum supports it. Here's a step-by-step guide for it:https://armantheparman.com/op_return/Make sure to read the warnings.I don't know what I'm missing, pardon me. I can't see the spend option either. I'm trying to spend funds from the address list of coins tab. What does this \"spend from\" mean? Spend from X address? Then is it the same as \"Add to coin control\" in the current version of electrum? Quote from: iwantmyhomepaidwithbtc2 on May 30, 2023, 01:27:46 AMSorry, if it is a little bit out of topic, but I find all this very interesting, because I've always wondered how you can technically write a message in the coinbase transaction when you find a block as a mining pool ?Is it just the pool that defines a message in their node that will be displayed in all the coinbases of the blocks it finds? How did it work in the past, when we solo mined with Bitcoin Core? Was it possible to choose a text  that was integrated into the coinbase transaction?I can't tell you how as I'm not an expert but I can say yeah, you can attach a message to the coinbase data. Genesis block has this message attached by satoshi-QuoteThe Times 03/Jan/2009 Chancellor on brink of second bailout for banksif you check the block's coinbase data, you will find many of them has message attached to the coinbase data although most of them are meaningless. One of the blocks after the last halving (can't remember exactly) had something like \"Last time to buy below $10000.\" How nice the message was!Also, as an end user, we can attach a message to our transaction as well. I was trying to figure out that so I can attach messages in my future txs, just for fun though but I have something in mind for the future. I can utilize this feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamane_Keto",
      "created_time": "May 30, 2023, 08:10:36 AM",
      "body": "There are two types of messages, one of which is you write your message in the bitcoin address (a valid address, but it is not possible to generate a private key for it)TX: https://www.blockchain.com/btc/tx/54215bf9b24db3dbf3463f305128caa0c6ac5be8fd6e7d5d534f494855fd1689message QuoteJust Read AllTransaction Outputs As TextYou Take Risk When Use BitcoinFor Your Twitter GameBitcoin is TraceableWhy Not MoneroStory https://cointelegraph.com/news/hidden-messages-found-in-transactions-to-twitter-hack-bitcoin-addressQuote from: Little Mouse on May 30, 2023, 04:11:50 AMI don't know what I'm missing, pardon me. I can't see the spend option either. I'm trying to spend funds from the address list of coins tab. What does this \"spend from\" mean? Spend from X address? Then is it the same as \"Add to coin control\" in the current version of electrum? or OP_RETURN It's easier than that. All you need is in the Pay to field, type OP_RETURN deadbeef, and in the description, type your message, and make sure the value is zero because it is an invalid transaction and your coins will be burned.source https://twitter.com/ElectrumWallet/status/1380058456854528001A great site for all OP_RETURN previous messages is here Project: Preturnio - a full text search engine for Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "May 30, 2023, 06:52:23 PM",
      "body": "Quote from: Little Mouse on May 30, 2023, 04:11:50 AMI don't know what I'm missing, pardon me. I can't see the spend option either. I'm trying to spend funds from the address list of coins tab. What does this \"spend from\" mean? Spend from X address? -snip-Yes, I just checked Electrum and apparently, that option is gone. I'm not sure if one can use it from somewhere else, but if downgrading is not an option, then I would imagine you should still be able to achieve what you want without that step.But again, please be careful and make sure to read the warnings in that article.As for this:QuoteFinal warning: To spell it out further, if you have for example a 1.0 bitcoin UTXO to spend, and you set the OP_Return value to zero sats (good), and an payment of 0.1 bitcoin to an address, and nothing else specified, then the remainder (0.9 bitcoin) will be sent to the miner! Don’t do that.Since you can't specify where you're sending it from, you should make sure to choose where you want to send the remaining amount.It's probably best to test this with a wallet that only has a couple of dollars and nothing else just to make sure you're doing everything correctly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "May 31, 2023, 04:15:28 AM",
      "body": "Quote from: OmegaStarScream on May 30, 2023, 06:52:23 PMSince you can't specify where you're sending it from, you should make sure to choose where you want to send the remaining amount.I see. Then \"Add to coin control\" is the same option, isn't it? Because when I add an input in coin control, it will only let me spend that particular fund. Got it now. In other case, I can also try with freezing other addresses.QuoteIt's probably best to test this with a wallet that only has a couple of dollars and nothing else just to make sure you're doing everything correctly.If the above statement is correct, then I got the warning. I would test it yesterday. Thank you for the help and alert me the possible risk. I will try with a small input. Thank you everyone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "May 31, 2023, 05:51:08 AM",
      "body": "Quote from: Little Mouse on May 31, 2023, 04:15:28 AMThen \"Add to coin control\" is the same option, isn't it?Yes. \"Add to/Remove from coin control\" has replaced \"Spend from\". https://github.com/spesmilo/electrum/pull/8156",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "May 31, 2023, 08:16:58 AM",
      "body": "Quote from: Yamane_Keto on May 30, 2023, 08:10:36 AMor OP_RETURN It's easier than that. All you need is in the Pay to field, type OP_RETURN deadbeef, and in the description, type your message, and make sure the value is zero because it is an invalid transaction and your coins will be burned.Take note that the \"message\" should be in hexadecimal, in which a normal text should be converted into HEX.\"deafbeef\" just incidentally consists of hexadecimal characters that's why it's valid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kryptowerk",
      "created_time": "June 03, 2023, 10:21:51 AM",
      "body": "Quote from: OmegaStarScream on May 29, 2023, 06:27:51 PMYes, you can do that using OP_RETURN. I'm not sure about other wallets, but I know Electrum supports it. Here's a step-by-step guide for it:https://armantheparman.com/op_return/Make sure to read the warnings.Cool topic, will give that electrum guide a try. Seems you need to be really careful to specify a change address, otherwise the funds will be \"lost\" to the miner.Are there any adroid wallets supporting this feature? I know there is electrum for android, but it sucks, so anything aside from that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "June 03, 2023, 03:29:59 PM",
      "body": "Quote from: Kryptowerk on June 03, 2023, 10:21:51 AMQuote from: OmegaStarScream on May 29, 2023, 06:27:51 PM-snip-Cool topic, will give that electrum guide a try. Seems you need to be really careful to specify a change address, otherwise the funds will be \"lost\" to the miner.Are there any adroid wallets supporting this feature? I know there is electrum for android, but it sucks, so anything aside from that?That warning is quite exaggerated though,because Electrum will not let you create the transaction with \"0\" amount OP_RETURN alone.And if it has a non-dust amount and you forgot to set a custom change address, Electrum will automatically dedicate a change address if there's an excess amount from the selected UTXO.And if the custom change address amount is set too low for the input, Electrum will also use an actual change address.He might have though of it because of his approach on using coin-control.Notice that even though he set 2.3sat/B (356sat) in the advanced preview, his total fee is 500sat which is the excess from the input, (the excess is added as fee because it's dust)But if he selected an input with higher amount or lower the amount of the change address, Electrum will use one of his change address to receive the excess, not set it all as fee.What he/you need to do is to set the custom change address' amount to \"!\" to send all of the selected UTXO's amount to it in consideration of the fee rate that you'll set.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "June 06, 2023, 03:31:44 PM",
      "body": "I just did it- https://mempool.space/tx/a5b6398a7684bae89deb758abb64ffb42b16942359963e303e0adf5343aa5cfdCraig is a liar and fraud",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "June 06, 2023, 05:43:27 PM",
      "body": "Quote from: Little Mouse on June 06, 2023, 03:31:44 PMI just did it- https://mempool.space/tx/a5b6398a7684bae89deb758abb64ffb42b16942359963e303e0adf5343aa5cfdHaha well done! We can't spread this message enough  How did you do it? Did you follow the tutorial shared by OmegaStarScream and did it with Electrum? From my side, I'm going to try with Bitcoin Core, I've never done it before and your post has made me want to give it a try.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "June 06, 2023, 05:52:06 PM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on June 06, 2023, 05:43:27 PMHow did you do it? Did you follow the tutorial shared by OmegaStarScream and did it with Electrum? It's pretty much easier than I thought at first. Yeah I followed his suggestion and I did it with Electrum. It's as easy as below part-1. Convert text to hexadecimal2. Select the utxo you want to spend.3. Paste the address you want to send the fund and then use a comma, then the amount you want to send.4. Press enter, in latest Electrum (not sure whether it was same in the previous version), it didnt work by pressing enter. I had to select pay to many first since I was going with a new line.5. Write- OP_RETURN and a space, then paste your hexadecimal code. Put a comma and then 0. Use 0 here so you don't have to lose extra funds. You will get the rest amount in your change address.6. Congrats, release the transaction.That's it. Make sure you read the guide above, specially the warning. Learn first what you are going to do.I don't know it's possible with Bitcoin Core or not, no one mentioned this here. I would recommend using electrum first to learn the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nc50lc",
      "created_time": "June 07, 2023, 07:31:49 AM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on June 06, 2023, 05:43:27 PMFrom my side, I'm going to try with Bitcoin Core, I've never done it before and your post has made me want to give it a try.It can't be done in the GUI but doable in the command line or console.Just learn to use send command, then to add an OP_RETURN output, simply add a \"data\" key with the value of your hex-encoded message.Example command:Code:send \"{\\\"bc1address\\\": amount,\\\"data\\\":\\\"4372616967205772696768742069732061206c69617220616e642061206672617564\\\"}\"You can also manually create the transaction via createrawtransaction command to be able to create a transaction with an OP_RETURN output.Like in \"send\", it should be added as the value of the \"data\" key in the outputs.Example command:Code:createrawtransaction \"[{\\\"txid\\\":\\\"<input_txid>\\\",\\\"vout\\\":0}]\" \"[{\\\"<output address1>\\\":<amount1>},{\\\"data\\\": \\\"4372616967205772696768742069732061206c69617220616e642061206672617564\\\"}]\"Since it's a manual process, the fee should be computed from the difference of the input's amount and the total amount of the output(s).On a side note: This method is where the \"or it'll be set a fee\" warning should be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Not your key not your BTC",
      "created_time": "June 07, 2023, 08:27:18 AM",
      "body": "Does not burdened blockchain?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "June 07, 2023, 10:59:18 AM",
      "body": "Quote from: Not your key not your BTC on June 07, 2023, 08:27:18 AMDoes not burdened blockchain?Creating an OP_RETURN output means that that data is forever stored in the blockchain, yes. However, OP_RETURN outputs are not stored in the set of unspent transactions, so they do not burden nodes in the same way that burn addresses do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "June 07, 2023, 11:50:14 AM",
      "body": "Quote from: ETFbitcoin on June 07, 2023, 10:38:50 AMQuote from: Little Mouse on June 06, 2023, 03:31:44 PMI just did it- https://mempool.space/tx/a5b6398a7684bae89deb758abb64ffb42b16942359963e303e0adf5343aa5cfdCraig is a liar and fraudNice message, although you're not the first to do so based on search result from https://preturnio.com/results?p=1&b=Craig&ft=0.I wanted to learn how to add a message and I tried to add a Bengali sentence first. The output was broken, it doesn't support Bengali. I didn't any more think about new sentences. Just followed the message from the tutorial. I liked the message from the tutorial so I added that.QuoteAnd optionally use testnet first, especially if you don't want to spend money or afraid accidental doing something stupid.Thanks but after reading the tutorial and answers here, everything seems easy. That's why I didn't go for testnet anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "June 11, 2023, 09:40:14 PM",
      "body": "Quote from: Little Mouse on June 06, 2023, 05:52:06 PMIt's pretty much easier than I thought at first. Yeah I followed his suggestion and I did it with Electrum. It's as easy as below part-1. Convert text to hexadecimal2. Select the utxo you want to spend.3. Paste the address you want to send the fund and then use a comma, then the amount you want to send.4. Press enter, in latest Electrum (not sure whether it was same in the previous version), it didnt work by pressing enter. I had to select pay to many first since I was going with a new line.5. Write- OP_RETURN and a space, then paste your hexadecimal code. Put a comma and then 0. Use 0 here so you don't have to lose extra funds. You will get the rest amount in your change address.6. Congrats, release the transaction.That's it. Make sure you read the guide above, specially the warning. Learn first what you are going to do.I don't know it's possible with Bitcoin Core or not, no one mentioned this here. I would recommend using electrum first to learn the process.Thank you for the detailed answer!I did a test with sending a small tip to bitmover and it worked well via Electrumhttps://mempool.space/fr/tx/c2b5eea3e485a284ed9c7fad814e69fa6f23aff26ac0176c6262a80e3ca04691When I will have access to my Bitcoin Core, I will do a test following the advises shared by nc50lc Thank you guys for all the help provided, and to Little Mouse for creating this interesting topic !",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}