{
  "id": "topic_5465719",
  "title": "Bitcoin_Arena",
  "author": "Bitcoin_Arena",
  "created_time": "September 05, 2023, 09:22:14 AM",
  "content": "What happened:  rmcrypt.com is a scam or ponzi scheme that preys on newbies with a promise that once they donate some Bitcoins they will receive much more after some timeScammers Profile Link: https://bitcointalk.org/index.php?action=profile;u=3438779ANN: https://bitcointalk.org/index.php?topic=5385541Scammer's Website link: rmcrypt.comArchived: https://archive.ph/TUFd4Domain information: Scam websiteCode:Domain: rmcrypt.comRegistrar: GoDaddy.com, LLCRegistered On: 2022-01-10Expires On: 2025-01-10Updated On: 2022-10-05Home page of Scam website: Archive: https://archive.ph/wip/eYrVoClaims the app is like BitcoinQuote from: rmcrypt on February 13, 2022, 01:30:05 AMRegisterMyCrypto (rmcrypt.com) system, like bitcoin, does not have a middleman, company or support staff to assist you with your concernsI created an account and this is the welcome email I receivedQuote from: <noreply@rmcrypt.com>You have successfuly registered your Bitcoin wallet addressYour account is 2QFD69Please visit https://rmcrypt.com/status.php?user=2QFD69 to see account status.Donate at least BTC0.001 to activate and start receiving free coins.Please send your donations to bc1qwpapv75sasqyxdrzrpd4t2drdhg8t0vujqd9s5QR Code: https://chart.googleapis.com/chart?cht=qr&chs=300x300&chl=bc1qwpapv75sasqyxdrzrpd4t2drdhg8t0vujqd9s5Give and you shall receive.Your donation will be distributed to all participants and in turn you will receive donations from other users with a total amount of BTC1.4 to BTC2.4 depending on the rate of transaction fee at the time of distribution. This limit is to provide equal opportunity to all participants. However, you can register multiple addresses to increase your limit.Your Bitcoin share will be sent direct to your registered wallet address.rmcrypt.com is an automated system which will serve as your tool to earn money as fast as possible. It is not pretty but it is efficient and most of all, it works.The more participants, the greater the demand, the faster you get coins from this system. So don'f forget to share this app to all and watch the money flow to your wallet.NOTE: Please double check your registered wallet address and that you have necessary access to it. We want to send you coins that you can use immediately without delay. If there was a mistake, DO NOT make a donation and the account will be deleted automatically after 24hrs.Thank you and good luck,admin@rmcyrpt.com",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465719",
  "comments": [
    {
      "author": "rmcryptdeveloper",
      "created_time": "September 07, 2023, 10:08:29 PM",
      "body": "Just posting our response on the original thread -> https://bitcointalk.org/index.php?topic=5385541.0Thanks for the input guys. Honestly, We're still working on the wordings. None of us ever did something like this before and we know it will be a difficult sell. We do apologize for the incoherence. We're practically newbies in this field.It does have the characteristics of ponzi scheme. We're not denying it. We do avoid the term because of the negative vibe it brings. Just like any other business rmcrypt.com aims to bring people onboard with the product. In this case the goal is to get people to buy more Bitcoin, plain and simple.  We can't convince anyone to join the rally if there's nothing in it for them. So we placed all our effort to perfecting the algorithm instead of some fancy page design and legally sounding paragraphs.The system is set to drain itself of every single coin every 10 minutes and give it all away to participants. I guess that's what we meant to say by \"no support staff\" because it's fully automated. No one behind the curtain making adjustments to our advantage whatsoever. Yes it's not the best way to promote Bitcoin but it's the most effective. If some lucky individual decided to take the first step and donated BTC0.001 earning him/her BTC1.5 in less than 6 months from people sending donation to the system, we can call it a success.So what what's the difference?- We're not misleading or deceiving anyone. We clearly state what we plan to do with your donation and provide option to back out should you wish to do so.- We're not promising returns. We explain how the system works and how one can profit from it.- We're not taking any fees for this service. Everything is distributed to participants and transaction fees are paid accordingly to support the Bitcoin ecosystem. And yes, we prefer to call it \"donation\" because money goes to fund somebody else's needs, something we tried very hard to convey in the notification without sounding to ponzi-ish and still make sure people know where their money is going before they send it. We grew tired of deliberating what qualifies as ponzi scheme so we just went ahead and roll with it because if things work out everyone gets to profit from it. At that point ( and we do hope we get there ) it will be far from just being a money making scheme. It would be something that really helped a lot of people.We're not hiding anything other than our identities ( why? ask satoshi ). But then again I guess we need to be clear about not hiding anything. We do plan to take part in it, to profit (coz somebody got to pay the bill for these servers), but not until a few milestones. It runs on queuing recipients and right now we'd rather aim for thousands of success stories before jumping in ourselves. It's going to be a difficult road ahead. We're practically swimming in a pool of scammers skilled in disguising their intent and no matter what we say, in the end it's a person's choice whether or not to send that BTC0.001. All we can do from our side is wait for the system to do its thing and repay the kindness a thousand fold. The app might not even get any traction that it needs coz people are hard to convince these days. We know coz we even struggled to convince ourselves to build this and now we're just hoping it will work.The only risk we see here is if for some reason the service gets banned in every country ( like China ) and we're not able to migrate data forcing us to stop operation in which case you lose BTC0.001On the upside, we did learn how to code a web page :-D . We might still be able to find a way to resume in some other form of service for the benefit of the participants.Thanks again. We've been developing this for the past year and there are areas which obviously needs improvements. We are very much open to suggestions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "September 08, 2023, 01:23:05 AM",
      "body": "Quote from: rmcryptdeveloper on September 07, 2023, 10:08:29 PMIt does have the characteristics of ponzi scheme. We're not denying it. We do avoid the term because of the negative vibe it brings. Just like any other business rmcrypt.com aims to bring people onboard with the product. In this case the goal is to get people to buy more Bitcoin, plain and simple.  We can't convince anyone to join the rally if there's nothing in it for them. So we placed all our effort to perfecting the algorithm instead of some fancy page design and legally sounding paragraphs. Have you not read the rules before posting here that promoting Ponzi scheme project is strictly prohibited. You original thread clearly show that there is no earning system of the the project and the whole system is just to play with donations. The users reward depends upon donation, If there no donation then donators will loss their capital btc. When project get sufficient fund and they believe that no more donation will come then it's time to flew away. I will never trust this kind of ponzi schemes trying to cheat by slightly changing their idea of giving rewards. The system is set to drain itself of every single coin every 10 minutes and give it all away to participants. I guess that's what we meant to say by \"no support staff\" because it's fully automated. No one behind the curtain making adjustments to our advantage whatsoever. Yes it's not the best way to promote Bitcoin but it's the most effective. If some lucky individual decided to take the first step and donated BTC0.001 earning him/her BTC1.5 in less than 6 months from people sending donation to the system, we can call it a success.So what what's the difference?- We're not misleading or deceiving anyone. We clearly state what we plan to do with your donation and provide option to back out should you wish to do so.- We're not promising returns. We explain how the system works and how one can profit from it.- We're not taking any fees for this service. Everything is distributed to participants and transaction fees are paid accordingly to support the Bitcoin ecosystem. Quote We're not hiding anything other than our identities ( why? ask satoshi ). Satoshi first gain the trust and then worked on something new and clear all things about btc in the whitepaper. he didn't begged for donations and his Bitcoin revolution is totally decentralized. You want to compare your ponzi scheme with Satoshi work?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rmcryptdeveloper",
      "created_time": "September 08, 2023, 02:10:23 PMLast edit: September 08, 2023, 02:32:54 PM by rmcryptdeveloper",
      "body": "If we are talking \"capital\" then that means loss and gain. There should be results and specifics like amount, interest and time duration. That's how it should be in a financial investment. This is also why we don't use such terms. So we stick with \"donation\". Something one can spare. Small amount, negligible even. The expectation of a reward is there but it's nothing as definite and demandable as in a financial investment. This is why we also stated \"distribution only occurs when a donation is made\" which clearly means there is no specific time set for one to receive the reward. It all depends on the popularity of the app. Could be seconds,days or months before a participant start to get a thank you coins from the system. We clearly understand the rules of the forum and here we are trying to explain the system is not a Ponzi financial investments which requires terms and expectations to be set. Ponzi deals with deception and it's unsustainable.RMCRYPT.com is just a benign system ready to throw your donation to people who need it and throw you back some as a BIG thank you, no promises as to when. The only thing to sustain it is to pay for the hosting fee which we will shoulder as long as we can. It will run in perpetuity just waiting for donation and distributing to undemanding participants.We don't mean to compare ourselves to Satoshi. But he/she/they/it does set an example that good deeds need not a name or a face.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 08, 2023, 02:49:48 PM",
      "body": "Quote from: rmcryptdeveloper on September 08, 2023, 02:10:23 PMThis is also why we don't use such terms. So we stick with \"donation\". Something one can spare. Small amount, negligible even. The expectation of a reward is there but it's nothing as definite as a financial investment. This is why we also stated \"distribution only occurs when a donation is made\" which clearly means there is no specific time set for one to receive the reward. It all depends on the popularity of the app. Could be seconds,days or months before a participant start to get a thank you coins from the system.This is not new this is the same scheme or concept created by Sergei Mavrodi where his company used and utilized a donation scheme to scam billions of money from people many part of the world  QuoteMMM is a global mutual aid community. How do we help each other? We donate money. In today’s world, allpeople need money – one, who has no money, is supported by somebody else.The Community members donate money peer-to-peer to each other. MMM only connects the donator and receiver. MMM is a financial social network, where people sign up, specify their contact details, as well as theaccount which they want to receive the money on.  What is Mavrodi Mondial Movement(MMM)Quote... here we are trying to explain the system is not a Ponzi financial investments which requires terms and expectations to be set. Ponzi deals with deception and it's unsustainable.RMCRYPT.com is just a benign system ready to throw your donation to people who need it and throw you back some as a BIG thank you, no promises as to when. The only thing to sustain it is to pay for the hosting fee which we will shoulder as long as we can. Everything in your explanation just proved that you modeled it after the idea of Mavrodi You just made a tweak but the ideas are all here Quote\"mutual aid fund where ordinary people help each other there is no product or service and you will get your profit from your funds when your time to receive donations from other, yours is a cheap imitation of the original MMM but the idea of Mavrodi one of the promoters of Ponzi scheme in Cryptocurrency is all here.https://en.wikipedia.org/wiki/MMM_Global",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rmcryptdeveloper",
      "created_time": "September 08, 2023, 03:59:25 PMLast edit: September 09, 2023, 03:21:00 AM by rmcryptdeveloper",
      "body": "Thanks for the link. I honestly didn't even know something like it existed. But I can't say I'm surprised if there was actually something similar out there. Yes, some great ideas starts off with good intention until it becomes bad because of greed. Give me time to learn about this MMM. Indeed the concept is not new. Like what we mentioned in another thread. An individual can donate $10,000 to charity ball and get access not only to expensive dinner, fancy venue and good entertainment, but also gets to meet wealthy people and perhaps pitch some good business idea with the hope of getting funded. RMCRYPT.com simplifies the process without the expensive meal, suit and other stuff. In the end there's still that uncertainty of getting instant results from both methods. For what it's worth, rmcrypt.com does not store funds. It \"bounces\" it to participants for the lack of a better description. Donated funds does not stay more than 10 min in the systemTransaction records are available and can be reviewed and traced even if your up to it. This is the only proof that is readily available publicly to show donation are not kept or accumulated somewhere only to be taken advantage of by individuals.  We can't provide information as to who owns the recipient BTC addresses, we didn't create a mechanism for that. Besides, that would defeat the purpose of anonymity but participants have their choice to attest to their experience using rmcrypt.com and that's what we're hoping for.We understand all the skepticism and correlations to scamming operation and believe us, we're learning from this. We welcome the discussion and debates regarding rmcrypt.com but persecution even before a meaningful discussion kills any opportunity to improve. I hope ya'll would agree. yes it's cheap coz we're non-profit but certainly not an imitation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 08, 2023, 10:23:17 PM",
      "body": "Quote from: rmcryptdeveloper on September 08, 2023, 03:59:25 PMThanks for the link. I honestly didn't even know something like it existed. But I can't say I'm surprised if there was actually something similar out there. Yes, some great ideas starts off with good intention until it becomes bad because of greed. Give me time to learn about this MMM.I don't know if you are aware and just deny it or you really don't know this, but either way, this is not an excuse in case you receive a backlash or are charged in case authorities think that you are part of the old MMM company trying to revive the concept of donation-based Ponzi Scheme, we have a saying ignorance of the law excuses no one.  QuoteIndeed the concept is not new. Like what we mentioned in another thread. An individual can donate $10,000 to charity ball and get access not only to expensive dinner, fancy venue and good entertainment, but also gets to meet wealthy people and perhaps pitch some good business idea with the hope of getting funded. RMCRYPT.com simplifies the process without the expensive meal, suit and other stuff. In the end there's still that uncertainty of getting instant results from both methods. Your concept is still based on a Ponzi scheme because there is no product or service involved, it thrives on people's getting more based on what they are giving QuoteFor what it's worth, rmcrypt.com does not store funds. It \"bounces\" it to participants for the lack of a better description. Donated funds does not stay more than 10 min in the systemTransaction records are available and can be reviewed and traced even if your up to it. This is the only proof that is readily available publicly to show donation are not kept or accumulated somewhere only to be taken advantage of by individuals.  We can't provide information as to who owns the recipient BTC addresses, we didn't create a mechanism for that. Besides, that would defeat the purpose of anonymity but participants have their choice to attest to their experience using rmcrypt.com and that's what we're hoping for.We understand all the skepticism and correlations to scamming operation and believe us, we're learning from this. We welcome the discussion and debates regarding rmcrypt.com but prosecuting even before a meaningful discussion puts an end to any opportunity to improve. I hope ya'll would agree. yes it's cheap coz we're non-profit but certainly not an imitation. You are just another Sergei Mavrodi who preached his scheme as something beneficial to society but in the end, ended up scamming poor people in many parts of the world with his so-called \"mutual aid fund where ordinary people help each other, same concept same convincing words same bad intention and I'm 100% sure it will have the same results.You're just using Bitcoin adoption to propagate your concept just like your successor but compared to Mavrodi he is so brave to show his true identity while you keep yours to protect you and your team from being prosecuted in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rmcryptdeveloper",
      "created_time": "September 09, 2023, 12:00:18 AMLast edit: September 09, 2023, 05:09:45 AM by rmcryptdeveloper",
      "body": "It seems @obelneo already made up some personal conclusion and refuse to re-evaluate his/her/their/them/it stand on this matter. No explanation whatsoever will change said conclusion. But we're not here to convince @obelneo, we are here for the people reading this forum. In simplest term, donation does not require mutual exchange of goods or services. But if you are hardwired to think that no such thing exist and that the law always requires something in return otherwise it's a scam, I'm afraid we can't do anything about that. It's a sad world you are living in. Nobody will be able to help another, kindness will not exist. It will always be just an absolute agreement of equivalent exchange. Such principles will come into character, even with your day to day discussion. An eye for an eye, a comment for a comment sort of thing.   I do not know Sergei Mavrodi, haven't had the time to dedicate myself to learning about him. We still have a day job   you see. I think I'll put MMM aside for now coz it does not seem to matter to @obelneo and there's no point.We're not treating this as backlash. We treat this as an opportunity to explain ourselves and our goal. Insisting that we are hiding something or we have ulterior motive would be unfair coz to be frank, nobody here even tried the app yet and that is unfortunate. That would have been our proof to support our claims. Some people would just rather accuse or kill something rather than take time to understand it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "September 09, 2023, 03:23:46 AM",
      "body": "Quote from: rmcryptdeveloper on September 09, 2023, 12:00:18 AMIt seems @obelneo already made up some personal conclusion and refuse to re-evaluate his/her/their/them/it stand on this matter. No explanation whatsoever will change said conclusion. I'm not making a conclusion I'm presenting the fact that there's a similar concept to your ideas that are based on the Ponzi scheme created by MavrodiQuoteBut we're not here to convince @obelneo, we are here for the people reading this forum. I am posting in your thread also for the people to see and compare your ideas to Mavrodi's version of the Ponzi scheme Of course, you will deny Mavrodi and admit that your concept is a Ponzi Scheme you have to hide it by constructing and configuring that's not until it is exposedBut unfortunately, you expose yourself this early with these words.Quotermcrypt.com is an automated system which will serve as your tool to earn money as fast as possible. It is not pretty but it is efficient and most of all, it works.The more participants, the greater the demand, the faster you get coins from this system. So don'f forget to share this app to all and watch the money flow to your wallet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rmcryptdeveloper",
      "created_time": "September 09, 2023, 04:52:57 AMLast edit: September 09, 2023, 05:41:49 AM by rmcryptdeveloper",
      "body": "I'm starting to think this Mavrodi is a god of some cult or something considering how many times he ( or she? ) was mentioned in this conversation. My interest is somewhat back to find out who this person is. It's quite obvious that @robelneo is trying to state facts but does not seem to fail on insinuating there's foul play despite the counter arguments. He uses words such as \"deny\" and \"expose\" to imply mischief or guilt and perhaps sway public opinion ( feels like the medieval days of inquisition). Moreover there has been no victim or complaint nor have we admitted to anything which he struggles to attain time and again to prove his theory. @robelneo view remain's unchanged and keep siteing the Mavrodi person's case. We stated the facts and parameters how the system works as means of being transparent and setting expectation to potential participants which is the opposite of Ponzi schemes. Our method of advertising which solely depends on the user's experience and their will to share this new found app with a potential reward for doing so which pretty much is similar to advertisers earning their living for promoting a product or service. Only we can't apply this exact same concept in RMCRYPT.com. That will require a referral system which will turn the app into a full fledged Ponzi scheme which it is not.It's probably @robelneo's default stand on all arguments in this forum and we don't blame him. Sometimes one''s desire to be right gets in the way of their desire to be just. From this point, we'll refuse to indulge @robelneo's self gratification by suspending our response to him/her/they/them/it until a clear indication the he is ready to engage in a more meaningful discussion. We do thank @robelneo for opinion and input but we think we're ready to move on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "September 09, 2023, 08:21:42 AM",
      "body": "This is an open forum, you can advertise the product you want provided that it does not violate the terms of the forum, the point of contention is here: you say that this is not a Ponzi scheme while most members agree that this is a Ponzi scheme and therefore against the rules of the forum.Although I agree with the rest of the members that this is a Ponzi scheme, and you yourself say that the way the application works is very similar to Ponzi schemes, but as you said, this all depends on the user's will to participate in the application or not, so in the end if they lose their money, it falls Blame them alone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "September 09, 2023, 09:02:36 AMLast edit: September 09, 2023, 09:27:10 AM by Bitcoin_Arena",
      "body": "@rmcryptdeveloper it seems you are fond of breaking forum rules. Your other account was banned, and now you are evading ban. Are you aware that this account is going to get banned as well once reported?I saw your message and I didn't want to respond to an already banned user. Maybe I will come back here later once you have sorted out your issues with the Admins and mods.Read the forum rules for once.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rmcryptdeveloper",
      "created_time": "September 09, 2023, 10:50:26 AMLast edit: September 09, 2023, 11:12:12 AM by rmcryptdeveloper",
      "body": "Thank you @yhiaali3 If majority is required then we're no longer looking to win the argument here. We're but a small group trying to introduce a great innovation. Makes me think what's the point of a forum then. I'm sorry if the statement that rmcrypt.com has similar characteristics to a Ponzi lead the members to believe that we are admitting to scam operation. It was meant to humor coz if that is the case, all businesses are Ponzi. Lure people to a product or service that supposed to produce good result and if does not, then sorry, thanks for buying. If that's indeed the premise then we are allowing Bitcoin to be defined as ponzi as some well known financial personalities has publicly stated and still insist that Crypto is a sham. You invest at your own risk and if it fails then sorry, again, thank you for playing. That's practically the motto of the entire stock market. And yet here we are innovating to bring back the interest and hype that once was. Here's the characteristics of Ponzi as we see it- Fraudulent- Unsustainable- Secretive- Difficulty with payments or does not pay at allI bet it has triggered a lot of extensive debate everywhere as to actual criteria coz even legit businesses will fall under the same category if you make the list too long   ( a lot already falls under the last criteria )Ever thought that a chicken might have objections to being called a bird for having wings? That's how these businesses would feel and how we feel right now. Thus our continuous effort to convince readers otherwise. RMCRYPT.com does not force people to join or promise great returns. It's a picture of what could be. A new hype that can push bitcoin value up indefinitely It's a wonderful platform where in you can ask for financial help just by posting your BTC address. Sending help is also just as easy. It promotes kindness in its pure form. Non-selective, no prejudice or discrimination, no profiling. Everyone gets their turn. Quote from: Bitcoin_Arena on September 09, 2023, 09:02:36 AM@rmcryptdeveloper it seems you are fond of breaking forum rules. Your other account was banned, and now you are evading ban. Are you aware that this account is going to get banned as well once reported?I saw your message and I didn't want to respond to an already banned user. Maybe I will come back here later once you have sorted out your issues with the Admins and mods.Read the forum rules for once.@Bitcoin_Arena Sorry about that. We couldn't help but respond right away since this is our first project. Will return with our original account once ban has been lifted. Thank you so much for giving us the chance to respond. See you in a few days",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "September 09, 2023, 12:52:10 PM",
      "body": "Quote from: rmcryptdeveloper on September 09, 2023, 10:50:26 AMRMCRYPT.com does not force people to join or promise great returns. Lest you forget you have this in your automated message.Quotermcrypt.com is an automated system which will serve as your tool to earn money as fast as possible.A lawyer once told his clients to always tell the truth so they will not have to remember anything, Whatever explanation you posted even if it comprises 10 pages the fact is you promoted your platform as a means to make easy fast money and you even posted to promote the application like how MMM and Ponzi schemers do their campaign.QuoteSo don'f forget to share this app to all and watch the money flow to your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rmcryptdeveloper",
      "created_time": "September 09, 2023, 01:42:46 PM",
      "body": "@coin-investorAnd that same lawyer will ask for things like amount, time and date to expect the promised profit. Which are critical factors to qualify as fraud coz maybe you're mistaken with rmcrypt.com's suggestive approach. It's called marketing, you see it everyday practically everywhere like TV adsWe are well aware of what we put in the email notification. And it does look like we need to update that message as it sound different now that we're being accused. Thanks you @coin-investor@Bitcoin_Arena sorry man. We just had to respond to that last one. This accusation thing is hard. Is there even an acquittal forum here?    It would be very good to know if it's possible to get one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 09, 2023, 02:27:34 PM",
      "body": "This is a full-blown scam. I laughed a lot at the following, although it's no joke:Quote from: rmcrypt on February 13, 2022, 01:30:05 AMRegisterMyCrypto (rmcrypt.com) system, like bitcoin, does not have a middleman, company or support staff to assist you with your concerns. It is subject to the rules of law governing the land where the system is hosted and can or will be shutdown by authorities if deemed necessary. <...>So, they're going to rip you off and you'll never hear from them again. Quote from: rmcryptdeveloper on September 09, 2023, 12:00:18 AMIn simplest term, donation does not require mutual exchange of goods or services. In this forum we know what donations are, many have been organised to support charitable causes or other projects, I myself have donated many times but what we also know is how to recognise scams, so I will not donate to your ponzi scheme.Quote from: rmcryptdeveloper on September 08, 2023, 02:10:23 PMRMCRYPT.com is just a benign system ready to throw your donation to people who need it and throw you back some as a BIG thank you, no promises as to when.So what we have to have is faith in your system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "September 09, 2023, 02:57:48 PM",
      "body": "I added a negative trust.Quote from: rmcryptdeveloper on September 07, 2023, 10:08:29 PMIt does have the characteristics of ponzi scheme. We're not denying it. We do avoid the term because of the negative vibe it brings. Just like any other business rmcrypt.com aims to bring people onboard with the product. In this case the goal is to get people to buy more Bitcoin, plain and simple.  We can't convince anyone to join the rally if there's nothing in it for them. So we placed all our effort to perfecting the algorithm instead of some fancy page design and legally sounding paragraphs.Trying to write a lot of words will not change the fact that what you are offering is a ponzi scheme. All the meaning of the word is present in your system. You promise users that you will achieve a return without explaining how that will happen. You say that the profits will be randomly distributed to the users, but you can easily create an account and withdraw money for you.you say you do not receive fees, so how does the site work?   In the end, there is no explanation for the importance of what it offers except that it generating money from money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "September 09, 2023, 03:46:34 PM",
      "body": "Quote from: hugeblack on September 09, 2023, 02:57:48 PMI added a negative trust.They deserve this and it is about time, These Ponzi Scheme operators are good at structuring words because that's all they have to entice people to invest, they are influencers and lawyers roll into one, MMM and Ponzi operators are good at convincing people they have trained themselves to do this because they have no product or services to promote the people's money is their products and their selling point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 09, 2023, 04:04:04 PM",
      "body": "Quote from: Saisher on September 09, 2023, 03:46:34 PMThey deserve this and it is about time, These Ponzi Scheme operators are good at structuring words because that's all they have to entice people to invest, they are influencers and lawyers roll into one, MMM and Ponzi operators are good at convincing people they have trained themselves to do this because they have no product or services to promote the people's money is their products and their selling point. I haven't left negative feedback for the original account, rmcrypt, because Bitcoin_Arena says it has already been banned, so I don't think it's worth it, but I don't see the ban on bpip.org. Anyway, we have to do what little we can from the forum against these scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rmcryptdeveloper",
      "created_time": "September 09, 2023, 04:52:59 PM",
      "body": "You can continue on speculating or you can test it. It only takes two registration to verify that its working as designed. You think BTC0.002 it's worth the trouble building and maintaining this app? If we do runaway with your coin you got yourself an entire blockchain to prove that we did and you can post everywhere to put an end to this app. Go on and take a shot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}