{
  "id": "topic_5438414",
  "title": "teramit",
  "author": "teramit",
  "created_time": "February 06, 2023, 08:43:48 PMLast edit: February 10, 2023, 03:24:19 PM by teramit",
  "content": "Her depremde olduğu gibi malumunuz maraş merkezli depremde de yeni binaların yıkılması ile ilgili yalan yanlış bilgiler dolanıyor etrafta. Uzmanlık alanım sayılan bu konuda ufak bir bilgilendirme yapayım.Yeni bina: 2006 sonrası yeni yönetmelikle yapılmış bina , Eski bina:2001 öncesi yeni yönetmelikle yapılmış bina  (2001 de yapı deneyim yasası 2006 da yeni deprem yönetmeliği çıkıyor)Bugün gerçekleşen büyük depremde 7,7 gibi bir ölçek ve 7 km gibi bir derinlik söz konusu , 7,6 lık ayrı bir deprem 12 saat geçmeden gerçekleşiyor.Bu tip sarsıntılardan sonra hala ayakta bina kalmış olmasını enteresan bulduğumu belirtmeliyim.99 depreminden sonra yeni yapılan binalar 7 şiddetindeki depreme göre hesaplanıyor ve % 30 güvenlik payı ekleniyor. yani 7.5 ve üstündeki depremlere göre bina yapılmıyor diyebiliriz çok kabaca.Şimdi yeni binalarda deprem hasarı çok az olabiliyor ama yönetmelik 7 şiddetindeki depreme göre hazırlanmalı diyor. bu depremi yedikten sonra amaç binanın insanların ölmeden binadan çıkmasına izin vermesi, yani malı değil canı korumak esaslı bir anlayış var. Binanın hasarını etkileyen çok faktör var hepsine değinmiyorum ama bir bina bir kere 7 üzeri deprem yedi mi , ağır hasarlı araç gibi sayılıyor, bir uzman değerlendirmeden içine tekrar girmemek lazım. Birçok yeni bina depremi az hasarla atlatmış gibi duruyor, ancak deprem bölgesindeki binaların çoğunun eski olduğu biliniyor, birçok eski bina da yıkılmadan merkez üste olmalarına rağmen günü atlatmış gibiler. Yeni bina da olsa eski bina da olsa artık 7.7 üzerine 7.6 yemiş binalar ciddi darbe almış durumdalar. İçindeki insanların ölmeden çıkabildiği her yeni bina işini yapmış demektir. Bir çok kişi yeni binaya birşey olmaz gibi algılıyor ama siz 7,7 den sonra 7,6 gelmişse ilkinden aldığı hasardan dolayı ikinci de gitmesi gayet olası. Görebildiğim bir yeni bina yıkılmamış ama hakeza yıkılsa dediğim gibi içinde insan ölmemişse ilk dakikalarda görevini yerine getirmiş oluyor. binalarda duvar yıkılması tavan çatlaması sıva dökülmesi gibi durumlar yeni binalarda da olabilir, duvarı yıkılan binaya yıkılmış işte diyen tiplerde var ortalıkta ama taşıyıcı sistemlerin durumu önemli duvarı tamir edebilirsin ama taşıyıcı zarar görmüşse uzman bakıp güçlendirme yada komple yıkım verecektir.Malatya da yıkılan yeni bina haberi var ama o yalan bina 22 yıllık yani 2006 öncesi hatta 2001 öncesi o da eski sayılır, ki orda da insanlar çıktıktan sonra yıkılmış yani can kaybı yok yani eski olmasına rağmen yine iyi iş görmüş, tabi çevresindeki binalar yıkılmamışken neden yıkılmış bunu incelemek lazım bu ayrı bir başlık konusu.Yeni binalar yıkılmaz demiyor kimse sadece belli bir şiddette bir kereliğine canınızı korur deniliyor, buna rağmen gayet iyi iş çıkarmışlar gibi duruyorlar. Eski binalar da kesin şu şiddette yıkılır diyemeyiz bazen yanlışlıkla da olsa sağlam yapılabiliyor binalar , fazladan kolon çimento demir kullanan insanlar oluyor inşaatlar da.Maddi imkanınız varsa kesinlikle yeni binalarda oturun, eski binalara mecburen girme durumunuz olabilir ben korka korka girip bir an önce çıkmaya bakıyorum.Eski bina ile yeni bina arasında duruma göre 3-5 kat güç farkı olabiliyor yani 3-5 kat daha fazla yük taşıyabilir benzer durumdaki iki bina yenilik durumuna göre.  Düzenleme, sismograf verisi:Maraş depreminin sismograflardan alınan ivmelenme verileri:- Kesikli çizgi binalar için hesaplanan ivmelenme- Renkli çizgiler gerçekleşen ivmelenmelerGörüldüğü gibi deprem binalar için hesaplanan dan daha şiddetli olmuşbu veriler önümüzdeki günlerde rapor haline getirilirse linkini de paylaşırım",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438414",
  "comments": [
    {
      "author": "meser#",
      "created_time": "February 06, 2023, 09:49:06 PM",
      "body": "Bahsettiğiniz çıkarımların yapılmasının haklı yanları da ne yazık ki var hocam. O kadar müteahhit inşaat esnasında maldan kısarak, çalarak bu inşaatları bitirerek resmen cinayete teşebbüste bulunduğundan ve böyle çıkarımlar yapılmasına da hak vermemek elde değil. En büyük korkulardan bir tanesi de dün için gerçekleşmişti yine 7'nin üstünde bir deprem ciddi anlamda zor anlar yaşattı. Enkaz alanları daha da beter hale geldi ve gerçektende buralardan kurtarılan insanlar mucize eseri kurtuldu desek yanlış olmaz yani. Birde uzmanlık alanınız sayılabildiği için soruyorum. Diğer ülkelerin yasalarında kaç şiddetine göre yapıların hazırlanmasına dair ibare yer alıyor var mı yok mu? Birde Japonların yapılarda depreme dayanıklılığı bayağı bilindik bir durum onlarda bu konuda bir yasal mevzuat var mı? Kıyaslama yapmak istemiyorum ancak gerçektende sınıfta kaldığımız bir durum olduğu için merak etmeden duramıyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teramit",
      "created_time": "February 06, 2023, 10:11:51 PM",
      "body": "Quote from: meser# on February 06, 2023, 09:49:06 PMBirde uzmanlık alanınız sayılabildiği için soruyorum. Diğer ülkelerin yasalarında kaç şiddetine göre yapıların hazırlanmasına dair ibare yer alıyor var mı yok mu? Birde Japonların yapılarda depreme dayanıklılığı bayağı bilindik bir durum onlarda bu konuda bir yasal mevzuat var mı? Her gelişmiş ülkede var, zaten bizde bir yönetmelik  varsa onlardan alınmıştır. Her ülke kendi depremlerine göre belirleyip ona göre yayınlar. Bizde de her il aynı derecede değil , ama büyük depremler sonrası illerin deprem dereceleri güncellenir.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "February 06, 2023, 10:46:58 PM",
      "body": "Fay hattının geçtiği yere denk gelmiş ise yeni de olsa bina yıkılır. Deprem konusunda uzman ( adını hatırlayamadım) bu depremin 350 atom bombası gücünde olduğundan bahsetti. Bu güce nasıl dayanır.İhmal var yok o araştırılır. Zaten bizim ülkemizde 99 depreminden sonra evlerin nasıl olacağı ile ilgili yasa çıktı diye biliyorum. Bir ara kentsel dönüşüm adı altında rantsal dönüşüm oldu. Ben bu ev yapımı konusunda devletin tek yetkili olması tarafındayim..orada da inşaat jeoloji gibi mühendislikleri bitirmiş etkili liyakatli kişilerin olması ve onların gözetiminde ev yol ne yapılacaksa yapılması gerektiğini düşünüyorum.Önüne gelen müteahhitlik yapmamalı. 99 depreminde en meşhur müteahhit veli Göçer idi bu deprem de kim ya da kimler olacak merak ediyorum. Umarım yine halının altına süpürüp geçmeyiz ve ülke olarak bu durumdan çok sağlam ders çıkarırız. İstanbul gibi bir yerde acil önlemler alınmalı. Yoksa daha büyük İstanbul depremi ( Allah göstermesin) bizim için kıyamet gibi olur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "February 07, 2023, 06:25:35 AM",
      "body": "Yıkılmayan bina olmaz. Bu ülkede 1948'den beri deprem haritası var ve hemen hemen her 20 yılda bir yıkım olduğu yerde sen gereken tedbiri almıyorsan bina ödürür diyemezsin. ÖLDÜREN ZİHNİYETTİR.BİLE BİLE MİLLETİ ÖLÜME TERK ETTİLER. Gece uyuyamadım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "February 07, 2023, 06:50:53 AM",
      "body": "Quote from: yenerbatmaz on February 07, 2023, 01:08:58 AM...milli şefimizin meşhur talihine bir ekleme de ben yapayım. kendisi milli piyangodan büyük ikramiye kazanmıştır. hem ilerici, aydınlanmacı, devrimci ve milli şef olup hem de milli piyangodan büyük ikramiye tutturmak herkese nasip olmaz; talih kelimesinin karşısına onun ismini yazsalar yeri varmış. yani, \"yener bugün çok inönülüsün\" deseymişiz, eş anlamlılık bakımından sorun olmayacağı için doğru bir ifade kurabilirmişiz.şu acı günde birlik ve beraberliğe ihtiyaç varken geçmişi kıyaslayıp kutuplaştırıcı söylemlerle siyaset yapmaya çalışıyorsun. utanman var mı bilmiyorum ama şuan bir yerlerde son nefesini vermek üzere olan insanlar olabilir. ayrıca, bir kıyas dinleyeceksek bunu bir uzmanın ağzından duymalıyız (ideolojik saplantılara takılmış birinden değil):ilk kez, ilk kez türkiye cumhuriyeti hükümetlerinin stratejisini daha çağdaş hale getirdi.https://twitter.com/Yusaisback/status/1622658369906507777yemin ederim ki bir hafta önce müteahhitler hakkında bir konu açacaktım ama hem genelleme olmasın diye hem de bir meslek grubunu doğrudan hedef almamak için açmadım. kardeşimin mevzusu nedeniyle bunlardan biriyle yakın zaman öncesinden muhatap oldum; adam bana tek ayak üzerinde kırkayak dansı yaparken, sinirden kafayı yemek üzereydim. türkiye'de mevzuat ve yönetmelik tam, bu konuda bir eksiğimiz yok ama işi yapan adam nokta nokta çocukluğu yapacaksa kimse onu engelleyemez; her türlü bir yolunu bulur ve yapacağını yapar. beton kalitesinden çalamıyorlar ama özellikle demirden ve demirin bağlantısındaki işçilikten falan zorlanmadan çalabiliyorlar. zaten, yukarıdan aşağıya doğru yıkılan/çöken binaların açıklaması da genellikle taşıyıcıların zayıf olması olarak açıklanıyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZekiBeyy",
      "created_time": "February 07, 2023, 09:01:22 AM",
      "body": "Sanırım 2 ay önceydi Youtube'da 17 Ağustos 1999 depreminde yıkılmayan yer başlığını görünce merak ettim videoyu izledim tekrar paylaşayım.https://www.youtube.com/watch?v=30a9qKc3ZLw&t=539sKısaca özetleyecek olursam Tavşancıl Kuzey Anadolu Fay hattı üzerinde bir belde. 1989 yerel seçimlerinde Salih Gün belediye başkanı seçilir ilk iş olarak Kocaeli Üniversitesinden destek alarak bilimsel imar planı çıkarttı. Salih Gün tehlikenin farkındaydı 3 kattan fazlası için imar izni kesinlikle vermedi, meclis üyelerine, kendi akrabalarına hatta basasına bile izin vermedi. Salih Gün bu kararından asla taviz vermedi ama insanlar bu durumdan şikayetçiydi. 1999 depremi sonrası durum tespiti için belediyeleri aradılar ve çok şaşırdılar az hasarlı bina bile yoktu, yaralı ve can kaybıda yoktu. Salih Gün 15 yıl belediye başkanlığı yaptı sonrasında ise imar işi eski kadar iyi denetlenmedi. Hiç ders alınmamış olacak ki 2000 sonrasında insanlar başkan değişince hemen binalarına fazla kat çıkmaya başladılar. Türkiye 3 büyük fay hattına sahip özellikle bu hat doğrultusundaki yapıların daha sağlam yapılması denetlenmesi gerekir yoksa yıllar geçse de benzer senaryolar değişmez. İnsanımızda hiç ders almıyor bu depremin üzerinden 3-5 yıl geçmeden her şey unutulacak yine gelişi güzel binalar yapılacak. Her şey rant olmamalı ama maalesef öyle insanın canın bir önemi yok önemli olan rant rant rant.  Eniştem Japonya'da inşaat yıkım ekibinde çalıştı anlattı bir örneği aktarayım; iki katlı bir binanın yıkımına gittik dedi 3 ay yıkımıyla uğraştı diyor beton kırılmıyor çok sert hemde çok fazla demir var diyor aynı işi Türkiye'de alsam 1 haftada bitirirdim dedi.Yaşananlardan bende çok etkilendim üzüldüm inanın haberlere bakamaz oldum korkutucu bir manzara umarım kısa zamanda çok kişiye ulaşılır. Yaşananlardan ders alalım eninde sonunda bu depremler yine olacak...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "50promil",
      "created_time": "February 07, 2023, 12:18:33 PM",
      "body": "şimdi burada bir şeyler yazacaktım ama rte konuşma arasında ters şeyler yazıp siyaset yapanları takip ettiklerini zamanı gelince hesaplaşacaklarını söyleyince yazmaktan vaz geçtim. her ne kadar bu işin allah-kitap işi olmadığını bilsem de allah yardım etsin diyorum. zira bizim milletimiz böyle seviyor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "husdemba",
      "created_time": "February 07, 2023, 02:23:20 PM",
      "body": "Daha 2-3 sene önce Elazığ ve Malatya’da deprem oldu. Bu depremin ardından Malatya’da yapılan yeni ve lüks apartman da bu depremle birlikte çöktü. Yani daha yeni depremden çıkmış bir bölgede bile inşaat hakkıyla yapılmadı ve denetimsizliğin bedeline yine ödedik.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "totti67",
      "created_time": "February 07, 2023, 04:10:27 PM",
      "body": "Hatalı yapimin yenisi eskisi olmaz dostum maalesef. Bugün hatayli biz dostumla sohbet ediyorduk, 20 gün önce bir cenaze dolayısıyla memleketindeydi, satılık lüks binalar varmış tanesi 2 milyon üzerinde dairelerin tanesi, depremde tuz buz olmuş onu anlatti bana bugün. Ve de trajikomik olan, bu dairelerin ilanında depreme dayanıklı ifadesi geçiyormuş, ne diyelim, dayaniklisi bu ise vay memleketin haline...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jossque",
      "created_time": "February 07, 2023, 04:40:58 PM",
      "body": "Yıkılır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "February 07, 2023, 05:26:27 PMLast edit: February 07, 2023, 05:39:00 PM by Lachrymose",
      "body": "Bu evren, eğer bir yaratılışın ürünüyse mekanizmasında deprem diye bir şey varolmak zorunda değildi. Ama var, ve biz sonsuz geçmiş ve sonsuz gelecek arasındaki küçük bir zaman diliminde kimi zaman aciziyeti, kimi zaman hayal kırıklığını, kimi zaman yenilgiyi ruhumuzda dibine kadar hissediyoruz. Her şeye rağmen yaşam denen deneyim oldukça güzel ve bunun için teşekkür ediyorum, bu güzelliğin kısa süreli olduğunun bilincinde olarak hayatı anlık yaşamalı ve bir gün öleceğimiz gerçeğine göre, dolu dolu yaşamalıyız. Bu hayattan max verip alıp, yapmak istediğimiz her şeyi yapıp, istediklerimizi tecrübe edip, özgür bir şekilde, iyi ve keyifli zamanlar geçirip eğer şanslıysak 70 yaşında pişmanlıklarla dolu olmayan bi hayat yaşayarak ölmeliyiz.Biz öldüğümüzde kimi bunu siyaset malzemesi haline getirecek, kimi televizyona çıkıp ruhsuz, kindar, çirkin, leş ve deccalimsi bi surat ifadesiyle bize tepeden bakacak. Ama ölen öldüğüyle kalacak. Göçük altında ya da değil, belki kafanda bi kurşunla, belki araba kazasında ya da dümdüz ecelinle; öleceksin kardeşim. Seni hatırlayan son insan öldüğünde de hiç varolmamış olacaksın. Ne şanslıyız ki şu an yaşıyoruz. Ve mümkünse bu depremde ölenler için de, savaşlarda kendini fena edenler için de, dün varolup bugün varolmayanlar için de bu hayatı yaşamalıyız. Özgür ve mutlu olmalıyız. Bu hatalardan ders çıkarmalıyız. Artık ilerlemeliyiz. Yapıları ona göre yapmalıyız. Yapmayana cezasını halk olarak kesmeliyiz ve her şeye rağmen bu hayatı yaşamalıyız .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vonutage",
      "created_time": "February 07, 2023, 06:17:47 PM",
      "body": "Bu konuda içinde bulunduğumuz durum vehametiyle sağlıklı düşünmenin zor olduğunu düşünerek başlıyorum yazmaya.Bugün konuşmalarını dinledikçe hoşuma giden NTV'de yayın yapan bir Jeolog prof kadının konuşmasını dinledim.Özetle konu büyük depremlerin yaşandığı Kore örneğiyle gitti. Büyük Kore (Kobe) depreminden sonra çalışma yapmak için 9 ay orada yaşamış. Hanımefendi konuya Hatay ve Kore örneği üzerinden gitti.Orada şunu anlattı özet olarak. Kore'deki deprem bölgeleri de Hatay (Amik ovası ve çevresi) bölgesi de benzer özelliklere sahip. \"Basen\" denilen jeolojik yapı nedeni ile yaşanan fay kırılması (deprem) sonrası, kırılma durup tektonik hareket olmasa bile, bu basen bölgelerinde yer sallanmaya devam ediyor dedi. Bu arada bu basen bölgelerin fayda yaşanan kırılmalar sonucu yer değiştirebildiğini de ekledi. Yani bugün Hatay merkez basen bölgesi iken, deprem sonrası o 10-20km kayabilir dedi. Binaların büyük oranda yıkılma sebepleri de dünyada benzeri zor görülen 2 adet yıkıcı derecede depremin yarım günden kısa süreden sonra yaşanması olabilir(!) dedi. Olabilir çünkü incelenmesi gerekir diyor. Yani aslında sadece yapıların sağlıklı yapılması yeterli olmayabilir diyor. Bunu da şöyle noktaladı OP mesaj sahibi teramit üstadın dediği gibi; bu yapıların tamamı deprem yönetmeliğine uygun dahi olsa yıkılabilirdi.Kore konusu da şöyle: Kore deprem coğrafyasında olduğunun farkında bir ülke olarak o büyük depremin ardından yapılaşmada ahşap-çelik yapı anlayışına geçiyor. Özellikle yukarda bahsettiğim basen bölgelerde çelik yapı dışına ve 2 kattan fazla yapılaşmaya izin verilmediği, jeolojik yapının yetkililer tarafından düzenli (yıl içinde bütün ülke birden fazla kez) taranarak bu basen bölgelerin takibinin yapıldığı ve eğer basen bölgenin kayma sonucu uygun olmayan yapıların olduğu bölgelere kayması durumunda da oturum ruhsatlarının alınarak, evlerin boşaltılmasını ve tamamen devlet desteği ile uygun bir yere taşınmasının sağlandığını anlattı.Yıl 2023...Bizde DASK adı altında devlet tarafından organize edilmiş bir zorunlu sigortalılık olayı var.Prim ve sigorta tavanı 153.000TL olan bir sigorta. Yani evi yıkılana maks. 150k para ödemesi yapan. Hayat devam ediyor, ama anladığım net olarak şu ki, bizim ülkemizde dikey değil, yatay yapılaşmayı yaygınlaştırmamız lazım. Dikey olanı beceremiyoruz belli ki...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Phoenix Anka",
      "created_time": "February 07, 2023, 06:41:22 PM",
      "body": "Quote from: husdemba on February 07, 2023, 02:23:20 PMDaha 2-3 sene önce Elazığ ve Malatya’da deprem oldu. Bu depremin ardından Malatya’da yapılan yeni ve lüks apartman da bu depremle birlikte çöktü. Yani daha yeni depremden çıkmış bir bölgede bile inşaat hakkıyla yapılmadı ve denetimsizliğin bedeline yine ödedik.Denetimsizlik yüzünden canlar gidiyor da bakın sosyal medyaya hala Adana’da çatlak binaları sıvalar ile onarmaya çalışan insafsız müteahhit dolu etraf. İnşaat halindeki bina her yerden çatlamış ve işçi sıfır güvenlikle sıvamaya çalışıyor bir deprem olsa adam olduğu gibi aşağı düşecek. Ekmek parası uğruna bir şey de diyemiyorlar. Keşke bunlar yakalansa da sorumlular hesap verse…",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eightdots",
      "created_time": "February 07, 2023, 07:33:44 PM",
      "body": "Quote from: Phoenix Anka on February 07, 2023, 06:41:22 PMQuote from: husdemba on February 07, 2023, 02:23:20 PMDaha 2-3 sene önce Elazığ ve Malatya’da deprem oldu. Bu depremin ardından Malatya’da yapılan yeni ve lüks apartman da bu depremle birlikte çöktü. Yani daha yeni depremden çıkmış bir bölgede bile inşaat hakkıyla yapılmadı ve denetimsizliğin bedeline yine ödedik.Denetimsizlik yüzünden canlar gidiyor da bakın sosyal medyaya hala Adana’da çatlak binaları sıvalar ile onarmaya çalışan insafsız müteahhit dolu etraf. İnşaat halindeki bina her yerden çatlamış ve işçi sıfır güvenlikle sıvamaya çalışıyor bir deprem olsa adam olduğu gibi aşağı düşecek. Ekmek parası uğruna bir şey de diyemiyorlar. Keşke bunlar yakalansa da sorumlular hesap verse…Eksiğimiz buradan başlıyor. Yani demek istediğim şey herkes işini doğru yapsa can kaybı bu kadar olur muydu. Söylenecek o kadar çok şey var o kadar çok detay var ki işin özü dönüp dolaşıp eksik denetimlerin, yanlış yapılaşmanın, uzmanları dinlememenin sonucunu gösteriyor.Dün Yer Bilimci Prof. Dr. Celal Şengör'ü dinledim bugün de Prof. Dr. Naci Görür'ü dinledim. O kadar çok yapılmayan eksik şeylerimiz var ki. Dedikleri; depremin zamanını bilemeyiz ama önlemi alabiliriz de hemfikir oluyorlar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "February 07, 2023, 07:36:00 PM",
      "body": "Quote from: eightdots on February 07, 2023, 07:33:44 PMQuote from: Phoenix Anka on February 07, 2023, 06:41:22 PMQuote from: husdemba on February 07, 2023, 02:23:20 PMDaha 2-3 sene önce Elazığ ve Malatya’da deprem oldu. Bu depremin ardından Malatya’da yapılan yeni ve lüks apartman da bu depremle birlikte çöktü. Yani daha yeni depremden çıkmış bir bölgede bile inşaat hakkıyla yapılmadı ve denetimsizliğin bedeline yine ödedik.Denetimsizlik yüzünden canlar gidiyor da bakın sosyal medyaya hala Adana’da çatlak binaları sıvalar ile onarmaya çalışan insafsız müteahhit dolu etraf. İnşaat halindeki bina her yerden çatlamış ve işçi sıfır güvenlikle sıvamaya çalışıyor bir deprem olsa adam olduğu gibi aşağı düşecek. Ekmek parası uğruna bir şey de diyemiyorlar. Keşke bunlar yakalansa da sorumlular hesap verse…Eksiğimiz buradan başlıyor. Yani demek istediğim şey herkes işini doğru yapsa can kaybı bu kadar olur muydu. Söylenecek o kadar çok şey var o kadar çok detay var ki işin özü dönüp dolaşıp eksik denetimlerin, yanlış yapılaşmanın, uzmanları dinlememenin sonucunu gösteriyor.Dün Yer Bilimci Prof. Dr. Celal Şengör'ü dinledim bugün de Prof. Dr. Naci Görür'ü dinledim. O kadar çok yapılmayan eksik şeylerimiz var ki. Dedikleri; depremin zamanını bilemeyiz ama önlemi alabiliriz de hemfikir oluyorlar.Özellikle Naci görür bu uyarıları defalarca yapmıştı, kendisinin Maraşlı olduğunu duymuştum belki doğru belki değil bilmiyorum, önemli olan uyarıları ve profesörün bu uyarılarını takmayan birileri, sonuç ise gördüğümüz gibi, kan emici müteahhitleri denetlemek lazım, beton yığınına 10 milyon lira isterken iyi, o bina 1 yıl sonra çökünce müteahhit hemen kaçar, yazıklar olsun bu insanlara, o paraya deprem projesi bile yapmamışlar adiler,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "trendcoin",
      "created_time": "February 08, 2023, 04:54:52 AM",
      "body": "şuna itiraz etmişler ama anlamadım: https://twitter.com/cylnnur345/status/1622983039973220357yani, elbette ilgili devlet birimi hasar tespiti yaptıktan sonra çatlakların sıvanması/kapatılması gerekirdi. bu arkadaşlar büyük ihtimalle yangından mal kaçırıyor ama iki tane 7,5 üzeri deprem atlatmış binanın kendisi ve kolonları sağlam kalmış ise ve yalnızca cephe ya da bölümleri ayıran duvarları çatlamış ise; bence o bina testi bir miktar geçmiştir... duvarı çatlamış olanı satın almak içime pek sinmese de -ihtiyaç halinde- aynı şirketin yan taraftaki bloklarında bulunan dairelerinden birine talip olmayı düşünebilirdim (param olsaydı).ben yüksek katlı bir binada oturmuyorum, muhtemelen de şu saatten sonra mecbur kalmadıkça böyle bir şey yapmamaya çalışacağım (eğer unutmazsam, genelde üç gün sonra unutuyoruz maalesef).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "February 08, 2023, 08:54:32 AM",
      "body": "o ahlaksız diye nitelendirdiğimiz gavurlar var ya işte onlar kadar olamadığımız için başımıza bu işler geliyor. zemini kötü olan yere izin veren, yapılan çürük binaya izin veren kişilerin sözlükte bir karşılığı yok. kamuda bu işin denetimi ile ilgili kim varsa o adamların maaşının yüksek olması gerekir. işin içine insan faktörü girince her şey bitiyor. bir de buna siyasiler eklenince ohh mis. olan yine sana bana oluyor amk. istanbul'un taa anasının amında olan yere 1,5-2 milyon lira para isteniyor. kira desen 10 bin liranın altına bulamıyorsun. yazacak çok şey var ama neye yarıyor yazmamız?! bu ülkede hiçbir siyasinin sikinde değiliz bunu anlayın. sik kırığı olmayın amk iki dakika!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teramit",
      "created_time": "February 08, 2023, 09:55:00 PMLast edit: February 08, 2023, 10:53:16 PM by teramit",
      "body": "Quote from: husdemba on February 07, 2023, 02:23:20 PM Bu depremin ardından Malatya’da yapılan yeni ve lüks apartman da bu depremle birlikte çöktü. Yani daha yeni depremden çıkmış bir bölgede bile inşaat hakkıyla yapılmadı ve denetimsizliğin bedeline yine ödedik.https://teyit.org/analiz-malatyada-3-yillik-trend-garden-residence-isimli-yeni-binanin-yikildigi-iddiasibundan bahsediyorsun herhalde.Bu depremde yıkılan yeni bina görmedim ben, varsa bilen linkini atsın inceleyelim.Quote from: totti67 on February 07, 2023, 04:10:27 PMHatalı yapimin yenisi eskisi olmaz dostum maalesef. Bugün hatayli biz dostumla sohbet ediyorduk, 20 gün önce bir cenaze dolayısıyla memleketindeydi, satılık lüks binalar varmış tanesi 2 milyon üzerinde dairelerin tanesi, depremde tuz buz olmuş onu anlatti bana bugün. Ve de trajikomik olan, bu dairelerin ilanında depreme dayanıklı ifadesi geçiyormuş, ne diyelim, dayaniklisi bu ise vay memleketin haline...bir binanın depreme dayanıklı olduğunu emlakçıya, arabanın sağlam olup olmadığını alacağın galericiye, sebzenin iyi olup olmadığını alacağın manava sormazsın.Bizde hep sorulmaması gereken adama soruluyor bunlar. arabayı ekspere sormalısınız (onlarda yalan ama neyse). daireyi de ruhsat tarihine bakın 2006 yı geçiyorsa yeni binadır otomatik yeni depremlere dayanıklı olması gerekir, ama mak 7.5 tur hesaplanan.Yine süpheleniyorsanız binadan bir expere sormalısınız, sahibindendeki ilana bakıp bina yeniymiş diyor insanlar. dairelerin ruhsat veya iskanında bina yaşını öğrenmeniz mümkün, araç ruhsatı gibi gerekli bilgiler bulunacaktır , satın alınacak kişiden bu belgeler istenmeli belediye den teyit edilmelidir.Quote from: ZekiBeyy on February 07, 2023, 09:01:22 AMSalih Gün tehlikenin farkındaydı 3 kattan fazlası için imar izni kesinlikle vermedi, meclis üyelerine, kendi akrabalarına hatta basasına bile izin vermedi.Yapının sağlamlığıyla yükek katlı olmasının alakası yoktur, hatta yüksek katlı binalar depreme frekans farkı yüzünden daha dayanıklı olurlar.3-4 kat yüksekliği kritiktir, ülkemizde en çok bu kat yüksekliği depremden etkilenir, çünkü genel deprem frekansı bu kat yüksekliğiyle rezonansa girer en çok enerji bu binalara aktarılır ve deprem uzun sürerse en çok bunlar yıkılır.3 kattan fazlasına izin vermemenin başka sebepleri var bunlar depremle alakalı konular değil, girmiyorum.Quote from: ajanwalker on February 06, 2023, 10:46:58 PMDeprem konusunda uzman ( adını hatırlayamadım) bu depremin 350 atom bombası gücünde olduğundan bahsetti. bir uzmanın rakam verirken şu kadar amiyane tabir kullanması anlayamıyorum. Ne demek 350 atom bombası ?, 350 hiroşima mı 350 tsar mı, ikiside atom bombası 350 hiroşima 350 x 15 KT = 5250 KT (5,2 megaton) , 350 tsar = 350 x 50000 KT =  17500000 KT , (17500 megaton)5,2 nere 17bin 500 nere ! ,bari uzmanı rakamı anlaşılır versin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teramit",
      "created_time": "February 08, 2023, 10:09:56 PM",
      "body": "Quote from: yenerbatmaz on February 07, 2023, 01:08:58 AMHerhalde yine siyasi endişeyle açılmış kötü niyetli başlıklardan, cehaletle açılmış ise hemen bilgilendirelim:Japon Deprem yönetmeliklerine dair bilgiler https://japanpropertycentral.com/real-estate-faq/earthquake-building-codes-in-japan/,minimum seviye kabul edilen \"Taishin\" bile 7 ve üzeri depremde yıkılmayacak özellikler içeriyor, ayrıntıları inşaat mühendisleriyle konuşarak teyit edebilirsiniz, 7-8 büyüklüğünde depreme dayanaklı bina yapmak kesinlikle mümkün, fay hattında yer alan ülkelere tavsiye edilen minimum teknoloji bunu dikte ediyor. siyasi endişe derken neyi kastederek saçmaladınız bilemedik, ülkemizde yeni binalar için hesaplanan deprem şiddetinin üzerinde bir deprem geçirdik. 99 depreminde de öyle olmuştu deprem bölgelerini artırdılar buna göre, şimdide artırabilirler bilemeyiz.cehalet derken ,kendi okuma özrünüzden bahsediyor olmasınız başka ülkelerin kendi depremlerine göre yönetmelik hazırladığını belirtmişim onu kaçırdıysanız bunu da kaçırabilirsiniz.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}