{
  "id": "topic_5470724",
  "title": "LucyFurr",
  "author": "LucyFurr",
  "created_time": "October 17, 2023, 07:41:24 PM",
  "content": "Hey guys, I thought sharing your ways of converting BTC to INR or vice versa may be helpful for other users from our community because every exchange and trading platform has a different fee structure so this may help to identify the best and cheapest option to convert our cryptos to Rupees.I am using Wazirx for converting my BTC to INR because the price on that platform is always 3-4% above the market price (I mean from corimarketcap price) so we can get better deals compared to other exchanges but 1% TDS will be deducted along with trading fee once the trade order executed, then we also have to pay a withdrawal fee of RS.10 for NEFT and 25 for IMPS.The normal trading fee is 0.4% but if you are holding WRX tokens then you will get discounts accordingly.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470724",
  "comments": [
    {
      "author": "SaShiRaJaVu",
      "created_time": "October 17, 2023, 08:25:46 PM",
      "body": "It would be great, if there is a comparison of different exchanges we can use and their fees. Stopped using Wazirx after the raid from ED, bet they will be sending all user information to government authorities and make sure you pay all the taxes.Still using Binance P2P as it is highly unlikely they will be sending information unless requested by the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "October 18, 2023, 03:30:06 AM",
      "body": "I use colodax, I'm already using it for couple years and it's working fine. Although, rates I get are quite fked up at times, but I find it convinient and trusted from what I've experienced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitnote",
      "created_time": "October 18, 2023, 08:09:57 AM",
      "body": "The most efficient approach to exchange BTC or other cryptocurrencies for INR is through the P2P method on reputable cryptocurrency exchanges. This method allows me to convert my crypto into fiat currency without charging any fees.I typically allocate my funds into cryptocurrencies that I don't intend to use for my day-to-day expenses, which is why I don't frequently convert crypto to INR. However, should the need arise, I would opt for the P2P method since it's fee-free on numerous exchanges, and it offers flexibility in terms of payment methods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin Smith",
      "created_time": "October 18, 2023, 03:25:46 PM",
      "body": "I used Binance and Localbitcoins website in the past, but now I'm only using Paxful for converting especially BTC to INR on rare occasions. And 1% trading fees on Paxful but it doesn't hurt much as long as I can find trusted traders with no TDS deduction, so literally I am paying zero fee for converting BTC to INR, but you should be very careful on Paxful where lot of new accounts offer 10-40% over market price but if you receive funds from their account then next day you will get a call from bank says that you received money from hacked bank account.Choose trusted trade partners only, if you choose p2p mode trade and never compromise on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "October 18, 2023, 04:26:22 PM",
      "body": "Stop converting your Bitcoins to INR, if you don't understand the value of Bitcoin then you are a shit asking such a question. Bitcoin is more valuable than INR, if it wasn't then you would have been hiding behind a cave. You came here for what to know what?. Being a low rank member you should encourage a point for adopting Bitcoin, whereas you are talking how to get the most from Bitcoin for INR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 18, 2023, 04:48:40 PM",
      "body": "Quote from: elevates on October 18, 2023, 04:26:22 PM-snip- Cool down there fellow mate. I am sure the intention of the OP was to make a thread for those who might be in need of such a topic and not promote the idea that bitcoins should be sold away for INR. Someone may have coins at hand and need to spend them for emergency because they did not bother to keep funds separate for that mater.Anyway, OP should comment on what the tax situation for such transactions have been. That 30% is a big number out there.One method to avoid all these problems is through giftcards. But I never made a head to head comparison of fees spent on exchanges and on giftcards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "October 19, 2023, 03:31:02 AM",
      "body": "Quote from: TheUltraElite on October 18, 2023, 04:48:40 PMOne method to avoid all these problems is through giftcards. But I never made a head to head comparison of fees spent on exchanges and on giftcards.Gift cards have limits. You can’t buy them for a lot of money, so you can’t get a large gift card. Selling gift cards can also be difficult.Most platforms charge a fee, usually around 5% of a gift card’s value. This makes selling gift cards less profitable when you’re looking to cash in on them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 19, 2023, 04:49:36 PM",
      "body": "Quote from: cafter on October 19, 2023, 03:31:02 AMGift cards have limits. You can’t buy them for a lot of money, so you can’t get a large gift card. Selling gift cards can also be difficult.Most platforms charge a fee, usually around 5% of a gift card’s value. This makes selling gift cards less profitable when you’re looking to cash in on them. I have been using them on a single merchant at a limited value per month. For that purpose I think this is a good option. Monthly I top up the account and then buy it whenever they are in stock.Also I dont sell them but use them only for my person use so I did not face any drawback in this case. You could say that one problem is that stocks get cleaned up very quickly though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "October 20, 2023, 05:58:49 AM",
      "body": "Quote from: TheUltraElite on October 19, 2023, 04:49:36 PMI have been using them on a single merchant at a limited value per month. For that purpose I think this is a good option. Monthly I top up the account and then buy it whenever they are in stock.Also I dont sell them but use them only for my person use so I did not face any drawback in this case. You could say that one problem is that stocks get cleaned up very quickly though.Where do you buy your GCs that they get out of stock? Or am I misunderstanding?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 20, 2023, 06:30:54 PM",
      "body": "Honestly I have stopped converting my cryptos to fiat completely. I am just not ready to pay 30% taxes. It's just too much and doesn't make any sense at all. I still miss LBC exchange. They were doing great so not really sure why they had decided to close the business. I would never prefer to use any Indian exchange unless I have a sheer emergency. India needs a proper framework on crypto taxation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 21, 2023, 06:43:06 AM",
      "body": "Quote from: libert19 on October 20, 2023, 05:58:49 AMWhere do you buy your GCs that they get out of stock? Or am I misunderstanding?  The grocery chain I that I buy my stuff from, I buy their gift card which comes in predermined amounts on Bitrefill, and then I redeem them on the grocery site. However the gift card \"availability\" also varies and often they are unable to provide my with giftcards with reasons \"out of stock\". Then I just wait it out, top up my bitrefill account and set up an email notification to notify me once those card are \"back in stock\".But such incidents have reduced in frequency recently.I hope that clears your confusion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "October 21, 2023, 07:11:49 AM",
      "body": "Quote from: elevates on October 18, 2023, 04:26:22 PMStop converting your Bitcoins to INR, if you don't understand the value of Bitcoin then you are a shit asking such a question. Bitcoin is more valuable than INR, if it wasn't then you would have been hiding behind a cave. You came here for what to know what?. Being a low rank member you should encourage a point for adopting Bitcoin, whereas you are talking how to get the most from Bitcoin for INR. Everyone has the right to speak whatever they want. You shouldn't verbally abuse anyone for sharing information and OP is just sharing what he knows.Besides that, one shouldn't keep holding an asset forever because if you don't take profits or use your coins for something then your coins are as good as zero.The point is that if your bitcoins stay in your wallet for like forever then they are of zero value. Encouraging bitcoin adoption is a good thing as you say it yourself but when you come to think of it, you will have to use your bitcoins for making payments and exchange to other assets.So exploring options to do it isn't a bad idea but holding bitcoins forever is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erikalui",
      "created_time": "October 21, 2023, 08:24:00 AM",
      "body": "I still trust Unocoin only as it's easy for me and have been using it since 6 years. The fee is not an issue but I wish there are more exchange websites for Indians to spend BTC directly instead of converting it. I purchased gift cards earlier from Bitrefill but it was damn expensive (almost 800 in fees) and not worth the price I paid for it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LucyFurr",
      "created_time": "October 21, 2023, 09:42:35 AM",
      "body": "Quote from: elevates on October 18, 2023, 04:26:22 PMStop converting your Bitcoins to INR, if you don't understand the value of Bitcoin then you are a shit asking such a question. Bitcoin is more valuable than INR, if it wasn't then you would have been hiding behind a cave. You came here for what to know what?. Being a low rank member you should encourage a point for adopting Bitcoin, whereas you are talking how to get the most from Bitcoin for INR. The purpose of this thread is to find an efficient way to convert BTC to INR and eventually, at some point, we convert them for some reasons. I do know that bitcoin is highly valuable and I am not suggesting anyone sell their BTC for INR however I asked them to share their way of conversion so that others can find the information can be valuable.@SaShiRaJaVu, I used wazirx exchange multiple times and everytime the trades went smooth but yeah every exchange operating under India probably sending the reports to tax officials.@libert19, Never knew the existence of exchange thanks for sharing it, I will check it too.@bitnote, Please share the name of those p2p platforms which has zero fee, cause exchange without trading fee seems too good to be true.@Bitcoin Smith, Thanks for sharing it, but the only reason I am not using p2p platforms is due to the existence of fraudsters.@TheUltraElite, 30% tax rate is one the capital gains and only applicable if we cross the income tax slab but as far as I know I didn't convert that much apart from a few thousand once in a few months.@cafter, Gift card comes with lot of hidden fees though but I never used it and I feel its better to use debit cards instead of prepaid card.@avikz, Good to know that you are being a HODLer. @pawanjain, Bitcoin is money too and the purpose of money is to be spent for our needs so if someone is not willing to spend their money even if its indeed then it doesn't sound like a wise choice.@erikalui, haven't heard this exchange too and this is why I created it to know how fellow community members are trading. As I said gift cards comes with fees 800 seems to be a lot if someone is only converting a small amount so I guess its not really a suitable way of converting BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pakhitheboss",
      "created_time": "October 24, 2023, 04:18:14 AM",
      "body": "Before the Indian government had implemented tax on crypto gains I was using three exchanges for multiple reasons. Some of them had the pair that I wanted to trade some of them had less fee or zero fee for INR withdrawals and some of them provided higher conversion rates. After the tax laws came into effect I stopped using all three and shifted to an International exchange that provided P2P services but did not ask for KYC. I am still using that exchange and recently I found out about P2PX exchange. I am planning to shift my base from the existing International exchange to it or might use both as per my requirement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "October 24, 2023, 05:06:43 AM",
      "body": "Quote from: LucyFurr on October 21, 2023, 09:42:35 AMQuote from: elevates on October 18, 2023, 04:26:22 PMStop converting your Bitcoins to INR, if you don't understand the value of Bitcoin then you are a shit asking such a question. Bitcoin is more valuable than INR, if it wasn't then you would have been hiding behind a cave. You came here for what to know what?. Being a low rank member you should encourage a point for adopting Bitcoin, whereas you are talking how to get the most from Bitcoin for INR. The purpose of this thread is to find an efficient way to convert BTC to INR and eventually, at some point, we convert them for some reasons. I do know that bitcoin is highly valuable and I am not suggesting anyone sell their BTC for INR however I asked them to share their way of conversion so that others can find the information can be valuable.I generally do not convert my BTC to INR unless I am short of cash. Today you can clearly see that Bitcoin pumped more than 13 percent because of some positive news. This is how Bitcoin holders get benefits in the long term. I have only used WazirX a few times and that is the only exchange I plan to use in the future if the need to sell my Bitcoin arises. I haven't tried any International exchanges and do not plan to use it in the future as most now want their users to pass KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "October 24, 2023, 05:40:35 AM",
      "body": "Quote from: pakhitheboss on October 24, 2023, 04:18:14 AMI am planning to shift my base from the existing International exchange to it or might use both as per my requirement. KYC on the international exchanges is a complete skin-crawl moment as soon as you hear it. I have been watching as some of them are setting up bases in India too but eventually moving away in a short span of 2-3 years. This reduces the number of competitive exchanges on the field and allows the government to come up with shitty tax regimens.Maybe a lot of factors are involved here, that we are unable to fathom, but its better not to sell at this point if you fiat income is enough to cover your costs of daily. That 30% \"loss\" we can incur, could possibly change in future.Have been holding for long, why not a little longer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "October 25, 2023, 02:18:29 PM",
      "body": "I convert my cryptocurrencies, especially altcoins, into regular money using local exchanges. These local exchanges accept cryptocurrencies and help me get Indian Rupees (INR) through UPI or bank transfers.Just to be clear, these local exchanges are like smaller websites. Like a real human sends INR through his bank account.I also know different ways to change my cryptocurrencies into regular money as cheaply as possible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "October 26, 2023, 05:54:27 AM",
      "body": "Quote from: cafter on October 25, 2023, 02:18:29 PMI also know different ways to change my cryptocurrencies into regular money as cheaply as possible.Except buying gift cards, show your ways?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}