{
  "id": "topic_5418003",
  "title": "Ttelas",
  "author": "Ttelas",
  "created_time": "October 22, 2022, 03:59:08 PMLast edit: October 22, 2022, 05:17:42 PM by Ttelas",
  "content": "I saw this image on Facebook and I was moved that Nigeria leads the uses of Cryptocurrencies, bitcoin in particular in Africa. The number that is using bitcoin in Nigeria is more than the number that is stated in the image. I live in the city and I can see the people who are involved in btc. SourceTop 10 in Africa",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418003",
  "comments": [
    {
      "author": "Mr.right85",
      "created_time": "October 22, 2022, 06:52:59 PM",
      "body": "Quote from: Ttelas on October 22, 2022, 03:59:08 PMSourceTop 10 in AfricaI believe this comes without any exaggeration given the fact that, Nigerians have been at the forefront of cryptocurrency for some time. Its kind of am old nice though but, some worthy encouragement for those who leave in places where bitcoin or cryptocurrencies aren't encouraged. You can always have your thing going even in crypto ban areas. You just have to make use of the p2p system.I don't know if this is the best place to have this discussion but, I feel the bitcoin discussion board would be some place to move the thread to. I've quote your thread to make your picture look better, your welcome!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "October 22, 2022, 07:10:00 PM",
      "body": "13m is not bad though, although the average internet user inNigeria is 84m[1], so the percentage of crypto users out of this internet users is roughly 15%. But for a place like africa and Nigeria, that is a huge number to consider even though banks were banned[2] dealing with on cryptocurrency.[1] https://www.statista.com/statistics/183849/internet-users-nigeria/[2] https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/cryptocurrency-usage-soars-in-nigeria-despite-bank-ban-70497781",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 22, 2022, 07:17:11 PM",
      "body": "Nigeria is the most populous black nation and with a huge percentage of that amount being youths, with an inclination to technology, it's no surprise that it leads in Africa and is among the top nations on a global scale.I would expect more growth in the couple of years, considering how slow Bitcoin was to catch up with the Bitcoin trend when compared with other Western countries, it would likely grow higher in the global list with time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "October 22, 2022, 07:29:12 PM",
      "body": "Although I think the list line up is very much accurate but I still think the numbers of people that owns Crypto-currency in those countries was just from a rough estimate.I can vividly say the amount of people that owns crypto-currency in Nigeria regardless of the amount is far more than 13 million. In a country of over 200million and the most populated black nation Nigeria has hot boiling crypto-currency enthusiast that it's fast reaching out to people of illiterate background, old age , some aspect of online shopping.It's time to start taking crypto-currency more seriously if you haven't yet. Those numbers on the list is set to multiply vigorously soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "October 22, 2022, 08:07:56 PM",
      "body": "This huge number of Bitcoin adoption in Nigeria is a pointer to one fact and that is, the level of technological adoption and awareness among the youths in Nigeria if you check very well youths make up for  89% - 90% of the number of cryptocurrency adoption in Nigeria. Even though the Central bank has tried to make a drawback among the bank interfering in cryptocurrency transaction but that have not limited Bitcoin adoption in Nigeria by any means. Nigeria represents a large number in cryptocurrency usage in Africa and as time goes on a lot of development will allow more free flow of Bitcoin transactions and adoption will open up and which will eventually trigger Bitcoin adoption by the central bank in the future giving the bank access to transact cryptocurrency related payments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "October 22, 2022, 08:53:06 PM",
      "body": "based on data from Finder, Nigeria is the second largest global cryptocurrency ownership in the world after India, it's really surprising to see how enthusiastic youth in nigeria are about cryptocurrencies.The Nigerian government has indeed issued a Nigerian digital currency (eNaira) that aims to suppress the growth of Nigerian youth who are interested in cryptocurrencies but it seems to be in vain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "October 23, 2022, 05:38:00 AM",
      "body": "Indeed, Nigerians are so into crypto and BTC but how accurate is this image of yours OP? No one knows, Nigeria consist of smart people and since the country is striving right now crypto seems like the smartest side hustle to look into, but honestly, I expect India and Venezuela to be so closer by.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "October 23, 2022, 06:06:33 AM",
      "body": "At some point, the margin was a slim one between Nigeria and Kenya. It's good to know that the gap has widened now. It's even this low because of anti-government perspective of cryptocurrency in the country. The ban and restriction of crypto use in Nigeria has continued to scare the lilly hearted among us from engaging in it, especially those who don't go through P2P. If it weren't so, the number of users would've been more than what is reported. CZ Binance was fast to discover the Nigeria market and tailored some of his services to suit his Nigerian users. No doubt, that too also helped grow the Binance brand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "October 23, 2022, 09:00:44 AM",
      "body": "From the stats, Nigeria has a lot of engagement in cryptocurrencies more than any country in the world. It’s nice to be recognized globally for a good thing. It’s ironic that the two countries with the largest ownership of crypto India and Nigeria are/were also the leading as some of the countries with highest poverty rate. I’m hoping the Nigeria government will one day realize the benefits in embracing cryptocurrency and blockchain technology in their electoral process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 23, 2022, 09:23:29 AM",
      "body": "Quote from: Mr.right85 on October 22, 2022, 06:52:59 PMI believe this comes without any exaggeration given the fact that, Nigerians have been at the forefront of cryptocurrency for some time. Its kind of am old nice though but, some worthy encouragement for those who leave in places where bitcoin or cryptocurrencies aren't encouraged. You can always have your thing going even in crypto ban areas. You just have to make use of the p2p system.Bitcoin and other cryptocurrencies are not banned in Nigeria. What only happened was that the Central Bank of Nigeria banned bitcoin and other cryptocurrencies. Nigeria are led by three arms of government which are the arms that can be possible for bitcoin and other crypto to be banned and reduce adoption in the country. Crypto can be banned especially if the legislative arm of government make the proposal, approved by them and later signed by the president, but all these arms of government are mute about bitcoin. The CBN ban discouraged crypto organizations to be developed or become established in Nigeria but has nothing to do with individuals buying and selling bitcoin. The reason Nigerians are now using p2p.Quote from: Crypt0Gore on October 23, 2022, 05:38:00 AMIndeed, Nigerians are so into crypto and BTC but how accurate is this image of yours OP? No one knows, Nigeria consist of smart people and since the country is striving right now crypto seems like the smartest side hustle to look into, but honestly, I expect India and Venezuela to be so closer by. This is not about crypto adoption in the world, but about crypto adoption in Africa. To know more about the lastest Chainanalysis crypto adoption index 2022, you would find this helpful: Crypto adoption index 2022 - Chainanalysis",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 23, 2022, 09:45:34 AM",
      "body": "Quote from: Renampun on October 22, 2022, 08:53:06 PMbased on data from Finder, Nigeria is the second largest global cryptocurrency ownership in the world after India, it's really surprising to see how enthusiastic youth in nigeria are about cryptocurrencies.These numbers seem grossly exaggerated to me as I seriously doubt that almost 1/3 of Indians or 1/4 Nigerians own cryptocurrencies. I have no doubt that crypto is popular in developing countries as it helps unbanked people, but I think that all those sites are pulling the numbers out of their ass, or they do a survey on a small amount of people that results in the skewed picture like in that link/image you shared.  Quote from: Charles-Tim on October 23, 2022, 09:23:29 AMTo know more about the lastest Chainanalysis crypto adoption index 2022, you would find this helpful: Crypto adoption index 2022 - ChainanalysisTbh, this \"analysis\" doesn't look any more convincing and should be taken with a pinch of salt, to say the least.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 23, 2022, 10:24:20 AM",
      "body": "Quote from: Rikafip on October 23, 2022, 09:45:34 AMI have no doubt that crypto is popular in developing countries as it helps unbanked people, but I think that all those sites are pulling the numbers out of their ass, or they do a survey on a small amount of people that results in the skewed picture like in that link/image you shared.  I do not know of any developing countries, but in Nigeria, bitcoin and other crypto are having more adoption because of devaluation of Nigeria fiat currency, Naira and also because of their investment profitability. The fact is that those that are not having bank accounts here in Nigeria are not literate and they are people that can not make use of bitcoin and other crypto, many of them do not even have the kind of devices like computer and browsing phones or tab they can use for it.Quote from: Rikafip on October 23, 2022, 09:45:34 AMTbh, this \"analysis\" doesn't look any more convincing and should be taken with a pinch of salt, to say the least. I do not know much about the analysis. There can also be some inaccuracies in analyses. But just that Chainanalysis explained the methods used to arrive at the conclusion. You may read the methods used and do not agree with the chain analysis organization. In my opinion, I would have preferred the methods used to be in nominal value, but PPP was used, but which is accurate to some experts. The result would have been different and push the developed countries more on the top if nominal was used. Or at least, both nominal and PPP values analyses would have been better for individual to choose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 23, 2022, 10:33:19 AM",
      "body": "Quote from: Rikafip on October 23, 2022, 09:45:34 AMThese numbers seem grossly exaggerated to me as I seriously doubt that almost 1/3 of Indians or 1/4 Nigerians own cryptocurrencies. We have already proven countless times with examples that these are simply incorrect data, and @stompix has broken these claims to pieces several times. I think that these numbers are part of some kind of FOMO that is generated by local CEXs, or maybe even by global CEXs who want to attract as many clients as possible from countries such as India or Nigeria.Regardless of the real numbers, it seems to me that the percentage of those who actually invest in Bitcoin is even smaller compared to those who seek profit by investing in altcoins. I would like to see the percentage of crypto scams in those countries compared to the EU or the US, and somehow it seems to me that the Nigerian princes are living very well since Bitcoin appeared.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DdmrDdmr",
      "created_time": "October 23, 2022, 02:39:01 PM",
      "body": "I don’t have FB, so I can’t see the real source behind the source linked in the OP. Nevertheless, the data coincides in the top 5 cases with the numbers provided in this article (June 2022). This latter article indicates that the data comes from Triple A, and bears a link to the data source that is no longer valid (ends up here - the WayBackMachine does not help in this case). Another article from 2021 coincides in the value of some of the countries listed (those being African). My feeling is that the info does indeed come from Triple A, but is showing data that is now updated on their website, in relation to the data in the graph/link from the OP. Their current data takes Nigerian crypto holders, for example, to the 22,3M mark (13M on the graph shown in the OP).If we look at their methodology (at the bottom of the page, and pretty long):QuoteFor the latest TripleA Global Crypto Ownership data, TripleA utilized the following metrics: (i) Country Weighted Scoring, (ii) Global Weighted Scoring, (iii) Outlier Research and (iv) Primary Data Collection to obtain the most encompassing and accurate set of statistics in conjunction with the various data sources that we evaluate.i. Country Weighted ScoringOur ownership data is derived based on the report “The Chainalysis 2021 Geography of Cryptocurrency Report” in which each country is given a score based on 3 factors:(1) the country on-chain cryptocurrency value received,(2) the country on-chain retail value received, and(3) the Peer-to-Peer exchange trade volumeOur number of users per country estimations are based on Canada’s score and a recent Central Bank of Canada report, which estimates that 5% of the Canadian population own cryptocurrencies. In order to estimated for all the countries, we calculated the correlation between the Chainalysis score (=0.196) and the Central Bank ownership = 5% and then applied the same rationale to other countries’ scores.<…> I’d need to understand better the rationale behind the methodology, but I’ve got a strong feeling that the extrapolation method is leading to results that are probably way off...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RockBell",
      "created_time": "October 23, 2022, 08:13:34 PM",
      "body": "Quote from: Crypt0Gore on October 23, 2022, 05:38:00 AMIndeed, Nigerians are so into crypto and BTC but how accurate is this image of yours OP? No one knows, Nigeria consist of smart people and since the country is striving right now crypto seems like the smartest side hustle to look into, but honestly, I expect India and Venezuela to be so closer by. Smiles The statistics of people who invested in cryptocurrencies this year have increased significantly in Nigeria, and more are still willing to do more with awesomeness ongoing to give cryptocurrency a good shape in Nigeria since bi. Nigeria is really taking a new shape as the leading African nation in cryptocurrency, which is encouraging the government, which has failed its youths, and crypto have elevated many in Nigeria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Renampun",
      "created_time": "October 23, 2022, 09:18:48 PM",
      "body": "Quote from: Rikafip on October 23, 2022, 09:45:34 AMQuote from: Renampun on October 22, 2022, 08:53:06 PMbased on data from Finder, Nigeria is the second largest global cryptocurrency ownership in the world after India, it's really surprising to see how enthusiastic youth in nigeria are about cryptocurrencies.These numbers seem grossly exaggerated to me as I seriously doubt that almost 1/3 of Indians or 1/4 Nigerians own cryptocurrencies. I have no doubt that crypto is popular in developing countries as it helps unbanked people, but I think that all those sites are pulling the numbers out of their ass, or they do a survey on a small amount of people that results in the skewed picture like in that link/image you shared.  data is data, you don't have to think hard about it, I also live in a country far from Nigeria so I'm not sure if the data is correct but what I do know is that the Nigerian people are very enthusiastic about cryptocurrencies (based on that data).Many people in developing countries (including mine) wish to change their fate via cryptocurrencies, so it's no wonder why countries like India are leading the way, cryptocurrencies are changing the lives of many people in developing countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "October 23, 2022, 11:43:18 PM",
      "body": "Quote from: Renampun on October 22, 2022, 08:53:06 PMbased on data from Finder, Nigeria is the second largest global cryptocurrency ownership in the world after India, it's really surprising to see how enthusiastic youth in nigeria are about cryptocurrencies.The Nigerian government has indeed issued a Nigerian digital currency (eNaira) that aims to suppress the growth of Nigerian youth who are interested in cryptocurrencies but it seems to be in vain.The statistics provided in OP is centered on Africa and having one that covers the continents with Nigeria still coming off in a significant position is a thing of pride for all Nigerians. You guys are doing well and I wonder why shouldn't they!Nigeria is a great nation with so much opportunities but these opportunities have been chartered away by those in his places through corrupt practices. Making living very difficult for an average Nigerian. This makes Nigerians be on the constant Prawle for a means of escape and this is what they find in cryptocurrency.Cryptocurrency is freedom, freedom from government control and those who seek to escape the government would always utilise what they have in bitcoin. Its a need for an average Nigeria and they would continue to make there mark in the cryptocurrency industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Issa56",
      "created_time": "October 24, 2022, 02:23:38 AM",
      "body": "Quote from: Ttelas on October 22, 2022, 03:59:08 PM The number that is using bitcoin in Nigeria is more than the number that is stated in the image. We all know that their are lot's of people using bitcoin in Nigeria, Bitcoin have really saved youth in Nigeria, since the rate of unemployment in increasing daily in Nigeria, so most youth's now involves them selfs in Cryptocurrency just to make money. Central Bank of Nigeria has ban the use of cryptocurrency in Nigeria but youths don't still care, I think 13 million users is kind of much, nobody can get the actual figure but every one is just predicting. You claim that that the figure is wrong, I don't know if you can provide yours and how you did your survey. Quote from: Ttelas on October 22, 2022, 03:59:08 PMI live in the city and I can see the people who are involved in btc.We all know their are lot's of people that are involved in bitcoin in the city, but don't think is everyone that talks about bitcoin are really into bitcoin. Also have visited some rural areas and if I tell you that lot's of people haven't heard of bitcoin before, the places I visited just few people have heard about bitcon before and they don't even know what it's all about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "October 24, 2022, 02:33:02 AM",
      "body": "Quote from: Renampun on October 22, 2022, 08:53:06 PM-snip-Curious, last time I checked the government of India was actively persecuting and enforcing a legal ban on cryptocurrency of all sorts within the territory, I recall they even gave a deadline for people to liquidate their cryptocurrencies into FIAT, in order to avoid getting in trouble and yet the adoption (according to this source) is still pretty high, did I miss something these last months on this matter?Also, I have found Nigeria to be a quite peculiar country: High Bitcoin adoption, the Nigerian movie industry, the social and economical struggle of that country, etc.I doubt ENaira will end the adoption trend there, because in the end eNaira is only a new name to the same system that have defaulted the people of such African Nation, they won't get fooled so easily, I think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}