{
  "id": "topic_5510310",
  "title": "Outhue",
  "author": "Outhue",
  "created_time": "September 25, 2024, 12:22:11 PM",
  "content": "Let's say the truth, if I bought BTC in 2020 do you think I will still have it now? I need money and selling in 2021 won't have faded my mind. This is what my brother from another mother told me when we have a discussion about how he missed my call on buying Bitcoin in 2020 and to say the truth I give it a thought. The question goes out to all members on the forum, isn't it going to be hard for adopters who aren't rich to hold Bitcoin for years when they are lacking money? If you've bought 1 Bitcoin for $4000 in 2020 and it is ranging at $17k to $60k will you want to keep holding? If you are a teacher getting paid every month and you bought 5 BTC in 2018 and today you found out that it is insanely high will you keep holding it? Compare to someone who is already rich and have almost good things they wanted in life, who do you think will find no problem holding their Bitcoin? My final question is, all those Bitcoin whales with 50BTC or 100BTC, are they all rich even before they mine these BTC or bought these BTC? Are all whales rich? If they are not then the numbers of whales should have reduced a lot. Any bubble chart that shows BTC whales wallets like?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5510310",
  "comments": [
    {
      "author": "Pmalek",
      "created_time": "September 25, 2024, 12:47:49 PM",
      "body": "If selling your bitcoin can make your life easier from a financial point of view and you have no other means to come up with the money you need, then sell by all means. It doesn't do you any good holding it if it causes suffering. Losing your health, your home, or something/someone important to you versus selling your bitcoin and potentially preventing disaster should be an easy decision to make. With time and hard work, you can always acquire new bitcoin.My tip is, don't sell just for the purpose of selling and holding cash and fiat. Those paper notes will depreciate over time. History shows us that bitcoin appreciates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "September 25, 2024, 12:48:30 PM",
      "body": "Quote from: Outhue on September 25, 2024, 12:22:11 PMLet's say the truth, if I bought BTC in 2020 do you think I will still have it now? I need money and selling in 2021 won't have faded my mind. Life is reality, not if, and no chance to travel to the past.QuoteThis is what my brother from another mother told me when we have a discussion about how he missed my call on buying Bitcoin in 2020 and to say the truth I give it a thought. Many people only are fearful and regret later but they repeat it many times, and never join this market. They only can change themselves and if you already gave them advise, but they can not change themselves, you can not do anything more.QuoteMy final question is, all those Bitcoin whales with 50BTC or 100BTC, are they all rich even before they mine these BTC or bought these BTC?If they don't sell their bitcoins, they are not rich.QuoteAre all whales rich? If they are not then the numbers of whales should have reduced a lot. See the HODL wave and you can assume there are many whales from the past, either lost their bitcoin or still holding their bitcoins.https://www.bitcoinmagazinepro.com/charts/hodl-waves/QuoteAny bubble chart that shows BTC whales wallets like? I don't know bubble chart but I know rich list and some charts.https://bitinfocharts.com/top-100-richest-bitcoin-addresses.htmlWhale Shadows https://www.bitcoinmagazinepro.com/charts/whale-shadows/Addresses with balance > 1000, 10000 BTChttps://www.bitcoinmagazinepro.com/charts/addresses-greater-than-1000-btc/https://www.bitcoinmagazinepro.com/charts/addresses-greater-than-10000-btc/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "September 25, 2024, 01:27:05 PM",
      "body": "Quote from: Outhue on September 25, 2024, 12:22:11 PM~SnipThe question goes out to all members on the forum, isn't it going to be hard for adopters who aren't rich to hold Bitcoin for years when they are lacking money? If you've bought 1 Bitcoin for $4000 in 2020 and it is ranging at $17k to $60k will you want to keep holding? ~SnipIf seen from the perspective of someone who has no other income that can be used to meet their needs, I think selling Bitcoin could be the right choice. Because basically if someone wants to HODL bitcoin, of course all factors must be met properly. These factors, such as having a steady income every week or month and having a reserve fund or emergency fund to cover unexpected needs. So, if for example you already have these factors, then HODLing bitcoin for quite a long time can be done. However, if for example you don't have income flowing in every week or month and also don't have a reserve fund/emergency fund, I think it's certain that when you HODL bitcoin it definitely won't go smoothly. Because you can be sure that when there is an urgent need there is no other way out other than selling the bitcoin.Apart from that, Bitcoin investment basically doesn't always have to take a long time. Because in essence investing or HODLing Bitcoin has freedom. So, for example, if we HODL Bitcoin and then we have made a profit and want to sell the Bitcoin, in my opinion there is no harm in selling it, even though for example the HODL period is only one year. Because in essence HODLing or investing in bitcoin certainly depends on the abilities and desires of each investor. So whether you want short-term, medium-term or long-term HODL, you are free to choose whichever option you want and adjust it according to your own abilities. So basically don't push yourself too hard.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "September 25, 2024, 01:34:33 PM",
      "body": "Quote from: Outhue on September 25, 2024, 12:22:11 PMThe question goes out to all members on the forum, isn't it going to be hard for adopters who aren't rich to hold Bitcoin for years when they are lacking money? If you've bought 1 Bitcoin for $4000 in 2020 and it is ranging at $17k to $60k will you want to keep holding? If you are a teacher getting paid every month and you bought 5 BTC in 2018 and today you found out that it is insanely high will you keep holding it? Compare to someone who is already rich and have almost good things they wanted in life, who do you think will find no problem holding their Bitcoin? My final question is, all those Bitcoin whales with 50BTC or 100BTC, are they all rich even before they mine these BTC or bought these BTC? Are all whales rich? If they are not then the numbers of whales should have reduced a lot.  First of all, if someone is willing to invest on Bitcoin the person should think long-term, except the person is thinking of going into trading which is a short-term goal and is very risky compared to buying and holding Bitcoin for long-term. However there are some poor people who seized the opportunity to buy Bitcoin at a particular entry and made good profits for instance someone who bought at $4k and the price went up to 17k and further got to $60k, that's a very good profit and what i expect from such person is to take some money from their profits and diversify into a good business, maybe daily paying or weekly paying business thereby giving him or her a capital to continue buying and holding Bitcoin using the DCA method. Automatically that person has solved the problem of poverty and even got a steady income to continue investing on Bitcoin. Concerning the question of the teacher, Michael Saylor is very rich but yet his company keeps buying Bitcoin, so I'll continue investing on Bitcoin regardless of how rich I got through investing on it when the price was lesser. Well I won't say all whales where rich before they bought Bitcoin because some whales got rich cause they invested when the price was much more lesser and got rich after years of holding and price pumped while some are rich people who had enough capital to invest and saw the potential of Bitcoin hence they invested on it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "September 25, 2024, 03:00:17 PM",
      "body": "The main purpose of holding Bitcoin is to make as much profit as possible. If someone who bought Bitcoin at 4k dollars decides to sell when it's $60k, don't you think that person has made more profit than those who bought at $30k and have not still sold till now?Holding bitcoin is an investment and an investment is for making you more money with your already gotten money. If you have held long enough and gotten so much profit, there's nothing wrong in selling if you need the money for something because that is the whole idea of having the investment in the first place.  it's no secret that rich people find it easier to invest more than those who are not rich because they always have money to meet their needs and emergencies, but even the rich sell off their bitcoins when they have made huge profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Felicity_Tide",
      "created_time": "September 25, 2024, 03:23:46 PM",
      "body": "Quote from: Outhue on September 25, 2024, 12:22:11 PMLet's say the truth, if I bought BTC in 2020 do you think I will still have it now? I need money and selling in 2021 won't have faded my mind.It really depends on your financial status since 2020 till this very minute that we are talking about, and most importantly, the mindset you had back then in 2020 also determines if you would've still be holding or might have sold some/every thing along the line.QuoteThe question goes out to all members on the forum, isn't it going to be hard for adopters who aren't rich to hold Bitcoin for years when they are lacking money?I don't think every adopter needs to be rich before he/she can hodl for a long period of time. Like I pointed out in my first reply above, your financial status along the line matters alot. If you have something doing, let's say a good source of income, that has been providing for your personal needs and even funds for your Bitcoin investment, then I don't think it's going to be hard to hodl, most especially if your mindset from day one is to hodl for long, and you actually stick to that mindset of yours by being disciplined with your decisions.Quote If you've bought 1 Bitcoin for $4000 in 2020 and it is ranging at $17k to $60k will you want to keep holding? All still boils down to my financial status. If my job(source of income) is still very much intact, then I might still be holding, but if not, I might just sell. Surviving is more important.QuoteIf you are a teacher getting paid every month and you bought 5 BTC in 2018 and today you found out that it is insanely high will you keep holding it?Interesting question. But let me try to give a good answer from the current happenings in my country. You see, in my country, teachers are underpaid, so the salary difference between 2018 and 2024 isn't that massive, and inflation rate keeps increasing. So, seeing the constraints on ground, which is a problem to the financial status, I think I will definitely sell some, probably to start up a business or something.QuoteCompare to someone who is already rich and have almost good things they wanted in life, who do you think will find no problem holding their Bitcoin? It's not necessarily being rich. Just that their financial status is okay to some point where they can still afford basic needs while still holding a massive amount of Bitcoin. But when you compare them to those who don't really have something that provides for them, then it should be a difficult task for them to hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "September 25, 2024, 03:41:54 PM",
      "body": "Quote from: Outhue on September 25, 2024, 12:22:11 PMMy final question is, all those Bitcoin whales with 50BTC or 100BTC, are they all rich even before they mine these BTC or bought these BTC? Are all whales rich? If they are not then the numbers of whales should have reduced a lot. A fairly simple question and the easiest to answer by anyone and maybe you just need to use logic in calculating the numbers needed to buy the amount of bitcoin you mentioned. If people don't have money then it is impossible for them to collect that much bitcoin, so it can be concluded that people who have bitcoin ownership in that amount have become rich long before.Quote from: Outhue on September 25, 2024, 12:22:11 PMAny bubble chart that shows BTC whales wallets like? I don't really know the bubble that shows whale wallets but you can search for whales who have a lot of bitcoin on the internet. In fact, they are the most talked about people and in the context of some companies also store bitcoin as a step to maintain the value of the company's wealth that they have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 25, 2024, 03:44:30 PM",
      "body": "Quote from: UchihaSarada on September 25, 2024, 12:48:30 PMIf they don't sell their bitcoins, they are not rich. Why not? You are perhaps thinking only in terms of fiat values when you hear the term \"rich.\" You are rich if you own valuable art, real estate, vehicles, diamonds, gold, agricultural land, stocks, a drinkable water source, and bitcoin, of course. Any of these assets increase your wealth and you can sell them as long as there is a market willing to pay to purchase them from you. Quote from: Alpha Marine on September 25, 2024, 03:00:17 PMThe main purpose of holding Bitcoin is to make as much profit as possible. The investing part aside, bitcoin is freedom money. It allows you to use it in any way you want. Traditional digital money only works if the trusted custodian is ok with how you spend \"your\" money. It's not really yours if you must ask permission to spend it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "September 25, 2024, 04:45:18 PM",
      "body": "Quote from: Outhue on September 25, 2024, 12:22:11 PMLet's say the truth, if I bought BTC in 2020 do you think I will still have it now? I need money and selling in 2021 won't have faded my mind. This is what my brother from another mother told me when we have a discussion about how he missed my call on buying Bitcoin in 2020 and to say the truth I give it a thought. The question goes out to all members on the forum, isn't it going to be hard for adopters who aren't rich to hold Bitcoin for years when they are lacking money? If you've bought 1 Bitcoin for $4000 in 2020 and it is ranging at $17k to $60k will you want to keep holding? Holding Bitcoin will be difficult if you don't have emergency funds. You can't have Bitcoin and be dying of hunger or have medical bills to clear. If you have pressing needs, you will be forced to sell. QuoteIf you are a teacher getting paid every month and you bought 5 BTC in 2018 and today you found out that it is insanely high will you keep holding it? Compare to someone who is already rich and have almost good things they wanted in life, who do you think will find no problem holding their Bitcoin? If I am a teacher whose salary can take care of my needs and enough to have emergency funds, I will never sell coins. The rich have greater chances to keep their coin for a longer period, but it doesn't erase the fact that the poor can still hold it. Many rich people spend more than they earn; they might even sell their coins to pay hotel bills or buy a luxury car. QuoteMy final question is, all those Bitcoin whales with 50BTC or 100BTC, are they all rich even before they mine these BTC or bought these BTC? Are all whales rich? If they are not then the numbers of whales should have reduced a lot. Any bubble chart that shows BTC whales wallets like? Somebody who owns about 50BTC or 100BTC is already rich. But the answer to your questions will be better explained with statistics and it might be difficult to get the data about whales who mined or bought Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "September 25, 2024, 05:08:08 PM",
      "body": "I would say treat Bitcoins as an investment. I am sure many of us are investing in mutual funds. What happens in mutual funds is that we pay each month a fixed amount, and based on the market conditions, we get interest that is compounded annually. Similarly, I have also set a budget for Bitcoins. Like mutual funds, I also buy Bitcoins every month. I have set a target of 4x profit, and until and unless that is achieved, I will keep on buying the Bitcoins. In this manner, I won’t regret selling the coins and will hold them till the target is achieved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "September 25, 2024, 05:14:33 PM",
      "body": "You have asked very interesting questions! What is Bitcoin? Money? No, because one of the main functions of any money is a payment function. Money is used to buy goods, works and services. However, in most countries, Bitcoin cannot be used directly to pay for goods.... In my opinion, Bitcoin is a form of capital. Bitcoin is a deflationary asset, the value of which increases over time. Let me give you an example of other forms of capital - a bank deposit, shares, shares in a business, real estate intended for rent. Based on this definition, people who own Bitcoin are modern capitalists. They may have other sources of income (for example, hired work). These sources of income help them to hodl Bitcoin, which guarantees them greater profits in the future. In situations where they do not have enough money, they sell their Bitcoin and this leads to a decrease in their capital. From a financial point of view, this is a very bad situation, since a good financial strategy is that capital should grow over time, not decrease.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "September 25, 2024, 05:26:33 PM",
      "body": "Not all whales are rich. Those who were able to mine and hold a lot of it were too focused on the future and they believed in the potential of BTC. And with that, they're being rewarded for that patience that they have. I understand what you're trying to say that someone holds for so long but along the way needs to sell what he's got for some reason.It's okay, that's the purpose of investing so that we're able to profit and use it for the purpose that it's intended to be for the situations that we face.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "September 25, 2024, 08:31:51 PM",
      "body": "Quote from: Outhue on September 25, 2024, 12:22:11 PMThe question goes out to all members on the forum, isn't it going to be hard for adopters who aren't rich to hold Bitcoin for years when they are lacking money? If you've bought 1 Bitcoin for $4000 in 2020 and it is ranging at $17k to $60k will you want to keep holding? Jeez it’s not a crime to sell your bitcoins when you’re in profit. If you bought at 4k and your investment has given you 15x profit, it’s not unreasonable to sell your coins. Be honest with yourself, why are you hodling? Are you hodling in hopes that bitcoin will become a legal tender and you want to use it to pay for regular everyday transactions or do you plan on hodling until you die? Because every Bitcoin hodler has plans of selling their coins at a particular price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "September 25, 2024, 08:42:51 PM",
      "body": "QuoteThe question goes out to all members on the forum, isn't it going to be hard for adopters who aren't rich to hold Bitcoin for years when they are lacking money? If you've bought 1 Bitcoin for $4000 in 2020 and it is ranging at $17k to $60k will you want to keep holding? It is a no brainer, those who needed money will sell it, while those who wanted to take profit may also sell it.  It is a logical move to sell our Bitcoin holdings when we are in profit because we can never realize the profit if we don't sell.  The thing is, after selling at a higher price, we can always re-enter the market by repurchasing Bitcoin when it is in the bear market.  Bitcoin always have windows for re-enter especially during the price drop in its bear market.QuoteIf you are a teacher getting paid every month and you bought 5 BTC in 2018 and today you found out that it is insanely high will you keep holding it? Compare to someone who is already rich and have almost good things they wanted in life, who do you think will find no problem holding their Bitcoin? If the teacher has enough, I think both will have no problem holding BTC.  But I think it is ok to sell their BTC holdings during the peak if they know they can repurchase it when the Bitcoin enters the bear market.  They should not have any problem whether to hold or to sell because either way, Bitcoin price movement will always give them the opportunity to sell at a higher price and buy at a lower price.QuoteMy final question is, all those Bitcoin whales with 50BTC or 100BTC, are they all rich even before they mine these BTC or bought these BTC? Are all whales rich? If they are not then the numbers of whales should have reduced a lot. We do not know because we don't know their financial history, but saying a person as a whale is holding hundreds to thousands of BTC, we can consider them rich.  Btw, remember Bitcoin in its early days aren't worth $1  each so anyone could afford buy it whether they are rich or poor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mirakal",
      "created_time": "September 25, 2024, 08:52:36 PM",
      "body": "Regardless of the amount of bitcoin you are hodling, one thing is only certain, no one holds like there's no plan of selling, or like hodling it forever. Everyone has its own goal when to finally sell. And when you see the current price is highly profitable already, then sell. After all, where there is secured and impressive profits already, then sell immediately.Now on asking if all those whales who are hodling large amount of bitcoin are all rich, all I can say they only get rich in the process. A lot have started without nothing, but because they took an edge over the high potentials of bitcoin, and hold these coins without hesitation, maybe right at the moment they have establish their comfortable lives already and hodling bitcoin is just a piece of cake for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 25, 2024, 09:26:23 PM",
      "body": "Quote from: SatoPrincess on September 25, 2024, 08:31:51 PMJeez it’s not a crime to sell your bitcoins when you’re in profit. If you bought at 4k and your investment has given you 15x profit, it’s not unreasonable to sell your coins. Be honest with yourself, why are you hodling? Are you hodling in hopes that bitcoin will become a legal tender and you want to use it to pay for regular everyday transactions or do you plan on hodling until you die? Because every Bitcoin hodler has plans of selling their coins at a particular price. I think that many people have are actually getting this idea of holding bitcoin for a very long term wrong. I have read threads around and I have seen whenever someone talks of sell some members see it as something that is wrong but ideally selling off bitcoin is an essential part of holding that same bitcoin, the most important part of holding itself is actually having a selling plan, this might be in partials and not necessarily selling all, there is no specific rule of holding that Says one shouldn’t sell, the only excuse is selling at a loss other than that selling your coins is a good idea except if you’re holding a post retirement benefit. Let’s look at big investors like even Microstrategy they sell off at a high price and then buy back at a low price after they most have taking some profits. Imagine been in a position of buying at $4k and then selling at $60k yiu could still get more when the price drops after selling. If I was the one i would have sold at that $60k i mean some fractions and then still buy same quantity sold at $40k and then have some of the extra profit as my upkeep or channel it into other small scale businesses for a little diversification",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Miles2006",
      "created_time": "September 25, 2024, 09:38:05 PM",
      "body": "Quote from: SatoPrincess on September 25, 2024, 08:31:51 PMQuote from: Outhue on September 25, 2024, 12:22:11 PMThe question goes out to all members on the forum, isn't it going to be hard for adopters who aren't rich to hold Bitcoin for years when they are lacking money? If you've bought 1 Bitcoin for $4000 in 2020 and it is ranging at $17k to $60k will you want to keep holding? Jeez it’s not a crime to sell your bitcoins when you’re in profit. If you bought at 4k and your investment has given you 15x profit, it’s not unreasonable to sell your coins. Be honest with yourself, why are you hodling? Are you hodling in hopes that bitcoin will become a legal tender and you want to use it to pay for regular everyday transactions or do you plan on hodling until you die? Because every Bitcoin hodler has plans of selling their coins at a particular price. Buy and sell are two different thing needing different approach like it’s obvious if an investor have accumulated much and feel the need to sell it’s okay but what’s more important an investor should avoid selling in lose as seen most people don’t even know when to sell due to sudden life challenges. We can’t predict bitcoin price that’s the major reason investors anticipate the bullish period, the whole concept of selling can be misleading sometimes but op example is clear and simple whereby we buy during low price and sell with profit. If anyone refuse to sell i will assume the person is capable to hold beyond bitcoin circle and it’s fine seeing rich people holding their bitcoin till whenever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "September 25, 2024, 10:20:59 PM",
      "body": "Quote from: Outhue on September 25, 2024, 12:22:11 PMLet's say the truth, if I bought BTC in 2020 do you think I will still have it now? I need money and selling in 2021 won't have faded my mind. From 2020 till date is a long time and in this period, many things would have likely happened, some of which would have tempted someone who has plans to keep their bitcoin to change their plans. I do no see any problems with selling your bitcoin, do not just sell all that you are have with the intentions not to invest again, and do not sell too early. If you sold all the bitcoin you had some years ago,  you will be sad hearing others do well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "September 25, 2024, 10:42:11 PM",
      "body": "Quote from: Stepstowealth on September 25, 2024, 10:20:59 PMFrom 2020 till date is a long time and in this period, many things would have likely happened, some of which would have tempted someone who has plans to keep their bitcoin to change their plans. I do no see any problems with selling your bitcoin, do not just sell all that you are have with the intentions not to invest again, and do not sell too early. If you sold all the bitcoin you had some years ago,  you will be sad hearing others do well.2020 is enough time and also not enough time; it's enough time for someone to fix up something that can help them earn enough money to fix their life, but if there is an existing problem that could need the person to solve their problem and the only alternative option they have is their holdings, without even giving it a second thought, they should sell and solve their problems. Besides, those bitcoins are not meant to stay in that wallet as a doctoration but as an asset; it's not all situations that we will be thinking about selling half and keeping the rest; in some cases they might not even be enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}