{
  "id": "topic_5447756",
  "title": "cygan",
  "author": "cygan",
  "created_time": "April 06, 2023, 06:11:45 AMLast edit: May 10, 2023, 04:44:42 PM by cygan",
  "content": "Autor: GazetaBitcoinWątek oryginalny: Help Bitcoin help Ukraine!Dokładnie rok temu Putin najechał na Ukrainę -- 24 lutego 2022 roku. To smutna rocznica dla wszystkich Ukraińców, a także dla całej ludzkości.Moją uwagę zwrócił ostatnio artykuł z Bitcoin Magazine, polecony mi przez 1miau. Bitcoin Magazine jest świetnym źródłem wielu informacyjnych artykułów na temat Bitcoina, ale publikuje również ogromne spektrum filozoficznych i libertariańskich esejów.Ten artykuł jest długi, być może jeden z najdłuższych, jakie kiedykolwiek czytałem, ma prawie 14.000 słów. Przeczytanie go zajęło mi trochę czasu, ale na koniec jeszcze bardziej zachęcił mnie do wspierania sprawy Ukrainy. Artykuł opowiada o burzliwej przeszłości narodu ukraińskiego, jego zmaganiach z przeszłości, które trwają nawet w teraźniejszości. To, co było przyczyną tych zmagań, zmieniało się w czasie, ale ból pozostał ten sam.Jesteśmy również informowani o adopcji Bitcoina na Ukrainie, a narracja opowiada nam historie prawdziwych bohaterów wojennych lub historie ukraińskich bitcoinerów. Jedna historia przedstawiona w artykule jest naprawdę wzruszająca. Przedstawia nam Naumenko, zaangażowanego bitcoinera i bohatera:QuoteW 2018 roku Naumenko dostał szansę pracować z gigantami Bitcoina, takimi jak Greg Maxwell i Pieter Wuille, jako stażysta w Blockstream, ostatecznie współtworząc papier z Maxwellem i Wuille na temat proponowanego ulepszenia Bitcoina o nazwie Erlay, które mogłoby uczynić sieć bardziej wydajną i odporną. W 2021 i na początku 2022 roku praca Naumenko nad protokołem Bitcoin zbliżyła się do nowego kamienia milowego.Zaledwie kilka dni przed inwazją, Naumenko opublikował \"CoinPool\", nową implementację Bitcoina, która pozwoliłaby wielu użytkownikom dzielić się tym samym \"UTXO\" lub wydać kawałek Bitcoina. Jako uzupełnienie Lightning Network i coś, co mogłoby pomóc Bitcoinowi lepiej skalować i dodać prywatności, CoinPool był wynikiem lat pracy z kolegą deweloperem Antoine Riardem. Wydanie byłoby imponującym osiągnięciem w każdych okolicznościach, ale to był zdumiewający wyczyn naukowy z kraju na skraju wojny.24 lutego Naumenko został wyrwany ze snu przez brzęczący telefon. Jego przyjaciele gorączkowo wysyłali mu smsy: Inwazja miała miejsce. W swoim umyśle przypisał temu małe prawdopodobieństwo, ale tylko małe. Zaledwie 12 godzin wcześniej jechał swoim nowym elektrycznym skuterem do kawiarni, aby poczytać książkę. Pogoda była szara i przygnębiająca. Na ulicach nie było nikogo. Ogarnęło go dziwne uczucie. Dopiero gdy obudził się o 5:00 rano, zrozumiał, że nadeszła wojna. Wziął ze sobą plecak i pospieszył na pobliski przystanek metra, gdzie zszedł do schronu przeciwbombowego z czasów sowieckich, zbudowanego w celu przetrwania ataków nuklearnych.W bunkrze spędził trzy dni i dwie noce. Na początku, gdy wszedł do stacji metra, staruszka przy kołowrocie poprosiła go o założenie maski. Spojrzał na nią, zdumiony. COVID-19 się skończył, a zaczęła się wojna. Coraz więcej ludzi i rodzin z dziećmi dołączało do niego, przynosząc poduszki i jedzenie, przygotowując się do zamieszkania. Początkowy szok wojny zapędził tłumy pod ziemię, ale po kilku dniach, z konieczności, ludzie zaczęli wracać do swojego ziemskiego życia.Kiedy Naumenko w końcu opuścił schronisko, spotkał się z przyjaciółmi i postanowił wyjechać z miasta różowym BMW. Samochód był ostentacyjny, ale był jedynym dostępnym. Obawiali się, że ich przejażdżka może zwrócić zbyt dużą uwagę, ale i tak postanowili wykorzystać ją do przedostania się na zachód. Rosyjska armia była na przedmieściach pod Kijowem, zabijając cywilów, a oni słyszeli wymianę ognia. Czas był na wagę złota.Koledzy Naumenka zniknęli w Rumunii, ale on poprosił o podrzucenie go do ukraińskiego miasteczka tuż przed przekroczeniem granicy. Chciał zostać i pomóc.Wojska Putina przyniosły tak wiele cierpienia dla Ukrainy, gdzie rosyjskie wojska zbombardowały i zniszczyły domy wielu ukraińskich cywilów. Niektóre ukraińskie miasta zostały całkowicie zniszczone, a Mariupol, miasto niegdyś zamieszkane przez 500.000 osób jest całkowicie zrujnowane. Zdjęcia satelitarne pokazały nawet, że Rosjanie wykopali masowe groby, najprawdopodobniej w celu pozbycia się mieszkańców Mariupola, co byłoby zbrodnią wojenną.Putin przyniósł wojnę prawie wszystkim na Ukrainie i nawet ci w zachodnich częściach Ukrainy muszą szukać schronienia, gdy Rosja przeprowadza nowe uderzenia rakietowe. To straszne, bo w każdej chwili możesz dostać ostrzeżenie o nalocie, mając nadzieję, że rakieta nie trafi w twój dom.Ale Putin przyniósł również cierpienie swojemu własnemu krajowi. Kiedy popędził więcej wojska na front, aby podbić Ukrainę, ogłosił mobilizację 300.000 młodych mężczyzn i wysłał ich w większości nieprzygotowanych na front swojej okrutnej wojny. To jest to, co stratedzy wojskowi nazywają \"mięsem armatnim\".Wielu Rosjan próbowało opuścić kraj, ale zostali zatrzymani przez rosyjskich strażników na granicy. Zostali oni uwięzieni i wysłani na front.To naprawdę wstyd, co robi tam Putin: rozpoczął największą wojnę lądową od czasów II wojny światowej, kiedy to Hitler przypuścił atak na Polskę, a później na kilka innych krajów. Nazywanie Putina \"Putlerem\" jest całkowicie uzasadnione, bo stoi on w tradycji działań Hitlera z II wojny światowej.Ludzie cierpią, bo maniak Putin chce stworzyć Związek Radziecki 2.0 i przywrócić swoją komunistyczną gównianą dziurę.Jak Bitcoin może pomóc w pozbyciu się dyktatury Putina?Tak jak Alex Gladstein opisał w swoim artykule Waluta ostatniej szansy, jak Bitcoin pomaga ludziom cierpiącym z powodu krwawej wojny Putina, byłoby interesujące ocenić, jak Bitcoin może pomóc nam pozbyć się dyktatury Putina lub przynajmniej osłabić jego pozycję, że musi iść na ustępstwa.Jasne, nie jest to łatwe i sam Bitcoin nie może powstrzymać Putina przed inwazją na Ukrainę, ale Bitcoin może być częścią rozwiązania, aby wysłać reżim Putina dosłownie do Gułagu Jak Bitcoin może się do tego przyczynić:Rosjanie powinni wyrazić dezaprobatę dla wojny Putina za pomocą Bitcoina. Jak wszyscy wiemy, Putin boi się utraty władzy. Jest dyktatorem i nie można go usunąć demokratycznie, dlatego ludzie muszą odzyskać demokratyczne podejmowanie decyzji. Bitcoin jest takim demokratycznym narzędziem i nie może go zakazać, jeśli ludzie zdecydują się go użyć zamiast jego Rubla.My, jako sojusznicy Ukrainy, powinniśmy pomóc w osłabieniu rosyjskiego Rubla, narodowej waluty Rosji. To osłabiłoby rosyjskiego Rubla, narodową walutę Rosji. A kruchy Rubel osłabiłby zdolność Putina do zakupu lub produkcji większej ilości broni = mniej ludzi zginie na Ukrainie od rosyjskich rakiet i Ukraina będzie mogła wypchnąć rosyjskie wojska z powrotem z Ukrainy.Jeśli Putin nadal będzie rządził w sposób autorytarny, Rosjanie powinni odmówić płacenia podatków, ponieważ płacenie podatków w krajach, w których nie odbyły się uczciwe i wolne wybory, powinno być nieobowiązkowe. W ten sposób ludzie mogliby wymusić demokratyczne wybory i odsunąć Putina od władzy. W podobny sposób upadły Niemcy Wschodnie.Bitcoin może pomóc nam w wysłaniu pomocy na Ukrainę, co udowodniły inicjatywy organizowane przez icopress czy JohnnyUA.Jakiś czas temu napisałem temat Bitcoin może nieco pomóc w ograniczeniu rozprzestrzeniania się koronawirusa. Była tam mowa o małej pomocy, jaką może przynieść Bitcoin, poprzez nieużywanie fizycznych pieniędzy, które mogą przenosić wirusa.Jest teraz inna pomoc, którą Bitcoin może przynieść: pomoc ludziom z Ukrainy, którzy może nie mogą otrzymać darowizn fiat, ale Bitcon jest nie do zatrzymania. Kraje G7 nałożyły sankcje na Rosję, ale to nie wystarczyło, aby zbyt mocno zachwiać ich walutą; Bitcoin może pomóc również tutaj. Nie jest to dużo, ale jest to coś! I, używając Bitcoina coraz bardziej, wszyscy czynimy go potężniejszym i jego moce wracają, aby nam pomóc. To niewiele, ale przynajmniej my wszyscy możemy zrobić coś dla pomocy Ukrainie poprzez Bitcoin.Więc pomóż Bitcoinowi pomóc Ukrainie!Temat jest samodzielnie moderowany w celu uniknięcia spamu.Tłumaczenie wykonane w ramach inicjatywy AOBT",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5447756",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "April 06, 2023, 06:48:01 AM",
      "body": "Jak jestem totalnie w błędzie to mnie popraw ale odrazu zapaliła mi się lampka, że każdy kij ma dwa końce i jak zarówno bitcoin może szkodzić Putinowi tak samo może go zbawić. Myślę o tych wszystkich węglowodorach, których rosja ma pod dostatkiem, a które okładane są kolejnymi sankcjami. Co jak rosja postanowi ich nie sprzedawać po zaniżonych cenach a spalać w całości u siebie w kraju a pozyskaną energię wykorzystywać do kopania bitcoina. By następnie sprzedawać na rynku już bez sankcji? Oczywiście rynek bitcoina jest do tego za mały ale trzeba pamiętać, że problem nie powstał w zeszłym roku a wieki temu i nie skończy się za rok a pewnie za dekady jeśli w ogóle. Quote from: cygan on April 06, 2023, 06:11:45 AMRosjanie powinni wyrazić dezaprobatę dla wojny Putina za pomocą Bitcoina. Jak wszyscy wiemy, Putin boi się utraty władzy. Jest dyktatorem i nie można go usunąć demokratycznie, dlatego ludzie muszą odzyskać demokratyczne podejmowanie decyzji. Bitcoin jest takim demokratycznym narzędziem i nie może go zakazać, jeśli ludzie zdecydują się go użyć zamiast jego Rubla.My, jako sojusznicy Ukrainy, powinniśmy pomóc w osłabieniu rosyjskiego Rubla, narodowej waluty Rosji. To osłabiłoby rosyjskiego Rubla, narodową walutę Rosji. A kruchy Rubel osłabiłby zdolność Putina do zakupu lub produkcji większej ilości broni = mniej ludzi zginie na Ukrainie od rosyjskich rakiet i Ukraina będzie mogła wypchnąć rosyjskie wojska z powrotem z Ukrainy.Jeśli Putin nadal będzie rządził w sposób autorytarny, Rosjanie powinni odmówić płacenia podatków, ponieważ płacenie podatków w krajach, w których nie odbyły się uczciwe i wolne wybory, powinno być nieobowiązkowe. W ten sposób ludzie mogliby wymusić demokratyczne wybory i odsunąć Putina od władzy. W podobny sposób upadły Niemcy Wschodnie.Ostatnio trafiłem na panią Krystyną Kurczab-Redlich - korespondentka w Rosji, autorka wielu książek o putinie i rosji. Pani wielokrotnie powtarza w wywiadach, że przy takiej manipulacji, wielopokoloeniowego prania mózgu ciężko oczekiwać od tych ludzi wiele. A ci, którzy nawet są świadomi, boją się, bo na lata ciężkiego więzienia można trafić za 1 niepochlebne zdanie a to wszystko w kulturze donoszenia na sąsiada, na tatusia, na kogokolwiek.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "April 06, 2023, 07:31:00 PM",
      "body": "Drogi cyganie, to jest, być może, jedyny polityczny artykuł, jaki kiedykolwiek napisałem. Zrobiłem to jednak, aby spróbować zrobić coś dla uciskanego narodu - narodu ukraińskiego. Jestem całkowicie przeciwny wojnom, przeciw uciskowi, przeciw przemocy jakiegokolwiek rodzaju i próbowałem tym artykułem pomóc jakoś biednemu narodowi ukraińskiemu. Wielką pomocą był 1miau, który zasugerował mi napisanie tego tematu i jestem szczęśliwy, że udało mi się to zrobić dokładnie w tym dniu 24 lutego, kiedy wojna skończyła rok.Dziękuję za przetłumaczenie tego mojego tematu, który może dotknąć również polskich użytkowników. Każdy z nas, używając Bitcoina, daje większą moc Bitcoinowi, a tym samym Bitcoin może jeszcze bardziej pomóc Ukraińcom. Wykonałeś wspaniały gest tłumacząc ten temat i nie mam wystarczających słów, aby Ci za to podziękować!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamvp",
      "created_time": "April 13, 2023, 06:47:49 PM",
      "body": "w zeszlym roku mozna bylo przesylac dotacje w krypto dla Ukrainy, teraz cos nie widze tej strony?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GazetaBitcoin",
      "created_time": "April 14, 2023, 10:14:27 AM",
      "body": "Quote from: adamvp on April 13, 2023, 06:47:49 PMw zeszlym roku mozna bylo przesylac dotacje w krypto dla Ukrainy, teraz cos nie widze tej strony?NeuroticFish zasugerował to samo. Jednak po rozmowie z icopress poinformował mnie że nie potrzebuje już darowizn. Adres darowizny jest nadal aktualny, ale powiedział, że ma teraz wystarczające środki i nie potrzebuje w tej chwili innych darowizn. Jeśli chcesz przekazać darowiznę, skontaktuj się bezpośrednio z icopress.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamvp",
      "created_time": "April 14, 2023, 10:16:31 AM",
      "body": "to byla oficjalna, rzadowa zbiorka, teraz znalazlem strone gdzie sa tylko numery kont bankowych...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adamvp",
      "created_time": "April 17, 2023, 09:33:50 PM",
      "body": "Quote from: ecdsa123 on April 17, 2023, 08:57:13 PMQuote from: adamvp on April 14, 2023, 10:16:31 AMto byla oficjalna, rzadowa zbiorka, teraz znalazlem strone gdzie sa tylko numery kont bankowych...a to dlatego że bitcoiny wyparowały. korupcja w ukrainie jest jak czarna dziura.jakies zrodlo?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}