{
  "id": "topic_5445131",
  "title": "Asuspawer09",
  "author": "Asuspawer09",
  "created_time": "March 16, 2023, 08:33:44 AM",
  "content": "Akda ni: GazetaBitcoinOrihinal na paksa: Help Bitcoin help Ukraine!Isang taon na ang nakalipas nang sakupin ni Putin ang Ukraine - noong Pebrero 24, 2022. Ito ay isang malungkot na anibersaryo para sa lahat ng mga Ukrainians at maging para sa buong sangkatauhan.Isang lathala mula sa Bitcoin Magazine na inirerekomenda sa akin ni 1miau, kamakailan lamang nagdulot ng aking atensyon. Ang Bitcoin Magazine ay isang mahusay na mapagkukunan ng maraming impormatibong artikulo tungkol sa Bitcoin ngunit naglalathala din ito ng malawak na saklaw ng mga philosophic at libertarian na mga sanaysay.Ang artikulong ito ay mahaba, marahil isa sa pinakamahabang sa aking mga nabasa na may halos 14,000 na salita. Natagalan ako sa pagbasa neto, ngunit sa huli, mas nahikayat pa ito sa akin upang suportahan ang layunin ng Ukraine. Ito ay nagsasalaysay tungkol sa magulong nakaraan ng mga taga-Ukraine, ang kanilang pakikibaka mula sa nakaraan na patuloy hanggang sa kasalukuyan. Ang mga bagay na ito ay ang nagdulot ng pakikibaka sa ibat ibang panahon, ngunit ang sakit ay hindi pa rin nawawala.Binabanggit din sa atin ang adopsyon ng Bitcoin sa Ukraine at ang salaysay na nagsabi sa atin tungkol sa istorya mga tunay na bayaning sundalo o kuwento ng mga bitcoiner sa Ukraine. Isa sa mga kuwento na inilahad sa artikulo ay talagang nakakataba ng puso. Ipinakilala nito si Naumenko, isang masigasig na bitcoiner at isang bayani:QuoteNoong 2018, nagkaroon ng pagkakataon si Naumenko na makatrabaho ang mga kilalang personalidad sa mundo ng Bitcoin tulad nina Greg Maxwell at Pieter Wuille bilang intern sa Blockstream. Sa huli, nakipagtulungan sila ni Maxwell at Wuille sa pagsulat ng isang papel tungkol sa isang inihahain na pagpapabuti sa Bitcoin na tinatawag na Erlay, na maaaring magpabuti sa kahusayan at kaligtasan ng network. Noong 2021 at unang bahagi ng 2022, malapit nang makamit ni Naumenko ang isang bagong hakbang sa kanyang trabaho sa Bitcoin protocol.Ilang araw lamang bago ang pagsalakay, inilabas ni Naumenko ang \"CoinPool,\" isang bagong pagpapatupad ng Bitcoin na magbibigay-daan sa maraming user na ibahagi ang parehong \"UTXO,\" o magastos na piraso ng bitcoin. Bilang karagdagan sa Lightning Network, at isang bagay na maaaring makatulong sa pagpapahusay ng Bitcoin at magdagdag ng privacy, ang CoinPool ay ang resulta ng mga taon ng trabaho kasama ang kapwa developer na si Antoine Riard. Ang paglabas ay isang kahanga-hangang tagumpay sa anumang pagkakataon, ngunit ito ay isang kahanga-hangang gawaing pang-agham mula sa isang bansang nasa bingit ng digmaan.Noong Pebrero 24, si Naumenko ay nagising dahil sa pagvivibrate ng kanyang telepono. Ang kanyang mga kaibigan ay nagpapadala ng mga nakakagulat na mensahe sa kanya: Ang Pagsalakay na nangyayari. Naglaan lamang siya ng kaunting probabilidad sa kanyang isipan na ang pangyayaring ito ay mangyayari ngunit napakaliit lamang. Labingdalawang oras lang ang nakalipas, nakasakay siya sa kanyang bagong electric scooter papunta sa isang coffee shop para magbasa ng libro. Ang panahon ay kulay abo at nakapanlulumo. Walang tao sa kalye. Siya ay nakaramdam ng isang kakaibang pakiramdam. Nang magising siya nang 5:00 a.m. doon niya napagtanto na ang digmaan ay nagsimula na. Nagdala siya ng backpack at nagmadali papunta sa malapit na metro stop kung saan siya bumaba sa isang bomb shelter na ginawa pa noong panahon ng Soviet-era, na kayang matagalan ang mga nuclear attacks.Tatlong araw at dalawang gabi siya sa bunker. Noong una, nang pumasok siya sa istasyon ng subway, hiniling ng matandang babae sa turnstile na magsuot siya ng mask. Tumingin siya sa kanyang naguguluhan. Tapos na ang COVID-19, at nagsimula na ang digmaan. Parami nang parami ang mga tao at mga pamilyang may mga anak na sumama, nagdadala ng mga unan at pagkain, naghahanda na manirahan doon. Ang pagkabigla ng digmaan ay nagtulak sa maraming tao na manirahan sa  ilalim ng lupa, ngunit pagkaraan ng ilang araw, dahil sa pangangailangan, ang mga tao ay nagsimulang bumalik sa kanilang pangaraw-araw na buhay.Nang tuluyang umalis si Naumenko sa taguan, nakipagkita sila ng kanyang mga kaibigan at nagpasyang umalis sa lungsod sakay ng kulay rosas na BMW. Ang kotse ay nakakamangha ngunit ito lamang ang maaaring magamit. Natakot sila na ito ay maaaring magbigay ng labis na atensyon ngunit nagpasya na gamitin papuntan sa gawing pakanluran. Ang hukbo ng Russia ay nasa mga labas ng Lungsong ng Kyiv, pumatay ng mga sibilyan, at naririnig nila ang putukan ng baril. Ang oras ay mahalaga.Ang mga kaibigan ni Naumenko ay nawala sa Romania, ngunit hiniling niyang ihatid siya sa isang bayan ng Ukraine bago sila tumawid sa hangganan. Gusto niyang manatili at tumulong.Ang mga Militar ni Putin ay nagdulot ng labis na pagdurusa para sa Ukraine, kung saan binomba at sinira ng mga Militar ng Russua ang mga bahay ng maraming sibilyang Ukrainian. Ang ilang mga lungsod sa Ukraine ay ganap na nawasak at ang Mariupol, isang lungsod na dating pinaninirahan ng 500.000 katao ay ganap na nawasak. Ipinakita pa ng mga satellite image na ang mga Russian ay naghukay ng maraming libingan, upang mapatay ang mga Maruipol citizen na isang krimen sa digmaan.Nagdala si Putin ng digmaan sa halos lahat ng tao sa Ukraine at kahit na ang mga tao sa kanlurang bahagi ng Ukraine ay kailangan ng maghanap ng proteksyon kapag nagsasagawa ang Russia ng mga pagatake gamit ang missile. Ito ay nakakatakot dahil maaari kang biglang magkaroon ng babala sa pagsalakay sa himpapawid at umasa na hindi tatama ang iyong bahay ang rocket.Ngunit nagdala rin si Putin ng pagdurusa sa kanyang sariling bansa. Nang sumugod ang maraming hukbo upang sakupin ang Ukraine, inihayag niya ang pagpapakilos ng 300.000 kabataang lalaki at pinadala sila na halos hindi handang lalake sa harapan para sa kanyang malupit na digmaan. Iyan ang tinatawag ng mga strategist ng militar na \"cannon fodder\".Maraming mga Ruso ang nagsisikap na umalis sa bansa ngunit pinigilan ng mga guwardiya ng Russia sa hangganan. Sila ay nakulong at ipinadala sa harapan.Tunay na nakakalungkot ang ginagawa ni Putin: sinimulan niya ang pinakamalaking digmaang pang-lupa mula noong si Hitler ay nagsimulang umatake sa Poland at sa ilang iba pang mga bansa noong WW2. Ganap na nararapat na tawagin si Putin na \"Putler\" dahil siya ay nagsusulong ng mga aksyon ni Hitler noong WW2.Ang mga tao ay naghihirap dahil ang baliw na si Putin ay gustong lumikha ng Soviet Union 2.0 at muling itatag ang kanyang komunistang .Paano makakatulong ang Bitcoin upang mapatalsik ang diktadura ni Putin?Gaya ng inilarawan ni Alex Gladstein sa kanyang artikulong Currency of last resort resort kung paano tinutulungan ng Bitcoin ang mga taong nagdurusa sa madugong digmaan ni Putin, mas magiging kapana-panabik na suriin kung paano makakatulong ang Bitcoin upang makalaya tayo sa diktadura ni Putin o kahit manlamang pahinain ang kanyang posisyon na kailangan niyang magbigay ng mga konsesyon.Oo naman, hindi ito madali at hindi sapat ang Bitcoin para harangin ang paglusob ni Putin sa Ukraine, ngunit maaaring maging bahagi ito ng solusyon upang mapigilan ang pamumuno ni Putin at tapusin ito  Paano makakapag-ambag ang Bitcoin:Dapat magpahayag ng pagkadismaya ang mga Ruso sa giyera ni Putin sa pamamagitan ng paggamit ng Bitcoin.Tulad ng alam nating lahat, si Putin ay natatakot na mawala ang kanyang kapangyarihan. Siya ay isang diktador at hindi maaring tanggalin sa paraang demokratiko, kaya't kailangan ng mga tao na muling ibalik ang desisyon sa pamamagitan ng demokratikong pagpapasiya. Ang Bitcoin ay isang demokratikong kasangkapan at na hindi maaaring ipagbawal kung ang mga tao ang magpapasya at gamitin neto sa halip na gamitin ang kanyang Ruble.Kami, bilang mga kaalyado ng Ukraine, ay dapat tumulong na pahinain ang Russian Ruble, pambansang pera ng Russia. Ang isang mahinang Ruble ay magpapahina sa kakayahan ni Putin na bumili o gumawa ng mas maraming armas = mas kaunting tao ang papatayin sa Ukraine mula sa mga missile ng Russia at magagawa ng Ukraine na itulak pabalik ang mga sundalong Ruso palabas ng Ukraine.Kung patuloy na mamamahala si Putin sa isang awtoritaryan na paraan, dapat tumanggi ang mga Ruso na magbayad ng buwis dahil dapat na opsyonal ang pagbabayad ng buwis sa mga bansa kung saan walang naganap na patas at malayang halalan. Sa paggawa nito, maaaring pilitin ng mga tao ang isang demokratikong halalan at alisin si Putin sa kapangyarihan. Ang Silangang Alemanya ay bumagsak sa katulad na paraan.Maaaring makatulong ang Bitcoin sa atin upang magpadala ng tulong sa Ukraine bilang isang inisyatiba na napatunayan na ni icopress o JohnnyUA Kamakailan ay isinulat ko ang paksang  \"Ang Bitcoin ay makatutulong upang bawasan ang pagkalat ng coronavirus.\"  Mayroong kaunting tulong na maaaring maidulot ang Bitcoin sa pamamagitan ng hindi paggamit ng pisikal na pera, na maaaring magdala ng virus.Mayroon ngayon isa pang tulong na maaaring maidulot ang Bitcoin: tulungan ang mga tao mula sa Ukraine, na hindi maaaring tumanggap ng fiat na donasyon, ngunit hindi mapigilan ang Bitcoin. Pinatawan ng mga bansa ng G7 ang Russia ng mga sanctions, ngunit hindi ito sapat para makagulo nang malaki sa kanilang pera; maaaring makatulong ang Bitcoin dito. Hindi ito masyadong malaki pero mayroon. At, sa pamamagitan ng paggamit ng Bitcoin palagi, ay ginagawa nating lahat itong mas makapangyarihan at ang kanyang kapangyarihan ay bumabalik upang tulungan tayo. Hindi ito masyadong malaki pero, sa palagay ko, lahat tayo ay maaaring gumawa ng isang bagay upang tulungan ang Ukraine sa pamamagitan ng Bitcoin.Kaya tulungan natin ang Bitcoin upang matulungan ang Ukraine!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445131",
  "comments": []
}