{
  "id": "topic_5432420",
  "title": "xanto",
  "author": "xanto",
  "created_time": "December 30, 2022, 07:37:50 PM",
  "content": "Hello friendsDo you currently have at least 1 bitcoin?Many people sold their bitcoins after quite a big drop,but i am sure there are people who still hodl a large amount of bitcoinsAnd i always wonder what motivates those peopleFaith,hope,unemotional analytics or the ability to see the future? Please,answer only those who really own at least 1 bitcoinThank you",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432420",
  "comments": [
    {
      "author": "mk4",
      "created_time": "December 30, 2022, 07:53:32 PM",
      "body": "Quote from: xanto on December 30, 2022, 07:37:50 PMFaith,hope,unemotional analytics or the ability to see the future? Pretty simple — I simply think that bitcoin is a great investment that could likely give me a good multiples in ROI sometime in the long-term future. That's pretty much it, besides things like having self-custody of my funds and stuff.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "December 30, 2022, 07:56:36 PM",
      "body": "Quote from: xanto on December 30, 2022, 07:37:50 PMPlease,answer only those who really own at least 1 bitcoinAnd how would you know if I own or don't own 1 bitcoin if I choose to lie?It's an open forum mate, if I don't currently own up to 1 bitcoin but am a true bitcoin believer, I believe I should have a say most especially if I feel my contribution to the topic of discuss is important.So like I already pointed out, I don't currently own up to 1 bitcoin, but the current amount I own, I've been selling it and buying more back as a means of making profit pending when we will see another major bull run, selling and buying simply means, selling it high, and waiting for the price to come down a bit, then buy back in again gaining a lite more bitcoin from the profit made.People who currently own/hold large number of bitcoins are the big boy of the industry, we call the whales, they can hold and forget their bitcoin in their wallet for years, because they already have good businesses fetching enough money for them, they have no need checking the price of bitcoin always like you and I.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "December 30, 2022, 07:58:55 PM",
      "body": "You do not need to have worth of 1 bitcoin in fiat before you can be able to buy bitcoin, you can have $100 or lesser amount to buy bitcoin, the value will increase and the ROI would be in accordance to the amount invested.If bitcoin price has already dropped and some people sold their coins, they are making a mistake that they will realize when the market is more volatile and bitcoin price is moving to the up direction, this may happen soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "December 30, 2022, 09:25:13 PM",
      "body": "Quote from: xanto on December 30, 2022, 07:37:50 PMFaith,hope,unemotional analytics or the ability to see the future? Believe! I have seen many falls of bitcoin but never sold because of price drops. I only did sell if I have any financial reason. I don't even check the price for months. All now I have is for holding for a longer period of time. Next year if the market starts to move I will transfer some into the exchange, until then I have no worries about the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "December 30, 2022, 09:37:11 PM",
      "body": "I hold under 1 BTC at this time.I have a lot of mining gear worth more than 1 BTC at this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "December 30, 2022, 09:45:49 PM",
      "body": "Quote from: xanto on December 30, 2022, 07:37:50 PMAnd i always wonder what motivates those peopleThey perfectly understand what BTC is all about, one doesn't need to have to see the future to know that BTC is not going to collapse like altcoins, in the short term there could be correction in the price, but people who hold even during correction periods know that BTC is a long-term investment, and as long as they have not invested with money they would be needing soon, they do not have to be scared of anything. Another thing that motivates people to hold BTC is because they want to spend it like a currency that it is, and they wouldn't turn down the offer to spend BTC rather than fiat to any merchant that is open to accept it.Quote from: xanto on December 30, 2022, 07:37:50 PMPlease,answer only those who really own at least 1 bitcoinThough i answered your op, i do not have anything close to 1 BTC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vampobit",
      "created_time": "December 30, 2022, 09:54:17 PM",
      "body": "I don't own 1 BTC, but trust me, I don't really care about it. Bitcoin is, perhaps, the greatest technological invention of the century. I mean it! Imagine someone who invests in gold. They have to rent facilities to store it and guards to guard it. There is a storage issue. Bitcoin fixes that.Imagine someone who holds a large amount of money in their bank account and suddenly, their country decides to put capital controls and people can't withdraw their money. There is a liquidity issue. Bitcoin fixes that. Imagine someone who decides to send a payment to Africa and the banks require a 12% fee. There is a huge remmitance issue. Bitcoin fixes that.Imagine someone who wants to prove ownership of their property. There is a bureaucracy issue. Bitcoin fixes that.Imagine someone who sees their local currency being devastated by the exchange rates against dollar or euro. There is a massive attack on the local currency. Bitcoin fixes that.Imagine someone who holds lots of money in a bank account. If the government decide to inflate the monetary system, they can print money, causing people's money to lose its value. Bitcoin fixes that.Imagine lending money to someone and having to trust that they have the money to repay you. There is a trust issue. Bitcoin fixes that. In fact, Bitcoin solves the double-spending problem. Kudos to Satoshi and Adam Back.I believe in Bitcoin to be a superior monetary system, where everyone is equal. It's not about you and me, it's not about the people that have 100BTC, nor for those that have 100Sats. Every single one of us can be sovereign and maintain their own keys and their own nodes.Finally, Never forget how it all started \"Bitcoin: A Peer-to-Peer Electronic Cash System\" - Satoshi Nakamoto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "minime0105",
      "created_time": "December 30, 2022, 10:03:35 PM",
      "body": "Having one Bitcoin now, i think that is not easy because of how Bitcoin falls this time around, i believe that why bitcoin price is falling is same as the Bitcoin stored is depreciating in the value but people don't know exactly, i believe that Bitcoin price affect the price of it, so let us that the people who can have 1bitcoin is those people who buy Bitcoin surplus and stored when the price was lower than the current price and kept it for the long time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 30, 2022, 10:27:39 PM",
      "body": "Lots of similar threads though: Do you own 1 Bitcoin? (2022 edition)  What can 1 Bitcoin buy in your country?  Do you own 1 Bitcoin?  1 Bitcoin, Not for everyone.   People who holds 1+ Bitcoin, how does it feel to hold in bear market? I guess the number motivation for this people to hold at least 1 bitcoin (which is hard), is to really make a lot of money or profit in the future as we all know that bitcoin investment is for long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yawa2020",
      "created_time": "December 30, 2022, 10:51:46 PM",
      "body": "Quote from: Baofeng on December 30, 2022, 10:27:39 PMLots of similar threads though: Do you own 1 Bitcoin? (2022 edition)  What can 1 Bitcoin buy in your country?  Do you own 1 Bitcoin?  1 Bitcoin, Not for everyone.   People who holds 1+ Bitcoin, how does it feel to hold in bear market? I guess the number motivation for this people to hold at least 1 bitcoin (which is hard), is to really make a lot of money or profit in the future as we all know that bitcoin investment is for long term.From among this thread you mentioned, I see btc doubters lol. What majority of them don't understand is that btc investment is not like ponzi that promises to make you rich in overnight. Btc is gradually and a long time project that requires patience from investors. I think trading will be more suitable for their likes. The earlier they realize this, the better for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DoublerHunter",
      "created_time": "December 30, 2022, 11:02:51 PM",
      "body": "Quote from: xanto on December 30, 2022, 07:37:50 PMHello friendsDo you currently have at least 1 bitcoin?~snip~Faith,hope,unemotional analytics or the ability to see the future? Please,answer only those who really own at least 1 bitcoinThank you^ It is hard to accumulate 1 BTC now because it is very expensive, if you have, you are not a regular investor because you have that large sum in your wallet. I have under 1 BTC, a small amount that only I can afford to hold, I did not easily get panic because I know already the market sentiment and the market movement. I have been here in the crypto market for how many years so now I fully understand if there is a market crash and learned how to hold my asset while the market was in a bad situation. BTC has a smaller fraction than you want, there is no need to have a whole number because that is very expensive, you can even own a worth of $5 in your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoPanda",
      "created_time": "December 30, 2022, 11:06:14 PM",
      "body": "Bitcoin prices corrected to 16k - 17k region, which is way cheaper than last year’s price of 50k and even though the price of 1 bitcoin right now is relatively cheap I don’t think it is any easier for people to buy 1 bitcoin. In my experience, people who talk about owning 1 bitcoin don’t really have any bitcoins and blame the so called high cost of 1 bitcoins as the reason why they haven’t bought yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "December 30, 2022, 11:08:18 PM",
      "body": "Whether I hold 1 or less or none, I am not confident telling it to anyone.It is better to keep it private when it is all about someone asking how much I've got.I feel uncomfortable knowing someone knows how much I have.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ryu_Ar1",
      "created_time": "December 30, 2022, 11:12:26 PM",
      "body": "For now I still don't have up to 1 bitcoin in my portfolio but on the other hand with the current market conditions which are still crashing with DCA which I have been doing for the last few months my portfolio condition is much thicker than before for bitcoin and of course this is good enough for my heart.Speaking of faith, I wouldn't be here and buying DCA from a few months ago if I wasn't sure about it, when I did this of course I had real faith about bitcoin for my future. Even with some crashes and some fuds at the moment when a lot of people are more active calling for bitcoin is a scam but I like this because being in a bearish area like now I have more time to continue investing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "December 30, 2022, 11:15:02 PM",
      "body": "Having 1BTC is really big thing. In the past this is quite common that each and everyone who wish to hold 1BTC were able to do it. With the increasing adoption and growth in the global market the demand have increased. With time holding atleast a little serves to be a big investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "December 30, 2022, 11:47:45 PM",
      "body": "Quote from: livingfree on December 30, 2022, 11:08:18 PMWhether I hold 1 or less or none, I am not confident telling it to anyone.It is better to keep it private when it is all about someone asking how much I've got.I feel uncomfortable knowing someone knows how much I have. You're right about privacy, but I feel fairly anonymous here.While I wouldn't brag around in a bar about it, or walk around town with a t-shirt saying that I own bitcoin, I can say here that I have more than 20 bitcoins. It's not like any of you is going to trace it back to the exact location of my home and drill a hole in my leg to get me to send it to you  It's obvious that many Legendary members here own more than 1 bitcoin. You don't need to make them admit it in a thread to know it is so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "December 31, 2022, 05:39:27 AM",
      "body": "Quote from: xanto on December 30, 2022, 07:37:50 PMDo you currently have at least 1 bitcoin?Dear TaxMan, I do not own any bitcoin at all. My wallet is so empty...QuoteMany people sold their bitcoins after quite a big drop,People don't sell their bitcoin to thin air, they sell it to someone else. That means many people also bought bitcoin as the price dropped.QuoteAnd i always wonder what motivates those peopleFaith,hope,unemotional analytics or the ability to see the future? The reason is simple: being realistic and having eyes!Bitcoin is not a cash cow to make you rich nor is it made for profit making. It is a global currency that is made to be censorship resistant and help you gain your financial sovereignty. People who don't just panic sell their bitcoin because price dropped are mostly those who see bitcoin this way. Those who sell are the ones who thought they could become a millionaire overnight by holding a fraction of a bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "December 31, 2022, 05:56:04 AM",
      "body": "Quote from: xanto on December 30, 2022, 07:37:50 PMHello friendsDo you currently have at least 1 bitcoin?Many people sold their bitcoins after quite a big drop,but i am sure there are people who still hodl a large amount of bitcoinsAnd i always wonder what motivates those peopleFaith,hope,unemotional analytics or the ability to see the future? Please,answer only those who really own at least 1 bitcoinThank you    - Many communities in this industry have Bitcoin, we just don't know how many or how much they hold.I won't deny that I only have a little bit of bitcoin, I don't have 0.05btc. Because most of my holdings are altcoins such as Shiba Inu, Polygon, Bnb, and Xrp, then the others just don't make any money or just don't suit me. But if I only have a lot of money or I'm just rich, I will buy more than 1",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "December 31, 2022, 05:59:34 AM",
      "body": "@OP I don't own 1 Bitcoin, but it doesn't mean I'm not a strong holders. If you think a strong holders are only people who own at least 1 Bitcoin, you're wrong. Actually there's many careless big holders who're either weak hands or hold it on centralized exchange.Quote from: Mr. Magkaisa on December 31, 2022, 05:56:04 AMBecause most of my holdings are altcoins such as Shiba Inu, Polygon, Bnb, and Xrp, then the others just don't make any money or just don't suit me. My advice is you need to sell those centralized shitcoins and convert it to Bitcoin. There's no use cases at all, especially Shiba Inu which is only a meme coin, BNB is a centralized coin that the price depends on their exchange, and XRP is a centralized coin that work like traditional banking system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}