{
  "id": "topic_5417307",
  "title": "kamvreto",
  "author": "kamvreto",
  "created_time": "October 16, 2022, 01:50:12 PM",
  "content": "As a large exchange and currently the most popular crypto exchange, Binance announced that it will provide or facilitate Bitcoin miners with a nominal value of $500 million and will be awarded to Public Bitcoin mining companies and Private Bitcoin Mining and digital asset infrastructure globally.In its announcement a few days ago Binance will seriously support the mining industry and will also look for cloud mining vendors.This plan emerged when Bitcoin Miners had a difficult moment in recent months and the bitcoin price continued to fall to touch -72% of the previous ATH. Of course, this year has been an unfavorable year for miners, while electricity costs and maintenance costs continue and are increasingly expensive.data from: https://www.theblock.co/data/on-chain-metrics/bitcoinAccording to data from The Block Research, Bitcoin Miner revenue continues to decline from its highest in November 2021 with revenue of $1.7 billion and to date in September Miner earns $550 million in revenue and that's down about 67.7%, which is definitely a huge drop. and the loss of miners is also caused by a decrease in the price of bitcoin.And as a solution for Bitcoin miners who had experienced losses, Binance Pool as one of the world's leading crypto miners has a responsibility to keep the digital asset ecosystem running and growing. The $500 million Binance Pool loan project will support crypto miners and digital infrastructure providers. Loan Terms from BinanceBorrowers must meet several conditions that will be asked including:- Term For Loans is 18 to 24 months- Loan interest rates range from 5% to 10%- Offers security for both physical and digital asset markets, which will satisfy Binance.Binance will also cooperate with Cloud Mining vendors, as the Binance pool intends to launch a Cloud Mining product.Source: https://www.theblock.co/data/on-chain-metrics/bitcoin            https://www.binance.com/en/blog/mining/binance-pool-to-support-btc-mining-industry-with-a-$500m-miner-lending-project-694684880316935062",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417307",
  "comments": [
    {
      "author": "tbct_mt2",
      "created_time": "October 16, 2022, 02:35:11 PM",
      "body": "Miners have to afford to lose temporary because they can not have profit from mining in both bear market and bull market. It is easily to have profit from mining in bull market but in bear market, it is different.In bear market, they can have very slim profit and sometimes, they even have loss. However, if they can keep mining and hold their mining rewards and wait for a next bull run, they will get very good return at the end. It would be more similar to long term investment for miners. If miners are short term miners, they will have more risk to get loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 16, 2022, 03:23:54 PM",
      "body": "Quote from: kamvreto on October 16, 2022, 01:50:12 PMAnd as a solution for Bitcoin miners who had experienced losses, Binance Pool as one of the world's leading crypto miners has a responsibility to keep the digital asset ecosystem running and growing.Because if you are running an unprofitable business, the best possible thing to do is to lock up your assets for 2 years to take out a loan at 10% so you can continue to run your unprofitable business and end up even more in debt than you were to begin with. Don't be fooled in to thinking this is Binance doing something good for the network. It isn't. This is Binance doing whatever they can to make more profit for themselves, at the expense of anyone and anything else. Just as they have always done.The last retarget saw the difficulty increase by one of the highest jumps ever, and the highest since May last year. We are on track for another 5% jump in this period. Hashrate is at its highest ever, and continuing to grow. The ecosystem is \"running and growing\" just fine, without this cash grab from Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spectre71",
      "created_time": "October 16, 2022, 03:44:50 PM",
      "body": "Quote from: o_e_l_e_o on October 16, 2022, 03:23:54 PMDon't be fooled in to thinking this is Binance doing something good for the network. It isn't. This is Binance doing whatever they can to make more profit for themselves, at the expense of anyone and anything else. Just as they have always done.First thing I thought, this ain't no favor. 18 to 24 month loan? You would be hard pressed to buy and house a miner to break even at that. The timing is for miners to default at or near the halving and take their assest, now that it has become profitable. Like shark title loan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcampaign",
      "created_time": "October 16, 2022, 03:56:13 PM",
      "body": "The already low block reward and the steadily falling prices have put a lot of miners out of business, but whether the loan will bring back the miners' confidence to rebuild their bitcoin mining, I think why binance didn't build it for themselves, because we know they own the market the world's largest cryptocurrency and binance can build the world's largest bitcoin mine too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "October 16, 2022, 04:27:36 PM",
      "body": "Although the Binance intention was good but apart from the steadily falling price. Binance needs to know that the issue of Bitcoin miners is more than just the loan funds. According to the news I read when some miners are into debt due to mining not being profitable, the major issue is the electricity cost.Giving the Bitcoin mining sector will only fix some part of the issue they are experiencing but not the critical aspect.I heard some companies are building some batteries that will last for months and full charge within a few minutes, if this happens the mining sector could have the good old days.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 16, 2022, 04:48:31 PM",
      "body": "If it's loans for mining equipment or something like that, I think it can be a good thing for public companies (do they exist?) because the state borrowing money for projects is kind of very typical. But as for private individuals or small business owners, I think that if things are difficult, getting a loan to engage in mining which might bring more losses unless the price changes significantly, so getting into it is risky. Don't invest what you can't afford to lose should especially apply to things like businesses that can lead to even more losses than initially anticipated. Loaning money for mining can end poorly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "October 16, 2022, 05:43:21 PM",
      "body": "Quote from: kamvreto on October 16, 2022, 01:50:12 PMOffers security for both physical and digital asset markets, which will satisfy Binance.Binance is already satisfied by the, ATH-ed at the time we speak, security of the Bitcoin network. This loaning will only satisfy CZ's pocket. Quote from: kamvreto on October 16, 2022, 01:50:12 PMThis plan emerged when Bitcoin Miners had a difficult moment in recent months and the bitcoin price continued to fall to touch -72% of the previous ATH. Some miners must have had some difficult time, and some might had been mining with loss too. But, apparently, the network worked fine, and mining has peaked over all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "October 16, 2022, 06:00:32 PM",
      "body": "Quote from: AbuBhakar on October 16, 2022, 04:00:30 PMI wonder how this loan will help miners while they are losing on this bear market and having a loan will just give them more loss in the long run due to the interest rate since we don’t know exactly when will this bear market stop. Binance surely is a greedy loan shark for giving that huge interest rate on crypto sector that heavily affected by the price dump of Bitcoin. Increasing mining rig using this loan money doesn’t make sense because it will just increase the potential loss for miners.The loan can help to sustain the business temporarily assuming that Bitcoin will recover soon enough so that company who took the loan can pay the interest and capital.  But if the bear market prolong, this loan can be the trigger of death of companies that took the bait.I also think that this loan offer of Binance is like a wolf in sheep's skin, ready to take advantage of the mining company that has difficulty in maintenance.  Anyway, the 5%-10% interest isn't clear whether it is an annual interest or semi-annual since the terms is 18-24 months.  Does anyone has information regarding the duration of this interest charges?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 16, 2022, 06:59:52 PM",
      "body": "Quote from: bitcampaign on October 16, 2022, 03:56:13 PMThe already low block reward and the steadily falling prices have put a lot of miners out of businessNonsense. Hash rate is at an all time high, and indeed, has seen some of the fastest growth we've ever seen over the last few months. https://bitinfocharts.com/comparison/hashrate-btc-sma7.html#alltimeQuote from: lionheart78 on October 16, 2022, 06:00:32 PMI also think that this loan offer of Binance is like a wolf in sheep's skin, ready to take advantage of the mining company that has difficulty in maintenance.It's a win-win for Binance. Give out a loan to a struggling miner, using their assets as security. Either they pay back the loan and Binance make a profit, or fail to pay the loan and Binance take their assets, which will likely include all their mining gear, meaning Binance get to grow their own operation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "October 16, 2022, 07:35:43 PM",
      "body": "Taking this loan now could be a gamble because if price does not rebound to new highs before repayments are due its going to be bad for the loaner and loanee, and I thought Musk made this business unprofitable after his negative tweets about BTC... Not forgetting the increased difficulty that's there. Honestly at the moment, too many barriers to this to help the miners to come out profitable in this deal. And Just putting some thought to this, what really is Binance interests in getting miners signed up for this, have they considered the risk they are exposing themselves too??? anyway no risk, no gain Good Luck to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 16, 2022, 07:39:28 PM",
      "body": "Considering that Binance does not want US customers, will this extend to US miners too? Most of the mining industry is there, so this will be very hard to carry out if Binance is completely prohibited from doing business in the US at all...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "October 16, 2022, 08:13:07 PM",
      "body": "Quote from: Woodie on October 16, 2022, 07:35:43 PMAnd Just putting some thought to this, what really is Binance interests in getting miners signed up for this, have they considered the risk they are exposing themselves too??? anyway no risk, no gain Good Luck to them. Binance are not exposing themselves to any risks whatsoever, there is no situation of \"no risk--no gain\" for Binance too, check/read well, you will see that they are charging interests for this loans, it is not free, so if the miners pay back Binance gets to gain from the interests incurred, they also require securities or collateral to receive the loan, so if a miner doesn't pay back, they take whatever you have offered as security, they get to gain in that case too, so this is a situation of \"gain--gain\" either way for binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 16, 2022, 08:20:22 PM",
      "body": "Quote from: Woodie on October 16, 2022, 07:35:43 PMand I thought Musk made this business unprofitable after his negative tweets about BTC... Not forgetting the increased difficulty that's there. Honestly at the moment, too many barriers to this to help the miners to come out profitable in this deal. Musk caused only some short-term manipulations and can no longer have any significant effect on the market. Also, mining is still profitable. As mentioned by o_e_l_e_o above your post, the total hash power is now at its all time high. That couldn't happen, if mining wasn't profitable.The following chart shows bitcoin total hash power changes over time.blockchain.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "October 16, 2022, 08:26:31 PM",
      "body": "To be fair, I think Binance already supports the BTC ecosystem more than I expected. They have no obligation to do so.They already have their own shitcoin (BNB) and yet, they support BTC by offering 0% trading fees (doesn't apply to BNB strangely enough) AND loans to struggling ASIC miners.If you have faith that BTC will increase at least 10 times (200k USD = conservative estimation) during the next bull run (2025), then repaying those loans is a no-brainer.Yes, it's a gamble, but more of a calculated risk I would say.All halvings so far (2012, 2016, 2020) have spurred new bull runs/ATHs like clockwork (2013, 2017, 2021). Some people think it's a coincidence. 3 times in a row, though? Until the block subsidy becomes highly insignificant (could take decades to happen) this pattern will keep repeating like fractals do.ps: I'm wondering how pools are going to divide 1 sat to multiple miners during 2136-2140.It's literally impossible with the vanilla BTC protocol, unless they use extra subdivisions/decimals like LN already does.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 16, 2022, 09:10:32 PM",
      "body": "those taking out the loan are not the unprofitable farms. nor the \"start-up\"it will be the profitable well established farms in the best economic setting already.. that, instead of waiting 6-18 months to accumulate coin for next upgrade season in 2 years.(normal processs). will take a loan now grab much more asics now and really drive themselves up into the higher % of hashrate ownership to reap more coin per block sooner the aim.. is obvious.. if binance can trigger the hashrate competition to raise the costs of mining(underlying value) this then snowballs to raise the cost of all the other miners in speculation zone above the underlying value. which then pushes the price higher because those selling low wont sell so low and those buying will happily buy higher with the new raised low. thus moving the market price up",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptosize",
      "created_time": "October 16, 2022, 09:36:05 PM",
      "body": "Quote from: franky1 on October 16, 2022, 09:10:32 PMthose taking out the loan are not the unprofitable farms. nor the \"start-up\"it will be the profitable well established farms in the best economic setting already.. that, instead of waiting 6-18 months to accumulate coin for next upgrade season in 2 years.(normal processs). will take a loan now grab much more asics now and really drive themselves up into the higher % of hashrate ownership to reap more coin per block sooner the aim.. is obvious.. if binance can trigger the hashrate competition to raise the costs of mining(underlying value) this then snowballs to raise the cost of all the other miners in speculation zone above the underlying value. which then pushes the price higher because those selling low wont sell so low and those buying will happily buy higher with the new raised low. thus moving the market price upSounds like a win-win situation to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kamvreto",
      "created_time": "October 16, 2022, 10:36:18 PM",
      "body": "Regardless of what Binance's goals are, they will generally provide loans to large companies that do work in the bitcoin mining industry and can make loans according to the terms of the loans provided by Binance.Quote from: kryptqnick on October 16, 2022, 04:48:31 PM~snip~ Loaning money for mining can end poorly.If you look at it from the eyes of an investor or miner, a loan will be the last resort that must be taken to maintain the development of the company, even though the risk of interest on the loan will certainly be charged. Borrowing will end badly if you don't have any superior products and Binance will also conduct a survey on borrowing companiesQuote from: BlackHatCoiner on October 16, 2022, 05:43:21 PM~snip~ This loaning will only satisfy CZ's pocket. If that was the case in the end, CZ would just be an overly rich person with some of the interest on the loans she enjoyed. But we can't even compete with him, He may have other goals and I think CZ will contribute to the development of bitcoin miners though not completely.Quote from: o_e_l_e_o on October 16, 2022, 06:59:52 PM~snip~It's a win-win for Binance. Give out a loan to a struggling miner, using their assets as security. Either they pay back the loan and Binance make a profit, or fail to pay the loan and Binance take their assets, which will likely include all their mining gear, meaning Binance get to grow their own operation.Win-Win Solution for Binance, of course all companies will take advantage of what they put out. there may be some compensation provided by binance when they fail to pay the loan fees. but some of the larger companies that may take out loans have already done some research on their loans. in this context we're talking about binances like moneylenders who will confiscate everything when they don't pay, but probably won't go that far.Quote from: NotATether on October 16, 2022, 07:39:28 PM~snip~Most of the mining industry is there, so this will be very hard to carry out if Binance is completely prohibited from doing business in the US at all...Maybe US is an exception, but I also don't understand the actual rules about the US whether they still take loans or not. Currently the US is the country with the highest hashrate distribution and continues to rise every year. The US is a country with relatively cheap mining costs, but several other consequences such as a sudden rising heat wave also put pressure on their electricity costs.Bitcoin mining hashrate distribution from September 2019 to January 2022, by country:source: https://www.statista.com/statistics/1200477/bitcoin-mining-by-country/Quote from: cryptosize on October 16, 2022, 08:26:31 PMTo be fair, I think Binance already supports the BTC ecosystem more than I expected. They have no obligation to do so.Binance is doing the right thing, but there will be some pros and cons about their lending projects. whether it's a good project that fully supports miners or just taking big profits.Quote from: franky1 on October 16, 2022, 09:10:32 PMthose taking out the loan are not the unprofitable farms. nor the \"start-up\"They apply loans to large mining companies which are still profitable, because the target is win-win, as stated by o_e_l_e_o. Binance is also doing research on big borrowers, they also don't want borrowed money to just be wasted money without making anything for Binance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "October 17, 2022, 01:11:41 AM",
      "body": "Quote from: o_e_l_e_o on October 16, 2022, 03:23:54 PMBecause if you are running an unprofitable business, the best possible thing to do is to lock up your assets for 2 years to take out a loan at 10% so you can continue to run your unprofitable business and end up even more in debt than you were to begin with. Every miner, investor has own limit and when we have a majority of miners reach their limits, we likely witness a miner capitulation. Weak miners can not afford to temporary loss and after a few months of fighting with loss, they have to capitulate and exit.QuoteDon't be fooled in to thinking this is Binance doing something good for the network. It isn't. This is Binance doing whatever they can to make more profit for themselves, at the expense of anyone and anything else. Just as they have always done.As a company, running a business and getting profit from its operations are most important. Binance definitely is not an exception as well as their opponents like FTX. However, consider it as a win-win situation and if people can take it to lessen their difficulty or resolve it, they must accept that they are bringing profit and reputation to Binance or FTX. It's fair enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "October 17, 2022, 02:43:23 AM",
      "body": "here is the thing many people get wrong about loans..loans are not suppose to be for people that dont have any assets/ income.. having nothing and then owing someone in the future is the death spiral of fiat.smart people and rich people know thisthose with funds and can afford things without a loan, take out loans as a positive. that way they are not having to spend their own wealth upfront. but use the loan to create more income to increase their wealth EG if you make $100m a year. and dont want to spend that $50m a year. you get a loan for $50m to create a situation where income increases to $150m a year that way over 2 years you are $100m ahead in profit/new money and able to pay back the $60m(loan+2year interest)  and still have over $40m spare of free profit plus continue to be getting $150m a year incomeno one that is \"just breaking even\" or cant afford to sustain themselves should take out a loan because the loan payment+interest would put them in a worse position if they are not using the loan to increase their initial income..so as i said in previous post. smart businesses that can afford to expand without a loan. would use a loan to free up having to spend their own funds upfront..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}