{
  "id": "topic_5449007",
  "title": "dewilliams",
  "author": "dewilliams",
  "created_time": "April 16, 2023, 08:56:41 AM",
  "content": "The resources needed to satisfy all the want of human being are said not to be enough compared to all the want of humans we have many want we would like to satisfy at any given point in time which we may not be able to meet up with due to economic problems scales of preference simple is setting our needs inorder of priority.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449007",
  "comments": [
    {
      "author": "hugeblack",
      "created_time": "April 16, 2023, 12:10:38 PM",
      "body": "I do not think that this saying is correct. When our requirements were primitive, man discovered wood, which was burned to obtain fire and the beginning of energy. After the needs increased, coal appeared, including steam locomotives and internal combustion engines. Then oil appeared and the aviation industry developed. Therefore, when human needs increase, resources develop in return. necessary to cover these needs.I remember 100 years ago, people did not know about oil, and even when it appeared, they were not aware of this wealth, so the next wealth may be close or even outside the planet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CarnagexD",
      "created_time": "April 16, 2023, 01:00:54 PM",
      "body": "Quote from: dewilliams on April 16, 2023, 08:56:41 AMThe resources needed to satisfy all the want of human being are said not to be enough compared to all the want of humans we have many want we would like to satisfy at any given point in time which we may not be able to meet up with due to economic problems scales of preference simple is setting our needs inorder of priority.I would suggest that you read Think and grow rich by Napoleon Hill or The Science of Getting Rich. There is an unlimited resource. All begins in man's mind. If every nation does a scale of preference ranking the needs and wants, prioritizing the necessities and which are not then every people will wrestle because every government or authority will take the power to distribute the needs and resources. Though resources are limited to the planet, ideas aren't.  Scarcity is true, but there would be another or new way of thinking to overcome that.Not to get too far to the opt of OP, economic problems just require economic solutions. There is no lack of resource, only lack of ideas.Quote from: hugeblack on April 16, 2023, 12:10:38 PMI do not think that this saying is correct. When our requirements were primitive, man discovered wood, which was burned to obtain fire and the beginning of energy. After the needs increased, coal appeared, including steam locomotives and internal combustion engines. Then oil appeared and the aviation industry developed. Therefore, when human needs increase, resources develop in return. necessary to cover these needs.I remember 100 years ago, people did not know about oil, and even when it appeared, they were not aware of this wealth, so the next wealth may be close or even outside the planet. To be exact, there is more exploration outside the planet than what is inside the core. Which means just imagine what else can we discover. I just wish it is not another virus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "April 16, 2023, 01:06:08 PM",
      "body": "It is not possible to satisfy all human needs and desires. In reality, human resources and time are limited. Therefore, we need to prioritize our needs and desires in order to maximize the rights and interests of individuals and communities. Our priorities can depend on many factors, such as our values, time, health, environment and other personal values. It is important to make smart and responsible decisions to use it effectively and to best meet our most important needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "April 16, 2023, 01:23:38 PM",
      "body": "Quote from: hugeblack on April 16, 2023, 12:10:38 PMI do not think that this saying is correct. When our requirements were primitive, man discovered wood, which was burned to obtain fire and the beginning of energy. After the needs increased, coal appeared, including steam locomotives and internal combustion engines. Then oil appeared and the aviation industry developed. Therefore, when human needs increase, resources develop in return. necessary to cover these needs.I remember 100 years ago, people did not know about oil, and even when it appeared, they were not aware of this wealth, so the next wealth may be close or even outside the planet. I guess what OP is trying to say is that \"human wants are insatiable\". Since resources are limited and scarce we should have a scale of preference is the only way to make sure the resources we have available are enough for us. This is actually true because no matter the amount of money you have, you always have wants, and since resources are scarce we can't have everything we want at every given time, so we have to forego some things in other to get the most important things at the moment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hyudien",
      "created_time": "April 16, 2023, 02:30:19 PM",
      "body": "Quote from: CarnagexD on April 16, 2023, 01:00:54 PMNot to get too far to the opt of OP, economic problems just require economic solutions. There is no lack of resource, only lack of ideas.People are lazy to think and look for ideas when technology is getting up to date. Poverty, economic needs and everything depend on the resources of the mind itself. I totally agree with what you said economic problems require economic solutions. Because basically we always look far away but forget the important aspects around us that can still support needs beyond what is needed. Usually caused by being too ambitious to see the achievements of others and do not see the abilities that can be done alone. The result is when we have found a solution but are still looking for problems, and assume that solution after solution always ends in incompatibility.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mvdheuvel1983",
      "created_time": "April 16, 2023, 02:32:16 PM",
      "body": "I think life is very simple but humans complicate it with endless unimportant pseudo-need-priority like need. And it goes on and on to create more scarcity of resources to satisfy our psuedo-need. Granted there are real needs and wants but they seem far from achievable because of too many economic problems.But in reality, it is either we get one or the other. It is a trade. A trade - the most urgent need to the least urgent.In doing so,we are making choices and setting priorities in allocating limited resources to satisfy unlimited wants and needs.By doing this, we are choosing and establishing priorities in the allocation of finite resources to meet infinite wants and requirements.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "April 16, 2023, 03:38:32 PM",
      "body": "The endless research and discovery that we people do, the more resources we'll need. It's not only to satisfy our needs as a human but also experimenting for us to find the most convenient things that might saved us energy and help us such as cars, motors, machine and many more. But despite those improvements, the more we greed for improvements the more resources we eat. This will lead to scarcity, people find that we could circulate the resources as we return what we took. For example, for every tree we cut, the 10 tree plants we plant for the trade. Since it will take years for trees to grow as they help us to give oxygen that's why most country side have a nice fresh air and unpolluted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "April 16, 2023, 04:01:35 PM",
      "body": "Quote from: dewilliams on April 16, 2023, 08:56:41 AMThe resources needed to satisfy all the want of human being are said not to be enough compared to all the want of humans we have many want we would like to satisfy at any given point in time which we may not be able to meet up with due to economic problems scales of preference simple is setting our needs inorder of priority.Scale of preference and choice is a must in a world that is faced with a scarcity of resources. This scarcity is man-made because I think nature gave enough resources to each nation. But greed and materialism have made some people control these resources using the instrument of government or businesses connected to the government. These set of people make laws that will favor them and their cronies to enable them to have more access to financial power. An example is the intentional acts of the government of my nation to frustrate the businesses of other entrepreneurs because they want the business of their financiers to enjoy a monopoly. For one to survive in this world currently, financial planning is a topmost priority, except if you want to live on credit and loans.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ancafe",
      "created_time": "April 16, 2023, 04:44:03 PM",
      "body": "Quote from: dewilliams on April 16, 2023, 08:56:41 AMThe resources needed to satisfy all the want of human being are said not to be enough compared to all the want of humans we have many want we would like to satisfy at any given point in time which we may not be able to meet up with due to economic problems scales of preference simple is setting our needs inorder of priority.The order of priority will depend on the position of different people, if you ask me about this priority, then the definite answer is meeting enough needs, paying for children's education, investing according to ability and having a little savings for urgent needs. That's why I would say there is a lot of difference when it comes to managing needs and ultimately spending money as a form of planning rather than fulfilling a lifestyle. A simple preference scale is to arrange our needs in order of priority, but everyone's priorities will be different and never the same in terms of arranging needs.If people know the level of priority needed, then that person must have a pattern in managing finances and most people are stuck with an excessive lifestyle that doesn't adjust to abilities, that's why financial chaos is getting more complicated and difficult to control.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "April 16, 2023, 06:21:53 PM",
      "body": "Quote from: mvdheuvel1983 on April 16, 2023, 02:32:16 PMI think life is very simple but humans complicate it with endless unimportant pseudo-need-priority like need. And it goes on and on to create more scarcity of resources to satisfy our psuedo-need. Granted there are real needs and wants but they seem far from achievable because of too many economic problems.But in reality, it is either we get one or the other. It is a trade. A trade - the most urgent need to the least urgent.In doing so,we are making choices and setting priorities in allocating limited resources to satisfy unlimited wants and needs.By doing this, we are choosing and establishing priorities in the allocation of finite resources to meet infinite wants and requirements.The angle of Thomas Hobbes in the lawlessness of human desire is also a key factor not to undermine the usefulness of law in the need and desire of human. There is the aspect of human wants that I think law has curtail in regards to how people would desire to live their lives and treat other people. Left for human crude nature, some desires and want may be weigh out of board. Some certain cultures may have been sustained if not for abolishment through law. There is also a place of modernity in the scheme of things to the rise in the human wants. During the medieval period where the economic sustainability of the society was majorly built on trade by barter, I think these wants were suppressed not that they didn't exist.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 16, 2023, 06:32:18 PM",
      "body": "Resources are scarce and that's why there have been conspiracies about reducing the world's population for the rest of the number will have enough resources for everybody.The thought and process of our minds thinking that we've got enough resources because of our situation and if we're in a better one then that's good for us. It's because not everybody is having fortunate things in life and that can be seen that there's a scarcity of resources because even for basic needs and necessities, there goes a lack for those unfortunate people given the situation of their lives. But we don't go stop from there because it's a discussion that will get a lot of good points being the actuality of it and then the meaning of opposing thoughts about it proving that everyone has a valid point. On the early days, there have been explorations and expeditions made by those great travelers through the seas and I agree on HB that soon, we'll go travel and get resources outside the Earth and getting those materials and new discoveries through the other planets. It has all started several decades ago but it won't stop there and we're not even close to an inch of that discovery because the universe is vast.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "April 16, 2023, 08:07:44 PM",
      "body": "Quote from: hugeblack on April 16, 2023, 12:10:38 PMI do not think that this saying is correct. When our requirements were primitive... so the next wealth may be close or even outside the planet. I also do not agree that your saying is true (no offense) because there are three types of people in the world, they belong to high, middle and lower class. The people of high class face no problems in availability of any needed resources like USA, Saudi Arabia etc. Why? Understand this with an example of electricity. There is 24 hours availability of electricity in both countries but middle class countries face 6 hour outage of electricity while the lower once face 12 hours outage of electricity isn't it a big difference between the availability of a resource \"electricity\"?Yeah there is no doubt in saying that necessity is the mother of invention. As the invention occurred then there comes some people who try to control that resources accordingly. The last that might be true, as I have heard scientist have found a \"Golden Asteroid\" in space which contains $10,000 quadrillion worth of assets in Gold, Nickel and Iron.(source). Quote from: CarnagexD on April 16, 2023, 01:00:54 PMwhat else can we discover. I just wish it is not another virus. I don't think viruses are any type of discoveries instead they are inventions of bio-scientists. One thing i had heard a lot that, the chances of atomic war is zero because the next war is going to be the bio war (war of chemicals). COVID-19 was just an example. I also hope this comes to an end soon. Ameen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "April 16, 2023, 08:25:20 PM",
      "body": "a person's wants always grow whenever he has the capacity to pay for them. this is just an example though but let's say a person works as a railway constructor, his money can only afford a burger and a bottle of water for a meal. but after a while, his boss raises his salary for being punctual. now he can afford a burger and a soda and a cigar. while a cigar and soda are not really necessary like he needs them but because he wants them, he buys them. this is what i think OP means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "April 16, 2023, 09:02:42 PMLast edit: April 20, 2023, 12:39:00 AM by usekevin",
      "body": "The economic impact will leads to the economic crisis.This economic crisis is not the new concept,we had faced the lot economic crisis during Covid 19.The best way to target the economic crisis by make some savings before the COVID started again.The person who earn more money can afford many things,but the people who afford less money will earn less money is the reason.To satisfy one need,he need to multiply his income by different manner.When the money was raised,he can use that money to multiply by resources like share market.Then inverse in cryptocurrency to know the exact value of crypto currency trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 19, 2023, 12:08:22 PM",
      "body": "Quote from: Alpha Marine on April 16, 2023, 01:23:38 PMI guess what OP is trying to say is that \"human wants are insatiable\". Since resources are limited and scarce we should have a scale of preference is the only way to make sure the resources we have available are enough for us.  Your words are correct, but there are always sufficient resources to cover those desires, as the increase in desires means that there is a demand, and therefore ideas are generated to meet that demand.Thus, even if the resources are scarce, there are enough ideas to convert untapped resources into materials fit for human use.Let us take an example of water desalination. In the past, people relied on rain water and rivers, but the increase in population density forced them to desalinate sea water until the waste water was reused.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "April 19, 2023, 02:17:20 PM",
      "body": "Not all of our needs are met by the majority of people, often the only needs we meet always depend on the budget we only have, and when there is too much, the things that we can tolerate not taking first are done and tolerated first let's       But of course, sometimes because we want to get what we think we need even if our budget is tight, we make it a way just to get it. Because we are determined to make it happen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Supreemo",
      "created_time": "April 19, 2023, 03:44:01 PM",
      "body": "Quote from: hugeblack on April 19, 2023, 12:08:22 PMQuote from: Alpha Marine on April 16, 2023, 01:23:38 PMI guess what OP is trying to say is that \"human wants are insatiable\". Since resources are limited and scarce we should have a scale of preference is the only way to make sure the resources we have available are enough for us.  Your words are correct, but there are always sufficient resources to cover those desires, as the increase in desires means that there is a demand, and therefore ideas are generated to meet that demand.Thus, even if the resources are scarce, there are enough ideas to convert untapped resources into materials fit for human use.Let us take an example of water desalination. In the past, people relied on rain water and rivers, but the increase in population density forced them to desalinate sea water until the waste water was reused.how do we utilize those resources available would be an exact term for that. even if we do have lots of resources at hand but we didn't know how to create demand, what's the use of all those things right? this is also the reason why we have this word called \"serendipity\", since mostly not all solutions came from resolving problems, there are even some that was created by accident.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "April 19, 2023, 05:21:07 PM",
      "body": "I don't think it's that simple. I do agree that needs should be prioritized, and in terms of what we need, we have plenty to cover various worst global issues, such as basic food, housing, minimal resources to live a decent life. Humanity produces enough, but the distribution is so wild and ridiculous that millions are still dying from hunger and there are lots of homeless people. As for the wants, I suppose there's never enough to satisfy the total wants in the sense that there are always some people that simply want too much, but there's also this aspect that with many cases, people don't know what they'll want in case something is created. I guess it's a point similar to what hugeblack is saying in the thread.For example, nobody in 1950s wanted to be a TikTok influencer (because there was no Internet, no social media, no market for all this), whereas now it's a thing that many people want. But while our resources are growing, and sometimes new products create new demand (not just the other way around), the wants probably outweigh the resources, but that's just because humanity needs to work on the wants.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bosede1",
      "created_time": "April 19, 2023, 05:31:24 PM",
      "body": "Humans are irrational beings. We have unlimited wants and the resources available to cater to them are limited. That is why the scale of preference comes in to make sure you use the available resources for your most pressing need.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}