{
  "id": "topic_5475517",
  "title": "1Dq",
  "author": "1Dq",
  "created_time": "November 25, 2023, 10:27:02 PM",
  "content": "Hello!I've mostly been active in Collectibles part of Bitcoin forum's Marketplace, but I wanted to mention this opportunity here as well.I've been a crypto artist since 2017 working mostly on well conceptualized and neatly crafted acrylic pieces. I had a set price on all of them until this November, when I decided to put some of them on auction for much lower prices.Selling these will help me gain more time and material for painting more crypto-related art. As simple as that.These are the auction threads and they'll end in almost exactly four days from posting this (00:00 CET, Thursday, November 30th)Bitcoaster: https://bitcointalk.org/index.php?topic=5472614.0The Bitcoin Miner: https://bitcointalk.org/index.php?topic=5473099.0Etheria: https://bitcointalk.org/index.php?topic=5472822.0Egging on the Future: https://bitcointalk.org/index.php?topic=5472359.0It's been a while since I made these paintings, 5 years or so. They were made in another phase of Bitcoin - it was 2018 and we felt the depression after the big growth of autumn, 2017.I painted the hype and promise of Bitcoin we felt then and I fought depression with everything I had. Using real gold leafs for Bitcoin, I made it obvious this had real value.I painted the rollercoaster guy in three variants to show how fun and free this new crypto world feels. I painted Andreas Antonopoulos as majestic prophet of upcoming technology and Vitalik Buterin as a centerpiece of his world of Etheria.The Bitcoin Miner showed the world a new type of worker personality and how much effort went and still goes into Bitcoin existing.And I painted Cryptoglyphs, a monument to Bitcoin's technology visualizing how exactly it works:https://bitcointalk.org/index.php?topic=5065782I'll be happy if you make some noise about my auctions.If you bid on my artwork, it'll make my day. Also, any comments and advice will be much appreciated and helpful.Cheers!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5475517",
  "comments": []
}