{
  "id": "topic_5466234",
  "title": "tg88",
  "author": "tg88",
  "created_time": "September 09, 2023, 05:12:44 PM",
  "content": "É impressionante como a Tether ganhou força nos últimos tempos, nesta semana anunciaram que estão ocupando o número 22 na lista de maiores detentores de títulos do tesouro dos EUA com 72,5 bilhões comprados. Já ultrapassa as reservas de países como Espanha, Austrália e México.Desse jeito fica complicado a SEC afirmar que o colateral deles é de baixa confiabilidade.  Ardoino, diz que a Tether agora é uma das principais compradoras de títulos do Tesouro dos EUA e detém US$ 72,5 bilhões",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5466234",
  "comments": [
    {
      "author": "Paredao",
      "created_time": "September 09, 2023, 07:56:57 PM",
      "body": "Vai ver que nem a SEC confia nos títulos da divida pública norte-americana. Brincadeiras a parte, tem alguma empresa séria de auditoria que já realizou a comprovação de tudo isso, ou fica só no blá blá blá do Ardoino no Twitter ? Eu quero ver empresas sérias de auditoria atestando a veracidade de tudo isso. Quero ver as garantias.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 09, 2023, 08:16:23 PM",
      "body": "Quote from: Paredao on September 09, 2023, 07:56:57 PMVai ver que nem a SEC confia nos títulos da divida pública norte-americana. Brincadeiras a parte, tem alguma empresa séria de auditoria que já realizou a comprovação de tudo isso, ou fica só no blá blá blá do Ardoino no Twitter ? Eu quero ver empresas sérias de auditoria atestando a veracidade de tudo isso. Quero ver as garantias.Tem os relatórios de atestação que agora parecem ser realizados pela BDO, uma das big fives (exatamente a quinta maior firma de contabilidade do mundo).https://assets.ctfassets.net/vyse88cgwfbl/63oJePOHqIvrcnXWMPZ1M0/4cfaf2e7cdf80c30b17fdc70faaf741f/ESO.03.01_Std_ISAE_3000R_Opinion_30-06-2023_BDO_Tether_CRR.pdfSeria o suficiente para você?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 09, 2023, 08:16:27 PM",
      "body": "Quote from: Paredao on September 09, 2023, 07:56:57 PMVai ver que nem a SEC confia nos títulos da divida pública norte-americana. Brincadeiras a parte, tem alguma empresa séria de auditoria que já realizou a comprovação de tudo isso, ou fica só no blá blá blá do Ardoino no Twitter ? Eu quero ver empresas sérias de auditoria atestando a veracidade de tudo isso. Quero ver as garantias.Quem faz a auditoria da Tether atualment é a BDO, aqui nessa seção do site dá pra ter acesso aos relatórios mensais que a BDO emite: https://tether.to/en/transparency/#reportsO último foi de 30 de junho, pelo que vi eles são bem simples e já vi a BDO comentando que não são como balanços comerciais como de empresas listadas na bolsa que costumamos ver... É algo bem mais simples. Até se puder dar uma olhada e dar uma opinião seria interessante. OBS: Não tinha visto que o Ninja tinha sido mais rápido que eu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "September 09, 2023, 09:19:46 PM",
      "body": "Também acho impressionante como a Tether foi adquirindo esses títulos aos poucos e se tornou agora uma grande detentora  Há pouquíssimos anos estavam discutindo quando a tether iria ruir, que iria prejudicar todo o mercado, e o que aconteceu foi que várias outras tiveram problemas e a tether ficou aí, firme e se fortalecendo.Era tudo meio obscuro, tinham vários ativos duvidosos e ninguém conseguia garantir uma auditoria de confiança, mas pelo menos agora é uma stable mais segura e não dá sinais que terão problemas tão cedo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 10, 2023, 06:56:07 PM",
      "body": "Quote from: tg88 on September 09, 2023, 05:12:44 PMÉ impressionante como a Tether ganhou força nos últimos tempos, nesta semana anunciaram que estão ocupando o número 22 na lista de maiores detentores de títulos do tesouro dos EUA com 72,5 bilhões comprados. Já ultrapassa as reservas de países como Espanha, Austrália e México.Desse jeito fica complicado a SEC afirmar que o colateral deles é de baixa confiabilidade.  Esta tem sido a estratégia de muitos empresas e identidades... comprar títulos do tesouro e divida dos EUA. Normalmente ao fazerem isso, ganham algum poder negocial, para conseguirem operar minimamente a vontade.  A China é um pequeno exemplo disso. Podem inventar umas sanções, mas no final fica quase tudo na mesma. A China tem muita divida comprada, aos EUA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 10, 2023, 07:17:02 PM",
      "body": "Quote from: joker_josue on September 10, 2023, 06:56:07 PMEsta tem sido a estratégia de muitos empresas e identidades... comprar títulos do tesouro e divida dos EUA. Normalmente ao fazerem isso, ganham algum poder negocial, para conseguirem operar minimamente a vontade.  A China é um pequeno exemplo disso. Podem inventar umas sanções, mas no final fica quase tudo na mesma. A China tem muita divida comprada, aos EUA. Os maiores detentores de títulos da dívida dos EUA são China e Japão mas nos últimos anos alguns países tem desacelerado as compras, principalmente a China que ano após ano faz cortes consideráveis na participação, tanto é que deixou de ser o top1 ainda em 2022 e reduziu ainda mais partiipação agora em 2023. Eles estão focando mais em reservas de ouro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 10, 2023, 07:25:05 PM",
      "body": "Quote from: tg88 on September 09, 2023, 05:12:44 PMÉ impressionante como a Tether ganhou força nos últimos tempos, nesta semana anunciaram que estão ocupando o número 22 na lista de maiores detentores de títulos do tesouro dos EUA com 72,5 bilhões comprados. Já ultrapassa as reservas de países como Espanha, Austrália e México.Desse jeito fica complicado a SEC afirmar que o colateral deles é de baixa confiabilidade.  Ardoino, diz que a Tether agora é uma das principais compradoras de títulos do Tesouro dos EUA e detém US$ 72,5 bilhõesAchei esse gráfico bem interessante de quais países mais possuem os papéis de dívidas dos EUAhttps://www.visualcapitalist.com/which-countries-hold-the-most-us-debt/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "September 10, 2023, 08:34:18 PM",
      "body": "Quote from: TryNinja on September 09, 2023, 08:16:23 PMSeria o suficiente para você? Para mim está ótimo. É que as vezes a SEC ( U.S. Securities and Exchange Commission ) costuma pegar no pé de algumas empresas de auditoria. A BDO foi uma delas que a SEC deu uma investigada: https://valor.globo.com/empresas/noticia/2022/05/20/investigao-da-sec-ameaa-negcios-das-auditorias.ghtml",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 10, 2023, 11:01:20 PM",
      "body": "Quote from: Paredao on September 10, 2023, 08:34:18 PMQuote from: TryNinja on September 09, 2023, 08:16:23 PMSeria o suficiente para você? Para mim está ótimo. É que as vezes a SEC ( U.S. Securities and Exchange Commission ) costuma pegar no pé de algumas empresas de auditoria. A BDO foi uma delas que a SEC deu uma investigada: https://valor.globo.com/empresas/noticia/2022/05/20/investigao-da-sec-ameaa-negcios-das-auditorias.ghtmlA PwC, que é uma big four, também era auditora das Americanas pré-colapso. A verdade é que ninguém garante nada e a qualquer momento qualquer empresa pode quebrar enquanto é pega mentindo os seus números. Porém antes uma BDO do que nada ou uma firma aleatória de fachada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "September 11, 2023, 12:15:46 AM",
      "body": "Quote from: TryNinja on September 09, 2023, 08:16:23 PMTem os relatórios de atestação que agora parecem ser realizados pela BDO, uma das big fives (exatamente a quinta maior firma de contabilidade do mundo).https://assets.ctfassets.net/vyse88cgwfbl/63oJePOHqIvrcnXWMPZ1M0/4cfaf2e7cdf80c30b17fdc70faaf741f/ESO.03.01_Std_ISAE_3000R_Opinion_30-06-2023_BDO_Tether_CRR.pdfSeria o suficiente para você? Respondo pelo @Paredao....Certamente já não dá mais pra simplesmente luvantar rumores e contestar as auditorias da Tether e o USDT. Porém, acreditar em uma auditoria e confiar plenamente neles é outra história.Na verdade hoje em dia nem do Dólar eu confio mais Em todo caso, por mais que tanto falem que a economia dos EUA está indo pro saco, talvéz realmente seja apenas mais um momento de crise que se a proxima, mas não necessariamente o fim.Ainda assim, eu fico longe do USDT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "September 12, 2023, 04:59:10 PM",
      "body": "Em mais uma reviravolta, em que Circle se dá mal na disputa contra Tether, uma pesquisa feita pelo S&P Global analisou 5 stablecoin  e mostrou que USDC e o DAI são mais propensos à instabilidade quando comparados à USDT.A análise revelou que o USDC e o DAI passaram mais tempo cotadas abaixo de um dólar do que o USDT e o BUSD nos últimos dois anos. Claro que os dados são afetados pelo evento de desindexação que o USDC viveu quanto rolou a queda dos Bancos dos EUA. Mas ainda assim, acho significativo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}