{
  "id": "topic_5436955",
  "title": "Vyeon11",
  "author": "Vyeon11",
  "created_time": "January 27, 2023, 03:00:51 AMLast edit: January 27, 2023, 06:29:29 AM by Vyeon11",
  "content": "Tampaknya industri kripto perlahan-lahan mulai pulih kembali,setelah kejadian FTX yang menggemparkan dunia kripto dan menjadikan tahun kemarin adalah tahun terburuk kripto.Setelah kejadian itu usai beberapa blockchain membuat kemajuan dalam hal pengembangan.Menurut data terbaru dari firma crypto-analytic sentiment polkadot dan kusama memimpin dengan komitmen github selama 30 hari terakhir.kedua jaringan memiliki skor yang sama yaitu 441,5.Selain itu cardano,decentraland dan status mengikuti di belakang,meraih lima besar aktivitas.Etherum saat ini hanya di posisi sembilan setelah menjadi blockchain dengan pengembang paling aktif di tahun 2022.Itu di belakang jaringan seperti cosmos dan filecoin dan internet computer.Tahun ini mungkin akan menjadi awal kebangkitan kripto,setelah tahun 2022 yang lumayan suram.pertanyaan sayaApakah berinvetasi di polkadot masih dianggap layak?Sumber baca selengkapnya berita terbaru kripto",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436955",
  "comments": [
    {
      "author": "MAAManda",
      "created_time": "January 27, 2023, 02:12:42 PM",
      "body": "Saya tidak tahu apakah postingan ini bisa dikategorikan sebagai plagiasi atau tidak, pasalnya ada beberapa poin yang jika di translasikan dari artikel aslinya akan menghasilkan narasi yang ada pada postingan yang dibuat. Selain itu, kecacatan juga terjadi pada judul, arah pembahasan dan juga pertanyaan.Untuk menilai layak atau tidaknya berinvestasi pada suatu proyek, tentu kita harus mempertimbangkan beberapa hal, maksud saya, jangan mengambil satu acuan (tentang Github) saja. Ada banyak cara untuk menilai layak atau tidaknya sebuah proyek untuk di investasikan.Jika pertanyaannya adalah:Quote from: Vyeon11 on January 27, 2023, 03:00:51 AMApakah berinvetasi di polkadot masih dianggap layak?Maka jawabannya adalah sangat layak, di kaji dari berbagai aspek seperti komunitas, progress pengembangan (yang dibahas pada OP) dan juga MC dari $DOT saat ini. Menurut saya akan lebih bijak kalau OP membuat postingan dengan subjek yang berbeda, seperti contoh-nya token-token lowcap yang membutuhkan bahasan lanjutan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bbigtart",
      "created_time": "January 27, 2023, 02:57:30 PM",
      "body": "Quote from: Vyeon11 on January 27, 2023, 03:00:51 AMpertanyaan sayaApakah berinvetasi di polkadot masih dianggap layak?Saya pikir sangat layak, karena blockchain Polkadot berfokus pada interoperabilitas dan skalabilitas. Selain itu juga salah satu faktor kalau menurut saya layak karena Gavin Wood, dia itu adalah bekas salah satu pendiri Ethereum. Dengan kapitalisasi pasar yang sangat baik dan potensi yang sangat besar apalagi Polkadot sekarang no 12 di coinmarketcap Polkadot layak untuk dipertimbangkan sebagai investasi yang bagus untuk tahun 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Vyeon11",
      "created_time": "January 27, 2023, 03:04:09 PM",
      "body": "Quote from: MAAManda on January 27, 2023, 02:12:42 PMSaya tidak tahu apakah postingan ini bisa dikategorikan sebagai plagiasi atau tidak, pasalnya ada beberapa poin yang jika di translasikan dari artikel aslinya akan menghasilkan narasi yang ada pada postingan yang dibuat. Selain itu, kecacatan juga terjadi pada judul, arah pembahasan dan juga pertanyaan.Untuk menilai layak atau tidaknya berinvestasi pada suatu proyek, tentu kita harus mempertimbangkan beberapa hal, maksud saya, jangan mengambil satu acuan (tentang Github) saja. Ada banyak cara untuk menilai layak atau tidaknya sebuah proyek untuk di investasikan.Jika pertanyaannya adalah:Quote from: Vyeon11 on January 27, 2023, 03:00:51 AMApakah berinvetasi di polkadot masih dianggap layak?Maka jawabannya adalah sangat layak, di kaji dari berbagai aspek seperti komunitas, progress pengembangan (yang dibahas pada OP) dan juga MC dari $DOT saat ini. Menurut saya akan lebih bijak kalau OP membuat postingan dengan subjek yang berbeda, seperti contoh-nya token-token lowcap yang membutuhkan bahasan lanjutan.Masukan yang sangat berguna bagi saya,saya masih pemula dan masih belum bagus dalam merangkai kata,jika di sebut plagiat itu mungkin bisa saja dikategorikan,tapi saya tidak mengkopi paste dari situs web,awalnya saya hanya membaca situs web tersebut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "January 28, 2023, 01:48:25 PM",
      "body": "Quote from: Vyeon11 on January 27, 2023, 03:04:09 PMsaya masih pemula dan masih belum bagus dalam merangkai kata,jika di sebut plagiat itu mungkin bisa saja dikategorikan,tapi saya tidak mengkopi paste dari situs web,awalnya saya hanya membaca situs web tersebut.Kalau agan mengambil post dari artikel, tinggal quote/saling artikel itu di thread ini dan cantumkan rujukan/linknya di bawah. Kalau agan belum tahu, plagiasi/copas/menyalin translasi pake mesin seperti Google bisa melanggar rules forum. Coba cek rule forum di main board Bahasa Indo untuk lebih jelasnya. CMIIW.Terkait pertanyaan yang diberikan, saya menambahkan apa yang dijelaskan agan manda. Aktivitas GitHub itu bisa menipu. Developer bisa saja menghapus beberapa line lalu menambahkannya lagi (bukan berarti dev Polka dan Kusama melakukan hal ini lo, kan bisa dicek). Bisa juga kode yang sudah dikembahkan belum di push ke source utama, dan masih berada di fork masing\" kontributornya. Saya merasa hype market/produk yang dilaunch/bakal dilaunch jauh lebih mendorong harga di market saat ini. Silakan diriset apakah ada perkembangan di segi marketing dan produk ke depannya atau tidak, baru memutuskan beli untuk short-term atau jangka panjang, atau tidak sama sekali.Quote from: bbigtart on January 27, 2023, 02:57:30 PMSaya pikir sangat layak, karena blockchain Polkadot berfokus pada interoperabilitas dan skalabilitas. Perlu diingat bahwa Polka bukan satu\"nya proyek yang berusaha mengatasi masalah tersebut. Kompetitor lain seperti Solana, Harmony dst juga masih ada di market saat ini. Sulit untuk menilai mereka semua bakal bertahan sampai 5-10 tahun ke depan hanya karena menjual solusi di bidang skalabilitas dst, terlebih Ethereum juga mulai fokus ke masalah tersebut. So, jangan lupa DYOR/DWYOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tumanggor",
      "created_time": "January 29, 2023, 06:29:08 PM",
      "body": "Quote from: joniboini on January 28, 2023, 01:48:25 PMQuote from: bbigtart on January 27, 2023, 02:57:30 PMSaya pikir sangat layak, karena blockchain Polkadot berfokus pada interoperabilitas dan skalabilitas. Perlu diingat bahwa Polka bukan satu\"nya proyek yang berusaha mengatasi masalah tersebut. Kompetitor lain seperti Solana, Harmony dst juga masih ada di market saat ini. Sulit untuk menilai mereka semua bakal bertahan sampai 5-10 tahun ke depan hanya karena menjual solusi di bidang skalabilitas dst, terlebih Ethereum juga mulai fokus ke masalah tersebut. So, jangan lupa DYOR/DWYOR.saya juga berpikir demikian gan, pusing juga kalo mau membandingkan mana proyek potensial yang bisa bertahan ampe 10 tahun ke depan antara polkadot, solana, harmony dan kusamamengenai ethereum yang mulai fokus ke skalabilitas, apakah ini adalah upgrade mereka pada ethereum yang sekarang (bukan ethPOW) karena saya masih baru denger tentang hal ini",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MAAManda",
      "created_time": "January 30, 2023, 05:31:28 AM",
      "body": "Quote from: joniboini on January 28, 2023, 01:48:25 PMPerlu diingat bahwa Polka bukan satu\"nya proyek yang berusaha mengatasi masalah tersebut. Kompetitor lain seperti Solana, Harmony dst juga masih ada di market saat ini. Sulit untuk menilai mereka semua bakal bertahan sampai 5-10 tahun ke depan hanya karena menjual solusi di bidang skalabilitas dst, terlebih Ethereum juga mulai fokus ke masalah tersebut. So, jangan lupa DYOR/DWYOR.Yap, Polkadot bukan satu-satunya proyek yang berusaha untuk mengatasi masalah trilema pada blockchain khususnya tentang skalabilitas, tetapi mereka adalah proyek yang paling memberikan harapan besar, pasalnya pada artikel Binance disebutkan kalau Polkadot berencana akan meng-upgrade blockchain mereka agar bisa mencapai 100K - 1M TPS.Referensi:[1] Binance (2022, 28 September). Diakses pada 30 Januari 2023, dari https://www.binance.com/en/news/top/7218201Quote from: Tumanggor on January 29, 2023, 06:29:08 PMmengenai ethereum yang mulai fokus ke skalabilitas, apakah ini adalah upgrade mereka pada ethereum yang sekarang (bukan ethPOW) karena saya masih baru denger tentang hal iniNjir, jadi ente selama ini ngapain om di forum ini? , padahal diskusi terkait Ethereum yang bermigrasi dari PoW ke PoS menjadi perbincangan hangat di jagat kripto, sempat jadi bahasan juga di board Altcoins (Bahasa Indonesia). Perpindahan dari PoW ke PoS memiliki latar belakang salah satunya adalah tentang skalabilitas, yang mana ketika sudah beralih ke PoS, jaringan tidak akan bergantung kepada miners lagi untuk memvalidasi transaksi, melainkan kepada validators.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "February 01, 2023, 04:35:56 AM",
      "body": "Quote from: MAAManda on January 27, 2023, 02:12:42 PMSaya tidak tahu apakah postingan ini bisa dikategorikan sebagai plagiasi atau tidak, pasalnya ada beberapa poin yang jika di translasikan dari artikel aslinya akan menghasilkan narasi yang ada pada postingan yang dibuat. Selain itu, kecacatan juga terjadi pada judul, arah pembahasan dan juga pertanyaan.Benar, saya juga merasa demikian. Setelah membuka referensi yang terlampir di OP, saya menemukan isinya hampir sama dengan artikel aslinya.Untung saja Op sempat menyertakan sumber asli di akhir topik, meski sebagian kata-kata diambil dari sumber aslinya tidak bisa dikatagorikan Plagiarisme sepenuhnya.Op, kalau ada bagian yang anda kutip dari sumber lain, sebaiknya anda menggunakan format seperti yang ada dibawah ini untuk mencegah tuduhan Plagiarisme.Quote~~Terkait pertanyaan Apakah masih layak berinvetasi di polkadot dan kusama, tergantung selera masing-masing. Anda dapat berinvestasi di manapun yang anda suka setelah melakukan riset pribadi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blue Snow",
      "created_time": "February 05, 2023, 02:08:51 AM",
      "body": "Quote from: Vyeon11 on January 27, 2023, 03:00:51 AMApakah berinvetasi di polkadot masih dianggap layak?DOT termasuk ke dalam top 15 coin market cap, kalau menurut ane sih cukup layak, tapi chartnya sekilas ane lihat kok ndak jauh juga dari btc sehingga kalau mau invest chart yang sama mending ke btc aja sekalian. Karena pada intinya, investasi ke altcoin itu untuk mendapatkan untung berkali-kali lipat dari dampak bullrannya btc. kalau sama saja sih, ya beresiko. Mending ke coin-coin yang mau hype sekarang ini atau ke Doge sekalian. Karena kalau mengharapkan keajaiban, takutnya kayak XRP, kena PHP, dan malah ketinggalan kereta lain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "February 06, 2023, 04:08:48 AM",
      "body": "Quote from: blue Snow on February 05, 2023, 02:08:51 AMQuote from: Vyeon11 on January 27, 2023, 03:00:51 AMApakah berinvetasi di polkadot masih dianggap layak?DOT termasuk ke dalam top 15 coin market cap, kalau menurut ane sih cukup layak, tapi chartnya sekilas ane lihat kok ndak jauh juga dari btc sehingga kalau mau invest chart yang sama mending ke btc aja sekalian. Karena pada intinya, investasi ke altcoin itu untuk mendapatkan untung berkali-kali lipat dari dampak bullrannya btc. kalau sama saja sih, ya beresiko. Mending ke coin-coin yang mau hype sekarang ini atau ke Doge sekalian. Karena kalau mengharapkan keajaiban, takutnya kayak XRP, kena PHP, dan malah ketinggalan kereta lain.Jika merujuk pada judul Thread, saran ini harus dipertimbangkan Op, Bitcoin lebih aman dari Dot meskipun dari riwayat chartnya masih sangat layak. Kalau saya sih lebih memilih pelan asal selamat, tapi kalau mau cepat harus siap dengan segala resiko karena potensi sampai ke tujuan sangat kecil. Investasi di Altcoin memang berpotensi meraup untung berkali-kali lipat, tapi resikonya pun sangat parah, perlu diperhatikan juga potensi profit besar sejalan dengan resiko yang akan didapat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "derihendra",
      "created_time": "April 22, 2024, 06:34:15 AM",
      "body": "Saya rasa masih layak untuk inves ke polkadot dan kusama, karena proyek nya bagus, jaringan nya pun bagus, memiliki banyak market dan memiliki volume perdagangan yang bagus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wildwest",
      "created_time": "May 20, 2024, 09:57:05 AM",
      "body": "Quote from: Vyeon11 on January 27, 2023, 03:00:51 AMTampaknya industri kripto perlahan-lahan mulai pulih kembali,setelah kejadian FTX yang menggemparkan dunia kripto dan menjadikan tahun kemarin adalah tahun terburuk kripto.Setelah kejadian itu usai beberapa blockchain membuat kemajuan dalam hal pengembangan.Menurut data terbaru dari firma crypto-analytic sentiment polkadot dan kusama memimpin dengan komitmen github selama 30 hari terakhir.kedua jaringan memiliki skor yang sama yaitu 441,5.Selain itu cardano,decentraland dan status mengikuti di belakang,meraih lima besar aktivitas.Etherum saat ini hanya di posisi sembilan setelah menjadi blockchain dengan pengembang paling aktif di tahun 2022.Itu di belakang jaringan seperti cosmos dan filecoin dan internet computer.Tahun ini mungkin akan menjadi awal kebangkitan kripto,setelah tahun 2022 yang lumayan suram.pertanyaan sayaApakah berinvetasi di polkadot masih dianggap layak?Sumber baca selengkapnya berita terbaru kriptoHarapan yang kita tunggu sudah mulai nampak pada ruang crypto setelah sekian lama terjun bebas, kini pasar crypto mulai pulih kembali dengan harapan akan membuat kejutan baru pada tahun ini. Setelah saya membaca tread ini Polkadot salah satu altcoin yang punya kualitas bagus di dalam beberapa market perdagangan, setiap investasi di altcoin kita perlu mempertimbangkan dengan resiko setelah membeli coin. Agar lebih aman investasi pilih bitcoin dan ethereum agar resiko tidak terlalu besar, semua tergantung pada kita sendiri dimana yang lebih nyaman berinvestasi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "derihendra",
      "created_time": "July 02, 2024, 09:43:53 AM",
      "body": "Saya melihat polkadot ataupun kusama lumayan bagus, tapi yang nama nya crypto kita tidak tahu, apakah itu akan bertahan di masa depan atau tidak, berhati hatilah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}