{
  "id": "topic_5452834",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "May 15, 2023, 05:26:38 PM",
  "content": "Finally some great news from the US. The democrats are working hard to protect us all from risky crypto investments. They'll happily create a crypto market crash and make investors lose money in order to prevent them from losing money. Good to know there are politicians out there working tirelessly to protect the little people from themselves.\"Leak Reveals Secret Democratic Plan For A Game-Changing U.S. Crypto Crackdown That Could Hit The Price Of Bitcoin And Ethereum\"https://www.forbes.com/sites/digital-assets/2023/05/14/leak-reveals-secret-democrat-plan-for-a-game-changing-us-crypto-crackdown-that-could-hit-the-price-of-bitcoin-and-ethereum/?sh=51e6dfd1358dQuoteNow, a leaked memo circulated to Democratic House financial services committee members has revealed the \"key messages\" lawmakers were told to stick to that could see almost all cryptocurrencies categorized as securities....The document, passed to committee members by the Democratic party ahead of Wednesday’s joint House hearing on crypto policy, was leaked by Fox Business reporter Eleanor Terrett on Twitter. \"The problem isn’t ambiguity—it’s mass non-compliance with existing laws,\" the memo reads. \"We can't invent new accommodating regulatory structures simply because crypto companies refuse to follow clear rules of the road.\"The memo calls on Democratic lawmakers to push back on Republican claims \"they are working to provide clarity to the markets by carving out space for the Commodity Futures Trading Commission (CFTC) in crypto\" ... \"Republicans are proving that they really aren't serious about protecting investors and consumers.\"So in summary, just a further confirmation of the US gov's crackdown on crypto.Any thought on how would that unfold?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452834",
  "comments": [
    {
      "author": "Ojima-ojo",
      "created_time": "May 15, 2023, 07:24:41 PM",
      "body": "Aside from the impact of crypto regulation on the value of bitcoin, I don't see any significant negative impact on bitcoin, only centralized altcoins will be affected by these US cryptocurrency regulations bills.The price of bitcoin has indeed struggled btw a price cycle that reflects heavy attacks on the market,  but bitcoin has always proven to be organic and regulators can not force Bitcoin to align with a regulatory framework that is mainly for the asset listen on the white paper of U.S cryptocurrency policy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "May 15, 2023, 07:43:54 PM",
      "body": "And who's going to protect them from the fiat crackdown? Seriously. Every day passing by without some reasonable treatment proposal for all the debt in the US decrements this little credibility left. Until when. At some point, it's mathematically inevitable to have no such confidence left. I am no hundred percent sure that my bitcoin investment will not disappoint me, but I'm very sure that at that point I will not want to have any fiat saved.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 15, 2023, 07:57:59 PM",
      "body": "What part of :Quote\"The problem isn’t ambiguity—it’s mass non-compliance with existing laws,\" the memo reads. \"We can't invent new accommodating regulatory structures simply because crypto companies refuse to follow clear rules of the road.\"did you miss when you assumed this is an all out attack on Bitcoin when it's obviously against crypto companies that ask all day for regulations to attract investors and when those come they do all possible to bypass them in order to play with people's money how they want like it's theirs?Let's bring the tinfoil hat although a regular hat might do just as good- Binance is in hot water in the US since , well, we all know what it did there and how they tried to avoid every possible regulation with a 0.2 sqm virtual office in Delaware- Forbes in which Binance poured $200m it fleeced out of its gullible customers comes regularly with a doomsday article on how regulations are bad for the price and the world will end if Binance is forced to flee the US.Quote from: pawel7777 on May 15, 2023, 05:26:38 PMThey'll happily create a crypto market crash and make investors lose money in order to prevent them from losing money. I thought that was what FTX has done!   Probably my memory is playing games with me but it wasn't either party fault that triggered that!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pixie85",
      "created_time": "May 15, 2023, 08:17:41 PM",
      "body": "I agree with the above. It's more likely they're targeting non-compliant exchanges and shitcoin pushing companies. Even the memo said that they want to classify almost all cryptocurrencies as securities, because, guess what, that's what they are!I'm a bitcoiner and I care how my bitcoin is classified and this is clearly a commodity according to the US gov. If they hit a few shitcoins, I'm not going to cry.If they make some pepe or shiba inu investors lose money I won't cry either.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "May 15, 2023, 10:22:21 PM",
      "body": "Quote from: pixie85 on May 15, 2023, 08:17:41 PMI agree with the above. It's more likely they're targeting non-compliant exchanges and shitcoin pushing companies. Even the memo said that they want to classify almost all cryptocurrencies as securities, because, guess what, that's what they are!Of course they are. And that will all be for the better. We have had enough troubles with scammers and bad actors in the world of centralized exchanges. People cannot be trusted and therefore need to be controlled. Regulated.Bitcoin has no use for trust and nobody needs to worry about a single bad actor ruining it for all of us. Because that simply cannot happen. And I think that is absolutely beautiful and exactly how money should be.scamcoins and scamming exchanges on the other hand... I think we have had more than enough of those and history will not look too kindly upon them. The ones who got duped will be the ones who serve as an example. Cruel as that sounds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "May 15, 2023, 11:22:30 PM",
      "body": "Quote from: pawel7777 on May 15, 2023, 05:26:38 PMThey'll happily create a crypto market crash and make investors lose money in order to prevent them from losing money. Good to know there are politicians out there working tirelessly to protect the little people from themselves.The coins that will crash because of government regulation deserve to fall, because it would mean that they are just ponzi schemes. I'm sure Bitcoin will not crash if exchanges will get more regulated, because Bitcoin itself is not being targeted and nothing about its fundamentals will change.This isn't the US government trying to kill crypto. If they wanted to do it, they would just ban all financial institutions from dealing with crypto exchanges and crypto market would be dead in the US.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 16, 2023, 12:31:42 AM",
      "body": "Why do they even have a hearing in the first place, It is a waste of time doing this since the lawmakers already have a mandate to just consider all securities including the stablecoin. It's all just a show. They've already decided, crypto companies should just go to the EU after all they have regulations in place there. I think it's what they want also.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "May 16, 2023, 01:17:53 AM",
      "body": "They will not succeed as there are Democratic and Republican Senators in the USA. If you watch the hearing and testimony of SEC Chair Gensler one month ago, you can see that SEC, Democratic Senators are unable to pull any regulations they want.They will be controlled by challenge from Republican Senators and their citizens. They can not hold the power and the White House forever and they will lose it after four years if they fail to satisfy their citizens.You can follow this Twitter: https://twitter.com/FinancialCmte from Financial Services GOP for more news and challenges against SEC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Similificator",
      "created_time": "May 17, 2023, 02:27:14 PM",
      "body": "If anything, this just confirms the popular speculation that the governments are really looking for ways to suppress the decentralized part of the crypto currency industry. Worse thing is that they have the perfect excuse and most of the people who don't know much would just blindly support this.Although it may be difficult to succeed with this, we cannot rule out the fact that there is still quite a bit of chance for the government to achieve what they want one way or another. And if it does happen, this industry would probably suffer a huge blow that may take it a couple of years if not decades to recover. In which I, of course, wish would never happen. Anyway, that's just what I think.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "May 17, 2023, 03:02:47 PM",
      "body": "I would agree with others stating the government is trying to suppress the price of Bitcoin and discourage adoption. Coinbase is currently fighting this fight for us to get clarity. The good news is that even with them timing their sales to create maximum damage and sabotaging the market every way they can… We are still here. For me that is a bullish sign.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "May 17, 2023, 06:42:39 PM",
      "body": "Quote from: OgNasty on May 17, 2023, 03:02:47 PMCoinbase is currently fighting this fight for us to get clarity.With no luck so far. They managed to get the court to force the SEC to respond to their petition but they got denied with SEC essentially telling them to f**ck off and that they'll take however long they want to clarify the rules.https://blockworks.co/news/sec-responds-to-coinbase-request-for-action-noQuoteIn its response, released Monday evening in New York, the SEC alleged Coinbase has no right to mandamus, which orders a government agency to fulfill certain duties. “Perhaps recognizing this, Coinbase instead asserts that this Court should compel the Commission to act on Coinbase’s recently filed rulemaking petition,” the SEC wrote in its response. “But no statute or regulation requires the Commission to take such action on a specific timeline.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "May 17, 2023, 07:44:37 PM",
      "body": "Quote from: pawel7777 on May 17, 2023, 06:42:39 PMQuote from: OgNasty on May 17, 2023, 03:02:47 PMCoinbase is currently fighting this fight for us to get clarity.With no luck so far. They managed to get the court to force the SEC to respond to their petition but they got denied with SEC essentially telling them to f**ck off and that they'll take however long they want to clarify the rules.https://blockworks.co/news/sec-responds-to-coinbase-request-for-action-noQuoteIn its response, released Monday evening in New York, the SEC alleged Coinbase has no right to mandamus, which orders a government agency to fulfill certain duties. “Perhaps recognizing this, Coinbase instead asserts that this Court should compel the Commission to act on Coinbase’s recently filed rulemaking petition,” the SEC wrote in its response. “But no statute or regulation requires the Commission to take such action on a specific timeline.”A despairing situation for crypto companies trying to look for a way to comply but the lack of clarity made compliance impossible.It's not good for the US to just watch what is happening in UK and EU, Dubai, and Hongkong this coming bull market while they are still discussing which one SEC or CFTC regulates the crypto market which none is even providing regulations.The positive thing that is happening though is that they are talking about crypto, and even having a joint hearing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "May 18, 2023, 04:18:46 AM",
      "body": "I expect they will eventually give up and simply accept the fait accompli that “Bitcoin exists” and cannot be ignored.I am surprised that instead of looking for feasible solutions to solve their economic problems such as inflation and recession and trying to replace this failed financial system, they continue to put pressure on Crypto and print more useless banknotes.Because of this stupid policy, things are starting to get out of the control of the US government and crypto companies are looking for more open countries. This has already happened as many exchanges and companies have moved their main centers to Dubai, for example.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 18, 2023, 10:15:32 AM",
      "body": "The strange thing is the positive interaction of Bitcoin with every news related to regulatory restrictions, which is something that has been going on during the past few months and was quite the opposite happening during the past years. Therefore, we may not see a major price correction, but rather optimism due to the loss of many investors of their money when FTX went bankrupt.Anyway, it's from Forbes, let's see confirmation of this news first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "May 18, 2023, 11:32:20 AM",
      "body": "\"First they ignore you, then they laugh at you, then they fight you, then you win” (Quote attributed to Nicholas Klein, I believe - commonly wrongly quoted as Gandhi).Which part do you think we’re in?Let them try & make it difficult for us. Bitcoin can not be stopped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "May 18, 2023, 06:16:02 PM",
      "body": "When they mean \"crackdown,\" assume that they mean it -- They won't be going after the large corporations because the corporations give money to these politicians (remember SBF paying off politicians through FTX user deposits, that was not an accident). They'll go after the ordinary citizens/small businesses that don't have access to the highly paid lawyers and accountants.QuoteThe memo calls on Democratic lawmakers to push back on Republican claims \"they are working to provide clarity to the markets by carving out space for the Commodity Futures Trading Commission (CFTC) in crypto\" ... \"Republicans are proving that they really aren't serious about protecting investors and consumers.\"They're so concerned about protecting investors and consumers, yet they so callously spend trillions of dollars systematically reducing purchasing power of investors and consumers forcing them to utilize other assets in the first place. I'm dubious of their claims given their track record.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "May 18, 2023, 11:23:52 PM",
      "body": "Quote from: pawel7777 on May 17, 2023, 06:42:39 PMQuote from: OgNasty on May 17, 2023, 03:02:47 PMCoinbase is currently fighting this fight for us to get clarity.With no luck so far. They managed to get the court to force the SEC to respond to their petition but they got denied with SEC essentially telling them to f**ck off and that they'll take however long they want to clarify the rules.https://blockworks.co/news/sec-responds-to-coinbase-request-for-action-noQuoteIn its response, released Monday evening in New York, the SEC alleged Coinbase has no right to mandamus, which orders a government agency to fulfill certain duties. “Perhaps recognizing this, Coinbase instead asserts that this Court should compel the Commission to act on Coinbase’s recently filed rulemaking petition,” the SEC wrote in its response. “But no statute or regulation requires the Commission to take such action on a specific timeline.”If that is the case then they have force Coinbase against the wall, so I wouldn't be surprised before the end of the year they will be out of the US soil and going to Bermuda. And it might set a precedence as well because of the hard line stance against crypto.We are still here though, so that's good enough news for everyone. Not even as high and big as the US will stop Bitcoin moving forward. If they created FUD to crash the market so be it. But we still have a lot of aces in our sleeves to push the market next year, and that is the halving schedule.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "May 19, 2023, 01:49:33 PM",
      "body": "Quote from: DeathAngel on May 18, 2023, 11:32:20 AMWhich part do you think we’re in?Let them try & make it difficult for us. Bitcoin can not be stopped.They never mean any good in whatever they say bitcoin is the asset to beat. Regulation is not for bitcoin only for exchanges and meme coins plus centralized coins. No government can stop bitcoin and bitcoin mixers making the difference",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 19, 2023, 09:10:18 PM",
      "body": "This is sad. It's sad to see Democrats be more against Bitcoin and the industry as a whole when normally they are the party that stands up for progress.This is obviously due to lack of education on Bitcoin, combined with the misinformation around Bitcoin being bad for the environment, and the crypto company collapses in 2022. As a liberal and democratic voter (and someone who would nevverrrrr vote Republican) I guess I can see how if you didn't know anything at all about Bitcoin other than reading negative headlines it would be easy to think it's a bad thing - I mean just look at republican voters, they are outright against most good things just because they watch Fox News which tells them bad things are good and good things are bad. It's a misinformation thing. But honestly, if you're a freakin Senator or member of the House you should be doing a lot more research into a mainstream transformative technology like this and not base your opinions off headlines. Every member of Congress should get a crash course for what Bitcoin and crypto actually is instead of getting their news in headlines from journalists who don't know anything more about it than they do.What these Democrats apparently don't understand is that it is the SEC that is stopping the industry from being regulated. SEC is literally doing the opposite of its job. At this point the industry is basically begging the regulatory bodies in the US to come up with clear and sensible sets of rules for the industry, but Gensler in his anti-crypto crusade is refusing to do that because his only goal is to create chaos in order to hold the industry down. The Gensler strategy is make no rules, pretend like their already are rules, threaten and sue all the companies, and never provide any regulatory clarity for anyone while hoping to take down the major US companies in the industry in the meantime.With all the benefits and advancements Bitcoin provides to the people and society as whole (including green energy), Democrats are the party that should be spearheading support and regulatory clarity for Bitcoin and the industry as whole, not the ones attacking it.The fact is that their is mass ambiguity and no clear rules for the road for the industry, and the regulatory bodies and Congress are the ones creating that situation.Sensible rules should be made to: encourage innovation, foster growth of good technology (obviously Bitcoin), prevent scams and illegal usages while not impinging on the 99.9% uses that are legal, provide regulation for exchanges to require transparency and safe business practices, and provide minimal red tape for all this.Instead its just: we don't understand what this is but we heard its bad and so instead of making rules to help people let's just sow chaos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}