{
  "id": "topic_5403275",
  "title": "Abiky",
  "author": "Abiky",
  "created_time": "June 20, 2022, 12:41:17 AM",
  "content": "I'm not sure if this has been done before, but wouldn't it be great to prove ownership of graded coins on the Blockchain as an NFT? Grading companies like ANACS, PCGS, or even ICG could transfer you a unique NFT that would make reference to a physical coin. The NFT would be an image of the coin in a slab, but tied to a specific blockchain address proving that you're the sole owner of it. To transfer ownership, one would simply send the virtually-graded coin to another person across the Blockchain. If grading companies don't do it, then I will take the step forward by turning my graded coins as NFTs just to have an immutable proof of ownership.Do you think this is a good idea? If not, why? Your input will be greatly appreciated. Thank you.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403275",
  "comments": [
    {
      "author": "owlcatz",
      "created_time": "June 20, 2022, 12:50:59 AM",
      "body": "These guys do this, but selling prices are a bit high IMO... https://4k.com/market  You can start here to sell something but I've not yet tried it - https://4k.com/mint-physical-nftEdit - Would be cool if S&B did this as well - https://bitcointalk.org/index.php?topic=5401986.0;topicseen",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BobbyCoins",
      "created_time": "June 20, 2022, 01:59:01 PM",
      "body": "Since NFTs came up I want to have a blockchained version of my collection (for showing off to others, having a nice extra when selling, making infos/media publicly available for all sorts of reasons) and with taproot doors seem wide open for doing this on BTC.For me it's basically not consistent being in full favour of Bitcoin but then minting mostly BTC related NFTs of my collectibles on some other blockchain  Grading companies just/mainly grade coins and their applied standards are tailor-made just for coins but the collectibles sphere embraces so much more. Shipping to/from such services as well as insufficient knowledge about the crypto-sphere and arts in general are just some other red flags for me => I'd rather let OGs here grade my collectibles than 'official' services (where outcomes among these services differ and also can be totally wrong).I'd want to pursue a more community based/decentralized/DIY approach... starting with a community created 'standard' for DIY grading of collectibles (also outlining the parameters for programming smart contracts/databases/etc. based on such a 'standard' WE can agree on): https://bitcointalk.org/index.php?topic=5134233",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "June 20, 2022, 03:34:50 PM",
      "body": "I have actually just come across this at a crypto mini conference in west palm. They are saying they are working with NGC and PCGS and had on display 2022 ASEs that they did a 3D rendering on and their whole mantra was the ability to \"privatize\" their NFTs on the blockchain. Each NFT came with the silver one ounce coin and apparently its dropping at the end of this month but has a whopping price tag of $1000 USD per. I'm out lol. I was not impressed. They lacked design and creativity and overall I called out NGC and PCGS publicly on social media calling them to finally do this on their own and to make their NFTs have a utility - with my suggestion being to provide a lifelong membership to all NFT holders to give their NFTs value. But hey we shall see what they do. I'd love to see them do something cool with them, but they are sadly missing their window.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blucepheus",
      "created_time": "June 20, 2022, 09:38:12 PM",
      "body": "Neat idea but I don’t think it’s reasonable to expect every physical coin owner to maintain rightful control of the NFT. I think we’ll first need to achieve widespread NFT adoption. Still a lot of dinosaurs even on this forum who haven’t touched an NFT",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BookofNick",
      "created_time": "June 21, 2022, 03:54:31 PM",
      "body": "Quote from: blucepheus on June 20, 2022, 09:38:12 PMNeat idea but I don’t think it’s reasonable to expect every physical coin owner to maintain rightful control of the NFT. I think we’ll first need to achieve widespread NFT adoption. Still a lot of dinosaurs even on this forum who haven’t touched an NFT  I'm admittedly one of these dinosaurs. I resist the digitization of things for the sake of digitizing things. What especially doesn't make sense to me is attaching a modern digital token to an older physical collectible. Maybe there's more evidence in the chain of ownership, but this is just one more thing that people will lose track of, I think, due to the NFT being secondary to the physical item. Not to mention, Cas coins for example have been around for a while, and are swapped between people all the time - if you were to mint a token for a coin now, how do you prove ownership of someone to assign the token to? I personally wouldn't care if I was in possession of a physical item but the not the NFT. The physical item is the thing that I see as holding value. There was a Bitbill auction a few months back where the owner (who had nothing to do will the guy / guys that made BitBills, he was just the owner of the BitBill), minted an NFT to accompany the sale:https://bitcointalk.org/index.php?topic=5357165.msg57812232#msg57812232Since anyone could mint a token, and \"minter\" isn't even the artist / creator, it's tough to see what value, if any, something like that adds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "June 21, 2022, 09:59:53 PM",
      "body": "Quote from: Abiky on June 20, 2022, 12:41:17 AMI'm not sure if this has been done before, but wouldn't it be great to prove ownership of graded coins on the Blockchain as an NFT? Grading companies like ANACS, PCGS, or even ICG could transfer you a unique NFT that would make reference to a physical coin. The NFT would be an image of the coin in a slab, but tied to a specific blockchain address proving that you're the sole owner of it. To transfer ownership, one would simply send the virtually-graded coin to another person across the Blockchain. If grading companies don't do it, then I will take the step forward by turning my graded coins as NFTs just to have an immutable proof of ownership.Do you think this is a good idea? If not, why? Your input will be greatly appreciated. Thank you. I guess I don't understand how you would keep the graded coin and the NFT together.  It doesn't seem at all possible no matter how you decide to let them change hands.  That makes the entire idea a bit of a non-starter in my opinion.A different way to do something like this might be to (do it the other way) make the coin the physical proof of ownership of an NFT.For example, I could engrave a picture of an NFT onto a coin, engrave the private key holding the NFT onto the back of the coin and cover it with a hologram.  Then the coin would be proof of ownership of the NFT (so long as the hologram was intact).  I've thought about doing this, and had some prototype prints made a while back (similar to my bitpics) but haven't gotten around to generating addresses and transferring NFTs, as I don't know if there's actual demand for such a thing.  Maybe next time I get a block of free time I'll get some prototypes done and show them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatsLife",
      "created_time": "June 21, 2022, 10:45:03 PM",
      "body": "Quote from: OgNasty on June 21, 2022, 09:59:53 PMA different way to do something like this might be to (do it the other way) make the coin the physical proof of ownership of an NFT.For example, I could engrave a picture of an NFT onto a coin, engrave the private key holding the NFT onto the back of the coin and cover it with a hologram.  Then the coin would be proof of ownership of the NFT (so long as the hologram was intact).  I've thought about doing this, and had some prototype prints made a while back (similar to my bitpics) but haven't gotten around to generating addresses and transferring NFTs, as I don't know if there's actual demand for such a thing.  Maybe next time I get a block of free time I'll get some prototypes done and show them.Primal Cypher and CryptoImperator did something like this. I wonder if anyone has redeemed yet?https://twitter.com/primal_cypher/status/1425101725187383301?s=20&t=d_4tg7gUDlImQfVBpp2gww",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "June 21, 2022, 11:22:41 PM",
      "body": "Quote from: owlcatz on June 20, 2022, 12:50:59 AMThese guys do this, but selling prices are a bit high IMO... https://4k.com/market  You can start here to sell something but I've not yet tried it - https://4k.com/mint-physical-nftEdit - Would be cool if S&B did this as well - https://bitcointalk.org/index.php?topic=5401986.0;topicseenI can see that. Still, the idea of storing a virtual representation of a physical coin on the Blockchain is pretty neat. If major grading companies get into the game, the numismatics industry will never be the same. I can envision a marketplace similar to OpenSea for graded coins and banknotes. NFTs are still a new trend, so we're going to have to wait a couple of years before they mature enough for mainstream use. Quote from: BobbyCoins on June 20, 2022, 01:59:01 PMSince NFTs came up I want to have a blockchained version of my collection (for showing off to others, having a nice extra when selling, making infos/media publicly available for all sorts of reasons) and with taproot doors seem wide open for doing this on BTC.For me it's basically not consistent being in full favour of Bitcoin but then minting mostly BTC related NFTs of my collectibles on some other blockchain  Grading companies just/mainly grade coins and their applied standards are tailor-made just for coins but the collectibles sphere embraces so much more. Shipping to/from such services as well as insufficient knowledge about the crypto-sphere and arts in general are just some other red flags for me => I'd rather let OGs here grade my collectibles than 'official' services (where outcomes among these services differ and also can be totally wrong).I'd want to pursue a more community based/decentralized/DIY approach... starting with a community created 'standard' for DIY grading of collectibles (also outlining the parameters for programming smart contracts/databases/etc. based on such a 'standard' WE can agree on): https://bitcointalk.org/index.php?topic=5134233Of course. One should assume Bitcoin-related collectibles to be tied to the Bitcoin blockchain itself. Using another blockchain wouldn't make sense. Fortunately, there is a smart contract platform built on top of BTC (acts like a sidechain). RSK (although not a very popular smart contract platform like Ethereum or BNB) has the capability to bring the world of NFTs right into Bitcoin itself. It'll be up to grading companies and/or the community to publish graded coins and banknotes as NFTs on the RSK sidechain. NFTs are just starting to blossom, so this may be the perfect time to help \"kickstart\" the numismatics industry on the Blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatsLife",
      "created_time": "June 21, 2022, 11:47:59 PM",
      "body": "I dont see the benefit but you can checkout what these guys did... acdcnfts.comThis is not an endorsement. DYOR.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abiky",
      "created_time": "June 24, 2022, 12:55:09 AM",
      "body": "Quote from: SatsLife on June 21, 2022, 11:47:59 PMI dont see the benefit but you can checkout what these guys did... acdcnfts.comThis is not an endorsement. DYOR.Now that's what I'm talking about. If only there were renowned companies into the graded numismatics bandwagon, mainstream adoption for NFTs would take off like crazy. I think what's holding companies from doing this is the ever-increasing gas fees on smart contract platforms (especially Ethereum). Some would say Solana is a better option for NFTs, but the platform is heavily centralized (not to mention that it's full of bugs).At least, the idea is there. Making it a success is another story. Who knows what the future holds for this emerging industry? Just my thoughts",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}