{
  "id": "topic_5407180",
  "title": "FP91G",
  "author": "FP91G",
  "created_time": "July 21, 2022, 05:51:20 PM",
  "content": "Optimized 3nm process achieves 45% reduced power usage, 23% improved performance and 16% smaller surface area compared to 5nm processSamsung Electronics, the world leader in semiconductor technology, today announced that it has started initial production of its 3-nanometer (nm) process node applying Gate-All-Around (GAA) transistor architecture.https://news.samsung.com/global/samsung-begins-chip-production-using-3nm-process-technology-with-gaa-architectureWill this be used for new ASICs?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5407180",
  "comments": [
    {
      "author": "NotFuzzyWarm",
      "created_time": "July 21, 2022, 08:00:00 PMLast edit: July 21, 2022, 09:41:53 PM by NotFuzzyWarm",
      "body": "Maybe.One has to remember that the only reason TSMC produced so frickin' many fairly low cost 5nm chips for Bitmain is that as I've repeatedly said before in other threads -- the uber-simple mining chips are great for fine tuning production processes before said tech is good enough to be used for more valuable and far more complex chips. Mining ASIC's are very tolerant of defects so even imperfect production processes still produce enough salable chips per-wafer to be worthwhile and that makes them perfect testbeds.Once the processes have decent yields one can then expect any Foundry to:a. shift the majority of their production capacity to more valuable chipsb. raise the price for mining ASIC's",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "July 21, 2022, 09:24:42 PM",
      "body": "Maybe we can see something like the testing process for 3nm also. But a real production of mining ASICS is very unlikely in 3nm since the prices of bitcoin are low and there is just not a big market at the moment. There are many more lucrative markets since everybody needs chips so they will not use it for ASICS that are not so sought after at the moment,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "July 22, 2022, 06:26:41 PM",
      "body": "If the market for smartphones and other gadgets is more profitable, then these chips will probably not be sold in this market. But Intel already has its own ASICs, and perhaps other large companies will want to explore this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GFDhd",
      "created_time": "July 26, 2022, 02:28:02 AM",
      "body": "I think maybe, but probably not that fast. The latest ASIC miners on the market currently use 5nm chips, and I'm looking forward to applying 3nm process technology to ASICs. According to reports, compared with the 5nm process, the first-generation 3nm process can reduce power consumption by 45%, improve performance by 23%, and reduce chip area by 16%; while the second-generation 3nm process reduces power consumption by 50% and improves performance by 30%. %, the chip area is reduced by 35%.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "August 05, 2022, 04:14:47 AM",
      "body": "Seems like if cost isn't really prohibitive, this could get more folks into mining esp with the power consumption offset.  However, things will work themselves out and rebalance/reset as the overall hash rate would go up thus diluting the share of the pie.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "August 06, 2022, 12:44:34 AM",
      "body": "Quote from: FP91G on July 22, 2022, 06:26:41 PMIf the market for smartphones and other gadgets is more profitable, then these chips will probably not be sold in this market.Do you really think anyone's going to waste 3nm chip technology at this stage to create non-reprogrammable ASICs? To be fair, they have a short lifespan that is limited to whatever appliance you put it inside. So of course all mobile devices will gobble these chips up like a swarm before a single batch ever gets to the likes of Bitmain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}