{
  "id": "topic_5405006",
  "title": "Flyingjack123",
  "author": "Flyingjack123",
  "created_time": "July 03, 2022, 11:18:36 AM",
  "content": "How does the shift from proof of work to proof of stake consensus will affect bitcoin?Proof of work is a proven consensus mechanism, while proof of stake based blockchains are yet to be validated. How will success of proof of stake based blockchains will effect bitcoinWill this  havr any real effect on future valuation of bitcoin?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405006",
  "comments": [
    {
      "author": "PrivacyG",
      "created_time": "July 03, 2022, 11:49:51 AM",
      "body": "Yes, it does have an effect on the valuation of Bitcoin.  If Bitcoin moves to Proof of Stake, me and probably more than half of the older Bitcoiners are going to get out of it.  Proof of Stake is in my opinion an unfair mechanism where the Rich are in advantage over the poor, which is precisely one of the reasons I am currently in progress of removing Fiat out of my life.  Plus, Proof of Stake is not only less tested than Proof of Work but also provides less security.If Proof of Stake EVER proves to be just as fair as Proof of Work and just as secure or more secure, then why not transition to it.  But until then, let other coins self destroy by being the testing ground for it and let Bitcoin be the strong beast it currently is.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 03, 2022, 12:10:41 PM",
      "body": "its simplea shift from the cost of 1.5million miners hardware and electric cost to mine a block for only 6.25coin(hundreds of thousands of $ per block: dozens of thousands of $ per coin)to a few dollars to sign a block.. result: massive cost reduction to make a block means those making blocks sell the cheaper, way cheaper and still profit. = value crash = price crash..lets use ethereum.. great examplecurrently over $1k hash cost to mine a ethcurrently ~400k potential block signers of eth PoSethereum releases 2eth per block and does about 6k blocks a day. meaning each potential signer might get a chance once every 2-3 monthsat a PC rating of 100w (2.4kwh a day) = $180kwh in ~75 days. meansat $0.04/kwh thats a $7.20 cost for waiting 2-3 months to get 2ethereum on PoS or $3.60 per ethyepwhen they say that eth2(pos) is 99.9X% less energy intensive than PoW.. what they are hinting at is the cost of creation is X000x less costly. so expect a X000x factor decrease in value and thus an effect of a X000x factor of price speculation crash too",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 03, 2022, 12:24:53 PM",
      "body": "Quote from: franky1 on July 03, 2022, 12:10:41 PMits simplea shift from the cost of 1.5million miners hardware and electric cost to mine a block for only 6.25coin(hundreds of thousands of $ per block: dozens of thousands of $ per coin)to a few dollars to sign a block.. result: massive cost reduction to make a block means those making blocks sell the cheaper, way cheaper and still profit. = value crash = price crash..lets use ethereum.. great examplecurrently over $1k hash cost to mine a ethcurrently ~400k potential block signers of eth PoSethereum releases 2eth per block and does about 6k blocks a day. meaning each potential signer might get a chance once every 2-3 monthsat a PC rating of 100w (2.4kwh a day) = $180kwh in ~75 days. meansat $0.04/kwh thats a $7.20 cost for waiting 2-3 months to get 2ethereum on PoS or $3.60 per ethyepwhen they say that eth2(pos) is 99.9X% less energy intensive than PoW.. what they are hinting at is the cost of creation is X000x less costly. so expect a X000x factor decrease in value and thus an effect of a X000x factor of price speculation crash tooYou are leaving out the fact that you have to spend time to keep your client software up to date. And that you are leaving all that eth locked up. And that if your PoW miner is offline you just loose what you could have mined, with ETH PoS there are penalties if you miss to much work. And so on. There was a discussion about someone staking their ETH in a VM, and they moved that VM to another machine. All was good till they accidentally spun up the old VM and it broadcast something and the validator was slashed.PoS is not as push to run as many people think. *If it's a 'real' coin.* There were tons of crap PoS coins that could just sit there and stake in their wallets that have died off. As they tried to make it 'better' like ETH they made it a lot more complicated. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "July 03, 2022, 12:33:36 PM",
      "body": "I do not want to be a spoilsport but here I go:I worry that POS might be the only feasible option for Bitcoin once all the Bitcoin are mined or until mining costs no longer justify rewards (if that is possible). Once mining rewards fall out of the equation, the value of Bitcoin transaction rewards will likely determine whether or not using POW is worth it, in the long term. And if POS does not crash and burn horribly in its test phase with the current POS altcoins, then it might actually be an improvement for Bitcoin, especially when it comes to scaling.Although I do dislike the anti-democratic part of POS.  Basically it could turn out to be centralization with extra steps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "July 03, 2022, 01:35:48 PM",
      "body": "The (purely hypothetical) value of Bitcoin = Zero in some bizzarro-world where such a thing could conceivably happen.  Proof of Stake is fundamentally at odds with the function Bitcoin was designed to achieve.  Which is why it's never going to occur.  Ever.  It's one of those lines in the sand which too many network participants would refuse to cross.  As such, any attempt to transition Bitcoin to POS is a topic for Altcoin Discussion, because that's where you discuss shit that isn't Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "July 03, 2022, 01:59:10 PM",
      "body": "Quote from: Flyingjack123 on July 03, 2022, 11:18:36 AMHow does the shift from proof of work to proof of stake consensus will affect bitcoin?Proof of work is a proven consensus mechanism, while proof of stake based blockchains are yet to be validated. How will success of proof of stake based blockchains will effect bitcoinWill this  havr any real effect on future valuation of bitcoin?It will set crypto space into confusion, and will likely Make Bitcoin price to be dependent on altcoins that first invented the PoS scam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 03, 2022, 02:17:49 PM",
      "body": "Quote from: goldkingcoiner on July 03, 2022, 12:33:36 PMI worry that POS might be the only feasible option for Bitcoin once all the Bitcoin are mined or until mining costs no longer justify rewards (if that is possible)...Although I do dislike the anti-democratic part of POS.  Basically it could turn out to be centralization with extra steps.That is a reasonable option, but such a situation which doesn't align with the current protocol of the Bitcoin network will just make it another altcoin and not worth what the possible value could be then.There are many uncertainties about how Bitcoin operation would function over the next century as the mining rewards gradually halves to zero and I cannot predict what changes would occur; But I would definitely not want to hold some coin built on PoS model, especially when I opted into PoW in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lionheart78",
      "created_time": "July 03, 2022, 02:45:24 PM",
      "body": "Quote from: Flyingjack123 on July 03, 2022, 11:18:36 AMHow does the shift from proof of work to proof of stake consensus will affect bitcoin?The effect would be from being decentralized to heavily centralized because it would be easier for the richer people to amass Bitcoin thru stakingQuote from: Flyingjack123 on July 03, 2022, 11:18:36 AMWill this  havr any real effect on future valuation of bitcoin?It will definitely have an effect on the future valuation of Bitcoin.   Imagine having the raw materials being produced at 99% cheaper.  It will definitely affect how seller prices their order since they would compete on who sells the cheapest in order for their supply to be sold asap.  Bitcoin valuation that heavily relies on POW will also suffer the same thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "July 03, 2022, 03:06:26 PM",
      "body": "I don't think bitcoin moving to PoS has ever been a reasonable option for it.It'll bring so much in centralisation and in destabilising and desecuring the current chain. In most pos systems, there are only a few main staking pools that handle requests - those then take a fee too (increasing their own value at the cost of the chain's users and incentivising the main controllers of a chain to try to keep that control). Some pos coins under similar circumstances (eg the ones that get to vote on which node can verify blocks) are also problematic for when that node breaks down, fails or gets hacked (and I think the second has definitely happened in a few PoS chains before just going offline).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 03, 2022, 03:58:37 PM",
      "body": "Proof-of-Stake is fundamentally flawed, that simple. It might work for a pump-and-dump shitcoin, but there's no way the downsides won't appear for a large-scale project such as bitcoin. There's this thing Bitcoiners call \"consensus\" that cannot be produced with Proof-of-Stake.\"Don't trust, verify\" conflicts with Proof-of-Stake, because the mechanism brings subjectivity to the game. Only with Proof-of-Work you gain complete objectivity, because it can't go more neutral than that; you can actually verify the work. The Byzantine generals need this objectivity, otherwise their concerted strategy will overtime begin appearing problems. I suggest reading: https://bitcointalk.org/index.php?topic=5387588",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "July 03, 2022, 04:11:32 PM",
      "body": "If the question is about valuation (the value of Bitcoin, as in its price, real or 'fair'), then I don't think there's a direct impact. Maybe we'll get to see for ourselves if Ethereum ever makes good on its promise to switch from one to another. Proof of work is more trustworthy and less centralized, so it would be fair for Bitcoin (or Ethereum, for that matter) to cost more when it's PoW than in an even of switching to PoS. However, if we're talking about actual pricing, I think there won't be any direct impact from the switch, but there can be impact based on the media coverage and sentiments. If some companies bring in new investments because of thinking that a crypto is now environmentally friendly, it can be of short-term help to increase the price. If panic that PoS isn't trustworthy is overpowering, the price can temporarily decrease.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 03, 2022, 04:27:50 PMLast edit: July 03, 2022, 04:52:27 PM by franky1",
      "body": "Quote from: DaveF on July 03, 2022, 12:24:53 PMQuote from: franky1 on July 03, 2022, 12:10:41 PMits simpleat a PC rating of 100w (2.4kwh a day) = $180kwh in ~75 days. meansat $0.04/kwh thats a $7.20 cost for waiting 2-3 months to get 2ethereum on PoS or $3.60 per ethyepwhen they say that eth2(pos) is 99.9X% less energy intensive than PoW.. what they are hinting at is the cost of creation is X000x less costly. so expect a X000x factor decrease in value and thus an effect of a X000x factor of price speculation crash tooYou are leaving out the fact that you have to spend time to keep your client software up to date. And that you are leaving all that eth locked up. (i say all this in humour. not as a argument. so smile while reading it. its not a fight)hey if you dont like my pencil math number of about $3.60/eth.. then try your own math out. add in your own variables. set your own valuation. im not the cost controller. im just giving example of pen and brain math for easy demo.. but hey even ethereum themselves are highlighting their 99.95% less energy usage (cost)..i was just doing some pencil and brain maths, even if i dont explain it all400k validators at 6k blocks a day is ~66 days. so guess why i rounded to ~75 days .. mhm. yep i included the initial block download and other factors and 75 seemed like a good buffer round number to use instead.. and so i didnt stick to the 66day number (which would have been far cheaper)heck i didnt even use rasberry Pi possible lower costs. so i think its a fair valuationpoint is though in normal daily cooperative function of good mining of both PoW/PoS. costs are 2000x difference. causing a 2000x difference in underlying value.when talking about \"good miners\" the penalties dont trigger. so i was going with the good miner cost scenario(les variables to wall of text about. trying not to wall of text waffle all variables etc was me being considerate for oncethe point being.. and why i even mention ethereum. is they are going through this very scenario right nowthe general cost of not malicious-no bug, no error no reject no penalty trigger mining is a 2000x difference. heck even ethereum are picking up on that point and using it as part of their advertising strategy with their 99.95% energy usage(cost) reductionyou can spend hours trying to calculate other costs if penalties are triggered or blocks are rejected in both PoW and PoSoh and we could have long debates of walls of text about other factors.likehow most of that stake is not actually on 400k pc's where each pc waits upto 75 days from its startup. but instead staked on exchange where its 1 exchange node doing the block signing on behalf of thousands of stakers who dont have to IBD or stay online 24/7like how its not everyone waits 75 days as some might be lucky and sign multiply blocks within that time and some may wait longer. but hey its an average.but hey.. the exact refined amount to the penny amount is not the point its the general point of being \"a heck of alot cheaper to mine\" causing the value people are willing to sell at be a heck of alot lesseven ethereum are using the \"heck of alot cheaper to mine\" when they are promoting the 99.95% less energy usage than PoW..(separate detail unrelated to the 99.95% energy/cost /value stuff..  and more about the security lacking of PoS)oh and i also hinted at one of the FLAWS of PoS (staked on exchanges) where those exchanges also being a needed service in of itself as a gateway to fiat and merchant tools. becomes an influencer of blind following where people end up following the whims of an exchange just to stay on the fork the exchange wants to be on so they can still work with an exchange.. and ofcourse not want to lose their stake at the same time if they did fork away from an exchanges proposed blocks which becomes a double penalty for the customer(not the exchange) if the customers want to go-against a exchanges whims.. . thus giving exchanges double influencer/power of network control.. but shh thats a whole different debate for a different topic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LegendaryK",
      "created_time": "July 03, 2022, 06:10:40 PM",
      "body": "Quote from: Flyingjack123 on July 03, 2022, 11:18:36 AMHow does the shift from proof of work to proof of stake consensus will affect bitcoin?Proof of work is a proven consensus mechanism, while proof of stake based blockchains are yet to be validated. How will success of proof of stake based blockchains will effect bitcoinWill this  have any real effect on future valuation of bitcoin?Bitcoin Cultists would prefer that bitcoin dies before a conversion to Proof of Stake.Let them have their way.  In the meantime, Proof of Stake have been around since 2013, so ~10 years, their are no new PoW coins, because every developer knows it is a dying tech due to it's excessive energy waste.Majority of PoW miners lose money and only survive off of venture capitalist funding, which is drying up now due to baby boomer retirement. Easy solution is just ignore the dying btc pow cult and buy/stake your favorite Proof of Stake coins.And let BTC PoW tech find it's own way to the refused to evolve graveyard.  Proof of Stake has solved how to keep pools from becoming centralized   :CardanoProof of Stake has solved the energy efficiency issue.                             :All PoS coins.Proof of Stake has solved transaction finality.                                         :AlgorandWhile Proof of Waste has only solved how to waste even more energy every year with zero increase in performance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 03, 2022, 06:50:24 PMLast edit: July 03, 2022, 07:17:05 PM by franky1",
      "body": "what legendaryK does is try to promote his favoured cordanofunny because he pretends he is not interested and dislikes bitcoin. much like i dont care for.. pfft. pidgeons(insert any example).. where i for instance wouldnt bother trying to get on a pidgeon website. id just get on with my life going places that do interest me..yet here he is on a bitcoin website. trying his dang hardest to advertise his pidgeon, ops i mean cordanohere is some there thoughts yet in all my travels in all the merchants i visited i have not seen cordano once mentioned as a things they accept. nor have i seen any large number of hundreds of thousands of businesses even show a sign of liking cordano as a utility they prefer. (i must admit i dont waste much time asking merchants about it) but i seem to always find many merchants, without prompting show their interest in bitcoini have seen soo many businesses running, using and starting up in the bitcoin arena. but hey. if he wants to use something with no underlying costs ba pennies. thus no base value. he can speculate all he wantsbut if you want to speculate on the features and benefits to come to a price point of sentiment about how much PRICE cordano should play with.. well just look at the number of businesses/people involved. and then you will see why it sells at under $1..that all saidcordano is not a investment or meant as a having a value based economics.. its more of a product/tool of the speculative realm. . so do away with that stuff of economic speculation in regards to cordano. you will never win long term. if you just deal with it potential of the utility features. then its a fair price. just dont expect people to speculate it up to $XXK values.treat it as a cheap coin. for its functional features.  but yea, its a niche thing not a main thing. edit to answer below:funny how you notice that the ones that debate me and want me banned are those that advertise altnets and sidechains and altcoins and really hate it when i call them out on their flaws and issues that do not help bitcoin, but instead stifle bitcoin just to highlight THEIR view of the future being away from the bitcoin network. .as for me being on this forum alot. well its called technology. you know wi-fi, satellites, 5g. it means i can travel and talk at the same time. (though covid lockdowns ddid put a delay in many of my plans)as for my need to reply with a comment that opposes the person i quote or reference..personally im not an ass kisser, replying just to agree or to kiss and hug and lick people when they have made a good comment. thus there is no point replying to good comments because the good comments have already said all thats needed.  but obviously if someone misses a point then the topic requires added thoughts and comments to add detail or correct things. so when you see me comment yes its because im seeing that the previous posts lack something. if you take it as a insult/harm/attack. maybe try researching better. thus get less replies trying to correct or add detail to things you miss out",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LegendaryK",
      "created_time": "July 03, 2022, 07:03:36 PM",
      "body": "Quote from: franky1 on July 03, 2022, 06:50:24 PMid just get on with my life going places that do interest me..If that were true, you would have left btctalk years ago.How many times have the blockstream babies slam you down, almost daily by my count.Even banned you from the development forum.  You have a need to argue that borders on a mental disorder.  Which is why I have to be careful at how much of my time, I let you waste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "July 03, 2022, 07:22:02 PM",
      "body": "Quote from: PrivacyG on July 03, 2022, 11:49:51 AMProof of Stake is in my opinion an unfair mechanism where the Rich are in advantage over the poor, which is precisely one of the reasons I am currently in progress of removing Fiat out of my life. Putting the security of the network and the centralization aside when it comes to POS, how are the rich not in a favorable position over the poor in Bitcoin as well? In mining, for example. Do I have a chance to mine a block with my poor man's computer when I am competing against mining farms that have tens and hundreds of thousands of ASICS? Unlikely. So what do I need to improve my chances? Expensive hardware that costs money. Me being the poor bastard I am from a third world country can't afford it. That's how those with more resources will always dominate the ones that have not much to spend.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 03, 2022, 07:48:01 PMLast edit: July 04, 2022, 06:45:35 AM by BlackHatCoiner",
      "body": "Quote from: Pmalek on July 03, 2022, 07:22:02 PMThat's how those with more resources will always dominate the ones that have not much to spend.Of course, \"the rich will always have more power than the poor\" is always confirmed. Even though, here's some significant differences:Proof-of-Work:You can't forbid or affect the entrance of new voters. Therefore, the money you've allocated for mining might not provide the same percentage of security they once did. Thus, your reward isn't ensured. If the difficulty rises, your reward drops.You can't cheat the system without being punished, since you're spending energy.It's incredibly difficult to steal ASICs/GPUs, on your way to acquire the votes.Proof-of-Stake:The entrance of new voters is down to you and the rest of the stakers to approve, since to stake new voters need to acquire the units directly from you. Your reward is very well known, and you risk nothing to continue staking.You can cheat the system with no punishment. See \"Nothing-at-stake problem\".It's incredibly easy for, say an exchange's hacker, to steal the system's units and stake them for their benefit.And that's before we even talk about the importance of objectivity in a decentralized decision-making system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 03, 2022, 08:19:59 PM",
      "body": "Quote from: Pmalek on July 03, 2022, 07:22:02 PMQuote from: PrivacyG on July 03, 2022, 11:49:51 AMProof of Stake is in my opinion an unfair mechanism where the Rich are in advantage over the poor, which is precisely one of the reasons I am currently in progress of removing Fiat out of my life. Putting the security of the network and the centralization aside when it comes to POS, how are the rich not in a favorable position over the poor in Bitcoin as well? In mining, for example. Do I have a chance to mine a block with my poor man's computer when I am competing against mining farms that have tens and hundreds of thousands of ASICS? Unlikely. So what do I need to improve my chances? Expensive hardware that costs money. Me being the poor bastard I am from a third world country can't afford it. That's how those with more resources will always dominate the ones that have not much to spend.     the one thing i dislike about all crypto numbers of price and value.is we associate it with dollars. where the mindset is to price/value it at a rate americans recognise.it ignores places like africa's sentiments. desires, accesstake for instance the fee's... americans think bitcoin fee's are ok. because its like $1. which is not even 6 minutes of minimum wage labour($10/h).. completely IGNORING that its actually like 3+ HOURS of african minimum wage labour($0.3/h) for most africans to just make a bitcoin transaction.even the PRICE of an asic is priced in btc but based on AMERICAN currency comparison. a $11k asic might be 6 months min wage labour for an american. meaning an average american can save up and buy an asic.. yet for an african.. its 330,000 hours of african labour nearly 38 years labour to afford an asicthus pricing africans out of buying an asic.if only in when markets started emerging in 2010 we didnt market price bitcoin in dollars. but instead in \"min mage labour hours\"EGif 1btc wasnt $6 in 2012 but \"1minwage labour hour\" where that converts in africa to $0.33(their dollar price)                                                                             where that converts in america to $7.50(their dollar price)bitcoin could have truly revolutionised wallstreet and disrupted it. by letting people arbitrage forex. to take advantage. where an african can mine 1btc locally and sell it remotely for USD and then convert it to african currency and cycle cycle cycle. and americans can convert USD to african buy btc remotely at african rate africa.. sell it back to the US market and cycle cycle cycle..causing FOREX disruption. while having bitcoin as the fair system for the world to work equally onbut hey. that didnt happen and so the african unbanked are not getting the benefits of bitcoin due to the americanised pricing ignorance of those that want to use the USD as a price point",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 03, 2022, 09:15:27 PM",
      "body": "If ETH switches to PoS and operates for a few years without any attacks on the consensus, then the voices that call for Bitcoin to switch to PoS for environmental reasons will become louder, but I doubt that they will be loud enough to actually stir Bitcoin in that direction. Only if PoS will be proven 100% safe will there be serious discussions if Bitcoin should swap to it, but that's a hella big IF. So don't worry about it too much, let ETH do it first and see how it goes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}