{
  "id": "topic_5468891",
  "title": "thebitcoinhole",
  "author": "thebitcoinhole",
  "created_time": "October 02, 2023, 12:52:25 PM",
  "content": "thebitcoinhole.com launched a new section on our website: \"Seed Backup\". We compare different seed phrase metal backup solutions, feature by feature. You can filter, sort and compare. We have plans to add more solutions, this is just the start.https://thebitcoinhole.com/seed-backupWe also created an open source Github repo with all the seed backup solutions data, so anyone can help to fix the data or suggest new additionshttps://github.com/thebitcoinhole/seed-backup",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468891",
  "comments": [
    {
      "author": "_act_",
      "created_time": "October 02, 2023, 08:44:39 PM",
      "body": "They are too expensive for me. I just like the normal way, noiseless and unnoticeable way which is a pen or pencil on a paper that is resistant to fading. This has been the way I backup my seed phrase.A better way is to get a glue and thick nylon that can be used for lamination and carefully laminate the paper. But this is getting noisy for me.I am a small holder. This metal backup will be good for whales.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "October 02, 2023, 09:34:32 PM",
      "body": "Good for people who are Hodlers these are waterproof and fireproof quite expensive for average holders for a price of $190 but they do have a market for this these are people who are planning to bequeath their Bitcoin to their loved ones who will they leave their Bitcoin as an inheritance.One particular item that's interesting to me is this Bitcoin capsule Cryptosteel Capsule Solo I'm sure there is a market for these items they should make it available worldwide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "October 02, 2023, 10:12:40 PM",
      "body": "To be honest, I find it a quite useless thing. If you can't keep your seed safe then you gonna lose the physical backup as well. Also, having such device gives a signal to criminals that you can be an easy target so you still gonna have to hide it from everyone.The easiest and maybe even safest way to make a backup is to keep it somewhere online. Just hide it into a crypto container before doing anything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 03, 2023, 07:31:26 AM",
      "body": "Where available, it would be very worthwhile adding links to Jameson Lopp's stress tests for each device he has tested: https://jlopp.github.io/metal-bitcoin-storage-reviews/I would also be very cautious with your \"water-proof\" and \"fire-proof\" claims. All manufacturers claim these things, but they are often not true. For example, the Billfodl and Keystone which you have listed as fire-proof, are no such thing, with fire exposure resulting in catastrophic data loss:https://jlopp.github.io/metal-bitcoin-storage-reviews/reviews/billfodl/https://jlopp.github.io/metal-bitcoin-storage-reviews/reviews/keystone-tablet-plus/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "October 03, 2023, 08:44:40 AM",
      "body": "Quote from: Beerwizzard on October 02, 2023, 10:12:40 PMThe easiest and maybe even safest way to make a backup is to keep it somewhere online. Just hide it into a crypto container before doing anything. If you keep your seed phrase online, you are giving it less security because online is not secure. You have your wallet to be an offline wallet or a hardware wallet and you keep the see phrase online, what is the point that the wallet is offline. The best you can do at least is to backup your seed phrase offline. Or probably you meant offline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 03, 2023, 10:15:59 AM",
      "body": "The site loads slowly on Tor. I don’t know if the problem is on my end or if you need to check the service.Jlopp has provided useful recommendations, so you should try the same tools and conduct similar tests with scenarios such as fires, earthquakes, and floods and to what extent these tools are affected by these conditions.Experiments could include immersing it in water for several hours, throwing heavy objects on it, and exposing it to fire continuously for several hours as a test for fires and earthquakes.I also did not find any talk about another non-metallic method, such as those using water- or shock-resistant papers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "October 04, 2023, 10:46:09 AM",
      "body": "For me, I do not see a problem with the price if there is a good amount of Bitcoin to protect. More costs can be incurred in order to obtain strong protection.But I see the problem in that these solid metal objects are difficult to hide and are eye-catching. If you write the seed on a piece of good-quality paper, it can be hidden anywhere in the house among your personal belongings without attracting attention.As for these metal panels, it will be difficult to hide them at home in a safe way that does not attract attention.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thebitcoinhole",
      "created_time": "October 04, 2023, 01:28:33 PM",
      "body": "Quote from: o_e_l_e_o on October 03, 2023, 07:31:26 AMWhere available, it would be very worthwhile adding links to Jameson Lopp's stress tests for each device he has tested: https://jlopp.github.io/metal-bitcoin-storage-reviews/I would also be very cautious with your \"water-proof\" and \"fire-proof\" claims. All manufacturers claim these things, but they are often not true. For example, the Billfodl and Keystone which you have listed as fire-proof, are no such thing, with fire exposure resulting in catastrophic data loss:https://jlopp.github.io/metal-bitcoin-storage-reviews/reviews/billfodl/https://jlopp.github.io/metal-bitcoin-storage-reviews/reviews/keystone-tablet-plus/Good feedback, thanks. Added Jameson Lopp's stress tests when available to the table.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "October 04, 2023, 01:41:56 PM",
      "body": "Quote from: Beerwizzard on October 02, 2023, 10:12:40 PMThe easiest and maybe even safest way to make a backup is to keep it somewhere online. Just hide it into a crypto container before doing anything. Where online, there is such a thing as hacking and if hackers trace that your coins are online they will try to hack it, what's the use of hardware wallets if keeping it online is safer and about OP's offer, this is for those who want to keep a huge amount of Bitcoin because it's not cheap.I believe a safe where you keep all your important documents is preferable there are people who keep their coins in a vault and it goes how they protect their vault from criminals, a vault is hard to open and penetrate because of its security features it is not cheap but at least it includes all your important documents because its bigger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 04, 2023, 05:59:45 PM",
      "body": "Quote from: thebitcoinhole on October 02, 2023, 12:52:25 PMthebitcoinhole.com launched a new section on our website: \"Seed Backup\". We compare different seed phrase metal backup solutions, feature by feature. You can filter, sort and compare. We have plans to add more solutions, this is just the start.Nice work.You are working quickly following my suggestions   Good source of information for seed backup is Jameson Lopp with his website and github page.He already has a page with detailed reviews, rating, prices and he personally stress tested this product with extreme heat, acid, etc.You don't have to add all products listed there right away, but it would be good to check them out, and I am sure there are more of them he didn't test.I had few more sources bookmarked, but I have to find them, and you can also add simple Stainless Seed washers that work great for this purpose and they are cheap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "October 04, 2023, 10:27:34 PM",
      "body": "Quote from: coin-investor on October 04, 2023, 01:41:56 PMQuote from: Beerwizzard on October 02, 2023, 10:12:40 PMThe easiest and maybe even safest way to make a backup is to keep it somewhere online. Just hide it into a crypto container before doing anything. Where online, there is such a thing as hacking and if hackers trace that your coins are online they will try to hack it, what's the use of hardware wallets if keeping it online is safer and about OP's offer, this is for those who want to keep a huge amount of Bitcoin because it's not cheap.Man, just read what I wrote and what you actually quoted. You don't need to to upload a .dat file straight to the cloud. Download some software like VeraCrypt, put your keys into the crypto container, set a safe password and don't give a fuck about hackers. You can even upload it to the cloud and post a download link in your twitter. It will take ages to brute force a good password while there is no other way to open a crypto container.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "October 05, 2023, 12:50:24 AM",
      "body": "Quote from: Beerwizzard on October 04, 2023, 10:27:34 PMIt will take ages to brute force a good password while there is no other way to open a crypto container. I think it is quite naive to assume that your security protection will never be broken, especially as far as sending out a public link and encouraging people to hack it. Who knows, people might use other means to get your funds or employ tactics. There is a reason why people suggest offline backups if you want to protect your money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beerwizzard",
      "created_time": "October 05, 2023, 07:13:27 AM",
      "body": "Quote from: joniboini on October 05, 2023, 12:50:24 AMQuote from: Beerwizzard on October 04, 2023, 10:27:34 PMIt will take ages to brute force a good password while there is no other way to open a crypto container. I think it is quite naive to assume that your security protection will never be broken, especially as far as sending out a public link and encouraging people to hack it. Who knows, people might use other means to get your funds or employ tactics. There is a reason why people suggest offline backups if you want to protect your money.Well, that was just a funny example, you should never encourage anyone to access your funds as it is unsafe personally for you. But seriously, if you have a strong password then bruteforcing it will be as hard as if you tried to find the key. Of course it is not that easy since you need to learn how to use VeraCrypt properly, but generally, it can be absolutely safe and all possible ways of accessing the data are not about just hacking the storage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "October 05, 2023, 08:41:54 AM",
      "body": "Quote from: Beerwizzard on October 04, 2023, 10:27:34 PMMan, just read what I wrote and what you actually quoted. You don't need to to upload a .dat file straight to the cloud. Download some software like VeraCrypt, put your keys into the crypto container, set a safe password and don't give a fuck about hackers. You can even upload it to the cloud and post a download link in your twitter. It will take ages to brute force a good password while there is no other way to open a crypto container. Post a download link of your seed phrase on your Twitter? That is not a good thing to do. Why can't you get your seed phrase encrypted on UBC drive or get a paper and use passphrase with your seed phrase. What that I have never done before and that I can never do is to backup my seed phrase online. The ones that do show on wallet is the google cloud and icloud and which I have never done before because it would be too late if my seed phrase is known to a hacker.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "October 05, 2023, 10:31:24 AM",
      "body": "Quote from: Beerwizzard on October 05, 2023, 07:13:27 AMbut generally, it can be absolutely safeAnd you've reviewed every line of code in Veracrypt to ensure there are no bugs or vulnerabilities? And you've reviewed every line of code in your chosen encryption algorithm to ensure there are no bugs or vulnerabilities? And you are 100% certain the machine you are using to do this is 100% free from all malware (you aren't, because no one is). And you are 100% certain the machine you are using is not being targeted by any attacks, or your traffic bring intercepted (again, no one is ever certain of this).Regardless of how well you do everything electronically, you will never be as safe as a completely offline back up. This is why airgapped wallets are recommended, because they negate many of these vulnerabilities which you can otherwise never be certain you are protected against if using an online device.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zoomic",
      "created_time": "October 05, 2023, 10:28:36 PM",
      "body": "Quote from: joniboini on October 05, 2023, 12:50:24 AMQuote from: Beerwizzard on October 04, 2023, 10:27:34 PMIt will take ages to brute force a good password while there is no other way to open a crypto container. I think it is quite naive to assume that your security protection will never be broken, especially as far as sending out a public link and encouraging people to hack it. Who knows, people might use other means to get your funds or employ tactics. There is a reason why people suggest offline backups if you want to protect your money.When he said about having wallet offline and backup online, I read it with alot of confusion and skepticism. Then act reacted to it and I was waiting patiently for him to reply and now he has given his response about using a crypto container and unbrute-forceable password.I can maintain that whatever security you are using, as long as it is online, it is vulnerable. When mixin safe was hacked it gave me a re-assurance of my belief.The best way to secure your seed phrase is to make sure that no one has an idea of where it is saved. The moment you think it is unhackable and point public eyes to it, you would be taken by surprise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "October 06, 2023, 01:07:04 AM",
      "body": "Quote from: Zoomic on October 05, 2023, 10:28:36 PMWhen mixin safe was hacked it gave me a re-assurance of my belief.To be fair, what he refers to is quite different from what Mixin did afaik. While both of them are online storage solutions, one of them involves a third party that manages your security directly. That being said, it is definitely a bad idea that people would rely on some online/third-party solution to secure their data. What OP did is definitely more helpful compared to that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 06, 2023, 07:05:48 PM",
      "body": "@thebitcoinhole Seed Backup page is not working for me, while all other pages open fine.Are you working on it and adding new stuff, or there is some other issue?PSI wanted to suggest few products for you to add, but I am not sure if you already have them listed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thebitcoinhole",
      "created_time": "October 08, 2023, 02:35:37 AM",
      "body": "Quote from: dkbit98 on October 06, 2023, 07:05:48 PM@thebitcoinhole Seed Backup page is not working for me, while all other pages open fine.Are you working on it and adding new stuff, or there is some other issue?PSI wanted to suggest few products for you to add, but I am not sure if you already have them listed.Good catch. It was a bug. I fixed and it is working now. Thanks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}