{
  "id": "topic_5483104",
  "title": "Len Saldua",
  "author": "Len Saldua",
  "created_time": "January 27, 2024, 09:07:51 AM",
  "content": "Not sure if this question belongs here but here goes:Up to recently I've been relying on CoinGecko to check Bitcoin ( and Altcoin ) prices,but also to check specific stats such as Market Cap dominance, social engagement, monthlyand yearly growth, etc. CoinGecko has recently changed their display so I don't find some of these stats there anymore.Coin Market Cap never had them clearly displayed in the first place and I still don't know where they put them.Anyway, out of those stats I mentioned, Market Cap dominance is the most important one... I checkit regularly to see whether we are getting close to Altcoin season, or whether Bitcoin's dominance isso high that it make more sense to load up on Bitcoin. It's been a couple of weeks without me checkingBitcoin's market cap dominance and to be honest I feel completely lost. Anyone knows where I couldfind this information updates ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5483104",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "January 27, 2024, 09:14:18 AM",
      "body": "On Coingecko, the bitcoin market dominance is still there on the website main age when you enter using Coingecko URL link:https://www.coingecko.comI can also see it on Coinmarketcap. Or you mean on the app?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "January 27, 2024, 09:44:16 AM",
      "body": "Quote from: Len Saldua on January 27, 2024, 09:07:51 AMAnyway, out of those stats I mentioned, Market Cap dominance is the most important one...Dominance is available at many websites not only Coingeckohttps://coinmarketcap.com/charts/#bitcoin-dominancehttps://www.coinglass.com/pro/i/MarketCaphttps://coinstats.app/btc-dominance/https://coincodex.com/bitcoin-dominance/https://www.tradingdigits.io/btcDominanceYour post looks strange like you copied it from somewhere because I see no writer will break down sentences like you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Len Saldua",
      "created_time": "January 27, 2024, 10:07:14 AM",
      "body": "Thanks guys. No, my post is not copied and pasted just incorrectly spaced because i use magnifier while writing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "January 27, 2024, 11:05:29 AM",
      "body": "Quote from: Len Saldua on January 27, 2024, 10:07:14 AMThanks guys. No, my post is not copied and pasted just incorrectly spaced because i use magnifier while writing.Your question has been answered that you can still see bitcoin market dominance on Coingecko, Coinmarketcap and some other exchanges that some members listed on their post on this thread. For people not to keep repeating this sites and listing the same thing that other people have posted before, it would be good if you just lock this topic or thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Len Saldua",
      "created_time": "January 27, 2024, 11:33:58 AM",
      "body": "Okay I will try do that now. May I just add I prefer the old Coin Gecko layout, this one doesn't work for me at all ! Same with the changes Meta makes without consulting anyone. All of this just reminds me how much we need a decentralized system where users have a say and are not merely consumers and numbers in a data chart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}