{
  "id": "topic_5469830",
  "title": "Question:",
  "author": "Josefjix",
  "created_time": "October 10, 2023, 04:54:37 AM",
  "content": "I came across another interesting argument regarding Bitcoin being completely pre-mined while reading an interesting article about how Ethereum being 75% pre-mined. According to what I've read, all 21m Bitcoins were issued when the first block was mined in January 2009 and were released into circulation through block subsidies to miners to help pay for ongoing operations.Is all of Bitcoin pre-mimed? Or simply another falsehood. If every single coin was already mined, in my opinion, there wouldn't be anything like the Bitcoin halving.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5469830",
  "comments": [
    {
      "author": "JunaidAzizi",
      "created_time": "October 10, 2023, 05:34:58 AM",
      "body": "Quote from: Josefjix on October 10, 2023, 04:54:37 AMI came across another interesting argument regarding Bitcoin being completely pre-mined while reading an interesting article about how Ethereum being 75% pre-mined. According to what I've read, all 21m Bitcoins were issued when the first block was mined in January 2009 and were released into circulation through block subsidies to miners to help pay for ongoing operations.Is all of Bitcoin pre-mimed? Or simply another falsehood. If every single coin was already mined, in my opinion, there wouldn't be anything like the Bitcoin halving. No bitcoin is not pre-mined, this means that not all bitcoin is mined yet. Mining is a process in which a new blockchain-based token or coin is created before the launching of actual cryptocurrency to the public and the aim is to reward the founder miner and developer by giving it to them. The first block known as Genesis, contains all the 21m bitcoins and now only 19.4m have been mined which are circulating and 1.6m are still remaining. These circulating bitcoins were not released all at one time but after some time of mining and released slowly and gradually. Due to halving the new rate of new Bitcoin is decreasing, as halving occurs after every 210,000 blocks which takes almost 4 years. And you all know after halving the bitcoin that every block contains is half. So there is no evidence that Bitcoin was per-mimed.I understand you in another way just for the understanding of newbies and for those who didn't understand. Suppose that a game is created by a developer and he sets all the things in the game like the characters, levels, clothes, guns, etc but he locks now when starting the game and playing the new things were unlocking to you same case applies to the bitcoin, All the bitcoins was created according to the block geneisis and now the minor have to do mining and unlocking the bitcoin. I hope you will understand this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "October 10, 2023, 05:36:16 AM",
      "body": "Quote from: Josefjix on October 10, 2023, 04:54:37 AMIs all of Bitcoin pre-mimed?Premined means the coin was created and distributed to a small group prior to the launch of the project. This obviously did not happen with Bitcoin. No one (Satoshi included) can access bitcoins that are not yet in circulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "October 10, 2023, 05:58:19 AM",
      "body": "Another lie or fake stats about bitcoin. The fact before us is that the first bitcoin block to be mined was the genesis block which contained an unredeemable 50 bitcoin as the block subsidiary and the address here shows that only 72 bitcoin is there which we know some of those were sent there or are still sent there, so this already defeats the claim that all bitcoin were pre-mined in the first block. Also there was a report that bitcoin v0.1 was first publicly released on 9th January 2009 as announced by cryptography mailing list and before that time only 14 blocks were already mined which will only account for a total of 700 bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 10, 2023, 06:07:59 AM",
      "body": "Quote from: Josefjix on October 10, 2023, 04:54:37 AMI came across another interesting argument I am more curious as to where you came across such a strange FUD about Bitcoin which doesn't take any effort to debunk?Quote from: Josefjix on October 10, 2023, 04:54:37 AMIs all of Bitcoin pre-mimed? Or simply another falsehood. Start running a full node and you'll see your UTXO database (a database containing any spendable coins) is empty. As you sync and download the first block (block #1) it remains empty because reward of Genesis block (block #0) is not spendable and the reward for first block needs to mature 100 blocks. As you continue downloading blocks you can clearly see how the UTXO database grows as new coins are created, all of which is timestamped and is unchangeable so you can literally see how each and every single satoshi was created by miners one block at a time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "October 10, 2023, 06:32:45 AM",
      "body": "Quote from: Josefjix on October 10, 2023, 04:54:37 AMAccording to what I've read, all 21m Bitcoins were issued when the first block was mined in January 2009 and were released into circulation through block subsidies to miners to help pay for ongoing operations.Is all of Bitcoin pre-mimed? Or simply another falsehood. Bitcoin is unique and isn't like shitcoins with huge premined coins.Is any bitcoin premined?If you want to know it, check the Bitcoin public ledger with any Bitcoin block explorer.Block #0, the Bitcoin genesis block.Block #1 has a same block reward, 50 BTC. You can see output totals for both two blocks is only 50 BTC. Premined? No.How is the 21 million Bitcoin cap was defined and enforced?Controlled supplyBitcoin monetary inflation.The genesis block, the first Bitcoin block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vv181",
      "created_time": "October 10, 2023, 06:55:30 AM",
      "body": "That is simply ridiculous. If you are so interested in the claim, you would directly verify the claim by yourself, not believing according to what you have read or the argument. You even did not state any sources or claims about the matter. This is absurd. Not to mention you already have presumption.Now you should not be questioning the communities since what bitcoin essence is you can simply verify, you don't have to trust. So the question is, why did not you check and verify it by yourself? You don't know how to do it? You don't know what thing to check and verify? That should be the thing you ask about, not some conspiracy theorist mumble.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "October 10, 2023, 07:13:25 AM",
      "body": "Quote from: Josefjix on October 10, 2023, 04:54:37 AMI came across another interesting argument regarding Bitcoin being completely pre-mined while reading an interesting article about how Ethereum being 75% pre-mined. According to what I've read, all 21m Bitcoins were issued when the first block was mined in January 2009 and were released into circulation through block subsidies to miners to help pay for ongoing operations.Is all of Bitcoin pre-mimed? Or simply another falsehood. If every single coin was already mined, in my opinion, there wouldn't be anything like the Bitcoin halving. Bitcoin is not pre-mined. I can only guess that this was someone making a weird intellectual exercise, trying to relativize some of Ethereum's early issues with centralization. It's like saying you're a millionaire because the salary you are going to earn over the next few decades is eventually going to add up to a million.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 10, 2023, 07:25:17 AM",
      "body": "Quote from: Josefjix on October 10, 2023, 04:54:37 AMIf every single coin was already mined, in my opinion, there wouldn't be anything like the Bitcoin halving. When bitcoin was created, miners are rewarded 50 BTC in each block mined. After 210000 block has been mined, the reward halved to 25 BTC. After block 420000 mined, the reward halved to 12.5 BTC. After block 630000 mined, miners are rewarded 6.25 BTC which is the present mining reward. Bitcoin circulating supply is approximately 19.5 million BTC while the total supply is 21 million BTC. Where are the remaining approximately 1.5 BTC? They are not yet mined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "October 10, 2023, 07:32:33 AM",
      "body": "Even though Bitcoin is not a pre-mined scam like almost all the tokens/coins out there, however around 50% of Bitcoins were mined in the first 4 years, so kind of an advantage for the early adopters and as time passes, those who join the mining will get less and less percentage of the total supply which means people will slowly stop mining unfortunately, if the price doesn't keep pace with mining difficulty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "October 10, 2023, 07:41:48 AM",
      "body": "The halving event where the miners will be rewarded after mining a specific block, isn't mean someone is already holding the reward until the time comes. No one hold it, the reward system comes because of using proof of work or the algorithm.Every Bitcoin block is syncing from one to another, to reach the highest block height 6,930,000, you need to download from the first block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "October 10, 2023, 09:10:15 AM",
      "body": "For the record I was not convinced and at the same  I was open to learn. Quote from: pooya87 on October 10, 2023, 06:07:59 AMQuote from: Josefjix on October 10, 2023, 04:54:37 AMI came across another interesting argument I am more curious as to where you came across such a strange FUD about Bitcoin which doesn't take any effort to debunk?Although some attempt was made, none of it was really persuasive; all the responses I read were essentially \"false\" straight replies that did not provide any supporting evidence. I knew I will get detailed answers here. I will get back to those fuckers now. Quote from: pooya87 on October 10, 2023, 06:07:59 AMQuote from: Josefjix on October 10, 2023, 04:54:37 AMIs all of Bitcoin pre-mimed? Or simply another falsehood. Start running a full node and you'll see your UTXO database (a database containing any spendable coins) is empty. As you sync and download the first block (block #1) it remains empty because reward of Genesis block (block #0) is not spendable and the reward for first block needs to mature 100 blocks. As you continue downloading blocks you can clearly see how the UTXO database grows as new coins are created, all of which is timestamped and is unchangeable so you can literally see how each and every single satoshi was created by miners one block at a time.I've always hoped to host my own Bitcoin nodes someday, but where I hail from, it's practically hard to download the complete blockchain due to poor internet connections and inconsistent electrical supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 10, 2023, 09:33:10 AM",
      "body": "These articles are often from altcoins to support their argument, those currencies in which the developing team holds most of the liquidity. Therefore, the easiest thing is to say that this design is the same as that of Bitcoin, and that the miners are mining a pre-existing Bitcoin, which supports their claims by saying that there are only 21 million Bitcoins, and therefore it is It has already been mined and all these beliefs are incorrect and not accurate.Quote from: Josefjix on October 10, 2023, 09:10:15 AMI've always hoped to host my own Bitcoin nodes someday, but where I hail from, it's practically hard to download the complete blockchain due to poor internet connections and inconsistent electrical supply. If you want to learn, you don't need to. There is a lot of data available that you can check.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 10, 2023, 09:40:42 AM",
      "body": "Where did you read this from? It is false. The first block contains only a 50BTC block reward.Bitcoins are created through the block reward in every block, they do not exist in any shape or capacity before then. If that was not the case, then bitcoins would've stayed inherently worthless and would never have rose in value during 2010-2012.Tail emission is not even implemented in the Bitocin Core codebase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "October 10, 2023, 09:43:11 AM",
      "body": "Quote from: Josefjix on October 10, 2023, 09:10:15 AMAlthough some attempt was made, none of it was really persuasive; all the responses I read were essentially \"false\" straight replies that did not provide any supporting evidence. I knew I will get detailed answers here. I will get back to those fuckers now. The answer's pretty straightforward - if all the bitcoin was pre-mined, you'd be able to see it right there in the genesis block, or maybe somewhere in the Bitcoin client's source code.  But there's nothing like that there. And besides, if all bitcoin was pre-mined, there wouldn't be coinbase transactions in every block, right?Follow the scientific method. When you come up with some new theory, the first thing you should do is look for proof that backs it up, rather than just asking others to disprove your hypothesis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nutildah",
      "created_time": "October 10, 2023, 09:56:59 AM",
      "body": "This is another Craig Wrong falsehood that he uses to argue why he should be entitled to various patents, copyrights and basically control over Bitcoin (including the Satoshi stash that lays dormant in the BSV blockchain). OP likely stumbled across it by reading a CoinGeek article, perhaps this one or one like it:QuoteThe purpose of the subsidyThere has been much speculation about why Satoshi created the block subsidy. Dr. Wright spells it out here. It was designed to ensure funding to build an ecosystem based on volume and allow miners to accept more transactions, some of which should be free. While CoinGeek seems to be a legit news source, it is dedicated to promoting BSV propaganda and should be ignored. I was disappointed when its articles started showing up in my Google News feed; I have since removed them as a source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 10, 2023, 10:04:55 AM",
      "body": "Quote from: hugeblack on October 10, 2023, 09:33:10 AMThese articles are often from altcoins to support their argument, those currencies in which the developing team holds most of the liquidity. Therefore, the easiest thing is to say that this design is the same as that of Bitcoin, and that the miners are mining a pre-existing Bitcoin, which supports their claims by saying that there are only 21 million Bitcoins, and therefore it is It has already been mined and all these beliefs are incorrect and not accurate.~snip~I agree that there is truth in what you wrote, although there is also a lot of ignorance that results in this kind of nonsense. If the OP who has been around for a while wonders if there is any truth to this, what do those who know absolutely nothing about Bitcoin think when they come across this kind of information?Not only is the coin that the OP is talking about premined, but as far as I know, there is no defined max supply yet, and it has also moved to POS. When you take all that into account, it's no wonder that someone invents stories like this to diminish the real value of Bitcoin, and I don't mean exclusively the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 10, 2023, 10:09:58 AM",
      "body": "Quote from: nutildah on October 10, 2023, 09:56:59 AMThis is another Craig Wrong falsehood that he uses to argue why he should be entitled to various patents, copyrights and basically control over Bitcoin (including the Satoshi stash that lays dormant in the BSV blockchain).I would have expected that Craig Wright had gained control of it by now. The fact that CSW cannot even reclaim coins on his own blockchain, even after introducing many new mechanisms like \"file a claim and gain anyone's coins\" (whatever that is?) goes on to show what a mockery Bitcoin SV is and that it will never have a real use case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "October 10, 2023, 10:32:54 AM",
      "body": "As far as I know, Bitcoin wasn't premined and since there are no facts to backup the claims, I'd say it just conspiracy theories and most conspiracy theories are not profitable to explore. A lot of people in altcoins community want to include Bitcoin is some of the imperfections of altcoins including:- Premine- Being Closed and Centralized, etc.Bitcoin is none of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "October 10, 2023, 10:52:17 AM",
      "body": "Quote from: nelson4lov on October 10, 2023, 10:32:54 AMAs far as I know, Bitcoin wasn't premined and since there are no facts to backup the claims, I'd say it just conspiracy theories and most conspiracy theories are not profitable to explore.If you can not remember, you can easily check fact with Bitcoin public ledger. If you don't run your Bitcoin full node, you can check it with Bitcoin block explorers.Bitcoin has a public ledger and all information about past blocks, transactions, new bitcoins added into circulating supply can all be checked with Block explorers.List of useful Bitcoin block explorers.If there is premined bitcoins, Satoshi Nakamoto can not hide it in Bitcoin source code and surely can not hide it from full nodes or Bitcoin block explorers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}