{
  "id": "topic_5493548",
  "title": "Moreno233",
  "author": "Moreno233",
  "created_time": "April 20, 2024, 08:40:16 AM",
  "content": "Bitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. The implication of this will be that miners will have lower reward for mining Bitcoin which will lead to reduction in the quantity of free Bitcoin entering the market. As expected, this is meant to create scarcity and in turn increase in the price of Bitcoin. Many predictions have been made and that leaves one to imagine:What path will Bitcoin chose following the halvingIf this event will lead to more Bitcoin related innovations?If this will lead to more people getting involved in BitcoinWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5493548",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "April 20, 2024, 09:10:56 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhat path will Bitcoin chose following the halvingBitcoin didn't choose, the market do.QuoteIf this event will lead to more Bitcoin related innovations?Nope, actually this time halving event lead more exploit to Bitcoin on chain, read Runes Protocol Launches on Bitcoin, Sending Fees Soaring as Users Rush to Mint Tokens.QuoteIf this will lead to more people getting involved in BitcoinHigh likely, people always forecast something by taking look the history. Since the last three halving events always make Bitcoin price rise around 2-3x, so they will expect like that and only sell when the price at least hit $100K.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alone055",
      "created_time": "April 20, 2024, 09:30:01 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhat path will Bitcoin chose following the halvingWe will find out shortly, I guess.Quote from: Moreno233 on April 20, 2024, 08:40:16 AMIf this event will lead to more Bitcoin related innovations?I'm not sure because other than the fact that the block reward has been cut in half, nothing else changed. The only thing that might trigger more innovations is the increment in the adoption level of Bitcoin because of the halving.Quote from: Moreno233 on April 20, 2024, 08:40:16 AMIf this will lead to more people getting involved in BitcoinSure, that's the basic reason why halving is considered to be the reason behind a bull run because more people get involved, hence the price increases because of the increasing demand.Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. The halving doesn't magically make the price go up, it hasn't been one day yet, we will see the effects based on how investors react to the halving. The positive side will only be seen if there is money flowing in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoWODL",
      "created_time": "April 20, 2024, 09:50:01 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMBitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. The implication of this will be that miners will have lower reward for mining Bitcoin which will lead to reduction in the quantity of free Bitcoin entering the market. As expected, this is meant to create scarcity and in turn increase in the price of Bitcoin. Many predictions have been made and that leaves one to imagine:What path will Bitcoin chose following the halvingIf this event will lead to more Bitcoin related innovations?If this will lead to more people getting involved in BitcoinWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. Bitcoin halving occurs every four years in Bitcoin history. We may be witnessing the fourth Bitcoin halving this year. Bitcoin halving is already complete due to which many people in the forum are exchanging wishes for the 4th Bitcoin halving among all Bitcoin lovers. Whenever Bitcoin halving is organized the block reward for miners is reduced by 50% i.e. halved.It is not yet clear to us where the price of Bitcoin will go after the Bitcoin Halving because the Bitcoin Halving has just been completed. Not even a day has passed since bitcoin halving is organized so maybe we should be a little patient and focus on the market.Already but day by day the popularity of Bitcoin is increasing and most people are willing to invest in Bitcoin or choose Bitcoin. Bitcoin has now become the focus of people's demand as the price of Bitcoin has increased exponentially. I think that as long as cryptocurrencies exist, Bitcoin's popularity will spread much more globally and people will involve themselves in Bitcoin much more.Everyone is positive about bitcoin halving everyone thinks that we will see an upward trend in the market after bitcoin halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "un_rank",
      "created_time": "April 20, 2024, 09:53:40 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhat path will Bitcoin chose following the halvingIf history is anything to go by there will be no effect on the price for some time. The real impact of the drop in supply injection into the market should be felt early next year to late 2025. I am expecting a price of $125,000+Quote from: Moreno233 on April 20, 2024, 08:40:16 AMIf this event will lead to more Bitcoin related innovations?It is just a halving, it does not change anything on the network.Quote from: Solosanz on April 20, 2024, 09:10:56 AMNope, actually this time halving event lead more exploit to Bitcoin on chain, read Runes Protocol Launches on Bitcoin, Sending Fees Soaring as Users Rush to Mint Tokens.Halving did not lead to this, the developers just choose block number 840000 as their launch time. It has no relationship with the halving.- Jay -",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "April 20, 2024, 09:55:25 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhat path will Bitcoin chose following the halvingBitcoin does not choose anything. It is coded by Satoshi Nakamoto, and mined by miners. It is traded by investors and traders and price will depend on Supply and Demand Principle.After a halving, future supply for next 210,000 will have half of previous 210,000 blocks. Halving helps demand on Bitcoin to increase so you can see, less future new supply, bigger demand, what about price?QuoteIf this event will lead to more Bitcoin related innovations?Innovations or new upgrades on Bitcoin protocol don't depend on Bitcoin halving. Developers work daily to upgrade Bitcoin protocol, from idea to code, test with test net before a deployment on main net. If you see an upgrade after a halving, it does not mean Bitcoin developers only develop it after halving, but they did it months or years before the halving.QuoteIf this will lead to more people getting involved in BitcoinYes, it will. More noise on media, more free advertisement for Bitcoin, more people will get involve in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "April 20, 2024, 09:56:50 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMBitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. Really?  I suppose I'm a 'bitcoin lover' and I couldn't care less about the halvings because I'm not a miner.  On top of that, there's really no reason to look forward to a halving since there's no guarantee whatsoever the market is going to go in any direction at all because of one.  I seriously don't understand why people think there's always going to be a huge price increase because the block reward gets cut in half.  Sometimes I think folks think the supply of bitcoin decreases (which might indeed cause its value to rise) with a halving, but that isn't the case.Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. Let them keep wondering until they understand what drives markets--and more importantly in this case, what doesn't.Quote from: cryptoWODL on April 20, 2024, 09:50:01 AMAlready but day by day the popularity of Bitcoin is increasing and most people are willing to invest in Bitcoin or choose Bitcoin. WOW.  I haven't seen a generic sentence like that in a few years.  Didn't realize people were still writing crap like the above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "April 20, 2024, 10:00:09 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. It seems like halving is kind of what kick starts the bullish season.We are now definitely going to look at an increase of activity in the market but we shall remember to be patient as it is not all going to happen right away. It might still go down for a bit for one last time and we should take that as an opportunity to get more coins to hold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "April 20, 2024, 10:21:54 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhat path will Bitcoin chose following the halvingI think this question is wrong, there's a clear path where Bitcoin is going after the halving. So, it should be us that must choose our path after Bitcoin halving.Quote from: Moreno233 on April 20, 2024, 08:40:16 AMIf this event will lead to more Bitcoin related innovations?IMO that also includes more adoptions, so yes.Quote from: Moreno233 on April 20, 2024, 08:40:16 AMIf this will lead to more people getting involved in BitcoinYes, it's not just about people but also institutions that are known to the world of finances. The big brokers, and fin tech companies, they're already here and they don't want to miss this opportunity.Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. Don't look at the most recent effect, halving's effect is gonna take a while but it's better in the long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "April 20, 2024, 10:31:35 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMWhat path will Bitcoin chose following the halvingIt depends on how the overall market reacts and goes about the market. Bitcoin only reflects that of people’s perception about its value.QuoteIf this event will lead to more Bitcoin related innovations?Definitely but only because every day many people are trying their best to come up with new interesting ideas to make bitcoin or just the cryptocurrency field a better one than it is now. Most likely also that bitcoin will have more interest attached to it and more people would most likely try to attract new investors with new flashy projectsQuoteIf this will lead to more people getting involved in BitcoinLike I said I am certain that more people will grow interested in bitcoin as its price hikes up more and more it has always been expected that after a halving event it reaches a new ath all together",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rabata",
      "created_time": "April 20, 2024, 11:15:59 AM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMBitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. The implication of this will be that miners will have lower reward for mining Bitcoin which will lead to reduction in the quantity of free Bitcoin entering the market. As expected, this is meant to create scarcity and in turn increase in the price of Bitcoin. Many predictions have been made and that leaves one to imagine:What path will Bitcoin chose following the halvingIf this event will lead to more Bitcoin related innovations?If this will lead to more people getting involved in BitcoinWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. After much waiting the halving finally happened on Friday around 8pm and miners will receive 50% of their mining rewards. Before this halving the reward was 6.25 from now they will get mining reward at the rate of 3.125. We know that the total circulating supply of Bitcoin will be 2100000. All these bitcoins will be distributed to the network nodes. Miners will receive half the reward every four years. Miners received 10,500,000 bitcoins in the first halving and 5,250,000 in the second halving. 2,625,000 in the third halving and 1,312,500 coins in the fourth halving in this sequence. In this way the mining reward will continue to decrease.We cannot naturally say that the Bitcoin price will increase immediately after the halving happens. But if we look at the past halving's we have seen an increase in Bitcoin price after each halving. Like that year, there may be expectations this year too but it does not give any certainty.Bitcoin price will definitely grow as designed. Even if the miner is temporarily loss, it will recover on the other way. Particularly miners will get higher transaction fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "April 20, 2024, 12:57:54 PM",
      "body": "Quote from: The Sceptical Chymist on April 20, 2024, 09:56:50 AMQuote from: Moreno233 on April 20, 2024, 08:40:16 AMBitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. Really?  I suppose I'm a 'bitcoin lover' and I couldn't care less about the halvings because I'm not a miner.  On top of that, there's really no reason to look forward to a halving since there's no guarantee whatsoever the market is going to go in any direction at all because of one.  I seriously don't understand why people think there's always going to be a huge price increase because the block reward gets cut in half.  Sometimes I think folks think the supply of bitcoin decreases (which might indeed cause its value to rise) with a halving, but that isn't the case.At some point, we can say that halving is not something that miners like because they receive less reward and have to mine without seeing a profit for a while until the price goes up. Btw there is a reason to look forward to a halving. When halving happens, miners mine 50% less coins, this means that in order for mining to be profitable, price has to rise and cover the loss that miners face because of halving or otherwise miners will shut down their miners and won't mine. I know that difficulty will decline and there will still be someone to mine but everyone wants to stay in the business. Also, halving attracts media attention, everyone has a positive attitude and everyone thinks that the price is going to rise. This results in a significant bullish market that lasts for a year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "April 20, 2024, 01:48:26 PM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMBitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. The implication of this will be that miners will have lower reward for mining Bitcoin which will lead to reduction in the quantity of free Bitcoin entering the market. As expected, this is meant to create scarcity and in turn increase in the price of Bitcoin. Many predictions have been made and that leaves one to imagine:What path will Bitcoin chose following the halvingIf this event will lead to more Bitcoin related innovations?If this will lead to more people getting involved in BitcoinWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. A lot of communities expected this bitcoin halving, to be honest. There are others who expect that it is possible that bitcoin is already at 80k-100k. But of course, what happened is not like that; instead, the rally that they expect in bitcoin halving itself happened last month, where from 49k$ something of bitcoin, bitcoin reached the new ATH of around 73k$ something.And now I think in 2-4 months there will be a deep correction that is around 30%, and from what I saw based on the analysis I did, less than 30% happens in the retracement; I just don't know what depth it will drop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "April 20, 2024, 03:15:20 PM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMBitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. The implication of this will be that miners will have lower reward for mining Bitcoin which will lead to reduction in the quantity of free Bitcoin entering the market. As expected, this is meant to create scarcity and in turn increase in the price of Bitcoin. Many predictions have been made and that leaves one to imagine:What path will Bitcoin chose following the halvingIf this event will lead to more Bitcoin related innovations?If this will lead to more people getting involved in BitcoinWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. OP is this your first Bitcoin halving event? You should just relax and see how this goes then you will end up with atleast a bitcoin halving experience, this will be my third halving experience. The only way to find out is wait, let's see what unfolds in the next two or three months time, but if I have to use the past data, I expect price increase by the year ending, my advice to everyone that are investing is to keep on using their DCA strategy non-stop, we don't know how deep this correction will be or if it will even happen at all. Runes and ordinals is why the Bitcoin transaction fee is presently massive right now, I am folding my hands to see where this will lead soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc_angela",
      "created_time": "April 20, 2024, 03:18:44 PM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMBitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. The implication of this will be that miners will have lower reward for mining Bitcoin which will lead to reduction in the quantity of free Bitcoin entering the market. As expected, this is meant to create scarcity and in turn increase in the price of Bitcoin. Many predictions have been made and that leaves one to imagine:What path will Bitcoin chose following the halvingIf this event will lead to more Bitcoin related innovations?If this will lead to more people getting involved in BitcoinWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. Maybe just look at the past historical logs and maybe you can find the answer,1. We as investors, whales and average joe will lead the path for bitcoin. And as we can see, there are predictions that we will hit 6 digits as our all time high for this halving or bull run.2. What do you mean? we have LN already and maybe some L2 innovations but I don't think there will be more.3. We don't have the numbers, but every bull run, we've seen bitcoin enthusiast grows so yeah, maybe it will lead more people getting themselves involved in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Essential10",
      "created_time": "April 20, 2024, 03:38:32 PM",
      "body": "Bitcoin halved today, it's hard to say whether the price of Bitcoin will go up or down in the future because we are in the present. We will have to keep an eye on the market for quite some time in which direction Bitcoin is going or will go. Now, Bitcoin is the current focus of people in cryptocurrencies World. I don't know what everyone else is thinking but I think Bitcoin will continue to rise slowly in the future, maybe it will take a long time to reach the target, maybe next year. However, I think Bitcoin will show an upward trend very soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jon pyagbara",
      "created_time": "April 20, 2024, 03:43:24 PM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMBitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. The implication of this will be that miners will have lower reward for mining Bitcoin which will lead to reduction in the quantity of free Bitcoin entering the market. As expected, this is meant to create scarcity and in turn increase in the price of Bitcoin. Many predictions have been made and that leaves one to imagine:What path will Bitcoin chose following the halvingIf this event will lead to more Bitcoin related innovations?If this will lead to more people getting involved in BitcoinWhile I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. Bitcoin will take a completely different path this time from the regular path after this halving, as analysing the three previous halving events, there are differences between them and this one, In other halving events specifically the halving event of 2020, Bitcoin didn't break it's ATH before the 2020 halving event, but leading to the halving event of this year Bitcoin broke its ATH on several occasions,  and at such I see a change in direction for Bitcoin after this halving event,  maybe it will break this current ATH and subsequently be valued at twice its current price then I don't see it happening immediately, maybe after a year or two .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "April 20, 2024, 03:54:52 PM",
      "body": "i'm quite optimistic that after this halving the bitcoin market will develop in a better direction compared to before. even though there are predictions that say that we will experience a decline in prices before entering a bull market, that will not stop people from being able to access and invest in bitcoin.and talking about innovation related to bitcoin, i don't know what you mean because bitcoin is quite good now. if there is some issue with it, maybe it will be fixed by bitcoin dev in the updates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "April 20, 2024, 04:02:13 PM",
      "body": "What's next? i guess to suffer higher and higher transaction fees, well, since bitcoin mining reward is cheap by numbers unlike before. Miners will need source of profit, which is the transaction fees. And yes, they love it when transaction fees soars while the community and average users suffers",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "April 22, 2024, 06:02:59 PM",
      "body": "Quote from: Moreno233 on April 20, 2024, 08:40:16 AMBitcoin halving was one of the greatest events all Bitcoin lover have been looking forward to. The implication of this will be that miners will have lower reward for mining Bitcoin which will lead to reduction in the quantity of -cut-While I am optimistic that market will respond positively to the halving, initial reaction does not seem to support that, hence many will be wondering what is going on. Thanks for asking this question, and IMO we should not call halving will cause the reduction of free BTC entering the Market as nothing is free here, BTC mining is very expensive gear and sources wise. A single/alone miner can't make enough money that can make him rich overnight or even over a month. And I am also a BTC lover and I have been waiting for halving not because I am a miner but because halving cut the supply by half as you aforementioned, and according to historical data, price of BTC always increases after the halving, but no one knows how long the bull season is going to continue as its hard to judge the top maybe we have already touched the top or maybe not.And I think more BTC-related innovation will take place, as I am already participating in many L2 and staking-type projects related to BTC as for airdrops, dapps integration, inscriptions are the things that we will see, further many projects have different ideas, the final decision is of a developer of BTC, as they will decide the future as nothing is happening against the BTC's whitepaper, but still some are liking the innovations and some are not. The answer to 2nd question is, that some will leave BTC and some will adopt it. With fee cutting half, some miners might leave this passion, as the USA is not implying 30% on electricity usage for BTC miners. I mean that's sucks. Quote from: The Sceptical Chymist on April 20, 2024, 09:56:50 AM I seriously don't understand why people think there's always going to be a huge price increase because the block reward gets cut in half.  Sometimes I think folks think the supply of bitcoin decreases (which might indeed cause its value to rise) with a halving, but that isn't the case.I would love to hear more, if you don't mind, as you are OG and you definitely have different POV here, I hope you won't mind.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}