{
  "id": "topic_5448153",
  "title": "blockchainpcn",
  "author": "blockchainpcn",
  "created_time": "April 09, 2023, 02:21:29 PMLast edit: April 11, 2023, 09:33:57 PM by Mr. Big",
  "content": "best Bitcoin ATM with low fees in USAideally with details of Markup % + Flat Fees + Miner fees would be good to compile all details. Y/N1)Phone Needed , is a phone number needed to do verification Y/N, Ideally no phone should be needed2)Email Needed, is an Email needed to do verification Y/N, Ideally no email should be needed3)Name Needed4)Government ID needed, is a Government ID needed to do verification Y/N, Ideally no Government ID should be needed5)Flat Fee, how much flat fee do they charge , e.g. 4.95$/buy ,this can be significant if they have a limit e.g. 500$/day , then this fee is 1% of trade6)Surcharge % : How much fee do they charge e.g. some ATMs charge upto 16%, ideally 5-8% ok digestible7)Miner Fee, Flat or % , some ATMs need a Miner fee which is added , further reducing the BTC you get8)Price Difference Markup , some ATMs show a higher price for BUYs, so that adds to the markup as well9) So your effective fee is  FlatFee+Surcharge+Markup+Miner. this sucks , but if we compile a list of these fees , everyone can make an infiormed decision",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448153",
  "comments": [
    {
      "author": "stompix",
      "created_time": "April 09, 2023, 06:59:20 PM",
      "body": "Unfortunately, you will not be able to get such a list simply because operators refuse to publish those and are changing them all the time.Same for regulations, you might get used to selling under $500 because there is no ID needed, and the next day you see that the ATM works only with an account, so you have to go to the operator's website, pass all KYC, and then make all the exchange on their app.Coinradar atm only gets 4% the rest offer no API so any information collected on the ground might be irrelevant tomorrow.https://coinatmradar.com/charts/buy-fees/united-states/Unfortunately, right now the best way to compare these when making a purchase is to do it on the day you want to buy and have all their apps installed and run a buy simulation, checking the available info will just get you outdated useless data.Anyhow, numbers 1-3 are mandatory on almost every Batm model, for number 4 if you go under $1000 there are still some options left like Coinhubatm and BitcoinDepot, of the top owners BATM owners are probably the few left.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockchainpcn",
      "created_time": "April 11, 2023, 04:11:07 AM",
      "body": "Bitcoin Depot 28% Markup + 3$ for Cash Purchase11% Markup + 3$ for Debit/Credit card purchases",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "April 12, 2023, 02:43:22 PM",
      "body": "Although probably a good idea I can't see this working well long term.Too many of them are constantly tweaking their rates. And they play games with the price too.Would you rather pay an 8% fee to buy with a BTC price of $29,920Or a 7.5% fee but they are still showing a BTC price of $30,500 You cannot rely on people to do it you would need to get the operators onboard to have some kind of a live API.And, sadly, the odds of that happening are just about 0.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}