{
  "id": "topic_5474604",
  "title": "illetyus",
  "author": "illetyus",
  "created_time": "November 18, 2023, 09:24:12 PMLast edit: November 18, 2023, 09:51:06 PM by illetyus",
  "content": "Goldfinch için özel bir başlık açayım dedim. Quote from: Bthd on November 08, 2023, 05:59:20 PMQuote from: Lachrymose on November 08, 2023, 04:39:07 PM2. Coinbase dışında hiçbir borsada listeli olmayan andreessen horowitz vb. yatırımcılardan yüklü para toplamış sürünen RWA: Goldfinch $GFI (Bthd'den arakladım)Real world assets (RWA) projelerinin önümüzdeki dönemin ilgi odağı olma olasılığı yüksek. Kripto - kripto kredilerine dayanan (DeFi) bir önceki serüvenden daha gerçekçi olacağı kesin. Goldfinch'i en son takip ettiğimde aktif loan miktarı 3m $ civarındaydı, şu an 100m olmuş. Kriptodan topladıkları stabil türevlerini az gelişmiş ülkelerin reel şirketlerine kredi imkanı olarak sunup bu işlem üzerinden faiz getirisi sunuyorlar. Doğrudan goldfinch başlığı açmayı düşünüyordum, eski dönemde açılmış bir adet var ama o daha ziyade airdrop ile ilgiliydi. GFI'nin airdrop vestingleri yaklaşık 1 sene önce bitti. Kilidi açılmamış miktar a16z - coinbase gibi yatırımcılar ve ekibin elinde. APY oranını arttırmak için havuzlarda Binde 25'lik oranla dağıtım yapıyorlar bu da oldukça küçük bir enflasyon ilk günlerde sahip olduğu enflasyona göre. Eğer RWA bir şekilde düşündüğüm gibi trend haline gelirse GFI o trendin aave(eski adıyla link)'si olur. Malı henüz ben almadığım için gönül rahatlığıyla yazabiliyorum, droptan aldığım miktarı 4,1$'dan satmıştım yüksek enflasyon sebebiyle. En kısa zamanda yollarımız tekrar kesişecek.Geçenlerde biraz alım yaptım ve uzun vadeli cüzdana salladım. 8-9x yapana kadar tutarım. 2x düşerse de ortalama düşürüp ekleme yapmayı düşünüyorum. Binance, Kucoin, OKX, Houbi gibi borsalarda listeli değil. Tier 1 olarak sadece Coinbase listelemesi var. Coingecko: https://www.coingecko.com/en/coins/goldfinchWeb sitesi: https://goldfinch.finance/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5474604",
  "comments": [
    {
      "author": "trendcoin",
      "created_time": "November 18, 2023, 10:53:26 PM",
      "body": "aave'nin eski adı lend'di. :) 2018'deki ayıda %25 zarar yazıp satmıştım, sonra çok para kazandırdı belki ama yıllarca sıfırı tüketerek dolaştı, milyarlarca dolarım olsa bile o psikolojiyi aşamazdım...rwa'lar beni de ikna ediyor ama uzun soluklu yatırım yapabileceğim bir coin veya token bulamadım. gfi'nin ekibi iyi, aldığı yatırımlar iyi ama günün birinde abd \"tokenize edilmiş nükleer santralleriniz var\" diyerek onların peşlerine takılabilir. :)ben yaşlı bir adamım, kalbim bu kadar büyük aksiyonları kaldırır mı emin değilim. :)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "November 19, 2023, 11:58:34 AM",
      "body": "Aslında token verilerine bakınca hiç fena durmuyor, cazip gelebilecek bir görünüşü var, ilk çıktığı zamandaki pump rakamlarını saymazsak fiyatı epeydir yatay bir seyir izlemiş. Gerçi bu durumda çok coin/token var ama sektörü, maksimum ve dolaşımdaki arzı vb nedenlerden dolayı ilgimi çekti doğrusu ve fekat şimdiden sonra, önümüz muhtemelen güzelken hemen hemen hepsi benzer potansiyel taşıyorlar, o nedenle şimdi girmek mantıklı mı, kendi adıma tartışılır.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mustang Shelby",
      "created_time": "November 19, 2023, 02:41:03 PM",
      "body": "Rank ve trade hacmi olarak çok düşük gördüğüm kadarıyla. Bu yüzden boğa döneminde eğer bahsedilen şekilde revaçta bir dönem yaşanırsa muhteşem kazançlar sağlayabilir. Bthd hocam söylüyorsa vardır bir bildiği. Ayrıca başlığı Raca olan iyi kazandıran geçmişe sahip bir OP bunu açıyorsa daha da dikkatli bakmak lazım bu projeye. Ufak ufak denemelik üç beş bir şeyler sallanabilir bence.Edit : Konuyu gospodin açtı sanmıştım. Bitvest imzaları yüzünden herkes birbirine karışıyor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "November 20, 2023, 10:21:36 AM",
      "body": "Quote from: Mustang Shelby on November 19, 2023, 02:41:03 PMRank ve trade hacmi olarak çok düşük gördüğüm kadarıyla. Bu yüzden boğa döneminde eğer bahsedilen şekilde revaçta bir dönem yaşanırsa muhteşem kazançlar sağlayabilir. Bthd hocam söylüyorsa vardır bir bildiği. Ayrıca başlığı Raca olan iyi kazandıran geçmişe sahip bir OP bunu açıyorsa daha da dikkatli bakmak lazım bu projeye. Ufak ufak denemelik üç beş bir şeyler sallanabilir bence.Edit : Konuyu gospodin açtı sanmıştım. Bitvest imzaları yüzünden herkes birbirine karışıyor Gospodin ilginç bi çar. Bazen mesaj gecmisine bakiyoruz yazdigi seyler 1000x yapmiş ama biz hiç sallamamişiz. çikip ben demistim de demiyor. bi de buyusu var genelde max 1000 dolar attigi mallar dehset prim yapar. bi mala 1000 dolar ustu attiysa o mal surundurur. iki uc yillik korelasyon bu sekilde devam ediyor Goldfinch’e gelecek olursak; dehset potansiyel var… Illetyus’la benzer taktikteyim",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 20, 2023, 02:08:43 PM",
      "body": "Quote from: Lachrymose on November 20, 2023, 10:21:36 AMQuote from: Mustang Shelby on November 19, 2023, 02:41:03 PMRank ve trade hacmi olarak çok düşük gördüğüm kadarıyla. Bu yüzden boğa döneminde eğer bahsedilen şekilde revaçta bir dönem yaşanırsa muhteşem kazançlar sağlayabilir. Bthd hocam söylüyorsa vardır bir bildiği. Ayrıca başlığı Raca olan iyi kazandıran geçmişe sahip bir OP bunu açıyorsa daha da dikkatli bakmak lazım bu projeye. Ufak ufak denemelik üç beş bir şeyler sallanabilir bence.Edit : Konuyu gospodin açtı sanmıştım. Bitvest imzaları yüzünden herkes birbirine karışıyor Gospodin ilginç bi çar. Bazen mesaj gecmisine bakiyoruz yazdigi seyler 1000x yapmiş ama biz hiç sallamamişiz. çikip ben demistim de demiyor. bi de buyusu var genelde max 1000 dolar attigi mallar dehset prim yapar. bi mala 1000 dolar ustu attiysa o mal surundurur. iki uc yillik korelasyon bu sekilde devam ediyor Goldfinch’e gelecek olursak; dehset potansiyel var… Illetyus’la benzer taktikteyimİlletyus’un başlıkları da çok iyi hocam, sanırım bir ara bitgesel imzasını da foruma duyurmuştu ve sonra inanılmaz katlamıştı, bekleten varsa haftalık 1000 dolardan fazla bir dönem para kazandığı olmuştu diye biliyorum, gospodin de çok iyi tespitleri olan bir abimiz, sizin de bir dönem çok iyi başlıklarınızı hatırlıyorum, siz de bu işin duayenlerindensiniz hocam, şu sıra AirDrop’lardan Jossque iyi kazandırdı, Forumun kısa özetinden sonra umarım yanılmazsınız çünkü bir süre sonra bundan alım yapmayı düşünüyorum  bir ara forumda çok sık adını gördüğümüz projeler çok iyi paralar kazandırmıştı, belki bu da onlardan olur,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 20, 2023, 03:23:05 PM",
      "body": "Quote from: Lachrymose on November 20, 2023, 10:21:36 AMQuote from: Mustang Shelby on November 19, 2023, 02:41:03 PMRank ve trade hacmi olarak çok düşük gördüğüm kadarıyla. Bu yüzden boğa döneminde eğer bahsedilen şekilde revaçta bir dönem yaşanırsa muhteşem kazançlar sağlayabilir. Bthd hocam söylüyorsa vardır bir bildiği. Ayrıca başlığı Raca olan iyi kazandıran geçmişe sahip bir OP bunu açıyorsa daha da dikkatli bakmak lazım bu projeye. Ufak ufak denemelik üç beş bir şeyler sallanabilir bence.Edit : Konuyu gospodin açtı sanmıştım. Bitvest imzaları yüzünden herkes birbirine karışıyor Gospodin ilginç bi çar. Bazen mesaj gecmisine bakiyoruz yazdigi seyler 1000x yapmiş ama biz hiç sallamamişiz. çikip ben demistim de demiyor. bi de buyusu var genelde max 1000 dolar attigi mallar dehset prim yapar. bi mala 1000 dolar ustu attiysa o mal surundurur. iki uc yillik korelasyon bu sekilde devam ediyor Goldfinch’e gelecek olursak; dehset potansiyel var… Illetyus’la benzer taktikteyim1.000 dolar muhabbeti gerçek, bu yüzden o tutarı geçmemeye çalışıyorum. rwa hakkında görüşümü diğer başlıklarda belirttim ama hype olacak ama bence bu hype kısa süreli olacak gibi duruyor. goldfinch benim de radarımda bulunan bir proje. elime gelen 3-5 kuruş ile maksimum 500 dolarlık toplamaya çalışacağım. ilk olarak projeyi koklamam lazım, yine de iyi yatırımcılara sahip. boş geçip kafayı dağlara taşlara vurmaya gerek yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 21, 2023, 01:15:54 PM",
      "body": "Quote from: gospodin on November 20, 2023, 03:23:05 PMQuote from: Lachrymose on November 20, 2023, 10:21:36 AMQuote from: Mustang Shelby on November 19, 2023, 02:41:03 PMRank ve trade hacmi olarak çok düşük gördüğüm kadarıyla. Bu yüzden boğa döneminde eğer bahsedilen şekilde revaçta bir dönem yaşanırsa muhteşem kazançlar sağlayabilir. Bthd hocam söylüyorsa vardır bir bildiği. Ayrıca başlığı Raca olan iyi kazandıran geçmişe sahip bir OP bunu açıyorsa daha da dikkatli bakmak lazım bu projeye. Ufak ufak denemelik üç beş bir şeyler sallanabilir bence.Edit : Konuyu gospodin açtı sanmıştım. Bitvest imzaları yüzünden herkes birbirine karışıyor Gospodin ilginç bi çar. Bazen mesaj gecmisine bakiyoruz yazdigi seyler 1000x yapmiş ama biz hiç sallamamişiz. çikip ben demistim de demiyor. bi de buyusu var genelde max 1000 dolar attigi mallar dehset prim yapar. bi mala 1000 dolar ustu attiysa o mal surundurur. iki uc yillik korelasyon bu sekilde devam ediyor Goldfinch’e gelecek olursak; dehset potansiyel var… Illetyus’la benzer taktikteyim1.000 dolar muhabbeti gerçek, bu yüzden o tutarı geçmemeye çalışıyorum. rwa hakkında görüşümü diğer başlıklarda belirttim ama hype olacak ama bence bu hype kısa süreli olacak gibi duruyor. goldfinch benim de radarımda bulunan bir proje. elime gelen 3-5 kuruş ile maksimum 500 dolarlık toplamaya çalışacağım. ilk olarak projeyi koklamam lazım, yine de iyi yatırımcılara sahip. boş geçip kafayı dağlara taşlara vurmaya gerek yok.1000 dolar muhabbetine hayranım, güzel bir stratejin var, Goldfinch benim de artık sizin sayenizde radarıma girmiş bulunuyor hocam, 500-1000 ufak ufak atmakta fayda var, uzun vadede sevinçli çıkabileceğimiz bir projeyi boş geçmemek gerekiyor kanımca, projeyi koklamam lazım demişsiniz ya, kokladıktan sonra buraya gereken şeyleri yazarsınız umarım",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "November 21, 2023, 01:49:13 PM",
      "body": "Yukarıları pek okumadım başlığı görünce atlıyım dedim konuya 2021 yılında açmıştım bunun başlığını ve büyük işler bekliyordum bu projeden ama olmadı, bir yerde bir şeyleri yanlış yaptılar sanki çünkü arkasında çok iyi yatırımcılar olan bir şirket.2022'den beri fiyat olarak düşüyor, ilk listelendiğinde 9-10 dolar arası gidip geliyordu şimdi baktım da 74 centten işlem görüyor.Her neyse belki bu boğada iyi bir performans sergileyebilir diğer projelere göre çünkü real de de kullanılan bir proje.https://bitcointalk.org/index.php?topic=5378300.msg58798244#msg58798244",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 21, 2023, 02:29:47 PM",
      "body": "Quote from: MK-74 on November 21, 2023, 01:49:13 PMYukarıları pek okumadım başlığı görünce atlıyım dedim konuya 2021 yılında açmıştım bunun başlığını ve büyük işler bekliyordum bu projeden ama olmadı, bir yerde bir şeyleri yanlış yaptılar sanki çünkü arkasında çok iyi yatırımcılar olan bir şirket.2022'den beri fiyat olarak düşüyor, ilk listelendiğinde 9-10 dolar arası gidip geliyordu şimdi baktım da 74 centten işlem görüyor.Her neyse belki bu boğada iyi bir performans sergileyebilir diğer projelere göre çünkü real de de kullanılan bir proje.https://bitcointalk.org/index.php?topic=5378300.msg58798244#msg58798244Hocam burada çok meşhur arkadaşların çoğu bundan umutlu, ben de bundan güç alarak bir miktar almayı düşünüyordum, sizin geçmiş paylaşımlarınız ile bugünkü fiyata bakarsak iyice karar veriyor gibiyim, mutlaka burada bir rağbet olacak ve bu proje bunda önü alabilecek hisselerden olacak diye hissediyorum, umarım yanılmayız ve kazançlı çıkarız,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 21, 2023, 03:17:53 PM",
      "body": "goldfinch'in sitesinden kredi verdiği havuz mu diyeyim firma mı diyeyim işte o bokları takip edebiliyorsunuz. krediler karşısında teminat gibi olayları sanırım katılan kişiler görebiliyor ama bana yine de çok fazla güven vermiyor. kripto para piyasasını batıracak bir şey varsa o da gerçek dünya dostlar. kredi verilen ülkeler deseniz tamamen ofsayt anasını satayım. ha yine de hype burada yapacak bir şey yok.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "November 21, 2023, 09:40:26 PM",
      "body": "Quote from: kriminall on November 21, 2023, 02:29:47 PMQuote from: MK-74 on November 21, 2023, 01:49:13 PMYukarıları pek okumadım başlığı görünce atlıyım dedim konuya 2021 yılında açmıştım bunun başlığını ve büyük işler bekliyordum bu projeden ama olmadı, bir yerde bir şeyleri yanlış yaptılar sanki çünkü arkasında çok iyi yatırımcılar olan bir şirket.2022'den beri fiyat olarak düşüyor, ilk listelendiğinde 9-10 dolar arası gidip geliyordu şimdi baktım da 74 centten işlem görüyor.Her neyse belki bu boğada iyi bir performans sergileyebilir diğer projelere göre çünkü real de de kullanılan bir proje.https://bitcointalk.org/index.php?topic=5378300.msg58798244#msg58798244Hocam burada çok meşhur arkadaşların çoğu bundan umutlu, ben de bundan güç alarak bir miktar almayı düşünüyordum, sizin geçmiş paylaşımlarınız ile bugünkü fiyata bakarsak iyice karar veriyor gibiyim, mutlaka burada bir rağbet olacak ve bu proje bunda önü alabilecek hisselerden olacak diye hissediyorum, umarım yanılmayız ve kazançlı çıkarız,Hocam kripto burası burada her şey olabilir olmaz diyene çokta bakma yani, belki dediğiniz gibi baya bir yükseliş gösterecek bu token, ben geçmişte olmuşları belirttim, o fiyatlardan buralara düşmüş geri çıkmaması için bir neden yok, sadece pazarlamaya önem vermeliler, dediğim gibi arkasındaki yatırımcılarda baya iyi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 22, 2023, 08:34:21 AM",
      "body": "Quote from: MK-74 on November 21, 2023, 01:49:13 PMYukarıları pek okumadım başlığı görünce atlıyım dedim konuya 2021 yılında açmıştım bunun başlığını ve büyük işler bekliyordum bu projeden ama olmadı, bir yerde bir şeyleri yanlış yaptılar sanki çünkü arkasında çok iyi yatırımcılar olan bir şirket.2022'den beri fiyat olarak düşüyor, ilk listelendiğinde 9-10 dolar arası gidip geliyordu şimdi baktım da 74 centten işlem görüyor.Her neyse belki bu boğada iyi bir performans sergileyebilir diğer projelere göre çünkü real de de kullanılan bir proje.https://bitcointalk.org/index.php?topic=5378300.msg58798244#msg58798244O zaman dikkatimi çekmemiş ama şuan için gfi ümitli olduğum bir proje. O başlığa baktım @bthd hocamız 20$ ile açıldığını ve 30$'ı gördüğünü belirtmiş. Bu beklenen boğada Ath yapsa yeter bize.Dolaşım miktarı toplam miktarı düşünüldüğü zaman neden olmasın. Yalnız biraz uyuz eşek gibi gidiyor.. şöyle kırat ya da Demirkır gibi gitmiyor. Bekleyeceğiz bakalım",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kriminall",
      "created_time": "November 23, 2023, 02:50:07 PM",
      "body": "Quote from: ajanwalker on November 22, 2023, 08:34:21 AMQuote from: MK-74 on November 21, 2023, 01:49:13 PMYukarıları pek okumadım başlığı görünce atlıyım dedim konuya 2021 yılında açmıştım bunun başlığını ve büyük işler bekliyordum bu projeden ama olmadı, bir yerde bir şeyleri yanlış yaptılar sanki çünkü arkasında çok iyi yatırımcılar olan bir şirket.2022'den beri fiyat olarak düşüyor, ilk listelendiğinde 9-10 dolar arası gidip geliyordu şimdi baktım da 74 centten işlem görüyor.Her neyse belki bu boğada iyi bir performans sergileyebilir diğer projelere göre çünkü real de de kullanılan bir proje.https://bitcointalk.org/index.php?topic=5378300.msg58798244#msg58798244O zaman dikkatimi çekmemiş ama şuan için gfi ümitli olduğum bir proje. O başlığa baktım @bthd hocamız 20$ ile açıldığını ve 30$'ı gördüğünü belirtmiş. Bu beklenen boğada Ath yapsa yeter bize.Dolaşım miktarı toplam miktarı düşünüldüğü zaman neden olmasın. Yalnız biraz uyuz eşek gibi gidiyor.. şöyle kırat ya da Demirkır gibi gitmiyor. Bekleyeceğiz bakalım Ath yapsa yeter bize dediğiniz 30 dolar ise 35 kat artması demek, ne demek yeter, sülalemize yeter yatıracağımız parayla hocam  düşünsenize 1 milyon lirayı 35 milyon lira yaptığınızı, bu kadar uçuk kazançlar elbet beklemiyorum ama hayal etmesi bile güzel, önemli olan proje iş yapacak mı yapmayacak mı, ath yapacak diye beklerken diğer fırsatları kaçırmayalım da,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gospodin",
      "created_time": "November 23, 2023, 03:57:59 PM",
      "body": "dün bir arkadaşa goldfinch'i önerdim ve kendisi akşam alacağını söyledi. peki, bilin bakalım kendisi ne yaptı? tabii ki de gidip gfi'yi almamış. bu sabah kendisine %70'lik yükselişin ekran görüntüsünü attım. bir günde gelen bu yükseliş şansa oldu ama arkadaş şimdiden üzülmeye başladı. dün akşamki yaşanan yükselişin sebebini bilen var mı dostlar? bir de takip kişiler varsa yükseliş sizce yalan mı yoksa ileride de devam edebilecek mi?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "illetyus",
      "created_time": "November 23, 2023, 04:09:50 PM",
      "body": "Quote from: gospodin on November 23, 2023, 03:57:59 PMdün bir arkadaşa goldfinch'i önerdim ve kendisi akşam alacağını söyledi. peki, bilin bakalım kendisi ne yaptı? tabii ki de gidip gfi'yi almamış. bu sabah kendisine %70'lik yükselişin ekran görüntüsünü attım. bir günde gelen bu yükseliş şansa oldu ama arkadaş şimdiden üzülmeye başladı. dün akşamki yaşanan yükselişin sebebini bilen var mı dostlar? bir de takip kişiler varsa yükseliş sizce yalan mı yoksa ileride de devam edebilecek mi?Sebebi yok. Listemele var mı diye baktım göremedim. Coinbase ve a16z grubu kriptoda savaşı kazandı. Bu tokenlerin cogu bu grubun elinde. Yükselisin nedeni bir açıdan bu bence.  Binance grubunun elinde olan bir coin değil  temiz. Trade yapmaya kalkanı anında terste birakiyor. Ben uzun vade diye long term cüzdana atmıştım. Kısa sürede 2x yaptığı için dün akşam yarısını sattım. Diğer yarısına 4 dolarda 1/2 kesik daha atarım. Bir sonraki kesik 8 dolarda olur. Asla tamamını satmam. Link gibi yardirdirsa got gibi ekrana bakmak acı veriyor..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lachrymose",
      "created_time": "November 23, 2023, 04:51:03 PM",
      "body": "Bu malı hayatta satmam",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "November 23, 2023, 04:55:10 PM",
      "body": "Quote from: gospodin on November 23, 2023, 03:57:59 PMdün bir arkadaşa goldfinch'i önerdim ve kendisi akşam alacağını söyledi. peki, bilin bakalım kendisi ne yaptı? tabii ki de gidip gfi'yi almamış. bu sabah kendisine %70'lik yükselişin ekran görüntüsünü attım. bir günde gelen bu yükseliş şansa oldu ama arkadaş şimdiden üzülmeye başladı. dün akşamki yaşanan yükselişin sebebini bilen var mı dostlar? bir de takip kişiler varsa yükseliş sizce yalan mı yoksa ileride de devam edebilecek mi?Başkan bir çok kişi boğa gelecek vs diyor ama bundan öncede boğanın ne zaman nasıl nasıl geldiğini bilen eden yok. Bence şuan boğa piyasasının başındayız ve daha gfi nin yolu var. Rwa'larda şuan iyi artış var. Stbu marketcap olarak çok güdük kaldı onu da dikkate alın derim ama yine de ytd diyeyim ne olur ne olmaz",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "illetyus",
      "created_time": "November 23, 2023, 05:23:50 PM",
      "body": "Ulan iyi ki girmişiz buna. Eski coinleri tutmak pek akıl karı değil. Böyle bakireleri seçmek lazım.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "November 23, 2023, 06:37:16 PM",
      "body": "@illetyus 2x yapıp ana parayı alarak yola devam ediyorum teşekkür ederim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}