{
  "id": "topic_5477069",
  "title": "NeilLostBitCoin",
  "author": "NeilLostBitCoin",
  "created_time": "December 08, 2023, 04:39:54 PM",
  "content": "Base sa aking experience sa paghahanap ng mga Nodes project, pagsali at pag bili ng mga VPS. Ang  reliable talaga na service ay Contabo, ilang buwan nadin walang palya ang kanilang serbisyo 24/7 kaya ito ang masusuggest kong subok na. At karamihan din sa discord kong napasukan ito din ang sinusuggest nilang cheap na VPS compare sa ibang mga VPS. Ang cheapest na VPS nila dito ay nagkakahalaga lamang ng $5.5 kung sa pera natin ay nasa $5.5 x 56 = 308 php per month. Mura nato compared sa mga sinusuggest ng mga nasa twitter usually ang sinusuggest nila ay nasa 10-30 USD each month. Pero siyempre iba iba ang specification nila dito. Meron din namang mataas na option sa Contabo na nagkakahalaga ng $12.50, $21.50, $40.00, at $77.00. Pero kahit pag komparahin mo itong specification ng contabo sa iba mas mura talaga ang matataas na specification nila. Mas makakamura sa EURO kung pinalitan niyo yung currency. Mostly din ang ginagamit at nirerequire ng mga NODE project ay yung specification ng $5.5 na pinaka mura na inooffer ng CONTABO na may specification na 4 vCPU Cores, 8 GB RAM, 50 GB NVMe o 200 GB SSD. Gaya ng Myria Node, XAI Node at marami pang iba. Hindi naman kailangan sobrang taas ng specification minsan, at minsan din hindi need irun ng 24 hours ang mga node, yung iba gaya ng myria need lang ng 6 hours per day kaya yung iba gumagawa ng script para irun ang nodes nila sa iisang VPS tapos may nakalagay na tatlong myria nodes. Ang risk lang dito sa tatlong nodes isang vps ay pag hindi nagrun ng maayos ang VPS sa isang araw na which is rare naman mangyari sa contabo base sa experience ko.Note: Hindi ko sinusuggest/promote yung mga nodes na nabanggit ko, sinabi ko lang as example. Sobrang mahal ng mga may daily rewards na nodes gaya ng Myria kaya if ever man hindi ko kayo hinihikayat baka kasi hindi niyo mabawi or yung project is hindi magtuloy ako pa ang masisi.MGA KAILANGAN SA PAGBILI NG VPS SA CONTABO1. Online Payment Card, meron yung MAYA at GCASH niyan para sa mga online purchases.2. PeraSteps kung paano bumili ng VPS sa CONTABO1 . Basahin muna ang gusto mong salihan or bilhin na node kung anong requirement ng Node na irurun mo. Make sure na tama ang iyong pipiliin na specification para hindi ka madouble gastos. 2.  Pag nakapili kana ng Specific VPS na tama sa iyong binabalak na node iselect mona. 3.  May option sa una na kung ilang buwan mo ito gagamitin. Ang mga pagpipilian ay 1 month, 3 months, 6 months at 12 months. Siyempre nasa sayo yan kung ilang buwan mo ito balak gamitin. Note: May dagdag fee na setup fee yung mga mas mababang buwan na subscription, kaya if long term kang magrurun ng node sinusuggest ko talaga na 12 months na kunin mo.4.  Pangalawang pagpipilian ang region, hindi kona binabago ito dahil hindi naman mahalaga yung region sa requirement ng node na pinaparun ko. At sa free lang ako usually. Yung ibang option may dagdag bayad.5.  Storage type, gaya ng mga nasa taas depende ito sa kailangan ng iyong node na irurun. So dapat alamin mo talaga if enough ba para sa long term mag run parin yung node mo.6.  OS, lahat ng pinaparun ko ngayon ang ginagamit ay ubuntu 20.04, pero depende sa balak mong irurun na node, kung sabi sa tutorial na debian 11, edi yun ang sundin mo.7.  Login at password, dito ito pinaka mahalaga, default na yang root pero kung anong gusto mong ipangalan ikaw bahala, kahit sa password basta ang mahalaga tandaan mo itong mga ilalagay mo dito.8.  Hindi kona ginalaw yung ibang option dahil hindi na kailangan sa mga nirurun kong node yung mga yun. Click next if gusto monang bilhin at tama na lahat ng specification na need mo.Naka 2 server nga pala ako dahil ayan need ko para mairun yung nabili kong myria node at xai node. Isa lang if isa lang need mo.9.  Lagay mo lang lahat ng information mo sa mga fifillupan, then next.10.  Lagay mo yung Online Payment Card na gamit mo para bayaran na ito. Wala man 5 minutes dadating ito agad sa email mo yung mga login details. Ganun lang kasimple bumili ng node, sana makatulong dahil parami na ng parami ang mga project sa crypto na may nodes. Sana pumaldo tayo bago matapos ang taon. Salamat",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477069",
  "comments": [
    {
      "author": "tech30338",
      "created_time": "December 10, 2023, 12:49:12 AM",
      "body": "add ko lang na mas okay pagmay promo sila na walang one time setup fee, pero pag walang promo meron silang setup fee for the first time, so dapat tinitignan din natin ang mga promos nila para mas makamura tayo sa VPS",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeilLostBitCoin",
      "created_time": "December 10, 2023, 04:09:57 PM",
      "body": "Quote from: tech30338 on December 10, 2023, 12:49:12 AMadd ko lang na mas okay pagmay promo sila na walang one time setup fee, pero pag walang promo meron silang setup fee for the first time, so dapat tinitignan din natin ang mga promos nila para mas makamura tayo sa VPSOo kabayan pero usually kasi ako kinukuha kona pang matagalan talaga na isang taon para minsanang bayaran at walang setup fee kahit pa walang promo. Nasa sakanila nalang kabayan kung hihintayin paba nila yung promo na yun, kasi ngayon baka mapag iwanan na sila kung mag aabang lang para dun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}