{
  "id": "topic_5438348",
  "title": "GazetaBitcoin",
  "author": "GazetaBitcoin",
  "created_time": "February 06, 2023, 10:48:33 AMLast edit: February 06, 2023, 04:48:24 PM by GazetaBitcoin",
  "content": "Autor: GazetaBitcoinTopic original: The Crypto Anarchist Manifesto - We all should read itCa o continuare a topicului lui bitmover, un alt articol care trebuie neaparat citit este Manifestul Crypto Anarhic, scris de by Tim May.Eseul a fost publicat pentru prima dată în 1988 (cu 4 ani mai devreme decât articolul Manifestul Cypherpunk, scris de Eric Hughes), la conferința Crypto '88, și prezintă extraordinara viziune a lui Tim May asupra unor aspecte care au devenit realitate peste 30 de ani.Manuscrisul detaliază modul în care tehnologia bazată pe criptografie și sisteme de reputație va schimba lumea așa cum o știm, inclusiv guvernele, taxele sau controlul economic:\"Tehnologia computerizată este pe cale de a oferi oamenilor și grupurilor de oameni abilitatea de a comunica și interacționa unii cu ceilalți într-o manieră complet anonimă. Două persoane vor putea schimba mesaje, face afaceri și vor putea negocia contracte electronice fără ca vreuna să cunoască Numele Real sau identitatea celeilalte. Interacțiunile în rețea nu vor mai putea fi urmărite, prin intermediul unei re-rutări extensive a pachetelor criptate și a unor blocuri imuabile care implementează protocoale criptografice care oferă protecție aproape perfectă la încercările de manipulare. Reputațiile vor avea o importanță centrală, devenind mult mai importante în afaceri chiar și decât scorurile de credit din ziua de astăzi. Aceste descoperiri vor schimba complet natura reglementărilor guvernamentale, abilitatea de taxare și control a interacțiunilor economice, abilitatea de a păstra secretă informația și va schimba chiar și natura încrederii și a reputației.\".Cu siguranță, viziunea lui May în domeniul crypto este precum cea a lui Jules Verne în science-fiction.În doar câteva cuvinte el a expus atâtea descoperiri tehnologice, precum contractele inteligente, Tor, tehnologia Bitcoin sau sistemul de reputație (care este folosit, de pildă, pe BitcoinTalk în forma sistemelor de Merit și Încredere).Referirea la “Numele Real” poate fi inspirată din romanul lui Vernor Vinge \"True Names\" (1981), care este o capodoperă.Tim May a anticipat și apariția piețelor negre și lupta guvernului de a bloca accesul oamenilor la informație:\"Desigur, Statul va încerca să încetinească sau să oprească răspândirea acestei tehnologii, motivând că afectează securitatea națională, că tehnologia va fi utilizată de vânzătorii de droguri și de evazioniști, sau că va conduce la dezintegrare socială. Multe din aceste îngrijorări vor fi valide; crypto anarhia va permite transmiterea pe cale liberă a secretelor naționale și va permite tranzacționarea mărfurilor ilicite și furate. O piață anonimă computerizată va face posibilă chiar și existența unor piețe oribile pentru asasinate și șantaje. Diverșii infractori și elementele străine vor fi utilizatori activi pe CryptoNet. Dar asta nu va împiedica răspândirea crypto anarhiei.\".Eseul se încheie cu \"Ridicați-vă, nu aveți nimic de pierdut în afara gardurilor voastre de sârmă ghimpată!\". Gardurile de sârmă ghimpată sunt cunoscute de americani. Sunt o parte a istoriei lor: teritoriile vestice aveau astfel de garduri pe post de hotar iar celebrii cowboys, care doreau libertate, le tăiau. Propoziția este un îndemn la luptă împotriva corupției și a oprimării exercitate de guvern. Împotriva eforturilor agențiilor secrete care încearcă să blocheze accesul la informație.Cu toții ar trebui să continuăm munca începută de Cypherpunks și să luptăm pentru libertate!Topicul este auto-moderat pentru evitarea spam-ului.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438348",
  "comments": []
}