{
  "id": "topic_5449491",
  "title": "CYBER_COWBOY",
  "author": "CYBER_COWBOY",
  "created_time": "April 19, 2023, 07:18:32 PMLast edit: July 29, 2023, 11:36:59 PM by CYBER_COWBOY",
  "content": "💸⭐ Have any ideas? Share it here! ⭐💸- I ain't a professional gambler, I just gamble for fun, so my tips never has any guarantees -- all my odds is from gamdom -",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449491",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "April 19, 2023, 07:50:10 PM",
      "body": "Go to gambling discussion , you will see popular leagues like EPL, La Liga, Seria A and many others there. Click on the one you want to share your betting tips and discuss about it. If you do not see the one that you want there, use the forum search engine to know if you will find it, if you did not see it, you can create a new thread for such league discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CYBER_COWBOY",
      "created_time": "April 19, 2023, 07:56:42 PMLast edit: April 19, 2023, 08:10:00 PM by CYBER_COWBOY",
      "body": "Quote from: Oshosondy on April 19, 2023, 07:50:10 PMGo to gambling discussion , you will see popular leagues like EPL, La Liga, Seria A and many others there. Click on the one you want to share your betting tips and discuss about it. If you do not see the one that you want there, use the forum search engine to know if you will find it, if you did not see it, you can create a new thread for such league discussion. Hi and thanks for your reply friend  I know about that. but think its easier to just have a thread for tips where you can share all leagues instead of only one specific league & sport, here you can share bets from all leagues & sports combined, witch is how many people put their bets togheter.  For example I want to play and give tips about a double with one game from La Liga and one from Premier League.. many people will miss it out if i post in a specific league.This is just about give some betting tips no mather league or sport to all the other people on the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "decodx",
      "created_time": "April 19, 2023, 08:18:12 PM",
      "body": "Quote from: CYBER_COWBOY on April 19, 2023, 07:56:42 PMThis is just about give some betting tips no mather league or sport to all the other people on the forum  I'm not sure if having a thread for sharing tips across all leagues and sports would be beneficial. Many gamblers prefer to focus on the sports and leagues they know best. That's probably why we have multiple threads in the Gambling discussion. But, it could be interesting to explore both options and see what works best for our community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Get-Paid.com",
      "created_time": "April 19, 2023, 08:53:05 PM",
      "body": "This is our tip for the Rosa vs Dumont fight on Saturday:https://gamblingfreebies.com/2023/04/17/rosa-vs-dumont-prediction/https://www.youtube.com/watch?v=B2GJjuQ9p1E",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "April 19, 2023, 08:56:26 PM",
      "body": "If you want to make one thread for sports tips, you should be diligent in providing updates, especially if you want to make tips about several matches at once. It requires careful news updating, so you must return to your thread frequently.You can try it here and see how people respond. They will probably use the tip you provide if they are interested in it. And they will also provide suggestions or input for you to improve it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "April 19, 2023, 11:27:36 PM",
      "body": "OP, I think this is not feasible because I believe every gambler has his or her own gambling pattern so therefore, do not expect what works for gambler A to work out for gambler B and also vice versa both parties. Every one has his or her own unique way of playing to win. Another thing is the time of playing which varies from all some people believe in playing at a particular time with a particular pattern or way of paying which is quite different from the others.What I will advise you to do is to develop yourself in gambling on a particular game and do take note of times and of your Winnings so as to know when to play, your mood and reactions to your games at wins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "April 19, 2023, 11:39:15 PM",
      "body": "Quote from: CYBER_COWBOY on April 19, 2023, 07:18:32 PMThis is just about give some betting tips no matter league or sport to all the people on the forum!  My only tips is don't follow anyone or any organization. There are lots of people and groups where you an find free tips don't follow them while placing your bet. If you are into sports betting only play your bet on games and leagues you have known or you have knowledge about the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 19, 2023, 11:53:31 PM",
      "body": "There are threads in the Gambling Discussion where everyone can give and read predictions based on the discussion that we're in. I don't think it's a good idea that it's going to be jam-packed with tips here from different sports. That's why it's best to just go with the specific threads for specific sports for the tips that you may want to read and follow. I thought that you'll be the one to start it out but it's just like you want to ask for everyone's contribution and I think it's just really good to just go directly with those specific threads for those sports.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nrcewker",
      "created_time": "April 20, 2023, 02:41:37 AM",
      "body": "Quote from: CYBER_COWBOY on April 19, 2023, 07:18:32 PMI think we all here on the forum can help each other out to share our betting tips and stuff like that. Would be fun  This is just about give some betting tips no matter league or sport to all the people on the forum!  I think it’s not a good idea. The reason for which I am saying this is that because, if by chance someone looses a big amount of money due to the tips, then for the rest of the life he/she gonna blame you and for your tips. He/she won’t accept the fact that he is the one who is responsible for all this, and will keep on fighting like this. According to me, if money is yours, then decision to where to bet should also belong to you only. When it’s your hard earned money, then why risking it on other people’s calculation? At least I won’t follow these tips while betting. This is just my point of view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tusandii",
      "created_time": "April 20, 2023, 06:16:02 AM",
      "body": "Quote from: Mahirap on April 19, 2023, 11:39:15 PMQuote from: CYBER_COWBOY on April 19, 2023, 07:18:32 PMThis is just about give some betting tips no matter league or sport to all the people on the forum!  My only tips is don't follow anyone or any organization. There are lots of people and groups where you an find free tips don't follow them while placing your bet. If you are into sports betting only play your bet on games and leagues you have known or you have knowledge about the game. Here I totally agree with you, friend, because following the tips or predictions given by other people is not necessarily successful and when we experience defeat we will definitely have disappointment and of course we will blame those who have shared tips or predictions with us.It is better to bet on sports matches that we understand in terms of teams and games so that it makes it easier to be able to make your own predictions.After all, making our own predictions is a way for us to add insight and experience in sports betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "April 20, 2023, 07:26:14 AM",
      "body": "I am not sure how this thread is going to be of any help as everyone has his or her betting style so you'll only end up with different controversial opinions of users here and at the end no one  is going to take the betting advice of anyone so it will be like a waste of time. Or perhaps you could go to previous existing threads of your favourite game and learn there rather than creating a this thread but let's just watch and see how it goes if it's going to yield any result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin.princess",
      "created_time": "April 20, 2023, 09:28:39 AM",
      "body": "There's a lot of discussion here where user discuss the possibilities of the game or something like tips. I think your topic will be too broad because there's a lot of sports in sports betting industry I think you can just choose which topic would you prefer most for example is Football or what league it is then open a topic just for it, or are you the one who's going to give tips to the players?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "April 20, 2023, 09:36:18 AM",
      "body": "Now take a look with the @OP's pick and discuss about the result, @OP has 0% winning chance @OP had a multiple bet where he pick Napoli to win and under 2.5 goals in Chelsea vs Real Madrid. He was correct about the under 2.5 goals, but he was wrong to predict Napoli to win. So the conclusion @OP lost his bet. The second bet he was predict Inter to win, but the result was draw. Again @OP was wrong. Quote from: CYBER_COWBOY on April 18, 2023, 07:38:09 AMI think Napoli will win tonight and iit will be few goals in London. (under 2.5)Chelsea cant score and i dont think Real will push forward.Chelsea FC - Real Madrid = Under 2.5 goalsSSC Napoli - AC Milan = Napoli 3.34x @ Stake.Quote from: CYBER_COWBOY on April 19, 2023, 06:10:49 PMInter - Benfica today.I think Inter will win, they can play more relaxed with two goals up, but I think since Milan did go to semifinal, I think Inter will do whatever it takes to reach that semifinal to. This have giving dem a extra trigger to advance with a Milano-derby. I think its good odds that they winning the game tonight for 2.15X[/quote",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ufaiz50",
      "created_time": "April 20, 2023, 10:35:54 AM",
      "body": "Thank you for the tips, I think you should keep track your tips and list down the wins and losses to keep track of your record since many people will follow your tips if they will see your progress and record, but honestly some of your tips were good I just hope that they could win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "April 20, 2023, 11:34:10 AM",
      "body": "Quote from: CYBER_COWBOY on April 19, 2023, 07:56:42 PMFor example I want to play and give tips about a double with one game from La Liga and one from Premier League.. many people will miss it out if i post in a specific league.I understand your point, I guess you want a bettor to be able to see all the predictions you have at once in a thread irrespective of the league and not to start visiting different threads to check them out. I think that is reasonable from your explanation. If you can monitor, follow up and give like above average predictions for your bets, you will have more bettors checking you out but if you are below expectation then you will be sure to go off very fast because every bettor have different prediction sites that they visit.Regarding the discussion of where this thread belongs, I think the mod will eventually take a decision to that Quote from: Nrcewker on April 20, 2023, 02:41:37 AMI think it’s not a good idea. The reason for which I am saying this is that because, if by chance someone looses a big amount of money due to the tips, then for the rest of the life he/she gonna blame you and for your tips. He/she won’t accept the fact that he is the one who is responsible for all this, and will keep on fighting like this. Op is not the first that will suggest or provide predictions for bettors. There are many of such online and bettors have been losing and winning, they can only choose to stay with one prediction site or the other based on their experience.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pungopete468",
      "created_time": "April 20, 2023, 11:36:54 AM",
      "body": "I think you can move this to gambling discussion. Good luck to your tips, yes it is really great to create a community of sports bettors and just discuss and spends time with them analyzing the game or give tips to one another as you are playing and at the same time communicating with the people with the same interest as you. I think there is some guy here who created a discord channel that is particularly for sports betting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yamifoud",
      "created_time": "April 20, 2023, 11:49:15 AM",
      "body": "We have plenty of sports betting threads in the gambling discussion section that are focused on specific sports. If you want to share or read tips, I suggest visiting those threads. The members in these forums share their tips based on their personal analysis, unlike so-called experts who may not actually help you profit from sports betting. Here, you have the freedom to share your thoughts, and if you're successful, you'll likely earn a lot of followers, as long as you're offering your tips for free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "April 20, 2023, 12:10:05 PM",
      "body": "Quote from: Yamifoud on April 20, 2023, 11:49:15 AMWe have plenty of sports betting threads in the gambling discussion section that are focused on specific sports. If you want to share or read tips, I suggest visiting those threads. The members in these forums share their tips based on their personal analysis, unlike so-called experts who may not actually help you profit from sports betting. Here, you have the freedom to share your thoughts, and if you're successful, you'll likely earn a lot of followers, as long as you're offering your tips for free.There are even threads that offers tips, I think it's best if users will try to maximize the use of the \"search\" feature as well. For sports betting tip I think it's best if you choose those who are trusted by the forum members rather choosing those who are newbies and wannabes. Moreover it's best if you learn it the way yourself too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CYBER_COWBOY",
      "created_time": "April 20, 2023, 03:56:17 PMLast edit: May 13, 2023, 12:39:18 PM by CYBER_COWBOY",
      "body": "ECL & EL tonight. Funny night with some funny games for betting!West Ham United FC - KAA Gent = West Ham WIN 1.58x ✅West Ham start to going better and better now, get a little distance from the bottom in the league.it ended 1-1 last game so they need to get a result here and I think they will win pretty easy. 1.58x is doable.Union Saint-Gilloise - Bayer 04 Leverkusen = Union Saint-Gilloise WIN 3.65x  🔴 Union Saint-Gilloise did beat Union Berlin last time and did get 1-1 away against Leverkusen.Now they stands in 3.65x to win. I think its worth to put a small bet on it.AZ Alkmaar - RSC Anderlecht = Alkmaar WIN 1.63x ✅Alkmaar need to go forward from the start since they lost 0-2 last game.1.63x for them to win is doable since I think playing home and when they need to go for it will end in a win.AS Roma - Feyenoord Rotterdam = Roma to lead @ first half 2.50x 🔴 Feyenoord is doing a super season and won last game with 1-0. I think they can do it and go to the next round, but I think Roma will dominate the game and first half.Roma leading @ First half 2.50x is doable.Sevilla FC - Manchester United FC = Under 2.5 goals 1.97x 🔴 It was alot of goals last time 2-2. I have a feeling both really want this semi-final that are on stake so I think it will be a more careful game from both teams.It can be worth to put a small bet on Under 2.5 goals here. Normally i am a over 2.5 goals better, but i just have this feeling for tonight.Sporting CP - Juventus FC = Under 2.5 goals 1.61x ✅I think it will be few goals, Juventus will shut down the game and under 2.5 to 1.61x is a decent odds.Normally i am a over 2.5 goals better, but i just have this feeling for tonight.The double: West Ham WIN & Under 2.5 goals Sporting CP - Juventus FC 2.51x WINThe double: West Ham WIN & AZ Alkmaar WIN 2,57x WINThe chance:AS Roma - Feyenoord Rotterdam = Roma FIRST HALFWest Ham United FC - KAA Gent = West Ham FIRST HALFAZ Alkmaar - RSC Anderlecht = Alkmaar WINNINGSporting CP - Juventus FC = UNDER 2.5 GOALS= 13.85xThis is my predictions for the evening.You can of course mix this or add/remove matches however you want and feel for.Good luck tonight and have a great evening.I am no expert whatsoever & this is gambling and gambling is a risk, dont play with money you dont afford to lose. Gambling should be a fun thing!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}