{
  "id": "topic_5415081",
  "title": "Ivartheragnarson",
  "author": "Ivartheragnarson",
  "created_time": "September 27, 2022, 12:54:28 PM",
  "content": "I am to make a small thread on supply and demand for newbies.  And I need to know is this  a good place to post such a post or is there another better place available in Btt forum. let mr know.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415081",
  "comments": [
    {
      "author": "jackg",
      "created_time": "September 27, 2022, 12:59:06 PM",
      "body": "You can just post threads anyway if you're not sure and they'll get moved or you'll receive suggestions on where to move them if they don't look like they're in the right place..Here is fine for that sort of thread though (but arguably not for a thread like this which could be a meta topic).Also if you quote other places in your post remember to cite them and leave links so it's not considered plagiarism.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Eternad",
      "created_time": "September 27, 2022, 01:01:20 PM",
      "body": "Quote from: Ivartheragnarson on September 27, 2022, 12:54:28 PM I am to make a small thread on supply and demand for newbies.  And I need to know is this  a good place to post such a post or is there another better place available in Btt forum. let mr know.If your goal is to educate newbie about the subject matter, You can create your thread on Beginner and help instead of economy or trading discussion. Just put a tag on the title that telling it was a guide so that the reader can easily understand the purpose of the content.Just move this thread on B&H board and lock temporarily while you are editing the content so that no one can spam as well as to save you time on creating a new one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "September 27, 2022, 01:12:38 PM",
      "body": "It’s pretty much okay to post here in economics about economics, even if it’s made for newbies it’s not going to change anything and maybe if there are people who have posted in the beginner section, then you could probably link it to your post here if you have it already.If you have different references or websites that you have gotten some information from, then you could input them at the end of your post. Knowledge is definitely welcome here everywhere as long as it’s really informative and not repeating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ivartheragnarson",
      "created_time": "September 27, 2022, 01:18:00 PM",
      "body": "Quote from: crwth on September 27, 2022, 01:12:38 PMIt’s pretty much okay to post here in economics about economics, even if it’s made for newbies it’s not going to change anything and maybe if there are people who have posted in the beginner section, then you could probably link it to your post here if you have it already.If you have different references or websites that you have gotten some information from, then you could input them at the end of your post. Knowledge is definitely welcome here everywhere as long as it’s really informative and not repeating. ok sir. I am making some basic ideas and then advance educational Information about supply and demand  for all of  here. thank you for your response",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "September 27, 2022, 04:55:30 PM",
      "body": "Quote from: Ivartheragnarson on September 27, 2022, 12:54:28 PMI am to make a small thread on supply and demand for newbies.  And I need to know is this  a good place to post such a post or is there another better place available in Btt forum. let mr know.When you're talking about supply and demand related activities it is best made on the economics board but you need to be specific on which aspect or area on supply and demand are you referring to, if it talks about bitcoin price then trading or speculation is best for such, if it talks about bitcoin in general you could make such on bitcoin discussion, and if it's an education or enlightenment that has to do with new discoveries you could also make it on beginners and help while if it's all about altcoins then the altcoins discussion section is best, so choose which area are you interested on and make it more specific so as to get accuracy to the necessary applicable board.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "palle11",
      "created_time": "September 29, 2022, 09:46:38 AM",
      "body": "Quote from: Ivartheragnarson on September 27, 2022, 01:18:00 PMok sir. I am making some basic ideas and then advance educational Information about supply and demand  for all of  here. thank you for your responseSuch post may be better dropped here because the content of supply and demand is more of economy and if you are making it educational and informative then beginners board can be another option, newbies need some can of information to help them understand the cryptocurrency if your topic on demand and supply relate to crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fara Chan",
      "created_time": "September 29, 2022, 11:07:15 AM",
      "body": "Quote from: Ivartheragnarson on September 27, 2022, 12:54:28 PMI am to make a small thread on supply and demand for newbies.  And I need to know is this  a good place to post such a post or is there another better place available in Btt forum. let mr know.If you intend to create a thread about beginners, then there is a special place available on the forums, each thread has rules that you should know. For example in the economics section, the discussion in this thread is more specific to the discussion of the economy, but there is also no prohibition against entering a few sentences about bitcoin, altcoins or others, as long as the posts you make do not contain elements of sara, fraud and misdirection against others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "September 29, 2022, 11:33:43 AM",
      "body": "Quote from: Ivartheragnarson on September 27, 2022, 01:18:00 PMok sir. I am making some basic ideas and then advance educational Information about supply and demand  for all of  here. thank you for your responseYou can just keep this thread and edit your first post and put all the details about what you're about to teach. So that there's no duplication of thread after you've asked it here. The topic for supply and demand is related to economics so, you're on the right section already unless a mod decides to move it where it is appropriate if it doesn't belong in here.In that manner, you can start doing that on this thread and edit out the first post or if you don't like too and you want to make another one for that topic then lock this topic upon doing so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bestcoins1",
      "created_time": "September 29, 2022, 11:53:58 AM",
      "body": "Quote from: Ivartheragnarson on September 27, 2022, 12:54:28 PM I am to make a small thread on supply and demand for newbies.  And I need to know is this  a good place to post such a post or is there another better place available in Btt forum. let mr know.If it concerns the economic cycle and also the amount of supply and demand in the market with the aim of improving the economy of life, then I think you are not wrong to put this post here. But if the discussion is more about trading issues and also the exchange, I think there are other places that are more suitable for that such as the trading discussion section which is also available in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MArsland",
      "created_time": "September 29, 2022, 12:35:40 PM",
      "body": "Quote from: Ivartheragnarson on September 27, 2022, 12:54:28 PMI am to make a small thread on supply and demand for newbies.  And I need to know is this  a good place to post such a post or is there another better place available in Btt forum. let mr know.No problem, you just need to edit this thread and be more specific about what you really want to know. The demand and supply keywords will suffice, but still you also need to provide some explanation. Because that way we can focus more on the area you mean. A lot of time browsing the forum could at least get a good reference on how threads are built to make the discussion more lively.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "September 29, 2022, 04:17:26 PM",
      "body": "Quote from: Ivartheragnarson on September 27, 2022, 12:54:28 PM I am to make a small thread on supply and demand for newbies.  And I need to know is this  a good place to post such a post or is there another better place available in Btt forum. let mr know.If you want to write a guide, then study these lists so as not to create similar topics. There is a lot of useful information on the forum, but few readers Beginners & Help Encyclopedia [UPD: +Electrum Board]https://bitcointalk.org/index.php?topic=5364418.0[HUGE LIST] Useful Crypto Links !!!https://bitcointalk.org/index.php?topic=5264359",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}