{
  "id": "topic_5458895",
  "title": "riverdip",
  "author": "riverdip",
  "created_time": "July 06, 2023, 09:09:57 PM",
  "content": "Hey folks,I just have to get this off my chest: I absolutely hate Proof of Stake (POS) for Bitcoin. It's like the killer of projects and takes us back to the days of centralized control. No thanks!Let me break it down for you. POS puts power and decision-making in the hands of a few who lock up their funds. That's just not cool. Bitcoin is all about decentralization and giving everyone a chance to participate. That's why Proof of Work (POW) rocks!POS brings its own set of issues, like the \"double-signing problem\" and the \"Nothing at stake problem.\" It messes with the system's objectivity and reliability. With POW, we've got a solid foundation. The computational work required to mine new blocks ensures the validity of the ledger and keeps things trustworthy.And here's another thing: POW can be optimized! We can find ways to get rid of those pesky ASICs and make the mining process more inclusive and fair. We have the power to make it better, folks.So, let's stick with POW for Bitcoin, okay? POS just doesn't cut it for me. It brings centralization, vulnerabilities, and limitations. POW is where it's at – promoting decentralization, reliability, and room for improvement.Feel free to share your thoughts and prove me wrong if you dare. Let's keep the discussion going, but I'll be over here rooting for POW!Cheers!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458895",
  "comments": [
    {
      "author": "adaseb",
      "created_time": "July 06, 2023, 09:42:57 PM",
      "body": "There are no plans currently and most likely never will there be any plans for POS transition for Bitcoin. ETH went POS because it’s goal back in 2015 was to switch over to an energy efficient way of processing transactions. With Bitcoin there are no plans to do so.Even if there was a plan, there is no difficulty bomb in place for Bitcoin such as ETH. So even if there was software out to upgrade to POS,  no miners would upgrade to that software. So you don’t have to worry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 06, 2023, 10:34:24 PM",
      "body": "Quote from: riverdip on July 06, 2023, 09:09:57 PMAnd here's another thing: POW can be optimized! We can find ways to get rid of those pesky ASICs and make the mining process more inclusive and fair. We have the power to make it better, folks.ASICs are the optimization, and there's no way back. Well, we could fork Bitcoin to be CPU or GPU mined again, and it has already been done before, but what would it achieve? Mining would still be done by farms, just like with Ethereum. Regular people won't be leaving their PC turned 24/7 to mine, out of fear that it will shorten its lifespan, and because it would actually be consuming system resources that they need for their main tasks, like playing games or doing work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 06, 2023, 10:54:29 PM",
      "body": "@OP I belive that the developers already know that POS is not ideal for Bitcoin and they have no interest in transitioning Bitcoin POW to Bitcoin POS because of several various reasons but the most important is the security.  Most that know Bitcoin know that POW is the reason why the Bitcoin network is almost unhackable because anyone with ill-intent needs huge money to hack the bitcoin network.  While POS have it many concerns and bugs, the developer cannot compromise the funds of the Bitcoin holder just to make Bitcoin POS.Quote from: hatshepsut93 on July 06, 2023, 10:34:24 PMQuote from: riverdip on July 06, 2023, 09:09:57 PMAnd here's another thing: POW can be optimized! We can find ways to get rid of those pesky ASICs and make the mining process more inclusive and fair. We have the power to make it better, folks.ASICs are the optimization, and there's no way back. Well, we could fork Bitcoin to be CPU or GPU mined again, and it has already been done before, but what would it achieve? Mining would still be done by farms, just like with Ethereum. Regular people won't be leaving their PC turned 24/7 to mine, out of fear that it will shorten its lifespan, and because it would actually be consuming system resources that they need for their main tasks, like playing games or doing work. Any fork of Bitcoin that deviates from the main blockchain network is not Bitcoin at all, and I believe ASICs will keep on developing to cope with the changes of demands overtime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "July 06, 2023, 10:56:07 PM",
      "body": "I agree with your thoughts. POS isn't for Bitcoin even though the POS implementation in ETH works, I don't really know about any significant improvements for it. IIRC, there have been rumors that ETH developers recently proposed to increase the minimum validators staking limit of its POS system from the original value of 32 to around 2048. For now, we can expect Bitcoin to maintain the status quo and see how thing fare from here on out. QQ: What happens to POW in Bitcoin when Difficulty gets too high and mining rewards doesn't justify the computing resources?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "July 06, 2023, 11:02:36 PM",
      "body": "Its very highly unlikely bitcoin will proceed to PoS. ETH was criticized and even a bit considered as securities by US SEC because of this move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "July 07, 2023, 01:29:47 AM",
      "body": "Long story short, please join the [Megathread] The long-known PoW vs. PoS debate. You will read many opposite opinions there but I see Proof of Stake is more centralized than Proof of Work. It is more easily manipulated than Proof of Work. Manipulating anything online, in virtual space is more easily than owning hashrates from ASICS which are located and operated on many locations to have centralized hashrate power with Proof of Work.Bitcoin mining is greener than many attacks on it.https://bitcoincleanup.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "July 07, 2023, 03:37:30 AM",
      "body": "Quote from: riverdip on July 06, 2023, 09:09:57 PMI just have to get this off my chest: I absolutely hate Proof of Stake (POS) for Bitcoin.There is no plans nor even any serious discussions on this topic since everyone knows PoS is garbage from the day it was introduced about a decade ago.QuoteAnd here's another thing: POW can be optimized! We can find ways to get rid of those pesky ASICs and make the mining process more inclusive and fair. We have the power to make it better, folks.PoW is already optimized, and having ASICs isn't in contradiction to that. Besides there is nothing wrong with having to buy (read make a solid commitment) ASICs to be able to mine bitcoin. In fact that means you can't just flip a switch to start mining and turn it off any time you liked, in case you were mining with your CPU for example. This makes the hashrate more stable. Quote from: nelson4lov on July 06, 2023, 10:56:07 PMI agree with your thoughts. POS isn't for Bitcoin even though the POS implementation in ETH works, I don't really know about any significant improvements for it. The issue is not about something working, the problem is how it is working. A centralized shitcoin is also working but that doesn't mean creating a centralized shitcoin is the way to go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 07, 2023, 04:07:38 AM",
      "body": "I don't think there's an ongoing plan to move Bitcoin from POW to POS. However, if it ever happens, I don't know what's the problem. POS will actually empower a considerable amount of the population to enter into Bitcoin mining which they are unable to do now due to the high entry barrier. Moving to POS will allow them to connect to the network and mine Bitcoin. Not sure why you think it will centralize the network further. That didn't happen with ETH. Rather, keeping bitcoin in the same structure will surely restrict people from entering into bitcoin mining, thus making it more centralized. So yes, POS is much much better for Bitcoin if it really wants to stay de-centralized and wants everyone to participate in the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "July 07, 2023, 05:49:27 AM",
      "body": "Quote from: riverdip on July 06, 2023, 09:09:57 PMHey folks,I just have to get this off my chest: I absolutely hate Proof of Stake (POS) for Bitcoin. It's like the killer of projects and takes us back to the days of centralized control. No thanks!Let me break it down for you. POS puts power and decision-making in the hands of a few who lock up their funds. That's just not cool. Bitcoin is all about decentralization and giving everyone a chance to participate. That's why Proof of Work (POW) rocks!POS brings its own set of issues, like the \"double-signing problem\" and the \"Nothing at stake problem.\" It messes with the system's objectivity and reliability. With POW, we've got a solid foundation. The computational work required to mine new blocks ensures the validity of the ledger and keeps things trustworthy.And here's another thing: POW can be optimized! We can find ways to get rid of those pesky ASICs and make the mining process more inclusive and fair. We have the power to make it better, folks.So, let's stick with POW for Bitcoin, okay? POS just doesn't cut it for me. It brings centralization, vulnerabilities, and limitations. POW is where it's at – promoting decentralization, reliability, and room for improvement.Feel free to share your thoughts and prove me wrong if you dare. Let's keep the discussion going, but I'll be over here rooting for POW!Cheers!You hate and are worried about something that doesn't even exists.... I doubt we will see bitcoin moving to Proof of Stake. The chain might split and a new chain might be created that uses proof of stake, but it will be just another \"altcoins\" like all other altcoins that tried to bring \"change\" in bitcoin, but failed miserably. If bitcoin moves to proof of stake, it might become centralized which is what bitcoin is against, so I can almost assure that we won't be something like this anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z390",
      "created_time": "July 07, 2023, 07:00:16 AM",
      "body": "That's why Bitcoin is different from Ethereum, there will never be a change of algorithm on Bitcoin so relax, I hate that Ethereum goes PoS myself because after Bitcoin ETH is the next best one on my list, but when they finally switched to PoS, I lost the likeness of Ethereum that day. Bitcoin can never go back to any other algorithm than PoW, it's a made-finished blockchain that does not need any ulterior needs from anyone or anything, it's a fully decentralized digital currency and that's why it's also a proof-of-work coin. Relax because there is no going back ever again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "July 07, 2023, 07:09:04 AM",
      "body": "I can't stand, and I don't see it happening either.Aside from Bitcoin, the only top coins right now that is still POW are Litecoin, Dogecoin, Ethereum Classic, Bitcoin Cash, and there might be some more, but these are the most popular ones. This is why many people love Bitcoin being decentralized. No central authority can do anything about Bitcoin, but multiple people must agree into something in order for it to be implemented. Changing it from POS to POW just make it more centralized, and I know that we hate that to happen. Besides, I don't see any reason why Bitcoin must move from POW to POS. It will remain as POW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 07, 2023, 07:29:33 AM",
      "body": "was thinking you mean point of sale (POS) not Proof of Stake (POS)I have not heard a single serious discussion that Bitcoin will turn into Proof of Stake, and these days it needs a hard fork that none of the community will approve of. Even the process of moving Ethereum to Proof of Stake took many stages before it was approved and did not cause a real change in the price.Bitcoin will not be a proof-of-stake currency, not now, not in the near future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr. Magkaisa",
      "created_time": "July 07, 2023, 07:52:20 AM",
      "body": "Someone who commented here in this section said that this is not ideal, why? Has anyone managed to change the Bitcoin protocol ever since? right, nothing yet? Then if attention is focused on it, it will be discussed or debated for sure.Others may think POS is good for Bitcoin, but it's not the priority of Bitcoin users to be honest, so there's no reason to do it with Bitcoin in my own opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "buwaytress",
      "created_time": "July 07, 2023, 09:26:15 AM",
      "body": "Nobody ever: PoS for Bitcoin.OP: I hate PoS for Bitcoin!The last time a contentious change was around, even the big blockers would never dream of a change from PoW. You know, if you really didn't want it, you don't have to actually breathe life into it.P.S. weren't there actually PoS versions years ago?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Blitzboy",
      "created_time": "July 07, 2023, 10:16:21 AM",
      "body": "POS gives a few stakeholders control, but doesn't POW too? Who can compete with China's megamines? How decentralised? POS's issues are valid. However, objectivity is essential. Problems are solvable. Ethereum is fighting them. POW's energy issue is very difficult. POW is Bitcoin's robust foundation. The holy grail? Still arguable. POW isn't perfect, even as we optimise it.POW improves decentralisation and reliability, but it may be improved. As a healthy sceptic, I must add that POW may be Bitcoin's best strategy, but it's not flawless. Despite our attachment to present systems, we must remain open to new ideas and improvements",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "July 07, 2023, 12:06:45 PM",
      "body": "Quote from: riverdip on July 06, 2023, 09:09:57 PMI just have to get this off my chest: I absolutely hate Proof of Stake (POS) for Bitcoin. It's like the killer of projects and takes us back to the days of centralized control.Bitcoin is already a PoW and there's nothing that can be changed about that, we can see that most of the centralized cryptocurrencies make use of PoS because they have to set a panel for their decisions, when considering the fact that bitcoin is a decentralized digital currency, the best way to maintain the same standard is by using PoW always and ever.Quote from: riverdip on July 06, 2023, 09:09:57 PMLet me break it down for you. POS puts power and decision-making in the hands of a few who lock up their funds. That's just not cool.This same decision makers are the investors having their most highest of contributions on the currency investment and when they pull out their investment there you discover that some cryptocurrencies are going bankrupt or liquidated, this also makes it feels as if the cryptocurrency market is being manipulated for the whales to have better opportunities in making profits whenever they want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "July 07, 2023, 12:09:01 PM",
      "body": "Quote from: adaseb on July 06, 2023, 09:42:57 PMETH went POS because it’s goal back in 2015 was to...Raise the validator limit from 32 Ethereum to 2048 eth. Quote from: adaseb on July 06, 2023, 09:42:57 PMbecause it’s goal back in 2015 was toto let rich people solo stake and generate 63 times more income, while pushing others to join pools.Quote from: PX-Z on July 06, 2023, 11:02:36 PMIts very highly unlikely bitcoin will proceed to PoS. ETH was criticized and even a bit considered as securities by US SEC because of this move. Definitely, there is no way Bitcoin is going PoS, especially if we keep in mind that there are countries that welcome people to mine bitcoins with cheap electricity and reduced or no tax rates. There is a lot of money invest in ASIC miners, I don't think it's gonna happen in near future to move not only POS but to exclusively on CPU/GPU mining.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KiaKia",
      "created_time": "July 07, 2023, 12:23:01 PM",
      "body": "Bitcoin is going to be a non-changeable proof-of-work coin till the end of time, period.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "20kevin20",
      "created_time": "July 07, 2023, 01:00:58 PM",
      "body": "The very, very first version of BTC was the most fair. Back then, when 1 CPU = 1 vote, things were more equal. As time passed and BTC's price started skyrocketing, some people obviously saw a money-making potential in BTC and wanted to profit off the opportunity.The main issue with both PoW and PoS when it comes to wealth distribution is that in both cases, as we speak, the rich have an advantage. For PoW, the more mining rigs you have, the more power you have hence the more BTC you can make. This rig-buying business turned into a competition for who's got the most hashing power, and I see it similar to how the top 100 compete for the most wealth.For PoS, the more money you have, the easier you climb to the top. I get my little share from my $100 while a whale gets their huge share from their millions.I've seen other ideas such as 1 heartbeat = 1 vote or 1 heart beat = 1 coin. That works great until you find out older people's heart beats are different, there's no realistic way to measure real, legitimate heartbeats and at the end of the day, the rich will still be able to buy coins from you because - well, for the right offer, you'd give your coins wouldn't you?Fairness is hard to get. PoS implies a ton of security issues we really don't need. Maybe if ETH proves to be a success and at least as secure as BTC with its PoS, BTC will try it out too (I doubt it). Otherwise, let BTC be the way it is. The only ones happy about a move to PoS will be shitcoin holders and governments because security will be significantly lower, lol. If there's a more fair way to do things, Bitcoin will adopt it once proven..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}