{
  "id": "topic_5452050",
  "title": "Faisal2202",
  "author": "Faisal2202",
  "created_time": "May 09, 2023, 06:53:36 AM",
  "content": "We have seen a huge increase in the transactions fee of BTC, even according to blockchair BTC fee Graph recorded a fee of around $31.46 and i have seen on many social media profiles, it exceeds more than that. So, the question is what caused this huge surge in tx fees?And as of writing current tx fees according to priorities are;No priority tx = 70 sat/vB -->$2.71 Low Priority tx = 219 sat/vB --> $8.47Medium Priority tx =236 sat/vB --> $9.13 High Priority = 251 sat/vB --> $9.71 --> It's fluctuating too much, like a few minutes before it was around $13.Reasons Behind this Surge in Tx Fee of BTC1. Huge Number of Unconfirmed Transactions:As of writing, according to mempool, 431,788 tx are pending for validation, and according to \"Difficulty Adjustment Bar\" it's going to take 10 days to process them all as the rate of completion of each block is also increased from 10 minutes to 10.3 minutes and currently, it holds on 10.4 minutes per block and if it continues to increase then more transactions will have to spend more on fees.To put it in simple words-->As a huge number of txs are needed to be processed thus there is a lot more work to do for validators and therefore fees are increasing. But what caused a huge spike in Unconfirmed Transactions? Obviously, people were making a hell lot of transactions and thus amount increased but why a sudden increase happened? Does BTC is being accepted as a legal tender in the USA? (in your dreams). To answer all these questions we have to understand the concept of \"BRC-20\"2. Hype of BRC-20 token's Impact:If you guys don't know about BRC-20 then it's similar to ERC-20 and we can deploy tokens on the BTC blockchain by using \"Ordinal Protocol\" just like people can mint tokens on the ERC-20 blockchain. What is Ordinal Protocol? --> \"Well it's quite a simple protocol that allows one to input or i should use the most used term \"inscribe\" some data into the BTC blockchain. Well, such as smart contracts for NFTs and these NFTs will definitely be of great importance for BTC maniacs as they are the first minted NFTs on the BTC blockchain. As we have comprehended the BRC-20 token and to some extent understand the reason of the hype behind it (aforementioned), so do you know what are the current stats on it, allow me to share them with you.sourceIf things were still blurry then the above stats might have opened your eyes, Actually, this hype brings airdrops proposals and many Airdrop hunters made huge profits out of it, such as the following one:$260 investment in pepe token has made dimethyltryptamine.eth a total of $7 million dollars --> can you believe that, No, Go look for yourself wait am i dreaming (hehe) he holds 2.56 Trillion pepe tokens and one pepe is around $0.000001834 which means he made a total of $463,826,862.36. (well all the big profits in pepe coin can be seen on the source link i provided.i was going to cover more profits but this is of less concern here, so the profit of pepe and other BRC-20 tokens might have given you the idea of why did people were so interested in them so that they spent around 775.93 BTC in BRC-20 token's transactions fee and performed a total of 3,954,343 tx on BRC tokens till now plus (yeah there is more) on non-ordinal, the transactions exceeds #633,533 tx with a total of 113.76 BTC being paid by people. (still don't believe me, ok go look for your self).What Now?As we have comprehended some factors, but my concerns are now, where are we going with it, some dude named Supernestnet, found a loophole in the ordinals of the BTC blockchain and was able to \"inscribe\" a number of data, images data, etc. into it and thus was able to make an NFT. How this problem will meet with a solution? Does this fee issue will encourage more Centralized Exchanges to halt withdrawals as Binance did? Why many are saying BTC will lose its value when the 10 days of pending transactions will pass?-->(is it because there will be less demand because till then there will be less demand as stats are already showing lesser trading volume).And top of all the questions--> Did you also lose the chance of making profits out of BRC-20 tokens too? or i am alone? because to be honest i didn't care about them and they are now 2 months old and from then i didn't know a thing about it ( i guess my bad), i come to know about it due to the issue of high fees).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452050",
  "comments": [
    {
      "author": "EarnOnVictor",
      "created_time": "May 09, 2023, 08:25:25 AM",
      "body": "I'd wanted to make a topic on this, but thank you for doing it. It's so pathetic on what is happening on the Mempool, I have two transactions awaiting confirmation as I write and I don't know how on earth I would part ways with a high fee for a little amount of money to be sent.The ordinals issue is a valid problem here to buttress what you had iterated above, and I don't think this would go away very soon as the congestion is much now. I witnessed a high priority of almost $20 sat/vbyte which is so crazy.Maybe within a month or two, my awaiting transactions would be credited...lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 09, 2023, 08:46:32 AM",
      "body": "And as if this crap wasn't enough, seems to already exist a new crap called ORC-20.What the fuck are these stupid people thinking??https://thebitcoinmanual.com/articles/orc-20-tokens/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "May 09, 2023, 09:24:00 AM",
      "body": "Quote from: Faisal2202 on May 09, 2023, 06:53:36 AMAnd top of all the questions--> Did you also lose the chance of making profits out of BRC-20 tokens too? or i am alone? because to be honest i didn't care about them and they are now 2 months old and from then i didn't know a thing about it ( i guess my bad), i come to know about it due to the issue of high fees).Yeah, I've lost that chance even if I've already saw those talks about it but no regrets. What I regret is the effect of these that had made the network too heavy and clogged. We can have this conclusion that this is just another craze and with all of those typical crazes that we've seen in the past, they're not going to be at the peak at all times.In hope with that, that's going to make the fees lower and normal again but no one knows if it's too soon or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "May 09, 2023, 09:51:01 AM",
      "body": "You think bitcoin transactions are expensive, look into this source There are times we don't even give attention to some things that were demanding much from us than the ones not giving us much challeng but we feels uncomfortable with them and it seems a major concern on us, quite alright bitcoin transa is going higher and more in recent time but we should also looked into the value of the assets we are trying to make the transaction from and compare it to other sources that demands paying higher fees for without us knowing or minding of.This is not to encourage the high in transaction fee because we are used to paying low fees on our bitcoin transactions, but we can also check other means we pay high fees aside from bitcoin that are taking much from us than we expect, bitcoin transaction fee will soon become a story when the lasting solution has been made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 09, 2023, 09:57:15 AM",
      "body": "Quote from: Doan9269 on May 09, 2023, 09:51:01 AMYou think bitcoin transactions are expensive, look into this source There are times we don't even give attention to some things that were demanding much from us than the ones not giving us much challeng but we feels uncomfortable with them and it seems a major concern on us, quite alright bitcoin transa is going higher and more in recent time but we should also looked into the value of the assets we are trying to make the transaction from and compare it to other sources that demands paying higher fees for without us knowing or minding of.This is not to encourage the high in transaction fee because we are used to paying low fees on our bitcoin transactions, but we can also check other means we pay high fees aside from bitcoin that are taking much from us than we expect, bitcoin transaction fee will soon become a story when the lasting solution has been made. That is just a convenient comparison.What about comparing the fees in the Bitcoin Network before and after the Ordinals crap? Yeah, this is a convenient comparison too!As someone else already said somewhere in this forum, Satoshi created Bitcoin with the goal of secure, trustless and cheap transaction system. This is making the opposite. Slow and expensive transactions!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "May 09, 2023, 10:00:19 AMLast edit: May 15, 2023, 10:45:23 AM by stompix",
      "body": "Quote from: Doan9269 on May 09, 2023, 09:51:01 AMYou think bitcoin transactions are expensive, look into this source What a load of crap!Compare a service fee with simple payment transactions!!! OMG!Seriously, every single crisis in bitcoin, no matter how large or small brings out some zealots that are saying ridiculous things only trying to argue that black is blue, that red is white, and blue is also white.One of those times when is better to be a copium dealer than a heroin one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "May 09, 2023, 10:20:25 AM",
      "body": "Quote from: Doan9269 on May 09, 2023, 09:51:01 AMYou think bitcoin transactions are expensive, look into this source Two very different things, and i think you need to look into the work of a realtor agent when you hire one, they help you do most of the work and get you to sell, buy or rent your house for a good price, i think their fee is well deserved. BTC is a currency, so if you want to make a comparison with the recent hike in tx fees, do so with other payment systems or currencies. Tx fees are high currently because of ordinals spam, that is the simple truth, we do not need to make biased and crap comparisons to make it look better, but rather work towards solutions or just wait for the situation to go away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "May 09, 2023, 10:29:25 AM",
      "body": "Quote from: darkv0rt3x on May 09, 2023, 08:46:32 AMAnd as if this crap wasn't enough, seems to already exist a new crap called ORC-20.What the fuck are these stupid people thinking??https://thebitcoinmanual.com/articles/orc-20-tokens/It's an experimental project that looks exactly like BRC20, nevertheless that also means they will both crash at the same (unspecified) time when people lose interest in trading this garbage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkv0rt3x",
      "created_time": "May 09, 2023, 10:37:21 AM",
      "body": "Quote from: NotATether on May 09, 2023, 10:29:25 AMQuote from: darkv0rt3x on May 09, 2023, 08:46:32 AMAnd as if this crap wasn't enough, seems to already exist a new crap called ORC-20.What the fuck are these stupid people thinking??https://thebitcoinmanual.com/articles/orc-20-tokens/It's an experimental project that looks exactly like BRC20, nevertheless that also means they will both crash at the same (unspecified) time when people lose interest in trading this garbage.I just hope for 2 things.That that time comes soon enough and that the people involved in both crap go away with the scams.I read most of the document I posted but to be honest I read nothing about Ordinals nor BRC-20. And i probably won't. I'm not interested in neither! I was only interested in keep doing my DCA and in this situation, I just can't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "May 09, 2023, 10:47:20 AM",
      "body": "Most of high-fee transactions are from Ordinals, BRC-20 tokens and those new meme tokens. It's insane to see people are ready to buy those experimented tokens which have unknown future.Most of them are for texts, images which are useless.https://dune.com/domo/ordinals-marketplaceshttps://dune.com/dgtl_assets/bitcoin-ordinals-analysisWith above resources, you can see the latest congestion and very expensive fee are from Unisats.io and their tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "May 09, 2023, 10:49:34 AM",
      "body": "Quote from: Faisal2202 on May 09, 2023, 06:53:36 AMIf you guys don't know about BRC-20 then it's similar to ERC-20 and we can deploy tokens on the BTC blockchain by using \"Ordinal Protocol\" just like people can mint tokens on the ERC-20 blockchain.  I did not know about this before last week. I heard about Ordinals about a month ago but did not bother to learn more about it. I did not care about It because I did not think those shitcoins could be a problem for Bitcoin users. I mean, I don't care who is investing where until it doesn't affect me. ERC-20 was why some scam tokens were deployed, and they kept doing it to get profits. Since then, the ETH Gas prices never went down so much. Or it went down for a short time and then up again. This Ordinal thing enabled an excellent opportunity for scammers to try the same thing they did with the ERC-20 chain and BEP-20 chain. People are aware of ERC-20 and BEP-20 Scam tokens. Since BRC-20 is new, people will be interested in it and will surely try their luck, and scammers will take this opportunity. Now I am afraid of this protocol. This increased the transaction fees, and it's unlikely to go down for a long time, just like the ERC-20 chain. Half a million unconfirmed transactions in Mempool for over a week. Nobody knows when it will decrease. The recommended transaction fee is already 200 satoshi per byte. This morning it was 292 satoshi per byte. I hope this craze ends very soon and the network becomes normal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UchihaSarada",
      "created_time": "May 09, 2023, 10:51:20 AM",
      "body": "BSV attacks on Bitcoin network but they will die soon. Meanwhile, Bitcoin miners will get bonuses from stupid people who pay very high transaction fee as they are temporarily receiving about 40% of their earnings from transaction fee, the remaining is from block rewards.Without Ordinals, BRC-20 hype, they only got about 3% of earning from transaction fee.Mempools congested after two years. Consolidate your small inputs next times!If you regret that you missed a great chance latest weeks to consolidate your small inputs, don't repeat that mistakes in future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "May 09, 2023, 11:14:12 AM",
      "body": "Those BRC-20 token are so useless that I can't describe their uselessness in words. That's a new propaganda to reduce the adoption rate of Bitcoin and unfortunately those people have found a way to add such useless protocol to our loveable Bitcoin blockchain.Due to such useless tokens worse than meme coins of the Bitcoin era have taken the fees so high that it became difficult for a normal user to send Bitcoin. I don't how but we must have to find a way to get rid of such useless tokens otherwise it will be difficult to send or receive bitcoins with those high fees.Other than BRC-20 now those scammers found another protocol ORC-20 that could disrupt the rate of transactions further. If things continue this we than we will have to face the consequences for a long time. The ORC-20 protocol can further add to the increase of transaction fees. There should be a way to manually stop those useless protocols.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 09, 2023, 01:26:02 PM",
      "body": "Quote from: darkv0rt3x on May 09, 2023, 09:57:15 AMQuote from: Doan9269 on May 09, 2023, 09:51:01 AMYou think bitcoin transactions are expensive, look into this source There are times we don't even give attention to some things that were demanding much from us than the ones not giving us much challeng but we feels uncomfortable with them and it seems a major concern on us, quite alright bitcoin transa is going higher and more in recent time but we should also looked into the value of the assets we are trying to make the transaction from and compare it to other sources that demands paying higher fees for without us knowing or minding of.This is not to encourage the high in transaction fee because we are used to paying low fees on our bitcoin transactions, but we can also check other means we pay high fees aside from bitcoin that are taking much from us than we expect, bitcoin transaction fee will soon become a story when the lasting solution has been made. That is just a convenient comparison.What about comparing the fees in the Bitcoin Network before and after the Ordinals crap? Yeah, this is a convenient comparison too!As someone else already said somewhere in this forum, Satoshi created Bitcoin with the goal of secure, trustless and cheap transaction system. This is making the opposite. Slow and expensive transactions!I don't know why that person is comparing btc tx fee to realtor agent fee lol. One is a fee for a transaction and another is a fee for someone selling a house. Not the same thing at all. If someone were to pay with Bitcoin to sell a house they'd still be paying the realtor fee.Anyway, just wanted to say in regard to your post, nothing about Bitcoin promises cheap transactions. In fact cheap transactions are only possible when Bitcoin is not much used. LN is for cheap transactions. When there are a billion people using Bitcoin there wil be no such thing as cheap transactions, even if 99% of txs are done on LN. You don't get security/trustlessness/decentralized AND cheap transactions AND mass adoption. You can at best have two of the three. Bitcoin started out with the first two, but as mass adoption gradually happens you lose the middle one, and that is where L2 comes in. Yes we want on-chain txs to remain as cheap as possible for convenience, but that doesn't mean Bitcoin was made to be cheap, it wasn't, it was made to be secure and trustless and decentralized. Altcoins, for instance, were made to be cheap because they were made to not be decentralized.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 09, 2023, 02:13:57 PM",
      "body": "Quote from: John Abraham on May 09, 2023, 10:49:34 AMI did not care about It because I did not think those shitcoins could be a problem for Bitcoin users. I mean, I don't care who is investing where until it doesn't affect me. Actually, a thread on this topic with other context has already made long before and there i also arose the same question of transactions fee, for example you can check the thread here:tokens based on bitcoin-->This thread arose the same query about tokens being minted on btc blockchain and how it will go.Bitcoin can't become world currency (at least now).-->this thread emphasize the lack of processing that BTC currently facing which is also a big obstacle in mass adoption or in becoming legal tender in tier 1 countries.i provided the link to my reply you must check the OP's post too and should read all the replies atleast that you can read.Here was my reply to transaction issue.Quote Using the same scenario, if it going to start leveraged for paying fees for collectibles and other digital assets, isn't it will put more load on the BTC blockchain? source-->same first row of table.Point is, these things has really damaged the system and halted many trades. I hope this could be resolved soon. Quote from: thecodebear on May 09, 2023, 01:26:02 PMI don't know why that person is comparing btc tx fee to realtor agent fee lol. I think he just wants to remain positive about it, or maybe he is a miner and making 40% more money as UchihaSarada has stated above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 09, 2023, 02:32:53 PM",
      "body": "Quote from: Faisal2202 on May 09, 2023, 06:53:36 AM[...]How this problem will meet with a solution?I'm interested in this as well but I am yet to read a solution on the protocol level. All I've seen are about the work-arounds like using more of LN or altcoins if withdrawing from centralized services. I guess Bitcoin will just have to take all the punches and endure until those network attackers and their funders gets tired or run out of money. Regular users like us can only wait.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "May 09, 2023, 07:26:12 PM",
      "body": "Quote from: NotATether on May 09, 2023, 10:29:25 AMIt's an experimental project that looks exactly like BRC20, nevertheless that also means they will both crash at the same (unspecified) time when people lose interest in trading this garbage.Hmm, I was talking to a friend in good mode suddenly he said ohh what if we should invest in the BRC meme projects and I was like really this a person who brought me into Bitcoin, and now what he is talking? His explanation was there is no way to avoid it because its a revolution and my reaction was the same as this--what a shit on the name revolution;Anway the end of the chat He said people like scrap and this cant be stopped.This is a big concern because whatever we think of Bitcoin and purity but people use to follow the trend..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "May 09, 2023, 07:41:20 PM",
      "body": "Quote from: Doan9269 on May 09, 2023, 09:51:01 AMYou think bitcoin transactions are expensive, look into this source That's just to make everyone looking at the fees convenient. The comparison is off when we're talking about the fees for the transactions we do since it's just even 1 sat/byte and you'll get confirmed in a few minutes. When we've been used to these low fees then this comparison won't really matter at all and even it goes back to normal, these fees from other industries have been there for the longest time and they've used to it already just as we with the transaction fees for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "thecodebear",
      "created_time": "May 09, 2023, 07:45:46 PM",
      "body": "Quote from: Yogee on May 09, 2023, 02:32:53 PMQuote from: Faisal2202 on May 09, 2023, 06:53:36 AM[...]How this problem will meet with a solution?I'm interested in this as well but I am yet to read a solution on the protocol level. All I've seen are about the work-arounds like using more of LN or altcoins if withdrawing from centralized services. I guess Bitcoin will just have to take all the punches and endure until those network attackers and their funders gets tired or run out of money. Regular users like us can only wait.Hopefully there is a code work around but I've seen no interest in fixing this from the devs and I see some people saying it can't really totally be stopped even with changes...not sure if that is true or not.With luck hopefully people just lose so much on this s**t meme tokens that they abandon them on Bitcoin and same with jpeg NFTs on Bitcoin. I don't mind NFTs being on Bitcoin, but picture NFTs are the dumbest use of NFT technology, but because pictures are the low-hanging fruit of NFT usage that is what became popular even though its useless. There are plenty of useful things for non-fungible tech in a decentralized blockchain, and so if Ordinals was used for that...actually worthwhile and valuable NFT transactions, that'd be fine. But instead people are just shoving useless stupid image data into the scarce valuable bitcoin blockchain space and making the network less useable for people who actually want to use bitcoin.Hopefully this also motivates all major exchanges to implement LN functionality which would go a long way to lessening the demand for transactions. Since bitcoin is still many years away from actually being used for payments by most people, the main reason for tx is moving bitcoin between exchanges, from exchange to wallet, or from wallet to exchange. If exchanges all implement LN it will alleviate a lot of this other than those who are interacting with long term cold wallets, while at the same time onboarding lots of people to the LN and giving people an actual reason for using the LN since payments won't be a thing for years to come. Exchanges using LN would be great for getting millions of people already on LN before btc payments are widely available and it will greatly expand the LN but also kickstart payments because once you've got millions of people on LN able to make instant payments it is much more likely merchants will start taking bitcoin payments. No matter what happens with NFTs/tokens filling up blocks, if in the meantime it drives LN onboarding that'd be a great outcome for Bitcoin. Like right now I have zero reason to use LN cuz I have no one to pay bitcoin, but if exchanges start using LN I'd have a reason to use LN well before I have a reason to pay people in bitcoin, and then I'm already using LN once merchants start adopting it!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}