{
  "id": "topic_5428022",
  "title": "o48o",
  "author": "o48o",
  "created_time": "December 12, 2022, 12:10:06 PM",
  "content": "When people say that FTX was the worst thing that happened to crypto in the long time, maybe we should back up and get some perspective on that. Things were already messed up. As in comparison, total crypto marketcap was thriving during covid and recovered almost instantly to ATH after tesla dumped their crypto. But LUNA was the thing that broke everything. FTX was nothing compared to that.Do Kwon is still on the run in Serbia of all places, except he denies being on the run. I am guessing he chose Serbia because they don't have an extradition treaty with South Korea, but that seems pointless when he is internationally wanted by Interpol now. So it's a matter of time before he gets caught. But while running, Do Kwon, Su Zhu (founder of 3 arrow capital) are blaming SBF and even US Federal Prosecutors are investigating SBH for his involvement in the UST crash.Now i would like to very much like to blame Kwon for UST as he was warned several times about issues with it but he was just too arrogant and annoying to take the threat seriously.  But if SBF had anything to do with this, then not only is he blamed for FTX crash and bear run after that, but he just might be the man behind the WHOLE current crypto downfall.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428022",
  "comments": [
    {
      "author": "Baofeng",
      "created_time": "December 12, 2022, 12:34:02 PM",
      "body": "We are still breathing though, yeah, we might be in a downfall but we can go over with this all together.It just so happen that in every bearish trend, there could be a black swan and in this cycle it will have to be Do Kwon and then SBF. But what if we had another similar event next year? So are we going to blame the next guy?My point is it's inevitable something will have to come, something that will push the market down (like Covid-19 in 2020). This time though it was SBF. Nevertheless, he wil be part of crypto's history moving forward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "December 12, 2022, 12:44:08 PM",
      "body": "The question I would like to ask you is, what are we going to do after we put it all together and figure out who is responsible? What are we going to do next? Can you imprison them, or will they return your property?In my opinion, we should learn from those failures and take it as a lesson for ourselves. It would be better if we controlled our greed instead of blaming others, that way we would be able to avoid those damn traps in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "December 12, 2022, 12:50:32 PM",
      "body": "Investors themselves, but unintentionally. The market price is solely dependent with market demand which makes sense to say that if people are not interested, we may not expect for a high market value on cryptocurrencies. Then why are people seem not to be interested to invest? Probably factors which happened recently such as with undying ftx issue, exonomic related problems, wars and such. We do all just go through different circumstances as investors. We are all prone to that. Once there are positively related things towards this industry, it would reflect to the demand and eventually, the market price. So for now, wait for that thing to appear or occur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 12, 2022, 12:59:25 PM",
      "body": "Quote from: Baofeng on December 12, 2022, 12:34:02 PM-cut-My point is it's inevitable something will have to come, something that will push the market down (like Covid-19 in 2020). This time though it was SBF. Nevertheless, he wil be part of crypto's history moving forward.Except we went up to ATH right in the middle of covid lockdowns. And i wouldn't brush this off as just another crypto thing.The whole scene will look very different during next big bull. KYC will not be optional for much longer. History is bound to repeat itself and this time regulators will come to make sure we don't have to learn from it. So at least we should know what happened. Because this was very much on the different scale. We are in the spotlight of the world and there's less spectrum for freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 12, 2022, 01:11:38 PM",
      "body": "Bear markets always occur after the bull run, it's the cycle we know well in the crypto market. I'm not sure if someone really claimed it's SBF that cause this bear market but then this guy brought a massive drag. It's intentional as others see it. While DoKwon seems to be really guilty, SBF is cleaning up the mess in the media like he is not guilty and Oleary the FTX spokesperson is about to back him up this Dec 14 hearing. It looks like SBF is going to freely walk away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bettercrypto",
      "created_time": "December 12, 2022, 02:23:34 PM",
      "body": "In my analysis, the fall of luna and Ftx affected the crypto market equally. Then we all know that there are other reasons why the market falls apart from the luna and Ftx incident. And besides this, we also know that when there is a bear market that happens, there are real situations like this that are not expected in the market.    And because of these events, we may have been affected, but we are still here and continue to fight and gamble in this industry, believing that we can still grow our capital in cryptocurrency, and we know that there is and still is a crypto to help ours to recover our lost capitals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TheUltraElite",
      "created_time": "December 12, 2022, 02:53:19 PM",
      "body": "As far as I have seen in previous events, not a single event is fueling a bear run, but a series of events and their cumulative effect, like what one can opine from the images posted in the OP. So in every such trend, the aftermath is simple : nobody gets blamed and people forget because the bull market hits after a few months or so and they are happy again. Again when the bear market hits, they start their same complaints.In the recent bear run of 2022-year end, I believe there will be some celebrity events happening and legal processes, but I doubt it will lead to anything fruitful for people who lost their money.The reason I say this, is because the investors are themselves responsible for their actions and these could have been prevented by learning from events in the past namely MtGox and Luna or Bitconnect (for people of my era).Even then the people who will make money from these events are those who treat these as numbers and not \"events\" - they use it to buy at the discount and will sell at the next high.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "December 12, 2022, 02:55:11 PM",
      "body": "there have been a lot of theories and conspiracy with FTX so that must have influenced people to see him the bogey man in crypto while acting like the savior after bailing out blockfi, celsius and etc.every body buys his image during that time but according to wallstreet journal, FTX or SBF was actively trying to depegged USDT. that's one heck of a villain. although we hate USDT, what he did is something that will crumble the market. he could be doing more of this before this attempt.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "December 12, 2022, 03:48:25 PM",
      "body": "None responsible for the bear run. Those bad events happened due to the human error that was wrongly calculated the output from what they have done. The bad news that happened so many times were making the situation even worst. I just wanna remind you that about the war that was also affecting the global economic. You have been pointing out some bad events that were greatly affecting the market but the bearish trend has been triggered by so many countries that got recessions and even some countries were collapse. That must become the main thing that was triggering the hype to be done last year. There have been many people securing their assets instead of used it to invest in the commodities. I think that must become one of main reason tho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "December 12, 2022, 05:24:01 PM",
      "body": "It's inevitable as someone said. The market was still bound to go down but it was just made worse by Luna and FTX. We may as well add the protracted war which continues to affect the global economy. BTC could be bouncing from $25K to $35K range if not for the two latest major events in crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "December 12, 2022, 05:31:56 PM",
      "body": "We were thriving through the COVID because things were really normal financial during the COVID. However, things started to escalate when they were around the end of COVID because by that time lot of money was wasted on stimulus packages without any second thought to the recovery of the same. They kept printing the money out of thin air and making everyone happy but they forgot to have contingency plan. How did it affect the bitcoin? Well with the time things went out of hands, then people started realizing that they dont have money to live because they were either left alone in the lay offs or they had businesses which went down the road in the aftermath. So it was bad times and people started to withdraw all the money out of their savings as well as from the crypto space. And then rest of the stuff as mentioned in your graph started to happen and here we are today! But party is still on, so let's hodl.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JoyMarsha",
      "created_time": "December 12, 2022, 06:16:24 PM",
      "body": "Quote from: o48o on December 12, 2022, 12:10:06 PMWhen people say that FTX was the worst thing that happened to crypto in the long time, maybe we should back up and get some perspective on that. Things were already messed up. As in comparison, total crypto marketcap was thriving during covid and recovered almost instantly to ATH after tesla dumped their crypto. But LUNA was the thing that broke everything. FTX was nothing compared to that.The bear season, in my opinion, is nobody's fault. Since the invention of Bitcoin, the cryptocurrency market has gone through innumerable bear runs, which have always been attributed to the global economy rather than anyone in particular. I wouldn't argue that the episode involving FXT and Luna is what started the bear run; rather, I'd say that it played a small role and occurred at an unfavorable time when the market was already a little uneasy. The bear season would still be in effect right now if the incident never took place.The Luna and FXT event taught many investors a valuable lesson about not placing their reliance on cryptocurrencies. Before the market earns investors' faith, time must pass(bear season will take longer before is over)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 12, 2022, 07:34:46 PM",
      "body": "Quote from: JoyMarsha on December 12, 2022, 06:16:24 PMSince the invention of Bitcoin, the cryptocurrency market has gone through innumerable bear runs, which have always been attributed to the global economy rather than anyone in particular. I wouldn't argue that the episode involving FXT and Luna is what started the bear run; rather, I'd say that it played a small role and occurred at an unfavorable time when the market was already a little uneasy. The bear season would still be in effect right now if the incident never took place.The Luna and FXT event taught many investors a valuable lesson about not placing their reliance on cryptocurrencies. Before the market earns investors' faith, time must pass(bear season will take longer before is over)Well chart i showed tells a different story. On the exact day UST depegged and crashed, the WHOLE crypto marketcap lost 117 billion in a week. And even more in the coming weeks. FTX was nothing compared to that. And speaking of power of one man, when elon denounced BTC and apparently telsa started selling crypto, whole crypto marketcap lost 182 billion in 9 days. Not even war in europe has affected crypto this fast. So i wouldn't say they had a small role.Quote from: TheUltraElite on December 12, 2022, 02:53:19 PMAs far as I have seen in previous events, not a single event is fueling a bear run, but a series of events and their cumulative effect, like what one can opine from the images posted in the OP. So in every such trend, the aftermath is simple : nobody gets blamed and people forget because the bull market hits after a few months or so and they are happy again. Again when the bear market hits, they start their same complaints.-cut-Could you list those other events that affected on crypto at those same weeks i responded to JoyMarsha about?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gantez",
      "created_time": "December 12, 2022, 08:14:11 PM",
      "body": "If we can look at the chat when it was being announce that tesla not accepting bitcoin again and the price dropped down but it had another hard news with Luna scam this push down more from $25k and below $20k. I think it is natural with this time that price will rice and it will fall. If during the bear market and a bad news enter the market so you expect it to affect the price also because the bear trend will continue when news is badto the market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Xal0lex",
      "created_time": "December 12, 2022, 08:23:03 PM",
      "body": "I don't think LUNA broke everything. Do you think that if LUNA hadn't crashed, the market would have behaved differently and there would have been growth instead of decline? That's a big misconception. In 2023 even without the Terra and FTX crash everything would be bad, because the fundamentals for growth did not and still do not exist. Money is flowing out of the industry because economic instability, rising interest rates, rising unemployment, etc. are raging around the world. If Terra hadn't collapsed, something else would have happened, but a bear market under the kind of economic conditions that occurred in 2023 was inevitable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "December 13, 2022, 06:31:13 AM",
      "body": "So what's the point if we know about this?Don't give a shit to Elon Musk and Tesla (rich person and company), UST (shitcoins), and CZ (centralized exchange). This mean if everyone are don't rely to rich people financial advice, don't invest on shitcoins and don't leave their coins on centralized exchanges, it wouldn't affect the market!But most people never learn about this and still continue to trust those thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "worle1bm",
      "created_time": "December 13, 2022, 07:10:58 AM",
      "body": "The market was down before FTX crash also and it just lighten up the fire as kerosene wiping out billion of dollars out of market as all coins crashed but the main question is have we not seen such bear runs in the past aslo? So why are we making it a big issue this time? If you are holding your bag wisely not all the shitcoins you don't need to worry and just need to hold long term to be in profitable situation again.But if you blame someone particularly for this bear run I fear it's the whole market so there are ups and down which we need to cross so don't fall for such things and have patience for recovery.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "December 13, 2022, 09:44:44 AM",
      "body": "Quote from: o48o on December 12, 2022, 12:10:06 PMWhen people say that FTX was the worst thing that happened to crypto in the long time, maybe we should back up and get some perspective on that. Things were already messed up. As in comparison, total crypto marketcap was thriving during covid and recovered almost instantly to ATH after tesla dumped their crypto. But LUNA was the thing that broke everything. FTX was nothing compared to that..... I think you are beginning to notice the inconsistencies in their data concerning what is responsible. The truth is that the bull was completely in charge until it let the bear take charge for awhile. Now the bull is in charge again. Whatever the bear does won't have any effect, not even a car company dumping all its coins. The bull has all the power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "December 13, 2022, 04:09:21 PM",
      "body": "To be honest FTX happened when bitcoin was already at 18-19k levels, got up to 20-21k when people heard Binance may take over, and then crashed to 16k levels when that failed, but the price was at around 18k or so before that. Right now we are above 17k, which means we haven't fallen even 10% since that day, barely 5% to be fair, probably less.This is a huge proof that, we dropped from 68k to this price, hence FTX can't be responsible for anything at all, all these other names, other companies, or ftx, nobody is responsible for it. Bear run started last year and whatever caused it was the reason and since then we are still feeling the waves of it, that's it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}