{
  "id": "topic_5450371",
  "title": "HedgeFx",
  "author": "HedgeFx",
  "created_time": "April 27, 2023, 12:20:31 PM",
  "content": "Premessa, uso hype come conto principale per tutte le mie esigenze.Detto ciò, premettendo che dal punto di vista \"bancario\" hype è già tanto (magari un dossier titoli e operatività in titoli vere e non bitpanda sarebbe ok) la cosa carina è che ti permette di comprare e vendere bitcoin direttamente a Conio (creata e gestita da un utente del firum, se non erro Vincenzo) . L'interfaccia è davvero semplice ed essenziale: inserisci l'importo e compri al mercato (non hai scelte di prezzo , oridini condizionati ecc) oppure vendi al mercato. Non compraimo o vendiamo un CFD (come sovente accade in tutte quelle cacatine che girano online):qua si compra direttamente la cryptovaluta. I bitcoin vanno a finire su un portafoglio online (penso sempre Conio)  di cui ti viende fornita anche la frase di recupero (e questa è davvero una cosa buona) .Oltre ad acquistare puoi anche ricevere bitcoin direttamente sul tuo portafoglio, con l'indirizzo che cambia ad ogni ricezioen (altra cosa buona!).Nauturalmente puoi inviare i tuoi bitcoin a qualunque address, e la cosa carina è che ti porta giò impostate tre modalità di commissioni minng differenti.Acquisti e vendite vengono regolati a mezzo bonifico istantaneo automatico da e verso Conio, quindi puoi sempre fare cashout ed avere subito i tuoi soldi sul conto. Capitolo FEE. Questo fa male, ma stiamo parlando di un servizio accessorio ad un conto corrente e ci può anche stare : si va dal 2% per il profilo base, fino ad arrivare all'1% per i premiun. In fondo, Coinbase che capitalizza miliardi di euro non è mi che tanto più economico! (e non ti da la frase di recupero   )Unica pecca: trattandosi di un portafoglio reale,  prima di poter inviare o vendere i bitcoin i bitcoin acquistati o ricevuti, devi aspettare che questi siano confermati. Concetto un pò duro da mandare giù a chi magari acquista per la prima volta e vorrebbe subito trasferire i suoi bitcoin. Dal mio punto di vista merita la promozione, magari con la speranza che si possano aggiungere in un prossimo futuro altre crypto (magari ETH, LTC e USDT) con qualche forma di ordine condizionato, e naturalmente con la speranza che il buon Vincenzo se legge possa intercedere per una struttura commissionale più bassa",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450371",
  "comments": [
    {
      "author": "babo",
      "created_time": "April 27, 2023, 01:53:07 PM",
      "body": "io sono stato uno dei primissimi betatesterun gran servizio, ma al solito preferisco altri sistemiavevo voglia di provarl oe devo dire che funziona abbastanza bene, overo sono soddisfatto del servizio.consigliato a chi non e' un purista e vuole cose sempliciSICURAMENTE MEGLIO DI COINBASE",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "April 27, 2023, 02:08:22 PM",
      "body": "Utilizzo Hype da molti anni ed è un ottimo sistema per gestire denaro/btc/spese varie etc. Hanno un sacco di funzionalità e continuano a rendere il sistema sempre più \"friendly\" (vedi l'introduzione di WOLF)Qui una mia recensione sul servizio per acquistare btchttps://bitcointalk.org/index.php?topic=5237210.msg54353407#msg54353407Qui una breve \"guida\" che permette di unire cashback per spese in negozi fisici/ all' acquisto di bitcoin (attenzione hanno un servizio interno di cashback anche su hype per le spese online...)https://bitcointalk.org/index.php?topic=5358640.msg57878993#msg57878993La frase di recupero (da sola) non permette di recuperare i btc ma è un sistema multifirma di cui conio detiene 2 di 3 firme. https://www.conio.com/supporto/faq/cos-e-il-portafoglio-bitcoin-conioQuoteRispetto ai classici Portafogli digitali in cui possiedi una chiave privata da cui generare indirizzi pubblici su cui ricevere Bitcoin, la nostra tecnologia di custodia si basa su una architettura Multi-Firma 2/3, cioè un protocollo di sicurezza a 3 chiavi private, di cui 2 online e 1 offline. Per autorizzare una transazione sono necessarie 2 firme su 3. La prima è in tuo possesso ed è sintetizzata dalla tua password e rappresentata dalle 12 parole; la seconda è detenuta da Conio online mentre la terza viene conservata in un archivio offline ed utilizzata nel caso in cui l’utente perda la sua chiave. Grazie alla nostra soluzione tecnologica, potrai sempre recuperare i tuoi Bitcoin anche nel caso di smarrimento della tua chiave privata. Se vuoi approfondire come funziona il nostro protocollo di sicurezza applicato al Wallet Bitcoin Conio, vai nella sezione “Sicurezza” e leggi la faq “Come viene garantita la sicurezza del mio Portafoglio Bitcoin Conio”.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "April 27, 2023, 02:21:36 PM",
      "body": "asp asp mi sono perso, cose WOLF? ora googlo e vedo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "April 30, 2023, 06:39:26 AMLast edit: April 30, 2023, 06:58:33 AM by mendace",
      "body": "Quote from: bitbollo on April 27, 2023, 02:08:22 PMUtilizzo Hype da molti anni ed è un ottimo sistema per gestire denaro/btc/spese varie etc. Hanno un sacco di funzionalità e continuano a rendere il sistema sempre più \"friendly\" (vedi l'introduzione di WOLF)Qui una mia recensione sul servizio per acquistare btchttps://bitcointalk.org/index.php?topic=5237210.msg54353407#msg54353407Qui una breve \"guida\" che permette di unire cashback per spese in negozi fisici/ all' acquisto di bitcoin (attenzione hanno un servizio interno di cashback anche su hype per le spese online...)https://bitcointalk.org/index.php?topic=5358640.msg57878993#msg57878993La frase di recupero (da sola) non permette di recuperare i btc ma è un sistema multifirma di cui conio detiene 2 di 3 firme. https://www.conio.com/supporto/faq/cos-e-il-portafoglio-bitcoin-conioQuoteRispetto ai classici Portafogli digitali in cui possiedi una chiave privata da cui generare indirizzi pubblici su cui ricevere Bitcoin, la nostra tecnologia di custodia si basa su una architettura Multi-Firma 2/3, cioè un protocollo di sicurezza a 3 chiavi private, di cui 2 online e 1 offline. Per autorizzare una transazione sono necessarie 2 firme su 3. La prima è in tuo possesso ed è sintetizzata dalla tua password e rappresentata dalle 12 parole; la seconda è detenuta da Conio online mentre la terza viene conservata in un archivio offline ed utilizzata nel caso in cui l’utente perda la sua chiave. Grazie alla nostra soluzione tecnologica, potrai sempre recuperare i tuoi Bitcoin anche nel caso di smarrimento della tua chiave privata. Se vuoi approfondire come funziona il nostro protocollo di sicurezza applicato al Wallet Bitcoin Conio, vai nella sezione “Sicurezza” e leggi la faq “Come viene garantita la sicurezza del mio Portafoglio Bitcoin Conio”.Ottima recensione HedgeFX non ho mai provato Hype ma sicuramente ci farò un pensierino, diciamo che sono orientato verso banche straniere comunque se gestisce Bitcoin diventa interessante.Bitbollo dunque loro detengono 2 chiavi su 3 di un multisig e suppongo lo facciano perché con 2 c'è sempre la possibilità di spostare i fondi ma dunque non si può importare fuori il wallet.In questo modo diciamo che non detieni mai veramente i tuoi Bitcoin perché non puoi ricreare la private key esternamente e nel caso più estremo loro perdessero le 2 chiavi (penso sia impossibile avranno duplici backup ma mai dire mai) avresti perso i Bitcoin per sempre",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "April 30, 2023, 01:01:19 PM",
      "body": "si ma non e' che hype detiene le chiavi, e' conio con cui ha una partnershipdiciamo che l'integrazione non e' stata subito fatta bene, ma hanno sistemato molto bene in corsaquindi ora e' uno strumento molto buono dal punto di vista dell'usabilitameglio di coinbase",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "April 30, 2023, 03:37:45 PM",
      "body": "Quote from: babo on April 30, 2023, 01:01:19 PMsi ma non e' che hype detiene le chiavi, e' conio con cui ha una partnershipdiciamo che l'integrazione non e' stata subito fatta bene, ma hanno sistemato molto bene in corsaquindi ora e' uno strumento molto buono dal punto di vista dell'usabilitameglio di coinbaseQuesto l'avevo capito però loro hanno 2 di 3 perché diciamo che le cose stanno così: loro non possono importare il wallet totalmente in un'altra GUI ma al momento che tu perdi la tua seed ovvero quel 1 di 3 con le altre 2 in mano a Conio possono spostare comunque i fondi verso un nuovo wallet che equivale a dire la stessa cosa di custodial, però ti danno la garanzia di non perderli se tu distrattamente non ti segni o perdi la seed.  Mentre tu con solo 1 parte di 3 non puoi ne firmare una transizione per spostarli ne ricreare il wallet su una nuova GUI. Quindi ok hype che fa l'occhiolino a Bitcoin con l'appoggio di Conio ma quei Bitcoin sono sempre a rischio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "May 02, 2023, 06:33:02 AM",
      "body": "ah intendi quellocerto certoma devi saper usare in maniera corretta uno strumento, secondo me, se lo usi male e' \"colpa\" tuaio lo vedo come un \"mando bitcoin\" e tramite conio li scambio per spenderli con hypequesto e' l'uso POTENZIALE che mi immagino di hypeo per comprarli e trasferirli (gia fatto nelle mie prove nella beta)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "May 02, 2023, 01:36:59 PM",
      "body": "Ci condivido un ricordo mio su hype! Il primo acquisto fatto per prova! Quando ancora bitcoin girovagava sui 9k€🥲 Si facevano buoni affari in quel periodo poi ci fu il boom sonico di bitcoinComunque per comprare e vendere a mercato secondo me merita hype! Certo fee a parte il servizio è più che soddisfacente",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "May 02, 2023, 02:23:42 PM",
      "body": "Quote from: Lillominato89 on May 02, 2023, 01:36:59 PM...Comunque per comprare e vendere a mercato secondo me merita hype! Certo fee a parte il servizio è più che soddisfacenteSi decisamente, per il tipo di servizio le fee/commissioni etc etc. sono abbastanza contenute. Praticamente 3,5 euro circa ogni 250 euro di spesa. Considerando anche lo spread tra prezzo di acquisto/vendita arriviamo al 2/2,5% circa. Hype può essere ricaricato al supermercato o al tabacchino, o direttamente con carta di debito.Dulcis in fundo... i btc sono disponibili subito... Altri servizi che permettono questo tipo di acquisto \"immediato\" hanno fee allucinanti (5-10%)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lillominato89",
      "created_time": "May 02, 2023, 08:13:17 PM",
      "body": "Quote from: bitbollo on May 02, 2023, 02:23:42 PMQuote from: Lillominato89 on May 02, 2023, 01:36:59 PM...Comunque per comprare e vendere a mercato secondo me merita hype! Certo fee a parte il servizio è più che soddisfacenteSi decisamente, per il tipo di servizio le fee/commissioni etc etc. sono abbastanza contenute. Praticamente 3,5 euro circa ogni 250 euro di spesa. Considerando anche lo spread tra prezzo di acquisto/vendita arriviamo al 2/2,5% circa. Hype può essere ricaricato al supermercato o al tabacchino, o direttamente con carta di debito.Dulcis in fundo... i btc sono disponibili subito... Altri servizi che permettono questo tipo di acquisto \"immediato\" hanno fee allucinanti (5-10%)Aggiungerei anche ricarica con bonifico e versamento stipendio, io lo trovo abbastanza buono come prodotto anche se lo uso pochissimo, almeno che non voglia fare piccoli cashout",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "giammangiato",
      "created_time": "May 02, 2023, 08:24:35 PM",
      "body": "Molto bello d'avvero questo servizio Hype. Ne ho sentito parlare ma i miei amici usavano o satispay oppure revolut. Hype purtroppo poco e conviene avere quello che hanno tutti per fare tipo la divisione del conto o delle spese.Ci sta solo bitcoin o ci sono anche altre crypto?, sono molto curioso.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "May 03, 2023, 08:32:41 AM",
      "body": "Quote from: giammangiato on May 02, 2023, 08:24:35 PM...Ci sta solo bitcoin o ci sono anche altre crypto?, sono molto curioso.Solo bitcoin! Si differenzia rispetto agli altri servizi che hai citato perchè qui puoi comprare/vendere monete vere e proprie e non \"contratti\".Quote from: Lillominato89 on May 02, 2023, 08:13:17 PM....almeno che non voglia fare piccoli cashoutSi, è davvero comodo per l'utilizzo nelle piccole spese....e continua ad essere una sorta di \"unicum\" nel panorama italiano. Nonostante ci siano altre banche con offerte per \"giovani\" loro sono gli unici ad offrire questa opzione.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bastisisca",
      "created_time": "May 03, 2023, 10:19:06 AM",
      "body": "Conio è stata una delle prime aziende in Italia ad offrire servizi di gestione di criptovalute, ed è stata accolta con entusiasmo da una serie di investitori istituzionali e privati. L'azienda ha anche collaborato con diversi partner commerciali, tra cui Banca Mediolanum, Nexi e Poste Italiane, Banca Sella (Hype).Fondata nel 2015, l'azienda ha sviluppato una piattaforma di gestione di Bitcoin, Ethereum e altre criptovalute che consente agli utenti di acquistare, vendere e gestire il proprio portafoglio di criptovalute in modo facile e sicuro con una interfaccia user-friendly.Attualmente, se non erro, l'unica ad averlo integrato è Hype, di una banca all'avanguardia come Banca Sella (prima in italia a offrire servizi per ecommerce).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wrib",
      "created_time": "May 03, 2023, 11:06:21 AM",
      "body": "Essendo un unicum nello scenario bancario italiano, credo che ogni buon bitcoiner dovrebbe supportare l'iniziativa. Non sto assolutamente dicendo di metterci tutti i vostri btc, in quanto come un qualsiasi exchanger potrebbe saltare il banco, ma una piccola cifra simbolica che fa statistica sul numero totale di utilizzatori, se dovessero rimuovere la feature per mancanza di successo le altre banche eviterebbero simili progetti, viceversa potrebbe essere il primo di n servizi simili.Per la precisione c'è anche banca generali che offre un servizio di compra/vendita di bitcoin:https://www.bancageneraliprivate.it/innovazione/bg-conioTuttavia tra le faq si intuisce che si possono comprare e vendere solo dentro la loro app (quindi a fini puramente speculativi, se non potete inviarli fuori dall'app a indirizzi normali bitcoin è come non possederli veramente):Sarà possibile utilizzare le Criptovalute come strumento di pagamento?BG Conio non ammette il trasferimento di Bitcoin da e verso altri wallet. Pertanto al momento tramite BG Conio non è possibile effettuare pagamenti in Bitcoin o acquistare strumenti finanziari pagando in Bitcoin.Quindi al momento l'unico vero strumento integrato da un'entità finanziaria tradizionale, in italia, con cui si comprano veri bitcoin è HYPE.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "giammangiato",
      "created_time": "May 03, 2023, 12:00:11 PM",
      "body": "Quello che dici non è del tutto sbagliato, bisogna supportare tali iniziative.Quasi decido di iscrivermi ad Hype e fra le motivazioni menziono che il motivo è la parte di Conio con Bitcoin.Che dite?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DensBTC",
      "created_time": "May 03, 2023, 01:16:05 PM",
      "body": "Sono un soddisfatto cliente Hype da un po', ci sono due cose che mi piacciono la prima è il cambio istantaneo e molto pratico BTC Euro e viceversa, lo uso come conto di liquidità e non tengo più liquidità di riserva in euro, tengo l'equivalente di circa una mensilità direttamente in satoshi su Hype e se riesco li spendo tal quale altrimenti se mi servono euro faccio il cambio al volo; seconda cosa è un wallet vero e Conio non può fare riserva frazionaria o muovere altrove i tuoi sats di nascosto da te.Quanto al multisig 2 di 3 in realtà se ho capito bene una delle 3 firme viene usata come firma di emergenza e rimane \"sepolta\" e custodita da una parte terza rispetto a Conio, per firmare usi la tua firma e quella di Conio, per ripristinare usi la tua firma e quella di Conio, se Conio fallisce con la firma cliente e quella della terza parte il curatore potrà sbloccare i fondi, se perdi la tua Conio e la terza parte possono fare il recupero su tua richiesta ecc ecc quindi tutto bene? No non tutto, Conio e la terza parte fiduciaria su richiesta di un'autorità giudiziaria possono sequestrare i tuoi fondi, sono veri bitcoin su un vero wallet ma hanno una caratteristica in meno rispetto a bitcoin in self custody, non sono incensurabili.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "duesoldi",
      "created_time": "May 03, 2023, 08:23:36 PM",
      "body": "Quote from: DensBTC on May 03, 2023, 01:16:05 PMSono un soddisfatto cliente Hype da un po', ci sono due cose che mi piacciono la prima è il cambio istantaneo e molto pratico BTC Euro e viceversa, lo uso come conto di liquidità e non tengo più liquidità di riserva in euro, tengo l'equivalente di circa una mensilità direttamente in satoshi su Hype e se riesco li spendo tal quale altrimenti se mi servono euro faccio il cambio al volo;......Domanda provocatoria.Io ho sempre evitato di usare servizi come Conio, Hype e simili perché non mi era chiaro come gestirli dal punto di vista fiscale.Con la legge di bilancio 2023 mi sembra invece che la cosa sia stata definita in modo puntuale e, se non erro, l'uso di cripto per comperare beni o servizi è soggetto a imposta sulle plus nel caso di movimenti superiori a 2k€ nel periodo di imposta (quindi ogni anno).Non mi sembra una soglia difficile da superare, quindi la domanda sorge spontanea: usando servizi come questi dove il kyc è obbligatorio, non avete paura di ricevere la famosa letterina da AdE ?Non penso che tutti tengano precisa contabilità di tutti i movimenti che fanno al fine di essere sicuri di non superare quella soglia, quindi come vi comportate ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fillippone",
      "created_time": "May 03, 2023, 11:28:32 PM",
      "body": "Quote from: HedgeFx on April 27, 2023, 12:20:31 PMDetto ciò, premettendo che dal punto di vista \"bancario\" hype è già tanto (magari un dossier titoli e operatività in titoli vere e non bitpanda sarebbe ok) la cosa carina è che ti permette di comprare e vendere bitcoin direttamente a Conio (creata e gestita da un utente del forum, se non erro Vincenzo) . Vincenzo sarebbe Vincenzo di Nicola, che è stato a lungo in Conio, ma ora ne è uscito.Per quanto riguarda Hype segnalo anche questa recensione di @baboHype plus e conio",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "May 04, 2023, 07:20:47 AM",
      "body": "grazie sei meglio di chatgpt ho anche il plus, quindi vuol dire che a banca sella gli do i sooooldiil servizio mi piace, sono soddisfattonon faro qualcosa di extra perche non mi interessa, il plus mi sta benissimo",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}