{
  "id": "topic_5418519",
  "title": "thecryptogandalf",
  "author": "thecryptogandalf",
  "created_time": "October 27, 2022, 01:25:33 PM",
  "content": "Herkese Merhaba,Ben ve arkadaslarim, kodlamaya gerek duymadan kendi krip botunuzu ileri seyive risk yonetimi araclari ile olusturup,  geriye donuk test edip(backtesting), gecmis pozisyonlarini chart uzerinde izleyebileyeceginiz bir platform gelistirdik. Buradaki yatiricimlarinda fikir ve dusuncelerini merak ediyoruz. Simdiden tesekkurler. Cleo.finance, kripto yatirimcilarinin ticaret süreçlerini otomatikleştirebilecekleri yenilikçi bir kripto yatirim platformudur. Platform, kripto yatirimcilarina genis veri setleri, gelişmiş risk yönetimi, kodsuz anında otomasyon, geriye dönük test, kapsamlı istatistikler ve kripto yatirimcilarinin her pozisyonlarını tekrar tekrar chart uzerinde izleyebildikleri benzersiz bir analiz aracı ile kendi özel pozisyon acma ve kapama kurallari oluşturmalarını sağlar. Kullanicilar, OKX veya Binance hesaplarını API aracılığıyla bağlayarak kolayca başlayabilir. Onemli not: Cleo.finance'in fonlarınıza erişimi yoktur ve fonlarınızı çekemez. API bağlantısı yalnızca pozisyon acma ve kapama için kullanılabilir ve istediğiniz zaman iptal edebilirsiniz. Zaten platformda para çekme izinleriyle API bağlantısını kabul edilmemektedir.Her kullanici kendine ozel kripto yatirim botlarini sadece yazarak, kodlamaya gerek duymadan olusturabilirler. BTCUSDT fiyati EMA(200) uzun uzerine ciktiginda al gibi.Hizli ve kapsamli geri donuk test araci(Backtesting) - Daha gercekci test sonuclari icin borsa komisyon ve islem ucretlerini de ekleyebilirsinizTyping your entry and exit conditions with up to 55 technical indicators, including VWAP, MACD, RSI, candlestick patterns or price action.Her bir indicator kendi icinde ozellestirebilir. Ornegin RSI indikatoru icin parametre ayarlarini, kripto para cifllerini, yada zaman ayarini degistirebilirsiniz./size]7 period secme – 1 dakikaliktan 1 gune kadarHazir ve ucretsiz trading sablonlari4 Stop Loss ve 4 Take Profit emirleriand ve cok daha fazlasi.Automated Loop Strategy istatistikleriPosition Replayer araci Asset Management Araci -",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418519",
  "comments": []
}