{
  "id": "topic_5439415",
  "title": "IIrik11",
  "author": "IIrik11",
  "created_time": "February 11, 2023, 03:20:33 AM",
  "content": "i am  i feel like this would be the end of bitcoin-trading for a lot of users around the world.and i know that there are other p2p exchanges out there but mostly all of them all blood sucking monsters.who only care collecting data for reselling and charging enormous fees for the smallest of trades.this is not good for all crypto future.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439415",
  "comments": [
    {
      "author": "Bitcoin Smith",
      "created_time": "February 11, 2023, 02:13:43 PM",
      "body": "Honestly I didn't know about their closure until I saw your thread so thanks for the information.Since the implementation of strict KYC policy LBC lost most of their users around the world but in India they still have great volume so now the choices are pretty lame which is Paxful and its similar to LBC but do we have any other alternatives apart from Paxful for doing p2p trades to trade with INR?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "February 11, 2023, 02:16:12 PM",
      "body": "Quote from: IIrik11 on February 11, 2023, 03:20:33 AMi am  i feel like this would be the end of bitcoin-trading for a lot of users around the world.and i know that there are other p2p exchanges out there but mostly all of them all blood sucking monsters.who only care collecting data for reselling and charging enormous fees for the smallest of trades.this is not good for all crypto future.I am not as they started doing KYC. Initially, they were great and were getting a lot of new users from India before making KYC mandatory but afterward, they were like any other CE. They did not survive because of impersonating a centralized exchange on regulation. If they had not implemented KYC regulations they would have become the biggest exchange in India.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "February 11, 2023, 06:52:36 PM",
      "body": "Quote from: IIrik11 on February 11, 2023, 03:20:33 AMi am  i feel like this would be the end of bitcoin-trading for a lot of users around the world.and i know that there are other p2p exchanges out there but mostly all of them all blood sucking monsters.who only care collecting data for reselling and charging enormous fees for the smallest of trades.this is not good for all crypto future.Interesting news. P2P isn't bad for all the exchanges to be honest. Obviously collecting data is a usual thing done by almost every exchange but even WazirX was having a very good P2P system. Person could easily transfer money from UPI and you can transfer INR. Similar system was there for other exchanges as well. Most of them as far as I know don't even charge any fees for this service or generally it's just 0.1% like any trade fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "February 13, 2023, 01:06:37 PM",
      "body": "no? okay, just me then.they weren't that aggressive about kyc and it was only required when you reach a trading threshold.also, it was the only available option to buy/sell bitcoin in some countries.but still a 10 year old company to stop doing business is not good for bitcoin future imho.as far as wazirx goes, they're a part of binance if i am not mistaken.and that is a big red for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "March 30, 2023, 11:29:49 AMLast edit: March 30, 2023, 11:42:17 AM by IIrik11",
      "body": "Quote from: allahabadi on March 30, 2023, 05:15:53 AMQuote from: Newcurrency66 on March 29, 2023, 10:14:43 PMAmadeurAmadeus came to use under our supervision. Then  Ashi for minor  maintenance.  Tarun aro jai gan nazi.Currently frome Bangladesh currently  currently currently currently Dibrugrath may be deprived of. Tha praice also Very high in exchange  for tanvaishnavas. It can be controversial.  Our moral lightning bolt. They paid tribute to theme  before tha beer. Our continuity came to continuation continuation.  😉😉😉😉😉😉😉😉😉😉can someone tell me wht language this is?i think this is bot spam.  locking the topic!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}