{
  "id": "topic_5448689",
  "title": "CryptoHFs",
  "author": "CryptoHFs",
  "created_time": "April 13, 2023, 03:39:47 PMLast edit: April 13, 2023, 04:15:40 PM by CryptoHFs",
  "content": "If you shutdown your mining rig that consists of 1000 s19 minershow long will it take since you decide to turn them on until the hash rate is stable on the pool and running?if you want to mine only 10 minutes every houropen the machines > mine 10 minutes > close all the machinesonce every 1 hourwhat will happen to the machines?how long will it take every time to launch and run stable?and any other probabilities you may think ofthe questions I ask may look strange, but you will understand laterhow much will it save in electricity if you shut them down completely and if you just stop mining for 50 minutes",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448689",
  "comments": [
    {
      "author": "mikeywith",
      "created_time": "April 14, 2023, 03:42:18 AM",
      "body": "Quote from: CryptoHFs on April 13, 2023, 03:39:47 PMIf you shutdown your mining rig that consists of 1000 s19 minershow long will it take since you decide to turn them on until the hash rate is stable on the pool and running?First, the hashrate needs to become stable locally on the miner itself, most miners go through a warm-up/tune cycle before reaching full hashrate, depending on the miner's model and firmware, this could take anywhere between 1 to 60 minutes, it depends on a lot of factors.For the hashrate to become stable on the pool, it's a matter of luck and pool difficulty, and whether or not the miners run behind a proxy, but usually 5-10 mins, depends on the pool of course, some of them have 5m hashrate display, some have no less than 15 mins so you can only tell when 15 mins had passed, but rest assured, every share you submit counts even if the chart on the pool page doesn't catch up fast enough.Quoteopen the machines > mine 10 minutes > close all the machinesonce every 1 hourwhat will happen to the machines?This will probably reduce their lifespan.Quotehow much will it save in electricity if you shut them down completely and if you just stop mining for 50 minutesWhen you shut your gears down, you save 100% of the electricity they use, but then you gain nothing, in fact, you spend more energy by doing so, the warming up, fan check and the rest will consume power for no gain in pool shares, so there is no gain at all, what are you up to anyway?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paid2",
      "created_time": "April 14, 2023, 04:05:02 AM",
      "body": "As mikeywith said, the risk would be to make some serious damages to your hardware with this strategy.You could power on your ASICs during 3 days per month, you would have the same number of shares submitted, and less risk, less things to do yourself like that.Or you could just mine with 10% of your S19s h24. In general my ASICs need 5-10 minutes to mine at their full potential after I've power them on but it depends of the firmware.  Sometimes, some pools need some more time to show the shares submitted and the real hashrate you are sending to them. Even if the shares are ok and still accounted, it shows some low values during the first hour.With stock Bitmain firmware it takes a longer time to run stable and at full hashrate, than with Braiinos for example. But Braiinos is stealing 2% (not sure about this number but it's the one I think I remember) of your shares as a dev fee...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "April 14, 2023, 05:02:16 AM",
      "body": "Quote from: iwantmyhomepaidwithbtc2 on April 14, 2023, 04:05:02 AMIn general my ASICs need 5-10 minutes to mine at their full potential after I've power them on but it depends of the firmware.Ya, it's different from one model to another, in fact, I have several miners that take longer than the others despite having bought them in a single batch, stock firmware is always slower than most custom firmware.Quote But Braiinos is stealing 2% (not sure about this number but it's the one I think I remember) of your shares as a dev fee...It's 2% for Antminer S9 and 2.5% for everything that comes after that (S17 and S19 series), but I think the word \"stealing\" is wrong! They aren't stealing anything, it's the fees they take for their efforts, it could only be called \"stealing\" if they did not inform you about it beforehand, however, it's clearly stated in multiple places that they do indeed take x% as firmware fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "April 14, 2023, 11:03:48 AM",
      "body": "Quote from: mikeywith on April 14, 2023, 03:42:18 AMQuote from: CryptoHFs on April 13, 2023, 03:39:47 PMIf you shutdown your mining rig that consists of 1000 s19 minershow long will it take since you decide to turn them on until the hash rate is stable on the pool and running?When you shut your gears down, you save 100% of the electricity they usewhat if stopped mining without shutting down?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "April 14, 2023, 12:15:11 PM",
      "body": "Quote from: CryptoHFs on April 14, 2023, 11:03:48 AMwhat if stopped mining without shutting down?I think you talking about sleep mode where you can switch the miner from low, normal mode to sleep mode. Even if the miner is set to sleep mode the miner will still consume power not 100% because the fan still running at low speed.What I guess you might have free power on daylight and you don't want to mine at night because you would end up paying electricity bill?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "April 14, 2023, 12:28:14 PM",
      "body": "Quote from: BitMaxz on April 14, 2023, 12:15:11 PMQuote from: CryptoHFs on April 14, 2023, 11:03:48 AMwhat if stopped mining without shutting down?I think you talking about sleep mode where you can switch the miner from low, normal mode to sleep mode. Even if the miner is set to sleep mode the miner will still consume power not 100% because the fan still running at low speed.What I guess you might have free power on daylight and you don't want to mine at night because you would end up paying electricity bill?to be honest it is way deeper than that.. just some solo mining craziness.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}