{
  "id": "topic_5460993",
  "title": "RockBell",
  "author": "RockBell",
  "created_time": "July 25, 2023, 12:12:28 PM",
  "content": "uploadI will advise you to return to the books so that at least when you get signals you can decide what part to take. There are books that give you good knowledge on technical analysis studying does book might profit you in comparison to always depending on signals you get from platforms. This image has explained everything in the Bitcoin ecosystem, especially when it comes to trading. Many people failed to learn instead they depend on signals, and the interesting part is how some people spend good money to get signals, Especially in Telegram groups, I've received invites, but I'd rather add knowledge than chase signals because that may lead to getting scammed, which is bad for business. Even the danger of heeding some warnings carries the potential for financial loss. I see how people run to signals and if you are comfortable with your signals also consider adding knowledge to for does wanting to trade.  from contributions that will be given you, we can all learn together.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460993",
  "comments": [
    {
      "author": "Zanab247",
      "created_time": "July 25, 2023, 02:50:50 PM",
      "body": "Thanks for dis good advice OP, I believe many people will take something good from this your advice, to take time to learn so many things that will help dem to trade their coins without waiting for signal from people. If you settle down and learn crypto trading very well, I think it will help you to avoid so many things that will make you to experience losses in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "July 25, 2023, 04:39:27 PM",
      "body": "People often make this silly mistake or not doing things in their order of priority, you will need to be informed first about bitcoin, then later you proceed to learning more on areas of interest you think you could best cope with, some people aren't good in mathematics yet they will talk about learning the technical aspects of bitcoin when knowing the basic general knowledge on bitcoin is becoming a big problem for them to cope with, others will not have the understanding of bitcoin very well enough before going on introducing it to other people to join and learn, this are just few ways or means to how we take a misconception of ideas and mix things up for ourselves and they gets complicated to handle, learning comes first in everything in life before seeing the outcome of what we do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "knowngunman",
      "created_time": "July 25, 2023, 05:11:20 PM",
      "body": "The people you are receiving the signal from also take their time to study and gain knowledge. If you lack the knowledge even after getting the signal you might fuck up and later regret. There are various books available online and offline for learning and if you are a lazy type who does not like reading there are lots of YouTube channels you can virtually learn from. Learning will earn you knowledge for self-benefit and also earn you respect for teaching others. The signal channel you rely on might get interrupted some days and you'll lose access to the signal and that will automatically end your trading career.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nelson4lov",
      "created_time": "July 25, 2023, 07:52:53 PM",
      "body": "Quote from: RockBell on July 25, 2023, 12:12:28 PMMany people failed to learn instead they depend on signals, and the interesting part is how some people spend good money to get signals, Especially in Telegram groups, I've received invites, but I'd rather add knowledge than chase signals because that may lead to getting scammed, which is bad for business. I agree 100% with your opinion. This is something that has become very common today. I've always been an advocate for pursuing knowledge rather than seeking out shortcuts. I have read and watch videos of great men that have walked this earth at some point and even successful people in modern time and there's one thing that they all have in common is that they all put in the work in their passion/goals/endeavors and kept on showing on regardless of how difficult and tough it was. They remained consistent.The biggest traders in Nigeria and in the world today took out time to learn and build a solid foundation of their trading skills and today, it still pays them. People just want to enjoy the rewards without the effort/work and when it doesn't work out, they become frustrated and resort to signals. We need to first change the perspective of people that trading isn't a get rich scheme or an easy skill to learn.For anyone interested in learning how to trade but find it difficult, I suggest learn how to learn using this free coursera course: https://coursera.org/learn/learning-how-to-learn",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.right85",
      "created_time": "July 25, 2023, 10:36:21 PM",
      "body": "No b ne somtin say, if persn ft get somtin easily, e no go evn reason d hard way. Watin b d hard way cef. D matter b say, dis easy way dey always choke. Eida e choke u as u start to dey waka d Road or e choke u wen u feel say, matter don solve.If 2 mak am nd dey stable 4 life bin easy, everybody 4 b big man nd woman.D idea b say, market predictions dey very hard nd b4 u evn understand watin det happn there cef, u go don lose both time nd money and d koko b say, plenty pple no go like waka d road way ordas don waka. Na why dem hope to get am simple tru trading signals.D matters way dey hear b say, e get hw dem dey use signal nd u go end up learning nothing frm d process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "July 26, 2023, 05:15:57 AM",
      "body": "The worst thing to do in trading is to know nothing about trading and be depending on trading signals. Signal providers and signal groups will not probably exist if they can make huge amount of money from trading. They only give signals which may work or fail, but in the process, they are enriching their pockets with people's money..It is good to learn, but trading is still harder in profit making than that. Trading is very risky and the risks are almost or the same as the risks in gambling. That is why it is good to start trading with the money that you can afford to lose. Using the amount that is less than the amount that you can afford to lose to start and use the amount that you can afford to lose to continue to trade is the best.But for most people, holding would have been better, but which can be risky too if you do not get the right time to invest, but by far not risky as trading and making profit is more realistic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "July 26, 2023, 03:28:05 PM",
      "body": "What baffles me the most is those newbies that don't even know anything on trading will just jump into it,all in the name of I want to trade to make profit. Learning is the best way to become a good  trader and after learning the fundamental analysis and technical analysis,then you will be able to know the signals. But if you don't learn and need signals,how are you sure that you will make profit without understanding the market. Don't be lazy to learn and you are looking for a short cut to make profit,trading don't work like that. Knowledge is power and not signal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "July 26, 2023, 05:12:55 PM",
      "body": "Quote from: Charles-Tim on July 26, 2023, 05:15:57 AMThe worst thing to do in trading is to know nothing about trading and be depending on trading signals. Signal providers and signal groups will not probably exist if they can make huge amount of money from trading. They only give signals which may work or fail, but in the process, they are enriching their pockets with people's money..That's the exact truth you just said and I agree with you 100% with no doubt, because relying on signal group before you could execute a trade is a clear sign of trading deficiency, which is the worst decision any newbie trader should ever subscribe to, as whatever signal given to you, you still have no guarantee it's gonna be 100% legit, which means you are likely to pay for subscription and still also lose your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "July 26, 2023, 07:29:02 PM",
      "body": "Most people would want it things come in a compatible and already summarized as a point of final destination but it would be better if we have knowledge of the routes that leads the way for this final destination.It is said that every leaders are readers so leadership would come on any angel which is why we should obtain  the primary ideas across secondary levels.Why not bothered of who illustrated the signal if really right or wrong?It is better of you find yourself a half traceable way that requiring for a map/signal or a person to lead your full way back.This is as our people may say that \"Teach me how to fish\" and don't give me a fish\"Learning would broaden your mental faculty to creating and recreating but signal would only serve you good of a consumption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "July 26, 2023, 08:23:29 PM",
      "body": "Your story is just like the saying that, people like to take fish instead of learning of how to fish in the river. Men don't like to do things that will take their all day but they prefer to the one that give them instant benefits. Reading books go too delay for dem so dem like the signal to get their profit sharp sharp. But really traders need signal to now the market but they can't understand the signal without reading or learning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SmartGold01",
      "created_time": "July 26, 2023, 09:48:20 PM",
      "body": "This world there are some sets of people who love easy life  that doesn't want to stress themselves which they always want some free and cheap lifestyle without going into much difficulties. We should try to gain knowledge as I believe too well that without being well educated there is no way one could go more higher just as they often said \"knowledge is power\" but in way a woman fails to enhance herself with knowledge I don't think she would make any progress academically except those that knowns some menial jobs would get themselves attached to those skills. So leaning is more better than just going for signals which I think if they developed their minds to learn they will even understand more better than those who are just waiting for cheap signals from their providers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "July 26, 2023, 11:02:13 PM",
      "body": "Getting signals or paying huge amount of money for the best signals is not a guarantee that your trade will go well as the signal depicts it for you. There’s one thing I’m sure of that humans do, when they’ve a way of making lots of money, they don’t expose it to the public, rather they’ll keep it to themselves or confined to a few number of people. Those selling signals won’t be doing that if they can use the same signals and earn big from trading. Rather than earning little pennies from selling signals and they themselves are not always sure of what the outcome of the signal guide will be. If signals are dependable, we’ll have few people selling signals and more people making it rich in cryptocurrency trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "July 27, 2023, 08:26:27 PM",
      "body": "Well that's human nature for you, they prefer having an easy way to everything and trust me the average person always feel lazy to make research about something that's actually going to benefit them, they always find an alternative means for them to actually stress themselves and gather information about stuffs they rely on fake promises rather than self research although this doesn't apply to all humans but at least a large of people do thisAlso same thing occurs in the gambling world as most gambler tend or prefer to buy games which they are promised it's sure winning but at the long of everything the game still end up lost..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "July 28, 2023, 11:29:38 AM",
      "body": "I assent to what the OP has said, and it's good that it's also coming from the local board, so that most of us, especially newbies to trading, will not make some mistakes that only end up putting them at great loss, all in the name of trying to make some profit from crypto trading. Just as the OP and other commentaries have said, it's just right to learn first about trading, how to read the candle, how to analyse and understand an upcoming trend 📉📈 in the market, and also how to use some trading tech tools, so that even if you are dealing with copied trade, you can possibly detect if there are high or low possibility of losing the trade, at such you will know the capital to enter that particular trade with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "July 28, 2023, 03:16:45 PM",
      "body": "You know learning is something that takes time and as such, one needs to be patient enough to assimilate all that is required of them to be able to scale through after learning but the reverse is always the case. People just want already made end point so they could be able to feast on immediately which is not so. This has caused many their funds and resources. They forget learning gives one a broader knowledge to be able to apprehend any situation they find themselves in the cause or journey of life which is still applicable in all walks of life. Newbies are mostly the ones that does this. They feel trading is all about signal and they older ones in the system take advantage of the opportunity to exploit them and sometimes they give out fake signal  since the newbies know nothing much about it, they assume it to be accurate and loss big time.Although it takes time to learn but patience is all it takes to learn properly and get every necessary information you deserve to keep you informed and updated on trading signals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dzwaafu11",
      "created_time": "July 28, 2023, 04:41:59 PM",
      "body": "Quote from: RockBell on July 25, 2023, 12:12:28 PMThis image has explained everything in the Bitcoin ecosystem, especially when it comes to trading. Many people failed to learn instead they depend on signals, and the interesting part is how some people spend good money to get signals, Especially in Telegram groups, I've received invites, but I'd rather add knowledge than chase signals because that may lead to getting scammed, which is bad for business.Traders who use signals to trade I don't classify them as good traders because they are not the ones doing the actual work that needs to be done in trading, and it always surprises me when I see traders depend solely on signals, thinking that it will give them the actual result they want. However, I always believe that using signals will go wrong. Sometimes the fact that the signal will not function well after you have been paid a huge amount of money will result in a loss. And learning the skills will be very important because sometimes signal may not work and they will use the knowledge they have, so, I think these people are been lazy to learn the skill in trading that is why they are using signals forgetting that it may not favour them at the end. Lastly, OP thank you for the advice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 28, 2023, 05:18:13 PM",
      "body": "Quote from: RockBell on July 25, 2023, 12:12:28 PMI will advise you to return to the books so that at least when you get signals you can decide what part to take. Na better line be this for people wey want to dey trade. At least you no go just dey wait everytime for signal and when you even get the signal you go just use am like that, you no go know left from right whether na fire you dey enter or not. At least small knowledge make sense and if you con get better knowledge plus signal that one mean say you go become pro be that. So reading books and practical make sense. Nice one I agree with you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "July 28, 2023, 10:28:17 PM",
      "body": "I usually classify these signal sellers and those that operate sports prediction groups as one because they both share the same goal and attract the same set of people. When it comes to buying signals, I don't usually buy the idea, but I do follow a few people who have signal groups where one needs to pay before they can gain access. In those groups,  the admin does not just sell out signals after he has done his analysis; he teaches his members (those paid members) how to follow up on the market, make their own predictions, read charts, and all of that. In such a case, should we consider anyone who is in such a group as someone who is going after knowledge (learning) or someone who is just going for the signal? I'm not much of a trader, but with the little knowledge I trade with, I use those ideas very well, it's better than me relaying on someone else prediction, especially when I have to pay for it when I could have used the money to buy more of which ever coin I might have been planning on investing money on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pablo-wood",
      "created_time": "July 30, 2023, 02:33:36 PM",
      "body": "Quote from: Gozie51 on July 28, 2023, 05:18:13 PMQuote from: RockBell on July 25, 2023, 12:12:28 PMI will advise you to return to the books so that at least when you get signals you can decide what part to take. Na better line be this for people wey want to dey trade. At least you no go just dey wait everytime for signal and when you even get the signal you go just use am like that, you no go know left from right whether na fire you dey enter or not. At least small knowledge make sense and if you con get better knowledge plus signal that one mean say you go become pro be that. So reading books and practical make sense. Nice one I agree with you.If a trader way still be newbie day learn and day take signal during that early stage of trading, that trader go dey gather enough experience and one day the newbie go become good to the point why em too go dry deliver signal. But when the trader decide to stick to signal alone one day the signal go cast and the trader go come day find another signal out of desperation em fit enter wrong hands wey go either take their money run or give am fake signal or some fit dey give signals why go be like gambling prediction why day on 50:50 chances. Person why wan bam for trading get read books, watch videos, day around fellow traders and avoid plenty noice wey most of the free signals dey generate",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}