{
  "id": "topic_5476237",
  "title": "ChiBitCTy",
  "author": "ChiBitCTy",
  "created_time": "December 01, 2023, 08:45:33 PM",
  "content": "Hey guys, I wanted to get a discussion going on something that is effecting our economy here in the United States in a very big way, and that's this new \"practice\" of \"flash mob' theft.  Here in the US we are having a serious issue where in person stores such as shopping malls, clothing stores, jewelry stores etc are under siege from mainly teenagers/young adults who gather in large groups, wear unidentifiable clothing, often masks, and run in to stores overwhelming workers, stealing items and running out.  This had gotten REALLY bad here in the US over the past I'd say 3-4 years.  It's only getting worse.  It's forcing stores to close at rapids rates, as well as re-arrange how items are displayed, often locking them up behind glass cases, and forcing a store employee to open the case to grab the item..this is for even stuff worth no more than $5.  Is this happening where you live, in your country?  How much of an effect on the economy do you think it's having?  Is the effect mitigated by online shopping, where business isn't being completely lost, just not done in person.  I have to assume people losing their jobs at physical stores could be taking a tole on the economy as well and will continue to.  Thoughts?Here's an example - https://www.youtube.com/watch?v=iY_q0IfIJHY",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476237",
  "comments": [
    {
      "author": "hatshepsut93",
      "created_time": "December 01, 2023, 11:57:16 PM",
      "body": "Quote from: ChiBitCTy on December 01, 2023, 08:45:33 PMmainly teenagers/young adults who gather in large groups, wear unidentifiable clothing, often masks, and run in to stores overwhelming workers, stealing items and running out.  Committing crime in a group is usually an aggravating circumstance, and it also makes easier to prosecute the criminals, because if you catch one, you can make them give up their partners. The businesses that suffer from these crimes could lobby the politicians to make police go harder on these crimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 02, 2023, 02:00:37 AM",
      "body": "I haven't been to the US, but it seems majority of the stores there don't have security guards. In others, the only person inside is the cashier. Perhaps it's about time for businesses to assume that things are different now. Here in my country, what usually happens are theft, not robbery. It probably helps that most stores have security guards, armed guards mostly, and there's also a handful of staff.I don't think this has a serious economic threat especially in the national level. Before it reaches that stage, I assume the local police has already stepped up in their visibility and whatnot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 02, 2023, 10:17:20 AM",
      "body": "The first time I visited the United States, I was shocked by the high level of crime. Here you can leave the car with the engine running, go to a café, and come back again without fearing for your property, but since all the streets have surveillance cameras and the government is strict with anyone who steals, the situation is better, but does this apply to all neighborhoods? Or the neighborhoods with a high crime rate? Is it possible to gather all the shops in one street so that the police’s reaction will be faster?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ZAINmalik75",
      "created_time": "December 02, 2023, 04:55:05 PM",
      "body": "Quote from: ChiBitCTy on December 01, 2023, 08:45:33 PMIs this happening where you live, in your country?  How much of an effect on the economy do you think it's having?  Is the effect mitigated by online shopping, where business isn't being completely lost, just not done in person.  I have to assume people losing their jobs at physical stores could be taking a tole on the economy as well and will continue to.  Thoughts?I saw a video on Facebook where a group of students they were young, and they were running out of a shop, at first, I did not realize what was going on and the caption that the poster had was also not clear so after reading some comments I got to know that these young ones make groups and attack on shops, well, at that time my reaction was why they don't call the police or deal with them directly by defending themselves.In our country, I have not seen anything like this happening continuously, because if young ones start to create behaviors like these, police will take quick action but I don't think the case will even reach the police because the local shopkeepers have strong connections with each other and become more strong even if there is a fight among them when cases like these occur.So, I suggest you guys should make a group with other shopkeepers and should hire a few body guards collectively or maybe individually to stop such attacks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "December 03, 2023, 03:14:31 AM",
      "body": "Quote from: Darker45 on December 02, 2023, 02:00:37 AMI haven't been to the US, but it seems majority of the stores there don't have security guards. In others, the only person inside is the cashier. Perhaps it's about time for businesses to assume that things are different now. Here in my country, what usually happens are theft, not robbery. It probably helps that most stores have security guards, armed guards mostly, and there's also a handful of staff.I don't think this has a serious economic threat especially in the national level. Before it reaches that stage, I assume the local police has already stepped up in their visibility and whatnot. You should be surprised on the impact the closure of those brick and mortar store have on certain communities. Recently, I saw a documentary film about Target stores closing down for good in New York m beigborhood, becaus of the increasing amount of theft and shoplifting going on. The impact of that community is high, because for them in order to reach the next store, they would be required to drive relatively far away from their homes, costing fuel.It also negatively impacts other stores around se same neighborhood. It must be quite frustrating for the honest people of a whole district to have to drive across the city just because some idiota scared business away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "December 03, 2023, 03:52:34 AM",
      "body": "Quote from: Hispo on December 03, 2023, 03:14:31 AMQuote from: Darker45 on December 02, 2023, 02:00:37 AMI haven't been to the US, but it seems majority of the stores there don't have security guards. In others, the only person inside is the cashier. Perhaps it's about time for businesses to assume that things are different now. Here in my country, what usually happens are theft, not robbery. It probably helps that most stores have security guards, armed guards mostly, and there's also a handful of staff.I don't think this has a serious economic threat especially in the national level. Before it reaches that stage, I assume the local police has already stepped up in their visibility and whatnot. You should be surprised on the impact the closure of those brick and mortar store have on certain communities. Recently, I saw a documentary film about Target stores closing down for good in New York m beigborhood, becaus of the increasing amount of theft and shoplifting going on. The impact of that community is high, because for them in order to reach the next store, they would be required to drive relatively far away from their homes, costing fuel.It also negatively impacts other stores around se same neighborhood. It must be quite frustrating for the honest people of a whole district to have to drive across the city just because some idiota scared business away. I wonder how this kind of problem becomes prevalent in a developed country but not in a developing country like mine. We have abundant of crimes here but I haven't heard of a group of youngsters doing some \"flash mob\" robbery. The last time I heard of people openly robbing a store here was after a super typhoon when the people are drained of supplies and help was scarce.I cannot imagine how this kind of crime grows to become a real economic threat, at least locally, when it appears easy to address. If the next store is relatively far away from the neighborhood and people are forced to buy there, I assume the neighborhood doesn't have a hundred stores for people to keep their eyes on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 03, 2023, 05:43:56 AM",
      "body": "Yeah I have seen those videos and it’s crazy how they let it happen. Basically stores are closing left and right due to this. Even today I saw someone post a video of how they wanted to buy dish soap, and it was behind closed glass and you had to buzz a worker to get them to open it for you.This is not an ideal way to run a business and all it does is increase costs due to higher cost due to more employees needed to open the glass and most likely the costs will lead to inflation.They really need to start and prosecute these people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "December 03, 2023, 05:56:20 AM",
      "body": "As far as I know, there are no strict penalties for such actions in the USA. In addition, this is mainly done by teenagers, who they also believe cannot be punished much. If there were a strict punishment for the theft of goods even worth five to ten dollars and everything was publicly reported, many would probably think about whether it is necessary to destroy and break everything or whether freedom is more valuable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "December 03, 2023, 06:14:20 AM",
      "body": "I have heard about this issue appearing on many media channels. Indeed, this is a violation of the law, and these criminals appear to be on the move, they are ready to destroy stores and rob people of valuable assets. This is really a sad thing that is happening in a country that is considered a dream of freedom, after all, perhaps the government has already intervened and caught many criminals.I'm not sure if this is similar or not, but according to my observations, countries with top economies all have this situation, which is probably partly due to conflicts within the country itself, conflicts of interest from racial communities. But in general, vandalism and theft will be punished if the person is caught, and no one will support this as a good thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "December 03, 2023, 12:07:37 PM",
      "body": "Quote from: ChiBitCTy on December 01, 2023, 08:45:33 PMHey guys, I wanted to get a discussion going on something that is effecting our economy here in the United States in a very big way, and that's this new \"practice\" of \"flash mob' theft.  Here in the US we are having a serious issue where in person stores such as shopping malls, clothing stores, jewelry stores etc are under siege from mainly teenagers/young adults who gather in large groups, wear unidentifiable clothing, often masks, and run in to stores overwhelming workers, stealing items and running out.  This had gotten REALLY bad here in the US over the past I'd say 3-4 years.  It's only getting worse.  It's forcing stores to close at rapids rates, as well as re-arrange how items are displayed, often locking them up behind glass cases, and forcing a store employee to open the case to grab the item..this is for even stuff worth no more than $5.  Is this happening where you live, in your country?  How much of an effect on the economy do you think it's having?  Is the effect mitigated by online shopping, where business isn't being completely lost, just not done in person.  I have to assume people losing their jobs at physical stores could be taking a tole on the economy as well and will continue to.  Thoughts?This is more to do with general crime and whether law enforcement are doing their job adequately, because while they are shocking acts it is usually possible to apprehend many of the people involved and they are very rare in the grand scheme of things - but they make a big splash in the headlines. Such mob mentality should be stamped out, because it undermines society and ultimately ends up hurting the poorest even further, if shops feel like they cannot operate any longer in a certain area. However it is only a very small part of the reason we are seeing store closures, a much bigger part is ultimately Amazon which is outcompeting these smaller businesses because it has such a vast scale and is able to keep expenses without having store fronts much lower.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "December 03, 2023, 01:06:18 PM",
      "body": "I think your justice system should make a few examples of these people. They think it is cool to loot stores like this and I think this must be seen as economic terrorism. People seem to think they can do things like this, without facing any harsh consequences and that perception should be changed.... this is not just theft. Also, beef up the security and also place undercover law enforcement agents within the shopping centers to clamp down on this. We cannot tolerate hooligans and criminals sabotaging the economy and the businesses of hard working people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "December 03, 2023, 02:27:28 PM",
      "body": "Quote from: ChiBitCTy on December 01, 2023, 08:45:33 PMIs this happening where you live, in your country?  How much of an effect on the economy do you think it's having?  Is the effect mitigated by online shopping, where business isn't being completely lost, just not done in person.  I have to assume people losing their jobs at physical stores could be taking a tole on the economy as well and will continue to.  Thoughts?Here's an example - https://www.youtube.com/watch?v=iY_q0IfIJHYSeven or eight years ago this was a big problem for businesses and even people in my country. In my area, some cultists will arrange themselves and rush into the streets with dangerous weapons such as guns, matchets, broken bottles, etc. They will loot any shop they enter and in some cases injure some people on the street or selling in the shop. Within a few minutes, they had stolen people's valuables on the street and looted many shops. These criminal activities have reduced in some areas but it is still prevalent in slums, ghettos and other improvised areas of my country. Many shops that were looted don't have insurance policies so they have to bear the loss. Most of them might not have the financial resources to restock the shop and it might lead to the collapse of the business. When businesses fail many people will become unemployed. It also affects the government because many investors will have to avoid such areas because of the fear of becoming victims of flash mob theft. This will reduce the amount of tax revenue the government would have derived from businesses. But I am surprised that such criminality happens in the US because I thought that the US has one of the best security systems and that mere face masks would not hinder them from identifying, arresting and punishing these criminals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "December 03, 2023, 02:39:40 PM",
      "body": "Quote from: ChiBitCTy on December 01, 2023, 08:45:33 PMHey guys, I wanted to get a discussion going on something that is effecting our economy here in the United States in a very big way, and that's this new \"practice\" of \"flash mob' theft.  Here in the US we are having a serious issue where in person stores such as shopping malls, clothing stores, jewelry stores etc are under siege from mainly teenagers/young adults who gather in large groups, wear unidentifiable clothing, often masks, and run in to stores overwhelming workers, stealing items and running out.  And despite that FedEx and ups will still leave your $1000 packet on the porch with every single passerby being able to just garb it and run with it.I will never understand how you can have crimes that close to never happen in Europe and at the same time have some habits that would never work here, not even mentioning the whole thing about fences...And at the same time people in the US are shocked by this:https://www.businessinsider.com/safeway-stores-add-receipt-scanning-security-gates-to-self-checkout-2023-7FML, I don't even remember if a superstore or hypermarket down here ever ran without having a security gate at the exit",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "December 03, 2023, 09:21:24 PM",
      "body": "Quote from: ChiBitCTy on December 01, 2023, 08:45:33 PMIs this happening where you live, in your country? as far as i know, no it doesn’t of course there are still cases of theft but doing it as a group is kind of rare one of the reasons i can think of why they do this is for fun i mean the masks and the outfits probably cost more than what they’re about to steal the people behind these theft are probably teenagers wanting so-called liberation",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Casdinyard",
      "created_time": "December 03, 2023, 10:14:15 PM",
      "body": "This is partly due to the fact that people are misinformed about the new laws passed regarding theft and robbery. I heard that a few months ago shoplifting was basically reduced from a class-felony crime to something like a misdemeanor or whatever (the americans gotta correct me on this one). Anywho, the way the media and basically everyone who's in on the situation portrays this is that they'd get off easy after committing the crime, when the reality couldn't be any farther from the truth. I saw people getting mugged and even gunned down trying to run the fade on some boutiques and mom-and-pop stores. I say the government should once again be held responsible for this. Proper campaigns must be administered to make sure that the people take your shit seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "December 04, 2023, 05:21:54 AM",
      "body": "From what I understand this started first in San Francisco, basically any theft under $950 and the cops don’t deal with it. So criminals would steal under this amount and get away with it.Then after covid and after we got protests and looting it become more common practice in more cities.People did it once, got away with it and now they are doing it everywhere. They need to start arresting these people and this will end eventually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "icalical",
      "created_time": "December 08, 2023, 10:57:55 AM",
      "body": "I saw several viral showing this Mob Theft on twitter, I even saw some business putting chain on their product. This has happened in my country back in the late 1990's, but the main reason is because the monetary crisis and everybody suffer, I don't know how the current economic condition in the US, but if the economic is not that bad and people are doing this for no emergency reason then there must be something very wrong in the grass-root society, and not government's mistake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Alpha Marine",
      "created_time": "December 09, 2023, 05:15:59 AM",
      "body": "My opinion is for the authorities to put stricter penalties in those who are caught. Teenagers fell they can do things and get away with it. They need to know that actions have consequences and you have to be ready to face the consequences when you do something. A lot of these kids don't do these things because they're hungry or really need the stuff, they do it for the thrills, for the fun of it. So parents have a role to play in things like this. I feel like a lot of parents these days don't really care, as long as they feed and clothe their children well, it's all good. That's wrong. Parents have the biggest role to play in how a child grows up. The problem is when the police try to go hard on these kids, the parents defend them with all they've got, instead of using that energy to raise the child right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "December 09, 2023, 05:39:19 AM",
      "body": "The OP doesn't explain it all, and that is that these robberies happen mostly and massively in Democratic states that are lenient on crime, critical of police and have lowered penalties for all types of crimes, including these. Take California, for example.California Democrat frustrated by rising theft admits liberal crime bill was 'big mistake'As it usually happens, they have made the problem they said they were going to solve bigger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}