{
  "id": "topic_5446393",
  "title": "Lacrim",
  "author": "Lacrim",
  "created_time": "March 26, 2023, 07:34:13 PM",
  "content": "I have a couple of questions:1. is it possible to use -walletnotify on addresses I don't own? meaning addresses I imported as watch addresses.2. I also want to know how many addresses I can watch until things start to get slow, or worst... the program start to crash? or there are no limitations as long as the server i'm running bitcoind on is powerful?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5446393",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "March 26, 2023, 11:17:47 PM",
      "body": "According to this GitHub issue below walletnotify is not possible on the watch-only wallet the result will return no details check the link for further details.- https://github.com/bitcoin/bitcoin/issues/17784About how many addresses you can watch I think it's no limit maybe the crash happens if your PC can't handle many transactions while syncing so it also depends on the PC specs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "March 27, 2023, 05:50:56 AMLast edit: March 27, 2023, 06:54:55 AM by LoyceV",
      "body": "Quote from: Lacrim on March 26, 2023, 07:34:13 PM2. I also want to know how many addresses I can watch until things start to get slow, or worst... the program start to crash?With all Private keys posted on Bitcointalk, I ended up with a 2 GB wallet. That made Bitcoin Core very slow.It's easy to test with watch-only addresses, just get a lot of them, and try it  I expect similar limitations: it doesn't really depend on the number of addresses, it depends on how many transactions they've had.What is it you're trying to accomplish?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lacrim",
      "created_time": "March 27, 2023, 08:55:55 AM",
      "body": "My goal is to monitor a few addresses but without using a third party service. How do some blockexplorers provide an API to watch addresses and notify you (Webhook) when funds are sent to or from the address if -walletnotify is not something one can use?i don't think it make sense to keep checking for the address balance 24/7 and then notify the user of the last transaction. Or does it?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "March 27, 2023, 03:17:30 PM",
      "body": "Quote from: Lacrim on March 27, 2023, 08:55:55 AMMy goal is to monitor a few addresses but without using a third party service. How do some blockexplorers provide an API to watch addresses and notify you (Webhook) when funds are sent to or from the address if -walletnotify is not something one can use?There is one tool that I know that you can use to watch addresses only if you are ok with email notifications?Have you heard of Blockonomics watcher? Check this tool below - https://help.blockonomics.co/support/solutions/articles/33000248601-wallet-watcher-faq They also have API for wallet watcher check the API here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}