{
  "id": "topic_5495111",
  "title": "Tyke",
  "author": "Tyke",
  "created_time": "May 03, 2024, 12:14:20 AM",
  "content": "There are only about 4 months until the 'The Bitcoin History Book 2008-2024' is self-published on Amazon (12th September 2024) as a hardcover, paperback and ebook.  I am fairly confident that I have ample resources and time to meet this personal deadline, but it feels like it is becoming more of a challenge as the weeks go by.  I have completed pages covering 2008-2019, nearly completed 2020, and have yet to spend sufficient time on 2021, 2022, 2023 and Jan-Jun 2024.  Original Bitcointalk thread: https://bitcointalk.org/index.php?topic=5475400.0Here is a preview showing chapters 2008 to 2016 (originally posted on 31/03/2024 for the community to read):https://drive.google.com/file/d/1M8z4M4oV4WC_aIGWkn-tO_T7Nkllj47C/view?usp=sharingI am wholeheartedly determined to complete the book on time without sacrificing quality and content.  If you can, please donate to the book:$BTC bc1qktyzg2atx5paka2x64pxdwg54u7m2yn3cu2qxy$LTC ltc1qz8jqkhy264q3mdjkjzsve7er25qdnmmvxt96lr$ETH 0x125288bAf499e26259f8E2aC6FC5fE1491aBa9c2$DOGE DRj7PWEz5zxHc5ptkTBapKjCrxQU75CB6q$XRP r9LbXGJ9HCdwvAhKWJJLihSd8612xHybv7Anyone who donates at least US$10 will have their name/alias in the book (please dm me if you do). Just over 10 already have their name listed! I look forward to support from the community who can help give me ample time to complete the 300 page A4 colour interior book.  As far as I know, nothing similar to this has been put together, and I feel it will be a great resource for newbies and OGs alike.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5495111",
  "comments": [
    {
      "author": "Catenaccio",
      "created_time": "May 03, 2024, 03:59:10 PM",
      "body": "Do you think in a next version of this book, you will add a note that Satoshidice platform changed their ownership and changed from support Bitcoin to support Bitcoin Cash?I see it is very big change from Satoshidice platform because Bitcoin Cash can not compare to Bitcoin and the platform originally was created to support Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 03, 2024, 04:10:55 PM",
      "body": "I know its a big thing to first considers the cost of running a thing from the beginning and along the way, we may have to go more longer than we already planned for from the initial, writing a book demands time, drains money and requires more of intellectual knowledge to continue the use of pen to write something down, i see this already turning a success soon because what has a beginning will surely have a finishing end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "May 04, 2024, 12:07:45 AM",
      "body": "Quote from: Dunamisx on May 03, 2024, 04:10:55 PMI know its a big thing to first considers the cost of running a thing from the beginning and along the way, we may have to go more longer than we already planned for from the initial, writing a book demands time, drains money and requires more of intellectual knowledge to continue the use of pen to write something down, i see this already turning a success soon because what has a beginning will surely have a finishing end. Thank you for your opinion. I appreciate it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "May 06, 2024, 10:09:10 PM",
      "body": "Happy to announce that 2017-2020 history chapters almost finished:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "June 06, 2024, 04:57:25 PM",
      "body": "History book chapter 2021 nearly complete:",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wonder Work",
      "created_time": "June 06, 2024, 05:30:14 PM",
      "body": "Quote from: Dunamisx on May 03, 2024, 04:10:55 PMI know its a big thing to first considers the cost of running a thing from the beginning and along the way, we may have to go more longer than we already planned for from the initial, writing a book demands time, drains money and requires more of intellectual knowledge to continue the use of pen to write something down, i see this already turning a success soon because what has a beginning will surely have a finishing end. Yeah you are right bro. When I first saw it, I was surprised to discover something so important was revealed here. This book is important because it traces the history of Bitcoin. A lot of knowledge and thought has gone into this article to present accurate information. If this continues, there will be plenty of knowledge about Bitcoin. Its journey has been good since the beginning, and it will be better in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 06, 2024, 07:48:18 PM",
      "body": "Op you have a good course (project) but why are you creating different thread for the same course (project)? This make the whole thing look like a children play. It you keep it in one thread and update the thread whenever you have finished each book or chapter, it would have been more better and respectful. You make the project look as if you doing to fine merit. I will prefer you updating the old thread with all the books on one thread. Compile all the books in one thread. Upon all the books you have written we have not read anyone.  Or did I missed out? And that is not my main concern and my concern is the threads. They should be in one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tyke",
      "created_time": "June 30, 2024, 07:59:12 PM",
      "body": "UPDATE 30/06/2024I have almost completed pages 50 to 273 (covering 2008 to 2022 BTC history) amounting to 224 pages. The 300 A4 book (paperback & hardback) will be released in September 2024!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}