{
  "id": "topic_5459410",
  "title": "1nftopia",
  "author": "1nftopia",
  "created_time": "July 11, 2023, 11:07:15 AM",
  "content": "We propose a new standard for Ordinal NFTs, which leverages Recursive Inscription to cost-effectively create fully on-chain generative art that is not controlled by anyone.Generative art refers to artworks entirely created by autonomous systems, which include three important components: code for the automatic generation of graphics, code execution for personalized rendering, and automatic verification of the correctness of the generated results. Due to Ethereum's expensive on-chain execution fees, generative art on Ethereum is not fully on-chain. Although the code is recorded on Ethereum, both the code execution and result verification process are performed by off-chain tools. However, with the development of Bitcoin's Recursive Inscription technology, Bitcoin has developed an infrastructure that can execute on-chain code at a low cost and complete real-time personalized rendering, paving the way for fully on-chain generative art that is not controlled by anyone.Github: https://github.com/1nftopia/brc721auto/tree/main",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459410",
  "comments": [
    {
      "author": "NotATether",
      "created_time": "July 11, 2023, 11:18:49 AM",
      "body": "If HTML is the format you're planning to describe Ordinal inscriptions in:Quote from: https://github.com/1nftopia/brc721auto/tree/mainCode:<!DOCTYPE html><html>  <script>    let p = { \"key\": \"value\" };   </script>  <script src=\"/content/[algorithm inscription ID]\"></script></html>Then I do NOT support this proposal. There is no reason to have all these huge XML tokens inside the blockchain. Take a look at how efficiently transactions and blocks are currently encoded into the blockchain, for inspiration.At least use something like Google's Protobuf serialization format instead of this space monster. At least that makes a serious effort to achieve maximum compression.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "July 11, 2023, 09:27:30 PM",
      "body": "By art you mean monkeys and apes? And what kind of art are we exactly talking about? Something like AI generated 3D images where you can type anything and have it rendered by powerful GPUs? I really don't see any reason to use bitcoin blockchain for anything other than transferring bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 13, 2023, 09:10:30 AM",
      "body": "Quote from: ETFbitcoin on July 12, 2023, 10:00:04 AMQuote from: NotATether on July 11, 2023, 11:18:49 AMAt least use something like Google's Protobuf serialization format instead of this space monster. At least that makes a serious effort to achieve maximum compression.But it looks this protocol use HTML Canvas and JavaScript to draw, i have doubt it's possible to convert those to Protobuf. Algorithm optimized to compress text might be better option.The protocol does not have to be converted into Protobuf. Only the part which is stored in the blockchain needs to be encoded into a protobuf message, which can be created and parsed from within Javascript using the Protobuf libraries for it. Alternatively, any other binary encoding that has a library for it will also do. Like MessagePack or Apache Thrift.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1nftopia",
      "created_time": "July 14, 2023, 05:35:35 AM",
      "body": "Quote from: NotATether on July 11, 2023, 11:18:49 AMIf HTML is the format you're planning to describe Ordinal inscriptions in:Quote from: https://github.com/1nftopia/brc721auto/tree/mainCode:<!DOCTYPE html><html>  <script>    let p = { \"key\": \"value\" };   </script>  <script src=\"/content/[algorithm inscription ID]\"></script></html>Then I do NOT support this proposal. There is no reason to have all these huge XML tokens inside the blockchain. Take a look at how efficiently transactions and blocks are currently encoded into the blockchain, for inspiration.At least use something like Google's Protobuf serialization format instead of this space monster. At least that makes a serious effort to achieve maximum compression.I totally agree with you about compressing the data to save the storage space. We'd like to serialize the data in the protocol if Ordinal Browsers support the compression algorithm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1nftopia",
      "created_time": "July 14, 2023, 06:05:13 AM",
      "body": "Quote from: ETFbitcoin on July 12, 2023, 10:00:04 AMQuote from: 1nftopia on July 11, 2023, 11:07:15 AMHowever, with the development of Bitcoin's Recursive Inscription technology, Bitcoin has developed an infrastructure that can execute on-chain code at a low cost and complete real-time personalized rendering, paving the way for fully on-chain generative art that is not controlled by anyone.This isn't accurate, Bitcoin node doesn't execute your code. In fact, those data only interpreted as arbitary data which isn't verified at all. Only software which support your protocol would actually execute it.Quote from: NotATether on July 11, 2023, 11:18:49 AMAt least use something like Google's Protobuf serialization format instead of this space monster. At least that makes a serious effort to achieve maximum compression.But it looks this protocol use HTML Canvas and JavaScript to draw, i have doubt it's possible to convert those to Protobuf. Algorithm optimized to compress text might be better option.The code is self-contained and can be executed consistently by all ordinal browsers. Even in ArtBlock, the code is not self-contained and reply on the third-party libs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1nftopia",
      "created_time": "July 14, 2023, 06:13:04 AM",
      "body": "Quote from: digaran on July 11, 2023, 09:27:30 PMBy art you mean monkeys and apes? And what kind of art are we exactly talking about? Something like AI generated 3D images where you can type anything and have it rendered by powerful GPUs? I really don't see any reason to use bitcoin blockchain for anything other than transferring bitcoins.Bitcoin possesses the most secure decentralized infrastructure. If we could use this powerful consensus mechanism to store some of humanity's most precious memories, it would be extraordinarily meaningful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CuntouErjiu",
      "created_time": "July 14, 2023, 06:13:56 AM",
      "body": "Previously, my views were aligned with many others', believing that the BTC inscription system has polluted the Bitcoin chain.However, after my research, I found that BTC's recursive inscription is a very excellent creation, it's just that no one has used it well yet.BRC721Auto is a very good solution, which may cause significant changes in generative art.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1nftopia",
      "created_time": "July 14, 2023, 06:22:37 AM",
      "body": "Quote from: CuntouErjiu on July 14, 2023, 06:13:56 AMPreviously, my views were aligned with many others', believing that the BTC inscription system has polluted the Bitcoin chain.However, after my research, I found that BTC's recursive inscription is a very excellent creation, it's just that no one has used it well yet.BRC721Auto is a very good solution, which may cause significant changes in generative art.Absolutely. I am convinced that Recursive Inscription will pave the way for extraordinary experiences and bring about innovative changes on the Bitcoin platform. BRC721Auto is just the start of something greater.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "July 14, 2023, 11:07:06 AM",
      "body": "Quote from: 1nftopia on July 14, 2023, 05:35:35 AMI totally agree with you about compressing the data to save the storage space. We'd like to serialize the data in the protocol if Ordinal Browsers support the compression algorithm.Don't wait, act. Nothing is formally standardized in BRC20 land, all formats are made by cypherpunk-looking blokes on Twitter. If you try to get everyone to agree on you to make X protocol use Y feature, you're never going to get enough replies. So the only way to enforce this is to use it in practical applications immediately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ComboWizard",
      "created_time": "July 17, 2023, 10:39:07 AM",
      "body": "Quote from: NotATether on July 14, 2023, 11:07:06 AMQuote from: 1nftopia on July 14, 2023, 05:35:35 AMI totally agree with you about compressing the data to save the storage space. We'd like to serialize the data in the protocol if Ordinal Browsers support the compression algorithm.Don't wait, act. Nothing is formally standardized in BRC20 land, all formats are made by cypherpunk-looking blokes on Twitter. If you try to get everyone to agree on you to make X protocol use Y feature, you're never going to get enough replies. So the only way to enforce this is to use it in practical applications immediately.You are definitely right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1nftopia",
      "created_time": "July 17, 2023, 10:45:07 AM",
      "body": "Quote from: NotATether on July 14, 2023, 11:07:06 AMQuote from: 1nftopia on July 14, 2023, 05:35:35 AMI totally agree with you about compressing the data to save the storage space. We'd like to serialize the data in the protocol if Ordinal Browsers support the compression algorithm.Don't wait, act. Nothing is formally standardized in BRC20 land, all formats are made by cypherpunk-looking blokes on Twitter. If you try to get everyone to agree on you to make X protocol use Y feature, you're never going to get enough replies. So the only way to enforce this is to use it in practical applications immediately.hahaha, let me integrate the compression algorithm in the protocol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "July 21, 2023, 12:19:11 AM",
      "body": "What is missing is the standardization of the code inscription. Your description implies some form of Javascript, but the standard needs to be very specific about the execution environment in order to guarantee the correctness of the generated results.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}