{
  "id": "topic_5420523",
  "title": "YellowSwap",
  "author": "YellowSwap",
  "created_time": "November 11, 2022, 12:58:45 PM",
  "content": "The majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420523",
  "comments": [
    {
      "author": "livingfree",
      "created_time": "November 11, 2022, 01:11:01 PM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective? There's no safe platform and that is because there's no safe system. All of them will have vulnerabilities and that's why they have to update from time to time for their securities to be increased.Time after time, there will be hackers that will see some outdated versions of their systems and that's why there's no safe. Even there are no hackers, there could be bugs that could be found and that's why the way forward is to think that everything you use is unsafe.And that's why you have to put it on your mind that you need to be responsible for every action you do and whatever you do with your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "posi",
      "created_time": "November 11, 2022, 01:26:36 PM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective? Are you greedy? Is the purpose of your investment in cryptocurrencies for money or what? Honestly, we all have greed, when participating in a project we want to profit from them and so do they, don't blame them or blame them. As long as we control our greed, if you are not greedy, don't want a thousand percent profit and you invest in bitcoin then you will never fall into their trap. Market is a battlefield, where there is only 1 winner and 1 loser, there is never a win-win situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hypnosis00",
      "created_time": "November 11, 2022, 02:17:44 PM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. I'd never it was of their greediness but the reason why their project fail or become useless project that was because they fail to provide the needs of the people/users. Of course, investors won't spend their money upon seeing that feature as they wanted assurance rather than risking their money for nothing. If they fail that was the result of their doings and it can't be blamed on the market competition because, in the first place, they will know what exactly is needed in the crypto community but they never do it. QuoteWhat is the way forward? What solution do you think will be effective? They should look for the need of the people and create a unique project, not copying others' platforms and making their own similar to others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 11, 2022, 02:29:54 PM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective? Proper regulation or a law specifically for decentralized approach. Guidelines that will scrutinize, penalize some of the outlaw or criminals that makes the investors suffer. Its hard to make a perfect solution for everything but with a right push I think crypto community will be better.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "November 11, 2022, 02:45:02 PM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective? Everything has risk especially on crypto even coins that aren't supposed to lose value like stable coins is now being depegged. I believe that it doesn't matter if it's a centralized or decentralized project, It's how the devs and the project team handle the project they have and how they run things inside their project. Sometimes devs are just getting pressured on is currently happening on the market and this what triggers them to abandon or lose hope in the project they are doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vanesha",
      "created_time": "November 11, 2022, 02:53:26 PM",
      "body": "Nothing is really safe here. We are all profit-seeking businessmen. All we can do is avoid losses in whatever way is best. but it is impossible if you really want to get a safe platform to invest let alone in this kind of high-risk investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "November 11, 2022, 02:54:58 PM",
      "body": "There isn't perfect solution on this matter. You can hold your coins in a private wallet, controlling your own keys, so you will be protected from those scammers. However, you don't earn interest and don't grow your portfolio this way, losing many investment opportunities for your crypto.Or you can still use centralized services, hoping the operators of the platforms you are using aren't greedy bastards like the ones we are seeing crumbling at this moment. The point is, we don't have any assurance of the honesty and legitimacy of these guys, since we don't even know them closely. Moreover, even top crypto services have failed and scammed customers, so the sucess of a company isn't enough to say that is a safe and profitable place to deposit your funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RolonNigel",
      "created_time": "November 12, 2022, 03:42:13 AM",
      "body": "Because they have tasted the sweetness, they want more.It's not that crypto developers are greedy, it's human nature to be greedy and want too much. There is no absolute safety, and investing itself is all about honing your courage to take risks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "November 12, 2022, 04:43:08 AM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective? Here are some solutions:1) Limit on the number of new projects : All crypto devs are not greedy. But the problem is that there are so many new projects and so many new developers behind these projects that some people will come out to be greedy from these always.At such some step should be taken to limit the number of new projects. Only credible people or people with good history should be allowed for this . People can also ensure this by boycotting projects that do not have a solid team.2) Strict punishment for defaulters : Even when coins have collapsed or exchanges were at fault, they were able to get away with all this without any punishments. This is not good as it removes the fear from bad people and they repeat the mistakes in future causing further loss to more people. Examples should be set in these cases with very strict punishments so that no one can think of duping people of their hard earned money with scam projects in future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BigBos",
      "created_time": "November 12, 2022, 05:21:20 AM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective? nothing is truly secure in the blockchain system on a platform, they will definitely have their own weaknesses so that hackers can take loopholes to enter the system. In addition, you should also understand that with the consent given at the beginning of your registration before agreeing to it, we cannot blame the platform if it is your negligence.the best solution is to find a platform that is responsive to unusual transaction activity and can compensate its customers if it is the fault of the platform itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "November 12, 2022, 06:00:28 AM",
      "body": "Quote from: krishnaverma on November 12, 2022, 04:43:08 AMHere are some solutions:1) Limit on the number of new projects : All crypto devs are not greedy. But the problem is that there are so many new projects and so many new developers behind these projects that some people will come out to be greedy from these always.At such some step should be taken to limit the number of new projects. Only credible people or people with good history should be allowed for this . People can also ensure this by boycotting projects that do not have a solid team.Limiting the number of new projects is like holding back the growth of the market, cryptocurrencies are a free, open market and they are in the development stage, don't hold it back. Luna and FTX before bankruptcy, the development team behind are all talented and very good people. So even celebrities cannot guarantee the safety of the project, everything is at risk. Quote from: krishnaverma on November 12, 2022, 04:43:08 AM2) Strict punishment for defaulters : Even when coins have collapsed or exchanges were at fault, they were able to get away with all this without any punishments. This is not good as it removes the fear from bad people and they repeat the mistakes in future causing further loss to more people. Examples should be set in these cases with very strict punishments so that no one can think of duping people of their hard earned money with scam projects in future. Strict punishment means you accept the government to control us, only the government has the authority to make regulations as well as the power to punish the scammers but regulation will also cost us freedom, privacy.There is no effective solution, all of this comes from greed, as long as we control greed, we will avoid these scams.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Liz Truss",
      "created_time": "November 12, 2022, 06:56:25 AM",
      "body": "We're human, and majority are very greedy just like Sam bankman, he's greediness is the reason why he's where he's now, we just have to be careful and keep looking for solutions",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "November 12, 2022, 07:27:28 AM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective? You have mentioned the main reason, it's centralization and human greed. How to prevent that? just avoid anything that centralized e.g. centralized coin, centralized exchange etc. Since most altcoins and shitcoins are only looking for money, this mean you need to avoid all altcoins and just choose Bitcoin. If you choose Bitcoin and use decentralized exchange, you've avoid centralization and human greed!Stay away against staking since it's centralized, avoid to lend your coins if you use centralized platform, and if you want to trade, don't leave your coins for long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Luffygroove",
      "created_time": "November 15, 2022, 02:52:25 AM",
      "body": "In my opinion, the developer isn't the only greedy person in the crypto world. Many first-time cryptocurrency investors, in my opinion, are misled into thinking that they can get rich quick by buying and selling digital currency without doing any research whatsoever. As a result, many developers use this to their advantage and produce a self-perpetuating loop. Changing our attitudes and working to improve the health of the crypto community are necessary first steps in breaking this cycle. The populace as a whole needs to learn self-discipline and apply logic; the newcomer, too, needs training. Individuals need to begin investing on the basis of their own ideas, while also exercising due diligence and a critical eye. Don't give in to these exploitative builders' avarice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "November 15, 2022, 03:27:49 AM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective? If a business is entered into by people who are greedy and greedy for money, expect that business to not last long.In other words, if a business is not run by wild people from those who manage it to the owner, that is the only thing that can be seen as the main reason why there are developers of that kind of personality in this industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "November 15, 2022, 05:07:39 PM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? Moving from the centralization to the fully trust code source must become a good thing but the problem if code can also be hijacked by human who created it too. Quote from: YellowSwap on November 11, 2022, 12:58:45 PMTo avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. [/quote]There must be a decentralized based platform who will be operating pretty much the same like cex. There are some platforms like GMX who have been creating decentralized trade for futures and prepetual trade. this trend gonna be a big thing for sure. I think that another feature based on decentralization already exist too in the market. Quote from: YellowSwap on November 11, 2022, 12:58:45 PMWhat is the way forward? What solution do you think will be effective? Trust in the code must become the most effective solution to avoid the greediness of people to trust fully audited code. this would be the best thing for sure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "November 15, 2022, 08:30:58 PM",
      "body": "Whilst centralized platforms exist, there will always be fraud & theft. We all know the saying, not your keys, not your coins. It’s still so true! You need to take the risk away by withdrawing your coins from these scam factories.As for a solution, there isn’t a guaranteed one other than don’t trust third parties & middlemen. You must take self custody. Proof of reserves only goes so far to mitigate scams.Self custody, I will preach it every day until people listen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "November 15, 2022, 09:46:00 PM",
      "body": "Greed is human nature. It's in every man and  can either be displayed conceitedly or consciously. Those who control their level of greed do so with a conscious effort so as not to hurt others. It's the same way the need to do good spurs godly people that the urge to do evil moves the ungodly. Most people (virtually all) are In cryptos for the Benjamins. It doesn't matter if they openly admit it or not. That's what the mindset is about. Crypto Devs have come to realize that since the nature of cryptos is often online and could be created from thin air, there aren't likely to be office addresses or contacts anyone could trace them to in case they misfire. So, invariably they think they can mess up with investors funds and get away with that. That's what fuels their greed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lalabotax",
      "created_time": "November 15, 2022, 10:46:22 PM",
      "body": "Quote from: YellowSwap on November 11, 2022, 12:58:45 PMThe majority of crypto collapse always comes from the centralisation part and of cos the human greed, what do you think is the proper solution for these? To avoid hurting crypto investors and how to guarantee that their funds is safe with any platform, either Staking, Lending or Trading. What is the way forward? What solution do you think will be effective? What's more, if not for money, many crypto projects fail even after they sell a lot of their tokens or coins. They also don't want to do anything that will sustain and grow their project while and after they've made a lot of money.Business is cutthroat. Money and power have always been the main problem. Likewise in the crypto world, we already know from various cases related to this, scams, fraud, fraudulent investments, pump and dump schemes, and so on.The solution? No need to care about them, but we must care about ourselves, how to avoid becoming their victims, how to anticipate the risks that may happen, or how to utilize every chance in every condition, even in a bad condition.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}