{
  "id": "topic_5406158",
  "title": "tryingtolearn",
  "author": "tryingtolearn",
  "created_time": "July 13, 2022, 05:21:03 PM",
  "content": "Why do people not promote Tether instead of Bitcoin?  Is it because there is no money to be made in Tether?Isn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?1:1 seems fairer than 1:20,000 ...",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406158",
  "comments": [
    {
      "author": "darkangel11",
      "created_time": "July 13, 2022, 05:40:01 PM",
      "body": "Tether has no cap. You can have a million more next month, or 2 million. They can do whatever they want to do with it since it's not 100% backed in USD, so tether case isn't as simple as you might think. Also, Tether has a company that makes it - ifinex and it's located in Hong Kong. That's at least 2 red flags for me. 1. Has a physical company and a CEO that can become a target. 2. Company is in China and we all know how Chinese government is.Third red flag is the company's transparency, or rather lack of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "July 13, 2022, 05:50:01 PM",
      "body": "Tether and Bitcoin are two different things mate, while one is an stable coin the other one has it's own blockchain.Tether is a smart contract and not a Blockchain, that's why people prefer Bitcoin against Tether. To send Tether you need to pay fees to the ETH network, and that's not decentralized at all, you see what i mean?.Tether was a tool created for the crypto markets that you can buy if you feel the markets will crash, and avoid losing money (without having to hold the money on your bank).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "July 13, 2022, 05:51:41 PM",
      "body": "Wow, Tether basically goes against all the main tenants of bitcoin and is antithetical to bitcoin.  A so called \"stablecoin\" that isn't much more than fiat in disguise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "July 13, 2022, 05:56:13 PM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMIsn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?If you were to use Tether then it's better to use your fiat. Tether has created by having the USD in mind. They say it's backed by USD 100% but it is not. It's just a smart contract and Tether company can close it anytime if they want.It seems your basic about bitcoin is not clear. Bitcoin is a blockchain, a decentralized system which no one own it. Bitcoin is not here to give you profit and lose. It's a currency. But because of the demand in market the value against fiat moves up and down. I suggest you to read bitcoin white paper: https://bitcoin.org/bitcoin.pdf",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 13, 2022, 06:18:59 PM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMWhy do people not promote Tether instead of Bitcoin?  Is it because there is no money to be made in Tether?Isn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?1:1 seems fairer than 1:20,000 ...People use Tether instead of Bitcoin because it is more like the currency they're used to spending.  They don't want to watch exchange rates or worry about making conversions to spend money.  They just want to pay and go about their day without worrying that their savings could be worth 20% what they saved when it's time to spend.  Tether will also likely be replaced by central bank digital currency in the future, not to mention the other issues that people have brought up already.  Tether is cool, but it's no Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "July 13, 2022, 07:57:22 PM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMWhy do people not promote Tether instead of Bitcoin?  Is it because there is no money to be made in Tether?Isn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?1:1 seems fairer than 1:20,000 ...Tether is a psuedo cryptocurrency without any supply cap. It is better positioned as a digital version of dollar rather than a full scale cryptocurrency. So if you are taking about cryptocurrency, Tether doesn't really fit the bill. Also when it comes to volume, Tether churns out a major volume every single day into the crypto market because of the calculative convenience it provides to the tether. So it ia heavily promoted in the market. Your statement doesn't stand at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "July 13, 2022, 08:11:13 PM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMIsn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?1:1 seems fairer than 1:20,000 ...The objective of fairness and decentralization in Bitcoin is not attached to it's equivalent value in fiat.Bitcoin is 1:1 cause 1BTC would always be equal to 1BTC regardless of global economic changes and market movements. You are also certain that whatever amount of Bitcoin you own would be a part of a fixed supply not exceeding 21 million coins as opposed to tokens that have no definite supply.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 13, 2022, 08:18:29 PM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMWhy do people not promote Tether instead of Bitcoin?  Are we promoting bitcoin? Yes, sort of but it doesn't look that we're all promoting it because you're in a bitcoin forum and majority here are holders of bitcoin.Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMIs it because there is no money to be made in Tether?Bitcoin is also earned and there's not that much difference on it until you're holding both of them. Bitcoin is volatile and Tether isn't, many also from us are using Tether to keep our profits to be safe during these unstable times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hatshepsut93",
      "created_time": "July 13, 2022, 08:38:56 PM",
      "body": "Tether is managed by a company, and that company could actually print more tokens that they have reserves, maybe it was doing it all this time. They can also freeze transactions and balances. USDT is more like online bank than a cryptocurrency. Plus the point of Bitcoin is that it's not a US dollar - that it doesn't lose its value due to inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "July 13, 2022, 08:49:16 PM",
      "body": "Quote from: hatshepsut93 on July 13, 2022, 08:38:56 PMTether is managed by a company, and that company could actually print more tokens that they have reserves, maybe it was doing it all this time. They can also freeze transactions and balances. USDT is more like online bank than a cryptocurrency. Plus the point of Bitcoin is that it's not a US dollar - that it doesn't lose its value due to inflation.Tether is only relevant for crypto users just for them to protect themselves from volatility but in overall perception and views then for sure we are sharing on the same opinion.You could totally differentiate bitcoin and a stable coin like usdt.All of us do really ive out importance about anonymity and decentralization thats why its nosurprise that bitcoin is really getting more support than on any stable coins out there.Dont get surprised on how or what we are seeing on stable coins existence and relevance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "July 13, 2022, 09:01:05 PM",
      "body": "Tether is just the same as the fiat we are used to daily , nothing to promote Tether about when we already know bitcoin is more better.  Tether is still the same as saving money in the bank, if you save some amount of money in the bank and come back for it in the next 20 years it will still remain the same thing,  so has Tether too . The benefit of tether is just help bitcoin not to lost value in bear market after having profit in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "July 13, 2022, 09:36:07 PM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMWhy do people not promote Tether instead of Bitcoin?  Is it because there is no money to be made in Tether?Isn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?1:1 seems fairer than 1:20,000 ...I'm sure you know what the reason is before you even start this thread. Bitcoin is not the same as Tether as you mean, it is two completely different cryptocurrencies and what you mean by fair doesn't seem fair to me at all. Tether is the reason why you are not decentralized for the financial system, while bitcoin will help you keep your financial privacy better and fully decentralized. You can't trust Tether completely, but you can trust as much bitcoin as you can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "July 13, 2022, 09:41:50 PM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMIs it because there is no money to be made in Tether?Isn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?Both might be cryptos but there mood of operation is very much distinct. Before bitcoin ever became an asset, it was first of all a currency and that's why we had early adopters spending what is today a whole lot for a few bottle of beer and pizza. In recent time, it has become a currency of value and as such, a lot of persons prefer it to anybother currency coupled with the fact that, its the only truly decentralized currency there is with satoshi completely out of the picture and it has blockchain technology and miners to secure it.Tether is just a stable coin that could aid in value preservation in times like this and its been used by some as such and also buying of coins. Even at that, people aren't so sure of it as, its supposed to have a fiat equivalent in $ for every piece put there but this is unlikely the case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pokapoka124",
      "created_time": "July 13, 2022, 09:56:03 PM",
      "body": "Quote from: Rockstarguy on July 13, 2022, 09:01:05 PMTether is just the same as the fiat we are used to daily , nothing to promote Tether about when we already know bitcoin is more better.  Tether is still the same as saving money in the bank, if you save some amount of money in the bank and come back for it in the next 20 years it will still remain the same thing,  so has Tether too . The benefit of tether is just help bitcoin not to lost value in bear market after having profit in bitcoin. Tether isn't the same as fiat though they are both centralized, and yes Tether is a stable coin pegged to US dollar, nevertheless it's still a cryptocurrency. I wouldn't advice hodling Tether for 20 years, Tether backing is controversial making them unreliable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jody.Drummer",
      "created_time": "July 13, 2022, 11:07:08 PM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMWhy do people not promote Tether instead of Bitcoin?  Is it because there is no money to be made in Tether?I will ask back, if for example we use Tether then where can we get big profits when facing a bull market? what is your concept of running Tether as investment advice instead of Bitcoin?How is it different from the paper money you hold if you don't invest it? will it have incremental value periodically?Before going any further, try asking yourself about such things. I'm sure you will think that it turns out that Tether and fiat both have the same advantage, namely inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rockstarguy",
      "created_time": "July 13, 2022, 11:23:26 PMLast edit: July 14, 2022, 07:12:41 AM by Rockstarguy",
      "body": "Quote from: Pokapoka124 on July 13, 2022, 09:56:03 PMTether isn't the same as fiat though they are both centralized, Tether is the same thing as fiat (US dollar)when it comes to value.Quoteand yes Tether is a stable coin pegged to US dollar, nevertheless it's still a cryptocurrency. I never said tether is not a cryptocurrency, what am trying to say is that they share same nature of valuesQuoteI wouldn't advice hodling Tether for 20 years, Tether backing is controversial making them unreliable. Nobody would,  I'm only giving an instant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "July 13, 2022, 11:31:01 PM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMWhy do people not promote Tether instead of Bitcoin?  Is it because there is no money to be made in Tether?Isn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?1:1 seems fairer than 1:20,000 ...Both have different purpose, of course, it's pretty obvious, tether is stable coins so you can't make money out of it because it is pegged 1:1 to USD, you can't even call your money investment on them.But there are traders who uses Tether just to stop the bleeding on their money, i.e if bitcoin price is going down hard, maybe some of them will hedge to Tether, at least it is said as your bitcoin will have a 'steady valuation' despite the market crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "July 13, 2022, 11:35:38 PM",
      "body": "Quote from: BitcoinGirl.Club on July 13, 2022, 05:56:13 PMQuote from: tryingtolearn on July 13, 2022, 05:21:03 PMIsn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?If you were to use Tether then it's better to use your fiat. Tether has created by having the USD in mind. They say it's backed by USD 100% but it is not. It's just a smart contract and Tether company can close it anytime if they want.I agree, Tether had been fined because of their lies about USDT being fully backed by USD.  Besides Tether is centralized unlike Bitcoin, meaning the developer can tweak anything according to what they wanted.  besides, they(Tether) can blacklist any address anytime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adzino",
      "created_time": "July 14, 2022, 12:01:27 AM",
      "body": "Quote from: tryingtolearn on July 13, 2022, 05:21:03 PMWhy do people not promote Tether instead of Bitcoin?  Is it because there is no money to be made in Tether?Isn't the whole idea of Bitcoin to have a decentralized network that is useful and fair?  Isn't that Tether?1:1 seems fairer than 1:20,000 ...It is not the same at all? It is not as decentralized as you think. Tether is owned by a centralized company. I guess you didn't know that they can even freeze your wallets, reverse the transaction and remove your funds anytime they want (like banks can freeze your funds and bank account)? Google \"tether freeze funds\" and you will know what I am talking about. You might also think that it is 100% backed by US dollars, but it isn't. So stop comparing and saying that tether is better than bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}