{
  "id": "topic_5418267",
  "title": "Synchronice",
  "author": "Synchronice",
  "created_time": "October 25, 2022, 10:25:56 AM",
  "content": "I'm hearing from some people here and there that today there is a cooking oil deficit in Germany, food prices have skyrocketed and German's aren't able to buy food, there is cold everywhere and and so on and so forth.I was in Ireland, now back to the Germany for a while. To clarify, I usually visit three shop: Kaufland, Edeka (Center) and Lidl/Aldi, so I'll update you from them. From these three Lidl/Aldi is discounter, Edeka is on expensive side and Kaufland is in the middle.P.S. Click on the images to view better!Let's start with the oil prices in Germany, in the state of Bavaria in Aldi. Date - October 25, 2022:  Oil prices in Edeka Center, in Germany, in the state of Bavaria. Date - October 25, 2022:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418267",
  "comments": [
    {
      "author": "paxmao",
      "created_time": "October 25, 2022, 10:34:09 AM",
      "body": "Oh, those claims are true in any manner please let me know. I know of a few EU countries that will send it over gladly. In the places I have been everything is well supplied and you can pretty much buy anything that you could before the war, albeit a bit more expensive - nothing that would make people not buy.I guess the RF must be doing great as well, you see, people are queuing in the borders surely to do some tourism in Georgia and Turkey.https://expatguideturkey.com/mobilization-queue-of-3000-vehicles-on-the-russia-georgia-border/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coupable",
      "created_time": "October 25, 2022, 12:43:08 PM",
      "body": "The German market is considered the most affected by the Ukrainian war, perhaps more than Ukraine itself, due to its dependence on Russia in the field of energy. This field is able to influence all areas of life, including the food industries or even the state's strategies for imports of goods.In my opinion, the crisis is global and is not limited to Germany or the Western world as a whole.The United States itself is witnessing a crisis in supplying its markets with basic commodities, affected by the global situation.The world has become a small village, and a crisis cannot occur in a region without affecting the rest of the regions in one way or another.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Doan9269",
      "created_time": "October 25, 2022, 01:18:33 PM",
      "body": "Should we just pretend by closing our eyes that the only affected region is Germany, the whole world is in ransom presently and the inflation has been getting more overcoming edge than expected in tackling it, the value of commodities in the market remains the same but their prices have over jumped up to a certain limit beyond correction, making available an alternatives on the demands on this items is a good option and this can be achieved through diversification, reduced import level and encourage every homemade finished products.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 25, 2022, 01:52:09 PM",
      "body": "Quote from: Synchronice on October 25, 2022, 10:25:56 AMI'm hearing from some people here and there that today there is a cooking oil deficit in Germany, You may have forgotten to look at the date on those posts because the cooking oil scarcity was a serious thing that lasted a while but that was a couple of months ago. Basically ever since countries which produced the gains used for cooking oil production resumed their exports the scarcity problem was greatly averted.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "October 25, 2022, 04:21:41 PM",
      "body": "I know from my experience that midrange supermarkets have had a better chance of keeping their costs low because they have fewer expenses and aren't still trying to expand (like the cheaper stores are).I don't know for how long more this will be but I imagine it'll change as the cheaper chains grow further and still take over the market (unless the larger, more expensive stores rebrand - but I don't think they need to).They seem well stocked with oil and as the above post said, exports were halted and have returned since (after a few deals with struck) - I think it was the same for grain too and with similar prosperity after the \"deals\" that were made or alternative imports routes were found.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "October 25, 2022, 06:51:45 PM",
      "body": "Considering Germany is a first world country where people are supposed to have better wages and access to higher quality products the prices are similar to the ones I find in my third world country where quality of goods is much inferior. Here a bottle of oil 900ml (not olive oil) is about 3$. Olive oil 500ml must be around 3$ as well. And these are the cheapest options at the cheapest supermarkets disponible. If you want your food more tasty and delicious you have to purchase higher quality oils, of course. News claim expensive prices are due to war, but I guess it's due to greed from producers who want to take advantage of the world's scenario to make extra profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "October 25, 2022, 08:43:39 PM",
      "body": "Quote from: Doan9269 on October 25, 2022, 01:18:33 PMShould we just pretend by closing our eyes that the only affected region is Germany, the whole world is in ransom presently and the inflation has been getting more overcoming edge than expected in tackling it, the value of commodities in the market remains the same but their prices have over jumped up to a certain limit beyond correction, making available an alternatives on the demands on this items is a good option and this can be achieved through diversification, reduced import level and encourage every homemade finished products. Spot on. In fact the EU including Germany are affected, but have plenty of resources and political influence to short the issue. The problem comes when India and Germany are bidding for the same gas tanker (sorry India) or Somalia (on the verge of a massive famine) and Italy are bidding for the same cargo of grain. That is the real consequence of Adolf Putin's war - the poor perish without a cause.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 25, 2022, 09:03:01 PM",
      "body": "Quote from: Synchronice on October 25, 2022, 10:25:56 AMI'm hearing from some people here and there that today there is a cooking oil deficit in Germany...I guess the questions are what WERE the prices vs what are the prices and what is availability REALLY like.Obviously there is a lot of oil on those shelves BUT was there 2x of it last week was the €2 bottle €1 last week?Here in the US you can see people running around screaming 'inflation is killing everything' but I can say because I am a REALLY boring person I am just not seeing it.I get more or less the same grocery items from the same stores time after time after time and can say it's up a little, but at worst 5%. My pack of totally unhealthy chocolate chip muffins went from $5.49 to $5.79 the milk I dunk them in went from $4.89 to $5.09. BUT bananas went from $0.29 each to $0.25 each at one place and $0.49 / lb to $0.45 a lb at another. The bottle of salad dressing has not changed price. The cases of seltzer are still 3 for $12.The frozen box lunches I keep in the freezer at work have actually gone both ways. I have 2 brands that I buy regularly they both used to be the same price $4.49. One went from $4.49 to $3.99 the other went from $4.49 to $4.99 so guess which one I am buying.I guess it could be what I buy or where I shop but I really don't know. I am not seeing it to the extent that people are talking about.Also, you have to figure 'not much is going on' makes for a really boring news show.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ChiBitCTy",
      "created_time": "October 25, 2022, 11:19:27 PM",
      "body": "Where do you see price hikes most overall?  I think right now here in the United States inflation sits somewhere around 8-9%, but there are certain food items that are up sky high, anywhere from 10-60%.  Seafood and steak I know are two different food types that have skyrocketed.  My ice cream has gone up a good bit as well as the plant based meats that I eat, those have all gone up a good bit.  This sucks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "October 25, 2022, 11:56:28 PM",
      "body": "Quote from: Synchronice on October 25, 2022, 10:25:56 AMI'm hearing from some people here and there that today there is a cooking oil deficit in Germany, food prices have skyrocketed and German's aren't able to buy food, there is cold everywhere and and so on and so forth.I was in Ireland, now back to the Germany for a while. To clarify, I usually visit three shop: Kaufland, Edeka (Center) and Lidl/Aldi, so I'll update you from them. From these three Lidl/Aldi is discounter, Edeka is on expensive side and Kaufland is in the middle.Other countries affected by the war between Russia and Ukraine were Germany and the Netherlands,in the netherlands tootwo-thirds of the cooking oil in the Netherlands comes from Ukraine and Russia.So it's not surprising that their country was also affected, maybe the Netherlands and Germany had to look for oil supplies from other countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "October 26, 2022, 05:00:34 AM",
      "body": "Quote from: DaveF on October 25, 2022, 09:03:01 PMI guess the questions are what WERE the prices vs what are the prices and what is availability REALLY like.Obviously there is a lot of oil on those shelves BUT was there 2x of it last week was the €2 bottle €1 last week?The market is not that volatile to compare the price with last week. You should compare it over the long term like with the prices last year. Just like bitcoin price, in short term it looks like it is dumping or mooning but when you \"zoom out\" and ignore the bubbles you'd see a nice uptrend.QuoteHere in the US you can see people running around screaming 'inflation is killing everything' but I can say because I am a REALLY boring person I am just not seeing it.I guess it could be what I buy or where I shop but I really don't know. I am not seeing it to the extent that people are talking about.AFAIK food prices have always been lower in US, generally speaking. But again you should check it in long term (compared to last year for example). But also when speaking of inflation it is not only groceries, it is rent, utility bills or even gas/petrol you pump into your car. How are their prices compared to last year?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kro55",
      "created_time": "October 26, 2022, 05:51:52 AM",
      "body": "Quote from: uneng on October 25, 2022, 06:51:45 PMConsidering Germany is a first world country where people are supposed to have better wages and access to higher quality products the prices are similar to the ones I find in my third world country where quality of goods is much inferior. Here a bottle of oil 900ml (not olive oil) is about 3$. Olive oil 500ml must be around 3$ as well. And these are the cheapest options at the cheapest supermarkets disponible. If you want your food more tasty and delicious you have to purchase higher quality oils, of course. News claim expensive prices are due to war, but I guess it's due to greed from producers who want to take advantage of the world's scenario to make extra profit.Germany, the European countries are affected and they are paying more for everything when the war comes but I think that is still nothing compared to the 3rd world countries you and I live in. An 8-hour workday is almost impossible to feed a family with three meals and this has been the case for many years, many places are struggling with food shortages. You can also buy cooking oil, that's happiness, in the countryside where I live now many families have to use lard to replace cooking oil. There's much worse that we don't know because we've never heard of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "October 26, 2022, 07:16:55 AM",
      "body": "I am wondering on what basis they are changing the pack prices on periodic basis? Like how do the stores know it’s time to upgrade the label this week? The question is why are we just seeing the price upgrades in the Germany only? Every now and then I can see it’s only Germany everyone talking about. Why other EU regions are not in the mentions. Does the Germany has Special relationship with the on going war or something?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "marvinsino",
      "created_time": "October 26, 2022, 07:39:41 AM",
      "body": "Send more first-hand information, it is very valuable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "October 26, 2022, 07:58:50 AM",
      "body": "Petrol and Diesel prices in Germany as of yesterday:Is there any product in the German supermarkets you want to know the price of? Or any other thing? Because some people here think that Germany is fucked and there is no way to escape and we are all gonna freeze to death, so the situation isn't like that and quality of life here is still high",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "be.open",
      "created_time": "October 26, 2022, 08:20:55 AM",
      "body": "Quote from: Synchronice on October 26, 2022, 07:58:50 AMIs there any product in the German supermarkets you want to know the price of? Or any other thing? Because some people here think that Germany is fucked and there is no way to escape and we are all gonna freeze to death, so the situation isn't like that and quality of life here is still high Germany recently set aside 200 billion euros to offset rising end-user prices (infuriating the poorer EU member states). The producer price index is 45%, and food inflation is 10% - this difference is compensated by the German government at the expense of the budget. Therefore, looking at supermarket shelves, you (yet) do not see an explosive rise in prices, but this does not mean that the problem does not exist. The essence of the problem is that until recently Germany was the leader and locomotive of the European Union, a donor country for poorer countries such as Greece and the Baltics, and now it is more concerned with stabilizing its own problems and can no longer support its poor neighbors in the usual amount. Germany is a very rich country and it has a supply of fat to compensate for rising energy prices, fucked not Germany, but the European Union.ps Is there anyone here from the Baltics or Greece? Tell me if everything is fine with the prices in supermarkets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "October 26, 2022, 08:56:50 AM",
      "body": "Can you tell us where you are getting your Cooking Oil from and how much of this are coming from your own produce? The countries that are struggling ..are the ones that are mostly importing Oil from the Ukraine and now with the war, Ukraine cannot produce enough to export to other countries... or their crops was destroyed by the Russians. Also, how much of the oil that are on the shelves, where stock that was stockpiled in warehouses, before the shortages started? A lot of the old stock are now sold at inflated prices... even if it was bought at a much lower price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "October 26, 2022, 10:49:46 AM",
      "body": "Quote from: Doan9269 on October 25, 2022, 01:18:33 PMShould we just pretend by closing our eyes that the only affected region is Germany...The country that is mentioned the most in this board in this context (with the addition of the US), as if only they have problems with rising prices, and the rest of the EU lives the same as before. I personally do not care what the prices of oil or anything else are in Germany, France or Spain because I buy these things in my country and what I know is the fact that the price of cooking oil has risen by 80% and even more than 100%.Perhaps the Europeans should ask former Chancellor Merkel and her team why they persisted with Russian energy sources even after 2014, and now the whole EU is paying the price while they throw away hundreds of billions of EUR to save their economy.Quote from: https://www.euronews.com/my-europe/2022/10/04/germany-faces-scrutiny-from-eu-peers-over-massive-200-billion-aid-scheme-to-cushion-high-gGermany, the EU's industrial powerhouse, is facing scrutiny over a €200 billion financial scheme to help citizens and businesses cushion the pain from soaring gas bills. Although officials have expressed sympathy towards Germany, a country that was highly dependent on Russian gas and is now scrambling to find alternative suppliers, there are growing concerns the multi-billion euro plan might trigger a negative spill-over effect beyond borders and distort competition in the single market. The German initiative has also highlighted the divide between wealthy EU countries that can accommodate new borrowing and cash-strapped governments that are desperately looking for new funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 26, 2022, 12:06:17 PM",
      "body": "Quote from: Synchronice on October 26, 2022, 07:58:50 AMIs there any product in the German supermarkets you want to know the price of? Or any other thing? Because some people here think that Germany is fucked and there is no way to escape and we are all gonna freeze to death, so the situation isn't like that and quality of life here is still high Which reminds me, how much is a kilowatt/hour of electricity in Germany? And the average utility bill (not particularly yours) if you don't mind sharing. And if heat is billed separately then that too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}