{
  "id": "topic_5476488",
  "title": "GxSTxV",
  "author": "GxSTxV",
  "created_time": "December 04, 2023, 11:21:42 AMLast edit: December 06, 2023, 11:02:43 PM by GxSTxV",
  "content": "Yesterday, due to a dumb regrettable decision, I caused for myself a loss of $100. I was seeking a credit card urgently to pay my university fees in time, specifically their payment system is only compatible with credit cards. So for me being a crypto user, my assets are mainly in crypto. My only known option was the Binance marketplace [1].The first service on the marketplace is the All-in-one Card [2], Which offering a credit card loadable with Binance USDT through instant deposits. The issue appeared after depositing $100 and attempting to obtain the card, I discovered late that their service was temporarily disabled. Plus their live chat support is not availableFollowing this situation, I tried to withdrew the funds back to my Binance account [3]. It has been approximately 24 hours without any updates, So I really believe that my money may be lost and I have been scammed by a service that Binance are allowing and promoting.   Stay away from these services! [1]             [2][3]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476488",
  "comments": [
    {
      "author": "PX-Z",
      "created_time": "December 04, 2023, 02:20:47 PM",
      "body": "How often have you checked to chat them on their live support/chat? Did you post about this on reddit or/and X (twitter)? I don't want to call them scammer yet besides of your experience since they made their name to the top and $100 is not that huge for them to destroy/taint their reputation. I guess you just need to be patient and should contact them for this to solve.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "December 04, 2023, 04:34:43 PM",
      "body": "Quote from: PX-Z on December 04, 2023, 02:20:47 PMHow often have you checked to chat them on their live support/chat? Did you post about this on reddit or/and X (twitter)? I don't want to call them scammer yet besides of your experience since they made their name to the top and $100 is not that huge for them to destroy/taint their reputation. I guess you just need to be patient and should contact them for this to solve.The only way I could contact them is via Email. I used many usual services and when it comes to withdraw my deposits back to Binance, USDT or Bitcoin it only took few seconds to proceed. Now it's been 24 hours and it's Monday which isn't a weekend day to say the workers are off service.What hurts is that Binance is allowing and promoting such services, I had a chat on their Binance official Telegram channel and they blamed me for trusting this service which themselves are announced inside marketplace.What I can do now is waiting, true! 100$ isn't a huge amount to destroy their reputation and get kicked off Binance marketplace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "December 04, 2023, 10:45:19 PM",
      "body": "I genuinely hope they respond to you as soon as possible via email and refund the funds you deposited. Unfortunately, I couldn't find their links on social media and even contacting them through the form on their official website doesn't work. As you mentioned, live support has only been active for the past 5 days, and I couldn't find any previous feedback or reviews about these Global Finance cards, as if the service is neglected without any customers. If the service has indeed been disabled, why hasn't Binance removed it from their platform yet? I hope you provide an update regarding this issue within 48 hours. What I truly see is that these third-party services are not trustworthy. Thank you for alerting the community about what happened to you so they can research before using any of these services. Just because a service is on Binance doesn't mean it's legitimate. All Binance seems to do is disclaim responsibility without considering the impact on their customers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "December 04, 2023, 11:51:45 PM",
      "body": "How do this third party services get listed on Binance marketplace? Do they take time to vet the services before listing them, or anyone just goes on to list their service there?I have so far see 2 different card services in the marketplace. The cryptocard game is another really very slippery slope where one can easily end off getting scammed.And when testing such services for the first time, one should deposit smaller amounts like 10–20 bucks",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "December 05, 2023, 08:08:19 AM",
      "body": "It is not a scam and any negative amount in the database means that it is a debt to the platform and they need more time to return the money to you. Therefore, the Binance platform owes you $99, and you must contact the support team to find out how to recover the money. Often the data returns automatically after a day, week or month, but waiting for the support team’s response will be best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BabyBandit",
      "created_time": "December 05, 2023, 09:32:22 AM",
      "body": "Hey OP. I think this situation will be solved. You need to have some more patience my friend. I would be very surprised if Binance wanted to risk their reputation over 100 bucks.. It could be a bug that you could made the order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 05, 2023, 10:23:02 AM",
      "body": "Does this card have a terms of service, or is this something that is written in one of Binance's (mega-long) own terms of services?You should contact Binance and tell them about this event (if you haven't already), and then tell them to immediately disable this service because I have a feeling that they are not going to do anything about it unless someone shouts at them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "December 05, 2023, 12:38:13 PM",
      "body": "Quote from: GxSTxV on December 04, 2023, 11:21:42 AMYesterday, due to a dumb regrettable decision, I caused for myself a loss of $100. I was seeking a credit card urgently to pay my university fees in time, specifically their payment system is only compatible with credit cards. So for me being a crypto user, my assets are mainly in crypto. My only known option was the Binance marketplace [1].The first service on the marketplace is the All-in-one Card [2], Which offering a credit card loadable with Binance USDT through instant deposits. The issue appeared after depositing $100 and attempting to obtain the card, I discovered late that their service was temporarily disabled. Plus their live chat support is not availableFollowing this situation, I tried to withdrew the funds back to my Binance account [3]. It has been approximately 24 hours without any updates, So I really believe that my money may be lost and I have been scammed by a service that Binance are allowing and promoting.Sorry about this experience and thanks for bringing it to our attention, after all, we will be careful of the card service next time.But you have your fault as well, money is not what we just gamble with, you must have known the service very well and made the necessary findings possible before committing your money to them. Like me, even if I am conversant with any company when it comes to money issues after a long while, I will read their main T&C, know their activeness, what people are currently saying about them if they've changed or not. We should never do anything monetary in a rush.But still do not give up all hope. You may also want to seek advice from a Binance representative as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "December 05, 2023, 01:25:30 PM",
      "body": "You know that one thing about this cryptocurrency of a thing deals with trust, now using Binance is all about you trusting them for their own service they render, but when you're not keeping to attention sometimes can cost you, just like using the exchange Binance for a p2p transaction, if you're not sure that youve already been credited and to have confirmed that from your account balance, you should not hit the accept confirmation button, the buyers may also chat you, but this time, you don't have to trust them unless you have your evidence to claim their request, this is mostly of your own fault because you trusted even when you need to follow the normal procedure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "December 05, 2023, 03:18:20 PM",
      "body": "Quote from: GxSTxV on December 04, 2023, 04:34:43 PMWhat hurts is that Binance is allowing and promoting such services, I had a chat on their Binance official Telegram channel and they blamed me for trusting this service which themselves are announced inside marketplace.What I can do now is waiting, true! 100$ isn't a huge amount to destroy their reputation and get kicked off Binance marketplace.Can you post a screenshot of that chat, this is not good anything that is on their marketplace or their platform partake their reputation and users expect that they do screening of this third party services, does this mean that Binance users are risking themselves on the third party service that are on their marketplace.Its good that you opened this thread so people will be aware on not to to easily trust third party on Binance marketplace ,there's also a possibility that this is happening or have happened to other users .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "December 06, 2023, 06:42:02 AM",
      "body": "I had to see what was going on so I went to install binance on my spare phone and uhhh... things ain't lookin' good.From what I understand, binance is only some sort of aggregator and since you've already used this particular service, I'm assuming you have already agreed to its TOS.Another thing I noticed was the service in question was marked as \"new\" -- not saying everything new is a scam but highlighting that newer services tends to be more risky compared to established ones.Whatever the case, try to get in touch with binance through their live support. They need to know what happened to you and perhaps eventually remove the service. You could post in r/binance as well for extra exposure.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tech30338",
      "created_time": "December 06, 2023, 07:34:45 AM",
      "body": "I think this is just a bug in the system or something, I have a friend who deposited his funds on the wrong network, and after months they have returned the funds like 4k USDT I think, just a reminder just make sure you have a clear screenshot of those transactions as evidence, that is very important for documentation purpose, if they will ask for those you have proof.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "December 06, 2023, 08:59:33 AM",
      "body": "Quote from: Bitcoin_Arena on December 04, 2023, 11:51:45 PMHow do this third party services get listed on Binance marketplace? Do they take time to vet the services before listing them, or anyone just goes on to list their service there?I have so far see 2 different card services in the marketplace. The cryptocard game is another really very slippery slope where one can easily end off getting scammed.I doubt it though, it's like their P2P services as well, there are a lot scammers and they allow it in their platform until the last minutes. I almost fall for that trick as well, the good thing is that I didn't released the coins first, otherwise I will be the next victim.Quote from: Bitcoin_Arena on December 04, 2023, 11:51:45 PMAnd when testing such services for the first time, one should deposit smaller amounts like 10–20 bucksI guess he said that he was in a hurry, I think in my case it was the same. I needed the money right away and I wanted to exchange by Bitcoin to local fiat that's why I did choose a scammer as his offer is too good to be true (another lessons).OP, just reach to Binance support and see what they can do, not sure though if you will get back your $100. At least that 3rd party services will be block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "December 06, 2023, 07:38:50 PM",
      "body": "I finally received my 100$ withdrawalAfter several attempts trying to contact this All-in-one service support, I couldn’t reach out to the Live Support of that service which was unresponsive and off for days [1]. And with the help of @albon I sent them and email since their ticket service on their website [2] was also broken , I eventually contacted Binance support on live chat. Following my conversation with Binance Live Support the next day the withdrawal was successfully credited back to my account. However I really don't recommend using these services even they refunded my money and that’s due to various reasons, beside my personal experience and the lack of verification from Binance in case of scams. Binance's live chat support in my opinion lacks professionalism, because  I encountered late and difficulty communicating with them as you can see in the screenshots.[1]: [2]: https://glob.finance//",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "December 06, 2023, 08:59:19 PM",
      "body": "Quote from: GxSTxV on December 06, 2023, 07:38:50 PM I finally received my 100$ withdrawalHowever I really don't recommend using these services even they refunded my money and that’s due to various reasons, beside my personal experience and the lack of verification from Binance in case of scams. Binance's live chat support in my opinion lacks professionalism, because  I encountered late and difficulty communicating with them as you can see in the screenshots.I'm glad to hear that, my friend, you've successfully withdrawn your funds from them, and fortunately, they didn't engage in fraud, maintaining their reputation to stay in the Binance marketplace, and the issue has now been solved.  Indeed, I reviewed the screenshots and the conversation between you and one of Binance's customer service representatives. It seems that this customer service representative lacks the necessary experience and knowledge. Clearly, he hadn't heard about the All-in-one service before. It's truly ridiculous. @GxSTxV You learned something in all of this, and that's good. You can lock your topic now",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}