{
  "id": "topic_5493524",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "April 20, 2024, 12:14:50 AM",
  "content": "Congratulations Everyone!  Date: 4/20Block Height: 840000Rewards: 3.125 BTC per Block",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5493524",
  "comments": [
    {
      "author": "Hatchy",
      "created_time": "April 20, 2024, 12:16:09 AM",
      "body": "Quote from: ImThour on April 20, 2024, 12:14:50 AMCongratulations Everyone!  Date: 4/20Block Height: 840000Rewards: 3.125 BTC per BlockHappy halving Bitcoiners. Don't forget to HODL",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cr1776",
      "created_time": "April 20, 2024, 12:17:24 AM",
      "body": "Always good to see it happen again!  How time flies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "April 20, 2024, 12:23:32 AM",
      "body": "It has happened again just as before, but the reward is halve of the previous one, just as expected, bitcoin halving which has been longed tailed about has finally happened, we should be getting ready or a shift any moment from now in either ways for the market to rise or dump, but the bull will always prevail at all circumstances because this is not the season for bear market, we are expecting more of seeing bitcoin close to $100,000 anytime soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "April 20, 2024, 12:25:19 AM",
      "body": "In June of 2022, I made a post to see which website will be the closest to the actual Halving Date.Binance's Halving Countdown was the closest with a difference of 10 days.Quote from: ImThour on June 21, 2022, 03:22:26 AM1. BuyBitcoinWorldwide - 2 April, 20242. Binance Academy - 30 April, 20243. Gate.io - 3 May, 20244. CoinGecko - 4 May, 20245. BitcoinBlockHalf - 4 May, 20246. Nicehash  - 31 May, 20247. CoinmarketCap - 1 June, 20248. CoinWarz - 3 June, 2024",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "okae",
      "created_time": "April 20, 2024, 12:28:15 AM",
      "body": "Happy halving!!! this is an historic moment and we live it GZ to everyone who HODL!!! Thank you SN and everyone who made this possible, remember guys, this is just the beginning...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "April 20, 2024, 12:32:26 AM",
      "body": "Yeah...!!! Happy 4th Bitcoin Halving",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "theymos",
      "created_time": "April 20, 2024, 01:34:57 AM",
      "body": "Happy halving! Once again, Satoshi's hand reaches out from the past and chops another bit off of the subsidy.IIRC, in last halvings there was lull in the price for some time after the halving before the effect of the reduced supply really started to be felt. I wonder if that'll happen this time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "April 20, 2024, 02:08:31 AM",
      "body": "Happy Bitcoin's 4th halving!I am happy that I have witnessed 3 Bitcoin halvings so far. Time flies so fast.Some information for Bitcoin price, last 3 halvings. I plot the bar chart with the fourth halving price too. If people see this chart, zoom out, they will see nothing bearish with Bitcoin over many years.One more thing to say, halving is a beginning, not the end.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "B3dr0ck",
      "created_time": "April 20, 2024, 02:11:45 AM",
      "body": "Can someone tell me WTF is going on with TX fees since the having block, 840,000Typical blocks are .4 - 2BTCBlocks since 840,000 have been37BTC4 BTC7 BTC16 BTC24 BTC30 BTC23 BTC17 BTC12 BTC9 BTC17 BTC19 BTC17 BTC23 BTC21 BTCTransactions seem higher too.  So at this point the mining reward has gone up, by 3-5 fold.(Sorry just saw the mempool thread)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "April 20, 2024, 02:20:34 AM",
      "body": "Woohoo!Quote from: B3dr0ck on April 20, 2024, 02:11:45 AMCan someone tell me WTF is going on with TX fees since the having block, 840,000Typical blocks are .4 - 2BTCBlocks since 840,000 have been37BTC4 BTC7 BTC16 BTC24 BTC30 BTC23 BTC17 BTC12 BTC9 BTC17 BTC19 BTC17 BTC23 BTC21 BTCTransactions seem higher too.  So at this point the mining reward has gone up, by 3-5 fold.(Sorry just saw the mempool thread)I guess everyone simultaneously got the notification that the halving is on and they all remembered to buy their bitcoins before the price goes up? Or it could just be really large exchanges doing that more likely. As they have the funds to buy more in less transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "April 20, 2024, 02:48:20 AM",
      "body": "Really happy to get merit on Halving day from non other than theymos. I am happy to be part of this community. 2020 was my first BTC Halving, let's see how this one goes.And as tranthidung said, it's not the end, it's the beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "April 20, 2024, 03:01:50 AM",
      "body": "Congratulations to everyone! The current block reward has decreased to 3.25 Bitcoins.I guess I am biased but I think the price growth is going to be somewhat higher than last cycle, due to institutional demand, block reward and long term holders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "April 20, 2024, 03:06:37 AM",
      "body": "It's a funny date too that halving happened at 4/20, I guess that this is a sign that bitcoin's going to blaze and get so high that we would be flabbergasted at the pump that's going to happen, it's a nice touch and hopefully we see more people get into bitcoin with this monumental event for bitcoin. It's never too late for them if they ever do because bitcoin will only go up, it's never going to be a bad investment despite the argument that it's volatile, there's no way for bitcoin besides going up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mamesso",
      "created_time": "April 20, 2024, 03:11:17 AM",
      "body": "Happy 4th Bitcoin Halving.Bitcoin Halving is one of the most awaited moments by investors because it is considered capable of improving market conditions because Bitcoin is still the main driver in the crypto asset market. As with general economic principles, Halving Bitcoin will increase demand and will also continue to increase the price of Bitcoin. Preparations need to be made one way or another now before paying higher prices for Bitcoin in the near future. Even though basically the market will continue to rise or fall, in the end, no matter how difficult the circumstances, Bitcoin will continue to spread its wings to fly even higher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "April 20, 2024, 03:14:04 AM",
      "body": "Happy 4th Bitcoin halving everyone and mostly to those that have experienced it for the first time. It's another milestone that surely going to be seen soon but as we celebrate and welcome this 4th halving, here comes some unwelcoming fees update.Source from mempool.space",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "B3dr0ck",
      "created_time": "April 20, 2024, 03:37:47 AM",
      "body": "welcome to the halving where mining rewards drop by 3.12BTC and the tx fees go from .4BTC to 25BTCso the miners payout goes down by half?  NO it goes up 4x.I guess Runes coming online, are making this a thing.  So much for your idea of a liquidity crunch, if miners now have 4x more BTC than before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Upgrade00",
      "created_time": "April 20, 2024, 03:47:05 AM",
      "body": "The single most important event in the crypto space has occurred. Happy post halving experience to everyone, hodl till the value of your portfolio starts to feel the increase in demand over supply.This is my second halving as I learnt of bitcoin just after the one that happened in 2016. Two more halvings and we'll go less than 1BTC reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "April 20, 2024, 03:56:52 AM",
      "body": "What a historical event we are seeing right before our eyes!We shall see how this will play out in the future and see how this change our lives. I am going to be optimistic and try to take any opportunity I can to make this halving and bull run count. Cheers to everyone and keep focus on your goals!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alankasman",
      "created_time": "April 20, 2024, 04:20:49 AM",
      "body": "Quote from: ImThour on April 20, 2024, 12:14:50 AMCongratulations Everyone!  Date: 4/20Block Height: 840000Rewards: 3.125 BTC per BlockHappy Bitcoin halving day from me to all of us who are still loyal to Bitcoin. This is a historic day worth celebrating. Indirectly, today is an opportunity for me to still be able to celebrate Bitcoin Halving Day. Long life to all of us, may Bitcoin continue to be around forever even though we are gone.The pink color looks different on the 4th Bitcoin Halving Day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}