{
  "id": "topic_5421822",
  "title": "minerjones",
  "author": "minerjones",
  "created_time": "November 17, 2022, 11:53:52 AM",
  "content": "Interesting new approach to the traditional 70 point scale normally used to grade coins:",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5421822",
  "comments": [
    {
      "author": "Suzuki Matt",
      "created_time": "November 17, 2022, 01:27:01 PM",
      "body": "If it ain't broke don't fix it. I like the 70 pt grading scale. This is corny.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptogreatdane",
      "created_time": "November 17, 2022, 05:58:08 PM",
      "body": "My question is will all coins now use both scales? Or will all coins including standard coins like Morgan dollars use this new NGCX scale. If what there saying is the Sheldon score will only be used for official coins like the morgan and all other coins like physical btc will use NGCX, then i dont like it. I hope their not saying that physical isnt worthy of the Sheldon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "slimzak",
      "created_time": "November 17, 2022, 06:02:57 PM",
      "body": "I like this new scale, more intuitive for the newer generations of collectors",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "November 17, 2022, 08:06:55 PM",
      "body": "I don't like it.  Seems like a quicker way to grade and thus make a quicker buck as I would guess very little to no price reduction in cost- wouldn't matter as this shouldn't be the driver.  Also appears those that were Sheldon graded would result in a higher premium as it is the established numismatic grading scale.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spokanistan51",
      "created_time": "November 17, 2022, 10:30:43 PM",
      "body": "Another thing to note, if the coin is cleaned or \"altered\" in cards terms, with it auto grade a 1 similar to MS60? If so...ouch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}