{
  "id": "topic_5460283",
  "title": "Kongxx",
  "author": "Kongxx",
  "created_time": "July 19, 2023, 05:09:30 AM",
  "content": "Is Gmail shutting down??!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460283",
  "comments": [
    {
      "author": "rybako",
      "created_time": "July 19, 2023, 07:04:31 AM",
      "body": "No, Gmail is not shutting down completely. However, Google will delete the accounts and content of users who are inactive for more than two years after June 1, 2021.This means that users who do not use Gmail or related services like Google Photos and Drive will lose their Gmail ID and their data permanently. Users who are over the storage limit will also have their content deleted across these services.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 19, 2023, 11:39:15 AM",
      "body": "Gmail is not shutting down. It is up and running except you are having issues from your own side. It maybe a network issue that they are experiencing or you check your network from your locality. I just checked on the internet and I see it could be network issues going on with their network. So you can as well do a check on the internet through google to see if you can fix your challenge with it .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "July 19, 2023, 04:17:05 PM",
      "body": "I think gmail is the most popular online free mail service in existence right? I don’t see them shutting that down for any reason. Especially when you consider that they’re farming your emails to get advertising suggestions in order to market items to you for their own profit. I would imagine Gmail for Google is a significant revenue generator as a result.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "July 19, 2023, 04:30:40 PM",
      "body": "Gmail works great as usual, I doubt there is a plan to shut it down because in addition to the huge popularity there are a lot of Google services associated with Gmail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "July 19, 2023, 06:51:58 PM",
      "body": "Quote from: Kongxx on July 19, 2023, 05:09:30 AMIs Gmail shutting down??!The company is one of the most successful, there should be no pressing reason to shut down as a business without a crisis or some kind of legal problems. Google is only shutting down their Album Archive service. QuoteGoogle has confirmed that its Album Archive service is being shut down from July 19, meaning photos spanning a number of its services like Hangouts and Gmail could soon be lost if not backed up.  so if you have old pictures there that you value, you need to back them up.Its mail services (Gmail) is not what is being affected, so Gmail is not closing or shutting down.https://analyticsindiamag.com/google-is-deleting-its-cloud-based-gallery-album-archive/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "July 19, 2023, 07:24:01 PM",
      "body": "so there is actually something that will disappear online like the google pics. if the owner of the gmail account was dead already and have not touched the email account then google can delete them all including the linked accounts such as youtube?they lose the competition. facebook wins. creating an account on facebook doesn't require email anymore but a phone number.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "July 20, 2023, 06:40:25 AM",
      "body": "I don't think Gmail will be shutting down, Gmail is one of the easiest way to send information and other important articles at ease, Gmail is even used in major companies and other business sites..I don't see Gmail shutting down anytime soon, except perhaps there's is an issue that need to rectified or maybe there's an upgrade on the site...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 20, 2023, 08:25:51 AM",
      "body": "Quote from: Belarge on July 20, 2023, 06:40:25 AMI don't think Gmail will be shutting down, Gmail is one of the easiest way to send information and other important articles at ease, Gmail is even used in major companies and other business sites..I don't see Gmail shutting down anytime soon, except perhaps there's is an issue that need to rectified or maybe there's an upgrade on the site...Being the easiest or fastest nor biggest is not excusable for a company not to go down or disappoint, that is not tenable because it is not a fact. Gmail may have had a network issue that they are resolving and that is understandable. They have made some solution online for accounts that are having such issue.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sunsilk",
      "created_time": "July 20, 2023, 01:44:54 PM",
      "body": "Gmail is still popular upto this time and think of Yahoo! that has already lost a lot of share in the market yet they're still operating and good. While Gmail is on a better place, I don't see them closing anytime soon. Maybe for some of their service, they're closing it down but the service they're running for emails(gmail) isn't going to be down. I don't see any reason for them to turn it down.When majority of the entire world is using them and they've got the biggest market share in terms of being an email provider to everybody.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "July 20, 2023, 10:46:13 PM",
      "body": "If you are talking about the email on their update of their account elimination system, it is just about cleaning space in Google's system so they can use their resources on active users, they will start deleting accounts which have not been active in much time. Gmail is not going anywhere, because (as others have pointed out) is probably one of the most successful Google products for gathering personal information and monetize on it. It would the a foolish movement by them if they even consider it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}