{
  "id": "topic_5416556",
  "title": "amysteryremains",
  "author": "amysteryremains",
  "created_time": "October 10, 2022, 02:54:06 AM",
  "content": "Since NFT only represent the metadata associated with the work and not the work itself. How can copyright be attached to an NFT to allow for the transfer of ownership of the work itself?Is there a technical solution available right now?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416556",
  "comments": [
    {
      "author": "vv181",
      "created_time": "October 10, 2022, 02:06:04 PM",
      "body": "Quote from: amysteryremains on October 10, 2022, 02:54:06 AMSince NFT only represent the metadata associated with the work and not the work itself. How can copyright be attached to an NFT to allow for the transfer of ownership of the work itself?Is there a technical solution available right now?Maybe it could be managed by a legally-binding document. But actually, it solely based on how the regulation that applied between each party on its own country, so best if you want to start a serious project, and have a legal certainty, it would be better if you consult with a lawyer who understands the cryptocurrencies space regarding how to attach the copyright of the media with NFT itself.It is always tricky if we talk about this problem since it's a growing concern yet the technologies rapidly develop. As of now, there is no technical solution that is able to solve that. In general, I doubt things that require human intervention like law, are able to be managed by a technical solution.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amysteryremains",
      "created_time": "October 10, 2022, 02:39:07 PM",
      "body": "The only solution it seems right now is a separate transfer of ownership agreement by the seller, Which also is limited to the country the agreement was signed. Yes I am working on such project, any input or willingness to join will be greatly appreciated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "October 10, 2022, 11:25:04 PM",
      "body": "Quote from: amysteryremains on October 10, 2022, 02:54:06 AMSince NFT only represent the metadata associated with the work and not the work itself. How can copyright be attached to an NFT to allow for the transfer of ownership of the work itself?It is in this metadata that the name and description of this NFT are included, and, if necessary, a link to the original image, if this NFT is a copy of the original painting, as well as the wallet address that will help identify its creator. Thus, if you create a NFT yourself based on another author's work, you will not own the copyright to this original image.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "amysteryremains",
      "created_time": "October 11, 2022, 06:31:00 PM",
      "body": "Lets say creator identity and authenticity is confirmed, also the willingness to transfer ownership of the said work..Question still remains is what would be a legally complaint way to do that ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}