{
  "id": "topic_5476272",
  "title": "gagux123",
  "author": "gagux123",
  "created_time": "December 02, 2023, 08:24:27 AM",
  "content": "Li essa reportagem no PortaldoBitcoin alguns dias atras e gostaria de compartilhar essa matéria interessante com vocês. Confesso que fiquei surpreso, mas o municipio gaúcho de Rolante no Rio Grande do Sul se tornou a cidade número 1 do mundo na adoção do Bitcoin como moeda de acordo com o site BTCMap. Alguns dados interessantes é que, a cidade de Rolante/RS possui aproximadamente 22 mil habitantes e possui em torno de 180 estabelecimentos que aceitam Bitcoin (dentre eles, farmacias, supermercados, cabeleireiros, loja de ferragens dentre outros)No final de setembro a cidade de Rolante/RS realizou o evento \"Bitcoin Spring Festival\" com o intuito de disseminar e firmar a adoção (ainda mais) do Bitcoin pela cidade  Referencias e demais informações! • Cidade gaúcha é a número um no mundo na adoção do Bitcoin como moeda• Conheça a pequena cidade brasileira que se tornou local com maior taxa de adoção do Bitcoin no mundo• \"Bitcoin é Aqui!\" (site de divulgação da cidade de Rolante/RS)• Fotos do evento \"Bitcoin Spring Festival\" na cidade de Rolante/RSDivulgação: Farmácia de Rolante/RS",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476272",
  "comments": [
    {
      "author": "tg88",
      "created_time": "December 03, 2023, 07:07:42 PM",
      "body": "Quote from: gagux123 on December 02, 2023, 08:24:27 AMLi essa reportagem no PortaldoBitcoin alguns dias atras e gostaria de compartilhar essa matéria interessante com vocês. Confesso que fiquei surpreso, mas o municipio gaúcho de Rolante no Rio Grande do Sul se tornou a cidade número 1 do mundo na adoção do Bitcoin como moeda de acordo com o site BTCMap. Alguns dados interessantes é que, a cidade de Rolante/RS possui aproximadamente 22 mil habitantes e possui em torno de 180 estabelecimentos que aceitam Bitcoin (dentre eles, farmacias, supermercados, cabeleireiros, loja de ferragens dentre outros)No final de setembro a cidade de Rolante/RS realizou o evento \"Bitcoin Spring Festival\" com o intuito de disseminar e firmar a adoção (ainda mais) do Bitcoin pela cidade  Divulgação: Farmácia de Rolante/RSTambém me surpreendi bastante quando descobri sobre Rolante, até comentei em outro tópico que foi criado. A história é bem interessante e mostra como ''uma pessoa ou um pequeno grupo''  pode realmente fazer a diferença. No caso de Rolante é um casal os responsáveis por todo processo de adoção do Bitcoin e de ter dado o titulo a cidadezinha. E mesmo sendo longe dos grandes centros estão conseguindo fazer eventos e levar pessoas pra lá. A cidade foi bastante afetada pelas chuvas, então é bom pensar em novas formas de desenvolver o local.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 05, 2023, 07:55:13 PM",
      "body": "Realmente incrível, uma cidade com 22 mil habitantes e ter quase 200 estabelecimentos aceitar Bitcoin.O rácio é quase uma loja que aceita BTC por cada 1000 habitantes. Isso significa que a pessoa é capaz de fazer quase tudo no seu dia a dia a pagar Bitcoin.Alguém por aqui que more nessa cidade? Seria interessante ter um feedback dessa realidade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 05, 2023, 08:10:23 PM",
      "body": "Quote from: joker_josue on December 05, 2023, 07:55:13 PMAlguém por aqui que more nessa cidade? Seria interessante ter um feedback dessa realidade.Acredito que não tem ninguém aqui que more na referida cidade. Apesar que temos participantes do fórum que moram perto dela. Eu mesmo moro bem distante. Acho que dá mais de 1 mil quilômetros da minha cidade até essa cidade de Rolante. Seria equivalente a atravessar quase um Portugal inteiro para chegar lá.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 05, 2023, 08:53:14 PM",
      "body": "Quote from: Paredao on December 05, 2023, 08:10:23 PMAcredito que não tem ninguém aqui que more na referida cidade. Apesar que temos participantes do fórum que moram perto dela. Eu mesmo moro bem distante. Acho que dá mais de 1 mil quilômetros da minha cidade até essa cidade de Rolante. Seria equivalente a atravessar quase um Portugal inteiro para chegar lá.  Se é mais que 1000km, então sim, é atravessar mais que Portugal inteiro.A terceira maior estrada nacional do Mundo, fica em Portugal, é a Estrada Nacional 2 que conta uns belos 739km, sendo só ultrapassada em km pela Route 66 (EUA) e Ruta 40 (Argentina). A estrada liga a cidade de Chaves (extremo norte de Portugal) ao extremo sul de Portugal - Faro.Fonte: https://www.visitportugal.com/pt-pt/content/pela-estrada-nacional-2-de-norte-sul-de-portugalAinda não tive a oportunidade de fazer a viagem do ponto A ao ponto B, apesar de já conhecer boa parte do seu troço. É um dos planos de viagem futuros.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "December 05, 2023, 09:00:14 PM",
      "body": "Quote from: joker_josue on December 05, 2023, 08:53:14 PMA terceira maior estrada nacional do Mundo, fica em Portugal, é a Estrada Nacional 2 que conta uns belos 739km, sendo só ultrapassada em km pela Route 66 (EUA) e Ruta 40 (Argentina).Aqui no Brasil temos a BR-101 que passa por quase todo litoral brasileiro.. não sei o motivo de não estar nessa lista, deve ter alguns cortes pelo caminho.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 05, 2023, 09:15:16 PM",
      "body": "Quote from: sabotag3x on December 05, 2023, 09:00:14 PMQuote from: joker_josue on December 05, 2023, 08:53:14 PMA terceira maior estrada nacional do Mundo, fica em Portugal, é a Estrada Nacional 2 que conta uns belos 739km, sendo só ultrapassada em km pela Route 66 (EUA) e Ruta 40 (Argentina).Aqui no Brasil temos a BR-101 que passa por quase todo litoral brasileiro.. não sei o motivo de não estar nessa lista, deve ter alguns cortes pelo caminho.Pois... ela é composta em conjunto de outras estradas:Quote from: https://pt.wikipedia.org/wiki/BR-101A BR-101 seria, em tese, a maior rodovia brasileira, mas alguns trechos são interpostos com outras rodovias federais.Ao que parece, só é contabilizado as estradas que vão do ponto zero ao ponto final, como o principal trecho. Mesmo que outras rotas passem sobre essa estrada, a principal é sempre a mesmo. Com acontece com a 66, a 40, e a EN2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Paredao",
      "created_time": "December 23, 2023, 07:44:54 PM",
      "body": "Quote from: joker_josue on December 05, 2023, 08:53:14 PMAinda não tive a oportunidade de fazer a viagem do ponto A ao ponto B, apesar de já conhecer boa parte do seu troço. É um dos planos de viagem futuros. Interessante essa estrada Portuguesa que corta o País de Norte a Sul. E em se tratando de ferrovias, o que vocês tem de bom nessa área? Tem algum trem-bala que corte Portugal de Norte ao Sul ? Ou ainda o transporte ferroviário Português não está tão desenvolvido nessa área ?Aqui no Brasil, iriam construir um trem-bala entre São Paulo e o Rio de Janeiro. Passado mais de 20 anos, a obra não saiu do papel.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "December 24, 2023, 12:17:30 AM",
      "body": "Quote from: Paredao on December 23, 2023, 07:44:54 PMInteressante essa estrada Portuguesa que corta o País de Norte a Sul. E em se tratando de ferrovias, o que vocês tem de bom nessa área? Tem algum trem-bala que corte Portugal de Norte ao Sul ? Ou ainda o transporte ferroviário Português não está tão desenvolvido nessa área ?Aqui no Brasil, iriam construir um trem-bala entre São Paulo e o Rio de Janeiro. Passado mais de 20 anos, a obra não saiu do papel.  A ferrovia portuguesa deixou de ter investimento a mais de 20 anos, infelizmente.Sou nos últimos 5-10 anos é que se começou a falar do TGV, e porque é um projeto da Comunidade Europeia. Ou gasta-se os fundos para isso ou perde-se o dinheiro. Mesmo assim, ainda é só planos, nada muito em concreto. O mais rápido que temos é o Alfa Pendular, que liga Lisboa/Porto e Lisboa/Faro, que em alguns troços do percurso (poucos) consegue chegar aos 200Km/h.Essas grandes obras em Portugal não acontecem ou é difícil.Andamos há mais de 50 anos a tentar construir um novo aeroporto de Lisboa. Com o dinheiro que já se gastou em estudos e planeamentos, já tinham pago 2 aeroportos novos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}