{
  "id": "topic_5461819",
  "title": "Odohu",
  "author": "Odohu",
  "created_time": "August 02, 2023, 12:26:05 PM",
  "content": "The word \"Conspiracy theory became so popularly in 2020 follow the outbreak of covid19 in late 2019. Many of those described as conspiracy theorist believe that there is a group of people call the deep states that control the world economy, the media, politics and power. However, the advent of social media have created different perspectives in media reportage and is even the reason we know certain things that goes on in different parts of the world. So, what does the conspiracy theorist say about major global events that should catch our attention?First is covid19 that the conspiracy theorist believed was not a pandemic but a \"plandemic\" , meaning it was planned and implemented by the deep states to disrupt world's economy, seize powers and control humanity. Actually, during the pandemic of covid19, we were actually living according to the dictates of the scientist and health experts and some of the policies introduced and measures taken shows there was more to covid19 than a disease outbreak. Businesses were crippled,  supply chains destroyed and people plunged into poverty in a bid to supposedly combat a virus that till date no one can explain where and how it stopped being a pandemic. Does this make the conspiracy theorists right? That I don't know!Second phase of the conspiracy theory is the plan of the deep state to reduced world population. According to them, if they cannot use a disease outbreak, they have to use war. The conspiracy theorist believe that the war in Ukraine, Sudan and the recent war looming around in Niger and West Africa are all part of the plan... \"throw the world into chaos and anarchy, let them kill themselves so the population will reduce\". From various projections by the conspiracy theorists, if nothing is done, there will be war in Africa(happening in Sudan, Somalia with tension building in Niger, Mali, Guniea, Bokina Faso and the entire West Africa), Europe (Already happening in Ukraine with possibilities of escalating) and Asia ( Lybia was used as a test, Iran, Iraq,  Syria, Yemen etc. Taiwan and Hong-Kong might be used as the puppet to involve China). There are more events that seems abnormal in the world which the conspiracy theorists connected, but to make it brief, I will not share them here.But are these mere coincidences or the conspiracy theorist are partly right or entirely right?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461819",
  "comments": [
    {
      "author": "Gozie51",
      "created_time": "August 02, 2023, 03:54:04 PM",
      "body": "Quote from: Odohu on August 02, 2023, 12:26:05 PMBusinesses were crippled,  supply chains destroyed and people plunged into poverty in a bid to supposedly combat a virus that till date no one can explain where and how it stopped being a pandemic. Does this make the conspiracy theorists right? That I don't know!The conspiracy theory have been with humanity before COVID-19 and those have been propaganda when after you peruse deeper you see traces of truth and mixture of fallacy but only left for you to accept what you want to just like the origin and ending of COVID-19 leaves many dumfounded. However, I like the analysis of what you are saying and this part caught my attention. I like you to understand that as much as many businesses went down and people went into poverty, that was also how some businesses that never flourished did so especially businesses in health care and management. Hence, who knows if that was also the propaganda or the conspiracy of the \"deep state\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 02, 2023, 04:45:20 PMLast edit: August 02, 2023, 04:57:35 PM by BADecker",
      "body": "In general, the only conspiracy theorists who are right all the time, are among the ones who don't make a bunch of conspiracy theories.In general, the conspiracy theorists almost never go deep enough with their theories, meaning, there are way more conspiracies, and deeper ones than anyone talks about.The idea that covid is a conspiracy theory is totally wrong. If you want to see the proof, look at the videos starting in 2002 at this site - https://www.bitchute.com/channel/okiFK5CwQrZS/. There are many other sites with loads of doctors and professionals and experts who show that covid is conspiracy, not a theory.The reason why evil conspiracies fail is, the conspirators are not smart enough to out-think God... and in many cases, people who are against them.Many people fully vaccinated for covid are now going BLINDhttps://vaccines.news/2022-04-28-many-people-fully-vaccinated-covid-going-blind.htmlBut there is another concerning side effect occurring in the \"fully vaccinated\" for the Wuhan coronavirus (COVID-19) that is rarely mentioned: blindness.The latest data out of the United Kingdom suggests that a growing number of fully jabbed people are losing their eyesight. The Medicines and Healthcare products Regulatory Agency (MHRA) Yellow Card system currently shows 163 cases of total blindness among people who got jabbed with the Pfizer-BioNTech needle, along with an additional six cases of central vision loss and four cases of sudden visual loss.Twenty-one people also reportedly now suffer from \"blindness transient\" specifically caused by the Pfizer injection. This adverse reaction involves visual disturbance or loss of sight in one eye for a few seconds or even minutes at a time.Another 20 people beyond that are reported to have suffered from a reaction called \"unilateral blindness,\" which is when a person got blind or blurred vision in just one eye (Related: Roman Abramovich recently suffered temporary blindness while attempting to broker peace talks between Russia and Ukraine; was he recently vaccinated?)\"In total, there have been 8,016 eye disorders reported as adverse reactions to the Pfizer jab as of 6th April 2022,\" reported the Daily Exposé.Is it worth possibly going blind just to feel \"protected\" against a cold?The AstraZeneca injection, which is one of the COVID jabs currently available in the U.K., is also linked to cases of blindness.As of April 6, the MHRA has received 324 reports of blindness, three reports of central vision loss, five reports of sudden visual loss, and 29 reports of blindness transient among 14,895 eye disorders, all specifically linked to the AstraZeneca needle.Moderna also jabs people in the UK, though at a much smaller rate than the aforementioned companies. Still, many people who take the Moderna needle are now blind as well.The MHRA shows that in conjunction with the Moderna injection, there have been 34 reports of blindness and 56 reports of visual impairment. In total, there have been 1,519 eye disorders reported as adverse reactions to the Moderna jab....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "August 02, 2023, 08:46:44 PMLast edit: August 02, 2023, 09:10:21 PM by Gyfts",
      "body": "Quote from: Odohu on August 02, 2023, 12:26:05 PMFirst is covid19 that the conspiracy theorist believed was not a pandemic but a \"plandemic\" , meaning it was planned and implemented by the deep states to disrupt world's economy, seize powers and control humanity. Actually, during the pandemic of covid19, we were actually living according to the dictates of the scientist and health experts and some of the policies introduced and measures taken shows there was more to covid19 than a disease outbreak. Businesses were crippled,  supply chains destroyed and people plunged into poverty in a bid to supposedly combat a virus that till date no one can explain where and how it stopped being a pandemic. Does this make the conspiracy theorists right? That I don't know!The coordination by the elites to systematically transfer wealth from the lower classes was not premeditated. Government is a self sustaining entity and during COVID they took the opportunity to consolidate power and centralize the economy to the banks. The ones with all the capital didn't have a problem adjusting to the new economic conditions set by the government. Everyone else struggled.It wasn't a conspiracy -- they did it in front of us and some portion of the population was so deathly afraid of COVID that they let it happen. COVID was an accidental crisis, and as the say, never let a good crisis go to waste.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "paxmao",
      "created_time": "August 02, 2023, 10:54:31 PM",
      "body": "dude, there are so many conspiranoics here in the forum that it is statistically impossible that at least something of all the shit that they make up is not at least partially true. You name them, alien life, illuminati consipiracies, the \"deep states\", the complot of the multinationationals, chemtrails,... But the thing is that most of them are just saying with no proof.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Trumanwire",
      "created_time": "August 03, 2023, 12:33:46 AM",
      "body": "Sometimes…Quote from: Odohu on August 02, 2023, 12:26:05 PMThe word \"Conspiracy theory became so popularly in 2020 follow the outbreak of covid19 in late 2019. Many of those described as conspiracy theorist believe that there is a group of people call the deep states that control the world economy, the media, politics and power. However, the advent of social media have created different perspectives in media reportage and is even the reason we know certain things that goes on in different parts of the world. So, what does the conspiracy theorist say about major global events that should catch our attention?First is covid19 that the conspiracy theorist believed was not a pandemic but a \"plandemic\" , meaning it was planned and implemented by the deep states to disrupt world's economy, seize powers and control humanity. Actually, during the pandemic of covid19, we were actually living according to the dictates of the scientist and health experts and some of the policies introduced and measures taken shows there was more to covid19 than a disease outbreak. Businesses were crippled,  supply chains destroyed and people plunged into poverty in a bid to supposedly combat a virus that till date no one can explain where and how it stopped being a pandemic. Does this make the conspiracy theorists right? That I don't know!Second phase of the conspiracy theory is the plan of the deep state to reduced world population. According to them, if they cannot use a disease outbreak, they have to use war. The conspiracy theorist believe that the war in Ukraine, Sudan and the recent war looming around in Niger and West Africa are all part of the plan... \"throw the world into chaos and anarchy, let them kill themselves so the population will reduce\". From various projections by the conspiracy theorists, if nothing is done, there will be war in Africa(happening in Sudan, Somalia with tension building in Niger, Mali, Guniea, Bokina Faso and the entire West Africa), Europe (Already happening in Ukraine with possibilities of escalating) and Asia ( Lybia was used as a test, Iran, Iraq,  Syria, Yemen etc. Taiwan and Hong-Kong might be used as the puppet to involve China). There are more events that seems abnormal in the world which the conspiracy theorists connected, but to make it brief, I will not share them here.But are these mere coincidences or the conspiracy theorist are partly right or entirely right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sirazimuth",
      "created_time": "August 03, 2023, 02:36:20 PM",
      "body": "Well I saw this click-baity title and had to click on it, because I knew that my deluded buddy who gives me much entertainment on this board would be right there posting his usual drivel.Actually whenever, wherever I post on this board, I can count on him to immediately reply with some retarded nonsense.Because he is the champion Bitcointalk conspiracy theorist, bar none.And he did not disappoint with this brilliant jem... pulled directly out of his ass...Quote from: BADecker on August 02, 2023, 04:45:20 PM.....The reason why evil conspiracies fail is, the conspirators are not smart enough to out-think God... and in many cases, people who are against them........Nuff said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 03, 2023, 06:36:40 PM",
      "body": "Note that conspiracy theorists are almost never right. Why not? Because any two or more people who get together are forming a conspiracy. Friends who go out to eat are forming a conspiracy at the restaurant table. Families who eat together in the dining room are forming a conspiracy. Conspiracy theorists aren't right, because they limit their talk to theory, not conspiracy. So, the conspirators who call others conspiracy theorists, are conspiracy theorists themselves... the real conspiracy theorists.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "August 04, 2023, 03:42:12 AM",
      "body": "Quote from: Odohu on August 02, 2023, 12:26:05 PM~SnipConspiracy theories do exist. Because in this world, every country, every group always has big ambitions to make their wishes and dreams come true. So it's not strange if making conspiracy theories is indeed a way that can be used to make the wishes of each group or country come true. Because as you said, the outbreak that happened a few years ago (covid 19), the ongoing wars (in West Africa, Europe, Asia). All of these things always have a peculiarity that is always smelled by society, and these oddities are sometimes seen and heard clearly. But strangely, if the things that have happened and are happening right now, you could say that these events have succeeded in outwitting the world's people. Regardless of whether it's a conspiracy theory or not, the point is that all these events are very suspicious.So basically, I believe the conspiracy theory really exists. Because sometimes conspiracy theories, in my opinion, don't all end badly, but they can also have a positive impact on human life. But the majority, this conspiracy theory is always associated with the name of a crime plan committed by a certain group. Even so, we as ordinary humans, can do nothing to stop any conspiracy theory. Because I'm sure, those who always make conspiracy theories that affect the whole country (especially) are people who are very afraid of all countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvbcof",
      "created_time": "August 04, 2023, 09:49:09 AMLast edit: August 04, 2023, 12:40:23 PM by tvbcof",
      "body": "Quote from: Odohu on August 02, 2023, 12:26:05 PMThe word \"Conspiracy\" theory became so popularly in 2020 follow the outbreak of covid19 in late 2019. Many of those described as conspiracy theorist believe that there is a group of people call the deep states that control the world economy, the media, politics and power...Lol!  About the first documented use of the term came from a CIA management memo to their assets in the media (part of their 'mockingbird' program) to denigrate those who questioned the official report about the JFK assassination.  That was back in the 1960's!  The  (later discovered) memo corresponds well with documented use of the term/technique, and acceleration since.   It was (and is) highly effective.It's good policy to more highly value the output of people who show their work.  At least it has been valuable to me, but I'm a 'truther' so-to-speak.  https://www.corbettreport.com/i-am-a-conspiracy-theorist/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "August 04, 2023, 11:57:58 AM",
      "body": "Sports are one of the amazing events that they create to focus people's attention towards not thinking of another important aspect of our existence in this world. Sports and Music industries seem their way to divert the attention of most people to control them. I came up with a reel on Facebook where they talked about why these industries are billions of dollars even though they do not have any means to change the world into a better place because there is only one explanation in that reel they said that there's some group out there that making all these things happened. They wanted the people to not search for the answer and they control them by these means. This is one of the conspiracy theorists that I think is real.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "August 04, 2023, 12:44:24 PM",
      "body": "Quote from: yazher on August 04, 2023, 11:57:58 AMThey wanted the people to not search for the answer and they control them by these means. This is one of the conspiracy theorists that I think is real.This is part of another conspiracy theory. Many sports lovers and music enthusiast will tell you these two brings soothing relief to whatever sorrow you are going through. Football for instance is a unifier even in a country where religion has separated the fabrics of what bring people together. It is the most of them all that even in the world, it creates a life time of revenue for host countries especially in the FIFA hosted tournaments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 04, 2023, 06:46:41 PM",
      "body": "Quote from: BADecker on August 03, 2023, 06:36:40 PMNote that conspiracy theorists are almost never right. Why not? Because any two or more people who get together are forming a conspiracy. Friends who go out to eat are forming a conspiracy at the restaurant table. Families who eat together in the dining room are forming a conspiracy. Conspiracy theorists aren't right, because they limit their talk to theory, not conspiracy. So, the conspirators who call others conspiracy theorists, are conspiracy theorists themselves... the real conspiracy theorists.In other words, conspiracy theorists aren't the problem. The problem is the conspirators who call others conspiracy theorists without explaining things with solid proof. Those conspirators have banded together with other conspirators of a similar mind, to attack only one class of conspiracy theorists... while at the same time are in a far bigger class of conspiracy theorists themselves, which they don't focus on.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "August 04, 2023, 07:56:11 PM",
      "body": "Quote from: Odohu on August 02, 2023, 12:26:05 PMBut are these mere coincidences or the conspiracy theorist are partly right or entirely right?Coincidence is very rare and does not always happen. Most events that many people will see as coincidence because of how much conditioned many people are to the system are not really coincidences. Conspiracy theorist are not always wrong with their theories. There are truths in some of them if you can really see the facts. These people have access to classified information and are thinking outside the system, so they see what is really happening and have good theories as evidence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "montaga",
      "created_time": "August 05, 2023, 05:24:10 PM",
      "body": "Stick to known facts and you be okhttps://www.sott.net/article/437083-Compelling-Evidence-That-SARS-CoV-2-Was-Man-Made",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 05, 2023, 05:47:54 PM",
      "body": "Generally, people who are called conspiracy theorists, don't call others conspiracy theorists. Who calls some people conspiracy theorists.Take a look at the main stream news media. Often every major broadcaster says the same thing. Their people say the same words, verbatim. And, they call people who are against their views conspiracy theorists.But when they all say the same thing verbatim, aren't they a conspiracy? How else could the all guess the exact same words besides conspiring to SAY the exact same words.And when mainstream media calls anybody who disagrees with their conspiracy, a conspiracy theorist, aren't THEY simply being conspiracy theorists, themselves.It's time to recognize that being a conspiracy theorist is the way to be. It's called 'freedom of speech'.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "August 07, 2023, 05:49:48 AM",
      "body": "Lately you can pretty much believe conspiracy theorists over your own government. Covid showed how the government will ignore common sense and censor the truth in order to get you to do what they want. Even if it is bad for you and could mean the end of your life. I really don’t see how anyone with any sense could ever trust the government again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvbcof",
      "created_time": "August 07, 2023, 09:46:18 AM",
      "body": "Quote from: BADecker on August 05, 2023, 05:47:54 PMGenerally, people who are called conspiracy theorists, don't call others conspiracy theorists. Who calls some people conspiracy theorists....Quote from: OgNasty on August 07, 2023, 05:49:48 AMLately you can pretty much believe conspiracy theorists over your own government. ...I think it fair to say that real 'conspiracy theorists' generally don't 'want you to believe' anything.  Simply seek the truth using the classical scientific method.I find that in talking to normies, they are almost without exception oblivious to how ridiculous their 'null hypothesis' is when weighted analytically.  About 'conspricy' theories or any number of other classes of theory.  In this age of scientism, with very few people understanding the age of reason ideas, it's pretty unrealistic to expect a very significant percentage of people to think outside of the ever-shrinking confinement they are placed in.  Oh well.  Lots of them die or at least become sterilized.  Almost certainly in high enough numbers that the various globalist programs will indeed shape human evolution just as the globalists, who are almost always driven by the theories of eugenics, brag about.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Compromise me",
      "created_time": "August 07, 2023, 03:05:44 PM",
      "body": "Quote from: Odohu on August 02, 2023, 12:26:05 PMFirst is covid19 that the conspiracy theorist believed was not a pandemic but a \"plandemic\" , meaning it was planned and implemented by the deep states to disrupt world's economy, seize powers and control humanity. Actually, during the pandemic of covid19, we were actually living according to the dictates of the scientist and health experts and some of the policies introduced and measures taken shows there was more to covid19 than a disease outbreak. Businesses were crippled,  supply chains destroyed and people plunged into poverty in a bid to supposedly combat a virus that till date no one can explain where and how it stopped being a pandemic. Does this make the conspiracy theorists right? That I don't know!In my opinion it was a propaganda of super powers. But no one knows what was reason behind this propaganda. Only few industries got benefit at this stage like medical. Medical industry Flourished during COVID-19. Most of industries shut down.Scientists experiences are different from one another. One scientist said that, in two years COVID-19 vaccinated people will die.Conspiracy theory word spread after COVID- 19 because the consequences of COVID-19 was worse. World did not face this type of pandemic or plendemic before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "August 07, 2023, 05:10:05 PM",
      "body": "Quote from: tvbcof on August 07, 2023, 09:46:18 AMQuote from: BADecker on August 05, 2023, 05:47:54 PMGenerally, people who are called conspiracy theorists, don't call others conspiracy theorists. Who calls some people conspiracy theorists....Quote from: OgNasty on August 07, 2023, 05:49:48 AMLately you can pretty much believe conspiracy theorists over your own government. ...I think it fair to say that real 'conspiracy theorists' generally don't 'want you to believe' anything.  Simply seek the truth using the classical scientific method.I find that in talking to normies, they are almost without exception oblivious to how ridiculous their 'null hypothesis' is when weighted analytically.  About 'conspricy' theories or any number of other classes of theory.  In this age of scientism, with very few people understanding the age of reason ideas, it's pretty unrealistic to expect a very significant percentage of people to think outside of the ever-shrinking confinement they are placed in.  Oh well.  Lots of them die or at least become sterilized.  Almost certainly in high enough numbers that the various globalist programs will indeed shape human evolution just as the globalists, who are almost always driven by the theories of eugenics, brag about.As usual, your insight is extremely refreshing.Since there are others who seem to think and who actually say things similar to yours, are you in conspiracy with them? Or do you all come up with it on your own?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}