{
  "id": "topic_5440680",
  "title": "Alex077",
  "author": "Alex077",
  "created_time": "February 21, 2023, 11:16:20 AM",
  "content": "Криптозима затронула мелких криптоинвесторов больше, чем китовПо данным Банка международных расчетов (BIS), потрясения, затронувшие рынок криптовалют в 2022 году и приведшие к убыткам в миллиарды долларов, не оставил заметных следов в финансовой системе в целом.В февральском бюллетене BIS банк привел новые розничные данные, которые показали, что большое количество пользователей криптовалют больше всего пострадали от продолжительной крипто-зимы.....https://crypto.kg/forum/threads/kriptozima-zatronula-melkix-kriptoinvestorov-bolshe-chem-kitov.23404/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440680",
  "comments": [
    {
      "author": "summonerrk",
      "created_time": "February 27, 2023, 06:29:46 AM",
      "body": "Quote from: Alex077 on February 21, 2023, 11:16:20 AMКриптозима затронула мелких криптоинвесторов больше, чем китовПо данным Банка международных расчетов (BIS), потрясения, затронувшие рынок криптовалют в 2022 году и приведшие к убыткам в миллиарды долларов, не оставил заметных следов в финансовой системе в целом.В февральском бюллетене BIS банк привел новые розничные данные, которые показали, что большое количество пользователей криптовалют больше всего пострадали от продолжительной крипто-зимы.....https://crypto.kg/forum/threads/kriptozima-zatronula-melkix-kriptoinvestorov-bolshe-chem-kitov.23404/Она всегда так и случается, знаю по своему опыту. Дело в том что при долгом дампинге приходится проедать свои накопления. И если для китов это копейки, то начинающие могут проесть половину своего депо.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bakasabo",
      "created_time": "March 01, 2023, 08:51:07 AM",
      "body": "Ничего удивительного. Стагнация, инфляция, кризис всегда бьет первым по малому бизнесу, уничтожая его, средний бизнес всегда пытается извернуться и сохраниться (или превращается в малый), а крупный либо не имеет изменений, либо зарабатывает. Данное явление отлично проецируется и на криптовалютный рынок. Мелкие проекты умерли (у них и так шансов не было), средние постоянно пытаются удивить, киты смотрят свысока на всё это мельтешение муравьев и улыбаются.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}