{
  "id": "topic_5418603",
  "title": "Famous Grouse",
  "author": "Famous Grouse",
  "created_time": "October 28, 2022, 08:26:34 AM",
  "content": "Nfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418603",
  "comments": [
    {
      "author": "Jackl87",
      "created_time": "October 28, 2022, 09:34:24 AM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art. Well obviously NFT's also follow the rule of supply and demand just like every other tradeable thing that exists in this world so this is nothing new. I am not sure though if they can be considered as an altcoin. It is definitely true that you need an altcoin blockchain in order to generate an NFT because Bitcoin itself simply does not have smart contract functionality and that is needed in order to mint NFT's. The thing with NFT's is, that they are unique and therefore they can serve many different purposes. They can represent ownership of digital land (maybe even real land and equity in the future?) and other stuff like access to certain events or sales or something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Victorik",
      "created_time": "October 28, 2022, 10:02:07 AM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art. Yea. But they serve a much bigger purpose. It is not just art, it is well more than that.I think NFTs will be much more appreciated when the metaverse becomes more active.For now, a lot of persons do not know the true value of NFTs and that in a way is affecting it's acceptability.Maybe with time, we will truly understand it more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "October 28, 2022, 10:43:14 AM",
      "body": "But when it comes to usefulness, I believe NFTs are more useful than the shitcoins. Like for example NFT games that are not yet popular, when time comes they become famous like many players will play the game in the future, the price of the game itself will rise and the items you gathered will even more get expensive than before. There were already lists of games that became like that and those who played those games at its early stage has earned lots of money without investing too much money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "danherbias07",
      "created_time": "October 28, 2022, 02:50:15 PM",
      "body": "It's not just photos, it could be music, clips, in-game items, characters from a game, and more. A vast of things can be an NFT in the internet space.Well, if you want to put it that way as an altcoin then so be it. But an altcoin that has higher value means unique features and great usage. An NFT relies on the rarity of the item. To put more demand and value on it means lesser the amount minted, created, mined (in some games), or dropped.A good example for me is when someone recorded Michael Jordan practicing in his young years. That will surely be valuable if sold in the market. But what if the one who recorded it made more copies and spread it all over the internet? That takes out the rarity and the value of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "October 28, 2022, 03:52:52 PM",
      "body": "Pfft.Come on, forget NFTs is dead now the trend is over. Most people who are investing in NFTs can't even sell their NFTs due there is no order book at all even there has some small order book the gap -99%.Forget NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "October 28, 2022, 04:28:07 PM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art. The craze for NFTs has been decreasing over the last few months. I like the NFT technology but not the way it is currently being used.The idea of combining something valuable to a crypto asset and using it on a blockchain is definitely fascinating.But I don't like the concept of people buying shit pictures and paying thousands and millions for it.There has to be a purpose for holding those pictures or you must be a person who loves collectibles other than that nobody would buy NFTs in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 28, 2022, 04:59:58 PM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art. It seems that they're like that and the hype of those before was greatly appreciated by many but not anymore today. As much as we want them anymore, as their value was high before, due to the bear market the price of those and its value is no longer the same as before. Even the picture that was minted seems to be worth nothing, they've got a value during the all time high and many have spent money on it honestly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DeathAngel",
      "created_time": "October 28, 2022, 05:30:55 PM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art. NFT’s were 2021 bull run version of the ICO craze from 2017. They’re basically a massive scam/ponzi. Nobody can tell me that a JPEG image can be worth hundreds of thousands of dollars. I don’t know if you can classify it as art, it’s a massive bubble though that’s not popped & will never recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoYar",
      "created_time": "October 28, 2022, 06:22:16 PM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art. Yes NFTs are also tokens  Non-fungible tokens But these are different from other tokens like ERC-20 or BEP-20. Let's say, for example, you want to sell an ERC20 or BEP-20 immediately, you only need to send it to an exchange (where that token is listed) and sell it at market price. However this is not the case with NFTs, you may have to wait weeks or even months to sell your NFT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptomaniac_xxx",
      "created_time": "October 28, 2022, 06:31:04 PM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art. Well you can call it like that, but it's more of an Art for the majority. And it have benefited artist more, if I'm not mistaken. So just imagine if you like art and then you are a crypto enthusiast, that is a win win already.However, not sure about what you mean by supply and demand. It's hype so if there is someone willing to invest thousands if not millions of dollars then it will continue to thrive even in a bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bananington",
      "created_time": "October 28, 2022, 06:41:17 PM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand.Your comparison only focuses on one aspect which is on \"obedience to the rule of supply and demand\", but did not consider others aspects like how they are traded and valued. There are close similarities between NFT's and Altcoins, but they still cannot be regarded as the same as they still have differences in some other aspects. NFT's are another innovation that people have had to consider in addition to investing in cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "el kaka22",
      "created_time": "October 28, 2022, 06:48:31 PM",
      "body": "NFT idea was that it would give someone an ownership, it wasn't about this what we have, it was about real art, and real things that you could have an ownership. To put it simply, when you buy a house, you are given a piece of paper that says that you own it right? Otherwise, how would we know who owns which house? In this situation the house is the art that we buy.However, if you create 10 thousand different styles of the same ape, and call it art? That’s not acceptable at all. People mistook what NFT was about, what it could do for you, and in return that caused a ton of people to make mistakes as well. I hope that in time that all would be fixed and we will have a better situation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "October 28, 2022, 06:56:08 PM",
      "body": "For me first nfts were acceptable and people doing their best to create a good art and unique one to sell it with prices that only big wallets can have them as personalities and footballers for example. Nowadays unfortunately we see people copying and posting stupid NFTs just to sell them and there's actually people buying copied pictures without doing their research. Now i believe the only NFTs worth to buy are those who are giving interest having them similar to staking or on P2E projects with NFTs stores.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lobo13hf",
      "created_time": "October 28, 2022, 11:47:01 PM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.I can't even agree with this. Since NFT was actually illiquid and it's a bit different compared with altcoins in the picture format. It's just a proof of ownership to the art. I would like to call that as a asset to prove if you are owning the art rather than token. Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMIt obeys the rules of supply and demand. NFTs seems more like Art. NFT basically related with art or every assets that can be converted to the art form just like gaming asset and etc. The supply and demand for NFT was actually came from how many people interested to own it. The value still remain unpredictable caused by it's based on people's view. The price can't be predicted. It depends on how people valuing it. The price actually depends on subjectivity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "October 29, 2022, 09:03:55 AM",
      "body": "Quote from: antsam on October 29, 2022, 07:52:31 AMI don't agree with saying that NFT is a work of art, because the purpose of NFT is to claim ownership but nowadays there are many who say art but are very similar. In my opinion, NFT should only be ownership of the access key to a service, so it's reasonable to appreciate itIts part of the nft. No nft isnt a form of arts except those jpeg file rocks that has been priced expensive. Well so much for that. A true nft signify an art when its made by people who knew how arts are recognized not by a developer who create nft solely for pump and dump purposes. If only nft could be limited to those supposedly purpose of it then it will be good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "October 29, 2022, 05:23:10 PM",
      "body": "Quote from: devil2man on October 29, 2022, 05:06:24 PMin fact, NFTs are the crossroads between art and altcoins, their markets are similar to those of crypto but it is much more difficult to make money with this type of buying and selling, is a niche market for collectorsWell it's a tokenized art, There are both inside the crypto space. I believe that their market is not the same given that NFTS don't have a pair for it to be able to sell and there are specific type of buyers in the market. I just don't agree that it is difficult to make money from buying and selling of NFTs. During the bull market, I have a friend who make a fortune just by buying and selling NFTs before and compared to me who is trading crypto tokens, He make way more at that time. Everything is driven by supply and demand, Both need demand. So if your asset doesn't have any demand, You shouldn't hope that you can sell at profit whether it's a crypto token or NFT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "November 02, 2022, 06:38:41 PM",
      "body": "Quote from: abel1337 on October 29, 2022, 05:23:10 PMQuote from: devil2man on October 29, 2022, 05:06:24 PMin fact, NFTs are the crossroads between art and altcoins, their markets are similar to those of crypto but it is much more difficult to make money with this type of buying and selling, is a niche market for collectorsWell it's a tokenized art, There are both inside the crypto space. I believe that their market is not the same given that NFTS don't have a pair for it to be able to sell and there are specific type of buyers in the market. I just don't agree that it is difficult to make money from buying and selling of NFTs. During the bull market, I have a friend who make a fortune just by buying and selling NFTs before and compared to me who is trading crypto tokens, He make way more at that time. Everything is driven by supply and demand, Both need demand. So if your asset doesn't have any demand, You shouldn't hope that you can sell at profit whether it's a crypto token or NFT. During the bull market you could make money from buying and selling many things and NFT is not unique in that regard, but looking at the bear market they are not really as good as they used to be, just like everything else. NFT is just an idea and right now people are filled with ideas and they do not want to invest into them, they want to invest into something that has utility. It means it doesn't matter if it’s a coin or a token or an nft, as long as it has a utility that people are willing to spend money on then it would make sense, otherwise it’s not going to make sense too much to anyone and nobody will invest into it since it would not have any use case at all and no reason to buy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eaLiTy",
      "created_time": "November 02, 2022, 07:22:50 PM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art. I am curious to know how many NFT you are holding and what is the use case and will you be getting the same valuation if you want to sell them. The hype was good and some were able to make quick money while it lasted. If an NFT can be used inside a game then it would be great and that could be valuable, other than that what is the point in holding these pictures worth huge amounts  . I was riding the NFT hype but now i have second thoughts on its future .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "November 02, 2022, 07:28:24 PM",
      "body": "Quote from: Famous Grouse on October 28, 2022, 08:26:34 AMNfts are altcoins in pictures format.It obeys the rules of supply and demand. NFTs seems more like Art. Most NFTs are a big scam, and now many NFTs have lost more than 90% in price. Many altcoins also lost more than 90% in price, but altcoins have an idea, a blockchain, a community. I buy promising altcoins because their price will rise, for example, the polkadot project. And most of the NFT projects will die, but the users will have a picture for memory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}