{
  "id": "topic_5405055",
  "title": "alexey14",
  "author": "alexey14",
  "created_time": "July 03, 2022, 08:56:18 PMLast edit: July 04, 2022, 01:31:11 PM by alexey14",
  "content": "Hello everyone, Want to share some of my research since   2017 with you here,Im a researcher in Crypto space , market manipulation. What I found was shock for me but truePlan B is CIA agent, I understand you want to ask me for proof , At the same time You need to understand I cannot share everything here with you but I try to give you some details:Plan B is one of the most famous person on Twitter, of course he never say anything bad about BTC, that doesn't mean you should believe him, I explain everything and You judge and thinkBack to 2021, He correctly predicted the price of btc in several months in 2021.  But it wasn't because of s2f, these were information from cia that he had a duty to share with you.Who is Plan B:A CIA agent and His only task Is to trick people into buying Bitcoin at high prices and not selling it when the price reached its peak, He did it successfully in 2021.He bought some trust  by   correctly  price prediction to finally trick you,he predicted a price of btc at 65,000 in November 2021 and above 100K in December, at the same time, in December, when the price fell so much that he did not admit the failure of his model until the price reached its lowest value. He not allowed to show his face. thats the rule for him by CIA.Whole S2F created by CIA.There are lot of people in crypto space who predicte price thats normal, they can be wrong or not, But Im talking about famous S2F model.  This is not the place where I share confidential information with you.Tried to give you some details only.last note: there are more CIA agent in Crypto space, Plan B only is one of them, I cant share all of them, Such informations are not for free.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5405055",
  "comments": [
    {
      "author": "edgycorner",
      "created_time": "July 03, 2022, 09:06:32 PM",
      "body": "This is some /pol posting. These conspiracies are more apt at 4chan rather than bitcointalk lolhttps://www.youtube.com/watch?v=AbG6u86t4bAI will still bite, what does CIA gain by doing this? Why \"CIA\"??   I can see a hedge fund profiting through this tactic but not CIA lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "July 03, 2022, 09:15:45 PMLast edit: July 03, 2022, 10:24:32 PM by franky1",
      "body": "seems someone is smoking the glue tonight and entertaining himself with tin foil fashion accessoriesi see this going three ways. 1. he then seeks people to donate to him to become a special members club to get the info he hides(scam).2. he overdoses and calls an ambulance(he sounds really stoned so good chance of this result)3. he offers out some hearsay from his CIA supposed source about a new pump and dump that people should get in on... you know the story\"guy X told me the price will be Y and it got to Y.. and now he tells me that next month it will be Z so everyone should pump to Z.. but dont blame the messenger, i didnt say it secret mystery man did\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "July 03, 2022, 09:17:38 PM",
      "body": "Quote from: alexey14 on July 03, 2022, 08:56:18 PMHello everyone, Want to share some of my research since   2017 with you here,i don't see any research in this post. Just speculation with hope that people will believe your crap.QuoteIm a researcher in Crypto space , market manipulation.ProveQuoteAt the same time You need to understand I cannot share everything here with you but I try to give you some details:The don't fuckin' post at all. Who forced you to post this?Quote from: alexey14 on July 03, 2022, 08:56:18 PMThis is not the place where I share confidential information with you.Tried to give you some details only.And you thought we were going to believe this nonsense?Thanks for wasting your time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gozie51",
      "created_time": "July 03, 2022, 09:19:01 PM",
      "body": "Rather than making such confusion and allegation, I think you can state clearly what it is. Well I can't say for you or everyone but I believe after a while on bull, there will be some correction or by extension bear. If we are on bear now it may have been caused by whatever means but I don't expect that price keep pushing up without a bear season also expected. Checking the history from 2017 and 2018, is no different what is happening.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexey14",
      "created_time": "July 03, 2022, 09:29:09 PM",
      "body": "Quote from: logfiles on July 03, 2022, 09:17:38 PMQuote from: alexey14 on July 03, 2022, 08:56:18 PMHello everyone, Want to share some of my research since   2017 with you here,i don't see any research in this post. Just speculation with hope that people will believe your crap.QuoteIm a researcher in Crypto space , market manipulation.ProveQuoteAt the same time You need to understand I cannot share everything here with you but I try to give you some details:The don't fuckin' post at all. Who forced you to post this?Quote from: alexey14 on July 03, 2022, 08:56:18 PMThis is not the place where I share confidential information with you.Tried to give you some details only.And you thought we were going to believe this nonsense?Thanks for wasting your time.You are not the one I want to prove anything to you and your barin that spam every day to make a few $ with that signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "July 04, 2022, 12:39:29 AM",
      "body": "alexey14 is a NSA disinformation agent. I have proof but I cannot reveal it here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "July 04, 2022, 02:32:27 AM",
      "body": "One of the many things that is quite entertaining is that when something can be on the hands of the people...there will always be conspiracy theories and with its nature it would be so hard to prove something from facts and from delusional ideas. Anyway, I think we should just take this \"Plan B\" thing as just a good entertainment while we are waiting for the whole crypto industry to get out from the winter stage. Now, come one come all let's hear more laughable conspiracy theories here...am all eyes and ears for them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "July 04, 2022, 02:59:24 AM",
      "body": "I thought I would be reading something with substantial backing but what the heck is this? Only because he predicted the price he is already a CIA. LOLHere's something that one should think about which we may have been lured into crypto because they know they can also grab to control the crypto space in the end when all have already registered to a platform or at least one of a platform which they can soon also regulate including the DEX. Lets just think about the servers where websites are hosted that CIA can find. No such thing as privacy, the government was the one even creating this TOR which was once used by military. Anyone used Pegasus too? When  all are KYCed, our data are taken. Today data is more important for an imperialist. But of course this can still be conspiracy theory.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "July 04, 2022, 03:38:09 AM",
      "body": "To be honest, there are a lot of popular cryptocurrency users over the internet, and Plan B is one of them but why are you only accusing Plan B?And another thing is even if it is true that Plan B is a CIA Agent, who cares? Anyone can give predictions especially by creating an anonymous profile on different social media platforms, it's easy to say Bitcoin will go to $100,000 or $0.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 04, 2022, 10:25:47 AM",
      "body": "What is it that everyone turns out to be a CIA Agent in crypto world? It's this Plan B's plan b? Lol, when his S2F model fails then we need some shills and spread the news that he is indeed a CIA agent to distract everyone from him?So yeah, I don't believed anything that the OP says here, it doesn't make sense at all. Let's just admit that the model was good until it didn't work as the price didn't reach $100k obviously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "July 04, 2022, 10:36:58 AM",
      "body": "Quote from: alexey14 on July 03, 2022, 08:56:18 PMPlan B is CIA agent, I understand you want to ask me for proof , At the same time You need to understand I cannot share everything here with you but I try to give you some details:[~snip~]last note: there are more CIA agent in Crypto space, Plan B only is one of them, I cant share all of them, Such informations are not for free.The fact the man (or woman) got some predictions right may or may not mean anything. (Why CIA agent and not professional see-in-stars-and-predict-in-coffee type of person that may travel with the circus?)And the fact some may be CIA agents is obvious for two reasons:* on can have a steady job, even at CIA, and still be interested in crypto* CIA can have \"legitimate interest\" in keeping an eye on this \"movement\"Sorry OP, you managed to say... nothing...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "July 04, 2022, 11:42:05 AM",
      "body": "Just take a look at the OP's account. Everything that he saw in a dream, he hastened to report here.Yesterday,  woke up and ran to reveal secrets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexey14",
      "created_time": "July 04, 2022, 01:09:27 PM",
      "body": "Quote from: lovesmayfamilis on July 04, 2022, 11:42:05 AMJust take a look at the OP's account. Everything that he saw in a dream, he hastened to report here.Yesterday,  woke up and ran to reveal secrets.Im not spammer here like  you, you spam here 24/7 for a few cent because of your signature.Im a researcher not signature promoter. I have no respect for people who spam here to promote their signature here.So you dont deserve  my answer and my time.IF anyone want to ask some question, I only answer to people without signature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alexey14",
      "created_time": "July 04, 2022, 01:14:28 PM",
      "body": "hedge fund Cant predict price in market correctly, Only Cia can do this, Not always but sometime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "July 04, 2022, 06:32:29 PM",
      "body": "Quote from: alexey14 on July 04, 2022, 01:14:28 PMhedge fund Cant predict price in market correctly, Only Cia can do this, Not always but sometime.If that's the case how come his latest prediction on btc was not accurate? was that done on purpose to further deceive people? if he is a CIA agent as you claim he should have made the right prediction in this bull run, am sure you miss all the negative feedbacks his twitter followers gave him for that, some even suggest he should give up. Anyways, i think you are posting in the wrong platform, i doubt many forum many members pay much attention to PlanB. your post will be best received in twitter.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "darkangel11",
      "created_time": "July 04, 2022, 06:43:04 PM",
      "body": "Quote from: alexey14 on July 04, 2022, 01:14:28 PMhedge fund Cant predict price in market correctly, Only Cia can do this, Not always but sometime.It's a well known thing that if you correctly predict the price even once you get a ton of subscribers on twitter and other social media, people will want to interview you, they will write articles about you, they will want you to manage their money. That's why so many youtubers try to do it. They are wrong a few times but then they get it right and do you know what the next step is? They start selling courses, set up private trading groups, sell trading signals, advertise various brands on their channels. I will not say all of them are scammers but all of them are wannabe scammers. They will want to make money that's why they're doing it and there's a lot of money to be made if you make people believe you know what the price is going to be next year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "July 04, 2022, 07:33:51 PM",
      "body": "Quote from: alexey14 on July 03, 2022, 08:56:18 PMI cant share all of them, Such informations are not for free.Lets assume I decide to pay you to spill all the information, how is this information you have going to benefit me?, i mean, what exactly will i gain from this information, what kind of benefits is attached to it since you said such informations are not for free?Well, who ever plan b is is non of my business, and what ever business you have following him or her on twitter is your cup of tea, He can be CIA like you said, or even an FBI, how really is that our business here? Sorry but i am kind of disappointed at your choice of what to research, there are far more profitable things to research on than wasting your time stalking some one you don't even know on twitter and tagging them what they probably might not even be close to being.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "July 04, 2022, 07:53:01 PM",
      "body": "Quote from: alexey14 on July 04, 2022, 01:09:27 PMIm not spammer here like  you, you spam here 24/7 for a few cent because of your signature.Why are you calling everyone a spammer if they make posts against you? We aren't saying you aren't a researcher. Whatever you are, we don't have business with that. You wrote and we read, we have the right to write as well. It may go against you or support you. But you should support your post with some evidence.Quote from: alexey14 on July 03, 2022, 08:56:18 PMI cant share all of them, Such informations are not for free.Who asked to make you a post about the CIA or whatever. It's up to you, no one gonna pay you for that shit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goldkingcoiner",
      "created_time": "July 04, 2022, 08:16:13 PMLast edit: July 04, 2022, 08:36:41 PM by goldkingcoiner",
      "body": "Well, I was wondering whether or not I should post a reply due to the fact that the entire thread is completely unproductive and should be in the off topic section of some other, smaller and less known forum but who am I to deny a good old fashioned schizo thread?I very much doubt Plan B is a CIA agent. That would mean Bitcoin was developed by the CIA.... That can't be true, right? I refuse to believe the CIA could ever possess the intellect or the will power necessary to think of something like Blockchain. All they really do is interfere in elections, plan coups and topple governments of foreign countries whenever it suits the US's geopolitic interests.In all seriousness, Plan Bs S2F model is just basically the approximation of the logarithmic prediction of Bitcoin. Simple but misguided mathematics with a fancy title. Absolutely nothing special nor original about his predictions. I prefer keeping an eye on the logarithmic chart.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}