{
  "id": "topic_5530221",
  "title": "CryptSafe",
  "author": "CryptSafe",
  "created_time": "February 11, 2025, 12:14:09 PM",
  "content": "I was doing some research on Bitcoin and I came across a quote compiled by a website concerning Hal Finneys future prediction as it relates to Bitcoin and its acceptability in the world. Today, the majority of what he said back then has started taking shape as we can see them in the crypto space and the government actions as well. Here is one of all he said during the early years of Bitcoin's inception;Quote I see Bitcoin as ultimately becoming a reserve currency for banks, playing much the same role as gold did in the early days of banking. Banks could issue digital cash with greater anonymity and lighter weight, more efficient transactions.  Here, it is the government that has finally taken bold steps to make Bitcoin a national reserve which Hal already envisioned. It already started with El Salvador as the first country in the world to make Bitcoin a national reserve and now some nations are beginning to make such bold steps seeing the benefits of making Bitcoin a national reserve. Donald Trump during his campaign made a promise to make sure the US has a Bitcoin national reserve which he is currently working on and going by this, some other nations have taken the step to do such which is very commendable. If this approach persists, we could see bitcoin value triple its current value, making it compete with gold as it already did in the past irrespective of its price fluctuation.The prediction of Bitcoin hitting a million dollars has long been predicted by Hal who said; QuoteSince we’re all rich with bitcoins, or we will be once they’re worth a million dollars like everyone expects, we ought to put some of this unearned wealth to good use.Hal seeing how wealthy people could be as a result of holding Bitcoin when it gets to a million dollars, encourages an even distribution of wealth in the community to help in further development so that everyone could feel the impact of Satoshi innovation on the world.  I believe Bitcoin would get to that price as said by Hal but it would take some time to achieve because it seems that Bitcoin is still at its early stage of adoption and the world has yet to fully adopt it with countries integrating it into their economy.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5530221",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "February 11, 2025, 02:51:09 PM",
      "body": "You should put a link to the source, it is clear that you are quoting but if you simply put the quote without a link you force us to search to check if the quote is correct. I for one would like to know when he said that. After searching I have seen this article for example:Hal Finney on Bitcoin: In His Own WordsIt is clear that he had a good vision of what bitcoin could be in the future, since making predictions you are usually wrong, but he understood very well what was being born when at that time almost nobody understood it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "February 11, 2025, 03:03:41 PM",
      "body": "Quote from: CryptSafe on February 11, 2025, 12:14:09 PMI was doing some research on Bitcoin and I came across a quote compiled by a website concerning Hal Finneys future prediction as it relates to Bitcoin and its acceptability in the world. Today, the majority of what he said back then has started taking shape as we can see them in the crypto space and the government actions as well. Here is one of all he said during the early years of Bitcoin's inception;You can get more from his emails with Satoshi Nakamoto.https://www.wsj.com/public/resources/documents/finneynakamotoemails.pdfAnother forum member was quicker than you by creating Hal Finney predicted Bitcoin banks, how does the software look like? for similar discussion on Bicoin bank, reserve.Bitcoin in 2009 and 2025 are different after many technical upgrades and Hal Finney vision can be no longer applicable in 2025.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "February 11, 2025, 05:05:27 PM",
      "body": "Quote from: Free Market Capitalist on February 11, 2025, 02:51:09 PMYou should put a link to the source, it is clear that you are quoting but if you simply put the quote without a link you force us to search to check if the quote is correct. I for one would like to know when he said that. After searching I have seen this article for example:Hal Finney on Bitcoin: In His Own WordsIt is clear that he had a good vision of what bitcoin could be in the future, since making predictions you are usually wrong, but he understood very well what was being born when at that time almost nobody understood it. Thank you for making out time to read and comment on my thread. I am glad you did, I had to quote the phrase for visibility so that my illustrations or explanation could make meaning with the message I was trying to pass across. However, I did attach the link to my source through which I got the information for further reference if in case should any member wants to read further. If you read the first sentence where you have the word website, you can see that the word was embedded with a link so that as you click it, it would take you directly to the source where the information was culled from. Following your input and advice, I will provide the link to the sources here for clarity so that it would be visible for all to see and also access it to read. Source",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "February 11, 2025, 05:40:58 PM",
      "body": "Hal didn't live to see his vision become a reality but what matters is that he was right and will continue to be right on a lot of things in the context of bitcoin. He saw the future, crafted some part of it, prepared for it and told the world for those who cared to listen about it. Eventually, many countries will adopt bitcoin as a reserve, they are waiting on the US to come out with their final report before they follow suit. We should keep on holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "February 11, 2025, 05:42:45 PM",
      "body": "Quote from: SquirrelJulietGarden on February 11, 2025, 03:03:41 PMQuote from: CryptSafe on February 11, 2025, 12:14:09 PMI was doing some research on Bitcoin and I came across a quote compiled by a website concerning Hal Finneys future prediction as it relates to Bitcoin and its acceptability in the world. Today, the majority of what he said back then has started taking shape as we can see them in the crypto space and the government actions as well. Here is one of all he said during the early years of Bitcoin's inception;You can get more from his emails with Satoshi Nakamoto.https://www.wsj.com/public/resources/documents/finneynakamotoemails.pdfAnother forum member was quicker than you by creating Hal Finney predicted Bitcoin banks, how does the software look like? for similar discussion on Bicoin bank, reserve.Bitcoin in 2009 and 2025 are different after many technical upgrades and Hal Finney vision can be no longer applicable in 2025.Bitcoin in 2009 and Bitcoin in 2025 are indeed different, but I wouldn't say that disproves Hal's vision at all.  If anything, it does the opposite.  These changes in Bitcoin you've observed over the last 15+ years have moved Bitcoin into becoming more of a store of value like Hal said, and less of a peer to peer currency like was believed would be the case 10+ years ago when Hal was making these comments.  It shows that he not only saw what was to come, but how the market would react.  Most people can't do that second part, which is why most predictions fail in my opinion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "February 11, 2025, 06:36:00 PM",
      "body": "Quote from: CryptSafe on February 11, 2025, 12:14:09 PMI was doing some research on Bitcoin and I came across a quote compiled by a website concerning Hal Finneys future prediction as it relates to Bitcoin and its acceptability in the world. Today, the majority of what he said back then has started taking shape as we can see them in the crypto space and the government actions as well. Here is one of all he said during the early years of Bitcoin's inception;Quote I see Bitcoin as ultimately becoming a reserve currency for banks, playing much the same role as gold did in the early days of banking. Banks could issue digital cash with greater anonymity and lighter weight, more efficient transactions.  Some of the prophesies are coming to pass already, it may not be all, as such that we have bitcoin not been supported by most of the banks due to government regulations over it uses, but being a digital gold and so on is part of the reality we have seen today, more are still coming to be as time goes by, because the world are getting to know more better about the influence and usefulness of bitcoin in this modern economy, i will say that Finney is right about all these, but not all are manifesting already, it may still take more little time and efforts to get all these achieved completely.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "February 11, 2025, 08:17:31 PM",
      "body": "Quote from: CryptSafe on February 11, 2025, 12:14:09 PMDonald Trump during his campaign made a promise to make sure the US has a Bitcoin national reserve which he is currently working on and going by this, some other nations have taken the step to do such which is very commendable.But is it really commendable though?  They were all screaming and shouting at Bitcoin for being this and that and calling it out for dying all the time but when The United States decides to possibly add it to their national reserve everybody else claps their hands like seals on a shore.I would not commend fake appreciation too much.  All the countries following what United States does blindly will disregard Bitcoin as soon as The United States says they will.  They do not see a potential in BITCOIN.  They see a possibility of gathering more profit, more money.  That is it.It is like commending everybody who is in to Bitcoin for purchasing it, although they clearly specify money is the only reason and they are not here long term.  Good for you and definitely a good financial choice, but I would rather commend somebody who truly knows what they are putting their money in to and has a wider perspective than just 'Bitcoin in, wallet big'.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dave1",
      "created_time": "February 12, 2025, 12:55:17 AM",
      "body": "Quote from: Davidvictorson on February 11, 2025, 05:40:58 PMHal didn't live to see his vision become a reality but what matters is that he was right and will continue to be right on a lot of things in the context of bitcoin. He saw the future, crafted some part of it, prepared for it and told the world for those who cared to listen about it. Eventually, many countries will adopt bitcoin as a reserve, they are waiting on the US to come out with their final report before they follow suit. We should keep on holding. Yes, we was a true visionary and that's why he really belief on Satoshi since day one and even run one of the very first node in Bitcoin's history. And obviously, he knows that something big in the future are going to happen with Satoshi's invention that's why he is very supportive of it.But let's see about the strategic bitcoin reserve narrative, I mean Trump says he want's US to do it. And I think if this happens, it will really push the price to a new all time high this bull run. However, it's not going to be easy to implement. However, we gonna see within his power, how Trump will able to make US big with this narrative.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "February 12, 2025, 02:12:32 AM",
      "body": "Another artifact of Hal Finney's genius. He was a marvelous man who should be preserved in history as one of the greatest pioneers in our lifetimes. It is such a shame he is not here today or in the future, to see how far his legacy ha come.Am I the only one who believes Hal is Satoshi? If we read between the lines, he received the first Bitcoin transaction, he understood the gravity of Bitcoin and the effect it would have on the world, he was a computer scientist and capable of creating such an invention, and even contributed to early works on proof of work systems. Seems like enough evidence to me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "retreat",
      "created_time": "February 12, 2025, 03:13:35 AM",
      "body": "Quote from: BenCodie on February 12, 2025, 02:12:32 AM-snip-Am I the only one who believes Hal is Satoshi? If we read between the lines, he received the first Bitcoin transaction, he understood the gravity of Bitcoin and the effect it would have on the world, he was a computer scientist and capable of creating such an invention, and even contributed to early works on proof of work systems. Seems like enough evidence to me  I don't think he was Satoshi, but I am 100% sure that he was related to \"Satoshi\" and knew who he was. He was an early adopter of Bitcoin and one of the people who contributed greatly to the early days of Bitcoin. His vision for Bitcoin is something to behold - he wrote a lot about Bitcoin and what he said about it was absolutely true. I wish he could have seen everything he said about Bitcoin come to fruition, but it's a shame he died without seeing it. RIP.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "February 12, 2025, 03:18:39 AM",
      "body": "Quote from: OgNasty on February 11, 2025, 05:42:45 PMBitcoin in 2009 and Bitcoin in 2025 are indeed different, but I wouldn't say that disproves Hal's vision at all.  If anything, it does the opposite.  These changes in Bitcoin you've observed over the last 15+ years have moved Bitcoin into becoming more of a store of value like Hal said, and less of a peer to peer currency like was believed would be the case 10+ years ago when Hal was making these comments.  It shows that he not only saw what was to come, but how the market would react.  Most people can't do that second part, which is why most predictions fail in my opinion.I agree and disagree with you.I remember that the Bitcoin founder, Satoshi Nakamoto, in his emails to Hal Finney, Sirius (Martti Malmi) and other Cypherpunks, shown a vision that he did not want Bitcoin becoming something compete or challenge directly to fiat currencies and governments. It can be his true vision or just his words to reduce risk of attacks from governments.https://mmalmi.github.io/satoshi/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "February 12, 2025, 04:12:20 AM",
      "body": "We are not going back to or even near the gold standard though because it is impossible at this point because of the sheer amount of fiat the governments have printed! One or two governments may add more gold and now some bitcoin to their reserves but fiat is still not going to be backed by any of it the way it used to.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pi-network314159",
      "created_time": "February 12, 2025, 04:21:59 AM",
      "body": "Quote from: CryptSafe on February 11, 2025, 12:14:09 PMI was doing some research on Bitcoin and I came across a quote compiled by a website concerning Hal Finneys future prediction as it relates to Bitcoin and its acceptability in the world. Today, the majority of what he said back then has started taking shape as we can see them in the crypto space and the government actions as well. Here is one of all he said during the early years of Bitcoin's inception;Quote I see Bitcoin as ultimately becoming a reserve currency for banks, playing much the same role as gold did in the early days of banking. Banks could issue digital cash with greater anonymity and lighter weight, more efficient transactions.  That's actually true, the dream of Hal finney is coming into reality. Many speculations made by different people concerning Bitcoin is gradually comming into reality, both Bitcoin price prediction and massive adoption prediction. More prediction will emerge as predicted. We should just take advantage by mitigating this opportunity that Bitcoin is low in price and accumulate more because with time Bitcoin market cap will increase alongside with it's price and there will be a lot of regret when it atain that height, so now is the best time than regretting later when we surpass this price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 12, 2025, 05:16:08 AM",
      "body": "Hal Finney's predictions about Bitcoin and its acceptance in the world seemed unbelievable at the time, it was hard to find anyone at that time except Satoshi and Hal Finney who could believe in the future of Bitcoin.Changing history needs great men with insight into the future like Satoshi and Hal Finney.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "February 12, 2025, 07:08:43 AM",
      "body": "Quote from: CryptSafe on February 11, 2025, 12:14:09 PMI was doing some research on Bitcoin and I came across a quote compiled by a website concerning Hal Finneys future prediction as it relates to Bitcoin and its acceptability in the world. Today, the majority of what he said back then has started taking shape as we can see them in the crypto space and the government actions as well. We should take it easy and let the first Bitcoin's world reserve start and also give it time for it to be successful. Talk is cheap and all these predictions that happen at times to be true are mostly gambles, and as we know, gambling will either happen as predicted or otherwise. This explains why the majority of predictions are false but people tend to emphasise too much on the few that happened. But still, we are only smelling the reserve of a thing, it hasn't happened and I doubt if it will be successful.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "February 12, 2025, 07:22:09 AM",
      "body": "Quote from: retreat on February 12, 2025, 03:13:35 AMQuote from: BenCodie on February 12, 2025, 02:12:32 AM-snip-Am I the only one who believes Hal is Satoshi? If we read between the lines, he received the first Bitcoin transaction, he understood the gravity of Bitcoin and the effect it would have on the world, he was a computer scientist and capable of creating such an invention, and even contributed to early works on proof of work systems. Seems like enough evidence to me  I don't think he was Satoshi, but I am 100% sure that he was related to \"Satoshi\" and knew who he was. He was an early adopter of Bitcoin and one of the people who contributed greatly to the early days of Bitcoin. His vision for Bitcoin is something to behold - he wrote a lot about Bitcoin and what he said about it was absolutely true. I wish he could have seen everything he said about Bitcoin come to fruition, but it's a shame he died without seeing it. RIP.Agreed.We don't need another HBO film about him being the one and only.. Let the man rest and rest well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "February 12, 2025, 01:07:51 PM",
      "body": "Quote from: OgNasty on February 11, 2025, 05:42:45 PMQuote from: SquirrelJulietGarden on February 11, 2025, 03:03:41 PMQuote from: CryptSafe on February 11, 2025, 12:14:09 PMI was doing some research on Bitcoin and I came across a quote compiled by a website concerning Hal Finneys future prediction as it relates to Bitcoin and its acceptability in the world. Today, the majority of what he said back then has started taking shape as we can see them in the crypto space and the government actions as well. Here is one of all he said during the early years of Bitcoin's inception;You can get more from his emails with Satoshi Nakamoto.https://www.wsj.com/public/resources/documents/finneynakamotoemails.pdfAnother forum member was quicker than you by creating Hal Finney predicted Bitcoin banks, how does the software look like? for similar discussion on Bicoin bank, reserve.Bitcoin in 2009 and 2025 are different after many technical upgrades and Hal Finney vision can be no longer applicable in 2025.Bitcoin in 2009 and Bitcoin in 2025 are indeed different, but I wouldn't say that disproves Hal's vision at all.  If anything, it does the opposite.  These changes in Bitcoin you've observed over the last 15+ years have moved Bitcoin into becoming more of a store of value like Hal said, and less of a peer to peer currency like was believed would be the case 10+ years ago when Hal was making these comments.  It shows that he not only saw what was to come, but how the market would react.  Most people can't do that second part, which is why most predictions fail in my opinion.Hal saw the future and also how the market would react to bitcoin in years to come and today all he said is happening as bitcoin is long past that level of a peer-to-peer currency but a store of value which nations, organizations, and people are beginning to adopt. Years back when Bitcoin was yet to be adopted by many it was it was of lesser value which no one envisaged but only Hal saw it and he was outspoken about it here we are bitcoin is worth thousands of dollars and still counting. I still believe it would get to a million dollars but it would take a little time just like it did before it touched a hundred thousand dollars.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "February 13, 2025, 01:57:43 AM",
      "body": "Quote from: retreat on February 12, 2025, 03:13:35 AMQuote from: BenCodie on February 12, 2025, 02:12:32 AM-snip-Am I the only one who believes Hal is Satoshi? If we read between the lines, he received the first Bitcoin transaction, he understood the gravity of Bitcoin and the effect it would have on the world, he was a computer scientist and capable of creating such an invention, and even contributed to early works on proof of work systems. Seems like enough evidence to me  I don't think he was Satoshi, but I am 100% sure that he was related to \"Satoshi\" and knew who he was. He was an early adopter of Bitcoin and one of the people who contributed greatly to the early days of Bitcoin. His vision for Bitcoin is something to behold - he wrote a lot about Bitcoin and what he said about it was absolutely true. I wish he could have seen everything he said about Bitcoin come to fruition, but it's a shame he died without seeing it. RIP.Very well said. Whatever the case, may he rest in peace.Quote from: john_egbert on February 12, 2025, 07:22:09 AMQuote from: retreat on February 12, 2025, 03:13:35 AMQuote from: BenCodie on February 12, 2025, 02:12:32 AM-snip-Am I the only one who believes Hal is Satoshi? If we read between the lines, he received the first Bitcoin transaction, he understood the gravity of Bitcoin and the effect it would have on the world, he was a computer scientist and capable of creating such an invention, and even contributed to early works on proof of work systems. Seems like enough evidence to me  I don't think he was Satoshi, but I am 100% sure that he was related to \"Satoshi\" and knew who he was. He was an early adopter of Bitcoin and one of the people who contributed greatly to the early days of Bitcoin. His vision for Bitcoin is something to behold - he wrote a lot about Bitcoin and what he said about it was absolutely true. I wish he could have seen everything he said about Bitcoin come to fruition, but it's a shame he died without seeing it. RIP.Agreed.We don't need another HBO film about him being the one and only.. Let the man rest and rest well. I completely agree. Definitely not trying to start another wave of publicity on the topic, was just having a quiet discussion about it within the topic.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}