{
  "id": "topic_5448174",
  "title": "Bitomic",
  "author": "Bitomic",
  "created_time": "April 09, 2023, 06:00:37 PM",
  "content": "Hi everyone, I wanted a simple to use, easily customizable alerting system for price alerts as well as alerts when new coins are listed on exchanges. That's why I built Bitomic.io .To access the price and listing alerts you can go to: https://bitomic.io/explore/  then select any coin and it should take you to the coin page. You can then scroll down to access alerts Could you guys give me some useful feedback on how it can be improved before I actually launch the product on ProductHunt. I figured these cryptocurrency forums are the best place to ask for feedback as people who are actively involved in crypto are here. What features would you like in your own price alerting app?Thanks in advance! (I am also new here so don't know the guidelines for asking for help on such a topic without sounding spammy. )",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448174",
  "comments": [
    {
      "author": "Ndabagi01",
      "created_time": "April 09, 2023, 08:39:11 PM",
      "body": "Your website looks good, but if you can improve your user experience design, it will look even better. I went through the website where one can activate price alerts and saw many big exchanges there, but you didn't include Binance in the list; do you intend to add it? I believe that many people use that exchange, like the other ones listed. Also, instead of scrolling down to the bottom before seeing where to click on price alert, adding a search button to the home page to easily search for coin to add to price list will be better. Using the website for only price and listing alerts will make it appear bored, and I doubt you'll get more traffic, why not consider adding other features that will entice people to the website.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitomic",
      "created_time": "April 09, 2023, 10:30:46 PM",
      "body": "Quote from: Ndabagi01 on April 09, 2023, 08:39:11 PMYour website looks good, but if you can improve your user experience design, it will look even better. I went through the website where one can activate price alerts and saw many big exchanges there, but you didn't include Binance in the list; do you intend to add it? I believe that many people use that exchange, like the other ones listed. Also, instead of scrolling down to the bottom before seeing where to click on price alert, adding a search button to the home page to easily search for coin to add to price list will be better. Using the website for only price and listing alerts will make it appear bored, and I doubt you'll get more traffic, why not consider adding other features that will entice people to the website.Hey Ndabagi, really appreciate the feedback. Those are some helpful suggestions! I do plan on adding Binance (and more exchanges) asap, it is the most popular exchange. Only reason I haven't is because my backend is in a region that Binance has blocked so I need to launch an additional backend in a different region.You are right, there is some work to do to improve user experience. Adding a coin search feature on the home page is a good idea. It needs to be easier to find the coin you are looking for. I'll get on that.Also, yes I agree just having price and listing alerts would be boring. Some features planned for the near future:Ability to create alerts for almost anything (Technical indicators, volume, many more metrics)Portfolio tracking, management and alertsStrategy back testingThanks again for the feedback!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "April 10, 2023, 08:14:01 AM",
      "body": "Quote from: Bitomic on April 09, 2023, 06:00:37 PMHi everyone, I wanted a simple to use, easily customizable alerting system for price alerts as well as alerts when new coins are listed on exchanges. That's why I built Bitomic.io .To access the price and listing alerts you can go to: https://bitomic.io/explore/  then select any coin and it should take you to the coin page. You can then scroll down to access alerts Could you guys give me some useful feedback on how it can be improved before I actually launch the product on ProductHunt. I figured these cryptocurrency forums are the best place to ask for feedback as people who are actively involved in crypto are here. What features would you like in your own price alerting app?I'm also so unattractive that first impressions when using your website are because in the experience the design and colors you use are too old or plain so it seems like nothing special and may I be honest it looks more like web design 2015 and below, maybe you will too Enter some additional colors to make it more attractive.It would be better if you provide a trading view feature for users to analyze price patterns, I think this will make it easier for us to determine price alerts without having to go back and forth to platforms that have a trading view feature.If I may one more suggestion is can you please add an option on the bitcoin calculator board to add local or fiat currency and I think it would be great if not only bitcoins in the calculator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "April 10, 2023, 08:19:57 AM",
      "body": "Here are some issues I found:- The maximum alerts field error is showing on top of the \"Note\". Also, if I write 8 for example, it's impossible to delete it afterward to write something else, I need to first select the whole number and type. I understand that you don't want the user to set a value of less than 0 but this is a very bad UX. I would delay showing the error as the user types, and also disable the create an alert button if certain criteria are not met.- The footer is broken? I tried multiple browsers.- Creating an alert is not working. Nothing happens when I click the button.- On the signup page, the button says \"Sign in\" and when typing new credential, it says that the email or password is invalid which doesn't make much sense.Suggestions:- Support social login (including login with MetaMask and WalletConnect).- I don't know if this is supported yet since I couldn't create an account/alert, but you should definitely consider supporting telegram alerts if you haven't.Also, I'm curious. How many alerts can the user create and are you planning to provide this service for free?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "April 10, 2023, 09:57:35 AM",
      "body": "Quote from: Bitomic on April 09, 2023, 06:00:37 PMHi everyone, I wanted a simple to use, easily customizable alerting system for price alerts as well as alerts when new coins are listed on exchanges. That's why I built Bitomic.io .To access the price and listing alerts you can go to: https://bitomic.io/explore/  then select any coin and it should take you to the coin page. You can then scroll down to access alerts Could you guys give me some useful feedback on how it can be improved before I actually launch the product on ProductHunt. I figured these cryptocurrency forums are the best place to ask for feedback as people who are actively involved in crypto are here. What features would you like in your own price alerting app?Thanks in advance! (I am also new here so don't know the guidelines for asking for help on such a topic without sounding spammy. )I am a bit confused here as when you go to  https://bitomic.io/explore/, you wil find all the stuff related to charts and price actions but if you go to https://bitomic.io/ it takes you to the page where we can join the waitlist. Now, what is that backtesting platform which you are going to launch? If it will be great if you can tell me something about it. As far as the price alerts are concerned, they are useful. Also how about sending a sms alert too and/or developing a mobile app so the notification can be sent on the mobile screen about price alerts? It's not very convenient to open an email every time there is a price alert.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitomic",
      "created_time": "April 10, 2023, 12:13:28 PM",
      "body": "Quote from: Dickiy on April 10, 2023, 08:14:01 AMI'm also so unattractive that first impressions when using your website are because in the experience the design and colors you use are too old or plain so it seems like nothing special and may I be honest it looks more like web design 2015 and below, maybe you will too Enter some additional colors to make it more attractive.It would be better if you provide a trading view feature for users to analyze price patterns, I think this will make it easier for us to determine price alerts without having to go back and forth to platforms that have a trading view feature.If I may one more suggestion is can you please add an option on the bitcoin calculator board to add local or fiat currency and I think it would be great if not only bitcoins in the calculator.Damn, some harsh words about my web design. I hear you though, the site could use some more color and a bit better styling.Not 100% I understand what you mean about the trading view feature. Do you just want to see a trading view chart on the site instead of the custom one I've made?Good suggestion about the calculator, you can change the currency at the top of the page but I think you should be able to change it right from the calculator. The calculator shows a coin depending on what coin page you are looking at but having the ability to change what coin is being calculated would be more convenient. Thanks for the suggestions!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitomic",
      "created_time": "April 10, 2023, 12:45:41 PM",
      "body": "Quote from: OmegaStarScream on April 10, 2023, 08:19:57 AMHere are some issues I found:- The maximum alerts field error is showing on top of the \"Note\". Also, if I write 8 for example, it's impossible to delete it afterward to write something else, I need to first select the whole number and type. I understand that you don't want the user to set a value of less than 0 but this is a very bad UX. I would delay showing the error as the user types, and also disable the create an alert button if certain criteria are not met.- The footer is broken? I tried multiple browsers.- Creating an alert is not working. Nothing happens when I click the button.- On the signup page, the button says \"Sign in\" and when typing new credential, it says that the email or password is invalid which doesn't make much sense.Suggestions:- Support social login (including login with MetaMask and WalletConnect).- I don't know if this is supported yet since I couldn't create an account/alert, but you should definitely consider supporting telegram alerts if you haven't.Also, I'm curious. How many alerts can the user create and are you planning to provide this service for free? \"The maximum alerts field error is showing on top of the \"Note\"Good catch! I'll fix it.\"Also, if I write 8 for example, it's impossible to delete it afterward to write something else, I need to first select the whole number and type\"Another good catch. Yup that is annoying and not going to work to have to select the whole number to delete it.\"I would delay showing the error as the user types, and also disable the create an alert button if certain criteria are not met.\"Good idea, why let the user click the button at all if it isn't going to let them submit.\"The footer is broken? I tried multiple browsers.\"In what way is it broken? Can you provide a screenshot? It is working fine for me in all browsers.\"Creating an alert is not working. Nothing happens when I click the button.\"It works for me but maybe you are going through a series of steps that is causing it to break? Possible to retrace the steps you took and what browser?\"On the signup page, the button says \"Sign in\"\"Fixed! Thanks for catching that.\"when typing new credential, it says that the email or password is invalid which doesn't make much sense.\"Good point!\"Support social login (including login with MetaMask and WalletConnect).\"Social log in is on the roadmap. I was going to add Google/Microsoft sso first but Metamask/WalletConnect makes more sense.\"but you should definitely consider supporting telegram alerts if you haven't.\"Yup telegram support is on the roadmap. As is SMS and discord. Do you think telegram would be more useful than SMS?\"Also, I'm curious. How many alerts can the user create and are you planning to provide this service for free?\"Users can create unlimited alerts right now. The plan is to have a credit system with 3 different plans (1 of those plans will be free for life) and to provide a generous amount of credits on the free plan. The goal is for the free plan to be enough for most users but power users can pay for more credits.Credits will work like this:1 email sent = 1 credit used1 telegram sent = 1 credit used1 SMS sent = 2 credits usedThanks for all the suggestions, I appreciate you taking the time to go over the site and write them all out. Many thanks!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "April 10, 2023, 02:27:02 PM",
      "body": "Quote from: Bitomic on April 10, 2023, 12:45:41 PMUsers can create unlimited alerts right now. The plan is to have a credit system with 3 different plans (1 of those plans will be free for life) and to provide a generous amount of credits on the free plan. The goal is for the free plan to be enough for most users but power users can pay for more credits.Credits will work like this:1 email sent = 1 credit used1 telegram sent = 1 credit used1 SMS sent = 2 credits usedthis is a legitimate way to monetize the service, and I agree with this. it would be good if you could enable several consecutive alerts for the same task. For example, when there are some big jumps something similar like the last DOGE coin bump after Elon's fiddling with the Twitter logo. One notification cannot show what happened there.About design, as long as it is simple and easy to use it is ok. I think if you just add night mode, it would be much more attractive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitomic",
      "created_time": "April 10, 2023, 02:57:50 PM",
      "body": "Quote from: virasog on April 10, 2023, 09:57:35 AMI am a bit confused here as when you go to  https://bitomic.io/explore/, you wil find all the stuff related to charts and price actions but if you go to https://bitomic.io/ it takes you to the page where we can join the waitlist. Now, what is that backtesting platform which you are going to launch? If it will be great if you can tell me something about it. As far as the price alerts are concerned, they are useful. Also how about sending a sms alert too and/or developing a mobile app so the notification can be sent on the mobile screen about price alerts? It's not very convenient to open an email every time there is a price alert.\"Now, what is that backtesting platform which you are going to launch? If it will be great if you can tell me something about it.\"Originally I had planned on launching backtesting first but I have since decided to focus on the alerts functionality for at least the next year. I need to update the landing page to reflect that.\"As far as the price alerts are concerned, they are useful.\"Thanks, I think so too. A big reason I am building it is because it is something I would use.\"Also how about sending a sms alert too and/or developing a mobile app so the notification can be sent on the mobile screen about price alerts? It's not very convenient to open an email every time there is a price alert.\"Agreed, email is the least convenient way to receive alerts. It was just the quickest to develop. SMS is high up on the todo list. A mobile app is planned but I don't expect to develop a native app in the near future. I think SMS would be good enough until then.Appreciate the feedback/suggestions!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitomic",
      "created_time": "April 10, 2023, 03:17:14 PM",
      "body": "Quote from: examplens on April 10, 2023, 02:27:02 PMQuote from: Bitomic on April 10, 2023, 12:45:41 PMUsers can create unlimited alerts right now. The plan is to have a credit system with 3 different plans (1 of those plans will be free for life) and to provide a generous amount of credits on the free plan. The goal is for the free plan to be enough for most users but power users can pay for more credits.Credits will work like this:1 email sent = 1 credit used1 telegram sent = 1 credit used1 SMS sent = 2 credits usedthis is a legitimate way to monetize the service, and I agree with this. it would be good if you could enable several consecutive alerts for the same task. For example, when there are some big jumps something similar like the last DOGE coin bump after Elon's fiddling with the Twitter logo. One notification cannot show what happened there.About design, as long as it is simple and easy to use it is ok. I think if you just add night mode, it would be much more attractive.\"this is a legitimate way to monetize the service, and I agree with this.\"Thanks! Seems like the best way to monetize it. Will even allow me to reward users with extra free credits if need be.\"it would be good if you could enable several consecutive alerts for the same task.\"It is possible already to create multiple alerts for the same task. You could set an alert for doge above $0.09, and another for $0.1, etc. Also, the underlying alerting engine I've built is quite flexible and eventually I'll allow users to design their own custom alerts based on what ever configuration they could want. It will be possible to do something like \"When doge is above $0.09 alert me, wait until it drops below $0.08 and then goes back above $0.085 before alerting me again but only alert me if RSI is below 30\".\"About design, as long as it is simple and easy to use it is ok. I think if you just add night mode, it would be much more attractive.\"Night mode is a good idea. I'll add it to the roadmap.Appreciate the feedback!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "April 11, 2023, 02:05:57 PM",
      "body": "@BitomicAs someone who tends to get email notifications in a delayed manner [unless I intentionally check them (not sure why this has been happening with Gmail)], it'd be nice to also have browser-side alerts [e.g. blinking/flashing tab that also shows a specific message when it hits a target].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "moneystery",
      "created_time": "April 11, 2023, 03:50:20 PM",
      "body": "What hosting do you use? it seems that the page takes quite a long time to load, my suggestion is that you can use the cloudflare platform as a CDN for your website so that the loading speed can be further increased.The interface of your website is also very basic, even though it looks clean but it doesn't look modern like most websites today.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OmegaStarScream",
      "created_time": "April 16, 2023, 12:25:16 PM",
      "body": "Quote from: Bitomic on April 10, 2023, 12:45:41 PM-snip-Thanks for all the suggestions, I appreciate you taking the time to go over the site and write them all out. Many thanks!Broken footer (and header): I believe it's not responsive with larger screen resolutions. Its not showing properly on 2560x1440 but looks fine when I resize my browser window.Social login: I would go with Twitter over Microsoft when developing a crypto app. Free tiers: I have no complaints here, but are you sure it's sustainable? I don't know which service you're going to use to send these text messages, but I would imagine that they all have about the same prices and by looking at Twilio[2], I think you should reconsider giving a \"generous amount of credits\". [1] https://i.imgur.com/HMSUVo9.png[2] https://i.imgur.com/n3bgAjq.png[3] https://www.twilio.com/sms/pricing/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 18, 2023, 11:01:18 AM",
      "body": "Quote from: Bitomic on April 10, 2023, 12:45:41 PMSocial log in is on the roadmap. I was going to add Google/Microsoft sso first but Metamask/WalletConnect makes more sense.By Microsoft, do you mean a Live e-mail account/Azure AD? I don't think there is enough demand for that. Even for the non-crypto market, it is very rare for a Live instant registration feature. I don't know if it is possible, but if a user can create a throwaway account with just an e-mail address it would be great for a trial. Basically, they can use an e-mail address to log in, and then your platform will send a code for each login activity. This is obviously not intended for long-term usage due to security issues, so a user who wants to pay for a higher tier for example would not be able to use this. There is also an issue of the possibility of alert abuse if you do enable this, so do keep this in mind. CMIIW.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}