{
  "id": "topic_5456789",
  "title": "Soonandwaite",
  "author": "Soonandwaite",
  "created_time": "June 18, 2023, 06:42:05 PM",
  "content": "today was the draw for the 1st round of the dfb cup. of course there are no great duels yet. but maybe there will be one or two surprises and an amateur club can annoy a professional club. here are all the matches of the 1st round to see.source:https://www.kicker.de/dfb-pokal-2023-24-1-hauoptrunde/auslosung",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5456789",
  "comments": [
    {
      "author": "bct_ail",
      "created_time": "August 11, 2023, 07:03:26 AM",
      "body": "This weekend is the start of the 1st round. Except for Leipzig and Bayern Munich. They do not play this weekend but at the end of September because they play against each other in the Supercup at Saturday evening.The DFB Cup is a joy for the clubs from the lower leagues. Most of the time they lose, but sometimes there are surprises. In any case, it is an experience for the players and fans that they often never get again in life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "swogerino",
      "created_time": "August 11, 2023, 07:13:18 AM",
      "body": "Quote from: bct_ail on August 11, 2023, 07:03:26 AMThis weekend is the start of the 1st round. Except for Leipzig and Bayern Munich. They do not play this weekend but at the end of September because they play against each other in the Supercup at Saturday evening.The DFB Cup is a joy for the clubs from the lower leagues. Most of the time they lose, but sometimes there are surprises. In any case, it is an experience for the players and fans that they often never get again in life.We have seen not that rarely that these low leagues teams in here cause huge surprises,of course not so often either but from time to time they do.Maybe because the motivation of the players from these low leagues when they face teams from the Bundesliga should be sky high as they want to showcase their skills in front of different managers and as such having a chance of improving their career.While this is great for the players of the low leagues it is very bad for us bettors who sometimes lose bets with 1.10 or lower odds as we are trying to get some sure money by betting on the teams from Bundesliga who happens to make surprise results for us.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Soonandwaite",
      "created_time": "August 11, 2023, 10:48:54 AM",
      "body": "tonight are the first matches in the dfb pokal . and the best match you can see live tonight . the ZDF broadcasts the match Braunschweig vs Schalke 04 live from 8:15pm . the match starts at 8:45pm . i think this is the most interesting match today . will Braunschweig win at home or will Schalke win in Braunschweig ? this match is difficult to bet . i think both teams can win today. source:https://www.flashscore.com/football/germany/dfb-pokal",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Soonandwaite",
      "created_time": "August 12, 2023, 04:31:15 PM",
      "body": "Victoria Köln : Werder Bremen 3:2the first DFB cup sensation is perfect. the third league team Victoria Köln has won against Werder Bremen with 3:2 and is one round further. who has bet on Köln today has now made a good profit. füllkrug alone cannot save bremen  here are all the other results from todaysource: https://sportdaten.n-tv.de/fussball/dfb-pokal/spiele-und-ergebnisse/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "August 14, 2023, 09:40:09 AM",
      "body": "Quote from: Soonandwaite on August 12, 2023, 04:31:15 PMVictoria Köln : Werder Bremen 3:2the first DFB cup sensation is perfect. the third league team Victoria Köln has won against Werder Bremen with 3:2 and is one round further. Yes, Werder Bremen certainly imagined it differently. But so ist the DFB cup. There are always surprises. Another surprise was Unterhaching from Bundesliga 3 won against Augsburg from Bundesliga 1. There are still 4 games tonight. So there may be more surprises to come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Soonandwaite",
      "created_time": "August 14, 2023, 05:55:49 PM",
      "body": "Quote from: bct_ail on August 14, 2023, 09:40:09 AMThere are still 4 games tonight. So there may be more surprises to come.  and there is already the next big surprise in the dfb pokal : Darmstadt 98 was eliminated today. Darmstadt 98 lost 0:3 at regional league team FC. Homburg . who bet on Homburg today has now a little more money on the betting account . so the following Bundesliga teams are eliminated in the first round: Werder Bremen , VFL Bochum , Augsburg and today Darmstadt 98.tonight there is still the game VFL Osnabrück against 1:FC Köln. is there still a funny result",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "August 15, 2023, 07:45:17 AM",
      "body": "Quote from: Soonandwaite on August 14, 2023, 05:55:49 PMand there is already the next big surprise in the dfb pokal : Darmstadt 98 was eliminated today. Darmstadt 98 lost 0:3 at regional league team FC. Homburg . tonight there is still the game VFL Osnabrück against 1:FC KölnBut it remains with only one surprise. Osnabrück hoped for a long time and they also managed to take Köln to extra time. But in the end, the Osnabrück players had no more power and Köln deserved to win. Osnabrück however, fought great.Now we have to wait until Bayern Munich and Leipzig have played their games at the end of September. Only then the draw for round 2 can be made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Soonandwaite",
      "created_time": "September 27, 2023, 06:55:00 PM",
      "body": "yesterday was the 31 match of the first round of the dfb pokal . bayern münchen of course won 4:0 at preußen münster. but it was a costly victory for the team from münchen : why ? Serge Gnabry broke his arm in the match and will be out for several weeks. unfortunately, this is a bitter diagnosis for bayern. today there is also the last match of the first round: red bull leipzig has to play sv wehen. normally leipzig should win easily there. but you never know: the cup often has its own rules and the underdog wins.edit: after 10 minutes the favourite already leads 1:0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "September 27, 2023, 08:15:13 PM",
      "body": "Quote from: Soonandwaite on September 27, 2023, 06:55:00 PMyesterday was the 31 match of the first round of the dfb pokal . bayern münchen of course won 4:0 at preußen münster. but it was a costly victory for the team from münchen : why ? Serge Gnabry broke his arm in the match and will be out for several weeks. unfortunately, this is a bitter diagnosis for bayern. today there is also the last match of the first round: red bull leipzig has to play sv wehen. normally leipzig should win easily there. but you never know: the cup often has its own rules and the underdog wins.edit: after 10 minutes the favourite already leads 1:0  It was a great experience for Preußen Münster to play against Bayern Munich. Nobody assumed that they could win this game.SV Wehen, on the other hand, played really well against Leipzig. Leipzig makes a lot of mistakes now and SV Wehen almost scored the 2:2. Maybe a surprise will really happen here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "September 28, 2023, 09:03:50 PM",
      "body": "Great game from Wehen. Both teams scored  and the final score was 3:2 for Leipzig. A great performance by Wehen and with a bit of luck they could have gone into extra time. The draw for the next round for the DFB Cup will take place on 01 October. The matches will take place at 31 October and 01 November.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Soonandwaite",
      "created_time": "October 01, 2023, 06:39:55 PM",
      "body": "today was the draw for the second round of the dfb cup . some very very interesting duels are to be seen in the second round . 4 Bundesliga clubs are guaranteed to be eliminated in the second round. i have marked these duels in red below all matches will take place on 31 october and 1 november. Borussia Mönchengladbach - 1. FC HeidenheimVfB Stuttgart- Union BerlinBorussia Dortmund - TSG HoffenheimVfL Wolfsburg - RB LeipzigSC Freiburg - SC PaderbornHertha BSC - FSV Mainz 051. FC Kaiserslautern - 1. FC KölnFC St. Pauli - FC Schalke 041. FC Nürnberg - Hansa RostockHolstein Kiel - 1. FC MagdeburgViktoria Köln - Eintracht FrankfurtSV Sandhausen - Bayer 04 Leverkusen1. FC Saarbrücken - FC Bayern MünchenArminia Bielefeld - Hamburger SVSpVgg Unterhaching - Fortuna DüsseldorfFC Homburg - SpVgg Greuther Fürth",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "October 03, 2023, 08:45:18 PM",
      "body": "Quote from: Soonandwaite on October 01, 2023, 06:39:55 PMtoday was the draw for the second round of the dfb cup . some very very interesting duels are to be seen in the second round . 4 Bundesliga clubs are guaranteed to be eliminated in the second round. i have marked these duels in red below all matches will take place on 31 october and 1 november. Borussia Mönchengladbach - 1. FC HeidenheimVfB Stuttgart- Union BerlinBorussia Dortmund - TSG HoffenheimVfL Wolfsburg - RB LeipzigSC Freiburg - SC PaderbornHertha BSC - FSV Mainz 051. FC Kaiserslautern - 1. FC KölnFC St. Pauli - FC Schalke 041. FC Nürnberg - Hansa RostockHolstein Kiel - 1. FC MagdeburgViktoria Köln - Eintracht FrankfurtSV Sandhausen - Bayer 04 Leverkusen1. FC Saarbrücken - FC Bayern MünchenArminia Bielefeld - Hamburger SVSpVgg Unterhaching - Fortuna DüsseldorfFC Homburg - SpVgg Greuther FürthNot only clubs from Bundesliga 1 will be eliminated. There are also many teams from Bundesliga 2 will also play against each other.It is a pity that many of the \"small\" clubs were already knocked out in the first round. There are only a few left that are not in Bundesliga 1 or 2. 5 teams from League 3 and only one from League 4 (FC Homburg).  Of course, many keep their fingers crossed for the small club for a win.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "November 01, 2023, 09:34:50 AM",
      "body": "Last years DFB Cup winner can no longer be this years winner. Leipzig was knocked out in the DFB Cup from VFL Wolfsburg. They won 1:0. Leipzigs player Poulsen even got a red card in minute 56. And another surprise in the DFB Cup. FC Homburg from League 4 won against Fürth (League 2). Homburg is nearly the last team that is still in the DFB Cup but not in Bundesliga 1 or 2.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Soonandwaite",
      "created_time": "November 01, 2023, 03:47:40 PM",
      "body": "Quote from: bct_ail on November 01, 2023, 09:34:50 AMLast years DFB Cup winner can no longer be this years winner. Leipzig was knocked out in the DFB Cup from VFL Wolfsburg. They won 1:0. Leipzigs player Poulsen even got a red card in minute 56. And another surprise in the DFB Cup. FC Homburg from League 4 won against Fürth (League 2). Homburg is nearly the last team that is still in the DFB Cup but not in Bundesliga 1 or 2.yes. as i wrote a few weeks ago. the first 4 bundesliga clubs have been eliminated. leipzig,heidenheim , union berlin and 1.fc köln are no longer in it. and tonight dortmund or hoffenheim are guaranteed to be eliminated. maybe we'll see one or two surprises in the eight games tonight but we'll see ! at 11 pm we'll all be wiser. the dfb cup is always good for a surprise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "November 01, 2023, 04:06:38 PM",
      "body": "Quote from: Soonandwaite on November 01, 2023, 03:47:40 PMmaybe we'll see one or two surprises in the eight games tonight but we'll see ! at 11 pm we'll all be wiser. the dfb cup is always good for a surprise. Two teams that are not in Bundesliga 1 or 2 still have a chance today to reach the next round and bowl out either Bayern Munich or Frankfurt. But I do not think Saarbrücken will have much of a chance. Viktoria Köln would have more of a chance. As you wrote, we will know more tonight. The other games are:Dortmund – HoffenheimSandhausen – LeverkusenFreiburg – PaderbornKiel – MagdeburgHertha Berlin – MainzNürnberg - Rostock",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "November 01, 2023, 04:11:37 PM",
      "body": "Quote from: Soonandwaite on November 01, 2023, 03:47:40 PMQuote from: bct_ail on November 01, 2023, 09:34:50 AMLast years DFB Cup winner can no longer be this years winner. Leipzig was knocked out in the DFB Cup from VFL Wolfsburg. They won 1:0. Leipzigs player Poulsen even got a red card in minute 56. And another surprise in the DFB Cup. FC Homburg from League 4 won against Fürth (League 2). Homburg is nearly the last team that is still in the DFB Cup but not in Bundesliga 1 or 2.yes. as i wrote a few weeks ago. the first 4 bundesliga clubs have been eliminated. leipzig,heidenheim , union berlin and 1.fc köln are no longer in it. and tonight dortmund or hoffenheim are guaranteed to be eliminated. maybe we'll see one or two surprises in the eight games tonight but we'll see ! at 11 pm we'll all be wiser. the dfb cup is always good for a surprise. Good bye Hoffenheim.Finally BVB is getting their shxt together and getting some good/ok results.This should be enough to beat Hoffenheim at home. They still have their troubles to score but in the cup they mostly good at home.Hopefully this will also be the case today, don't want to jinx it here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Soonandwaite",
      "created_time": "November 01, 2023, 04:13:25 PM",
      "body": "Quote from: bct_ail on November 01, 2023, 04:06:38 PMThe other games are:Dortmund – HoffenheimSandhausen – LeverkusenFreiburg – PaderbornKiel – MagdeburgHertha Berlin – MainzNürnberg - Rostocki think these green tips will advance one round today. bayern will also win and frankfurt will probably also win at viktoria köln. the only thing i'm unsure about is kiel against magdeburg. the guest from magdeburg could also win there. because the magdeburg fans will support their team in kiel very loudly.but the dortmunden team is also unpredictable this season. this match is also sure to be highly interesting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "November 02, 2023, 08:02:34 AM",
      "body": "Wow. What a surprise and what joy in Saarbrücken. Bayern Munich is knocked out in the second round. Goal from Saarbrücken in injury time. The DFB Cup is always good for surprises and proved it yesterday It was also a surprise that Paderborn bowled out Freiburg.The draw for the finals of the last 16 teams will take place at sunday. Only one team from League 3 and one from League 4 left. Let us see against whom they will play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AHOYBRAUSE",
      "created_time": "November 02, 2023, 12:02:39 PM",
      "body": "Quote from: bct_ail on November 02, 2023, 08:02:34 AMWow. What a surprise and what joy in Saarbrücken. Bayern Munich is knocked out in the second round. Goal from Saarbrücken in injury time. The DFB Cup is always good for surprises and proved it yesterday It was also a surprise that Paderborn bowled out Freiburg.The draw for the finals of the last 16 teams will take place at sunday. Only one team from League 3 and one from League 4 left. Let us see against whom they will play.Bayern was just hilarious.Imagine a team of mostly national players losing ( after having a 1:0 lead ) to a 15th place 3rd devision team, these stories are only written in cup games.I checked and saw that betting Saarbrücken would have brought a 30:1 payout, that's some nice odds.  Also, I feel sorry for all the thousands of people that put Bayern in their parley just to make the odds a tiny bit higher, but luck for these people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}