{
  "id": "topic_5449629",
  "title": "albon",
  "author": "albon",
  "created_time": "April 20, 2023, 10:50:04 PM",
  "content": "What happened::  This topic is a warning to bounty hunters and potential investors for the Novus Chain project, as the project looks suspicious. The team is anonymous, and now they have LGE (Liquidity Generation Event), so with this pre-sale, they collect the investors’ funds even after they release their NOS currency to distribute it to them. The other thing is that there are two bounty campaigns now in the forum, and they are not escrowed, and there are those who will continue to work on promoting the project for more than eight weeks, and there are no guarantees.Reference Link: [1] First Bounty: https://bitcointalk.org/index.php?topic=5447043.0[2] Second Bounty: https://bitcointalk.org/index.php?topic=5447274.0[3] Bounty Manager: https://bitcointalk.org/index.php?action=profile;u=3544032Novus Chain Website: https://www.novus-chain.com/QuoteDomain Name: NOVUS-CHAIN.COMRegistrar:   Godaddy IANA ID 146Status: clientTransferProhibited, clientRenewProhibited, ClientDeleteProhibited, ClientUpdateProhibitedCreation Date: March 28, 2023 (3 weeks ago)Update Date: March 28, 2023 (3 weeks ago)Expiration Date: March 28, 2024Age: 24 daysSOURCE: https://www.domainiq.com/domain?novus-chain.com#/whoisAdditional Notes: I also want to ask a question to the bounty manager @BountyBoss_RMTM:** Did you get paid as a Bounty Manager to promote these bounties?** Another thing is whether it is possible to contact the CEO of the Novus Chain project to ask him to hire an escrow for the allocations of USDT of the two bounties!I advise bounty hunters to stop working until they get guarantees first because I don't see that things will be okay in the end.[If my suspicion is wrong and they hire an escrow, and things are going legitimate, I will close this case as soon as possible.]",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449629",
  "comments": [
    {
      "author": "coin-investor",
      "created_time": "April 20, 2023, 11:50:55 PM",
      "body": "I checked who manages the bounty and it's a new account, reputable bounty manager will not agree to this kind of terms, there are many histories of ICO campaigns where the bounty hunters did not get their shares of the bounty, some projects even ask for verification after months of inactivity if you missed this validation your stakes are gone, I missed a lot of my stakes when I was still active in bounty campaigns, because of lack of escrow.Escrow is a must for launching a bounty, with this action they will show that they are legit and bounty hunters will be guaranteed their rewards, it's not easy to be in a campaign for 1 or 2 months. It's good that you call them out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "April 21, 2023, 02:25:35 AM",
      "body": "No offense.If the matter is about escrowing the bounty rewards, actually 90%+ of bounty campaigns aren't escrowed. So you must ask the other bounty campaigns to escrow their reward, not only in this bounty. A project which publish their team don't have any guarantee if the project is legit, similar with a project with anonymous team.A bounty managed with a reputable and old manager can't make sure the project will distribute the reward, they only manage the campaign except the reward was been escrowed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "April 21, 2023, 05:50:35 AM",
      "body": "Quote from: albon on April 20, 2023, 10:50:04 PM** Did you get paid as a Bounty Manager to promote these bounties?I doubt they have been paid. Even if they have been paid, the amount is too small for sure. No project would hire a newbie bounty manager to run their campaign here if they would spend good amount. I have managed only 3 bounty campaigns but got a lot of offer to manage bounty but they offered me very low price, which I had to deny and later found them, newbie campaign manager is launching their bounty.Quote from: Plaguedeath on April 21, 2023, 02:25:35 AMIf the matter is about escrowing the bounty rewards, actually 90%+ of bounty campaigns aren't escrowed. So you must ask the other bounty campaigns to escrow their reward, not only in this bounty.Escrow should always be there but projects don't want to because they are not familiar about the forum environment. They fear manager or escrow will scam them and that's happened a lot of times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "April 21, 2023, 06:14:51 AM",
      "body": "How much time do bounty hunters allocate to advertising bounties? Although they call it hard work, they always have the choice of participation, and you can check how many people who want to get burned again leave their data in this company.So why should you bother, OP? Anyone who has any experience will never participate with a manager with zero reputation, let alone a newcomer to the forum. It can be assumed that bounty hunters are people who love to receive slaps in the face, since no matter how much you teach, the number of applicants will not decrease.Let people learn from their mistakes.Among other things, are you sure that the bounty hunters know about the existence of this section? In my opinion, they only know about the bounty section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "April 21, 2023, 06:58:31 AM",
      "body": "Awareness is the only solution to such a problem, since without awareness we cannot describe the project as scam unless there is clear evidence.All indications indicate that the project is not promising if it is not a fraud or a fraud, and therefore, even if it is not a fraud, the return from it is not worth all these efforts.Not to mention that they did not pay the campaign manager, in addition to the poor design of the ANN and many other things that indicate a lack of funding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "April 23, 2023, 12:32:04 PM",
      "body": "Quote from: lovesmayfamilis on April 21, 2023, 06:14:51 AMAmong other things, are you sure that the bounty hunters know about the existence of this section? In my opinion, they only know about the bounty section. That's true totally agree if you check the bounty section and you will find newbie accounts with over 1000 posts check their first and current post and you'll see all are in the bounty section, they don't care about other sections, they have zero contribution to any topic or discussion here so they will remain newbies, imagine without the merit system these bounty hunters could be legendary members of this forum, with no contribution at all.This is one example if we don't have a merit system will you respect this kind of member 2120 of his posts are on the bounty section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "April 30, 2023, 04:27:59 PM",
      "body": "Update:--------------------------------------Now my suspicion was correct, and it turned out that the project promoted by BountyBoss_RMTM is a scam project, and after that, he deleted the topics, as you can see in the following image:This is an untrustworthy and reckless manager, and he may be part of the Novus scam project, so he didn't even bother to be here on the topic to answer questions and preserve his reputation.I was really sad to see one of the comments of one of the participants in one of his scam bounties who fell victim to this scam and wasted his time:Quote from: DapanasFruit on April 21, 2023, 02:49:49 PMNever will I be trusting a project like this and a BM like that of above...just a big waste of time and effort...are we here in this forum now a big haven of scam-filled projects just out to victimized innocent people?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "April 30, 2023, 06:35:47 PM",
      "body": "If I may add, another proof that your suspicion is well founded, the site is also down with error 403, with the last activity on the project's TG announcing they're being paused indefinitely. \"Coincidentally\", or... miraculously, the BM also edit/delete their posts on the same day as this announcement, down to the minute [my TG on this device is set to match forum time].",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "May 01, 2023, 09:26:30 PMLast edit: May 02, 2023, 12:22:55 AM by CryptSafe",
      "body": "Quote from: holydarkness on April 30, 2023, 06:35:47 PMIf I may add, another proof that your suspicion is well founded, the site is also down with error 403, with the last activity on the project's TG announcing they're being paused indefinitely. \"Coincidentally\", or... miraculously, the BM also edit/delete their posts on the same day as this announcement, down to the minute [my TG on this device is set to match forum time]. If we are to go by this information then it seems there's more to it. Likely a scam  and has been deserted by admin on telegram and bounty manager. How come they were able to gather such number of bounty hunters to help them promote their scam project with large number of audience. The bounty manager seems to be a newbie account that is not well established on the platform and the bounty hunters could not see that and were quick to participate in the project campaign, promoting a Scam project properly planned with possibly ill intentions to undo the unsuspecting investors of their hard earned cash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "May 01, 2023, 10:49:40 PM",
      "body": "Quote from: CryptSafe on May 01, 2023, 09:26:30 PMQuote from: holydarkness on April 30, 2023, 06:35:47 PMIf I may add, another proof that your suspicion is well founded, the site is also down with error 403, with the last activity on the project's TG announcing they're being paused indefinitely.[image snip]\"Coincidentally\", or... miraculously, the BM also edit/delete their posts on the same day as this announcement, down to the minute [my TG on this device is set to match forum time].[image snip]If we are to go by this information then it seems there's more to it. Likely a scam  and has been deserted by admin on telegram and bounty manager. How come they were able to gather such number of bounty Hunters to help them promote their scam project with large number of audience. The bounty manager seems to be a newbie account that is not well established in the platform and the bounty hunters could not see that and we're quick to participate in the project campaign, promoting a Scam project properly planned with possibly ill intentions to undo the unsuspecting investors of their hard earned cash.Next time, it'll be very helpful for other readers if you can snip the images on the quoted post, just a little suggestion.Call me paranoid, but I suspect there's something more to this than what we currently have at hand. The BM did an effort and bothered to \"wipe\" his entire posts about the project --most likely not knowing all posts here are automatically archived-- if the account was meant to be a disposable account, he won't bother doing so. I think there is a possibility that he'll resurface another time with different projects. Different names, same strategy.I don't think I am going to leave a tag just yet because I am well aware that the theory is rather far fetched, though I think the tag is well justified for this case. Instead, this thread will serve as a nice reminder for me in case the BM resurfaced.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 02, 2023, 01:26:15 PM",
      "body": "Quote from: lovesmayfamilis on April 21, 2023, 06:14:51 AMSo why should you bother, OP?I feel your point on that but I guess OP was driven by good conscience to do right and save others the imminent ache from loss. Otherwise, it shouldn't even be any business of his if anyone got scammed or not.QuoteAnyone who has any experience will never participate with a manager with zero reputation, let alone a newcomer to the forum.Not everyone knows that. Some of us learnt that from bitter encounters we had. We shouldn't take that knowledge for granted even though it seems like commonsense now.QuoteLet people learn from their mistakes.Experience is the best teacher, right? Yeah we know but sadly some mistakes can be very costly. We've to prevent others from falling prey; if only they will listen and not be ignorantly stubborn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "May 03, 2023, 05:11:55 PM",
      "body": "Quote from: albon on April 20, 2023, 10:50:04 PMWhat happened::  This topic is a warning to bounty hunters and potential investors for the Novus Chain project, as the project looks suspicious. The team is anonymous, and now they have LGE (Liquidity Generation Event), so with this pre-sale, they collect the investors’ funds even after they release their NOS currency to distribute it to them.I would have said this should be reported on the scam accusation board but the whole fact is yet completed concerning them, but i also see being anonymous as nothing bad if they can be truthful about thwir offerings, as long as they are not scam project, this is one of the challenges one may face with bounty projectsQuote from: albon on April 20, 2023, 10:50:04 PMThe other thing is that there are two bounty campaigns now in the forum, and they are not escrowed, and there are those who will continue to work on promoting the project for more than eight weeks, and there are no guarantees.As long as they agreed to the terms before working for them then it's upto the risk of the with the participants, bounty projects is not by force to join, those used to the whole thing finds this as part of the risk they take which is as part of their own task to research well before joining any bounty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ScamViruS",
      "created_time": "May 03, 2023, 08:28:00 PM",
      "body": "Quote from: 348Judah on May 03, 2023, 05:11:55 PMAs long as they agreed to the terms before working for them then it's upto the risk of the with the participants, bounty projects is not by force to join, those used to the whole thing finds this as part of the risk they take which is as part of their own task to research well before joining any bounty. Bounty hunters don't even try to see if this project could be a scam or not. As soon as a bounty campaign is launched, they join the campaign and start doing their tasks. As a result, many projects use them for free marketing and do not pay after the campaign ends. Bounty hunters should do a minimum of research before joining a bounty campaign to prevent themselves from promoting a scam project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "May 03, 2023, 09:57:25 PM",
      "body": "Quote from: 348Judah on May 03, 2023, 05:11:55 PMQuote from: albon on April 20, 2023, 10:50:04 PMWhat happened::  This topic is a warning to bounty hunters and potential investors for the Novus Chain project, as the project looks suspicious. The team is anonymous, and now they have LGE (Liquidity Generation Event), so with this pre-sale, they collect the investors’ funds even after they release their NOS currency to distribute it to them.I would have said this should be reported on the scam accusation board but the whole fact is yet completed concerning them, but i also see being anonymous as nothing bad if they can be truthful about thwir offerings, as long as they are not scam project, this is one of the challenges one may face with bounty projectsQuote from: albon on April 20, 2023, 10:50:04 PMThe other thing is that there are two bounty campaigns now in the forum, and they are not escrowed, and there are those who will continue to work on promoting the project for more than eight weeks, and there are no guarantees.As long as they agreed to the terms before working for them then it's upto the risk of the with the participants, bounty projects is not by force to join, those used to the whole thing finds this as part of the risk they take which is as part of their own task to research well before joining any bounty. Please allow me to ask, did you even glance at the images displayed on this thread? I certainly can't hope on you're reading the whole 12 posts prior to yours, but did you at least glanced at one image? Or two, hopefully? Those images are huge in size and quite eye-catching.The whole fact is completed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Litzki1990",
      "created_time": "May 04, 2023, 03:20:59 PM",
      "body": "Quote from: albon on April 20, 2023, 10:50:04 PMI advise bounty hunters to stop working until they get guarantees first because I don't see that things will be okay in the end.I don't think any bounty hunter would obey such instructions.  Bounty hunters have grown so much that now anyone who sets up a boundary thread has no shortage of campaign participants. But no bounty hunter notices the fact that they are working on a manager's project and what kind of directions are given on the project's website, but these things should be known before working. When they work without knowing all these things but when they don't get payment after work they abuse in Telegram group of different projects.  But it will be good for them if they know the project well before working on any bounty project without giving bad comments.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saisher",
      "created_time": "May 05, 2023, 02:30:23 PM",
      "body": "Quote from: ScamViruS on May 03, 2023, 08:28:00 PMQuote from: 348Judah on May 03, 2023, 05:11:55 PMAs long as they agreed to the terms before working for them then it's upto the risk of the with the participants, bounty projects is not by force to join, those used to the whole thing finds this as part of the risk they take which is as part of their own task to research well before joining any bounty. Bounty hunters don't even try to see if this project could be a scam or not. As soon as a bounty campaign is launched, they join the campaign and start doing their tasks. As a result, many projects use them for free marketing and do not pay after the campaign ends. Bounty hunters should do a minimum of research before joining a bounty campaign to prevent themselves from promoting a scam project.Some projects do not even guarantee token distribution I have encountered projects I've joined where they did not reach their soft cap so the project did not push, they return the investors' funds and all the bounty hunters got are appreciation for the job they've done.Bounty hunting is more like a box of chocolate, you can't be sure what you're going to get that is bounty hunters just do their job and leave it all to fate if they are going to make a profit from all their hard work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "May 05, 2023, 03:01:21 PM",
      "body": "Quote from: Litzki1990 on May 04, 2023, 03:20:59 PMQuote from: albon on April 20, 2023, 10:50:04 PMI advise bounty hunters to stop working until they get guarantees first because I don't see that things will be okay in the end.I don't think any bounty hunter would obey such instructions.  Bounty hunters have grown so much that now anyone who sets up a boundary thread has no shortage of campaign participants. But no bounty hunter notices the fact that they are working on a manager's project and what kind of directions are given on the project's website, but these things should be known before working. When they work without knowing all these things but when they don't get payment after work they abuse in Telegram group of different projects.  But it will be good for them if they know the project well before working on any bounty project without giving bad comments.Unlike before, bounty hunters barely read instructions. They just out of excitement of a new project bounty launch rush to register so they could start promoting the project while failing to check the basic requirements of the campaign project and bounty manager conditions before taking up the task.   .For your information  there are millions of unemployed out there. Some are here on this platform scouting for income and possibly a job to help sustain themselves and would go any length to retain their position here. So seeing bounty hunters quick to start a bounty project without reading terms and conditions is not a new thing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "smyslov",
      "created_time": "May 06, 2023, 12:45:07 PM",
      "body": "Quote from: Litzki1990 on May 04, 2023, 03:20:59 PMQuote from: albon on April 20, 2023, 10:50:04 PMI advise bounty hunters to stop working until they get guarantees first because I don't see that things will be okay in the end.I don't think any bounty hunter would obey such instructions.  Bounty hunters have grown so much that now anyone who sets up a boundary thread has no shortage of campaign participants. But no bounty hunter notices the fact that they are working on a manager's project and what kind of directions are given on the project's website, but these things should be known before working. When they work without knowing all these things but when they don't get payment after work they abuse in Telegram group of different projects.  But it will be good for them if they know the project well before working on any bounty project without giving bad comments.We can compare bounty hunting to gambling there is no guarantee anymore even if the project looks legit there's a possibility of the bounty manager or the project developers denying payment to bounty hunters, and if the project failed to reach the soft-cap and stopped the development of the project they will not pay bounty hunters.\\Bounty hunters do not know what a legit or real project is anymore they just join and submit reports and hope that the project will turn out to be be good and profitable and they will receive their share of the bounty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Broadanbig",
      "created_time": "May 06, 2023, 07:07:16 PM",
      "body": "Quote from: smyslov on May 06, 2023, 12:45:07 PMQuote from: Litzki1990 on May 04, 2023, 03:20:59 PMQuote from: albon on April 20, 2023, 10:50:04 PMI advise bounty hunters to stop working until they get guarantees first because I don't see that things will be okay in the end.I don't think any bounty hunter would obey such instructions.  Bounty hunters have grown so much that now anyone who sets up a boundary thread has no shortage of campaign participants. But no bounty hunter notices the fact that they are working on a manager's project and what kind of directions are given on the project's website, but these things should be known before working. When they work without knowing all these things but when they don't get payment after work they abuse in Telegram group of different projects.  But it will be good for them if they know the project well before working on any bounty project without giving bad comments.We can compare bounty hunting to gambling there is no guarantee anymore even if the project looks legit there's a possibility of the bounty manager or the project developers denying payment to bounty hunters, and if the project failed to reach the soft-cap and stopped the development of the project they will not pay bounty hunters.\\Bounty hunters do not know what a legit or real project is anymore they just join and submit reports and hope that the project will turn out to be be good and profitable and they will receive their share of the bounty.Bounty hunters are just desperate to find something doing. They do not care anymore if a project is genuine or fake, these are people trying to survive and they do this minding the risk involved whether they would be paid or not the just take up the bounty task without proper research on the project for which they are working for. Some at there entire end are been denied of their rewards which is very disappointing and they the campaign managers know this but they keep telling cock and bull stories to the hunters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}