{
  "id": "topic_5488737",
  "title": "Jet Cash",
  "author": "Jet Cash",
  "created_time": "March 13, 2024, 02:17:56 PM",
  "content": "I am contesting a penalty surcharge for an alleged parking infringement. There are several grounds for appeal, but I am having difficulty in contacting the company. The only phone number they provide goes to an automated payment service. Their website is unusable as I am registered as no fixed abode ( this is very convenient in these times of change). They don't provide an email address. I managed to find a number that purports to be theit head office, and they stae their office hours are 0900-1730, but whenever I call they state the office is closed. I've registered a domain name with the ,info extension. Their website uses .com and .co.uk. I've set up an email of defence@(my domain.info), and I am prepared to correspond via this and free of charge. I suspect that I am going to have to start to correspond using traditional recorded delivery mail. This leads me to the purpose of this thread. I want to invoice them for each letter that I send, but I don't want to provide bank details. I propose to charge BTC0.0005 for each letter, and I will state that by requesting a written reply, they are accepting these terms. I am not providing a Sterling option, so I believe thay are forced to request an email reply or accept my terms. Of course they could ignore me, and try for court action - that will be fun. Have any members here tried something like this? Whilst Bitcoin is not legal tender in the UK, it is not banned as a medium of exchange or method of payment.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5488737",
  "comments": [
    {
      "author": "Amphenomenon",
      "created_time": "March 13, 2024, 02:34:27 PM",
      "body": "Quote from: Jet Cash on March 13, 2024, 02:17:56 PMHave any members here tried something like this? Whilst Bitcoin is not legal tender in the UK, it is not banned as a medium of exchange or method of payment.Though I haven't tried this but In my own country while bitcoin is not a legal tender if both parties can come to an agreement in order to use it as a means of payment then it can simply be done with no issue. I guessed this is how yours works also and that's if they agree to your terms then using BTC would be great.Though I will love to know what option they later opt for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jet Cash",
      "created_time": "March 13, 2024, 02:56:05 PM",
      "body": "I think the most likely outcome is that they will drop their charge, and hope that the problem goes away. However the major flaw in their claim is one that has been used many times by them, and I believe that their continuing use amounts to a fraud. I'd like to alert other UK motorists to their actions. I've also had some expenses in contesting their claim. I paid $3.59 fot the info domain, and renewal will cost $21.79 if I keep it for more than a year. Typed letters have to be printed in the local library, as I got rid of my printer as I only used it about once every two years. I will be making a claim for costs and inconvenience. If they refuse to pay it, then I can take it to the samll claims court. If I win this, then I understand that I will be paid in the legal tender option of Sterling. However, byt the time that happens, no doubt Bitcoin will have increased in value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "March 13, 2024, 02:57:08 PM",
      "body": "Well, I've never tried such, but common sense should be, if bitcoin is not a legal tender in the UK, but it's extremely popular and used as a medium of payment regardless, then there is the possiblity that you (op) should have no issue getting your requested bitcoin as payment for what you are requesting it for.But in the case where bitcoin is not a legal tender in the UK, and not too popular as to it being used as a meduim of exchange, then the company may likely tell you (op) that they don't know what bitcoin is, and neither do they understand how it operates, or how to buy or send it, in such a case or scenario, you might have no choice but to accept whatever is laid on the table which will be no other than fiat payment I suppose.But by the way, I wish you Goodluck on this, regardless of whether they accept to pay you in bitcoin or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jet Cash",
      "created_time": "March 13, 2024, 03:27:12 PM",
      "body": "Well I hope my claim does go to court. It will highlight the fact that Bitcoin can be used in settlement of a charge when you don't trust the defendant with your bank details. The more that judges and lawyers are made aware of this, then the better it will be for Bitcoin and the \"ordinary\" people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "March 13, 2024, 03:29:40 PM",
      "body": "In my opinion I think these disputes are all forms of hindrances which is actually going to drop your chances of purchase a decent amount of Bitcoin on time. Firstly, they will definitely refuse to pay you via Bitcoin transaction because even the government can't tax it instead they will suggest you make use of a bank where you can be taxed from.In a situation of this nature I will suggest you accept the payment via a legal banking method to reduce the time you would waste trying to get it in other means like Bitcoin.The longer the whole process goes the higher price Bitcoin attains and we both know that court cases can be delayed sometimes which is something you have avoid in this situation so you can quickly make the Bitcoin purchase before it reaches halving. Because by that time the prices would have skyrocket. Even as we discuss Bitcoin is over $73k and still climbing, meaning they chances of getting it at a lower price is getting thinner by the day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jet Cash",
      "created_time": "March 13, 2024, 03:43:31 PM",
      "body": "The main issue is the contesting of a fraudulent parking charge. The payments for letters are trivial - abot £29 each at today's price. The big advantage for me is the avoidance of having to provide my bank details to the company that is promoting unenforceable ( in my opinion ) charges, and threatening motorists who don't understand the law. There is also the issue of an increase in the value of the domain name during the dispute, and I haven't decided how to handle that. They may try to seize it through an UDRP action, but I believe that have have posted legal disclaioomers to avoid this.  I need to be circumspect in discussing this, as no doubt this thread may be used in any legal action.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "March 13, 2024, 03:50:52 PM",
      "body": "Quote from: Jet Cash on March 13, 2024, 02:17:56 PMHave any members here tried something like this? Whilst Bitcoin is not legal tender in the UK, it is not banned as a medium of exchange or method of payment.Fighting the government with a demand that they reimburse you for correspondence using bitcoin?  No, I can say that I have.  Lol.Jet Cash, great to see you're still around, as always.  In your current predicament I'm afraid you're not going to get any satisfaction--and I don't think it'd matter what country you're in, there's no federal, state, or local government that's 1) going to accept that you don't want to provide your bank info, and 2) going to pay you back for using snail mail (with fiat or bitcoin).  I'm all for sticking it to the man in situations like parking violations and such, but you're tilting at windmills here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jet Cash",
      "created_time": "March 13, 2024, 04:32:59 PM",
      "body": "Hi there Mr Sceptical,It's not a parking fine that I am disputing, and that would be a local government issue as you suggest. I'm disputing an implied contract for parking in a supermarket car park, and the invoice ( which is not a fine ) was raised by the largest parking management business in the UK. I think they are deceitful, and intimidating, and I don't react well to being threatened when I believe I am in the right. I understand that any payments through the courts of to the government would need to be with legal tender. Gold Sovereigns and Brittanias are legal tender, and I would be happy to accept those.  ( fat chance of that though ).I have posted this on the web site, but I need to get them to acknowledge that they have read it.QuoteWe have an accomodation address, but please note, writing to this address can result in a delay of one month or more. We prefer email communications, and try to respond via email within 24 hours of receipt. Please note, that if you require a type written reply via the postal service, we make a charge of 0.0005 Bitcoin for this reply. Requesting written replies is confirmation that you have agreed to a contract for us to provide this service. We make no charge for email correspondence.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "March 13, 2024, 09:23:27 PMLast edit: March 13, 2024, 10:11:11 PM by franky1",
      "body": "sounds like you have fallen into the \"freeman/sovereign\" nonsense where you try to contest things via back charging everyone for your \"service\" to thememphasis: just asking for money is not a valid legal defence to quash their claim against you..your living in the 2000's nonsense era, but ill catch you up. it doesnt workthey have your details(van licence plate), if you dont pay, they take you to court, if you dont turn up they win by default, if you still dont pay, they add more charges/fee's interest, penalties, they then get a subsequent court order to then seek ability to call in the bailiffs, then say bye bye to your assets, which if they cant get to your copper/bitcoin, they will take your van. you cannot just demand payment for corresponding to an infringement you caused. hoping that just asking for counter payment/begging for payment will stop them..this is where the \"freeman/sovereign\" stupidity got things wrong, vv HOWEVER this can help you vvyou can however not just make service charge demands of payment for just responding to the allegations against you, hoping thats enough to stop them..but, you can make them aware that you are adding up your ongoing costs in responding to them, which is different..where by if you do have a valid claim of innocence where you know you can quash their allegations if it went to court. (EG their parking rules had a 'free for first 15 mins' and you can prove you only used the space for 10 minutes)IF you have a REAL LEGAL chance/reason to win at court. THEN you can use that ongoing list of costs you informed them of to get paid when they lose the case against you in court, as they have to pay the winning sides costs.but this is only if there is an obvious win on your side that you were in the right..in which case, with this knowledge of how things actually work and knowledge that you can win by REAL LEGAL reasonyou can then push them to settle outside of court(pre-court) if you have managed to explain your defence pre-court that shows its likely that you will win, side note if when informing them that IF it goes to court you will add on XX costs. by which they can settle pre-court at your lower amount of cost of correspondence..in short. you cant just quash a claim against you by just countering them with your own costs..in short. you CAN inform them of your ongoing costs and IF you have a LEGAL way of winning the case via evidence that proves they are incorrect about their claim against you. where by THEN you can get paid for wasting your timeside noteby informing them that they can respond via email free/cheaper rate, but if they continue to correspond via old snail-mail(postal mail).. then you can continue adding on the informed extra costs involved in accessing your old-postal mail box*... but..but it still requires you having a proper legal defence for why you are innocent of their claims against youside note, to get proof they have received your correspondence, send the mail via recorded signed postal service. thus you have proved they have signed for receiving your correspondence that lists estimates of ongoing costs to you for defending your case against them*mileage from your commute(driving) to the postal address+time, plus any costs of seeking legal advice to respond(the costs need to be meaningful and realistic and explained(dont just pick a random number, explain cost reasoning))",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "March 13, 2024, 09:40:01 PM",
      "body": "Quote from: Jet Cash on March 13, 2024, 03:27:12 PMWell I hope my claim does go to court. It will highlight the fact that Bitcoin can be used in settlement of a charge when you don't trust the defendant with your bank details. The more that judges and lawyers are made aware of this, then the better it will be for Bitcoin and the \"ordinary\" people.In other words this could be another way of you popularizing bitcoin right under the nose of the law by using this circumstance and, peradventure should things go in your favour with the whole court proceedings then it could serve as a precedent that could be use for references in similar cases in the future.  Looking at the circumstance surrounding the entire situation the odds to win seem to be high on your side so I just hope you come out victorious on that. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}