{
  "id": "topic_5454732",
  "title": "540194366@qq.com",
  "author": "540194366@qq.com",
  "created_time": "June 01, 2023, 08:24:26 AM",
  "content": "Adventure Coin Power(ACP)This introduction outlines the overall developmental direction of the project, without delving into technical details.Disclaimer: The goal of this project is not to improve or upgrade the existing blockchain technology on a technical level, but to build on the existing blockchain technology, relying on its security, and following the rules of this project, to allow participants to experience the \"brilliance\" of human nature, and to provide participants with the potential for profit or loss.Total token supply for this project: There is no upper limit, nor is there a \"lower limit\".Token acquisition rules: Power, Adventure Block rewardsProject Wallet: The wallet is different from the existing blockchain wallets, in the same client, there are two types of wallets. One is a conventional wallet, also known as a cold wallet, where the number of tokens does not change; the other is an adventure wallet, where the number of tokens in the adventure wallet will change under certain special circumstances. The specific rules can be found in the \"Block Setting Rules\".Block Setting Rules: One regular block per minute, initially each block generates 100 tokens, subsequently, every 43,200th block or its multiple decreases by 5% (rounded to four decimal places). Special Rule: Every 43,200th block or its multiple is an Adventure Block, which also generates 100 tokens. However, Adventure Blocks have two properties, Explosion and Compression. The Explosion property increases the number of tokens held in the Adventure Wallets of all participants by tenfold, while the Compression property reduces the number of tokens in the Adventure Wallets of all participants by tenfold.Sources of developer income and distribution are open and transparent.Income sources: 1. 1% of the token amount transferred out of the Adventure Wallet by participants. 2. Community donations.Income distribution: 1. Project development and community distribution. 2. Developer income (not exceeding 30% of total income, cannot be predicted). 3. Public welfare undertakings.The vision of this project is to allow participants to continuously experience decision-making, fill participants with hope, and give all participants the chance to miss out and start over.We welcome development partners to offer valuable suggestions, allowing us to \"play the game of life\".",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454732",
  "comments": []
}