{
  "id": "topic_5527584",
  "title": "As-Soon-As",
  "author": "As-Soon-As",
  "created_time": "January 24, 2025, 09:48:30 AMLast edit: January 24, 2025, 03:16:12 PM by As-Soon-As",
  "content": "Bitcoin Donations Are Pouring In for Ross Ulbricht—Who Might Already Be Sitting on $47M in Old WalletsUntouched Bitcoin wallets potentially linked to Ross Ulbricht and Silk Road are now worth over $47 million.Ross Ulbricht currently has 430 Bitcoins in his wallet worth $47 million, which is the biggest success at the moment. Because he has served more than 12 13 years in prison, his wallet has benefited the most from being dormant. But I want to ask if he has multiple wallets that could potentially hold more Bitcoins, and what his future plans are for these dormant Bitcoins at the moment?.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5527584",
  "comments": [
    {
      "author": "Die_empty",
      "created_time": "January 24, 2025, 10:50:04 AM",
      "body": "Quote from: As-Soon-As on January 24, 2025, 09:48:30 AMRoss Ulbricht currently has 430 Bitcoins in his wallet worth $47 million, which is the biggest success at the moment. Because he has served more than 12 years in prison, his wallet has benefited the most from being dormant. But I want to ask if he has multiple wallets that could potentially hold more Bitcoins, and what his future plans are for these dormant Bitcoins at the moment?.The ownership of the wallet has not been confirmed, all this news coming up is based on speculations. It is also possible that the funds in the wallet have been discovered and frozen by the government. If the amount really belongs to him, it is a good sum to start his life afresh after more than a decade in custody. OP your question about what will be his plan for the coins is strange. How do you think people here will know his plans except those who are close to him? He can do anything he wants with the money. Since he is still young, let me just speculate that he might decide to start a tech company or donate some to charity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "January 24, 2025, 11:16:19 AM",
      "body": "Quote from: As-Soon-As on January 24, 2025, 09:48:30 AMBitcoin Donations Are Pouring In for Ross Ulbricht—Who Might Already Be Sitting on $47M in Old WalletsUntouched Bitcoin wallets potentially linked to Ross Ulbricht and Silk Road are now worth over $47 million.Ross Ulbricht currently has 430 Bitcoins in his wallet worth $47 million, which is the biggest success at the moment. Because he has served more than 12 years in prison, his wallet has benefited the most from being dormant. But I want to ask if he has multiple wallets that could potentially hold more Bitcoins, and what his future plans are for these dormant Bitcoins at the moment?.We can’t be sure if those Bitcoins were really his. I mean, he was jailed for many years, and during that time, he might have forgotten about them or didn’t believe Bitcoin would reach this level today. So maybe the donations are the only thing he can actually enjoy now.And if there are wallets linked to Silk Road, those are still illegal and could possibly be confiscated by the government. It’s not safe for him now that he’s free. He should just start fresh with clean money, like those donations, something he can justify.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "January 24, 2025, 11:23:48 AM",
      "body": "Quote from: freedomgo on January 24, 2025, 11:16:19 AMWe can’t be sure if those Bitcoins were really his. I mean, he was jailed for many years, and during that time, he might have forgotten about them or didn’t believe Bitcoin would reach this level today. So maybe the donations are the only thing he can actually enjoy now.And if there are wallets linked to Silk Road, those are still illegal and could possibly be confiscated by the government. It’s not safe for him now that he’s free. He should just start fresh with clean money, like those donations, something he can justify.We can be sure about it now but with a very early Bitcoin adopter like Ross, he possibly bought bitcoin by himself and not all of his bitcoins are from Silk Road operation and service fee. The challenge is how to prove and classify his bitcoins from Silk Road and not from Silk Road.I believe this information was identied by government years ago, but it was not publicly announced. Trump pardoned Ross and maybe if possible he can order a full report about Ross and his bitcoins now. Trump just ordered a team to release full report on Kenedy.Trump orders plan for release of JFK and MLK assassination files.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "January 24, 2025, 11:25:22 AM",
      "body": "Quote from: freedomgo on January 24, 2025, 11:16:19 AMQuote from: As-Soon-As on January 24, 2025, 09:48:30 AMBitcoin Donations Are Pouring In for Ross Ulbricht—Who Might Already Be Sitting on $47M in Old WalletsUntouched Bitcoin wallets potentially linked to Ross Ulbricht and Silk Road are now worth over $47 million.Ross Ulbricht currently has 430 Bitcoins in his wallet worth $47 million, which is the biggest success at the moment. Because he has served more than 12 years in prison, his wallet has benefited the most from being dormant. But I want to ask if he has multiple wallets that could potentially hold more Bitcoins, and what his future plans are for these dormant Bitcoins at the moment?.We can’t be sure if those Bitcoins were really his. I mean, he was jailed for many years, and during that time, he might have forgotten about them or didn’t believe Bitcoin would reach this level today. So maybe the donations are the only thing he can actually enjoy now.And if there are wallets linked to Silk Road, those are still illegal and could possibly be confiscated by the government. It’s not safe for him now that he’s free. He should just start fresh with clean money, like those donations, something he can justify.And it's really hard to understand how his pardon works. I mean if that is his Bitcoin wallet and it starts to move after his released then what will be the repercussions, could he be off the hook or not?Or can he go and negotiate with the government? Or it is subject for forfeiture?I guess we have a lot of more questions that answers if we start to see those addresses moving in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hagart",
      "created_time": "January 24, 2025, 11:34:34 AM",
      "body": "Quote from: freedomgo on January 24, 2025, 11:16:19 AM~snipped~And if there are wallets linked to Silk Road, those are still illegal and could possibly be confiscated by the government. It’s not safe for him now that he’s free. He should just start fresh with clean money, like those donations, something he can justify.We all know that there are several ways to make those “illegal” bitcoins disappear and appear clean in other wallets. Although it all depends on how Ulbricht wants to start again, but I believe (after what Ross has experienced) that he will not do anything again to jeopardize his freedom. His future is uncertain at this time, but now that he is free again and when a reasonable amount of time has passed, I am sure we will hear from him again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "January 24, 2025, 11:38:46 AMLast edit: January 24, 2025, 12:33:52 PM by Josefjix",
      "body": "Quote from: Die_empty on January 24, 2025, 10:50:04 AMQuote from: As-Soon-As on January 24, 2025, 09:48:30 AMRoss Ulbricht currently has 430 Bitcoins in his wallet worth $47 million, which is the biggest success at the moment. Because he has served more than 12 years in prison, his wallet has benefited the most from being dormant. But I want to ask if he has multiple wallets that could potentially hold more Bitcoins, and what his future plans are for these dormant Bitcoins at the moment?.The ownership of the wallet has not been confirmed, all this news coming up is based on speculations. It is also possible that the funds in the wallet have been discovered and frozen by the government. If the amount really belongs to him, it is a good sum to start his life afresh after more than a decade in custody. How can such wallet be frozen by the government since it's a decentralized wallet, do the government has access to the private key or seed phrase to the wallet, I don't think it's possible. If the guy has everything concerning the wallet, then it's going to be a great moment for him to do whatever he wants to do with it.If you should know whether he has other multiple wallets, then probably he going to divide and share the balance between wallets he has, explorer will show all the transaction that would be done on the wallet as well, you could check out from the public key possibly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "freedomgo",
      "created_time": "January 24, 2025, 12:24:46 PM",
      "body": "Quote from: MusaMohamed on January 24, 2025, 11:23:48 AMQuote from: freedomgo on January 24, 2025, 11:16:19 AMWe can’t be sure if those Bitcoins were really his. I mean, he was jailed for many years, and during that time, he might have forgotten about them or didn’t believe Bitcoin would reach this level today. So maybe the donations are the only thing he can actually enjoy now.And if there are wallets linked to Silk Road, those are still illegal and could possibly be confiscated by the government. It’s not safe for him now that he’s free. He should just start fresh with clean money, like those donations, something he can justify.We can be sure about it now but with a very early Bitcoin adopter like Ross, he possibly bought bitcoin by himself and not all of his bitcoins are from Silk Road operation and service fee. The challenge is how to prove and classify his bitcoins from Silk Road and not from Silk Road.Those are just rumors, though. When the government conducted its investigation, they likely traced everything connected to Ross. Maybe he cooperated well, which could be why he was granted a pardon after his case was reviewed.Quote from: Jating on January 24, 2025, 11:25:22 AMAnd it's really hard to understand how his pardon works. I mean if that is his Bitcoin wallet and it starts to move after his released then what will be the repercussions, could he be off the hook or not?Or can he go and negotiate with the government? Or it is subject for forfeiture?I guess we have a lot of more questions that answers if we start to see those addresses moving in the future.Whatever the reason for the pardon, that’s entirely up to the government. It’s the president’s power to grant one to anyone they choose. As for the funds we’re speculating about, I think Ross would be more focused on enjoying his newfound freedom rather than touching anything connected to Silk Road. He wouldn’t want to risk messing up his free status. So I wouldn’t dwell on that topic too much as this guy just wants to enjoy his freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hero_the_bossman",
      "created_time": "January 24, 2025, 12:48:50 PM",
      "body": "Quote from: freedomgo on January 24, 2025, 12:24:46 PMThose are just rumors, though. When the government conducted its investigation, they likely traced everything connected to Ross. Maybe he cooperated well, which could be why he was granted a pardon after his case was reviewed.We would never know the details.But - that may be the case too.Hopefully, he would spend the rest of his time with pleasure being free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ziskinberg",
      "created_time": "January 24, 2025, 01:05:21 PM",
      "body": "Quote from: hero_the_bossman on January 24, 2025, 12:48:50 PMHopefully, he would spend the rest of his time with pleasure being free. Let’s just hope he won’t be tempted to get involved in any illegal transactions.Since a pardon can only be granted once to a person, I think Ross is smart enough to understand that there won’t be any second chances if he gets into trouble again especially something that could lead to life imprisonment. He has plenty of time to make up for the years he lost, so I doubt he’s even thinking about the things we’re speculating here. Most likely, he’s just enjoying his freedom, breathing some fresh air, and spending time with his family not worrying about Bitcoin for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AirtelBuzz",
      "created_time": "January 24, 2025, 02:37:25 PM",
      "body": "Quote from: As-Soon-As on January 24, 2025, 09:48:30 AMRoss Ulbricht currently has 430 Bitcoins in his wallet worth $47 million, which is the biggest success at the moment. Because he has served more than 12 years in prison, his wallet has benefited the most from being dormant. The wallets you mentioned may not belong to Ross Ulbricht even the bitcoins in those wallets may not belong to him. Because no one has yet been able to confirm that they are his Bitcoin or his wallet. Maybe everyone is commenting based on assumptions. He's been in jail for a long time so it's natural that he might have forgotten them But many have commented that he was able to saving his seed phrase correctly. We saw that the Kraken donated some amount of Bitcoin to him.Grogan thinks these are Ross Ulbricht's Bitcoins and he tweeted about it recently.QuoteGrogan did go on to cast doubt that Ross still had the private keys required to recover the wallets, saying, “We will know soon enough.” The market will be keeping a close eye on any movement from the various wallets.Donations Pour into Ross Ulbricht Bitcoin Wallet Including Kraken",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "January 24, 2025, 03:07:27 PM",
      "body": "It seems the coins would be confiscated by the US because it was linked to Silk Road, while the coins he got from Freeross.org it just 2.6 BTC, that's a good amount, but not something that can affect the market.As long as the coins not moved, I will consider them as lost coins because Ross might forget with the seed phrase.Honestly 430 Bitcoin is small if we compare with the current Bitcoin market cap has.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandorak",
      "created_time": "January 24, 2025, 03:29:51 PM",
      "body": "Quote from: Die_empty on January 24, 2025, 10:50:04 AMThe ownership of the wallet has not been confirmed, all this news coming up is based on speculations. It is also possible that the funds in the wallet have been discovered and frozen by the government. If the amount really belongs to him, it is a good sum to start his life afresh after more than a decade in custody. OP your question about what will be his plan for the coins is strange. How do you think people here will know his plans except those who are close to him? He can do anything he wants with the money. Since he is still young, let me just speculate that he might decide to start a tech company or donate some to charity.     I was thinking the same thing as you, the government doesn't have access to Ross Bitcoins, because if they did they would have already frozen or confiscated them since he was tried and then jailed.Even today there is no clear evidence that the Bitcoin actually belongs to Ross Ulbricht, just because Conor Grogan found some wallets connected to Ross doesn't mean he actually owned it in the first place, it's all just assumptions until there is evidence or Ross himself speaks up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "January 24, 2025, 03:36:00 PM",
      "body": "Quote from: As-Soon-As on January 24, 2025, 09:48:30 AMBitcoin Donations Are Pouring In for Ross Ulbricht—Who Might Already Be Sitting on $47M in Old WalletsUntouched Bitcoin wallets potentially linked to Ross Ulbricht and Silk Road are now worth over $47 million.Ross Ulbricht currently has 430 Bitcoins in his wallet worth $47 million, which is the biggest success at the moment. Because he has served more than 12 13 years in prison, his wallet has benefited the most from being dormant. But I want to ask if he has multiple wallets that could potentially hold more Bitcoins, and what his future plans are for these dormant Bitcoins at the moment?.Well I am not sure about the truthfulness of this news! I know he has been pardoned by Donald Trump for some unknown reasons. But if he has obtained the Bitcoins by selling illegal stuffs via darknet, I am not sure if he is going to get thos3 back. The entire situation with Ross is pretty mysterious to be honest. It opens up a lot of questions and speculations. I am sure we will get the clarity in due course of time..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jayoh",
      "created_time": "January 24, 2025, 03:39:10 PM",
      "body": "Kraken Donates $111,111 in Bitcoin to Ross Ulbricht Following Presidential Pardon (link: https://www.coinspeaker.com/kraken-donates-111111-bitcoin-ross-ulbricht-following-presidential-pardon/)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Callido",
      "created_time": "January 24, 2025, 04:02:53 PM",
      "body": "Quote from: As-Soon-As on January 24, 2025, 09:48:30 AMBitcoin Donations Are Pouring In for Ross Ulbricht—Who Might Already Be Sitting on $47M in Old WalletsUntouched Bitcoin wallets potentially linked to Ross Ulbricht and Silk Road are now worth over $47 million.Ross Ulbricht currently has 430 Bitcoins in his wallet worth $47 million, which is the biggest success at the moment. Because he has served more than 12 13 years in prison, his wallet has benefited the most from being dormant. But I want to ask if he has multiple wallets that could potentially hold more Bitcoins, and what his future plans are for these dormant Bitcoins at the moment?.Just coming across this now, never knew anything concerning this but reading through seems he has been pardoned and for the information nothing has been found certain, wallet still dormant as of now like for 13 years ago, one thing is for him able to claim ownership or still having access to the wallet.If the wallet is claimed and everything belongs to him then fuck with what he does with it, 13 years is a long time who should care what he does, personally i would sell good portions out and start up a life, long time in confinement and having something to build upon, i wouldn't think twice about selling enough that will serve me right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "January 24, 2025, 04:29:09 PM",
      "body": "The government would have to publicly disclose that they seized any of his personal bitcoin, and to my knowledge they have not done so.They would need to have a court order to seize (and then enter into evidence) any of his assets including bitcoin or else it would be an unlawful seizure and Ulbrecht could sue to get it back.So if he has any bitcoin stored away he should still have access to it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "January 24, 2025, 04:49:18 PM",
      "body": "Quote from: Die_empty on January 24, 2025, 10:50:04 AMQuote from: As-Soon-As on January 24, 2025, 09:48:30 AMRoss Ulbricht currently has 430 Bitcoins in his wallet worth $47 million, which is the biggest success at the moment. Because he has served more than 12 years in prison, his wallet has benefited the most from being dormant. But I want to ask if he has multiple wallets that could potentially hold more Bitcoins, and what his future plans are for these dormant Bitcoins at the moment?.The ownership of the wallet has not been confirmed, all this news coming up is based on speculations. It is also possible that the funds in the wallet have been discovered and frozen by the government. If the amount really belongs to him, it is a good sum to start his life afresh after more than a decade in custody.Yeah so is my insights too. Series of speculations keep reigning that he is the owner of the wallet while it has never been realistically proven to be sure.The wallets were only traced to be linked and besides... Even if it is find that he owned a wallet amongst those circle of linked wallets it may not really mean he owned them all. Bit could be as a course of past transaction relativities such as the P2P that may have brought about this speculative linkage that keep informing that Ross Ulbricht's is the rightful owner.Quote from: Die_empty on January 24, 2025, 10:50:04 AMOP your question about what will be his plan for the coins is strange. How do you think people here will know his plans except those who are close to him? He can do anything he wants with the money. Since he is still young, let me just speculate that he might decide to start a tech company or donate some to charity.     Admit: Assuming he is the owner of those wallets, I am sure no one knows what would be his plans on how to utilize or plans for the money.We might be hoping he will do some good expenses about it While he might just want to burst out of service just to visit the casino I gamble hell out of himself believing he would have a lot of savings even if he has also lost a lot since the amount is seemed too large.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "January 24, 2025, 04:54:36 PM",
      "body": "Quote from: Callido on January 24, 2025, 04:02:53 PMJust coming across this now, never knew anything concerning this but reading through seems he has been pardoned and for the information nothing has been found certain, wallet still dormant as of now like for 13 years ago, one thing is for him able to claim ownership or still having access to the wallet.If the wallet is claimed and everything belongs to him then fuck with what he does with it, 13 years is a long time who should care what he does, personally i would sell good portions out and start up a life, long time in confinement and having something to build upon, i wouldn't think twice about selling enough that will serve me right. Ross William Ulbricht is purely a darknet master operator. Why do we think we can get any solid information when we know ho good he is to manipulate the web. With my research the 47 Bitcoin is his and it is own by the silkroad which happens to be his as well. He is no fool to start tampering with the 47 Bitcoin now especially now that everyone is expecting to see some amount of Bitcoin get transferred from any of his wallet to another. Any mistake of doing that will prove that he is the rightful owner and he will be at a great risk even the government will be at his tail. Dont forget he was accused of money laundering, hacking and conspiracy to fraudulent act. How he spend his money is very crucial at this point in his life.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "January 24, 2025, 05:03:47 PM",
      "body": "We don’t know for sure. We can only assume that Ross Ulbricht managed to save some of his bitcoins. If so, he managed to make a huge profit in 13 years (his initial capital increased many times). If so, then we can only congratulate him!It is quite possible that during 13 years of imprisonment, he had a lot of time to think about how he wants to live in freedom. He is still quite young, so the money will allow him to realize all his plans, goals and ideas. Perhaps Ross Ulbricht will want to travel and visit all the countries located on all continents. Perhaps he will want to buy expensive real estate or get married. The accumulated money will allow him to realize all his desires. This once again proves that the best strategy for the first cryptocurrency is HODL.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}