{
  "id": "topic_5437961",
  "title": "SeeBiscuit",
  "author": "SeeBiscuit",
  "created_time": "February 03, 2023, 06:59:56 PMLast edit: May 08, 2024, 08:13:11 AM by SeeBiscuit",
  "content": "",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437961",
  "comments": [
    {
      "author": "T3PR00T",
      "created_time": "February 03, 2023, 07:09:28 PM",
      "body": "Quote from: SeeBiscuit on February 03, 2023, 06:59:56 PMOk, your move admins. Is this me or not? Admin don't give a dime. You can move it to off-topic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "February 03, 2023, 08:09:10 PM",
      "body": "OP, I think you have a problem regarding socializing, and your post doesn't make any sense, what do you want? Note that your post is incoherent even to me aka master of incoherence. 😉",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "February 03, 2023, 08:46:22 PM",
      "body": "Quote from: SeeBiscuit on February 03, 2023, 06:59:56 PMThankfully IMGBB is back up, they were down earlier!Ok, your move admins. Is this me or not? My argument is that this image is not possible unless the owner of SeeBiscuit1@proton.me made it. No, it can be made by anyone who would be able to use paint and the image posted here:Quote from: SeeBiscuit on January 30, 2023, 01:21:18 AMHere's a sketch I made using PowerPoint: Same hour and date, same battery life, same tabs.... Quote from: SeeBiscuit on February 03, 2023, 08:28:23 PMYou can't call me incoherent if I'm going to be responsible for onboarding many new bitcoin investors onto this forum.Let's start with the easy things first, secure your account, learn to use a password manager, and how to sign a message!Investors, later on!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "drwhobox",
      "created_time": "February 03, 2023, 11:10:26 PM",
      "body": "Quote from: SeeBiscuit on February 03, 2023, 08:30:02 PMBut I can make some sick art for you guys. I'll just put it here from now on.You get free art until you decide to not act like an idiot and answer the damn question the thread is asking. :3I found your sick arts are very disgusting, in fact, I assume you don't even make them yourself, these are just some cheap Ai art, not even well-optimized Ai art. First, learn how to interact with people on a forum then try to make some Ai-created artworks. QuoteBut I can make some sick art for you guys. I'll just put it here from now on.NO thanks, I don't need your cheap Ai art.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "February 04, 2023, 12:32:10 AM",
      "body": "Please refrain from posting off topic, large images, this doesn't belong on meta. If your topic gets locked or trashed  don't say I didn't warn you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}