{
  "id": "topic_5526349",
  "title": "DPHOR",
  "author": "DPHOR",
  "created_time": "January 14, 2025, 12:12:36 AM",
  "content": "I was surfing twitter few days ago and i made a screenshot this picture to ask question here if i can get the best way to secure our seedphrase.Though read some post over here that states that we should store our seedphrase many place should emergency purpose or if we lost our device we can restore them back. My questions; If you duplicate your seedphrase and save them in your house and travel to the neighboring country where you spend like 2 weeks or more, suddenly you were phone about your house got melted down with your noticed and your seedphrase and hardware/software wallet are inside the building that got burnt what would you do?Do you also agree that we should take at least a copy of our seedphrase attached into our traveling box with our luggages should such incident of wildfire outbreak happens again or such as natural disaster happens. Is that the best practice if i may asked and if you say \"No\" what about your house melting down just as what happened. What could be your reaction when such happened.Let discuss, as we learn the best way to secure our seedphrase.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5526349",
  "comments": [
    {
      "author": "Orpichukwu",
      "created_time": "January 14, 2025, 12:19:00 AM",
      "body": "Let's not use the incident that happened in CA as a reason to put ourselves in danger. If you shuffle around this forum, you will see threads of how to safekeep your seed phrase from danger of water and fire.It's safer for me to leave my seed phrase at home and travel out as long as I don't want to spend any of that Bitcoin. Have you also imagined the danger of carrying a piece of paper that contains the seed phrase to 100 Bitcoin? Mistakes can happen; you can be searching for something and leave that in a hotel room, where you will accidentally make the roomkeeper rich, or your luggage can be searched in an airport, where the safety of that wallet is not entirely guaranteed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Btcalysis",
      "created_time": "January 14, 2025, 12:30:03 AM",
      "body": "Let me give you an easy step which is just one among many.Use passphrase with your seed phrase. Safe the seed phrase in a bank that is not in the state that you are living. Save the passphrase with your father, mother, wife, children and yourself. Tell them that the passphrase is very important. Always remind them that they should not lost it.Make sure that the bank you save the seed phrase is not in the same state with your family or some of your family that you save your passphrase with.Save the seed phrase and passphrase with yourself but not together. You have two seed phrase backup which is with you and the bank in a different state. You also have multiple passphrase backup.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "January 14, 2025, 02:03:21 AM",
      "body": "If I have the back up seed phrase with me, I will directly to access the wallet using other devices. I will make sure that I still have the access. That is why we must make a back up for the important thing like that.I can lose the hardware wallet anytime but if I have the seed phrase and all things needed, I will not have to worry because I can access it again. Perhaps I agree that we can take a copy of our seed phrase but we must keep that secretly so no one will know about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "January 14, 2025, 02:06:30 AM",
      "body": "Your backup should be kept in separate locations. You don't just keep a single backup. Neither is it enough to keep separate backups in different spots inside a single building or house. It also helps if your backup isn't just written on a piece of paper. There's a wide array of options out there for metal backups that could withstand fire and extreme heat. Also, personally, I travel with a copy of my phrase. This might not be advisable but I do this in case I need to have an emergency access to my funds. It's probably best not to keep it in your wallet, though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "January 14, 2025, 02:16:16 AM",
      "body": "Quote from: DPHOR on January 14, 2025, 12:12:36 AMFirst of all, having your seed phrase written only on a sheet of paper on your office seems really dangerous in itself with or without the fires. With 100 bitcoins, at the very least I expect this person to store his seed phrase on a fireproof vault. Second, again emphasizing that when you own that much bitcoin you need to be less confident and make sure you have copies of everything. For one, do not store all of your 100 bitcoins in one wallet and you shouldn't store your seed phrase in just one paper with no copy elsewhere. Quote If you duplicate your seedphrase and save them in your house and travel to the neighboring country where you spend like 2 weeks or more, suddenly you were phone about your house got melted down with your noticed and your seedphrase and hardware/software wallet are inside the building that got burnt what would you do?As long as you have another copy of your seed phrase you will be fine but if you really have nothing then I am sorry but I doubt you can do anything about that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "January 14, 2025, 04:35:55 AM",
      "body": "Quote from: kotajikikox on January 14, 2025, 02:16:16 AMFirst of all, having your seed phrase written only on a sheet of paper on your office seems really dangerous in itself with or without the fires. With 100 bitcoins, at the very least I expect this person to store his seed phrase on a fireproof vault. Second, again emphasizing that when you own that much bitcoin you need to be less confident and make sure you have copies of everything. For one, do not store all of your 100 bitcoins in one wallet and you shouldn't store your seed phrase in just one paper with no copy elsewhere. Right. For a guy with 100 bitcoins, he wasn't very smart. On top of that he keeps both the HW and the paper seeds in the same place. I have much less and I have it stored much more securely than that guy. What he has done is something like having 10 million dollars in banknotes stashed away in his house and going on holiday so quietly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "January 14, 2025, 05:18:34 AM",
      "body": "There is more than one mistake, it is a mistake to save the seed phrase on paper at home because as we saw in this incident the house was exposed to fire and thus the pass phrase paper was burned, so it is better to store it on a fire and water resistant metal piece.It is also a mistake to carry the paper or metal piece on which the seed phrase is written while traveling because this exposes it to the risk of theft or confiscation by the police or losing it for any other reason, so if you want to carry the seed with you while traveling, you must camouflage it well so that it is not discovered, for example, cut it into small, scattered pieces and put it in different places that are not eye-catching.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "January 14, 2025, 05:58:59 AM",
      "body": "It's really unbelievable someone can think just back up with a piece of paper, their wallet will be safe.You need at least two back up, one is something you can leave in your house and resistant against anything e.g. engraved steel plate. Use stainless steel because it can resist against corrosion, fire, etc. The disadvantage is you might lost your steel plate due to tsunami or tornado.To overcome against that, you can use something that you carry to anywhere and no one will notice it.Example hiding your seed phrase inside a pencil.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "January 14, 2025, 06:12:58 AMLast edit: January 14, 2025, 06:23:42 AM by headingnorth",
      "body": "I don't believe in having only a physical copy of my seedphrase, especially if you live in an area prone to natural disaster or war. In theory putting your seedphrase online exposes you to hackers, but in reality far more people lose their seedphrase because they lost the physical copy that was stored in their drawer or closet, or lost from physical damage, natural disaster, war, etc. Or they simply forgot where they put it or threw it away by mistake.It also depends on how you do it. But there are relatively secure ways to store things online IMO. This is just a suggestion and my personal opinion and may not be right for everyone. Every person has to determine the best storage method for their own particular situation, technical skill level and comfort level. For example, using a bitcoin passphrase (also called a hidden wallet) along with a password manager. So even if someone hacked your online account and stole your seedphrase, it would be useless to them without knowing the passphrase. Tens of millions of people use a password manager everyday to securely store sensitive passwords for their online banking and other financial websites, so to me that is a good enough way to secure your seedphrase. So if your house burns down or gets destroyed by a flood or act of war, you won't lose your seedphrase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2Pizza410000BTC",
      "created_time": "January 14, 2025, 06:35:08 AM",
      "body": "Quote from: DPHOR on January 14, 2025, 12:12:36 AMI was surfing twitter few days ago and i made a screenshot this picture to ask question here if i can get the best way to secure our seedphrase.Though read some post over here that states that we should store our seedphrase many place should emergency purpose or if we lost our device we can restore them back. My questions; If you duplicate your seedphrase and save them in your house and travel to the neighboring country where you spend like 2 weeks or more, suddenly you were phone about your house got melted down with your noticed and your seedphrase and hardware/software wallet are inside the building that got burnt what would you do?Do you also agree that we should take at least a copy of our seedphrase attached into our traveling box with our luggages should such incident of wildfire outbreak happens again or such as natural disaster happens. Is that the best practice if i may asked and if you say \"No\" what about your house melting down just as what happened. What could be your reaction when such happened.Let discuss, as we learn the best way to secure our seedphrase. I have saved my wallet seed at home and also on my mobile device. If I go on a long trip and if any accident happens during the trip, I can restore my invested wallet using the seed at home or if any accident happens at home and my wallet seed gets corrupted, I can restore it using the seed saved on my device even if I am away. Therefore, the invested wallet, be it a hardware wallet or a software wallet, should be stored at home and on my secure device. However, the invested wallet seed should be carried very carefully while traveling because it would definitely be very risky for me if someone finds out.But I don't understand why he kept his 100 bitcoins in his office. 100 bitcoins are very valuable. Of course he should have kept the 100 bitcoins at home or carried a copy of his wallet seed with him. If he had a copy of his wallet seed, he could have recovered his bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "January 14, 2025, 06:56:08 AM",
      "body": "Quote from: DPHOR on January 14, 2025, 12:12:36 AMLet discuss, as we learn the best way to secure our seedphrase. I would never consider travelling with my seed phrase except if I have need for them in the place I am travelling to. The highest number of thefts happens in transit. You are not also sure of safety in the place you are going to. Keeping your seed phrase in a fire and waterproof metallic material and keeping them in different locations which are not close to each other is ideal. Quote from: Btcalysis on January 14, 2025, 12:30:03 AMLet me give you an easy step which is just one among many.Use passphrase with your seed phrase. Safe the seed phrase in a bank that is not in the state that you are living. Save the passphrase with your father, mother, wife, children and yourself. Tell them that the passphrase is very important. Always remind them that they should not lost it.Make sure that the bank you save the seed phrase is not in the same state with your family or some of your family that you save your passphrase with.Save the seed phrase and passphrase with yourself but not together. You have two seed phrase backup which is with you and the bank in a different state. You also have multiple passphrase backup.Keeping your seed phrase in a bank is the same thing as keeping your money in a bank. Non-custodian wallets are designed to make you your bank. Keeping your seed phrase with your relatives might also be risky. These days you can't trust close relatives or friends with money. But if you trust anyone, it would not be a bad idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FinneysTrueVision",
      "created_time": "January 14, 2025, 07:05:17 AM",
      "body": "For redundancy, you should have multiple backups and place them in different locations. If you are going to travel, then perhaps you should buy an extra hardware wallet that you can take with you and keep your main wallet stored in a safe that can withstand natural disasters. It is also worth considering using multi-share backups, so that your funds cannot be easily stolen if one of your shares were to get compromised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "January 14, 2025, 07:09:04 AM",
      "body": "QuoteDo you also agree that we should take at least a copy of our seedphrase attached into our traveling box with our luggages should such incident of wildfire outbreak happens again or such as natural disaster happens. Is that the best practice if i may asked and if you say \"No\" what about your house melting down just as what happened. What could be your reaction when such happened.There's no such thing as absolute safety in this reality. Your house might burn to the ground. You might die and your relatives might inherit your property. Sh*t happens. I usually don't take my seed phrase with me, when I go outside my house. Such thing would happen to my house and it would be devastating, but we shouldn't be too obsessed with our material wealth. Money and assets just come and go, what's more important is preserving our own lives and moving on. House insurance would be a good move, but I doubt that the insurance company would recover the monetary value of lost Bitcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "headingnorth",
      "created_time": "January 14, 2025, 07:15:36 AM",
      "body": "Quote from: FinneysTrueVision on January 14, 2025, 07:05:17 AMFor redundancy, you should have multiple backups and place them in different locations. If you are going to travel, then perhaps you should buy an extra hardware wallet that you can take with you and keep your main wallet stored in a safe that can withstand natural disasters. It is also worth considering using multi-share backups, so that your funds cannot be easily stolen if one of your shares were to get compromised.Different locations? What do you mean by that? Most people only have one house to store a physical copy, so it doesn't matter if you hide it in more than one location in your house if your whole house burns down. You could store an extra copy in a safety deposit box at your local bank, but that won't do you any good if the whole city burns down along with the bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "betswift",
      "created_time": "January 14, 2025, 07:24:14 AM",
      "body": "Quote from: maydna on January 14, 2025, 02:03:21 AMIf I have the back up seed phrase with me, I will directly to access the wallet using other devices. I will make sure that I still have the access. That is why we must make a back up for the important thing like that.I can lose the hardware wallet anytime but if I have the seed phrase and all things needed, I will not have to worry because I can access it again. Perhaps I agree that we can take a copy of our seed phrase but we must keep that secretly so no one will know about that.Agreed. It's important to have backups even for the backups, and having it on the sheet of paper probably would need other measures too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoBuds",
      "created_time": "January 14, 2025, 07:24:50 AM",
      "body": "Any method has its pros and cons, and risks always exist around us, especially unexpected accidents caused by nature that we cannot foresee. So use whatever solution you feel gives you the most security to store your seed phrase. Like me, many people feel insecure about sharing seed phrases with loved ones or carrying backups when traveling or working away from home…but I do it anyway and have been fine for years. I have never encountered any of the risks that people imagine, I'm not saying it can't happen but they are very rare. We don't need to exaggerate things, the CA incident was a rare incident and doesn't happen often so don't obsess over it too much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "john_egbert",
      "created_time": "January 14, 2025, 07:32:50 AM",
      "body": "Quote from: CryptoBuds on January 14, 2025, 07:24:50 AMAny method has its pros and cons, and risks always exist around us, especially unexpected accidents caused by nature that we cannot foresee. So use whatever solution you feel gives you the most security to store your seed phrase. Like me, many people feel insecure about sharing seed phrases with loved ones or carrying backups when traveling or working away from home…but I do it anyway and have been fine for years. I have never encountered any of the risks that people imagine, I'm not saying it can't happen but they are very rare. We don't need to exaggerate things, the CA incident was a rare incident and doesn't happen often so don't obsess over it too much.Yea, I agree - however, we are talking about these rare cases where the backup and planning would save the funds in question, be it this situation or another. And it's great that you have trust in your loved ones, that's very important too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "January 14, 2025, 07:37:11 AM",
      "body": "Quote from: DPHOR on January 14, 2025, 12:12:36 AMDo you also agree that we should take at least a copy of our seedphrase attached into our traveling box with our luggages should such incident of wildfire outbreak happens again or such as natural disaster happens. Do people on Twitter really suggest that? It sounds unbelievable that they tell you to carry around a backup worth 100 BTC whenever you travel. We have many cases of people forgetting their stuff, or losing in transit and there's little to nothing they can do to solve that. Do they believe they'll be immune to that? Not to mention the chance of another fire outbreak happens is likely smaller than losing your luggage in an airport. Sounds like a hassle compared to improving your backup choice like using a fire-resistant metal as mentioned above.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "January 14, 2025, 07:42:22 AM",
      "body": "There is not a 100% solution to this problem. No matter which route you decide to follow, it will always have risks.If you carry your seed words with you, you might lose them or get robbed.If you leave them home, the house might get burned or again you might get robbed.If you create multiple copies of your seed words then you will increase your risks of getting robbed.What about brain wallet?Have you heard what dementia does to a person?…Sometimes we just need a bit of luck to survive. Sometimes we are unlucky and it doesn’t matter what precautions you take.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}