{
  "id": "topic_5452425",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "May 11, 2023, 08:52:36 PMLast edit: August 17, 2023, 09:44:39 PM by bitmover",
  "content": "Bitcoin BlockData API to use in Bitcointalk as ImagesI have been working in this API for a few weeks, and I believe it is now ready to share with you guys.The documentation is here: https://bitcoindata.science/bitcointalk-api.htmlUsing blockchain data from mempool.space and price data from coingecko and exchange.host, it is now possible to share bitcoin data such as address balances and transactions as an image in bitcointalk.org or any other forum using our API. The data is always updated when reloaded.I have made four endpoints.Transaction Details endpointInstead of just posting the transaction ID, you can just use this end point to show all transaction details, including all inputs/outputs, confirmation status, block height, fee rate , etcFor example transaction id  15e10745f15593a899cef391191bdd3d7c12412cc4696b7bcb669d0feadc8521Code:[img]https://bitcoindata.science/api/transaction.php?id=15e10745f15593a899cef391191bdd3d7c12412cc4696b7bcb669d0feadc8521[/img]Bitcoin Mempool Fees Requesting the recommend fees (data from mempool.space).Code:https://bitcoindata.science/api/bitcoinfees.phpAddress Balance endpointPost the updated balance of any address, in any currency you like.Example: Requesting the balance of address 1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNain EUR.Code:[img]https://bitcoindata.science/api/addressbalance.php?address=1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa&currency=EUR[/img]Bitcoin Price to local currency endpointPost the price of any amount of bitcoin in any fiat currencyExample: Requesting the price of 0.1 bitcoin in BRL. Using bold and purple color, just and parameters &hex=872cc3 and &boldCode:[img]https://bitcoindata.science/api/localprice.php?coin=bitcoin&amount=0.1&currency=BRL&hex=872cc3&bold[/img]I hope those endpoints are useful for you. I believe the transaction endpoint is quite useful, as it has a lot of information which may be available without leaving the forum.Please post suggestions or any bug you notice!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5452425",
  "comments": [
    {
      "author": "Husires",
      "created_time": "May 12, 2023, 06:31:03 AM",
      "body": "I'm happy with the effort you're making to make things simpler, but manual editing means I need to bookmark this page and come back to it whenever I need code, so using some scripts like the one below would be very helpful.Quote from: TryNinja on May 10, 2023, 01:11:12 AMInstall here: https://greasyfork.org/en/scripts/465886-bitcointalk-image-upload-button-talkimgIf the image here for input and output is in tabular form, it's easier to follow. like blockchair.com Wallet statement Code:[img]https://bitcoindata.science/api/transaction.php?id=15e10745f15593a899cef391191bdd3d7c12412cc4696b7bcb669d0feadc8521[/img]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "May 12, 2023, 07:18:57 AMLast edit: May 12, 2023, 07:29:20 AM by LoyceV",
      "body": "I had to test this for a large transaction:I'm not disappointed! Update: okay, a bit: the image doesn't always load. My guess: API-limits on mempool.space?Suggestions:Remove the empty space under the data.Use GIF instead of PNG (it's slightly smaller)Crazy idea: use animated gif, without infinite loop (so loop once). Show \"Created by Bitcoindata.science\" for a few seconds, then make it disappear until reloading",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "May 12, 2023, 09:56:07 AM",
      "body": "Nice tool. This could make discussion about specific TXID/address easier. But IMO it'd be better if BBcode generated by your page lead to web page of the source data (e.g. to mempool.space/tx/64_CHARACTER_HEX).Test with transaction which makes Ordinal popular.Default BB tag,Replace url to mempool.space website,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 12, 2023, 09:01:44 PMLast edit: May 12, 2023, 10:04:52 PM by bitmover",
      "body": "Quote from: Husires on May 12, 2023, 06:31:03 AMI'm happy with the effort you're making to make things simpler, but manual editing means I need to bookmark this page and come back to it whenever I need code, so using some scripts like the one below would be very helpful.Although this looks useful, I don't know how many people would use it. It has a total of 4 downloads..Personally,  I think add-ons and extensions a bit invasive and I don't like to install them  only when need such as an adblock.I will think about your suggestion. Quote from: LoyceV on May 12, 2023, 07:18:57 AMI had to test this for a large transaction:You always make good stress tests, but I was ready now.  I tested with chipmixer campaign transactions.QuoteSuggestions:Remove the empty space under the data.Use GIF instead of PNG (it's slightly smaller)Crazy idea: use animated gif, without infinite loop (so loop once). Show \"Created by Bitcoindata.science\" for a few seconds, then make it disappear until reloadingI removed the space, only margins now. (Edit: still big white bottom in long transactions.  I will check later...)I researched about png x gif, and saw this:QuotePNG files almost always offer better compression and a reduced file size compared to GIF. The PNG format also supports variable transparency and millions of colors while GIF only supports 256 colors and does not offer alpha channels. For online use, the only scenario where GIF files are appropriate instead of PNG is animations.https://www.diffen.com/difference/GIF_vs_PNGWhich leads me to your third suggestion:Quote from: ETFbitcoin on May 12, 2023, 09:56:07 AMNice tool. This could make discussion about specific TXID/address easier. But IMO it'd be better if BBcode generated by your page lead to web page of the source data (e.g. to mempool.space/tx/64_CHARACTER_HEX).As I want to somehow promote the documentation page, an animated gif would be a nice fix.I will try to do so and add mempool.space  website as the link when it is done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "May 13, 2023, 07:47:57 AM",
      "body": "Quote from: bitmover on May 12, 2023, 09:01:44 PMI researched about png x gif, and saw this:QuotePNG files almost always offer better compression and a reduced file size compared to GIF. The PNG format also supports variable transparency and millions of colors while GIF only supports 256 colors and does not offer alpha channels. For online use, the only scenario where GIF files are appropriate instead of PNG is animations.https://www.diffen.com/difference/GIF_vs_PNGI tested it by converting one of the PNGs to GIF, and it was smaller. Using less colors doesn't matter for the quality of those images.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "May 14, 2023, 02:56:36 PM",
      "body": "Is it just me or the font color of the text in the image is actually blurry. I mean we have to pay more attention to it to see it clearly.It would have been more easier if the font color was black rather than grey.If @bitmover could do this change it would be great.Great efforts though. Congratulations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 14, 2023, 03:10:48 PMLast edit: May 15, 2023, 09:15:06 PM by bitmover",
      "body": "Quote from: LoyceV on May 13, 2023, 07:47:57 AMI tested it by converting one of the PNGs to GIF, and it was smaller. Using less colors doesn't matter for the quality of those images.Converted to gifI will study how to make animations in a few days.Quote from: pawanjain on May 14, 2023, 02:56:36 PMIs it just me or the font color of the text in the image is actually blurry. I mean we have to pay more attention to it to see it clearly.It would have been more easier if the font color was black rather than grey.I agree black is better, however I need a color that will fit all users, and some of them use a dark background (even in the forum).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 17, 2023, 12:24:50 AM",
      "body": "Fantastic tool. Saved.  Quote from: bitmover on May 14, 2023, 03:10:48 PMI agree black is better, however I need a color that will fit all users, and some of them use a dark background (even in the forum).Maybe endpoints could include text color option. This would allow anyone who wants to change to another color.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 17, 2023, 08:22:33 AM",
      "body": "Quote from: joker_josue on May 17, 2023, 12:24:50 AMQuote from: bitmover on May 14, 2023, 03:10:48 PMI agree black is better, however I need a color that will fit all users, and some of them use a dark background (even in the forum).Maybe endpoints could include text color option. This would allow anyone who wants to change to another color.I even implemented this solution,  but I decoded to rollback.The reason is that some users just make the forum background black. Those users will simple don't see the image if who posted uses ?color=black in the endpoint.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 17, 2023, 09:08:24 AM",
      "body": "Quote from: bitmover on May 17, 2023, 08:22:33 AMThe reason is that some users just make the forum background black. Those users will simple don't see the image if who posted uses ?color=black in the endpoint.This is also true.So I suggest using the green color as the standard color.It is similar to what happens in the cinema area, which uses the green screen to adapt to any background that may be placed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "May 17, 2023, 06:57:56 PM",
      "body": "Quote from: bitmover on May 17, 2023, 08:22:33 AMThe reason is that some users just make the forum background black. Those users will simple don't see the image if who posted uses ?color=black in the endpoint.Correct.I think currently used neutral gray color is very good, unless someone is using exactly the same gray color shade for forum theme, but this would be very rear.One easy alternative option is to use inverted colors in cases when images can't be seen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jokers10",
      "created_time": "May 25, 2023, 05:32:41 PM",
      "body": "This tool looks useful for some cases so I've tried it today. And I can say that sometimes it works fast enough, but in some cases it appears too slow (and I guess during that time not everyone will understand clear enough that a picture is expected there). Sometimes it doesn't show at all like here.I guess it can be too heavy for a hosting it is hosted, especially if many users will start using it. Not criticizing, just sharing my experience.As I said, the tool by itself looks useful. 👍",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "May 26, 2023, 09:49:25 AM",
      "body": "Quote from: jokers10 on May 25, 2023, 05:32:41 PMI guess it can be too heavy for a hosting it is hosted, especially if many users will start using it.I'd guess the problem is with the API, not OP's hosting. If that's the case, maybe OP can temporarily cache data? It won't be real-time, but at least it will work all the time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "May 26, 2023, 11:24:05 AM",
      "body": "@bitmover Is it possible to implement truncating in case there are so many decimal zero's?Like with this priceIs it possible to have a feature/setting that removes or reduces the zeros to the nearest decimal non-zero figure?79,362,000.000 USD could just be 79,362,000 USD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "May 26, 2023, 01:13:42 PM",
      "body": "Suggestion: Add width and height tags to the image, to prevent the page size from changing after the image loads.When it's just a line, it's not noticeable, but when it's a broader set of information, it's noticeable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "May 26, 2023, 02:25:18 PM",
      "body": "Quote from: joker_josue on May 26, 2023, 01:13:42 PMSuggestion: Add width and height tags to the image, to prevent the page size from changing after the image loads.That's only possible if the dimensions don't change.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "May 26, 2023, 04:19:25 PM",
      "body": "Quote from: bitmover on May 11, 2023, 08:52:36 PMBitcoin Price to local currency endpointThat's awesome! I have tried it with BDT but the price I'm getting isn't exactly the price it should be. Well, your given price is correct as per the USD rate you are using but we are following the price based on USDT and the difference between the USD price from Google and USDT price on fake P2P exchange has a difference of 6-7 BDT. Can you by any chance bring me the price based on that rate? Well, it's too much asking for free I think as I'm going to use it on a web page. This rate can be implemented everywhere but when we think about the true price of Bitcoin in BDT, there's no way to get it as per my concern. I wouldn't mind spending little funds depending on the cost size.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "May 27, 2023, 09:44:15 AM",
      "body": "Quote from: LoyceV on May 26, 2023, 09:49:25 AMQuote from: jokers10 on May 25, 2023, 05:32:41 PMI guess it can be too heavy for a hosting it is hosted, especially if many users will start using it.I'd guess the problem is with the API, not OP's hosting. If that's the case, maybe OP can temporarily cache data? It won't be real-time, but at least it will work all the time.There is a 30sec cache. I will take a look at different options.Quote from: logfiles on May 26, 2023, 11:24:05 AM@bitmover Is it possible to implement truncating in case there are so many decimal zero's?Thank for pointing out.I will check this 3 zero decimal point, which is wrong for usd. It must be 2. I will fix this next week.Quote from: LoyceV on May 26, 2023, 02:25:18 PMQuote from: joker_josue on May 26, 2023, 01:13:42 PMSuggestion: Add width and height tags to the image, to prevent the page size from changing after the image loads.That's only possible if the dimensions don't change.It is a good idea to fix height for some endpoints (not all). Width is impossible. This is prevent most layout shift. The problem is that this cannot be defined in the api, but in the forum user post only...Quote from: Little Mouse on May 26, 2023, 04:19:25 PMThat's awesome! I have tried it with BDT but the price I'm getting isn't exactly the price it should be. Well, your given price is correct as per the USD rate you are using but we are following the price based on USDT and the difference between the USD price from Google and USDT price on fake P2P exchange has a difference of 6-7 BDT. Can you by any chance bring me the price based on that rate? Well, it's too much asking for free I think as I'm going to use it on a web page. This rate can be implemented everywhere but when we think about the true price of Bitcoin in BDT, there's no way to get it as per my concern. I wouldn't mind spending little funds depending on the cost size.I am not sure if I understand. Is the BDT BTC price very different?What is a good and reliable source of BDT BTC price?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "May 27, 2023, 11:17:14 AM",
      "body": "Quote from: bitmover on May 27, 2023, 09:44:15 AMI am not sure if I understand. Is the BDT BTC price very different?What is a good and reliable source of BDT BTC price?According to your source, the current price of 1 BTC is-It's 2.85 million BDT at the time of writingBut the actual price of BTC right now is- 26700*113= 3017000 or 3 million BDT. (Here's 113 is USDT to BDT conversion rate)There's a difference of 150k BDT which is huge.On the other hand, in Binance P2P, right now, 1 BTC = 3019000 which is slightly different from the actual price I have shared.So, Binance P2P is the most accurate price for BDT. No one will sell you 1 BTC for the price your image is showing.It would be a handy tool for us to be honest as there's no source which share the actual price in BDT, I repeat no source.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}