{
  "id": "topic_5433124",
  "title": "krishnaverma",
  "author": "krishnaverma",
  "created_time": "January 05, 2023, 12:45:08 PM",
  "content": "If you follow crypto news, you might be aware about solana dog shitcoin called \"BONK\" is up 900% the past week . If you are thinking to invest in this coin, let me share an important fact regarding this coin. The top 20 holders 50% of the coin. You can yourself check this herehttps://solscan.io/token/DezXAZ8z7PnrnRJjz3wXBoRgixCa6xjnB7YaB1pPB263#holdersSo, it is obvious that they will eventually dump it. Those who are investing seeing the dramtic increase in prices will loose all their investment when it dumps.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433124",
  "comments": [
    {
      "author": "fatcatcoin",
      "created_time": "January 05, 2023, 01:12:01 PM",
      "body": "I have indeed been seeing that one pop up, im surprised that meme coins like this that have no real idea behind it gain so much traction...like I created an innovative meme coin with tokenomics designed to blow all other coins out the water with long term hodling, yet im finding it very hard to get the word out...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "January 05, 2023, 01:58:36 PM",
      "body": "Top 20 addresses are 50% of all tokens, but you need to take into account that some addresses belong to exchanges. The tokens were distributed via airdrop, so most of the owners received their tokens for free. A 400% price increase is a small achievement, but it is speculation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "January 05, 2023, 02:14:17 PM",
      "body": "Quote from: fatcatcoin on January 05, 2023, 01:12:01 PMI have indeed been seeing that one pop up, im surprised that meme coins like this that have no real idea behind it gain so much traction...like I created an innovative meme coin with tokenomics designed to blow all other coins out the water with long term hodling, yet im finding it very hard to get the word out... One can not really explain what is behind most meme coins' performance lately and with the so call hype that has been going around with some altcoins, am sure most investors and whales will really want to cash out their profits thereby dumping the price.Meme coins are perfect for short-term speculations and they are not suitable for long-term holding.And if you think you have some balls to roll in risk you can try them out and let's see how lucky one can get, after all the tokens were majorly disrupted through an airdrop.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "January 05, 2023, 02:33:54 PM",
      "body": "Quote from: Odusko on January 05, 2023, 02:14:17 PMOne can not really explain what is behind most meme coins' performance lately and with the so call hype that has been going around with some altcoins, am sure most investors and whales will really want to cash out their profits thereby dumping the price.Meme coins are perfect for short-term speculations and they are not suitable for long-term holding.And if you think you have some balls to roll in risk you can try them out and let's see how lucky one can get, after all the tokens were majorly disrupted through an airdrop.The pattern is same like those inu coins.Hype is created to attract new investors.More investors start investing because of FOMO.The buyers who took big positions in the start or the developers then dump it.It has happened many times and still people do not learn. If I have to give reason in one word, it is pure greed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "January 05, 2023, 02:34:03 PM",
      "body": "Quote from: zasad@ on January 05, 2023, 01:58:36 PMTop 20 addresses are 50% of all tokens, but you need to take into account that some addresses belong to exchanges. The tokens were distributed via airdrop, so most of the owners received their tokens for free. A 400% price increase is a small achievement, but it is speculation.I think this will increase the risks, if the platforms can control more than 30%, this means that they can easily cause a currency dump, and the coordination of platforms among themselves is easier than individuals as they will aim to enhance their profits and have complete control over clients’ money.Generally, it is better not to catch the green candle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "January 05, 2023, 03:40:14 PM",
      "body": "Quote from: krishnaverma on January 05, 2023, 12:45:08 PMIf you follow crypto news, you might be aware about solana dog shitcoin called \"BONK\" is up 900% the past week . If you are thinking to invest in this coin, let me share an important fact regarding this coin. The top 20 holders 50% of the coin. You can yourself check this herehttps://solscan.io/token/DezXAZ8z7PnrnRJjz3wXBoRgixCa6xjnB7YaB1pPB263#holdersSo, it is obvious that they will eventually dump it. Those who are investing seeing the dramtic increase in prices will loose all their investment when it dumps. Yeah obviously everyone should stay away from coins like that. Thanks for the head-up. Obviously there is something very wrong if only 20 people are owning more than 50% of the circulating supply. Those few people alone can dump that project to almost zero within a few minutes. So i guess this was a planned pump of this project from the start. A few whales were investing heavily into it, which brought the price up rapidly. Obviously crypto news see this and also ape in and once the price has reached a certain mark those whales will start dumping and then there is no way back to old price levels. Just stay away from meme-coins guys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MFahad",
      "created_time": "January 05, 2023, 04:21:30 PM",
      "body": "Quote from: krishnaverma on January 05, 2023, 12:45:08 PMIf you follow crypto news, you might be aware about solana dog shitcoin called \"BONK\" is up 900% the past week . If you are thinking to invest in this coin, let me share an important fact regarding this coin. The top 20 holders 50% of the coin. You can yourself check this herehttps://solscan.io/token/DezXAZ8z7PnrnRJjz3wXBoRgixCa6xjnB7YaB1pPB263#holdersSo, it is obvious that they will eventually dump it. Those who are investing seeing the dramtic increase in prices will loose all their investment when it dumps.  It is true that it can be eventually dumped but the way they Listed on more than 15 exchange is extra ordinary and it's make hype in this bear season. This is second coin after PI which rise so fast and early users makes millionaires in two days. I think it will be better to invest very small part which we can afford to lose in short time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "January 05, 2023, 04:28:15 PM",
      "body": "Quote from: Jackl87 on January 05, 2023, 03:40:14 PMQuote from: krishnaverma on January 05, 2023, 12:45:08 PMIf you follow crypto news, you might be aware about solana dog shitcoin called \"BONK\" is up 900% the past week . If you are thinking to invest in this coin, let me share an important fact regarding this coin. The top 20 holders 50% of the coin. You can yourself check this herehttps://solscan.io/token/DezXAZ8z7PnrnRJjz3wXBoRgixCa6xjnB7YaB1pPB263#holdersSo, it is obvious that they will eventually dump it. Those who are investing seeing the dramtic increase in prices will loose all their investment when it dumps. Yeah obviously everyone should stay away from coins like that. Thanks for the head-up. Obviously there is something very wrong if only 20 people are owning more than 50% of the circulating supply. Those few people alone can dump that project to almost zero within a few minutes. So i guess this was a planned pump of this project from the start. A few whales were investing heavily into it, which brought the price up rapidly. Obviously crypto news see this and also ape in and once the price has reached a certain mark those whales will start dumping and then there is no way back to old price levels. Just stay away from meme-coins guys.Interesting that I read on the official website of this token that it was created because: Quote\"The Bonk contributors were tired of toxic “Alameda” tokenomics and wanted to make a fun memecoin where everyone gets a fair shot\"A fair shot of 50% supply for the community, but I think they forgot mentioning where the other 50% are going to... In the end it wasn't so funny, as firstly expected by the community, to be part of another pump and dump scheme. Those who entered the investment before the ATH can be considered lucky to have be able to make some speculative profit with BONK, but now it's too late. Not advisable to anyone adopting this token anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dickiy",
      "created_time": "January 05, 2023, 04:30:42 PM",
      "body": "Quote from: krishnaverma on January 05, 2023, 12:45:08 PMIf you follow crypto news, you might be aware about solana dog shitcoin called \"BONK\" is up 900% the past week . If you are thinking to invest in this coin, let me share an important fact regarding this coin. The top 20 holders 50% of the coin. You can yourself check this herehttps://solscan.io/token/DezXAZ8z7PnrnRJjz3wXBoRgixCa6xjnB7YaB1pPB263#holdersSo, it is obvious that they will eventually dump it. Those who are investing seeing the dramtic increase in prices will loose all their investment when it dumps. Thank you for reminding me. Many people recommend Shitcoin because the increase is enough to make many people tempted, so many people talk about the BONK coin meme. But so far I haven't been able to find the Shitcoin Whitepaper and Coinmarketcap also doesn't provide a really understandable explanation about this meme coin which says it's only in testing and still in beta.This means that this is still in the development stage and not the final of the entire project.I also warn you to be careful, when the market situation is like this and the Solana network is in a bad state, what I'm afraid of is that this is a scheme project to steal your money and price pumps are made to attract many people who fall into the trap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "January 05, 2023, 04:45:17 PM",
      "body": "Isn't it the usual? Last week its market price is just $30 and it grew fast. What I am referring to as usual is to stay away from a token which already took flight because that would be risky. It would be much better to play it safe or to not go along with the uprise movement at this moment because it could be too late. Let it slide for those who trusted the token early, they deserve it. That's just how the market goes; you may find 'gold' out of 'rocks and stones' although it does not happen often. On my end, I think it is too late already to invest and as others have mentioned, the hype will go down eventually because there are no utility to sustain the rate of increase for this coin. Let us just see this as a sign for a market recovery this year to somehow view it as positive for this industry.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Anonylz",
      "created_time": "January 05, 2023, 04:51:52 PM",
      "body": "Any smart early investor in this project should be thinking about dumping it now before the whales will do so, otherwise it is going to be a painful experience because no doubt this will be dumped really hard. Shitcoins like this are only meant for quick profit. It will be foolish for anyone to think of buying this meme coin at 900% up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "January 05, 2023, 05:07:44 PM",
      "body": "I've seen this in my feed earlier today. The scheme is quite obvious but gamblers will still take the opportunity to benefit from this overly pumped token. I'm not referring to casino bettors but those who chase profit on short-term trades. I'm pretty sure those who got in early already started dumping once various social media platforms started posting about this token.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krishnaverma",
      "created_time": "January 05, 2023, 05:20:37 PM",
      "body": "Quote from: Anonylz on January 05, 2023, 04:51:52 PMAny smart early investor in this project should be thinking about dumping it now before the whales will do so, otherwise it is going to be a painful experience because no doubt this will be dumped really hard. Shitcoins like this are only meant for quick profit. It will be foolish for anyone to think of buying this meme coin at 900% up.But the thinking of most of the investors is that if the price is increasing fast, they feel tempted to invest in it. They do not look at the bigger picture.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Altryist",
      "created_time": "January 05, 2023, 05:25:57 PM",
      "body": "It looks too risky to seriously consider buying it. Where is the guarantee that in a few days we will not see the same dump, and perhaps this will end the growth for this memcoin forever. It's all too dubious and risky for me to risk my money. The pump is clearly speculative as the main holders are a small group of people. Now is not an easy time anyway, we don’t need to create additional stress for yourself with an incomprehensible memcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$crypto$",
      "created_time": "January 05, 2023, 05:29:48 PM",
      "body": "I've heard about shitcoin (BONK) a lot of hype eats up I don't know what will happen next maybe a big dump will be done by the whales and for those who buy early and sell at high prices you can say profit it's just that investors are late which is going to be a disservice I don't think this is the best way to pick a shitcoin even though it's tempting because the hype is still going on.This has reminded us all to stay away from the shitcoin that was initially pumped, and wait a few more days I suspect this token will crash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Flexystar",
      "created_time": "January 05, 2023, 05:42:44 PM",
      "body": "Time to push the stop plug on! Anyways it is overhyped coin in very short period of time. I will always consider such coins as either part of the pumping group OR basically an increased in FOMO levels amongst the investors. Everyone should be adding this type of criteria in their filters too because over the period of time it could lead us to the projects where we may trust them a lot and end up loosing everything we have on them. This is good that someone brought this project up and made us careful about it. Hope that most of the people out there will figure this out as temporary hike and the coin is already on the verge of collapse. If airdrops were there then its going to be disaster soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JunkieMiner",
      "created_time": "January 05, 2023, 05:51:24 PM",
      "body": "But I see yesterday that some people got airdrop of Bonk coin, whether they were holding some of the Nfts of Solana network and many of them got from about 200$-7000$, I think the price pump from there when they distributed the reward and its trading grows up. So, may be you are right in a sense that we should check it out thoroughly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hildentine",
      "created_time": "January 05, 2023, 06:18:15 PM",
      "body": "I think be careful I can't say that not invest in BONK but i say that anyone who wants to invest there Money in cryptocurrency so first they study the project and see there future plans and other major things so they invest there money otherwise many people got loss how not complete knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "isaac_clarke22",
      "created_time": "January 05, 2023, 06:58:59 PM",
      "body": "I mean just by the name of it, I already know the source of the meme anyway and I can see a Shiba or something from Doge meme being hit by photo edited baseball bat. It looks like another meme coin attempting to milk Doge or Shiba Inu with just a different name and image, lol. Quite surprised that it is becoming a news though just by searching it through Google.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}