{
  "id": "topic_5448227",
  "title": "Poorwithbtc.eth",
  "author": "Poorwithbtc.eth",
  "created_time": "April 10, 2023, 09:14:25 AM",
  "content": "You chickens don't usually do this, right? That is, the scenario will happen before entering the order, to stabilize the psychology even if the price line follows the scenario no matter what.Everyone knows that there is no mother in this market who dares to say \"all my predictions are correct, my odds are 100%\".Because simply this: we are still just small fish in a vast ocean. This market is manipulated by sharks, sperm whales and beyond, influenced by macro, even war, politics.Therefore, it is extremely important to determine the outcome of each scenario in advance. How if the main scenario is correct, it will make maximum profit, and if it does not follow the right scenario, it will minimize risks and losses.Take this example: coming #ShanghaiUpgrade we all know that the market will have strong fluctuations, the amount of $ETH unlocked will cause the circulation outside the market to spike, so people will sell ETH. fiat, or stake in LSDs platforms, or scoop shitcoins? All will be just predictions, even if we rely on many numbers and indicators to predict, it's all just predictions and all cases can happen.So that means ETH after Shanghai may increase and vice versa may also decrease.So the question we need to answer is: if ETH goes up, what do we do? On the contrary, if it decreases, what will you do?We all believe that in the short term ETH can decrease, but in the long term (until the end of 2025) there is a very high possibility that ETH will have an amazing growth (because now ETH has entered…",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448227",
  "comments": [
    {
      "author": "Lorence.xD",
      "created_time": "April 10, 2023, 09:33:06 AM",
      "body": "That's actually good observation OP. Of course as a good investor/trader you should be updated to any news about the coins for you to keep up and know when to buy and sell. Prediction without sources or own analysis will just lead to losses and risk. Its just simply buy when its red and sell when its green if you aim to profit its just the right timing. Still need to be cautious since its volatile there's no guarantee your predictions will be right.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "April 10, 2023, 11:54:57 AM",
      "body": "When the update has become famous and everyone is known about it, and it is not a fundamental update, I do not think that the price will increase sharply, meaning that it is a serious opportunity, but it is not a golden one that will make a difference in your investment portfolio, and for comparison, we can return to the data of ETH hardfork, according to which the transfer of Ethereum from proof-of-work to proof-of-stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoin_Arena",
      "created_time": "April 10, 2023, 03:43:38 PM",
      "body": "It's why proper risk management is very important in trading.A bad trader is one that only looks at the good side (profits) and doesn't even think about the bad side (losses) should the prediction go wrong. Before approaching any trade, One should ask themselves a few questions- What is the risk reward ratio? - How much can I afford to lose should things go bad?If things don't look favorable, trust your gut and avoid the trade. Keep your account up to trade another day. the market will always be there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 10, 2023, 10:58:22 PM",
      "body": "What I believe is that the value of ETH will not decrease much. And, if that does happen, we can use hedging at different prices to reduce the risk. Nobody knows the market 100%, even a 10% understanding of the crypto market can change at any moment. The volatility in this market is beyond others' understanding, and nobody is always correct.That is why proper planning and strategies are important. Having a calm mindset in profits and losses is mandatory requirement for crypto trading. Currently, everyone is anticipating a Bull market, but nobody is truly certain if it will occur or not. Influencers have always been taking advantage of us, and if we place our trust in them and follow them blindly, we will undoubtedly lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "April 10, 2023, 11:19:50 PM",
      "body": "Quote from: Poorwithbtc.eth on April 10, 2023, 09:14:25 AMSo the question we need to answer is: if ETH goes up, what do we do? On the contrary, if it decreases, what will you do?We all believe that in the short term ETH can decrease, but in the long term (until the end of 2025) there is a very high possibility that ETH will have an amazing growth (because now ETH has entered…Of course, cut your profit off and re-invest.But I don't believe that much, if Ethereum will increase it will do the same on the Bitcoin side which I plan to hold much. IMO, predictions are just that, predictions and no one can guarantee a 100% success rate result. By determining potential outcomes in advance or what's in the future, you can make informed decisions and maximize profits.  Considering both short-term and long-term has possibilities when developing your plan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "death69",
      "created_time": "April 11, 2023, 08:04:27 AM",
      "body": "Hey. We have a trading whiz amongst us. This guy talks the talk, but can he walk the walk? It's easy to babble about scenario planning and risk management, but can you keep your cool when the markets start to quake?Please don't view my criticism as an attack; it's just my honest opinion. Trading is a collaborative effort, and there is no silver bullet. The exhilaration and novelty of trading come from the fact that it is played in so many different ways and from so many different perspectives.To continue developing and learning, and to continually question your assumptions, is my advice. You can triumph over any challenge if you're well-prepared and have a clear plan of action. The toast is to that!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "April 11, 2023, 10:15:51 AM",
      "body": "I thought you were asking how to set up a custom trailing stop with a bot in the beginning, turns out you're just asking for advice when the market is unpredictable. Since others have more or less answered your question, I suggest you try or build your own bot if your exchange doesn't support trailing stop loss or something similar in order to prepare for stuff like that. Or you can simply change your trading platform, although it might be difficult since most of them require KYC nowadays.IIRC, Zenbot is one free one that might be able to offer trailing stop even though the setup is a bit of a pain, at least according to some reviews that I've read. Since it is open source, some techniques are probably out of date, so you need to know a bit of coding if you want to customize it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}