{
  "id": "topic_5457628",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "June 26, 2023, 11:09:51 AMLast edit: June 29, 2023, 02:24:44 PM by zasad@",
  "content": "Оригинал статьи принадлежит fillippone. Спасибо за полезную информацию!Перевод выполнен от первого лица при поддержкеЯ часто оказываюсь в трудной ситуации, когда мне приходится отвечать на этот вопрос:\"Я слышал что-то о биткоинах, как я могу их купить?\"Что ж, я не люблю идти на ненужный риск, а покупка биткоина, ничего о нем не зная, - это, как и любая другая \"инвестиция без знаний\", верный путь к потере ваших денег.Поэтому я хочу, чтобы моя мама/среднестатистический Джо имели базовое представление о том, что такое биткоин, прежде чем даже думать о его покупке.Проблема в том, что объяснить что такое Биткойн сложно; биткойн находится на стыке криптографии, экономической и монетарной теории, теории игр, компьютерных сетей и передачи данных. Обладать знаниями в одной из этих областей не только сложно, что может исказить мое объяснение и испортить весь процесс. (если бы я больше знал о криптографии, я бы придал большее значение этому аспекту, но это не гарантия, что именно это поможет моему коллеге). .Итак, здесь я хочу опубликовать подборку из 5 ресурсов (статьи, видео, Твиттер-аккаунт, порталы, называйте как хотите), куда направить моих потенциальных инвесторов.Это список.Моя идея состоит в том, чтобы постоянно обновлять его по мере появления новых материалов в сети и в соответствии с вашими предложениями: Lopp.net Информация и ресурсы о биткойнеКоллекция ресурсов о биткойне, от базового уровня (white Paper) до более продвинутых и очень технических, как статьи, так и видео/анимации от Джеймсона Лоппа, профессионального шифропанка. (пожалуйста не путайте шифропанков с киберпанками ).Биткоин для начинающихПлейлист ознакомительных видеороликов от Андреаса Антонопулоса, посвященных различным аспектам Биткойна, что это такое, как купить, где и как его хранить...Моделирование стоимости биткоина с помощью дефицитаБазовая, простая и в то же время увлекательная модель оценки стоимости биткоина. Не является финансовым советом.Стандарт биткоина: Децентрализованная альтернатива центральным банкамУвлекательное чтение, совершенно нетехническое и не связанное напрямую с Биткойном: если вам не понравится Биткойн после прочтения этой книги, то он вам никогда не понравится.QuoteХотя биткойн - это новое изобретение цифровой эпохи, проблема, которую он призван решить, стара как само человеческое общество: передача стоимости во времени и пространстве. Аммус проводит читателя в увлекательное путешествие по истории технологий, выполняющих функции денег, от примитивных систем торговли известняками и морскими раковинами до металлов, монет, золотого стандарта и современных государственных долговых обязательств. Изучение того, что дало этим технологиям их денежную роль и как большинство из них ее утратили, дает читателю хорошее представление о том, что является основой надежных денег, и создает основу для экономического обсуждения их последствий для индивидуальной и общественной ориентации на будущее, накопления капитала, торговли, мира, культуры и искусства. Аммус убедительно показывает, что не случайно, что самые высокие достижения человечества были достигнуты в обществах, пользующихся преимуществами надежных денежных режимов, и не случайно, что денежный крах обычно сопровождает крах цивилизации.BitcoinTalk.org ForumВозможно, это немного круговая ссылка, но я думаю, что если вы изучите предыдущие 4 ресурса, то будете готовы погрузиться в \"Кроличью нору\" [ВНИМАНИЕ! ВРЕМЯ ПРОПАДАЕТ!].Здесь собраны другие ресурсы в произвольном порядке, которые были предложены в комментариях ниже:  Биткоин для начинающих Биткоин и технология блокчейн: Экономика и экологическая устойчивостьОзнакомительное видео Ф.Аметрано, объясняющее, почему биткоин - это цифровое золото.  Интернет денегСборник бесед Андреаса АнтонопулосаИнтернет денег, книга на русскомБычьи аргументы в пользу биткоина  As Bitcoin Twitter аккаунт описывает его:QuoteНеобходимая информация для начинающих, чтобы понять, почему биткоин имеет значение от @real_vija Binance академияСборник видеороликов и статей с четкими объяснениями для начинающих, чтобы лучше понять всю концепцию вокруг криптовалют и трейдинга. Биткоин для безопасностиУбедительная статья о том, почему биткоин имеет значение во времена отрицательных процентных ставок, QE и \"пузырей\" во всем.Дорогая семья, дорогие друзья, письмо всем вам, у кого до сих пор нет биткоина.QuoteЯ пишу это письмо, потому что убежден в двух вещах: (1) наши нынешние деньги фундаментально неработающие (2) использование более совершенных денег принесет пользу вам в частности - и обществу в целом - в долгосрочной перспективе..Плюсы и минусы управления приватными ключами биткоинаQuoteБиткойн предоставляет пользователям невероятно высокий уровень суверенитета над своими деньгами. Возможно, вы слышали фразу \"будь сам себе банком\", которая хорошо описывает власть, которую Биткойн дает своим пользователям. Обратной стороной является то, что быть своим собственным банком - значит нести большую ответственность. Те же особенности, которые делают биткойн таким ценным (отсутствие разрешений, устойчивость к цензуре, устойчивость к конфискации и т.д.), также делают его привлекательным для злоумышленников. Эти злоумышленники придумали множество ловушек, чтобы обмануть пользователей биткоина и заставить их расстаться со своими деньгами, что делает биткоин еще более сложным для безопасного использования. Интернет - опасное место, но у нас есть инструменты, чтобы защитить себя!Почему вы можете захотеть стать владельцем биткоина (и как это сделать ответственно)QuoteВ этом посте изложен путь обучения, который я рекомендую друзьям и родственникам, только начинающим осваивать биткоин. Вы начнете с просмотра короткого видео, затем купите несколько сатоши (самая маленькая единица биткоина). Затем вы узнаете больше о биткоине, выбирая то, что вас интересует, из подготовленного списка исследовательского контента. К концу вы поймете основные причины владения биткоином, а также узнаете, как купить больше и безопасно хранить его.Статьи о биткоинеEnd The FUD",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457628",
  "comments": [
    {
      "author": "witcher_sense",
      "created_time": "June 26, 2023, 03:34:38 PM",
      "body": "Самая большая ошибка - это кормить простого Васяна всякими псевдографиками от PlanB или другими предсказаниями цены Биткоина. Большинство неправильно воспринимают такую информацию, становятся сверхпозитивными в отношении будущего и в результате наоборот превращаются в хейтеров. В остальном ресурсы полезные, уже тысячи раз рекомендованные еще до fillippone, но лишний раз напомнить новичкам и получить за это мериты никогда не бывает лишним. Я бы еще добавил https://learnmeabitcoin.com/ как самый лаконичный и одновременно самый информативный ресурс о внутренних механизмах Биткоина.Quote from: Ratimov on June 26, 2023, 12:24:42 PMА вообще жаль, что в этом топике обучающие материалы для локала представлены исключительно на английском, в этом теряется смысл названия топика, так как простые люди (в лице обычного Джо простого Васька) не хотят использовать всякие костыли в виде авто-переводчиков и прочего, а хотят ознакамливаться с обучающими материалами (аудио, видео, текст) максимально доступно, на понятном им языке.Книги на русском языке можно найти на просторах Интернета: некоторые из них будут бесплатные и в свободном доступе, а другие можно купить или отыскать на торрентах и всяких архивах. Было бы желание. Ресурсы типа lopp.net естественно никто переводить не будет, но отдельные источники информации тоже можно найти в переводе. Касательно видео от Андреаса Антонопулоса, то советую заглянуть в эту старую тему: Люди BTC. Андреас Антонопулос Там есть ссылки как на переводы, так и на видео с русскими субтитрами.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartprofit",
      "created_time": "June 26, 2023, 06:46:32 PM",
      "body": "На мой взгляд, обычному Джо, или Васе, или Сингху, начинать изучение биткоина лучше всего с изучения кошелька. Взять Electrum и поизучать его интерфейс.Гарантированно возникнет много вопросов, при этом отвечая на эти вопросы Джо, Вася, Сингх - узнают для себя очень много интересного, связанного со спецификой функционирования сети Bitcoin.При этом, это будет практическое обучение. Пользователи будут изучать именно те аспекты, который понадобится им в практическом использовании Биткоина.Что касается идеологической составляющей, то она во многом хорошо представлены на нашем форуме. Вполне можно почитать отдельные топики и во многом разобраться.Даже ничего страшного не будет, если новичок начнёт с Bitcoin - максималистов. Я вообще убеждён, что изучая что-то, нужно начинать с того, чтобы становиться адептом и фанатичным последователем. Это даёт невероятные силы и мотивацию для обучения.А вот после погружения в тему, можно уже включать в действие критический подход.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 27, 2023, 10:15:00 AM",
      "body": "Quote from: Ratimov on June 26, 2023, 12:24:42 PMОбычный/среднестатистический Джо? Это забавно, хотя переводить английские идиомы дословно всегда было плохой идеей, так как это выглядит, мягко говоря, нелепо. Average Joe - это, по всей видимости, в русском варианте обычный Вася  или простой человек. Название точно стоит пересмотреть, и назвать наподобие 5 обучающих ресурсов по BTC для простых людей.А вообще жаль, что в этом топике обучающие материалы для локала представлены исключительно на английском, в этом теряется смысл названия топика, так как простые люди (в лице обычного Джо простого Васька) не хотят использовать всякие костыли в виде авто-переводчиков и прочего, а хотят ознакамливаться с обучающими материалами (аудио, видео, текст) максимально доступно, на понятном им языке.Хотелось бы добавить и 6-ой ресурс о биткоине, содержащий кучу различных статей и объяснялок, которые направлены на развенчивание различных мифов о биткоине: End The FUDЯ думал о названии но принял решение оставить оригинал, ничего не меняя, и не добавляя русских имен. Если обычный Джо не привыкнет читать английский, то он всегда будет на шаг позади, читая переводы неквалифицированный студентов.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 28, 2023, 02:00:37 PM",
      "body": "Quote from: Ratimov on June 27, 2023, 10:18:28 AMQuote from: zasad@ on June 27, 2023, 10:15:00 AMЕсли обычный Джо не привыкнет читать английский, то он всегда будет на шаг позади, читая переводы неквалифицированный студентов.И поэтому ты перевел текст для обычных Джо, а не дал просто ссылку на оригинал, чтобы они не были на шаг позади?  Я перевел текст для поддержки нашего проекта. Здесь стараются выбирать лучшие темы и делится во всех локальных досках.https://bitcointalk.org/index.php?topic=5442314.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "June 29, 2023, 02:27:30 PM",
      "body": "Quote from: Ratimov on June 28, 2023, 02:16:12 PMQuote from: zasad@ on June 28, 2023, 02:00:37 PMЯ перевел текст для поддержки нашего проекта. Здесь стараются выбирать лучшие темы и делится во всех локальных досках.https://bitcointalk.org/index.php?topic=5442314.0Возвращаясь к теме про ознакомительные материалы для простого обывателя на его родном языке, даже в твоём клубе тебе об этом написали:Quote from: Porfirii on June 27, 2023, 10:52:31 AMPlease, note that the goal with this topic is to share basic knowledge about Bitcoin in our respective native languages, so I hope that among all of you can complete the list with links to the best sources of information in Russian.что данный топик, если кто-то его переносит в локал, не мешало бы снабдить ссылками на материалы на их родном языке. И это было бы максимально логично, чтобы простой обыватель, то есть Average Joe, ознакомился с данными статьями на своём родном языке. Но ты, как я понял, заниматься этим не планируешь.Уже добавил некоторые ссылки,  процессе интереса к теме буду добавлять еще.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "internetional",
      "created_time": "November 01, 2023, 08:32:04 AM",
      "body": "А я вот открыл для себя bitcoindev.org. Полдня уже лазаю по нему, и кажется, что это нескончаемая кладезь всего полезного.По информации на главной странице может показаться, что там собраны только библиотеки для разработчиков на разных языках (JavaScript, Java, Python, Rust и др.), но на самом деле коллекция сайта далеко выходит за эти рамки:- куча образовательных материалов как про первый слой, так и про Молнию (Lightning Network);- ссылки на песочницы, позволяющие поиграться с Bitcoin Script и разобраться во внутренней структуре транзакций, а также на ресурсы, позволяющие конструировать транзакции по своим параметрам;- информация о языках программирования смарт-контрактов и о технологиях, разрабатываемых в этой сфере;- софт для запуска нод и управления ими;- обозреватели блокчейна и инструменты аналитики содержащихся в нём данных.Очень удобный каталог. Советую всем, кто понимает по-английски.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}