{
  "id": "topic_5451355",
  "title": "Jet Cash",
  "author": "Jet Cash",
  "created_time": "May 05, 2023, 02:05:33 PM",
  "content": "I received this marketing image in my email recently. Now I'm not a treansvestite or trans gender, and even if I was, I wouldn't want to look like this. Does anyone think it is attractive?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451355",
  "comments": [
    {
      "author": "thimotey_s",
      "created_time": "May 08, 2023, 05:15:39 PM",
      "body": "Self-respect and modern fashion are not mutually exclusive, and it is possible to dress in a fashionable and trendy way while still maintaining self-respect. However, it is true that some aspects of modern fashion can be seen as promoting unhealthy body ideals or encouraging consumerism over individuality.It's important to note that fashion is constantly evolving, and what may have been considered fashionable or trendy in the past may not be seen as such today. It's up to individuals to decide how they want to express themselves through fashion and whether they feel comfortable with the trends and styles that are currently popular.Ultimately, self-respect should come from within, and not be dependent on external factors such as fashion or societal norms. While fashion can be a fun and creative way to express oneself, it's important to prioritize one's own values and beliefs and not feel pressured to conform to trends or styles that don't align with those values.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Qiubell5",
      "created_time": "July 19, 2023, 12:11:42 AM",
      "body": "Self-esteem is indeed far above all. And I don't want to look like this either. I think that women are very expensive and valuable, and must wear closed clothes, aka not too tight. Women must have shame to maintain their self-esteem. Don't just because clothes that are trendy and popular, women wear them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "asbani",
      "created_time": "July 19, 2023, 12:29:23 AM",
      "body": "Quote from: Jet Cash on May 05, 2023, 02:05:33 PMI received this marketing image in my email recently. Now I'm not a treansvestite or trans gender, and even if I was, I wouldn't want to look like this. Does anyone think it is attractive?I agree with you, its not attractive at all. I love modest, how our families raised us to look...not too revealing, not too exposing, that goes for both men and ladies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Raya One",
      "created_time": "July 22, 2023, 02:37:21 AM",
      "body": "They think it is attractive. So they sent it as marketing image. But for me, it is not attractive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}