{
  "id": "topic_5400912",
  "title": "l3pox",
  "author": "l3pox",
  "created_time": "May 31, 2022, 08:04:33 PM",
  "content": "a maioria das pessoas aqui já se ligou que web3 vai mudar tudo, bitcoin veio pra ficar e não vai morrer, e ainda veremos milhares de dapps criados da eth que nunca imaginamos serem possíveis.quais são algumas ideias que vc acha que podem ser criadas nas próximas décadas nesse mercado e ainda não vimos?vou jogar algumas aqui, sem muita preocupação se irão acontecer ou não.- aplicativos de micro-crédito baseado em reputação nas redes sociais e permitindo empréstimos \"under colaterized\" (DoxFi) - será nefasto e muito interessante ao mesmo tempo.- NFT-zação de ativos reais (de imóveis à apólices de seguro)- mercados de NFT com taxa 0- uma moeda baseada em fiat algoritmica que funcione (brincadeira, não acredito nisso)- DAOs maiores que países financiando iniciativas educacionais, culturais e artísticas.o que mais?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5400912",
  "comments": [
    {
      "author": "t91",
      "created_time": "June 01, 2022, 03:35:48 AM",
      "body": "Acho que com a ideia do move 2 earn ira nascer bastante coisa voltada para area esportiva, talvez um \"boxe to earn\" kkk, NFT de ativos com certeza, tem tantos \"motivos\" para \"cryptonizar\" que vamos nos surpreender ainda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "June 01, 2022, 01:56:26 PM",
      "body": "Quote from: t91 on June 01, 2022, 03:35:48 AMAcho que com a ideia do move 2 earn ira nascer bastante coisa voltada para area esportiva, talvez um \"boxe to earn\" kkk, NFT de ativos com certeza, tem tantos \"motivos\" para \"cryptonizar\" que vamos nos surpreender ainda.acho que a ideia de incentivar pessoas a se manterem saudáveis tem muito potencialnão sei se através do modelo do STEPN pois não me debrucei muito nele ainda, vi um pessoal criando uma paródia de \"sleep to earn\" esses dias hahahha vc recebe por fazer o tracking do seu sono sabe-se lá como.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "June 01, 2022, 04:59:15 PM",
      "body": "Quote from: Lucasgabd on June 01, 2022, 01:56:26 PMnão sei se através do modelo do STEPN pois não me debrucei muito nele ainda, vi um pessoal criando uma paródia de \"sleep to earn\" esses dias hahahha vc recebe por fazer o tracking do seu sono sabe-se lá como.Esse, rs? https://slepn.comFoi uma piada de primeiro de Abril, mas não vai muito longe do que o pessoal faz para surfar no hype do nosso app de corrida.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "t91",
      "created_time": "June 01, 2022, 06:29:49 PM",
      "body": "Quote from: TryNinja on June 01, 2022, 04:59:15 PMEsse, rs? https://slepn.comFoi uma piada de primeiro de Abril, mas não vai muito longe do que o pessoal faz para surfar no hype do nosso app de corrida. Achei esse: https://dreamn.io/Acho bacana esses projetos que incentivam a se movimentar mais e tal, mas do jeito que tá, daqui a pouco vai ter um breathe to earn kkkk",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "June 01, 2022, 06:31:35 PMLast edit: May 14, 2023, 02:20:47 AM by TryNinja",
      "body": "Quote from: t91 on June 01, 2022, 06:29:49 PMAchei esse: https://dreamn.io/Acho bacana esses projetos que incentivam a se movimentar mais e tal, mas do jeito que tá, daqui a pouco vai ter um breathe to earn kkkkUé?QuoteThree mechanisms are utilized to prevent cheating in the game. GPS Tracking , Data from motion sensors and health activity tracker and our machine learning can identify cheating.GPS Tracking pra dormir? KKKKKKAdivinha de onde tiraram a \"inspiração\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "t91",
      "created_time": "June 01, 2022, 06:43:14 PM",
      "body": "Quote from: TryNinja on June 01, 2022, 06:31:35 PMQuote from: t91 on June 01, 2022, 06:29:49 PMAchei esse: https://dreamn.io/Acho bacana esses projetos que incentivam a se movimentar mais e tal, mas do jeito que tá, daqui a pouco vai ter um breathe to earn kkkkUé?QuoteThree mechanisms are utilized to prevent cheating in the game. GPS Tracking , Data from motion sensors and health activity tracker and our machine learning can identify cheating.GPS Tracking pra dormir? KKKKKKAdivinha de onde tiraram a \"inspiração\"? Pois é, tem agora também um moooooooooonte de cópia da Stepn, só muda o estilo do tenis",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 02, 2022, 08:08:30 AM",
      "body": "Uma ideia que podia ser bem interessante era haver uma cripto para as crianças, de modo a elas melhorem os seus conhecimentos financeiros, e reduzir a literacia financeira.Por exemplo, assim a criança começava a escola, era lhe atribuída x dessa moeda. Depois ela podia fazer várias coisas com ela, fazer stake, investimentos em projetos de colegas etc.. Mas só conseguiria converter em fiat ou BTC quando fizessem 18 anos.Não sei... É uma ideia que tinha de ser trabalhada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "l3pox",
      "created_time": "June 02, 2022, 01:52:37 PM",
      "body": "Quote from: joker_josue on June 02, 2022, 08:08:30 AMUma ideia que podia ser bem interessante era haver uma cripto para as crianças, de modo a elas melhorem os seus conhecimentos financeiros, e reduzir a literacia financeira.Por exemplo, assim a criança começava a escola, era lhe atribuída x dessa moeda. Depois ela podia fazer várias coisas com ela, fazer stake, investimentos em projetos de colegas etc.. Mas só conseguiria converter em fiat ou BTC quando fizessem 18 anos.Não sei... É uma ideia que tinha de ser trabalhada.pra adolescentes, a partir de uns 12 anos acho legal.ajudar com educação financeira é sempre bom, e pelo menos no Brasil as coisas são bem defasadas nesse sentido, na escola mesmo nunca me explicaram direito nem o básico de renda fixa renda variável.Como é em Portugal?Chegamos ao topo?Ontem vi um vídeo no defiant de mais um \"fork\" do stepnsexnHave sex. Get paid. Move to earn is officially topped... (narf narf)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 02, 2022, 06:17:59 PM",
      "body": "Quote from: Lucasgabd on June 02, 2022, 01:52:37 PMQuote from: joker_josue on June 02, 2022, 08:08:30 AMUma ideia que podia ser bem interessante era haver uma cripto para as crianças, de modo a elas melhorem os seus conhecimentos financeiros, e reduzir a literacia financeira.Por exemplo, assim a criança começava a escola, era lhe atribuída x dessa moeda. Depois ela podia fazer várias coisas com ela, fazer stake, investimentos em projetos de colegas etc.. Mas só conseguiria converter em fiat ou BTC quando fizessem 18 anos.Não sei... É uma ideia que tinha de ser trabalhada.pra adolescentes, a partir de uns 12 anos acho legal.ajudar com educação financeira é sempre bom, e pelo menos no Brasil as coisas são bem defasadas nesse sentido, na escola mesmo nunca me explicaram direito nem o básico de renda fixa renda variável.Como é em Portugal?Não ensinam nem a declarar imposto de renda, que somos obrigados. Triste.Não acho que deveria ter aula de cripto nas escolas. Cripto ainda é algo muito experimental. De repente uma aula de curiosidade apenas.Educação financeira vai muito além de criptomoedas, e nem acho que seja um tipo \"tradicional\" de moeda. Faz mais sentido das modinhas e células de verdade pras crianças mesmo..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 02, 2022, 11:35:45 PM",
      "body": "Cara, por mais que pareça absurdo a ideia de um \"sleep to earn\" a primeira vista, eu já conheci muitas pessoas com problema de depressão e burnout que não ''sabem dormir'' e que achavam que ficar programando de madrugada e tomar mil energéticos de manhã é um forma ok de viver. Dormir é algo muito importante, mas que muitas vezes é super subestimado eu acho. Então por exemplo, um sistema que te incentiva a dormir oito horas, dormir no mesmo horário e ter um sono saudável é algo que acho super interessante. Achei a ideia dos aplicativos de micro-crédito baseado em reputação bem macabra",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "t91",
      "created_time": "June 03, 2022, 12:03:31 AM",
      "body": "Quote from: Lucasgabd on June 02, 2022, 01:52:37 PMChegamos ao topo?Ontem vi um vídeo no defiant de mais um \"fork\" do stepnsexnHave sex. Get paid. Move to earn is officially topped... (narf narf) kkkkkkk pensei q fosse uma brincadeira, mas realmente existeLoucura, mas acredito que pra muitos \"criadores de conteúdo\" só fans vai encaixar bem na rotina deles",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 03, 2022, 05:40:36 AM",
      "body": "Quote from: Lucasgabd on June 02, 2022, 01:52:37 PMajudar com educação financeira é sempre bom, e pelo menos no Brasil as coisas são bem defasadas nesse sentido, na escola mesmo nunca me explicaram direito nem o básico de renda fixa renda variável.Como é em Portugal?É igual... Pouca informação é ensinada.Quote from: bitmover on June 02, 2022, 06:17:59 PMNão acho que deveria ter aula de cripto nas escolas. Cripto ainda é algo muito experimental. De repente uma aula de curiosidade apenas.Educação financeira vai muito além de criptomoedas, e nem acho que seja um tipo \"tradicional\" de moeda. Faz mais sentido das modinhas e células de verdade pras crianças mesmo..Não era para ensinar cripto. Era para usar tipo um token, para simular a vida financeira. Onde no final da educação, recebi de bónus um dinheiro equivalente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "June 04, 2022, 06:40:06 PM",
      "body": "Quote from: Lucasgabd on May 31, 2022, 08:04:33 PM[...]o que mais?olha, eu acreditava que a integração de tecnologia neural com as coisas já poderia estar mais avançada, mas parece que isso ainda vai demorar bastante para embalar, seria a minha aposta de integrar isso com a descentralização que as criptos estão provendo.Mas como as coisas parecem estar indo devagar, acredito que o metaverso ainda deva evoluir bastante, as plataformas se unificarem em um único mundo e haver muito mais integração com eventos do mundo real.Complicado nesse momento escolher no que apostar no metaverso, mas quem acertar esse tiro deve se dar muito bem.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 04, 2022, 08:48:26 PM",
      "body": "Quote from: alegotardo on June 04, 2022, 06:40:06 PMOlha, eu acreditava que a integração de tecnologia neural com as coisas já poderia estar mais avançada, mas parece que isso ainda vai demorar bastante para embalar, seria a minha aposta de integrar isso com a descentralização que as criptos estão provendo.Recentemente eu vi um ''meme'' falando ''se você pretende utilizar da neutralink, não guarde sua seed na cabeça.''Não tenho ideia e nunca estudei muito a fundo esses sistemas de integração neural e acho que hoje é mais evoluido/criado pra questão de repostas neurais pra musculos, movimentos de partes afetadas. Mas eu acho assustados pensar em sistemas computacionais acessando nossos pensamentos, seja por motivos de segredos tipo senhas/seeds ou por segredos do tipo coisas que pensamentos que não deveriam nunca sair da nossa cabeça. Mas como tu pensa na integração disso com descentralização, Lucas?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "June 04, 2022, 09:50:07 PM",
      "body": "Quote from: Disruptivas on June 02, 2022, 11:35:45 PMCara, por mais que pareça absurdo a ideia de um \"sleep to earn\" a primeira vista, eu já conheci muitas pessoas com problema de depressão e burnout que não ''sabem dormir'' e que achavam que ficar programando de madrugada e tomar mil energéticos de manhã é um forma ok de viver. Dormir é algo muito importante, mas que muitas vezes é super subestimado eu acho. Então por exemplo, um sistema que te incentiva a dormir oito horas, dormir no mesmo horário e ter um sono saudável é algo que acho super interessante. Indireta pra mim?? Brincadeira, eu evito energético e café... mas já tive minhas madrugadas codando (e engraçado que escrevo esse post às 4 da manhã).Não tinha pensado por esse lado, mas adorei a ideia e fiquei pensando como um app desses mudaria MUITO a minha rotina e qualidade de vida (comumente durmo de madrugada, vide agora rs).Um dia desses eu estive pensando em como tornar esse tipo de app sustentável (temos que admitir que a maioria segue um caminho meio ponzi) e me questionei por que nenhum governo não adota algo do tipo como uma proposta para o bem estar e saúde da população. Pega um pouco desse monte de impostos que temos que pagar e dá de volta para quem quer uma vida mais saúdavel... nada melhor para começar do que um incentivo monetário (e ai fica fácil de criar uma rotina). Só eu penso isso?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "June 05, 2022, 07:29:57 AM",
      "body": "Quote from: alegotardo on June 04, 2022, 06:40:06 PMolha, eu acreditava que a integração de tecnologia neural com as coisas já poderia estar mais avançada, mas parece que isso ainda vai demorar bastante para embalar, seria a minha aposta de integrar isso com a descentralização que as criptos estão provendo.Mas como as coisas parecem estar indo devagar, acredito que o metaverso ainda deva evoluir bastante, as plataformas se unificarem em um único mundo e haver muito mais integração com eventos do mundo real.Complicado nesse momento escolher no que apostar no metaverso, mas quem acertar esse tiro deve se dar muito bem.Eu acho que essas duas coisas são tudo menos descentralizadas.No início são, como agora estão a ser. Mas o nível de recursos necessários vai levar mais cedo ou mais tarde, a centralizar tudo em duas ou três plataformas, de grandes empresas, que irão lidar com milhares de dados das pessoas.É descentralização dos Estados, mas é centralização em empresas privadas. Isso agora parece melhor, mas será mesmo? Será que prefiro que seja o governo a saber tudo o que faço ou um Facebook/Meta? É que essa empresa pode ter uma maior influência nas minhas escolhas que um governo (que não seja ditadura).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "June 05, 2022, 01:12:47 PM",
      "body": "Quote from: alegotardo on June 04, 2022, 06:40:06 PMMas como as coisas parecem estar indo devagar, acredito que o metaverso ainda deva evoluir bastante, as plataformas se unificarem em um único mundo e haver muito mais integração com eventos do mundo real.Complicado nesse momento escolher no que apostar no metaverso, mas quem acertar esse tiro deve se dar muito bem.As apostas mais conservadoras no metaverso são relacionadas às empresas de infraestrutura que certamente vão lugar com o metaverso, independente do formato que ele assuma ou do token  blockchain escolhido.Por exemplo, vamos precisar de placas de vídeo. Então, comprar ações da nvidea.Existem muitos fundos seguindo essa mentalidade.  A rentabilidade não é explosiva  mas é mais garantida.Acho q todo formato de \"paid to\" é basicamente ponzi e voltado ao fracasso no curto/médio prazo. Certamente existem algumas exceções.Apesar de poder dar lucros explosivos, permite perdas igualmente grandes. Não é sustentável na maioria dos cenários.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Disruptivas",
      "created_time": "June 05, 2022, 01:13:16 PM",
      "body": "Quote from: TryNinja on June 04, 2022, 09:50:07 PMIndireta pra mim?? Brincadeira, eu evito energético e café... mas já tive minhas madrugadas codando (e engraçado que escrevo esse post às 4 da manhã).Não tinha pensado por esse lado, mas adorei a ideia e fiquei pensando como um app desses mudaria MUITO a minha rotina e qualidade de vida (comumente durmo de madrugada, vide agora rs).Um dia desses eu estive pensando em como tornar esse tipo de app sustentável (temos que admitir que a maioria segue um caminho meio ponzi) e me questionei por que nenhum governo não adota algo do tipo como uma proposta para o bem estar e saúde da população. Pega um pouco desse monte de impostos que temos que pagar e dá de volta para quem quer uma vida mais saúdavel... nada melhor para começar do que um incentivo monetário (e ai fica fácil de criar uma rotina). Só eu penso isso?Depois de ter saído de São Paulo, minha rotina de sono melhorou bastante e fazia meses que eu não ia dormir depois das 00h ( mas estive em SP recentemente e fui dormir de madrugada). Mas sempre que eu to SP e encontro algumas amigas e amigos, eu percebo como o sono do pessoal das grandes é algo extremamente não valorizado e não por coincidência é também as pessoas que tomam mais remédios pra dormir, pra controlar humor, pra controlar várias questões. Eu já pensei muito sobre isso dos governos adotarem sistemas de incentivo pra boas práticas, mas a mentalidade do governo é proibitiva. É IMPOR SANÇÕES A QUEM FAZ ERRADO. É cobrar $$$ caso a  Coca Coca não diminua a quantidade de açucar, que seila quem seja multado... a mentalidade NUNCA é de incentivar a boas práticas, mas de banir e cobrar por quem faz o inverso. Até porque é assim que o governo arrecada né. Mas eu sei que o governo do Chile já testou um app parecido com o STEPN, achei a referencia em um artigo recentemente, mas procurando pela iniciativa em si, não encontrei muita coisa. Curiosidade, o Chile, em termos de governos da América Latina é o que mais incentiva a adoção e destina recursos ao desenvolvimento de empresas. Talvez você também goste de conhecer a https://betterfly.com/ , que é uma empresa que busca incentivar práticas de vida melhores e converte bons hábitos em benefícios e coins que tem como objetivo retornar em coisas boas para empresas e comunidades. No final o benefício monetário acho que não volta diretamente pra quem se exercita/faz boas práticas, mas pra terceiros e em beneficios de seguro, mas talvez você goste de conhecer a tecnologia em si, eles são gigantes já e atendem muitas empresas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "June 05, 2022, 09:32:10 PM",
      "body": "Quote from: Lucasgabd on May 31, 2022, 08:04:33 PM(...)Excelente tópico @Lucasgabd  Há alguns dias atras estava conversando com alguns amigos sobre o futuro da web3! Com relação a essa ideia de empréstimos (micro-crédito) acredito que já foi criado algo similar com relação a isso, não foi!!? Acredito que foi o BTCJam nos anos 2014-2015, mas parece que não deu muito certo! (me corrigem caso eu estiver errado)Com relação a descentralização da internet ou de termos uma rede de comunicação totalmente descentralizada e que não dependa de empresas/governos!!? (WAN - Wide Area Network)Será que já existe a possibilidade de termos algo assim!!? Internet via satelite ou uma internet aprimorada? Como se fosse uma Starlink 2.0?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}