{
  "id": "topic_5451302",
  "title": "Dunamisx",
  "author": "Dunamisx",
  "created_time": "May 05, 2023, 10:06:58 AM",
  "content": "Ajay Banga to emerge as the new president world bank, this comes after the candidate had been screened fit as the best participant for the position after undergoing thorough scrutiny from the US in other to appear as their most preferred candidate, Ajay Banga is coming into office as a result of the stepping down of David Malpass criticized for inadequate delivery over the climatic challenges.QuoteBanga previously ran the payments company Mastercard for more than a decade between 2010 and 2021. He has also served on the boards of the American Red Cross, Kraft Foods and Dow Inc. https://punchng.com/breaking-world-bank-appoints-ajay-banga-as-president/?ampAjay Banga will assume office by June and part of his awaiting responsibilities is to focus on the developing countries challenges and fight against the climate issues becoming a threat on global effect, not only that, he's working on how to engage the private sector into partnership while working together towards full delivery on the issue with global economy.Does change in Power bring a new change to the World Economy?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451302",
  "comments": [
    {
      "author": "Gyfts",
      "created_time": "May 05, 2023, 10:52:20 AM",
      "body": "\"World Bank\" is a bit of a misnomer because the organization is primarily controlled by the U.S. The U.S. provides the majority of the funding and therefore they get to appoint the board members. Other countries that contribute financially don't get much veto power. Anyways, they don't actually do a lot of banking for economic purposes, it's more of ESG initiatives for poor countries so I wouldn't imagine Ajay Banga's appointment to be very consequential. He'll be there to do the U.S.'s foreign policy bidding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}