{
  "id": "topic_5460284",
  "title": "Jessie2121",
  "author": "Jessie2121",
  "created_time": "July 19, 2023, 05:31:47 AM",
  "content": "I no know how this topic go take ginger us for this our community but all I dey try talk be say make we as Naija ninjas wey we be make we try any how e be to always look out for each other. E no go make sense if we see for anywhere for this forum wey them dey use mouth take white wash our brodas and sistas for this community we go con follow too go dey bad mouth dem join, e better no to even talk self. We suppose look out for each other, I know say for every disciple wey chineke get one bad egg dey inside, make nobody carry our matter go yarn for back yard oh. Why I reason una this matter nah because of wetin I see for this Forum, the battle wey dey go on for one thread like that, them dey use words wey no healthy at all, and I feel say we suppose avoid that kind for here.Make we stand strong for Us, make nobody go do back bitting because you wan become OGA or MADAM for this Forum.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5460284",
  "comments": [
    {
      "author": "Nwada001",
      "created_time": "July 19, 2023, 03:54:32 PM",
      "body": "Make Newbies and other members first start 2 dy do d right thing first make eh remain for others to follow, no be wen newbies go enter the forum come wan start to spoil the reputation if the 9ja people, u no go expect ur follow 9ja piple 2 com dy defend the Pesin 4 that kind matter. Here way we dy I believe say we dy help 1 another even if the help no big like that 4 some piple eye, but at least I dy see am say we dy try for here. Me personally d time way SatoPrincess been report my post wen I been dy come up 4 diz forum 4 Plagiarism, dat time I been dy feel say d user do me bad thing base on say in suppose protect me try call me to other, tinx like that, but as time dy go, I realize say watin she do self help me well well realize and learn 4rm my mistake, way be say den I been dy wan try to make any kind post collect small merit support myself, way mke me go search for internet about something as I see the information I rush carry my brain rephrase am like say nah me write am instead of me to give credit to where I been get the original work from. Now I don learn from am say something like they no good, and eh better say our own people either call us to other when dem see bad thing or if means no dy make dem be d 1 to call 4 attention, make other way dy the forum no come dy feel like say we 4 our local board we dy purposely dy harbour some kind Spam post or anything way relate to am. I don also see for where dem call on 1 of our person, and some of our snr oga 4rm here come out come pled 4 d Pesin, case like that day, wen something way no right dy happen even who no from ur local fit support u, but for matter way d obvious say the person really don commit, ur locals go either pass behave like say dem no see am, or dem go join hand for the case Weller, no body go use bcuz of 1 newbie way no wan learn go spoil on own reputation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "July 19, 2023, 04:25:20 PM",
      "body": "Quote from: Jessie2121 on July 19, 2023, 05:31:47 AMI no know how this topic go take ginger us for this our community but all I dey try talk be say make we as Naija ninjas wey we be make we try any how e be to always look out for each other. E no go make sense if we see for anywhere for this forum wey them dey use mouth take white wash our brodas and sistas for this community we go con follow too go dey bad mouth dem join, e better no to even talk self. We suppose look out for each other, I know say for every disciple wey chineke get one bad egg dey inside, make nobody carry our matter go yarn for back yard oh. Why I reason una this matter nah because of wetin I see for this Forum, the battle wey dey go on for one thread like that, them dey use words wey no healthy at all, and I feel say we suppose avoid that kind for here.Make we stand strong for Us, make nobody go do back bitting because you wan become OGA or MADAM for this Forum.This is Bitcoin community so at that local board community is still part of the larger bitcointalk community so for that your suggestions say make fellow Nigeria no put mouth for waiting for others dey talk no go work,  just as the first comment suggested Naija local board members both newbie and old members should first of all work on themselves before making any comment that will bring public backlash to them,  because all members of bitcointalk have an equal right to make whatever contributions and on whatever thread they want,  is either you develop a thick skin to withstand criticism and being smart enough to take positive criticism to help you grow and also look away from negative criticisms. That is how the forum works,  so you can't try to use emotional blackmail to influence anyone's decision here and not because we are members of the same local board you do wrong something you won't expect a correction from other 9ja forum members. This is not the first time someone is saying something similar to this,  because I can still remember when one guy was reporting ChalseTM that he always counters him,  meanwhile, Charles was only pointing out his error,  so let that mentality be changed,  this is the cryptocurrency industry and location doesn't mean much because no one cares or have access to your privacy unless the one you allow.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yawa2020",
      "created_time": "July 19, 2023, 04:52:06 PM",
      "body": "Quote from: Wiwo on July 19, 2023, 04:25:20 PMThat is how the forum works,  so you can't try to use emotional blackmail to influence anyone's decision here and not because we are members of the same local board you do wrong something you won't expect a correction from other 9ja forum members. Wetin happen na? Abeg make person gist me too cus e be like say I don miss. If person fuck up for outside we go try rescue am if possible and con change am for him here because hand no dey smell make dem cut am comot. For my side here if our person dey fight for outside we go join fight finish before we go con even ask wetin bring the fight but Forum dey different from outside world.I go like advice make we all dey careful for larger community to avoid anything wey go bring issue like this sef. Our politicians Don give us bad image for outside already make we no justify am here biko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stable090",
      "created_time": "July 19, 2023, 05:58:14 PM",
      "body": "Quote from: Jessie2121 on July 19, 2023, 05:31:47 AMI no know how this topic go take ginger us for this our community but all I dey try talk be say make we as Naija ninjas wey we be make we try any how e be to always look out for each other. E no go make sense if we see for anywhere for this forum wey them dey use mouth take white wash our brodas and sistas for this community we go con follow too go dey bad mouth dem join, e better no to even talk self.I know say some of use dey fuck up sha, but if we know say person na from our local board, e no go make sense make you go dey cast the person if him fuck up for other section, you fit even send the personal message make u correct am, but if you see d way some of our Naija guys go dey contribute you go even dey vex self. Make we never too go far self, some people go create thread for dis our local board, even if the post no too make sense, highest na to correct the person and make we tell am make him no dey create thread like that again, atleast make we encourage the person to improve the way him dey post, but if you see the way some of our brothers go dey talk for here, you go dey discouraged to even dey post here. If you see a newbie here make we treat am like newbie, no be everybody get who dey guide am, some of us are just struggling to build ourselves on the forum here without having anyone to guide us. Some people dey try post here so that our own board no go just dey client, but if you come dey use harsh words on people, then nobody go wan dey post again now, nobody like insult now, but since our high rank members wey dey dis forum don struggle for make wey get board, dem d only support wey we fit give them na to make d board dey active.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jessie2121",
      "created_time": "July 19, 2023, 07:21:34 PM",
      "body": "Quote from: Stable090 on July 19, 2023, 05:58:14 PMQuote from: Jessie2121 on July 19, 2023, 05:31:47 AMI no know how this topic go take ginger us for this our community but all I dey try talk be say make we as Naija ninjas wey we be make we try any how e be to always look out for each other. E no go make sense if we see for anywhere for this forum wey them dey use mouth take white wash our brodas and sistas for this community we go con follow too go dey bad mouth dem join, e better no to even talk self.I know say some of use dey fuck up sha, but if we know say person na from our local board, e no go make sense make you go dey cast the person if him fuck up for other section, you fit even send the personal message make u correct am, but if you see d way some of our Naija guys go dey contribute you go even dey vex self. Make we never too go far self, some people go create thread for dis our local board, even if the post no too make sense, highest na to correct the person and make we tell am make him no dey create thread like that again, atleast make we encourage the person to improve the way him dey post, but if you see the way some of our brothers go dey talk for here, you go dey discouraged to even dey post here. If you see a newbie here make we treat am like newbie, no be everybody get who dey guide am, some of us are just struggling to build ourselves on the forum here without having anyone to guide us. Some people dey try post here so that our own board no go just dey client, but if you come dey use harsh words on people, then nobody go wan dey post again now, nobody like insult now, but since our high rank members wey dey dis forum don struggle for make wey get board, dem d only support wey we fit give them na to make d board dey active. I dey read you comment but I say ma stop for road because you really see my point for this matter I bring so, if I fuck up for outside e go good make you wey dey see my fuck up come my house which is my PM tell me say see as e be oh make I try amend my errors make I address myself, e get how you go tell person something him go take corrections immediately and e get as you go use tell am too him go begin para because you use the wrong words. Like them talk, advise no be curse but make we know how to arrange the talk.Quote from: Nwada001 on July 19, 2023, 03:54:32 PMMake Newbies and other members first start 2 dy do d right thing first make eh remain for others to follow, no be wen newbies go enter the forum come wan start to spoil the reputation if the 9ja people, u no go expect ur follow 9ja piple 2 com dy defend the Pesin 4 that kind matter. Here way we dy I believe say we dy help 1 another even if the help no big like that 4 some piple eye, but at least I dy see am say we dy try for here. Me personally d time way SatoPrincess been report my post wen I been dy come up 4 diz forum 4 Plagiarism, dat time I been dy feel say d user do me bad thing base on say in suppose protect me try call me to other, tinx like that, but as time dy go, I realize say watin she do self help me well well realize and learn 4rm my mistake, way be say den I been dy wan try to make any kind post collect small merit support myself, way mke me go search for internet about something as I see the information I rush carry my brain rephrase am like say nah me write am instead of me to give credit to where I been get the original work from. Now I don learn from am say something like they no good, and eh better say our own people either call us to other when dem see bad thing or if means no dy make dem be d 1 to call 4 attention, make other way dy the forum no come dy feel like say we 4 our local board we dy purposely dy harbour some kind Spam post or anything way relate to am. I don also see for where dem call on 1 of our person, and some of our snr oga 4rm here come out come pled 4 d Pesin, case like that day, wen something way no right dy happen even who no from ur local fit support u, but for matter way d obvious say the person really don commit, ur locals go either pass behave like say dem no see am, or dem go join hand for the case Weller, no body go use bcuz of 1 newbie way no wan learn go spoil on own reputation.You talk well my senior oga, I know say this thing hard oh but e still be the same thing to dy cover ourselves e better make we no go find our own person dy go exchange words with other members from other side like the international ways, nah them get here but e go bad if we start to scrub body with them just to gain favor and even sell out our own person too... But any how sha the main thing nah to do the needful and not to allow anybody go spoil wetin you don build for years in one day, all newbies and even the higher ranked members make everybody dy mindful of wetin we dy do.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EluguHcman",
      "created_time": "July 19, 2023, 11:26:20 PM",
      "body": "Dis forum b like spiritual world way dey conet pipo.I go take dis topic as  \"being ur brodas kipa\"E com remind me of 1 topic I bin make say \"Walk with those on the same mission as you\"https://bitcointalk.org/index.php?topic=5458884.msg62512588#msg62512588E be like military way dey mission, u fit dey armless bt ur colleague hold AK-47 or evn dynamite behind u yet ur faith remain say him gt ur back 4 a battle field oh.Dem dey fight to win togeda no b 4 personally recognize. Minus1 of ur colleague reduce una weight oh & chorus songs dey sweet if una bring una voice com togeda.D only minority way go count 4 a team adventure na da 1 (s) way no at all dey on same mission as una. Jst on disguise.Dis remind me of 1 adage for my place way say... 1 single broom dey easy 2 bend and break bt u go only fit bend a bunch of broom bt no fit break am.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Belarge",
      "created_time": "July 20, 2023, 07:16:12 AM",
      "body": "Well to me I see am say this forum na where person needs dey free to talk his/her mind, though we still get some rules and regulations shall, Op with wetin you dey talk shall, I jus feel say e get person wey you dey try to talk to personally, but you want just make am a thread so other people like us see am too, so we fit still learn to dey always stand and to dey help our brothers and sisters  so all of us go stand strong together, we don hear wetin you talk and we go stand by am too, all of us go carry ourselves along because I know say nobody sabi pass, all of us dey learn everyday...Thank you..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marykeller",
      "created_time": "July 20, 2023, 08:39:34 AM",
      "body": "Na why em be sae peso need to identify em self for em local board so that others go fit know am sae em be one of us, in term of knowing how to defend, correct and not putting bad mouth for em matter when unnecessary gbenke go happen for em side. Em no get how we go know sae you be one of us, come the bring your matter wey no d good for the forum without correctly and telling things wey you are getting right for the forum. I have seen on several occasions wey our brothers and sisters for the forum don stand out for each other for the forum. They were able to that because the said peso identified em self for our local board. If the said peso no identify em self for the forum, how Nigerians wey d for the forum go reason em matter. No way This is more reason peso need to identify em self and engage with post being made in our local board so that others wey no know am go fit know am by standing out for am and correcting am when em get am wrong for the forum. No identification for the local board wey you belong, means sae no support, or guidance from your country's people wey dey the forum. Em go be oyo wey matter concerning the peso come on board for the forum",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Merit.s",
      "created_time": "July 20, 2023, 05:43:14 PM",
      "body": "E get the kind fuck up wey person go do wey we go fit beg on him behalf and forum people go listen. At the same time e get the kind fuck up wey person go fuck up wey be say nobody go fit put mouth beg for you but instead them go nail you,so that make e no be say we dey do partial for the forum. You know say this forum na every country dey here and white man no dey see black call am white just like the wey we dey do for Naija. So wetin I won try advice be say anybody wey person dey bring come the forum make you teach am and advice am well make you use the forum rules as everyday guideline wey go guide am from messing up or bringing out him own leg for other people not to get him time. Where law dey discipline go dey and where discipled dey,order go dey. Everybody need to dey very careful with him activities for the forum especially newbies. No put merit and money as your priority for here, instead put reading and learning first to avoid fuck up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Forever101",
      "created_time": "July 20, 2023, 07:32:40 PM",
      "body": "Wetin I fit yarn for this matter be say, make we dey soft on our brother, if any person wan post something new for other board and ihm see say the thing wey in wan post no too clear, make e yarn nam for here make we first clear the thing. Another thing be say, if person talk something, those one wey get experience make them try dey relate as others dey do so that the newbie wey dey among us fit grow and dey confident to ask anything for local board. That one go make the local board grow and more participation . I commend all our senior men wey stand gidigba dey help us grow, I give una hand, una too much",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jessie2121",
      "created_time": "July 22, 2023, 12:30:39 AM",
      "body": "Quote from: Forever101 on July 20, 2023, 07:32:40 PMWetin I fit yarn for this matter be say, make we dey soft on our brother, if any person wan post something new for other board and ihm see say the thing wey in wan post no too clear, make e yarn nam for here make we first clear the thing. Another thing be say, if person talk something, those one wey get experience make them try dey relate as others dey do so that the newbie wey dey among us fit grow and dey confident to ask anything for local board. That one go make the local board grow and more participation . I commend all our senior men wey stand gidigba dey help us grow, I give una hand, una too muchE good say make we ask questions but as we dy ask the questions we go get the reply immediately?You know say no b everybody dy always dy online when the next man dy online... So I go say eh if person wan start topic for our local board e go good make we like talk about our topic with our upper men and women them for here as you talk so that we no go dy see double double topics wey look like ejima... Your take make sense but e go hard some how oh for people to follow this pattern. Everybody wan run leave the other person to reach a certain level. Nah so I see am oh.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "July 22, 2023, 10:36:59 PM",
      "body": "The forum no be for the weak and laggards, no be because you nah 9ja then that means when you misbehave your fellow person no go straighten you up. That kind culture if allowed here go bring bad repute and let down to the 9ja community inside the forum.As you enter forum learn the rules abide by it, do your own part in terms of delivery quality info's and updates , anybody wey see your struggles say it legit go give you a little support as him fit do.Bit no be to the rely on emotions, relativeness cos normally here nah official ground and whatever we dey do here we gat add official attitude towards it. Although some men no dey cool on the newbies but to me I take am say nah part of life way supposed make you strong and going. Certain situations don emerge wey some persons fvckup on rule matter for the forum but some snr men pull up and saved the day . So make nobody talk talk wey look like we no dey help each for the forum n the little ways we can depending on how the matter be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jessie2121",
      "created_time": "July 31, 2023, 11:19:10 AM",
      "body": "Quote from: letteredhub on July 22, 2023, 10:36:59 PMThe forum no be for the weak and laggards, no be because you nah 9ja then that means when you misbehave your fellow person no go straighten you up. That kind culture if allowed here go bring bad repute and let down to the 9ja community inside the forum.As you enter forum learn the rules abide by it, do your own part in terms of delivery quality info's and updates , anybody wey see your struggles say it legit go give you a little support as him fit do.Bit no be to the rely on emotions, relativeness cos normally here nah official ground and whatever we dey do here we gat add official attitude towards it. Although some men no dey cool on the newbies but to me I take am say nah part of life way supposed make you strong and going. Certain situations don emerge wey some persons fvckup on rule matter for the forum but some snr men pull up and saved the day . So make nobody talk talk wey look like we no dey help each for the forum n the little ways we can depending on how the matter be.All you talk nah true, e beta say make we just dy careful for everything wey we dey do if not e go bad for that person wey enter wrong road. Well me I no go wan cos anything wey go go against the rules and regulations of this place so e beta make I follow una footsteps bcos me I wan reach una level too, well nah small small.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "July 31, 2023, 02:24:48 PM",
      "body": "Quote from: Jessie2121 on July 31, 2023, 11:19:10 AMQuote from: letteredhub on July 22, 2023, 10:36:59 PMThe forum no be for the weak and laggards, no be because you nah 9ja then that means when you misbehave your fellow person no go straighten you up. That kind culture if allowed here go bring bad repute and let down to the 9ja community inside the forum.As you enter forum learn the rules abide by it, do your own part in terms of delivery quality info's and updates , anybody wey see your struggles say it legit go give you a little support as him fit do.Bit no be to the rely on emotions, relativeness cos normally here nah official ground and whatever we dey do here we gat add official attitude towards it. Although some men no dey cool on the newbies but to me I take am say nah part of life way supposed make you strong and going. Certain situations don emerge wey some persons fvckup on rule matter for the forum but some snr men pull up and saved the day . So make nobody talk talk wey look like we no dey help each for the forum n the little ways we can depending on how the matter be.All you talk nah true, e beta say make we just dy careful for everything wey we dey do if not e go bad for that person wey enter wrong road. Well me I no go wan cos anything wey go go against the rules and regulations of this place so e beta make I follow una footsteps bcos me I wan reach una level too, well nah small small.Come, eh get one mindset I go like make everybody for this forum get, and carry for mind everytime dey come here, because until you treat this forum just like your office/workplace, and keep to the rules same way you for keep to the rules if you were working under your Oga for one corporate firm & organization, I bet you no can never get good result from here, and even if you do, if you can not respect people here the same way you for respect your senior colleagues at work, I bet you also, you no go last long here. So in the nutshell, what am I saying? I'm trying to say that please, that whatever we do, let's not forget to always treat this forum as our office, because truth be told, in a month this forum dey pay pass x3 wetin more than 50% of our 9ja citizens dey comot house each morning go work for & come back by 4p.m every blessed day. So let's learn to appreciate & add value to it, abeg.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "July 31, 2023, 05:42:06 PM",
      "body": "I created a thread some time again to scare some people wey dey post anyhow in the local board nd it was not to nail dem to di wall, and before I create di thread, I crossed check many users profile and compiled di list and created the thread, thinking that they would straighten up but irony was the matter, and I was attacked by most Members, some PMed me to lock the thread. As for me nobody hate another person in the local board, we really love and protecting one another, but the problem bi sae, as weti Nwada001 tok nai be that, newbies and some grown up users in the local board refused to adhere to the local board rules. Some legendary members in the local board as said it before, anyone that refused to adhere to the local board rules will dance to the tone one day. Like now I saw a Sr. Member creating off topic thread in in local board, is it that she is not aware of the local rules? We should show examples to the newbies but opposite is always here.Nobody should tell me that we don't love ourselves but the unscrupulous ones are problem we have in the local board. If simple instruction is given to us to follow, most of us would/will not follow it. Now new instruction was given this month again day, anyone who dey bring pesen to di forum, tell di pesen both di don't and dos yet users are still not doing it. And this issue has been foresaw by Smartvirus in 2022 when we were using one thread but we against him but today everything is displaying on our naked eyes and we are all seeing it. \"The cleaning of this local board was my priority\" but I gave up and focus my business.From what I am even noticing, some users have divided the board among themselves. This user is not good and this user is good. Normally such must happened. And that is not my problem. And if you want the unity of the board follow the rules. Post according to the board rules, don't post/create irrelevant threads. Not every news you see in Nigeria that you will bring to the forum. Have you created any of those news in your social media platforms? No. Those who do not understand and no knowledge about it always give up from the forum, so why can't we discuss bitcoin related matters so they can learn from you, instead of telling them what they have already heard from their social media platforms and other informative devices like radio and TV. The unity is lie on u nd me. Follow di rules. I believed brod Igebotz has done his part and it is for us to follow up the rules https://bitcointalk.org/index.php?topic=5430885.0. if it is possible stop telling pipo abt di forum for now, nd let us understand ourselves well first b4 newbies should come and follow up di trend. Dis was a suggestion made some times again but it was against.Follow the local board rules then all is well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "July 31, 2023, 06:27:02 PM",
      "body": "I've just came across this post though for few moments now I never put eyes this sections of the forum but if I may understand correctly, here is an open place and whatever anyone does is of his or her own detriment because I know too well that most people always act to have themselves at the front. Why? They fails to understand that we are both classified as one despite how much effort you put to make yourself different or abstain from any classification of Nigerians, but know it too well that the black 'is always classified as black' despite how creative you ought to be.A day to come people will always point at you not even only you but the entire community, have you also reasoned why theymos isn't paying much attention to us, if you doubt it look other local board and watch out to see how they are speedily growing even more than us. What really helping us is how creative we are in making post and also hustling well to make sure they passed some restrictions.What do I say much, well I can't go above my limit as I believe no one in this local board is below 10 years so I expect everyone to acts maturedly and respect each others without any grudges or to envy them due to their fast growth. If you know how to be creative do it as well and stop being too jealous of other people progress over here and, besides I have seen people putting their resources here and support others without having to feel jealous. We are for 9ja and 9ja is ours, so let everyone steps down from competition because position and promotion would always come at the right time you put efforts in making yourself useful to the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaNNy001",
      "created_time": "July 31, 2023, 06:47:18 PM",
      "body": "Quote from: Adbitco on July 31, 2023, 06:27:02 PMA day to come people will always point at you not even only you but the entire community, have you also reasoned why theymos isn't paying much attention to us. Well said brother, but me I doubt the fact wey u talk say theymos no dey pay attention to our board, yes him no dey pay attention but that one na normal thing because no be only us nai this him habit dey reflect on. The man nature I suppose is just like that at least I can with all the past experience I have seen some people encounter with him and moreover giving us our local board is one great feat we naija should acknowledge because their are alot of other people trying to get their but to no avail.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "August 01, 2023, 09:32:35 AM",
      "body": "Quote from: DaNNy001 on July 31, 2023, 06:47:18 PMQuote from: Adbitco on July 31, 2023, 06:27:02 PMA day to come people will always point at you not even only you but the entire community, have you also reasoned why theymos isn't paying much attention to us. Well said brother, but me I doubt the fact wey u talk say theymos no dey pay attention to our board, yes him no dey pay attention but that one na normal thing because no be only us nai this him habit dey reflect on. The man nature I suppose is just like that at least I can with all the past experience I have seen some people encounter with him and moreover giving us our local board is one great feat we naija should acknowledge because their are alot of other people trying to get their but to no avail.Seems like you don't comprehend my post correctly.What I am saying is that, most of our 9ja nature might even attributes to the cause, not that others   are not pending for their request but we should in all diligence act respectfully and matured, and other things I noticed holding us down is that we have no much record of Legendaries although I can't specifically give accurate data but I believe Igebotz can do that for us. As a community here in Bitcointalk we are all classified as one so let no one outsmart others in order to get favor from rest people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "August 02, 2023, 11:07:19 PM",
      "body": "I no bin really wan give in to watin OP Dey talk but as I begin read, I con dey fine strains way interest me and if you check am, e point out small something way I feel say, e no bad if you reason am. Most of us here and not only within our naija but even for other locale dem don dey practice am since but, na on low key and that na,Not to bad mouth your person if u no ft help am make ground for soft for ramAnother important talk way e bring cum out be say,Make we no dey back bite person. I no know if this one don happen before but, e sure me die say either on forum or not, watin you no fit talk for front, you no suppose even talk am at all. E make you less than a person if anybody dey behave like that. Abeg, make we nobody reason am.Another thing I go like add be say, make we try dey see correction as correction. Make person no con Dey think say, person dey fight am because them tell you word way you no like. E you know watin good, try do am and avoid watin go make person talk say you too dey do. Especially for matter way don come up before. Make we try understand say, anything way one person do, e fit get immediate effect on the person but, e dey reflect the community as well.Una well done!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}