{
  "id": "topic_5444915",
  "title": "BTC Monk",
  "author": "BTC Monk",
  "created_time": "March 14, 2023, 08:01:22 PM",
  "content": "https://scarce.city/auctions/satoshi-dragonhttps://youtu.be/tHPXGqNYAawwww.twitter.com/btcmonk1 Satoshi Dragon is authentic and one of a kind artwork. It was made by putting many layers of black charcoal lacquer on plywood for the foundation and then gilded with more then seventy 22 carat gold leafs. It took 150 hours to finish this piece.Symbology of the artwork:Dragons have been part of East Asian cultures for more then 4,000 years. They are symbols of great power, wisdom, good fortune and health.Due to Satoshi Nakomato name being of Asian origin and due to what it means to Bitcoin community, I depicted Satoshi Nakamoto in this art piece as this wise and powerful mythical being who shines on all of us with his pearls of wisdom, pushing us to be free and prosperous at all times. Waves at the bottom of the artwork symbolizes periodical surges of good fortune brought to us by Bitcoin.This artwork was started at block 774,654 and finished at block 778,957. Numbers of blocks were gilded in 22 carat gold leaf on the back side of the artwork.This Lot Includes:SATOSHIDRAGO 1/1 tokenPhysical Artwork 1/1Dimensions:Without frame - 49.5 x 76.5 cm (19.5 x 30 inches)Frame - 54.55 x 81 cm (21.5 x 31.9 inches)Weight: 2kg (4.4 lbs).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444915",
  "comments": [
    {
      "author": "Kryptowerk",
      "created_time": "March 15, 2023, 08:38:08 PM",
      "body": "Lovely and very unique piece of art - as always.Regarding shipping, do you have an estimate on costs to Europe/EU or how do you plan on handling this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BTC Monk",
      "created_time": "November 01, 2023, 08:43:20 PM",
      "body": "Thank you and my biggest apologies for late reply as I am not often here. Its around 200 dollars to USA usual,  so EU should be around half the price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}