{
  "id": "topic_5473011",
  "title": "Free Market Capitalist",
  "author": "Free Market Capitalist",
  "created_time": "November 06, 2023, 04:49:56 AM",
  "content": "Not a serious request but at least one thing I think is worth commenting on. There are a lot of threads in the Bitcoin Discussion section that are probably made up, some simply by analyzing the OP's post history are proven false, and those that are not proven false due to lack of evidence at least smell made up. They are threads along the lines of \"I convinced xxx to buy Bitcoin and today he is a millionaire\" \"Bitcoin has changed my life\".The latest installment of this saga is someone who claims to have sold his family's land, without their permission, to buy Bitcoin, and if we take into account that the Bitcoin was kept by him, he is confessing to a crime. Quote from: Justbillywitt on November 05, 2023, 09:45:53 PMI sold our family land and used the money to invest on bitcoin. ...My resolution to invest in bitcoin is final and there is nothing anybody can do about it. Most of these threads are more or less crude attempts to get merit, which sometimes backfire on them. That's why I think it would be worthwhile to create a \"Likely made-up stories\" board and move them all there.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473011",
  "comments": [
    {
      "author": "Solosanz",
      "created_time": "November 06, 2023, 05:08:34 AM",
      "body": "Serious response: The made-up stories in Bitcoin discussion section didn't receive a merit or only receive few merits, which means many users already use their common sense before meriting someone. So I don't think there's should be a necessary move for this case except the moderator to lock the topic.Fun response: Yes, there are so many made-up stories, so they deserve it's own section.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "November 06, 2023, 05:41:33 AM",
      "body": "The truth is that posts like that should fit well in off-topic board since they are obviously not real and we’re made up, but the fact that forum members can easily make their weekly signature posts quota from such thread they have all decided to turn a blind eye towards it and still reply as if the stories are true. And as long as users still reply to thread like that without proper analysis then more of it will definitely be made.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UmerIdrees",
      "created_time": "November 06, 2023, 05:49:28 AM",
      "body": "Quote from: Poker Player on November 06, 2023, 04:49:56 AMMost of these threads are more or less crude attempts to get merit, which sometimes backfire on them. That's why I think it would be worthwhile to create a \"Likely made-up stories\" board and move them all there.  These made up stories no doubt are meant to get some merits but usually these days everyone knows this and they have to come up with some new plan  By the way, what is the purpose of moving all the made-up stories here. These stories are almost similiar and no more interesting to read.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "November 06, 2023, 06:03:50 AM",
      "body": "You can leave links of made-up stories in two topicsAnnounce your story with Bitcoin, first purchase, sale, business, education ...Announce your rank up, merit or any achievements that makes you feel great!I want to tell my dad, my mom, my friend, my children about Bitcoin. I teach them how to buy, sell bitcoin. I buy, sell my first Bitcoin. I want to sell my land, home to buy Bitcoin. My family was broken because of Bitcoin heritage. My friend lost bitcoin because of carelessness.All are made up stories but how those topics received many merit, it's a secret that I can not understand.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shahzadafzal",
      "created_time": "November 06, 2023, 06:22:25 AM",
      "body": "Well, I must say, I wholeheartedly agree with the OP's request.But before that, I think we need to have a separate board for the \"Request for a board\" topics.Please, theymos.We could name it:Request for a Board Request BoardA place where users can put in their earnest requests for a board, specifically designed for requests about requesting boards. Please don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "November 06, 2023, 07:20:08 AM",
      "body": "Although we adhere to very careful handling of tags, a neutral tag with the wording “fabulist” would probably discourage many storytellers from creating similar topics. Moreover, even those who may have a drop of truth in their story will think a hundred times about creating such topics. Today, managers are attentive to neutral tags, although sometimes tags do not carry anything dangerous for the user, and the fabulist icon will also play a certain role for each manager and his contact with such a user.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "November 06, 2023, 07:46:39 AM",
      "body": "Sounds like joke. Hopefully it is. Let us assume this board request is granted for moment, still most of those would go to Bitcoin discussion only, for you these stories may be made-up but for them they are trying to get it across as legit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "November 06, 2023, 07:51:37 AM",
      "body": "Quote from: Poker Player on November 06, 2023, 04:49:56 AM-snip-That's why I think it would be worthwhile to create a \"Likely made-up stories\" board and move them all there. Make-up stories are baseless and I believe we share value on this forum, even the thought of it should have been resisted by you. Let the conscience judge anyone who cooked up stories and you may leave and laugh over the supposed such and go your way if you come across them.Frankly, you are not a perfect person, what if what you term \"make-up stories\" are the actual events? This is why what we can't be 100% convinced of, see or prove without a reasonable doubt shouldn't be labelled as we believe it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "November 06, 2023, 08:15:15 AM",
      "body": "Quote from: EarnOnVictor on November 06, 2023, 07:51:37 AMMake-up stories are baseless and I believe we share value on this forum, even the thought of it should have been resisted by you. Let the conscience judge anyone who cooked up stories and you may leave and laugh over the supposed such and go your way if you come across them.Frankly, you are not a perfect person, what if what you term \"make-up stories\" are the actual events? This is why what we can't be 100% convinced of, see or prove without a reasonable doubt shouldn't be labelled as we believe it. I understand that since we are not there with these people who create such threads, we are left with no option but to believe it, right? But what I think he is saying is there are some that are so obviously a lie that just looking at it will make you cringe, those are the ones he's saying should have a board so that way people who want to exaggerate things for which Bitcoin made them do, they can just go on the board.Quoteyou may leave and laugh over the supposed such and go your way if you come across them.You've got a point. But I feel @Poker just enjoys poking fun at things or people just for the fun of it, right? You too could have just read and passed on if it were that disturbing but you chose to reply eh, well thats the freedom we are talking about. It's a free country and if he wants to do what he wants to, it's his choice and don't take it too seriously.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_act_",
      "created_time": "November 06, 2023, 08:19:07 AM",
      "body": "Quote from: Poker Player on November 06, 2023, 04:49:56 AMMost of these threads are more or less crude attempts to get merit, which sometimes backfire on them. That's why I think it would be worthwhile to create a \"Likely made-up stories\" board and move them all there. You mean true life stories. Stories that have no evidence of existence. If there is a board of bitcoin true life stories, it will only open more ways for other people to read and form their own false stories to narrate.  Quote from: Cantsay on November 06, 2023, 05:41:33 AMThe truth is that posts like that should fit well in off-topic board since they are obviously not real and we’re made up, but the fact that forum members can easily make their weekly signature posts quota from such thread they have all decided to turn a blind eye towards it and still reply as if the stories are true. And as long as users still reply to thread like that without proper analysis then more of it will definitely be made.Still it is about bitcoin and that is what bitcoin discussion is for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EarnOnVictor",
      "created_time": "November 06, 2023, 10:52:38 AM",
      "body": "Quote from: Majestic-milf on November 06, 2023, 08:15:15 AMQuote from: EarnOnVictor on November 06, 2023, 07:51:37 AMMake-up stories are baseless and I believe we share value on this forum, even the thought of it should have been resisted by you. Let the conscience judge anyone who cooked up stories and you may leave and laugh over the supposed such and go your way if you come across them.Frankly, you are not a perfect person, what if what you term \"make-up stories\" are the actual events? This is why what we can't be 100% convinced of, see or prove without a reasonable doubt shouldn't be labelled as we believe it. I understand that since we are not there with these people who create such threads, we are left with no option but to believe it, right? But what I think he is saying is there are some that are so obviously a lie that just looking at it will make you cringe, those are the ones he's saying should have a board so that way people who want to exaggerate things for which Bitcoin made them do, they can just go on the board.Quoteyou may leave and laugh over the supposed such and go your way if you come across them.You've got a point. But I feel @Poker just enjoys poking fun at things or people just for the fun of it, right? You too could have just read and passed on if it were that disturbing but you chose to reply eh, well thats the freedom we are talking about. It's a free country and if he wants to do what he wants to, it's his choice and don't take it too seriously.Sometimes I wonder why people reply when they do not have anything meaningful to butress, perhaps didn't understand what they reply to. A typical example is you, instead of you to add your opinion directly, you are here correcting. Who is taking anything seriously here? The OP itself made it clear that it was not a serious opinion, so why are you making it look such?People like you who are ill-informed or just want to reply could be so annoying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "November 06, 2023, 10:54:39 AM",
      "body": "Almost all of them exploit emotion, as the popular topic Bitcoin and Me[1] continues to get attention and views. Therefore, creating such topics will make it easier for the individual to either obtain merit or donations (this is rarely the case). Therefore, as long as those who create these topics obtain merit, they will continue with them.I also believe that such topics are created by accounts that have armies of alternative accounts, as it is easy to create replies to such topics and difficult to delete them.[1] https://bitcointalk.org/index.php?topic=155054.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "November 06, 2023, 11:33:36 AM",
      "body": "You have a unique way of expressing your annoyance at the repeated pitiful stories in the Bitcoin discussion section, everyone agrees with you There are tons of such tired stories in the Bitcoin discussion section.Many members have written previous topics about this problem, but what is the solution? Since the forum is open to freedom of expression of opinion, no one can stop these people, whether they write in the Bitcoin discussion section or in any other section, so perhaps ignoring them and not giving them any merit is the only solution to reduce this widespread phenomenon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "November 06, 2023, 12:00:01 PM",
      "body": "Quote from: Majestic-milf on November 06, 2023, 08:15:15 AMQuote from: EarnOnVictor on November 06, 2023, 07:51:37 AMMake-up stories are baseless and I believe we share value on this forum, even the thought of it should have been resisted by you. Let the conscience judge anyone who cooked up stories and you may leave and laugh over the supposed such and go your way if you come across them.Frankly, you are not a perfect person, what if what you term \"make-up stories\" are the actual events? This is why what we can't be 100% convinced of, see or prove without a reasonable doubt shouldn't be labelled as we believe it. I understand that since we are not there with these people who create such threads, we are left with no option but to believe it, right? But what I think he is saying is there are some that are so obviously a lie that just looking at it will make you cringe, those are the ones he's saying should have a board so that way people who want to exaggerate things for which Bitcoin made them do, they can just go on the board. Sometimes how an op construct his story could make it sound like a fabricated story to the reader even when it's not, especially when it's related to the teaching of someone about bitcoin, selling/buying their first bitcoin or in this very case of selling a family land to buy bitcoin which sounds weird and hard to believe in spite of it been possible and a stupid thing to do. The problem with these stories is that the fakes stories are much more than the real ones which makes it hard for anyone to actually decipher which is real or fake and that's where the mix up is coming from.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "November 06, 2023, 12:33:23 PM",
      "body": "Quote from: yhiaali3 on November 06, 2023, 11:33:36 AMYou have a unique way of expressing your annoyance at the repeated pitiful stories in the Bitcoin discussion section, everyone agrees with you There are tons of such tired stories in the Bitcoin discussion section.Many members have written previous topics about this problem, but what is the solution? Since the forum is open to freedom of expression of opinion, no one can stop these people, whether they write in the Bitcoin discussion section or in any other section, so perhaps ignoring them and not giving them any merit is the only solution to reduce this widespread phenomenon.These topics are getting support which is why they are always on top of the discussion, if you just ignore them and do not comment on them, they will lose their value and it will be buried.I don't support the creation of makeup stories board, people who are new to Cryptocurrency might think that people's stories about Cryptocurrency are just made up if we have a board like that, we already have an off-topic section to move posts that are proven to be made-up.And it's hard to prove the story is made up compared to the scam section where you need to upload your evidence to prove your case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 06, 2023, 12:34:55 PM",
      "body": "Quote from: Cantsay on November 06, 2023, 05:41:33 AMposts like that should fit well in off-topic boardI don't think so:Quote from: https://bitcointalk.org/index.php#4Other topics that might be of interest to bitcoiners.Playing devil's advocate here: what if made-up stories are part of someone's OPSEC?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "November 06, 2023, 01:45:29 PMLast edit: November 06, 2023, 01:58:44 PM by Majestic-milf",
      "body": "Quote from: EarnOnVictor on November 06, 2023, 10:52:38 AMWho is taking anything seriously here?  You are, obviously. QuoteFrankly, you are not a perfect person, what if what you term \"make-up stories\" are the actual events? This is why what we can't be 100% convinced of, see or prove without a reasonable doubt shouldn't be labelled as we believe it. Except this is how you sound when you are not serious, then my bad since I may have forced you to sound serious. Listen, since it's obvious I should explain what I wrote earlier to you.Quoteyou may leave and laugh over the supposed such and go your way if you come across them. I believe that over what I quoted, you were trying to suggest the best approach to such posts instead of what the Op did right(you are welcome to correct me if I'm thinking abstract). And this is me telling you that everyone is free to do whatsoever he wants since this is a free world and there's no restrictions to airing your views on here just as you are free to ignore what the op posted and you're becoming defensive. Hey! I'm not your problem, bruh. I just feel you need to take a chill pill and before you write down whatever thought you got in your head, first of all understand what is being written.QuotePeople like you who are ill-informed or just want to reply could be so annoying. It's easy to notice that which you have in you in someone else. But friendly advice? Remove the log in your eyes before you can focus on the mole in someone else's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suchmoon",
      "created_time": "November 06, 2023, 01:46:37 PM",
      "body": "I was worried for a minute that you're suggesting to create a special board for BADecker. This would devastate the P&S board.Anyway, no one cares about Bitcoin Discussion, it's not like this forum has anything to do with made-up internet money. It's a great place to pour all signature garbage into because any sane person has given up on reading it a long time ago and mods have given up on spending two seconds trying to determine if a post is \"low value\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "November 06, 2023, 03:31:52 PM",
      "body": "Quote from: ETFbitcoin on November 06, 2023, 10:08:01 AMNot serious response: I'd ask moderator to move such thread to off-topic, archival or trash can board.I do it regularly, but what I noticed is that the mods usually delete the topic if there are only a few posts in it, but if the topic develops into several pages, then it is more likely that only the topic lock will follow. In addition, not all mods have the same standard when it comes to \"low value topic\".Quote from: suchmoon on November 06, 2023, 01:46:37 PMI was worried for a minute that you're suggesting to create a special board for BADecker. This would devastate the P&S board.Anyway, no one cares about Bitcoin Discussion, it's not like this forum has anything to do with made-up internet money. It's a great place to pour all signature garbage into because any sane person has given up on reading it a long time ago and mods have given up on spending two seconds trying to determine if a post is \"low value\".That's your opinion, but I wouldn't agree with it. Mods are very responsive to reports from that board, the only problem is that most of the members engage in these pointless discussions because it is more important for them to write a post than to click on the \"report to moderator\" button. The latter has been pushed into the category of \"wasted time\" for too long that it has finally become a rule, at least judging by the number of monthly reports.Reward question - has anyone noticed where the members who serve the most stories like this are from?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}