{
  "id": "topic_5494249",
  "title": "EluguHcman",
  "author": "EluguHcman",
  "created_time": "April 25, 2024, 09:13:43 PM",
  "content": "Bitcoin can not afford to reprogram its potentials values of being a non-custodial currencies hence it is a technological development created by an initiative individual who is known to be Satoshi Nakamoto.It is a financial system initiated without any sector of the government contributing to the structure neither being slated with any form of authority role in the system of the digital financial system as Bitcoin.And on no account would the potentialities and nature of Bitcoin would be flexible to be reformed such as to be centralized in other to justify the mistrusts of the people who are in doubt of it with the facts that Satoshi Nakamoto has remained unknown and yet the digital currency is non-custodian.I made this expressions because just in, a neighbor is f man who has been in good terms in a while now with me  asked if I can recommend him to any way she can Invest, have her funds secured and as much make profits.So I recommended Bitcoin to her which she acknowledged that she knows a little about it but her fear is that it is not a centralized technology and for that she has always felt insecured on the development.You can imagine that she told me to give her my words that if anything happens to her funds if invested that I will have to refund her. 😏. That was silly and I felt mad at her.And right then I clearly told her that I am not trying to introduce her to any of the Ponzi schemes so it is her choice to decide but all I can tell you(her) lastly about this is that your funds will be secured as long you (she) would stick to the terms I have explained to her after explaining the Pros and the Cons to her.Dear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5494249",
  "comments": [
    {
      "author": "_act_",
      "created_time": "April 25, 2024, 09:22:00 PM",
      "body": "Quote from: EluguHcman on April 25, 2024, 09:13:43 PMDear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.If and only if she accepts that if she gains, I will take all the profit.It can even be 50:50. I mean if she lose, I will give her 50% of her loss back but if she make profit she will give me 50% of her profit.But what I have told people that say something like this is that they should not invest if they can not take the risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "April 25, 2024, 09:28:01 PM",
      "body": "Then you move on. The person is not ready Who would invest and not be ready to face the risk of losses. You don't have to force her, let her see by herself what she missed when everything starts shooting. There's nothing in this life that don't have risk of failing even government bonds. To me she's not ready to go into investment and should focus on relatively stable income like salary. But if you really want to help her out You can assure her and set aside fund in case of a dip so you can pay her capital back and take it as a form of accumulation. Done it before and fortunately didn't regret it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kristiyana",
      "created_time": "April 25, 2024, 09:34:52 PM",
      "body": "Quote from: _act_ on April 25, 2024, 09:22:00 PMQuote from: EluguHcman on April 25, 2024, 09:13:43 PMDear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.If and only if she accepts that if she gains, I will take all the profit.It can even be 50:50. I mean if she lose, I will give her 50% of her loss back but if she make profit she will give me 50% of her profit.But what I have told people that say something like this is that they should not invest if they can not take the risk.First you're suppose to tell her the risk that is involve,that is why she need to have the full knowledge of investment before looking out to any other thing, I guess she don't have any idea about investment  that is why she's being scared of losing her money, i think if she's not ready to take the risky I will advice you just let her be.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zaguru12",
      "created_time": "April 25, 2024, 09:35:47 PM",
      "body": "Quote from: EluguHcman on April 25, 2024, 09:13:43 PMDear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.It depends on the kind of request, bitcoin is volatile so if she wants to invest but doesn’t want to take the risk that it will fall and she would have to wait patiently for it make profits then she should rather stick to her other currency that she can see. As for the safety I think it is a two way something, if she is scared of been her own bank then you can possibly tell her that there are centralized exchanges that holds your keys and also the great risk attached to it. If she doesn’t wants that which is a better option then you tell her straight up that bitcoin is a freedom from centralization or banking policies and if she isn’t willing to take that risk then the bitcoin space isn’t for her instead. Taking the risk of even keeping the funds for her is a risk I wouldn’t take for anyone. Bitcoin brings individual freedom to financial savings of you’re not ready then it’s better to stay away from it",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "April 25, 2024, 09:41:46 PM",
      "body": "Quote from: EluguHcman on April 25, 2024, 09:13:43 PMDear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.Don't introduce anybody to invest in Bitcoin or any other business without informing them about the risk involved. You don't also give anybody a guarantee that their funds are safe and it will also yield profit. Recently there have been cases of government attacking decentralization including wallets. Nobody knows the next wallet that might be seized by the government. We cannot also erase the fact that scammers and hackers are still on a rampage in the crypto industry. There is also no certainty that she would make a profit from her investment because Bitcoin price is unpredictable. She sounded as if she was doing you a favor or her Investment will also benefit you financially. If I were in your shoes, she would get no assurance from me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelvinid",
      "created_time": "April 25, 2024, 09:44:38 PM",
      "body": "Quote from: EluguHcman on April 25, 2024, 09:13:43 PMYou can imagine that she told me to give her my words that if anything happens to her funds if invested that I will have to refund her. 😏. That was silly and I felt mad at her.And right then I clearly told her that I am not trying to introduce her to any of the Ponzi schemes so it is her choice to decide but all I can tell you(her) lastly about this is that your funds will be secured as long you (she) would stick to the terms I have explained to her after explaining the Pros and the Cons to her.This is difficult when you are trying to convince people to buy but they don't have any idea what is all about. This will be going to happen when you talk to someone whose doubts are in their mind already and make them think you are a scammer because what they think about Bitcoin is a scam investment. If I were you, I wouldn't sacrifice myself and time to make them understand because close-minded people never learn fast. QuoteDear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.Don't make a deal with these people, they will blame you in the end and (might) ruin your reputation especially when they lose and tell everyone that you are a scammer and a liar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stadus",
      "created_time": "April 25, 2024, 09:45:44 PM",
      "body": "Quote from: _act_ on April 25, 2024, 09:22:00 PMQuote from: EluguHcman on April 25, 2024, 09:13:43 PMDear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.If and only if she accepts that if she gains, I will take all the profit.It can even be 50:50. I mean if she lose, I will give her 50% of her loss back but if she make profit she will give me 50% of her profit.But what I have told people that say something like this is that they should not invest if they can not take the risk.However, having said that you must refund her if ever her investment turns into at loss, then most likely she is not really confident on the investment she is taking, and that will definitely put yourself being compromised.  For me, it’s better to tell her not to invest unless she is ready and is responsible of her own investment, than to risk her funds and at the end of the day, it’s your funds that will get compromised.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "April 25, 2024, 09:49:18 PM",
      "body": "The only way I can take such thing is when I also take part in the profits when it comes, because some of this newbies investors need to be thought some lessons that profits making in any investment is also subject to some level of risk and for that, whatever you do or invest in have it own risk, most times, what affects those people is their lack of understanding of bitcoin and how volitility works in most mainstream investment.Some of them have the mentality that bitcoin is scam, others believe bitcoin to be a means to get rich quick, but both are wrong and can lead to more frustrating turn out of events which me can not afford the be part of that is why I always turn newbies down when they approach me with such questions of investing in bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maslate",
      "created_time": "April 25, 2024, 09:58:14 PM",
      "body": "To be honest, I will not let her invest if she thinks she’s not ready to take her own risk. Otherwise, that would create a hassle on my part thinking about it and I wouldn’t really want it to happen. However, claiming her profits as well if ever she made profits will also challenge her to be good and responsible of her own investment, so most probably that kind of  strategy will also help her to motivate her to invest at her own risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sandra_hakeem",
      "created_time": "April 25, 2024, 09:59:57 PM",
      "body": "There are certain ways to introduce people into a different investment plan. The first step would be intense tutoring on the subject/course of investment.. secondly, I'll try as much as i can to layout the risk of getting involved - including any awful experiences I had during the course of starting my cryptographical journey.It's dawn on you to decide if you'd wanna follow my path/route or not. I'll also make everything explicit enough, should there be any exegencies on your HODL journey (assuming that's what you needed the mentorship for)Edit: What you just described above tells how less interested the person in question is - Maybe they thought they'll just begin to make profit out of a blue",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "April 25, 2024, 10:01:15 PM",
      "body": "Quote from: EluguHcman on April 25, 2024, 09:13:43 PMYou can imagine that she told me to give her my words that if anything happens to her funds if invested that I will have to refund her. 😏. That was silly and I felt mad at her.And right then I clearly told her that I am not trying to introduce her to any of the Ponzi schemes so it is her choice to decide but all I can tell you(her) lastly about this is that your funds will be secured as long you (she) would stick to the terms I have explained to her after explaining the Pros and the Cons to her.Accepting to receive the blame if someone's investment does not go as planned is not a good responsibility to carry. You are introducing an opportunity to someone, and it should be the person's responsibility to go and research and find out if the opportunity you are introducing to them is one that is good for them. Regardless of the relationship you have with someone it is advisable to advise them never to make investment decisions based on only recommendations without conducting their own research first. Introducing someone to an opportunity and then carrying the responsibility of taking blame if it goes bad is too much. It is better you do not introduce anyone to any opportunity",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "April 25, 2024, 10:14:56 PM",
      "body": "Your neighbor is scared and that is understandable. The decision on whether to go ahead and invest in Bitcoin is updated to her. Every investment carries a risk and no one should invest in any thing which they do not have proper education and understanding on. I think that it is clear that  your neighbor does not have the beginner's level knowledge on  Bitcoin and so the reason for her response. I don't investing in Bitcoin should come later after she has read the resources which I believe you would provide her to know more about Bitcoin.She is about to make a rookie mistake and blame it on you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "btc78",
      "created_time": "April 25, 2024, 10:17:13 PM",
      "body": "Quote from: EluguHcman on April 25, 2024, 09:13:43 PMI made this expressions because just in, a neighbor is f man who has been in good terms in a while now with me  asked if I can recommend him to any way she can Invest, have her funds secured and as much make profits.So I recommended Bitcoin to her which she acknowledged that she knows a little about it but her fear is that it is not a centralized technology and for that she has always felt insecured on the development.You could have just gave some vague advices instead of straight up recommending bitcoinQuoteYou can imagine that she told me to give her my words that if anything happens to her funds if invested that I will have to refund her. It would make sense that she would find someone or something to blame when things go wrong a lot of people do not want to own up to their responsibilities and always need a constant reminder of what they can hold on to.So if people like this encounter bitcoin they feel surprised and rattled because there is no “higher ups” to blame everything wrong or complain about something to",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GbitG",
      "created_time": "April 25, 2024, 10:25:31 PM",
      "body": "Quote from: EluguHcman on April 25, 2024, 09:13:43 PM...Dear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.Hmm, that's creepy!If she loses his fund, indeed she will blame you, and you have to catch up with the financial abuser. So, dear friend you don't need to share your thoughts regarding the Bitcoin investment with someone who doesn't have any ideas about it. Because you know that everyone here has made a decision of their own choice, whatever they lose or don't. Bitcoin is a highly volatile thing. While people are not familiar with it, it is not wise to encourage them to invest in Bitcoin blah blah.  So in my opinion firstly you shouldn't  tell about Bitcoin who doesn't even understand the investment concept. Second, if he understands, tell him to make a decision of his own choice so that the blame does not fall on you. For this, in addition to strong enough incentives for privacy stances, it became impossible to exchange trust or wallet if there was weak privacy, and there would be a loss. The rest of the loss is his, and the profit is also his.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "April 25, 2024, 11:10:39 PMLast edit: May 02, 2024, 10:25:10 PM by South Park",
      "body": "Quote from: EluguHcman on April 25, 2024, 09:13:43 PMsnipI made this expressions because just in, a neighbor is f man who has been in good terms in a while now with me  asked if I can recommend him to any way she can Invest, have her funds secured and as much make profits.So I recommended Bitcoin to her which she acknowledged that she knows a little about it but her fear is that it is not a centralized technology and for that she has always felt insecured on the development.You can imagine that she told me to give her my words that if anything happens to her funds if invested that I will have to refund her. 😏. That was silly and I felt mad at her.And right then I clearly told her that I am not trying to introduce her to any of the Ponzi schemes so it is her choice to decide but all I can tell you(her) lastly about this is that your funds will be secured as long you (she) would stick to the terms I have explained to her after explaining the Pros and the Cons to her.Dear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.It is because of this that I do not give any financial advice to anyone on my real life, since those people just want the best of both worlds, they want to invest in an asset and make incredible profits, while in the case they were to lose they want someone else to shoulder their losses, which is in a way what the rich already do by privatizing the profits and socializing the losses, and even if you have made your posture clear, I can assure you that once she losses her money, a very likely scenario in my mind, she will come to you to try to collect what she thinks you owe her.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 25, 2024, 11:11:21 PM",
      "body": "Well thats self explanatory I guess. If someone you teach and out of your reach did invested in spite of the risk and precaurious and warnings then he is rhe one to blame alone. Yes bitcoin is a good for storing speculative asset but still its heavy volatile most of the time so if he/she arent emotionally intact then its not gonna end up panicking and selling his shares at the time bitcoin is doing a crazy dump.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "April 25, 2024, 11:32:24 PM",
      "body": "Quote from: EluguHcman on April 25, 2024, 09:13:43 PM~You can imagine that she told me to give her my words that if anything happens to her funds if invested that I will have to refund her. 😏. That was silly and I felt mad at her.And right then I clearly told her that I am not trying to introduce her to any of the Ponzi schemes so it is her choice to decide but all I can tell you(her) lastly about this is that your funds will be secured as long you (she) would stick to the terms I have explained to her after explaining the Pros and the Cons to her.Dear fellas, please I needed to know how you would feel if you were in my position basically where she said I would refund her if her funds gets lost becasue you recommended and introduced her to the system.What a crazy woman he is. Sorry for the word but she doesn't know the term \"risk\". She doesn't know that every investment has a risk and because of that, you need to teach her the risks of investing into crypto. It's good that you didn't agree to what she wants, and I mean even I will not agree into it. It's her funds, and if something bad happens, you will refund the losses while if you get profit, she will be the one who will get it? What an absurd proposal it is TBH. Just tell her the pros and cons to her, and if she wants your help in investing then tell her that you will not refund those losses.You know what, just let her decide which asset she wants to invest her money with.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "passwordnow",
      "created_time": "April 25, 2024, 11:39:23 PM",
      "body": "That's silly, these people don't really want to take risk so don't invest at all. I've got that experience before and I just ignored that person until today because if they're asking for a safe investment, there's actually have some and those are the bonds offered by the governments and the banks as well but don't expect a lot of return from there. But if they're okay with the risk that Bitcoin is going to give them then they'd be happy to take the risk and the profit will also be appreciated by them because it is them that has taken the risk. This is the reason why I am avoiding these people because if they can't do better for themselves and take the risk on their own, they are no good in investments and they'd stay wherever they are with that kind of thinking. Also, if they want this kind of risk free taking, they should have contacted the brokers and financial managers but they'd tell them that there's always a risk on it and there's no refund upon incurring losses. That's how brutal the investing industry is and if they're not willing to lose, avoid any investment vehicle but it's scary that they might end up with the scam schemes that guarantees them money and tells them that they're risk free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "April 25, 2024, 11:53:29 PM",
      "body": "I wouldn't actively say that she needs to invest, but rather direct her into resources which will convince her on her own. If I will take the fall on her inability to handle her assets, I should also take some gains when she makes it through just so we are even on the risks that is supposed to be shouldered by her. Imagine introducing a possible money maker to someone and they still want to get everything thinking that's how it works. These people don't deserve to get rich honestly, as they don't understand the risks and rewards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}