{
  "id": "topic_5462804",
  "title": "alastantiger",
  "author": "alastantiger",
  "created_time": "August 10, 2023, 04:14:08 PM",
  "content": "In on of Hal Finney's post on the forum, he mentioned that he was working on something using the security features of modern processors, designed to support \"Trusted Computing\", to harden Bitcoin wallets. I was wondering if anyone here knows about this project and if he released it and the documentation before he passed on?Thank you",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462804",
  "comments": [
    {
      "author": "Dunamisx",
      "created_time": "August 10, 2023, 04:47:40 PM",
      "body": "Anything possibly released by Hal would have been part of the protocols we observed today on the bitcoin network  or probably part of the BIPs implementations that was introduced, nothing new aside these that has to go with a newly developed technology without conformity with the blockchain technology, maybe going ore deep on his threads could give more light on that, because it's what i know that without Hal, bitcoin history is never completed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "August 10, 2023, 11:00:13 PM",
      "body": "Hal Finney not only a first receiver from a Bitcoin peer-to-peer transaction and he received it from the Bitcoin founder, Satoshi Nakamoto.He made contributions for Bitcoin developments in early years but his disease became worse and he was more seriously paralyzed gradually. It limited his body physical movememts and he struggled to use computer in late of his life before his death.I don't know he actually completed his last project and released it but it is not important. With his contributions for Bitcoin development, he is already a legend and will never be forgotten by Bitcoin community.[History]Hal Finney - Man Who made a huge contribution to the development of BTC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "August 10, 2023, 11:29:07 PM",
      "body": "I don't think it was implemented outright but trusted computing is a thing now, so I think his legacy lived on in spirits. Plus he's a key figure in the cryptocurrency world we're living in today, hard to think that he's not going to cause major impact at least in the younger minds that came upon his post. Most processors right now implement some form of Trusted Computing module or protocol which users can toggle on and off, I'm not really sure if this is usable for the cryptocurrency industry but with the little I have read of it, it's looking promising. In one way or another Hal's dream of bitcoin becoming a massive financial phenomena that changes the lives of millions of people became true. He's a legend and I hope he's in a better place now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ranochigo",
      "created_time": "August 11, 2023, 03:59:09 PM",
      "body": "I presume he is talking about Conclave, Mike Hearn did finish the project and published it subsequently. Albeit years after his passing, but I presume that he continued and worked on the project afterwards. Here's the link to his Medium: https://r3mike.medium.com/a-deep-dive-into-conclave-1-0-415ad13ba465.Conclave was integrated into r3 at some point in time (not sure the extent of its integration currently) and it would be something for enterprise users instead of normal consumers: https://developer.r3.com/wp-content/uploads/2021/09/confidential-computing-with-conclave-web.pdf.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}