{
  "id": "topic_5418730",
  "title": "agentF",
  "author": "agentF",
  "created_time": "October 29, 2022, 12:08:05 PM",
  "content": "Hey All!I was wondering what's the cheapest and the most reliable swap service on the market right now.No KYC needed. As for wallet connect option, i know 1inch is the cheapest but i would like to get a service like changenow.io.Thanks.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418730",
  "comments": [
    {
      "author": "Mr. Magkaisa",
      "created_time": "October 29, 2022, 12:38:54 PM",
      "body": "Quote from: agentF on October 29, 2022, 12:08:05 PMHey All!I was wondering what's the cheapest and the most reliable swap service on the market right now.No KYC needed. As for wallet connect option, i know 1inch is the cheapest but i would like to get a service like changenow.io.Thanks.-  Not familiar with changenow.io but I can recommend some DEXs that I think are legitimate and I can also say that the charge that is taken from those who make transactions using their platforms such as Quickswap, Biswap is very small, sokuswap,and Apeswap.These I mentioned are ones that I have tried for a few months now and based on my experience I have not faced any problems using them.But it's still good to do your research to see if what I'm saying is true or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "agentF",
      "created_time": "October 29, 2022, 01:09:02 PM",
      "body": "Quote from: Mr. Magkaisa on October 29, 2022, 12:38:54 PMQuote from: agentF on October 29, 2022, 12:08:05 PMHey All!I was wondering what's the cheapest and the most reliable swap service on the market right now.No KYC needed. As for wallet connect option, i know 1inch is the cheapest but i would like to get a service like changenow.io.Thanks.-  Not familiar with changenow.io but I can recommend some DEXs that I think are legitimate and I can also say that the charge that is taken from those who make transactions using their platforms such as Quickswap, Biswap is very small, sokuswap,and Apeswap.These I mentioned are ones that I have tried for a few months now and based on my experience I have not faced any problems using them.But it's still good to do your research to see if what I'm saying is true or not.Yes, but i would like to get swaps without connecting metamask or other extension wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "October 29, 2022, 01:17:28 PM",
      "body": "A swap service like changenow has a high fee same with other swap service that offers instant swap. The closest swap service that I know that same with changenow is changely since it's the exchange for this kind of service. There regular website has no KYC but I can't guarantee the fee because I don't use this kind of service. Why not use DEX? The kind of exchange that you are looking for is a CEX which is much riskier than DEX.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 29, 2022, 03:05:23 PM",
      "body": "Quote from: agentF on October 29, 2022, 12:08:05 PMAs for wallet connect option, i know 1inch is the cheapest but i would like to get a service like changenow.io.Why not use DEX that have flexible KYC services, KuCoin offers both custodial and noncustodial services.They have good liquidity and I expect you will find everything there is in the decentralized platforms.It is the perfect solution unless you are looking for unpopular and unlisted coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sheenshane",
      "created_time": "October 29, 2022, 03:15:21 PM",
      "body": "Quote from: agentF on October 29, 2022, 12:08:05 PMNo KYC needed. A big list would be to find it on this thread.[BIG LIST] Buy/Sell Crypto (OTC, P2P, DEXs, CEXs, NO-KYC, ATMs, etc.)DEXs are always the best exchange in swap trading but I don't know about the fees, usually, most of them have huge fees.I think Localcoinswap might I recommend, but I want you to have your own research before diving into one of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "October 29, 2022, 03:54:53 PM",
      "body": "Quote from: agentF on October 29, 2022, 01:09:02 PMQuote from: Mr. Magkaisa on October 29, 2022, 12:38:54 PMQuote from: agentF on October 29, 2022, 12:08:05 PMHey All!I was wondering what's the cheapest and the most reliable swap service on the market right now.No KYC needed. As for wallet connect option, i know 1inch is the cheapest but i would like to get a service like changenow.io.Thanks.-  Not familiar with changenow.io but I can recommend some DEXs that I think are legitimate and I can also say that the charge that is taken from those who make transactions using their platforms such as Quickswap, Biswap is very small, sokuswap,and Apeswap.These I mentioned are ones that I have tried for a few months now and based on my experience I have not faced any problems using them.But it's still good to do your research to see if what I'm saying is true or not.Yes, but i would like to get swaps without connecting metamask or other extension wallet. Connecting your wallet is sort of required to make transaction. You can mention the kind of wallet you are using, maybe you need to import it to a hybrid project that has internal swapping protocol, Trust wallet for example has swap and exchange on it. This will not need KYC for sure.There are several hybrid wallets that has the same kind of functionality, Tokenpocket for instance.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "iv4n",
      "created_time": "October 29, 2022, 04:32:41 PM",
      "body": "I'm using https://cwallet.com/, I'm not sure if it's the cheapest, but it's sure easy to use, and we can use it for Telegram tipping (you can log in with Telegram, Twitter, and some other accounts), it's how I find about this (for me) useful tool! No KYC, or some other hidden requirements... I am using it for a while and didn't encounter a single problem or some special verification.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 30, 2022, 02:59:54 AM",
      "body": "I think Changehero, Swapspace, and Exolix might become your option since I read their fees are lower than Changenow and Changelly. For reminder I've never use those swaps, so you should do more research before using those sites. New sites will offer better fees, but the trustworthy and the popularity are completely different with the old one. What I know is Exolix ever launch a signature campaign in this forum and right now the account doesn't receive any negative feedback yet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "October 30, 2022, 02:56:53 PM",
      "body": "Are you just asking about swap exchanges is it just for eth blockchian or any swap in general. If it's all general Chain the I will recommend  Klayswap It's one of the cheapest I have used, and it's cheaper than other swap which I have used of recent, but wallet connect is required.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "October 31, 2022, 06:26:45 AM",
      "body": "Quote from: Nwada001 on October 30, 2022, 02:56:53 PMAre you just asking about swap exchanges is it just for eth blockchian or any swap in general. If it's all general Chain the I will recommend  Klayswap It's one of the cheapest I have used, and it's cheaper than other swap which I have used of recent, but wallet connect is required. The @OP already wrote this two times if he's want to get a Swap service without need to connect his wallet, I don't know why you're recommend a swap platform with a requirement to connect his wallet.Quote from: agentF on October 29, 2022, 01:09:02 PMYes, but i would like to get swaps without connecting metamask or other extension wallet. Just to be clear he's search:- Swap platform- The fees is very cheap- Without need to connect his walletI already gave a suggestion for the @OP and it's qualify for his interest, the problem is just the reputation and the trustworthiness of the sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jaered",
      "created_time": "October 31, 2022, 07:22:38 AM",
      "body": "I think the way to go is Biswap and many dexes that have that same business model. I mean the cashback model whereby almost all or even all of your transaction fees are reimbursed. I heard Binance is charging zero fees. I don't know if it percolates down to the Binance Dex",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "livingfree",
      "created_time": "October 31, 2022, 10:21:34 AM",
      "body": "Quote from: Nwada001 on October 30, 2022, 02:56:53 PMAre you just asking about swap exchanges is it just for eth blockchian or any swap in general. If it's all general Chain the I will recommend  Klayswap It's one of the cheapest I have used, and it's cheaper than other swap which I have used of recent, but wallet connect is required. The same question because aside from common swaps made by dexes. There goes the swaps like following:fixedfloatxchangechangellychangenowsideshiftgodexThere are more in the list but those that I know where you can try. I haven't used all of them but only just a few of them, upon trying so, use them first with a small amount to test.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}