{
  "id": "topic_5454620",
  "title": "mvdheuvel1983",
  "author": "mvdheuvel1983",
  "created_time": "May 31, 2023, 11:17:51 AM",
  "content": "This is an excerpt from the bitcoin white paper about bitcoin network and by extension mining written by the renowned founder Satoshi Nakamoto.Quote5. NetworkThe steps to run the network are as follows:1) New transactions are broadcast to all nodes.2) Each node collects new transactions into a block.3) Each node works on finding a difficult proof-of-work for its block.4) When a node finds a proof-of-work, it broadcasts the block to all nodes.5) Nodes accept the block only if all transactions in it are valid and not already spent.6) Nodes express their acceptance of the block by working on creating the next block in thechain, using the hash of the accepted block as the previous hash.This is just straightforward question, can a miner decide which transaction to accept into a block and which to reject? And is there any consequence for rejecting a transaction? If this were possible what happens to the rejected transactions?https://www.bitcoin.com/bitcoin.pdf",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454620",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "May 31, 2023, 11:29:43 AM",
      "body": "1) Yes they can decide.2) No consequence at all, except they don't get the fee for that transaction3) It stays in the mempool and some other miner will mine it.There are some minor exceptions to all of this. Such as if someone sends a CPFP transaction the miner must include the parent. But for the most part miners can pick and choose what transactions they put in. And for the most part they pick the ones with the highest fees of sat / VBSome pools like VIABTC have a PAID service where they will put in a low fee transaction, and others have shown they will flat out reject some transactions that have violate OFAC (but I think they all started ignoring that anyway)But for the most part miners make blocks how they want.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "philipma1957",
      "created_time": "May 31, 2023, 12:56:32 PM",
      "body": "Quote from: mvdheuvel1983 on May 31, 2023, 11:17:51 AMThis is an excerpt from the bitcoin white paper about bitcoin network and by extension mining written by the renowned founder Satoshi Nakamoto.Quote5. NetworkThe steps to run the network are as follows:1) New transactions are broadcast to all nodes.2) Each node collects new transactions into a block.3) Each node works on finding a difficult proof-of-work for its block.4) When a node finds a proof-of-work, it broadcasts the block to all nodes.5) Nodes accept the block only if all transactions in it are valid and not already spent.6) Nodes express their acceptance of the block by working on creating the next block in thechain, using the hash of the accepted block as the previous hash.This is just straightforward question, can a miner decide which transaction to accept into a block and which to reject? And is there any consequence for rejecting a transaction? If this were possible what happens to the rejected transactions?https://www.bitcoin.com/bitcoin.pdfYes which means the top pools could reject all tx under 50 sats a byteThus forcing all tx to cost a shit ton of btc.if the top five pools choose to act like Opec would do with oil prices you would be paying high tx fees all the time.As a miner if this list is accuratehttps://www.blockchain.com/explorerFoundry USA--------31.613%AntPool--------------20.000%F2Pool---------------15.484%Binance Pool--------  8.548%ViaBTC--------------  7.903%the top pools make over 83% of the blocksAs of 12noon today they could all reject any tx under 50 sats a bytethis would result in tx fees going up biglyand as a miner I would not switch from them as I would be earning more money and moving to the lessor pools would mean lower fees and slow block earning as 17% of the hash is not very many blocks.The only thing that could help would be very robust LN network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "May 31, 2023, 10:05:10 PM",
      "body": "Quote from: mvdheuvel1983 on May 31, 2023, 11:17:51 AM~If this were possible what happens to the rejected transactions?Absolutely! It is indeed possible. Should your transaction face rejection from one mining pool for any reason, it will probably be accepted by another pool. The key factor here is that your transaction fee meets the network's requirements.Typically, miners prioritize transactions with higher fees, filling up blocks until they're full. This process continues until the block is successfully mined. Then, begins the selection process for a new block, repeating in a cyclical fashion as long as there are pending transactions. So, as long as you set an appropriate transaction fee and are patient enough, there is a good chance your transaction will eventually be accepted by a mining pool and processed on the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "June 01, 2023, 06:09:06 PM",
      "body": "Quote from: philipma1957 on May 31, 2023, 12:56:32 PMYes which means the top pools could reject all tx under 50 sats a byteThus forcing all tx to cost a shit ton of btc.if the top five pools choose to act like Opec would do with oil prices you would be paying high tx fees all the time.As a miner if this list is accuratehttps://www.blockchain.com/explorerFoundry USA--------31.613%AntPool--------------20.000%F2Pool---------------15.484%Binance Pool--------  8.548%ViaBTC--------------  7.903%the top pools make over 83% of the blocksAs of 12noon today they could all reject any tx under 50 sats a bytethis would result in tx fees going up biglyand as a miner I would not switch from them as I would be earning more money and moving to the lessor pools would mean lower fees and slow block earning as 17% of the hash is not very many blocks.The only thing that could help would be very robust LN network.I liked your comparison with OPEC. But everyone needs oil, there are no analogues to it, and bitcoin has alternatives. If the fees are high, then there will be fewer users, and the pools will be forced to reduce the requirements for fees or mine incomplete blocks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "June 01, 2023, 08:24:10 PM",
      "body": "Quote from: mvdheuvel1983 on May 31, 2023, 11:17:51 AMThis is just straightforward question, can a miner decide which transaction to accept into a block and which to reject? And is there any consequence for rejecting a transaction? If this were possible what happens to the rejected transactions?The straightforward answer to your question is \"Yes,\" because a miner has the power of decision in such situations. It's the miner's choice to add a transaction into the next block, and they can reject the transactions with low fees without any restrictions. The network won't penalize those miners who reject those transactions with very low fees and even if transactions are with high fees the miners can still reject those without any issues. Even in this case the network won't punish the miners for not including high fee transactions. However, in this case they will lose those higher fees which isn't a good practice for a miner.Those transactions that are rejected by one miner can be accepted by another miner. All it needs is the consent of the next miner to add it into the next block, and the transaction will get confirmed without any issues. If the set fee is very low then I don't think that any miner would like to include those transactions into the next block.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "June 02, 2023, 08:42:53 PM",
      "body": "Quote from: SamReomo on June 01, 2023, 08:24:10 PMQuote from: mvdheuvel1983 on May 31, 2023, 11:17:51 AMThis is just straightforward question, can a miner decide which transaction to accept into a block and which to reject? And is there any consequence for rejecting a transaction? If this were possible what happens to the rejected transactions?The straightforward answer to your question is \"Yes,\" because a miner has the power of decision in such situations. It's the miner's choice to add a transaction into the next block, and they can reject the transactions with low fees without any restrictions. The network won't penalize those miners who reject those transactions with very low fees and even if transactions are with high fees the miners can still reject those without any issues. Even in this case the network won't punish the miners for not including high fee transactions. However, in this case they will lose those higher fees which isn't a good practice for a miner.Those transactions that are rejected by one miner can be accepted by another miner. All it needs is the consent of the next miner to add it into the next block, and the transaction will get confirmed without any issues. If the set fee is very low then I don't think that any miner would like to include those transactions into the next block.Only large mining pools have a policy on transactions. Unknown miners rarely mine blocks, so they will by default take the transactions with the highest fees. Even if they have restrictions, they will not affect anything due to the small number of blocks mined.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "June 03, 2023, 02:45:14 PM",
      "body": "Yes it is. Miners can reject transactions if they wish. From look of things, they accept high fee transactions more than lower fee transactions and when miners reject transaction that transaction would automatically come back the sender's wallet. I don't think there is any consequences of rejected transaction because the rejected transaction would come back your wallet.  But the only consequence which I could remember is the delay of confirmation. If a miner rejects a transaction to the next block, it will take some time before another miner will see and add it to his block so there will be delay on movement.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "safar1980",
      "created_time": "June 03, 2023, 07:48:17 PM",
      "body": "Quote from: Mate2237 on June 03, 2023, 02:45:14 PMYes it is. Miners can reject transactions if they wish. From look of things, they accept high fee transactions more than lower fee transactions and when miners reject transaction that transaction would automatically come back the sender's wallet. I don't think there is any consequences of rejected transaction because the rejected transaction would come back your wallet.  But the only consequence which I could remember is the delay of confirmation. If a miner rejects a transaction to the next block, it will take some time before another miner will see and add it to his block so there will be delay on movement. Miners cannot reject transactions, transactions are managed by the administration of 5 large bitcoin mining pools.I don't remember pools asking miners about this.But the sender has the opportunity to increase the commission so that the miners add it to their block faster.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}