{
  "id": "topic_5470505",
  "title": "libert19",
  "author": "libert19",
  "created_time": "October 16, 2023, 08:19:49 AM",
  "content": "Source: X I'll be finally be excited for Olympics due to cricket inclusion, lol. What about you?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470505",
  "comments": [
    {
      "author": "Yogee",
      "created_time": "October 16, 2023, 08:53:23 AM",
      "body": "Baseball-Softball and Cricket deserves to be permanent games in all future Olympics in my opinion. They may not be that popular in most EU countries but already have significant following in other parts of the world.I'm familiar with Lacrosse and Squash but not Flag Football. The FF looks like the European Rugby with an American touch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jating",
      "created_time": "October 16, 2023, 09:03:24 AM",
      "body": "Just a small correction though, this new sports are included in the Summer Olympics.Yeah, very excited to see Cricket to be included, and I would say that and it's very popular in some regions of the world and others say it's the second most popular sports in the world. And probably good chances for nation that excel in this sports.And maybe those other countries as well are going to focus on this new sports, putting up good programs so that they also compete at high level, increasing their chances to have a gold medal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sithara007",
      "created_time": "October 18, 2023, 07:03:18 AM",
      "body": "Quote from: Yogee on October 16, 2023, 08:53:23 AMBaseball-Softball and Cricket deserves to be permanent games in all future Olympics in my opinion. They may not be that popular in most EU countries but already have significant following in other parts of the world.I'm familiar with Lacrosse and Squash but not Flag Football. The FF looks like the European Rugby with an American touch.Both Baseball-Softball and Cricket were included for the recently concluded Asian Games (hosted by China). Apart from Asian Games, cricket is also a regular feature for Commonwealth Games, African Games and EAP Games. The only issue with these two sports is that the geographic spread is not that great. Cricket is popular only in 10-12 countries, while baseball's case is not that better either. But I am sure that the inclusion of these two sports can bring a lot more viewership and revenue to the International Olympic Committee (IOC).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vennali",
      "created_time": "October 18, 2023, 07:12:28 AM",
      "body": "I have no idea about flag football, but I am aware of the rest and they have been a sport for a very long time and I'm glad that they included it into Olympics. Cricket, Squash and Baseball were recently played at the Asian games as well and I'm sure that had some part to play to get into the olympic games as it gives some idea on how to manage those games and coordinate with concerning sports bodies in a big tournament.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kelward",
      "created_time": "October 18, 2023, 07:53:06 AM",
      "body": "Quote from: vennali on October 18, 2023, 07:12:28 AMI have no idea about flag football, but I am aware of the rest and they have been a sport for a very long time and I'm glad that they included it into Olympics. Cricket, Squash and Baseball were recently played at the Asian games as well and I'm sure that had some part to play to get into the olympic games as it gives some idea on how to manage those games and coordinate with concerning sports bodies in a big tournament. Just like you I'm hearing about this flag football for the very first time, and I'm wondering how it's being played. This inclusions are very good, they'll really help to bring to limelight some sports that are not popular. Although I'm quit surprised that sports like baseball and cricket were not in the Olympics, because they have strong leagues and are popular sports. I believe that there many interesting sports out there that are yet to be recognized in the Olympics, hopefully as the organizers of such sports keeps pushing for them to be recognized sports, the Olympics can capture and add them to give more options to the viewers. The Olympics is the biggest sports event in the world today and the organizers need to add every interesting sports to be a part of it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "October 18, 2023, 08:09:17 AM",
      "body": "Having more games in the Olympic Games will make the competition more interesting and competitive. It will also give nations greater opportunity to participate and win medals. Some countries that have never won any medal in the competition will now have greater chances to win if flag football, baseball/softball, squash, and cricket are popular sports in the country. I was surprised that games like baseball, squash, and cricket were not included in past Olympics because they are all very popular games. Flag football is an emerging sport in my country but the others are widely played.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}