{
  "id": "topic_5401599",
  "title": "Davidvictorson",
  "author": "Davidvictorson",
  "created_time": "June 06, 2022, 07:31:24 PM",
  "content": "Just as there are crypto trading bots, there are also gambling bots. According to  Wikipedia, Gambling bots are software which use a gambling website's Application programming interface (API) to speed up the process of placing bets based upon a gambling system or betting strategy to decide which bets to place. In short, they are AI powered bots that do the betting for you. Aside form the risk of having your casino account closed, these bots are not ideal for all types of games. There are several reasons people give for using bots. From making betting easier, being able to use multiple bots at once, to being highly able to accurate predictions about a game’s outcome that could in turn increase the individual's chances of wining. Have you ever tried to use the autobet on some gambling websites or have you successfully used third-party bot scripts for betting on sites where it is allowed? Did the bots win?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5401599",
  "comments": [
    {
      "author": "Doell",
      "created_time": "June 06, 2022, 08:48:11 PM",
      "body": "Quote from: Davidvictorson on June 06, 2022, 07:31:24 PMHave you ever tried to use the autobet on some gambling websites or have you successfully used third-party bot scripts for betting on sites where it is allowed? Did the bots win? Maybe almost everyone has used autobet or bots if active in dice gambling, to be honest I've also used a autobet but unfortunately it doesn't work as well as other gamblers, (sometimes) between winning in the short term works more for me than in the long term. You must be to big a money to start, may can be get passive profit but remember still beating the house is not easy.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "June 06, 2022, 08:49:19 PM",
      "body": "I’ve used auto bet before and I can say that it’s not that profitable since it doesn’t change the whole concept of gambling its just that you are betting faster and this actually can consume all your capital in an instant. Gambling bots doesn’t give any guarantee with your profit, it will still depend on your luck and remember bots are also the system of the house which technically, it will still in favor to them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Quidat",
      "created_time": "June 06, 2022, 08:55:22 PM",
      "body": "Quote from: Davidvictorson on June 06, 2022, 07:31:24 PMHave you ever tried to use the autobet on some gambling websites or have you successfully used third-party bot scripts for betting on sites where it is allowed? Did the bots win? Yep, i have tested several bots but as expected none of them do works on long term or running it on a long period of time because we do have that primary rule or reality about gambling  is that house do always win in the endwhich is something a reality that we cant really avoid off. Lets take for example on several site which do even let you put up some bots and some of them do have pre-setup bots which you can make use for automation.Gambling/Site owners are fully aware that there's no chance on ripping off profits or milking the site with the use of these thing yet it had been proven out that none of them can beat up the system no matterhow good the bot is and it would still stay on automation of bets and not a money milking machine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zilon",
      "created_time": "June 06, 2022, 09:09:19 PM",
      "body": "Ai are smart APIs but there are not as smart has human thinking and predictions since they are mere bots programmed for a specific outcome. I tried it once and got even worst than an average brain could predict. The only difference with the human brain is it's processing speed else there is no winning guaranteed in bots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Boristhecat",
      "created_time": "June 06, 2022, 09:10:31 PM",
      "body": "Quote from: Davidvictorson on June 06, 2022, 07:31:24 PMJust as there are crypto trading bots, there are also gambling bots. According to  Wikipedia, Gambling bots are software which use a gambling website's Application programming interface (API) to speed up the process of placing bets based upon a gambling system or betting strategy to decide which bets to place. In short, they are AI powered bots that do the betting for you. Aside form the risk of having your casino account closed, these bots are not ideal for all types of games. There are several reasons people give for using bots. From making betting easier, being able to use multiple bots at once, to being highly able to accurate predictions about a game’s outcome that could in turn increase the individual's chances of wining. Have you ever tried to use the autobet on some gambling websites or have you successfully used third-party bot scripts for betting on sites where it is allowed? Did the bots win? I am sure that the casino always wins whether you use a bot or not. And I've never used them (other than auto-betting in dice).Their only real use is in betting where arbitrage opportunities sometimes arise. Given that the bot can analyze a huge number of bets very quickly and place bets on several markets at once, it can be profitable. But I have not seen such bots in the public domain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "June 06, 2022, 09:17:53 PM",
      "body": "I don't think a bot will get you a win overall on most websites. I've seen some be used to rank up accounts, increase rewards (more efficiently than a human might) and to implement different strategies. I think the strategies argument will lose all the time unless it's a strategy game (such as poker - but the house will still have its edge too).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "June 06, 2022, 09:37:27 PM",
      "body": "Quote from: Doell on June 06, 2022, 08:48:11 PMQuote from: Davidvictorson on June 06, 2022, 07:31:24 PMHave you ever tried to use the autobet on some gambling websites or have you successfully used third-party bot scripts for betting on sites where it is allowed? Did the bots win? Maybe almost everyone has used autobet or bots if active in dice gambling, to be honest I've also used a autobet but unfortunately it doesn't work as well as other gamblers, (sometimes) between winning in the short term works more for me than in the long term. You must be to big a money to start, may can be get passive profit but remember still beating the house is not easy.It doesn't work for me either even if you calculate 15 successive losses, the house edge will always play, I only do auto bet when I can monitor it and keep my eyes on my bet so I can make the necessary adjustment in case the roll is not favoring me, I have never won in an auto bet when I let it by itself, I'm better off playing manually than using a bot, there's no exact calculation that can beat the house when using a bot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TimeTeller",
      "created_time": "June 06, 2022, 09:49:19 PM",
      "body": "Quote from: robelneo on June 06, 2022, 09:37:27 PMQuote from: Doell on June 06, 2022, 08:48:11 PMQuote from: Davidvictorson on June 06, 2022, 07:31:24 PMHave you ever tried to use the autobet on some gambling websites or have you successfully used third-party bot scripts for betting on sites where it is allowed? Did the bots win? Maybe almost everyone has used autobet or bots if active in dice gambling, to be honest I've also used a autobet but unfortunately it doesn't work as well as other gamblers, (sometimes) between winning in the short term works more for me than in the long term. You must be to big a money to start, may can be get passive profit but remember still beating the house is not easy.It doesn't work for me either even if you calculate 15 successive losses, the house edge will always play, I only do auto bet when I can monitor it and keep my eyes on my bet so I can make the necessary adjustment in case the roll is not favoring me, I have never won in an auto bet when I let it by itself, I'm better off playing manually than using a bot, there's no exact calculation that can beat the house when using a bot.I have the same experience here, though I am using autobet if I have small bets. Just to increase the wagered amount if I am aiming for certain level.But if the amount is significant enough for me, I play manual.I have the experience using auto bet but not this bot.Is there really advantage of using bots in casinos? Can it really give you edge in your games?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "June 06, 2022, 09:54:29 PM",
      "body": "I only tried auto bet for a dice game with some configurations on the setting using arbitrage strategy, sometimes it works on my gambling sessions but only for a short time, of course, it only happens with a stop for reaching a certain profit but most of the time it fails especially if it runs longer. So, if ever I still want to continue my plays, I only do it every hour. I also tried to apply the strategy using manual betting on other games just for fun and exploring... I never use bots or scripts that others called it, maybe because I don't know how to use them or how to apply/insert them on the system. For me, the auto bet is enough for fast game results, win or lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "June 06, 2022, 10:21:28 PM",
      "body": "Gambling bots that predict scores can not do more than score predicting sites, the sites are existing, people are making use of the site and yet losing.  . Just have fun with the available time you have for bet and with low amount of money, rather than depending on prediction bots.I hope there will not be a day a bot that stake for you will not repeatedly use your money to bet until all your betting funds are lost. Be careful with staking bots.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "romero121",
      "created_time": "June 06, 2022, 10:29:41 PM",
      "body": "Quote from: crzy on June 06, 2022, 08:49:19 PMI’ve used auto bet before and I can say that it’s not that profitable since it doesn’t change the whole concept of gambling its just that you are betting faster and this actually can consume all your capital in an instant. Gambling bots doesn’t give any guarantee with your profit, it will still depend on your luck and remember bots are also the system of the house which technically, it will still in favor to them.Myself have used autobet, but this needs huge bankroll to play. Myself haven't experienced profit out of autobet, but there were more lucky users who have turned very small amount into huge through autobet. I've seen so many YouTube videos particularly those played on primedice used to be more popular. Following those videos I tried and I was able to turn $10 to $40 and I stopped there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "arallmuus",
      "created_time": "June 06, 2022, 10:37:01 PM",
      "body": "Quote from: jackg on June 06, 2022, 09:17:53 PMI think the strategies argument will lose all the time unless it's a strategy game (such as poker - but the house will still have its edge too). Kinda want to straighten this up. There is no house edge on poker, the house are getting profit from the rake / tournament buy-in fees. Its abit different from house edge because you are not playing against the house in poker but eventually its pretty much the same whatever you want to call itQuote from: Boristhecat on June 06, 2022, 09:10:31 PMGiven that the bot can analyze a huge number of bets very quickly and place bets on several markets at once, it can be profitable. But I have not seen such bots in the public domain.Most people that bets on arbitrage bets normally would place the bets manually by searching through odds comparison website. If bots that automatically place an arbitrage bets does exist, it will never be publicly shared as I dont see why people would share such a money making bot",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "June 06, 2022, 10:37:53 PM",
      "body": "Quote from: romero121 on June 06, 2022, 10:29:41 PMQuote from: crzy on June 06, 2022, 08:49:19 PMI’ve used auto bet before and I can say that it’s not that profitable since it doesn’t change the whole concept of gambling its just that you are betting faster and this actually can consume all your capital in an instant. Gambling bots doesn’t give any guarantee with your profit, it will still depend on your luck and remember bots are also the system of the house which technically, it will still in favor to them.Myself have used autobet, but this needs huge bankroll to play. Myself haven't experienced profit out of autobet, but there were more lucky users who have turned very small amount into huge through autobet. I've seen so many YouTube videos particularly those played on primedice used to be more popular. Following those videos I tried and I was able to turn $10 to $40 and I stopped there.You can only say things to be profitable if you do able to stop midway or into the situation on where you are profiting but we do all know that not all would really be having that kind of good control when it comes to theirgambling habits or activities on which if you do ever mindful on making profits then you would be testing it out even you are making money then you would really become greedy and this is where you do start on makingbigger base bet until you do find yourself on busting up yet your automation hadnt able to stop those losing streaks specially that very common martingale strat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "June 06, 2022, 10:49:11 PM",
      "body": "I used autobet before. I won in some days but still lost long term. I never used third party bots. I may not be knowledgeable how its algorithmn works and to how it could increase the probablity of winning but I'm well aware that the house always wins in the end. I don't see the logic of spending money on a bot and then lose my bets in  casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KennyR",
      "created_time": "June 06, 2022, 10:56:23 PM",
      "body": "Quote from: Yogee on June 06, 2022, 10:49:11 PMI used autobet before. I won in some days but still lost long term. I never used third party bots. I may not be knowledgeable how its algorithmn works and to how it could increase the probablity of winning but I'm well aware that the house always wins in the end. I don't see the logic of spending money on a bot and then lose my bets in  casino. It is a proven fact that house always wins at the end. We need to do responsible gambling to limit our losses. Third party bots too does the same as the autobets. Only thing some bots have the similarity of the algorithm which might increase the winning chances. This too isn't assured. Whether it is usage of bots or self playing, everything needs luck to mark your winning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "June 06, 2022, 11:41:36 PM",
      "body": "Quote from: Davidvictorson on June 06, 2022, 07:31:24 PMHave you ever tried to use the autobet on some gambling websites or have you successfully used third-party bot scripts for betting on sites where it is allowed? Did the bots win? In my knowledge, bots will just follow the algorithm and set of commands that the users will set. I don't see how it will increase the chance of winning for those who are using it when in fact, it's just the same as using an auto-bet feature of a site. There are lots of bot scripts spammed before here that claim profitable but few of them or should I say none of those are really effective as no good reviews were established.And besides, we can't beat the house in the long run so it seems using bots are useless unless there's no auto betting feature on that site.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uang_kartal",
      "created_time": "June 06, 2022, 11:48:26 PM",
      "body": "I don't use other services for each of these games. That when we play with our own strategy and management sometimes we don't always win. at least the execution itself is more like site testing. such as deposits, features, kyc, convenience, benefits and others.and i enjoy it more.if bots are your choice for an anticipation and variety of play, that's possible. but usually the bots produced are random and varied from the 2 results that come out.friend,for reference you can also search on github and youtube.for a belief.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "June 06, 2022, 11:57:45 PMLast edit: June 07, 2022, 02:05:36 AM by AmoreJaz",
      "body": "Quote from: harizen on June 06, 2022, 11:41:36 PMQuote from: Davidvictorson on June 06, 2022, 07:31:24 PMHave you ever tried to use the autobet on some gambling websites or have you successfully used third-party bot scripts for betting on sites where it is allowed? Did the bots win? In my knowledge, bots will just follow the algorithm and set of commands that the users will set. I don't see how it will increase the chance of winning for those who are using it when in fact, it's just the same as using an auto-bet feature of a site. There are lots of bot scripts spammed before here that claim profitable but few of them or should I say none of those are really effective as no good reviews were established.And besides, we can't beat the house in the long run so it seems using bots are useless unless there's no auto betting feature on that site.are there gamblers here that are using bots? i know, a lot are using autobets as i sometimes use it also, when it comes to like dice and other classic games. but bots? maybe, it is the same as trading bots, you will be the one who will take care of the settings or commands. and it depends on the gambler how good he is in those commands. i think, you can easily get rekt here if in case you made a mistake in coding. so maybe, use small funds when testing your bot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "June 07, 2022, 12:35:44 AMLast edit: June 07, 2022, 01:12:46 AM by Rruchi man",
      "body": "Quote from: Davidvictorson on June 06, 2022, 07:31:24 PMJust as there are crypto trading bots, there are also gambling bots. This takes out the fun from gambling and eliminates or reduces the possibility of you understanding a game better as a gambler. It is a lazy man's resort and will be an option for those whose main purpose for gambling is to make money. Although for some games, their accuracy and efficiency rate is high, I still consider gambling bots not to be 100% effective as the article highlights them to be only useful for strategy based games. I also find that usage of bots in gambling can lead to dependence on them even to the point that one cannot gamble if they don't use a bot.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}