{
  "id": "topic_5417884",
  "title": "stefan466",
  "author": "stefan466",
  "created_time": "October 21, 2022, 11:42:50 AM",
  "content": "What to do you think about this theory from Gareth Soloway:https://www.kitco.com/news/2022-10-18/Bitcoin-could-fall-to-3-5K-as-recession-intensifies-and-stocks-collapse-Gareth-Soloway.htmlHe  argues that Amazon has fallen 95% in the dotcom bubble, and that the same could happen with Bitcoin.How realistic do you think such a scenario is?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417884",
  "comments": [
    {
      "author": "joniboini",
      "created_time": "October 21, 2022, 12:35:11 PM",
      "body": "It is not impossible, I mean we went from 19k back to 3k last bull run, so I won't be surprised if a harsher pullback happens. I think fud around exchanges or hacks is likely to be the cause instead of stocks and recession though, who knows? Just be prepared for anything. Plan your trade carefully with stop loss and stuff like that just in case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 21, 2022, 12:41:55 PM",
      "body": "Quote from: stefan466 on October 21, 2022, 11:42:50 AMHow realistic do you think such a scenario is?Imho it's not realistic, the price has already fallen a lot and there seem to be buyers very happy with the current price levels.Plus the historic cycles would tell that we're getting out of time for the chance to get much lower with the price.Of course, the recession is a factor we didn't have in the previous cycles, and this can do bad. Plus, noting is actually impossible. The fact I don't expect that it doesn't mean it cannot or won't happen. Time will tell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "October 21, 2022, 12:57:36 PM",
      "body": "Quote from: stefan466 on October 21, 2022, 11:42:50 AMWhat to do you think about this theory from Gareth Soloway:https://www.kitco.com/news/2022-10-18/Bitcoin-could-fall-to-3-5K-as-recession-intensifies-and-stocks-collapse-Gareth-Soloway.htmlHe  argues that Amazon has fallen 95% in the dotcom bubble, and that the same could happen with Bitcoin.How realistic do you think such a scenario is?It has happened before, and with everything around the world tightening, let's assume that it WILL crash to $3,500. What  are you going to do? Run away in panic, OR be excited in having another golden opportunity to buy that DIP, and HODL? I truly believe that's the difference between those who make good, large profits, and those who don't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "October 21, 2022, 01:22:26 PM",
      "body": "Quote from: joniboini on October 21, 2022, 12:35:11 PMIt is not impossible, I mean we went from 19k back to 3k last bull run, so I won't be surprised if a harsher pullback happens. I think fud around exchanges or hacks is likely to be the cause instead of stocks and recession though, who knows? Just be prepared for anything. Plan your trade carefully with stop loss and stuff like that just in case.Everything is possible because what I learnt from many years of trading experience is that the market is unpredictable. I have watched several of his YouTube videos about this $3500 crash of Bitcoin. According to him, he said it's a worst case scenario for Bitcoin, if things gets out of hand and if Bitcoin followed the Amazon.com bubble and 95% crash in price. But from his point, the main price prediction or target is $12k.From my view , there was a particular time when I was doing some Technical Analysis and that very analysis pointed towards same price target of $3500, worst case scenario and I was shocked but didn't take it so serious because the chances of the price getting there is low.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "October 21, 2022, 01:36:31 PM",
      "body": "I think that his analysis is based on the bottom of the previous cycle, a very pessimistic perception that is difficult to achieve.What concerns us now is to maintain levels above 17k for a long time, which is something that has been achieved so far, so 3,5k is considered impossible based on the current conditions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "October 21, 2022, 02:17:13 PM",
      "body": "Quote from: stefan466 on October 21, 2022, 11:42:50 AMHe  argues that Amazon has fallen 95% in the dotcom bubble, and that the same could happen with Bitcoin.You can not compare Bitcoin to stocks. Amazon is one of stock and it is in a different market than cryptocurrency market.Past cycles and past bear market of Bitcoin have average -80% corrections from all time highs to bottoms of bear market. Please do your calculation for -80% from $69,000 that is an all time high in 2020-2021 bull market.One more point, I don't say the call for $3,500 is good or bad, correct or mad. I want to say, even it happens actually, there will be two opposite sides on the marketPeople who wait for it, patiently and calmly waiting for months to see its appearance and they consider it like the one and only chance to buy Bitcoin at $3,500 in 2023 or 2024. They are winners on the market.People who feel deeply disappointed and fearful. They will sell out and exit the market, with painful feeling and experience. They are losers on the market.Who are you, winner or loser? Who do you want to be?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "logfiles",
      "created_time": "October 21, 2022, 02:25:30 PM",
      "body": "Quote from: joniboini on October 21, 2022, 12:35:11 PMIt is not impossible, I mean we went from 19k back to 3k last bull run, Last bear market? I mean, in a bull market, price surely can't be dropping backwards, can it?  A drop to $3.5K is technically possible, but unlikely in the near future. Before even thinking about $3.5k, there is another very strong support level around $8k-10K. $17k-19K has held on strongly for a quite a while and I believe the current price range is where a new bull market will launch from",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "notocactus",
      "created_time": "October 21, 2022, 02:35:52 PM",
      "body": "Quote from: logfiles on October 21, 2022, 02:25:30 PMA drop to $3.5K is technically possible, but unlikely in the near future. Before even thinking about $3.5k, there is another very strong support level around $8k-10K. $17k-19K has held on strongly for a quite a while and I believe the current price range is where a new bull market will launch from$13,000 is a last call in my opinion but a truly matter for people especially newbies is \"What will they do if Bitcoin actually drops to $3,500 ?\"Now, they wish it will happen but when it happens, they will be fearful. Because if Bitcoin drops to $3,500, they will think it will continue falling to $1,000. It happened in last bear market from my experience. Some people are only observers and they will never be bravely enough to step in.I will buy with DCA a lot around $13,000 but if Bitcoin falls to $3,500 and I still have additional capital from my salary in later months, I will continue to buy it. It is very great chance which does not appear too regularly. I won't miss it just because of fear.I presented my opinion in Is Bitcoin bottom there yet? Fear & Greed, Pi Cycle Top / Bottom. Please visit and see more comparisons with past markets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 21, 2022, 02:47:42 PM",
      "body": "He is always been in Kitco news to forecast scary things but is also not going to predict future prices. Soloway also predicted the price back in 2021 will dip below $20k in a bear market and it also happened. There are several support lines to break before it could reach the 3.5k low. There may just be a catastrophe that will happen that will cause this plummet. Hopefully not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ethereumhunter",
      "created_time": "October 21, 2022, 03:45:31 PM",
      "body": "If that happens, I think people will panic and sell all the bitcoins they have because they fear their losses will be bigger if they keep holding the bitcoins. But that wouldn't happen if people could stay calm and instead see it as a rare opportunity that probably won't happen again in the future. They will use it to buy as many bitcoins as possible and keep them until the price recovers and rises very high. And anything can happen in the future, including the sharp decline that occurred in bitcoin and this makes us always be prepared to buy at a lower price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "October 21, 2022, 09:59:04 PM",
      "body": "It can happen but i wonder if whales can afford this to happen so most probably some will catch the price to avoid getting deeper while others will just join that FUD so they can buy at a more cheaper price.Anything can happen with Bitcoin, the price is not stable and it becomes more volatile, the risk will aways be there and that’s why stop loss is advisable. As long as we stays in bear market, cheaper price can happen anytime.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "October 21, 2022, 11:20:54 PM",
      "body": "Anything can happen since the Bitcoin market is very unpredictable but Gareth Soloway's statement is just speculation so we better not depend on his statement.At the current market trend, is is quite impossible for BTC to drop to $3.5k  since the market is somehow thriving between $19k-$20k range.  Aside from that, the Bear market possibly has few months to stay before we can see a new market trend.  So saying $3.5k in this current Bitcoin cycle has a very low chance of happening, is nearly impossible to say the least.But if the predicted price happens, well it is the better time to buy, IMHO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "October 22, 2022, 03:21:09 AM",
      "body": "Quote from: stefan466 on October 21, 2022, 11:42:50 AMWhat to do you think about this theory from Gareth Soloway:https://www.kitco.com/news/2022-10-18/Bitcoin-could-fall-to-3-5K-as-recession-intensifies-and-stocks-collapse-Gareth-Soloway.htmlHe  argues that Amazon has fallen 95% in the dotcom bubble, and that the same could happen with Bitcoin.How realistic do you think such a scenario is?We are talking about bitcoin which is an asset which is very volatile so such a drop even if it is unlikely it could happen, but it is not very realistic if you ask me to expect that it will actually happen, and even if it does do you think other assets in the market will be doing any better at that point? It is very possible that for such a crash to happen we will need to see an economic crisis like we have not seen one before in many generations, so if I were you I would not worry too much about this prediction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "October 22, 2022, 04:18:57 AM",
      "body": "I think that with all these predictions about bitcoin going to $3K or $5K or the very popular $10K area. I think we either bottomed at $17.5K or we will bottom somewhere in the $14-15K area.Many people want to buy lower and usually when that happens its bottoms out. We are already trading sideways for weeks. This is similar to 2019 when everybody was calling for $1K which never came or 2015 when everybody was calling for $100 bitcoin.Usually when the general public expects the opposite happens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "October 22, 2022, 04:37:56 AM",
      "body": "Quote from: adaseb on October 22, 2022, 04:18:57 AMUsually when the general public expects the opposite happens. Making it really hard for a well-timed entry to buy on the bottom. Soloway is somewhat part of those big investors who are probably chatting with the big investors collaborating to pump and just agreeing to dump at a specific price. For now, they just add more fear to retail investors, part of the wolf pack I guess who posts youtube videos titled \"THE BIG DUMP is CUMING\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "October 22, 2022, 05:46:19 AM",
      "body": "Quote from: stefan466 on October 21, 2022, 11:42:50 AMHow realistic do you think such a scenario is?we won't know how realistic such a scenario could be in Bitcoin.but if you ask about the possibility, of course, there is a possibility. regarding percentages, who knows?currently, the condition of the world market is also not good. some news of the hacking that occurred on the cryptocurrency network could of course be a pretext for a dump that will happen more badly.but at the current value of Bitcoins, $15k is a reasonable price in a gradual dump. I'm not sure there will be a dump that will take bitcoin straight down to $3.5k.this year's decline has been incredible, I think there will be a moment for Bitcoin to stabilize first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "justdimin",
      "created_time": "October 22, 2022, 06:45:52 AM",
      "body": "Quote from: bittraffic on October 21, 2022, 02:47:42 PMHe is always been in Kitco news to forecast scary things but is also not going to predict future prices. Soloway also predicted the price back in 2021 will dip below $20k in a bear market and it also happened. There are several support lines to break before it could reach the 3.5k low. There may just be a catastrophe that will happen that will cause this plummet. Hopefully not.I guess there are some people who like to make these type of bearish claims, there are some people in the fiat world who like to make these type of bearish calculations and predictions as well, and since fiat world does have 2008 or 2022 type of years here and there, they are sometimes right.Like the famous Michael Burry or something, he knew the 2008 crisis long before anyone else, and everyone thought he would be a smart person who knows trading very well, but in reality he just thinks everything will fall at all times and he was right very huge time on that particular subject. Some people are just bearish on trading, and try to make money on that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wind_FURY",
      "created_time": "October 22, 2022, 09:17:25 AM",
      "body": "Quote from: bittraffic on October 22, 2022, 04:37:56 AMQuote from: adaseb on October 22, 2022, 04:18:57 AMUsually when the general public expects the opposite happens. Making it really hard for a well-timed entry to buy on the bottom. It's easier if you lower your time-preference, and simply HODL. Would the difference be truly that large between an entry of $15,000 and $20,000 if you bought one Bitcoin and HODLed it until six digits?QuoteSoloway is somewhat part of those big investors who are probably chatting with the big investors collaborating to pump and just agreeing to dump at a specific price. For now, they just add more fear to retail investors, part of the wolf pack I guess who posts youtube videos titled \"THE BIG DUMP is CUMING\"That's laughable, but I believe I might be the only person that says that I HOPE that the big DUMP/CRASH will come soon. I was induced to sell everything, then start bidding at $10,000, doubling my Bitcoins. But the procedure of loading my private keys from cold-storage is stopping me. Haha.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "October 22, 2022, 10:09:59 AM",
      "body": "Every burst of the bubble is possible. But do you think that we're in a bubble right now where in fact that bitcoin has dropped from $69k to $17k and a few years ago from $20k to $3k? Honestly, I'm done with those bullish predictions that are being published and noticed by people.Now that there's something like this, it's better to have such negative predictions so that the opposite is what actually comes. Remember those bull runs when we're all expecting $100k and then the opposite has happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}