{
  "id": "topic_5448583",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "April 12, 2023, 07:29:20 PM",
  "content": "https://www.prnewswire.com/news-releases/the-digital-currency-monetary-authority-dcma-launches-an-international-central-bank-digital-currency-cbdc-301793163.htmlWASHINGTON, April 10, 2023 /PRNewswire/ -- Today, at the International Monetary Fund (IMF) Spring Meetings 2023, the Digital Currency Monetary Authority (DCMA) announced their official launch of an international central bank digital currency (CBDC) that strengthens the monetary sovereignty of participating central banks and complies with the recent crypto assets policy recommendations proposed by the IMF.Universal Monetary Unit (UMU), symbolized as ANSI Character, Ü, is legally a money commodity, can transact in any legal tender settlement currency, and functions like a CBDC to enforce banking regulations and to protect the financial integrity of the international banking system.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5448583",
  "comments": [
    {
      "author": "Free Market Capitalist",
      "created_time": "April 13, 2023, 07:57:40 AM",
      "body": "Yes, I heard about the news recently. The question I have is what does the IMF need to launch that CBDC for, because as of today the IMF does not have a currency. Or the other way around, if the big countries are going to use this CBDC, as the news says it is used for cross-border payments, I don't know why they are going to need a CBDC for each one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "April 13, 2023, 02:49:07 PM",
      "body": "Quote from: Poker Player on April 13, 2023, 07:57:40 AMYes, I heard about the news recently. The question I have is what does the IMF need to launch that CBDC for, because as of today the IMF does not have a currency. Or the other way around, if the big countries are going to use this CBDC, as the news says it is used for cross-border payments, I don't know why they are going to need a CBDC for each one.If CBDCs are launched in different countries to control citizens, their spending and pay taxes, then on a global scale such a project will help control many countries. The technology is already working and it makes no sense to fight it, so you need to lead the process.There may be other reasons to get a budget for such a project, but it is very small for such people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "April 13, 2023, 03:11:02 PM",
      "body": "Quote from: zasad@ on April 13, 2023, 02:49:07 PMIf CBDCs are launched in different countries to control citizens, their spending and pay taxes, then on a global scale such a project will help control many countries. The technology is already working and it makes no sense to fight it, so you need to lead the process.There may be other reasons to get a budget for such a project, but it is very small for such people.I don't see it clearly. It would be as if for years, apart from the Euro, the Dollar, the pound sterling and other currencies, the IMF had its own currency that was accepted as legal tender in these countries (eurozone, USA, UK etc). I do not know if this CBDC is one more step in taking away the hegemony of the dollar and Biden, with his cognitive decline, does not know about it so will not do anything to prevent it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "April 13, 2023, 04:33:51 PM",
      "body": "Quote from: Poker Player on April 13, 2023, 03:11:02 PMQuote from: zasad@ on April 13, 2023, 02:49:07 PMIf CBDCs are launched in different countries to control citizens, their spending and pay taxes, then on a global scale such a project will help control many countries. The technology is already working and it makes no sense to fight it, so you need to lead the process.There may be other reasons to get a budget for such a project, but it is very small for such people.I don't see it clearly. It would be as if for years, apart from the Euro, the Dollar, the pound sterling and other currencies, the IMF had its own currency that was accepted as legal tender in these countries (eurozone, USA, UK etc). I do not know if this CBDC is one more step in taking away the hegemony of the dollar and Biden, with his cognitive decline, does not know about it so will not do anything to prevent it.Look at the structure of the shareholders of the International Monetary Fund and read who is in charge there. How will the US go against its interests?They want to become a global intermediary of payments between countries, but this is a primitive analysis. Their plans are made for several decades. One organization will control payments between countries. WHO will control all health care in the world, the UN will control a single army. Why does the world need so many states? I think you get my point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "April 14, 2023, 05:08:38 AM",
      "body": "Quote from: zasad@ on April 13, 2023, 04:33:51 PMLook at the structure of the shareholders of the International Monetary Fund and read who is in charge there. How will the US go against its interests?In the same way that three years ago they were a country with energy dependence and now they have to go crying to Saudi Arabia or Venezuela to produce the oil that they are not producing.Quote from: zasad@ on April 13, 2023, 04:33:51 PMTheir plans are made for several decades. One organization will control payments between countries. WHO will control all health care in the world, the UN will control a single army. Why does the world need so many states? I think you get my point.I don't think so. You only have to look at how well Russia or China get along with the US to see that one world government is nothing more than a dream. There are too many regional interests to let that happen. Besides the fact that the experiments done in that way have turned out to have many setbacks, like the EU, where for example there is no EU army, but nation states.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "April 14, 2023, 08:25:24 PM",
      "body": "Quote from: Poker Player on April 14, 2023, 05:08:38 AMQuote from: zasad@ on April 13, 2023, 04:33:51 PMLook at the structure of the shareholders of the International Monetary Fund and read who is in charge there. How will the US go against its interests?In the same way that three years ago they were a country with energy dependence and now they have to go crying to Saudi Arabia or Venezuela to produce the oil that they are not producing.Quote from: zasad@ on April 13, 2023, 04:33:51 PMTheir plans are made for several decades. One organization will control payments between countries. WHO will control all health care in the world, the UN will control a single army. Why does the world need so many states? I think you get my point.I don't think so. You only have to look at how well Russia or China get along with the US to see that one world government is nothing more than a dream. There are too many regional interests to let that happen. Besides the fact that the experiments done in that way have turned out to have many setbacks, like the EU, where for example there is no EU army, but nation states.I do not think that the US has problems with energy dependence and there is a lot of oil produced in the US. US nuclear power depends on Russian supplies of fuel for nuclear reactors, but Russia also depends on the US, so they will always agree. A single government is a dream when there are 8 billion people on the planet, but they are struggling with it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "April 15, 2023, 05:25:03 AM",
      "body": "Quote from: zasad@ on April 14, 2023, 08:25:24 PMI do not think that the US has problems with energy dependence and there is a lot of oil produced in the US. US nuclear power depends on Russian supplies of fuel for nuclear reactors, but Russia also depends on the US, so they will always agree. A single government is a dream when there are 8 billion people on the planet, but they are struggling with it.The USA produces a lot of oil, but three years ago it produced enough to not have to depend on imports. With the change in government and fossil fuels policy, production has been reduced and the USA now produces less than it consumes, so it has to import. There are no shortage problems but part of the price increase has to do with the reduction in production, apart from the war in Ukraine. Returning to the subject, I see the CBDC of the IMF as unnecessary if the others are to be launched, and vice versa. If a digital dollar, a digital euro, etc. is going to be launched, why the CBDC of the IMF? If we were to move towards a world government, which I doubt very much, the IMF CBDC would be enough, and there would be no need to waste money and effort creating and maintaining the others.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "April 15, 2023, 08:59:44 PM",
      "body": "Quote from: Poker Player on April 15, 2023, 05:25:03 AMQuote from: zasad@ on April 14, 2023, 08:25:24 PMI do not think that the US has problems with energy dependence and there is a lot of oil produced in the US. US nuclear power depends on Russian supplies of fuel for nuclear reactors, but Russia also depends on the US, so they will always agree. A single government is a dream when there are 8 billion people on the planet, but they are struggling with it.The USA produces a lot of oil, but three years ago it produced enough to not have to depend on imports. With the change in government and fossil fuels policy, production has been reduced and the USA now produces less than it consumes, so it has to import. There are no shortage problems but part of the price increase has to do with the reduction in production, apart from the war in Ukraine. Returning to the subject, I see the CBDC of the IMF as unnecessary if the others are to be launched, and vice versa. If a digital dollar, a digital euro, etc. is going to be launched, why the CBDC of the IMF? If we were to move towards a world government, which I doubt very much, the IMF CBDC would be enough, and there would be no need to waste money and effort creating and maintaining the others.The United States keeps oil on its territory as a strategic reserve. And why should they produce a lot of oil at home when they can buy oil very cheaply in those countries where they finance wars?https://dcma.io/universal-monetary-unit.htmlThe Universal Monetary Unit has an interesting concept, it is both a commodity and a currency at the same time. It is still very difficult for me to say how this idea will develop further and how the sanctions will affect the development of the project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dansus021",
      "created_time": "April 22, 2023, 11:48:44 AM",
      "body": "Federal Reserve website said \"While the Federal Reserve has made no decisions on whether to pursue or implement a central bank digital currency, or CBDC, we have been exploring the potential benefits and risks of CBDCs from a variety of angles, including through technological research and experimentation. Our key focus is on whether and how a CBDC could improve on an already safe and efficient U.S. domestic payments system.The Federal Reserve Board has issued a discussion paper that examines the pros and cons of a potential U.S. CBDC. As part of this process, we sought public feedback on a range of topics related to CBDC. The Federal Reserve is committed to hearing a wide range of voices on these topics.\" -https://www.federalreserve.gov/central-bank-digital-currency.htm I think the US still looking for now CBCD need a plan at least so when launch it does smoothly but other countries already launch their own version of CBDC according this site - https://cbdctracker.org/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "April 23, 2023, 01:37:20 PM",
      "body": "Quote from: dansus021 on April 22, 2023, 11:48:44 AMFederal Reserve website said \"While the Federal Reserve has made no decisions on whether to pursue or implement a central bank digital currency, or CBDC, we have been exploring the potential benefits and risks of CBDCs from a variety of angles, including through technological research and experimentation. Our key focus is on whether and how a CBDC could improve on an already safe and efficient U.S. domestic payments system.The Federal Reserve Board has issued a discussion paper that examines the pros and cons of a potential U.S. CBDC. As part of this process, we sought public feedback on a range of topics related to CBDC. The Federal Reserve is committed to hearing a wide range of voices on these topics.\" -https://www.federalreserve.gov/central-bank-digital-currency.htm I think the US still looking for now CBCD need a plan at least so when launch it does smoothly but other countries already launch their own version of CBDC according this site - https://cbdctracker.org/The Federal Reserve System is owned by the 12 largest banks in the United States. Although we are told that the Fed is controlled by the government, but who influences the government?Everything has long been decided, according to the rules of democracy, so that there are no protests, people will be allowed to speak out. And then the decision will be made either by agreement or a certain situation will be created, after which no one will be against it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodie",
      "created_time": "April 23, 2023, 08:42:02 PM",
      "body": "International central bank digital currency (CBDC) , the crypto landscape just became interesting! Is there any more data about this new coin, like its total supply, which blockchain will the CBDC be housed on , any info on the guys behind its development etc.And this being some kind of endorsement from the IMF, I see more countries getting on board and legalizing the use of cryprocurrencies and this might just be the breakthrough crypto needed to invite the whales and big boys to pump in some money to take crypto  to the moon...honestly there has never been the perfect time to buy than now, BUY ,BUY ,BUY.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "May 15, 2023, 10:04:38 AM",
      "body": "https://www.bis.org/about/bisih/topics/cbdc/polaris.htmProject Polaris: secure and resilient CBDC systems, offline and online\"As part of Project Polaris, the BIS Innovation Hub Nordic Centre has published a comprehensive handbook exploring key aspects of how central bank digital currencies (CBDCs) could work for offline payments.The ability to make payments offline means being able to use a CBDC without being connected to the internet, either temporarily or because of coverage limitations. Central banks considering the potential implementation of CBDCs with offline functionality must take into account a complex matrix of issues including security, privacy, likely risks, the types of solution, their maturity and applicability, and operational factors.\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}