{
  "id": "topic_5457974",
  "title": "HedgeFx",
  "author": "HedgeFx",
  "created_time": "June 29, 2023, 08:03:27 AMLast edit: June 29, 2023, 02:42:03 PM by HedgeFx",
  "content": "Buongiorno,Ho due amici che hanno minato questa coin con l'app sul telefonino. Ora mi dicevano che ne hanno una dioscreta quantità e il prezzo è arrivato a 20$ circa. Come devono fare (posto che non sia uno scam) a venderla?Edit: ho cercato su internet. Mi è toccato l'infame dovere di comunicargli che hanno preso una sola (fortunatamente non hanno speso nulla).",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457974",
  "comments": [
    {
      "author": "hopenotlate",
      "created_time": "June 29, 2023, 11:15:35 AM",
      "body": "https://coinmarketcap.com/currencies/pinetwork/#Markets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "June 29, 2023, 11:34:15 AM",
      "body": "Ho visto che i depositi sugli exchange in oggetto sono sospesi. Quindi è una sola?Quote from: hopenotlate on June 29, 2023, 11:15:35 AMhttps://coinmarketcap.com/currencies/pinetwork/#Markets",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "June 30, 2023, 02:03:10 PM",
      "body": "teoricamente potrebbero provare a fare delle transazioni p2p nel caso trovano qualcuno disposto a comprarlo (in passato ho visto dei topic qui sul forum).Unico dubbio, quanto realmente gliele pagano, perchè questi exchange quotano la IOU a 20 USD (  ) e se realmente possono essere inviati (non esiste una blockchain...)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "June 30, 2023, 04:32:26 PM",
      "body": "Dubito che possa esserci qualche folle disposto ad acquistarli. Fra l'altro mi sembra di aver capito che si tratta di una coin che richiede KYC al fine di poter essere trasferita, e qusta cosa mi puzza di bruciato lontano un miglio. Quote from: bitbollo on June 30, 2023, 02:03:10 PMteoricamente potrebbero provare a fare delle transazioni p2p nel caso trovano qualcuno disposto a comprarlo (in passato ho visto dei topic qui sul forum).Unico dubbio, quanto realmente gliele pagano, perchè questi exchange quotano la IOU a 20 USD (  ) e se realmente possono essere inviati (non esiste una blockchain...)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "June 30, 2023, 04:48:08 PM",
      "body": "Quote from: HedgeFx on June 30, 2023, 04:32:26 PMDubito che possa esserci qualche folle disposto ad acquistarli. Fra l'altro mi sembra di aver capito che si tratta di una coin che richiede KYC al fine di poter essere trasferita, e qusta cosa mi puzza di bruciato lontano un miglio. Quote from: bitbollo on June 30, 2023, 02:03:10 PMteoricamente potrebbero provare a fare delle transazioni p2p nel caso trovano qualcuno disposto a comprarlo (in passato ho visto dei topic qui sul forum).Unico dubbio, quanto realmente gliele pagano, perchè questi exchange quotano la IOU a 20 USD (  ) e se realmente possono essere inviati (non esiste una blockchain...) dubiti male  perchè ci sono state richieste di \"WTB\" qui sul forum questo un topic/richiesta che ricordo https://bitcointalk.org/index.php?topic=5430063.msg61481101#msg61481101sicuro ce ne sono altre (credo che fosse legato alla possibilità di poterle poi rivendere sugli exchange).Ovviamente, ciò non toglie che sia un progetto \"molto discutibile\" https://bitcointalk.org/index.php?topic=5237735.0 Qui una review/scam accusation scritta da Leviathan.007",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "July 01, 2023, 07:36:22 AM",
      "body": "Ecco la potenza del forumCi sta un progetto così così, vieni nel forum fai una ricerca e trovi la scam accusationGiusta sbagliata vera o falsa, non importaTrovi un posto dove parlare e dove condividere i tuoi dubbiOk è un sistema vecchio, brutto, da mobile nn si vedeMa quanto funziona bene mannaggia",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bastisisca",
      "created_time": "July 01, 2023, 03:16:05 PM",
      "body": "Quote from: HedgeFx on June 29, 2023, 11:34:15 AMHo visto che i depositi sugli exchange in oggetto sono sospesi. Quindi è una sola?Sembrerebbe uno scam bello e buono, ho notato che negli ultimi tempi sta andando di moda lo scam di vendere hardware per minare monete inutili. Spendi soldi per dei miner inutili sostanzialmente.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "July 03, 2023, 06:41:02 AM",
      "body": "un solo indizio non fa una prova, ma tanti indizi tante flag tanti modi di operare poco trasparente fanno un dubbio bello e buonoio me ne terrei fortemente alla larga, non si sa mai che poi giocando con la merda uno si sporca di merda e puzza",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "July 07, 2023, 03:35:23 PM",
      "body": "Sembra che PI Network e la \"società\" che gestisce il progetto siano sotto investigazione in vietnam per accuse di frode / MLM etc etc.La cosa ovviamente non sorprende affatto, sono problematiche ben note... In ogni caso condivido anche qui sul topic, prima che qualcuno decida di avventurarsi in una roba simile almeno è ben informato delle problematiche di un progetto del genere.https://technext24.com/2023/07/06/pi-network-investigated-fraud-vietnam/per chi volesse approfondire la notizia...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "giammangiato",
      "created_time": "July 11, 2023, 05:35:36 PM",
      "body": "Anche a me la cosa non sorprende affatto, puzzava moltissimo di scam e alla fine era un MLM.Non puoi minare con un cellulare lo vedo difficile e anche controproducente.Esisteva anni fa una moneta che accumulavi camminando, in italia, ovvio dire che il tipo ha fatto come houdini, sparito dalle scene completamente. Era scontato e ovvio anche quello.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "July 13, 2023, 07:50:01 AM",
      "body": "forse sarebbe meglio aprire una scam accusation in merito al progetto, altrimenti diventa molto difficile da trovare, quindi se possibile qualcuno armato di buona volonta lo facciae' importante creare anche li un thread cosi si trova",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wirex_Scam",
      "created_time": "July 13, 2023, 07:51:38 AM",
      "body": "Ho avuto a che fare con questa coin tempo fa, e vi racconto la mia storia. Ho dovuto installare un'app sul telefono con cui venivano minati queste coin. Dato che si trattava di un telefono di cortesia che doveva stare sempre in uffico e mai utilizzato, ho voluto fare quasta prova. Dico subito che ho minato una bella quantità , circa 1900 coin. Ma una volta minati mi sono accorto della fregatura: non hanno un sistema di scambi, e come facevano notare per avere disponibilità delle coin minate devi sottoporti ad un processo KYC che richiede diverso tempo. Inoltre funziona al pari di un MLM, in cui devi invitare altri soggetti. Qualche mese fa ho visto che si è fatto un gran clamore attorno a questa coin, e addirittura si parlava di quotazione oltre i 100$ (ma anche 250$!). Ho provato a vedere gli exchange sulle quali è negoziata ma i depositi sono inibiti e il prezzo è determinato da piccoli volumi, attualmente siamo sui 20$.Ho provato dunque a cercare in rete per fare uno scambio P2P : in pratica me le hanno quotate a circa 0.3$ cadauna. Morale della favola: in circa tre anni mi ci sono comprato un iphone. E dico che forse mi è andata bene, ma chissà che fine avranno fatto i miei dati personali.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HedgeFx",
      "created_time": "July 13, 2023, 08:49:01 AM",
      "body": "Quindi alla fine sei riuscito a vendere a 30 centesimi?Dato che nel mio caso si tratta di cryptovalute non mie e non in mio possesso, posso chiederti se la procedura di vendita è stata complicata? Hai usato un escrow? Come ti sei tutelato?Quote from: Wirex_Scam on July 13, 2023, 07:51:38 AMHo avuto a che fare con questa coin tempo fa, e vi racconto la mia storia. Ho dovuto installare un'app sul telefono con cui venivano minati queste coin. Dato che si trattava di un telefono di cortesia che doveva stare sempre in uffico e mai utilizzato, ho voluto fare quasta prova. Dico subito che ho minato una bella quantità , circa 1900 coin. Ma una volta minati mi sono accorto della fregatura: non hanno un sistema di scambi, e come facevano notare per avere disponibilità delle coin minate devi sottoporti ad un processo KYC che richiede diverso tempo. Inoltre funziona al pari di un MLM, in cui devi invitare altri soggetti. Qualche mese fa ho visto che si è fatto un gran clamore attorno a questa coin, e addirittura si parlava di quotazione oltre i 100$ (ma anche 250$!). Ho provato a vedere gli exchange sulle quali è negoziata ma i depositi sono inibiti e il prezzo è determinato da piccoli volumi, attualmente siamo sui 20$.Ho provato dunque a cercare in rete per fare uno scambio P2P : in pratica me le hanno quotate a circa 0.3$ cadauna. Morale della favola: in circa tre anni mi ci sono comprato un iphone. E dico che forse mi è andata bene, ma chissà che fine avranno fatto i miei dati personali.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "babo",
      "created_time": "July 13, 2023, 12:15:07 PM",
      "body": "Fortunato che sei riuscito a vendere, tanta tanta sana fortuna (o grande culo come si dice dalle mie parti, o panaro)Purtroppo queste coin di merda non hanno appunto mercato e non trovi \"scambi\" normaliQuesto altro parametro dovrebbe far capire quanto siano \"affidabili\" o meno",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitbollo",
      "created_time": "July 13, 2023, 01:51:34 PM",
      "body": "Quote from: Wirex_Scam on July 13, 2023, 07:51:38 AMHo avuto a che fare con questa coin tempo fa, e vi racconto la mia storia. Ho dovuto installare un'app sul telefono con cui venivano minati queste coin. Dato che si trattava di un telefono di cortesia che doveva stare sempre in uffico e mai utilizzato, ho voluto fare quasta prova. Dico subito che ho minato una bella quantità , circa 1900 coin. Ma una volta minati mi sono accorto della fregatura: non hanno un sistema di scambi, e come facevano notare per avere disponibilità delle coin minate devi sottoporti ad un processo KYC che richiede diverso tempo. Inoltre funziona al pari di un MLM, in cui devi invitare altri soggetti. Qualche mese fa ho visto che si è fatto un gran clamore attorno a questa coin, e addirittura si parlava di quotazione oltre i 100$ (ma anche 250$!). Ho provato a vedere gli exchange sulle quali è negoziata ma i depositi sono inibiti e il prezzo è determinato da piccoli volumi, attualmente siamo sui 20$.Ho provato dunque a cercare in rete per fare uno scambio P2P : in pratica me le hanno quotate a circa 0.3$ cadauna. Morale della favola: in circa tre anni mi ci sono comprato un iphone. E dico che forse mi è andata bene, ma chissà che fine avranno fatto i miei dati personali. Ah bene! Come ho scritto prima nel post c'è gente che chiede di fare questi scambi P2P. In realtà gli exchange quotano degli IOU e non i reali token... Che poi non esiste una blockain quindi boh ...Personalmente, non mi preoccuperei solo della procedura di KYC ma anche dell'app che viene installata sul telefono, a quali info puó accedere, etc etc etc Certo su un telefono di \"cortesia\" non ci dovrebbero essere grossi problemi, ma in generale eviterei di averci a che fare",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bastisisca",
      "created_time": "July 13, 2023, 06:19:05 PM",
      "body": "Quote from: bitbollo on July 07, 2023, 03:35:23 PMSembra che PI Network e la \"società\" che gestisce il progetto siano sotto investigazione in vietnam per accuse di frode / MLM etc etc.La cosa ovviamente non sorprende affatto, sono problematiche ben note... In ogni caso condivido anche qui sul topic, prima che qualcuno decida di avventurarsi in una roba simile almeno è ben informato delle problematiche di un progetto del genere.https://technext24.com/2023/07/06/pi-network-investigated-fraud-vietnam/per chi volesse approfondire la notizia...Oh, grazie per la segnalazione! Sembrerebbe che PI Network sia andato incontro a un po' di \"guai\" in Vietnam. Sai com'è, le accuse di frode e MLM sembrano essere un classico nel mondo di certi progetti. È davvero importante che le persone siano ben informate prima di avventurarsi in qualcosa del genere. Non vorremmo che qualcuno finisse per perdere il proprio tempo o i propri soldi, vero? Quindi, grazie ancora per condividere la notizia. Sembra che non ci sia mai una noia qando si tratta di queste cose!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}