{
  "id": "topic_5453180",
  "title": "Oshosondy",
  "author": "Oshosondy",
  "created_time": "May 18, 2023, 10:20:20 AM",
  "content": "Read it completely on the link, or read the quotehttps://blockchair.com/news/kraken-uk-trade-body-derides-lawmaker-description-of-crypto-as-gambling--dcfaa70466Quote from: https://blockchair.com/news/kraken-uk-trade-body-derides-lawmaker-description-of-crypto-as-gambling--dcfaa70466Self-regulatory organization CryptoUK and crypto exchange Kraken have slammed a recent report from a panel of British lawmakers that suggested crypto should be regulated in a similar vein to gambling.Crypto is not gambling, we all know that. But crypto can be seen as gambling for some people that do not understand much about them because crypto gives more hope than gambling. Bitcoin is a commodity, most altcoins like ether are securities. Why can lawmakers think that crypto are like gambling. Are the lawmakers right about this?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5453180",
  "comments": [
    {
      "author": "gantez",
      "created_time": "May 18, 2023, 10:49:10 AM",
      "body": "I also hear that in the news yesterday. This is the kind of public view that bitcoin is being labelled by the government and the people in charge of banks to make discredit of cryptocurrency. In the news I hear they also making example of the recent price drop of bitcoin from $31,000 to $26,000 making the meaning that people are losing the money they have and making the justification for it to be gambling. This should not surprise anyone because not the first that bitcoin is criticized but lack of understanding of the bitcoin technology is can be the problem. They don't understand it to be a virtual currency and asset that is traded but they only know gold, silver, fiat and all regulated commodity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 18, 2023, 01:17:57 PM",
      "body": "Quote from: Oshosondy on May 18, 2023, 10:20:20 AMCrypto is not gambling, we all know that. But crypto can be seen as gambling for some people that do not understand much about them because crypto gives more hope than gambling. If you look into the society today, you will discover manner of names people call cryptocurrency to be because they have no idea on what's the meaning not to talk of the understanding of what it gives or have foe to offer to the financial economy at large, though alot has happe before this time as many have been scammed through various online platforms and channels, which makes then assume this same experience with cryptocurrency.Quote from: Oshosondy on May 18, 2023, 10:20:20 AMBitcoin is a commodity, most altcoins like ether are securities. Why can lawmakers think that crypto are like gambling. Are the lawmakers right about this? Being a lawmaker doesn't make any difference from the general opinions others are having about bitcoin, that's just a title to me, this same approach is what other governments are having as well making them not to adopt bitcoin in cryptocurrency as a legal tender.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ultrloa",
      "created_time": "May 18, 2023, 02:02:22 PM",
      "body": "Quote from: Oshosondy on May 18, 2023, 10:20:20 AMRead it completely on the link, or read the quotehttps://blockchair.com/news/kraken-uk-trade-body-derides-lawmaker-description-of-crypto-as-gambling--dcfaa70466Quote from: https://blockchair.com/news/kraken-uk-trade-body-derides-lawmaker-description-of-crypto-as-gambling--dcfaa70466Self-regulatory organization CryptoUK and crypto exchange Kraken have slammed a recent report from a panel of British lawmakers that suggested crypto should be regulated in a similar vein to gambling.Crypto is not gambling, we all know that. But crypto can be seen as gambling for some people that do not understand much about them because crypto gives more hope than gambling. Bitcoin is a commodity, most altcoins like ether are securities. Why can lawmakers think that crypto are like gambling. Are the lawmakers right about this? They drop that perspective since maybe they look crypto as investment which have high risk to lose their money if they don't know what they are doing on it. If UK government could just look at its other usage like for using it on online transaction and innovative technology maybe they will not say that then say crypto is another form of currency. For now we cannot do anything why they think that way but for sure im future once adoption became more bigger maybe their  perspective towards crypto became positive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rat03gopoh",
      "created_time": "May 18, 2023, 02:04:15 PM",
      "body": "They've taken an approach such as not or not involving expert members, easily dismissed the important fact that cryptocurrencies are functionally backed by technology with the paltry assumption \"they 're at risk of volatility\". But I'm curious more about how profitable the country's gambling industry is in terms of state revenue. Their indifference to taking the wrong approach sometimes leads to something bigger that's not yet known such as a policy \"game\" in favor of officials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yogee",
      "created_time": "May 18, 2023, 03:26:43 PM",
      "body": "Some may take this negatively but there's some truth to what they claim since a super majority of cryptocurrencies really have little to no intrinsic value so \"investing\" in them may be considered as gambling. If you say it's not then just take a look at those frogs inserted on the blockchain. I personally think putting money on those types of crypto is like buying a lottery ticket. Of course there are a few with actual utility but the problem is how will regulators separate them from the rest when they make legislative proposals.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "May 18, 2023, 04:01:37 PM",
      "body": "Not all crptocurrency, but altcoins. Bitcoin can't be classified into this group of coins that are similar to gambling. That is why when government is talking about crptocurrency, they should exclude bitcoin. Bitcoin can never be compared to gambling because it will generate profit in the long run for investors. Which gambling is the opposite.Lawmakers can say whatever they want to say about cryptocurrency as this is not the first time that they are saying such. It is not everything that people say about bitcoin that we should listen to because we have more knowledge on bitcoin and believe on it than them. This is another way of spreading the FUD",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "May 18, 2023, 04:12:10 PM",
      "body": "Quote from: Oshosondy on May 18, 2023, 10:20:20 AMRead it completely on the link, or read the quotehttps://blockchair.com/news/kraken-uk-trade-body-derides-lawmaker-description-of-crypto-as-gambling--dcfaa70466Quote from: https://blockchair.com/news/kraken-uk-trade-body-derides-lawmaker-description-of-crypto-as-gambling--dcfaa70466Self-regulatory organization CryptoUK and crypto exchange Kraken have slammed a recent report from a panel of British lawmakers that suggested crypto should be regulated in a similar vein to gambling.Crypto is not gambling, we all know that. But crypto can be seen as gambling for some people that do not understand much about them because crypto gives more hope than gambling. Bitcoin is a commodity, most altcoins like ether are securities. Why can lawmakers think that crypto are like gambling. Are the lawmakers right about this? I am very sad if I see crypto in the same as gambling, but I have its own interpretation of this and become some parts according to my reasoning, Crypto can be considered gambling if we play in the Future or Binari Option trading which basically uses the price Come without them having coins in his wallet, of course it is a gambling.But if the user trading with him has an amount in his wallet either in Dex or CEX or usual when with spot trading, there is absolutely no element of gambling because the user has coins or tokens to be sold. And this is the same as stock trading in general. If they consider Crypto to be gambling, so sahampun.MP members must really learn and read more references so they can distinguish between gambling and which trade.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ucy",
      "created_time": "May 18, 2023, 04:53:18 PM",
      "body": "Just replace the word \"gambling\" with \"very risky\" to see whether they are correct. Gambling and very risky are basically thesame thing. Gambling would mean that the risk of failure is very high But this doesn't seem to be the case for Bitcoin which has been operating smoothly for over 10years with very little human intervention. I wonder what government regulated system can boast of that. Besides, I haven't read much about people losing their Bitcoin due to the failure of the network/system which has never been regulated by any government.  I also haven't read of anyone losing all his/her Bitcoin assets due to price fluctuations. The risk is minimal even for the newbies and almost little to zero for those who have mastered it. So, True Cryptocurrency like Bitcoin is actually way safer than what they currently regulate. I wonder what will become of things they regulate if they become \"unregulated\" like Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "May 18, 2023, 04:56:22 PM",
      "body": "Lawmakers think of Bitcoin and other crypto assets in that way, simply because they are ignorant of the technology and applications this kind of technology has to transmit value in a decentralized way, so they do not see why Bitcoin should be a thing or be considered a commodity. They are dinosaurs of the economical system. On the other hand, there could be lawmakers which are aware of what Bitcoin is and the advantages it offers to people, but they do not agree with the existence of truly decentralized systems and the way Bitcoin can change things in the long run. In the same order of ideas, we could say stocks are also gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "May 18, 2023, 05:34:12 PM",
      "body": "Lol! How funny! It's very clear that whosoever proposed this, has no idea about what bitcoin is or how it functions. Lawmakers can be dumb as donkey and this is one is a classic example of this fact. Someone with a little experience in bitcoin can confirm that it is not gambling any way. But if I have to go by the logic of the lawmakers, they I will have to consider stock market as the main house of gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "May 18, 2023, 06:58:40 PM",
      "body": "The government's perception is different from those who prefer bitcoin's wild divergence. They see cryptocurrencies as a gambling asset that can have a big impact on the economy, so it is understandable that they say so. However, looking back at the history of cryptocurrencies, despite many great fluctuations in terms of technology as well as the application that they bring to the economy, it is unacceptable. So I think they should consider them instead of saying crypto is gambling like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "May 18, 2023, 07:08:41 PM",
      "body": "Quote from: Oshosondy on May 18, 2023, 10:20:20 AMRead it completely on the link, or read the quotehttps://blockchair.com/news/kraken-uk-trade-body-derides-lawmaker-description-of-crypto-as-gambling--dcfaa70466Quote from: https://blockchair.com/news/kraken-uk-trade-body-derides-lawmaker-description-of-crypto-as-gambling--dcfaa70466Self-regulatory organization CryptoUK and crypto exchange Kraken have slammed a recent report from a panel of British lawmakers that suggested crypto should be regulated in a similar vein to gambling.Crypto is not gambling, we all know that. But crypto can be seen as gambling for some people that do not understand much about them because crypto gives more hope than gambling. Bitcoin is a commodity, most altcoins like ether are securities. Why can lawmakers think that crypto are like gambling. Are the lawmakers right about this? And this is what happens when the leaders of a country are elected through a process which is nothing but a popularity contest, which has nothing to do with their actual abilities to lead and they are supposed to formulate laws which increase the prosperity of the people they are to govern, laws should be made by a board of experts on the topic at hand and only leave the voting to those which were democratically elected, by allowing them to create the laws as well we get hilarious and sad results like the one we see here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "May 18, 2023, 08:13:32 PM",
      "body": "Quote from: Oshosondy on May 18, 2023, 10:20:20 AMCrypto is not gambling, we all know that. But crypto can be seen as gambling for some people that do not understand much about them because crypto gives more hope than gambling. You know, its a perception thing and the fact that, a school of thought might have adopted a meaning to a concept doesn't make it true. It only remains as true as it could be to those that share the same frequency of reasoning with the under stated school of thought.Mine school of though makes me understand that trading isn't gambling. Yes, one could bring attributes or concepts of gambling into trading but, trading isn't gambling. Its got assurances to it and the level of assurance you get out of it comes by how close to accuracy you are with your analysis. It's just the truth about that but in the case of gambling, you've got zero assurances at all and can only stick to hope our of speculations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 18, 2023, 08:22:44 PM",
      "body": "Quote from: Oshosondy on May 18, 2023, 10:20:20 AMBitcoin is a commodity, most altcoins like ether are securities. Why can lawmakers think that crypto are like gambling. Are the lawmakers right about this? I have no words for these governments, why they just don't make positive rules so that both can coexist and can benefit each other? But no, they have to come up with such cringe ideas that could get their attention. I think no one listens to them. But once they (gover) got potential (grip), we have to follow them. But the positive side is gambling is legal in the UK and if they make crypto the same rule as of Gambling then still it's not that bad rather than totally ban on exchanges so that citizens can't do trades of any type. This is worst and we might face it. Because our government has made some strict rules against crypto and they haven't implemented them yet either but i am afraid of what will happen when it will be executed. The statement that they made about the crypto ban was \"It's not stable, once they have 2 billion capital now they have less (just for example i know the capital of crypto is more). point is they raised base-less points and i think many citizens have to face them. First, we got hit in the IT sector (freelancing) when there was an internet shutdown in the whole country for a few days now its crypto. I think these governments don't think straight either its UK or our well as a citizen we have to follow their order,",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "May 18, 2023, 08:28:30 PM",
      "body": "Quote from: Oshosondy on May 18, 2023, 10:20:20 AMRead it completely on the link, or read the quoteQuote from: https://blockchair.com/news/kraken-uk-trade-body-derides-lawmaker-description-of-crypto-as-gambling--dcfaa70466Self-regulatory organization CryptoUK and crypto exchange Kraken have slammed a recent report from a panel of British lawmakers that suggested crypto should be regulated in a similar vein to gambling.Crypto is not gambling, we all know that. But crypto can be seen as gambling for some people that do not understand much about them because crypto gives more hope than gambling. Bitcoin is a commodity, most altcoins like ether are securities. Why can lawmakers think that crypto are like gambling. Are the lawmakers right about this? The act of gambling can come in many forms. You have straight up bets most of the time where it is win or lose, but there are potential scenarios where you could win by correctly selecting 4 out of 5 options on a multibet for example. Other bets involve risking money, or other items, with the expectation that a later outcome might increase the amount you initially put in it. There is a very fine line between gambling, speculating and investing, which some people doing it may not even fully understand. Certain forms of stock market investing, like in very small but growing companies, can be akin to gambling if you buy shares in them - because they are at high risk of going under like many businesses do each year. It's easy to see how crypto can be framed in a similar fashion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "May 18, 2023, 08:39:58 PM",
      "body": "QuoteIn Kraken’s statement, the firm emphasized that it “fundamentally” disagrees with the Treasury’s “conclusion that cryptoassets have no intrinsic value.”According to the article, Kraken suggests crypto doesn't have intrinsic value. Doesn't seem like the best argument against crypto regulation when regulators are suggesting crypto is akin to gambling. On a deeper level, purchasing any asset involves some level of risk (gold, real estate, stocks) -- does that mean every investment is considered gambling, requiring government intervention? Probably not.You can gamble with crypto trading the same way with any other commodity. Seemingly crypto is the asset that receives all the attention. Wonder why that is...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "May 18, 2023, 08:51:51 PM",
      "body": "Quote from: Oshosondy on May 18, 2023, 10:20:20 AMBitcoin is a commodity, most altcoins like ether are securities. Why can lawmakers think that crypto are like gambling. Are the lawmakers right about this? It really depends on the jurisdictions that are it a commodity, asset, currency, or store of value quite similar to each other but actually very different in their role. We can define bitcoins as a Number 1 some call it one, and others prefer 1/1 also sometimes we use First. It all depends on the consumer who needs it. For many days there is a continuous scene of replying and reading posts dealing to the Bitcoin role. I was supporting it as currency somewhere and somewhere I did accept it as an asset and commodity but now on the end I am standing with the perspective. Whatever you call it it will remain Bitcoin.Rest of the OP's concern and information is relating the crypto to gambling and I think Op's words are enough to explain that Crypto is not gambling and in am sure 99% on it but for the Bitcoin is not Gambling i am 99.999999% sure",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "May 18, 2023, 08:53:02 PM",
      "body": "There's the rob. And all we thought the regulations in UK are ironed well fit for exchanges to work. But yup they do have at least a regulation to follow regardless of whether exchanges are treated as gambling houses. They are still not as welcoming as US SEC or CFTC. Now that Kraken sees another issue, they might just move further to Singapore.Shouldn't we just put this thread to the gambling forum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayu7adi",
      "created_time": "May 18, 2023, 09:59:13 PM",
      "body": "Quote from: avikz on May 18, 2023, 05:34:12 PMLol! How funny! It's very clear that whosoever proposed this, has no idea about what bitcoin is or how it functions. Lawmakers can be dumb as donkey and this is one is a classic example of this fact. Someone with a little experience in bitcoin can confirm that it is not gambling any way. But if I have to go by the logic of the lawmakers, they I will have to consider stock market as the main house of gambling.  LOL. It's so absurd.I believe they have fallen victim to mishandling cryptocurrency. They think they know enough about it, yet they still fail to profit with their own strategies. It's incredibly foolish to not acknowledge their mistakes that caused them to lose money and unilaterally declare cryptocurrency as gambling.If the market conditions don't align with their predictions, it's not the market's fault. It's better to self-reflect on the decisions that led to those losses.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}