{
  "id": "topic_5458996",
  "title": "ripemdhash",
  "author": "ripemdhash",
  "created_time": "July 07, 2023, 04:53:16 PM",
  "content": "DearsPlease find this bitcoin address: 188888888ikzoy8jmR2byT4WoQsycLxeUHand this 18888888EENAhksSohAkYwq7Fy4HLGciHbthis is the same person what he has a power to find similiar address??",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458996",
  "comments": [
    {
      "author": "ymgve2",
      "created_time": "July 07, 2023, 04:55:45 PM",
      "body": "You are reading it wrong, that first transfer on 3/29 was TO the addressyou probably got confused because it was sent from 18888888EENAhksSohAkYwq7Fy4HLGciHb which looks like, but is not the same address as the one in the title",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "July 07, 2023, 04:58:49 PM",
      "body": "Quote from: ymgve2 on July 07, 2023, 04:55:45 PMYou are reading it wrong, that first transfer on 3/29 was TO the addressyou probably got confused because it was sent from 18888888EENAhksSohAkYwq7Fy4HLGciHb which looks like, but is not the same address as the one in the titleWas going to write that but you are faster",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ymgve2",
      "created_time": "July 07, 2023, 05:00:03 PM",
      "body": "Also you changed the original post so now our comments just sound weird.The \"power\" to find those addresses is vanitygen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ripemdhash",
      "created_time": "July 07, 2023, 05:00:11 PM",
      "body": "You are right , my wrong.But how possibility is that one person will find two BTC address like:18888888EENAhksSohAkYwq7Fy4HLGciHb188888888ikzoy8jmR2byT4WoQsycLxeUH this is the same one manVanityGen for 8 digits?Are we sure? 8 digits?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHFs",
      "created_time": "July 07, 2023, 05:03:25 PM",
      "body": "Quote from: ripemdhash on July 07, 2023, 05:00:11 PMYou are right , my wrong.But how possibility is that one person will find two BTC address like:18888888EENAhksSohAkYwq7Fy4HLGciHb188888888ikzoy8jmR2byT4WoQsycLxeUH this is the same one manVanityGen for 8 digits?Are we sure? 8 digits?He can create them and both can be owned by the same person",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gmaxwell",
      "created_time": "July 07, 2023, 05:12:20 PM",
      "body": "Quote from: ripemdhash on July 07, 2023, 05:00:11 PMVanityGen for 8 digits?Are we sure? 8 digits?Vanitygen for 8 digits is no big deal. But generating two addresses with the same prefix takes sqrt() the number of operations as generating two with a specific prefix: to find two keys whose addresses share a len8 prefix takes about as much work (well about as many key operations) as a len4 vanitygen.The reason for this is that in a specific prefix search every failure is just a failure, but when you are only looking for a match every failure is a new opportunity for a future attempt to make a match.You sure seem obsessed with spreading misinformation about ripmd160 security...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ripemdhash",
      "created_time": "July 07, 2023, 05:17:43 PM",
      "body": "Gmaxwel could you more explain ?about your last sentences please do not remember:) Yeap. Please silent on this:) and of course \" I'm ashamed of this\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "July 07, 2023, 07:19:37 PM",
      "body": "Quote from: ripemdhash on July 07, 2023, 05:00:11 PMYou are right , my wrong.But how possibility is that one person will find two BTC address like:18888888EENAhksSohAkYwq7Fy4HLGciHb188888888ikzoy8jmR2byT4WoQsycLxeUH this is the same one manVanityGen for 8 digits?Are we sure? 8 digits?An older desktop i7 should be able to get a 188888888 in about a week or so using the old vanitygen it will search about 1.75 Mkey/s BUT vanitysearch running on that exact same CPU will get it done in about 1/2 a day due to coding optimizations it can get to 22 Mkey/stake a look at https://bitcointalk.org/index.php?topic=5112311.msg50823897#msg50823897ANY semi modern GPU can get it done in MINUTES.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Synchronice",
      "created_time": "July 08, 2023, 10:19:39 AM",
      "body": "Quote from: ripemdhash on July 07, 2023, 04:53:16 PMDearsPlease find this bitcoin address: 188888888ikzoy8jmR2byT4WoQsycLxeUHand this 18888888EENAhksSohAkYwq7Fy4HLGciHbthis is the same person what he has a power to find similiar address??If you have a good GPU or many good GPUs, you can generate customized Bitcoin address via vanitysearch in minutes or seconds. The more powerful GPUs in higher quantity you have, the better you chances are to create a customized address ASAP.Exclusively for you (pardon me, it's public, don't use this address), I created such a customized address right now, in minutes.PubAddress: 18888888c9HFR19AbL3UB566xR2tEXaWWAPriv (WIF): p2pkh:KxyNdhrx1gvAvYhMvKsa5p8QJS7e3KBcJ92X9PFGDPToxcfF5shiPriv (HEX): 0x344C9BE6B1B72D2E7CE920A0473CC249D42A4690B825FBF70496107E551D42F218888888EENAhksSohAkYwq7Fy4HLGciHb - This is the second address that you posted.18888888c9HFR19AbL3UB566xR2tEXaWWA - This is the address that I created.Here is the guide:[GUIDE] How To Create Vanity Address (Segwit).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WhyFhy",
      "created_time": "July 09, 2023, 11:57:52 AMLast edit: July 09, 2023, 12:42:57 PM by WhyFhy",
      "body": "Quote from: ripemdhash on July 07, 2023, 05:08:55 PMBTC Address contains 34 symbols (numbers and letters), this means the difficulty is equivalent to 34 multiply 5.1699 (Entropy per symbol for different symbol sets) which is equal to 176 bit, this means that there are 2¹⁷⁶ = 95 780 971 304 118 100 000 000 000 000 000 000 000 000 000 billion combinations to obtain wallet similar to 188888888ikzoy8jmR2byT4WoQsycLxeUHThe chance that this man was lucky to have a second wallet with similiar \"18888888\" is equivalent to 1/ 95 780 971 304 118 100 000 000 000 000 000 000 000 000 000 billion. Simply mind boggling.or Am I wrong?I'm gonna go make some coffee. Then sit down and chew out a bunch of these and post em publicly.(I gotta install a GPU but brb!)  Edit-So, shows an output due probally every 4 hours , so If I generate these all day I would likely find about 6 of these from my home setup everyday.,that's not even on a rig designed for keysearch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "July 13, 2023, 08:35:44 PM",
      "body": "Quote from: ripemdhash on July 07, 2023, 05:17:43 PMGmaxwel could you more explain ?Imagine that you have a generator that randomly chooses a single letter.Imagine that you want to run the generator until you get the letter \"R\".Every time the generator generates a new letter, you have a 1 out of 26 chance of generating the letter R.The average amount of time you might need to run the generator is 13 generations to get that \"R\" (sometimes sooner, sometimes longer).If you are unlucky, it could take you hundreds of generations until you happen to get the letter \"R\".If you want to generate the letter R twice, it will take even longer since you will first need to go through all the generations to get the first \"R\" and then do it all over again.Imagine instead that you just want to run the generator until you get the same letter twice (you don't care what letter it is).This will happen much faster.On the first generation, you will have a 0 out of 26 chance of getting two of the same letter (since you will only get 1 letter).On the second generation, you will have a 1 out of 26 chance of getting two of the same letter (since you must match the first generation).On the third generation, you will have a 2 out of 26 chance of getting two fo the same letter (since you can match EITHER of the first 2 generations).On the fourth generation, you will have a 3 out of 26 chance of getting two of the same letter (since you can match any of the first 3 generations).On the fifth generation, you will have a 4 out of 26 chance of getting two of the same letter (since you can match any of the first 4 generations).Notice that your chances keep getting better and better with each new generation since you have more and more letters from past generations that you can match with your next generation.Also notice that you are GUARANTEED to get a match within 27 generations, since after 26 generations you will either already have gotten a match OR ALL POSSIBLE letters will have been generated (so the next one must be a match to one of them).The same effect applies to generation addresses (but on a larger scale).  If you want to search SPECIFICALLY for an address that starts with 188888888, that's going to take quite a while since each character position has 58 different possible characters, and you require one specific character for each of them. However, if you just want to search for two address that start with the same first 8 characters as each other, and you don't care what those characters are, it will happen MUCH faster. Each time you generate ANY address, that's one additional address added to the list of addresses that can be matched by the next address generation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ripemdhash",
      "created_time": "July 14, 2023, 01:21:40 PM",
      "body": "Thank you all for descriebed and clarify for me.I have learnt a lot from yours messages.I'm still study (from two months) the elliptic curve (as math) and every day I learn more (by myself) and thanks your messages and opinions.Thank you.Post Scriptum. I have bought 1 BTC yesterday , so I'm in as you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "July 15, 2023, 04:07:42 PMLast edit: July 16, 2023, 04:42:37 PM by d5000",
      "body": "Just 2 little additions:If the  1888888... addresses were really generated by the same person intentionally, I guess what they did wasn't simply \"search two addresses which start with the same 7 characters\", but more something like \"search two addresses with equal first 7 characters and additionally (after the \"mandatory\" 1 for this kind of address) one character repeated 6 times\". This should already be a bit more difficult, depending on the restrictions you want to use.Quote from: DannyHamilton on July 13, 2023, 08:35:44 PMOn the first generation, you will have a 0 out of 26 chance of getting two of the same letter (since you will only get 1 letter).On the second generation, you will have a 1 out of 26 chance of getting two of the same letter (since you must match the first generation).On the third generation, you will have a 2 out of 26 chance of getting two fo the same letter (since you can match EITHER of the first 2 generations).On the fourth generation, you will have a 3 out of 26 chance of getting two of the same letter (since you can match any of the first 3 generations).On the fifth generation, you will have a 4 out of 26 chance of getting two of the same letter (since you can match any of the first 4 generations).Good explanation. Two little comments:1) in the base58 format (the allowed letters of \"legacy addresses\") you have of course 58 characters to select, not 26 (most uppercase and lowercase letters and most numbers). (Edit: You're right @DannyHamilton, you already mentioned that  )2) just to avoid misunderstandings: the chances should be cumulative, i.e. on the third generation in total you will have had already a chance of 3 out of 26 (1 for the second + 2 for the third) and so on to reach your goal. This means that your average number of tries to reach the goal will be 6, as after 6 generations already you have a cumulative 15/26 chance. So reaching the goal of two matching letter combinations in this example is a little bit more than two times faster than reaching the goal of a second match to the first two-letter combination (13). For base58 the difference would be even bigger: To find two arbitrary matching base58 letter/number combinations, we need 9 generations (0+1+2+3+4+5+6+7+8 = 36/58), while to find the second match to the first generated address, we need 29 generations.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DannyHamilton",
      "created_time": "July 16, 2023, 06:22:26 AM",
      "body": "Quote from: d5000 on July 15, 2023, 04:07:42 PMJust 2 little additions:If the  1888888... addresses were really generated by the same person intentionally, I guess what they did wasn't simply \"search two addresses which start with the same 7 characters\", but more something like \"search two addresses with equal first 7 characters and additionally (after the \"mandatory\" 1 for this kind of address) one character repeated 6 times\".Perhaps.  Perhaps not.  We don't really know. They may have searched for any two addresses which start with the same 7 characters, and coincidentally they just happened to have found a match that consisted of the repeating character \"8\".  However, as you pointed out, it is much more likely that they actually searched for repeating characters.Quote from: d5000 on July 15, 2023, 04:07:42 PMTwo little comments:1) in the base58 format (the allowed letters of \"legacy addresses\") you have of course 58 characters to select, not 26 (most uppercase and lowercase letters and most numbers).perhaps you missed the parts where I said this?Quote from: DannyHamilton on July 13, 2023, 08:35:44 PMImagine that you have a generator that randomly chooses a single letter.Every time the generator generates a new letter, you have a 1 out of 26 chance of generating the letter R....The same effect applies to generation addresses (but on a larger scale).  If you want to search SPECIFICALLY for an address that starts with 188888888, that's going to take quite a while since each character position has 58 different possible characters",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackHatCoiner",
      "created_time": "July 16, 2023, 06:54:56 PMLast edit: July 16, 2023, 08:05:10 PM by BlackHatCoiner",
      "body": "Quote from: ripemdhash on July 07, 2023, 05:08:55 PMBTC Address contains 34 symbols (numbers and letters), this means the difficulty is equivalent to 34 multiply 5.1699 (Entropy per symbol for different symbol sets) which is equal to 176 bitThis is wrong. You shouldn't be counting an address in symbols as it can get quite complicated. An address can be less than 34 characters. An example is: 1111111111111111111114oLvT2 (27 characters)A legacy Bitcoin address as the one showing in the title is an encoded version of 200 bits:Code:- Version byte (0x00 for main net): 8 bits- The RIPEMD-160 of the SHA256 of the public key: 160 bits- The checksum: 32 bitsDue to the fact that the version byte is constant and the checksum is dependent on the RIPEMD-160, only 160 bits define the address.Just in case it isn't cleared yet. The chances of generating an address starting with \"188888888\" is 1 in 588 ~= 1.2 * 1013. The chances of generating two addresses starting with \"1XXXXXXXX\" (where 'X' any base58 char) is the square root of that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}