{
  "id": "topic_5440160",
  "title": "Maus0728",
  "author": "Maus0728",
  "created_time": "February 17, 2023, 09:47:20 AM",
  "content": "I'll just the link the recently published news by BitPinas: https://bitpinas.com/cryptocurrency/gcrypto-now-available-to-select-users/Nakita ko lang din sa Facebook kasi may ilang users na nakaka-access sa GCrypto tab lately. Kung tutuusin parang parehas lang din yan sa service na ino-offer ng Maya, Coins.ph, saka ABRA, which means custodial wallet pa rin yan at hindi mo hawak yung private key mo. Shinare ko lang kasi baka may madala ng hype tapos bumili ng sandamakmak na crypto tapos sa Gcash lang itatambak which is a BIG NO. The point is, ngayong nagiging mainstream na yung crypto sa average joe, most likely maraming newbies na papasok without knowing even the slightest security measures to protect their hard earned money. So kapag may nagtanong, you can simply say that after they bought their crypto asset, you can tell na dapat nilang ilagay sa non-custodial wallet like Electrum/Bluewallet or much better any mainstream hardware wallets lalo kung pang long-term naman nila yan iho-hold.Of course, okay lang naman na i-hold pa rin sa gcash if and only if small amount lang yon for daily transaction or if they are actively trading. Yun reminder lang naman kasi mukhang i-lalaunch na nila yan soon.Some useful links:- https://cryptosec.info/- https://electrum.org/#download- https://bluewallet.io/- LIST Open Source Hardware Wallets",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440160",
  "comments": [
    {
      "author": "SFR10",
      "created_time": "February 17, 2023, 12:58:07 PM",
      "body": "Quote from: Maus0728 on February 17, 2023, 09:47:20 AMI'll just the link the recently published news by BitPinas: https://bitpinas.com/cryptocurrency/gcrypto-now-available-to-select-users/Finally nilabas na nila ang feature na ito at kahit in partnership ito with PDAX, sang-ayon parin ako doon sa mga nagsasabi na medyo mataas yung 5% fee.Quote from: Maus0728 on February 17, 2023, 09:47:20 AMKung tutuusin parang parehas lang din yan sa service na ino-offer ng Maya,Pero at least pwede silang magpadala at tumanggap to/from other wallets [last time I checked, wala pang ganitong feature sa Maya]:How do I receive Crypto?How do I send crypto to another wallet or exchange? (Under 50,000)How do I send crypto to another wallet or exchange? (Over 50,000)Based doon sa \"min/max limit\" page nila, eto yung mga sinusuportahan nilang cryptocurrencies:Quote from: https://help.gcash.com/hc/en-us/articles/9782179390489-What-are-the-minimum-and-maximum-amounts-for-buy-and-sell-orders-BTC, ETH, USDT, USDC, UNI, LINK, AAVE, BAT, GRT, ENJ, LTC, BCH, AVAX, MATIC, DOT, AXS, SLP, ADA, SOL, BNB, XLM and SUSHI",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asuspawer09",
      "created_time": "February 17, 2023, 01:26:45 PM",
      "body": "Quote from: Maus0728 on February 17, 2023, 09:47:20 AMI'll just the link the recently published news by BitPinas: https://bitpinas.com/cryptocurrency/gcrypto-now-available-to-select-users/Nakita ko lang din sa Facebook kasi may ilang users na nakaka-access sa GCrypto tab lately. Kung tutuusin parang parehas lang din yan sa service na ino-offer ng Maya, Coins.ph, saka ABRA, which means custodial wallet pa rin yan at hindi mo hawak yung private key mo. Shinare ko lang kasi baka may madala ng hype tapos bumili ng sandamakmak na crypto tapos sa Gcash lang itatambak which is a BIG NO. The point is, ngayong nagiging mainstream na yung crypto sa average joe, most likely maraming newbies na papasok without knowing even the slightest security measures to protect their hard earned money. So kapag may nagtanong, you can simply say that after they bought their crypto asset, you can tell na dapat nilang ilagay sa non-custodial wallet like Electrum/Bluewallet or much better any mainstream hardware wallets lalo kung pang long-term naman nila yan iho-hold.Of course, okay lang naman na i-hold pa rin sa gcash if and only if small amount lang yon for daily transaction or if they are actively trading. Yun reminder lang naman kasi mukhang i-lalaunch na nila yan soon.Some useful links:- https://cryptosec.info/- https://electrum.org/#download- https://bluewallet.io/- LIST Open Source Hardware WalletsInaabangan ko din lumabas ang feature na ito sa Gcash, nakita ko ung Gcrypto sa account ko pero hindi pa siya available until now so pili pa lang talaga ang may mga access nito. From the looks of it mukang similar siya sa crypto ng Maya na maaari kang makabili ng cryptocurrency and makapagbenta sa platform ngunit maraming mga features na hindi mo pa magagawa, kumabaga bili lang and hold ng bitcoin or other cryptocurrency na available sa platform nila then you could profit kapag malaki ang tinaas ng presyo neto.Pero pagdating sa pagreceive or pagsend ng cryptocurreny mo ay hindi pa ito available sa maya kaya malaking additional feature nila ito if available na agad ito sa platform nila. I dont really buy bitcoin sa mga ganitong wallet usually ang gagamitin ko ay binance app or website, but medjo madaming process lalo na if from cash to cryptocurrency usually Gcash din ang gagamitin mo to convert dahil mayroon namang option na gcash sa binance. Pero if you can buy naman ng cryptocurrency sa Gcash and you can send it to other wallets then why not since its convenient kaysa naman ipalipat lipat pa ang funds para lang maconvert. Maganda siya since masaccesible lalo sa mga tao ang pagbili ng cryptocurrency the more na masmadaling bumili the more na masgaganda or gagalaw ang market which means more opportunity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Woodrose",
      "created_time": "February 17, 2023, 04:09:16 PM",
      "body": "Quote from: Maus0728 on February 17, 2023, 09:47:20 AMI'll just the link the recently published news by BitPinas: https://bitpinas.com/cryptocurrency/gcrypto-now-available-to-select-users/Nakita ko lang din sa Facebook kasi may ilang users na nakaka-access sa GCrypto tab lately. Kung tutuusin parang parehas lang din yan sa service na ino-offer ng Maya, Coins.ph, saka ABRA, which means custodial wallet pa rin yan at hindi mo hawak yung private key mo. Shinare ko lang kasi baka may madala ng hype tapos bumili ng sandamakmak na crypto tapos sa Gcash lang itatambak which is a BIG NO. The point is, ngayong nagiging mainstream na yung crypto sa average joe, most likely maraming newbies na papasok without knowing even the slightest security measures to protect their hard earned money. So kapag may nagtanong, you can simply say that after they bought their crypto asset, you can tell na dapat nilang ilagay sa non-custodial wallet like Electrum/Bluewallet or much better any mainstream hardware wallets lalo kung pang long-term naman nila yan iho-hold.Of course, okay lang naman na i-hold pa rin sa gcash if and only if small amount lang yon for daily transaction or if they are actively trading. Yun reminder lang naman kasi mukhang i-lalaunch na nila yan soon.Some useful links:- https://cryptosec.info/- https://electrum.org/#download- https://bluewallet.io/- LIST Open Source Hardware WalletsThanks for the information. I saw it also sa Facebook. And I think somehow, your right. Many newbies will buy cryptocurrency using Gcash since it is more accessible to all Filipino users. And in fact, it is one the famous E-wallet in Philippines.However, I tried to view it. Unfortunately, I think it doesn't work in other countries. Nasa ibang bansa kasi ako nadestino and gcash is the only means of payment and padala ko sa family ko. That's why I was glad that it is adopting the cryptocurrency. But let me just reinstall the gcash, maybe there's a problem with my application.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "February 17, 2023, 06:54:23 PM",
      "body": "I saw the original post na nasa loob ng article complaining na ang taas ng bawas ng gcash sa pag convert ng peso to btc. Madaming speculations about dun like the spread , fees , etc. I don't know if totoo yung 5% fee nila pero if legit man yun ehhh napakalaki nun and marami naman tayong options to use kaya nakapag tataka na bago palang ang crypto feature nila is ganito na agad kalaki yung fee nila. I never see myself using this service even na active gcash user ako. I always prefer my own way of storing and buying btc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bisdak40",
      "created_time": "February 17, 2023, 11:05:04 PM",
      "body": "Quote from: abel1337 on February 17, 2023, 06:54:23 PMI saw the original post na nasa loob ng article complaining na ang taas ng bawas ng gcash sa pag convert ng peso to btc. Madaming speculations about dun like the spread , fees , etc. I don't know if totoo yung 5% fee nila pero if legit man yun ehhh napakalaki nun and marami naman tayong options to use kaya nakapag tataka na bago palang ang crypto feature nila is ganito na agad kalaki yung fee nila. I never see myself using this service even na active gcash user ako. I always prefer my own way of storing and buying btc. Yong transaction fees talaga yong challenge para sa ating mga Pinoy dahil hindi naman or iilan lang naman yong bumibili ng napakalaking halaga ng crypto na hindi na inaalala yong fees. Yong nga dahilan (para sa akin) na umiiwas ako sa coins.ph dahil ang laki ng kaltas sa value pag na-convert na yong peso into crypto kaya tingin ko option nalang ito ng Gcash pero madalang itong magagamit but when it comes to storage, very reputable naman yong Gcash, safe naman siguro yong nabiling crypto kahit hindi natin i-transfer sa non-custodial wallet natin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oasisman",
      "created_time": "February 17, 2023, 11:31:38 PM",
      "body": "Quote from: bisdak40 on February 17, 2023, 11:05:04 PMQuote from: abel1337 on February 17, 2023, 06:54:23 PMI saw the original post na nasa loob ng article complaining na ang taas ng bawas ng gcash sa pag convert ng peso to btc. Madaming speculations about dun like the spread , fees , etc. I don't know if totoo yung 5% fee nila pero if legit man yun ehhh napakalaki nun and marami naman tayong options to use kaya nakapag tataka na bago palang ang crypto feature nila is ganito na agad kalaki yung fee nila. I never see myself using this service even na active gcash user ako. I always prefer my own way of storing and buying btc. Yong transaction fees talaga yong challenge para sa ating mga Pinoy dahil hindi naman or iilan lang naman yong bumibili ng napakalaking halaga ng crypto na hindi na inaalala yong fees. Yong nga dahilan (para sa akin) na umiiwas ako sa coins.ph dahil ang laki ng kaltas sa value pag na-convert na yong peso into crypto kaya tingin ko option nalang ito ng Gcash pero madalang itong magagamit but when it comes to storage, very reputable naman yong Gcash, safe naman siguro yong nabiling crypto kahit hindi natin i-transfer sa non-custodial wallet natin.Reputable naman ang Gcash ang kaso lang daming umaatake na scammers at as usual mga na bibiktima ay yung mga basta-basta nalang gumagamit ng Gcash na hindi naman nag babasa. Kadalasan na bibiktima dahil dun sa mga link at mga confirmations na sinesend ng mga scammers dun sa mga bibiktimahin nila. I'm not sure kung sa crypto naman may mga gimmick nanamang gagawin ang mga scammers dito, kaya dapat talaga payohan yung mga pumapasok nlng ng basta-basta wa crypto using the new feature ng Gcash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Astvile",
      "created_time": "February 18, 2023, 01:55:28 AM",
      "body": "Quote from: abel1337 on February 17, 2023, 06:54:23 PMI saw the original post na nasa loob ng article complaining na ang taas ng bawas ng gcash sa pag convert ng peso to btc. Madaming speculations about dun like the spread , fees , etc. I don't know if totoo yung 5% fee nila pero if legit man yun ehhh napakalaki nun and marami naman tayong options to use kaya nakapag tataka na bago palang ang crypto feature nila is ganito na agad kalaki yung fee nila. I never see myself using this service even na active gcash user ako. I always prefer my own way of storing and buying btc. Same thoughts. 5% fee for every swap is sobrang sakit talaga kahit na small volume lang yung iiswap mo is ramdam na ramdam mo yung spread what more if malakihan pa since madaming gusto mag invest sa crypto pero di marunong gumamit ng Binance or any other exchange may tendency na Gcash nalang ang gamitin nila and pagkaswap palang nila lugi na sila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "February 18, 2023, 02:24:54 AM",
      "body": "Maraming nagustuhan itong bagong update nila since maraming naghihintay nito lalo na napakadami ng Gcash users pero para sa akin, may coins.ph naman na akong ginagamit kaya di ako ganun kaexcite nung nakita ko na may mga selected users nang may access sa GCrypto. Mas hinihintay ko pa yung Global Stocks feature nila dahil sa ngayon, mahirap makabili ng global stocks sa atin at eToro lang ang alam kong app na pwede nating gamitin kung gusto nating mag invest sa mga Global stocks. Mabuti na rin na nilabas nila itong gCrypto para sa mga gustong mag invest sa crypto.Quote from: bisdak40 on February 17, 2023, 11:05:04 PMpero madalang itong magagamit but when it comes to storage, very reputable naman yong Gcash, safe naman siguro yong nabiling crypto kahit hindi natin i-transfer sa non-custodial wallet natin.Hindi pa rin para sa akin. Ayoko pa ring mag-store ng Crypto sa isang non-custodial wallet.Wala pa akong experience ng nascam or anything na related sa nangyari sa FTX pero for safety purposes na lang rin siguro para sa akin na mas ok i-store ang crypto sa isang custodial wallet. Sa kabilang banda, panigurado maraming Gcash users ang ihohold lang ito sa kanilang Gcash account dahil may mga taong gumagamit ng Gcash na hindi naman alam ang isang custodial wallet. Sana dagdagan pa nila ang security ng app. Meron nang Biometrics pero mas maganda if lalagyan pa nila ng 2FA para mas secure lalo ngayong dumadami na ang features nila.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "carlisle1",
      "created_time": "February 18, 2023, 06:08:34 AM",
      "body": "Quote from: Oasisman on February 17, 2023, 11:31:38 PMQuote from: bisdak40 on February 17, 2023, 11:05:04 PMQuote from: abel1337 on February 17, 2023, 06:54:23 PMI saw the original post na nasa loob ng article complaining na ang taas ng bawas ng gcash sa pag convert ng peso to btc. Madaming speculations about dun like the spread , fees , etc. I don't know if totoo yung 5% fee nila pero if legit man yun ehhh napakalaki nun and marami naman tayong options to use kaya nakapag tataka na bago palang ang crypto feature nila is ganito na agad kalaki yung fee nila. I never see myself using this service even na active gcash user ako. I always prefer my own way of storing and buying btc. Yong transaction fees talaga yong challenge para sa ating mga Pinoy dahil hindi naman or iilan lang naman yong bumibili ng napakalaking halaga ng crypto na hindi na inaalala yong fees. Yong nga dahilan (para sa akin) na umiiwas ako sa coins.ph dahil ang laki ng kaltas sa value pag na-convert na yong peso into crypto kaya tingin ko option nalang ito ng Gcash pero madalang itong magagamit but when it comes to storage, very reputable naman yong Gcash, safe naman siguro yong nabiling crypto kahit hindi natin i-transfer sa non-custodial wallet natin.Reputable naman ang Gcash ang kaso lang daming umaatake na scammers at as usual mga na bibiktima ay yung mga basta-basta nalang gumagamit ng Gcash na hindi naman nag babasa. Kadalasan na bibiktima dahil dun sa mga link at mga confirmations na sinesend ng mga scammers dun sa mga bibiktimahin nila. I'm not sure kung sa crypto naman may mga gimmick nanamang gagawin ang mga scammers dito, kaya dapat talaga payohan yung mga pumapasok nlng ng basta-basta wa crypto using the new feature ng Gcash.Malalaman natin yan, alam naman natin na ang mga scammers ay talagang sanay na sanay na makaisip ng iba't ibangparaan para makapambiktima, pero syempre nasa users pa rin ang magiging basehan.Kung hindi ka basta basta maniniwala at basta basta magcclick ng link at dadagdagan mo pa yung kaalaman mo para samas secure na paggamit ng function na to'Mapapakinabangan din naman sya pang alternative tignan na muna natin ang mga magiging updates.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "February 18, 2023, 10:21:07 AM",
      "body": "Nakita ko nga itong news na ito pero need ko pa parang mag fill up ulit. Hindi ko pa masyadong na explore pero expected ko na na parang Maya din ang service nila.Ang isa rin sa nakita ko na itong gcash/gcrypto ay powered din siya ng pdax.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "February 18, 2023, 12:02:09 PM",
      "body": "Quote from: Woodrose on February 17, 2023, 04:09:16 PMHowever, I tried to view it. Unfortunately, I think it doesn't work in other countries.AFAIK, it doesn't have anything to do with our location [they're just rolling it out in batches, so it's probably going to appear for you in the next few days/weeks].Quote from: bisdak40 on February 17, 2023, 11:05:04 PMbut when it comes to storage, very reputable naman yong Gcash, safe naman siguro yong nabiling crypto kahit hindi natin i-transfer sa non-custodial wallet natin.As mentioned earlier, PDAX ang humahawak nito at kahit sabihin natin na reputable din sila, it still doesn't change the fact na marami paring black hat hackers sa mundo.- Sa pagkakaalam ko, hindi insured ang digital assets sa PDAX!Quote from: LogitechMouse on February 18, 2023, 02:24:54 AMAyoko pa ring mag-store ng Crypto sa isang non-custodial wallet.Wala pa akong experience ng nascam or anything na related sa nangyari sa FTX pero for safety purposes na lang rin siguro para sa akin na mas ok i-store ang crypto sa isang custodial wallet. I think baligtad dapat",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rhomelmabini",
      "created_time": "February 18, 2023, 01:49:36 PM",
      "body": "Quote from: blockman on February 18, 2023, 10:21:07 AMNakita ko nga itong news na ito pero need ko pa parang mag fill up ulit. Hindi ko pa masyadong na explore pero expected ko na na parang Maya din ang service nila.Ang isa rin sa nakita ko na itong gcash/gcrypto ay powered din siya ng pdax.Yeah, pareparehas lang yan unless meron talagang feature na ikakaiba nila na mas lalong magpapabango sa Gcash or gcrypto specifically. Quote from: SFR10 on February 18, 2023, 12:02:09 PMAs mentioned earlier, PDAX ang humahawak nito at kahit sabihin natin na reputable din sila, it still doesn't change the fact na marami paring black hat hackers sa mundo.- Sa pagkakaalam ko, hindi insured ang digital assets sa PDAX!Naku, baka SEC na naman magsiyasat diyan. Nakakapanghinayang lang na PDAX is one of the trusted exchange at supervised kuno ng BSP pero hindi insured mga assets? I wonder how?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "abel1337",
      "created_time": "February 18, 2023, 04:31:50 PM",
      "body": "Quote from: Oasisman on February 17, 2023, 11:31:38 PMQuote from: bisdak40 on February 17, 2023, 11:05:04 PMQuote from: abel1337 on February 17, 2023, 06:54:23 PMI saw the original post na nasa loob ng article complaining na ang taas ng bawas ng gcash sa pag convert ng peso to btc. Madaming speculations about dun like the spread , fees , etc. I don't know if totoo yung 5% fee nila pero if legit man yun ehhh napakalaki nun and marami naman tayong options to use kaya nakapag tataka na bago palang ang crypto feature nila is ganito na agad kalaki yung fee nila. I never see myself using this service even na active gcash user ako. I always prefer my own way of storing and buying btc. Yong transaction fees talaga yong challenge para sa ating mga Pinoy dahil hindi naman or iilan lang naman yong bumibili ng napakalaking halaga ng crypto na hindi na inaalala yong fees. Yong nga dahilan (para sa akin) na umiiwas ako sa coins.ph dahil ang laki ng kaltas sa value pag na-convert na yong peso into crypto kaya tingin ko option nalang ito ng Gcash pero madalang itong magagamit but when it comes to storage, very reputable naman yong Gcash, safe naman siguro yong nabiling crypto kahit hindi natin i-transfer sa non-custodial wallet natin.Reputable naman ang Gcash ang kaso lang daming umaatake na scammers at as usual mga na bibiktima ay yung mga basta-basta nalang gumagamit ng Gcash na hindi naman nag babasa. Kadalasan na bibiktima dahil dun sa mga link at mga confirmations na sinesend ng mga scammers dun sa mga bibiktimahin nila. I'm not sure kung sa crypto naman may mga gimmick nanamang gagawin ang mga scammers dito, kaya dapat talaga payohan yung mga pumapasok nlng ng basta-basta wa crypto using the new feature ng Gcash.Well there's a chance na pasukin talaga to ng scammers at itake advantage yung crypto feature ng gcash. Even custodial wallets ehh nagagawan ng paraan ng scammers ehhh. Creative masyado ang mga scammers ngayon at sigurado magagawan nila to ng way para matake advantage. Let's see kung pano mareresolve or how much gcash is thinking a head about their security given na nagdadag dag sila ng new features sa ewallet nila. Yung loan feature nga ng gcash is hindi available para sa lahat and I think safety precaution nila yung para sa mga dormant gcash account at pili lamang yung mga nakakagamit. Is this crypto feature available para sa lahat ng gcash users? Or may need na requirements para maaccess tong crypto features nila?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "February 18, 2023, 09:36:39 PM",
      "body": "Quote from: blockman on February 18, 2023, 10:21:07 AMNakita ko nga itong news na ito pero need ko pa parang mag fill up ulit. Hindi ko pa masyadong na explore pero expected ko na na parang Maya din ang service nila.Ang isa rin sa nakita ko na itong gcash/gcrypto ay powered din siya ng pdax.PDAX seems to be the good local exchange na regulated, so meaning by activating yung gcrypto wallet need mo mag fill out ulit ng KYC and panigurado pwede mo ren iaccess yung crypto mo sa PDAX which is connected kay gcash parang yung CIMB bank.Anyway, this is a good progress especially para sa mga gustong magsimula sa crypto pero sana iactivate naren nila yung receive and send para naman mas maging ok at mas maging kapipakinabang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "February 18, 2023, 11:51:06 PM",
      "body": "I have no idea na available na pala ang Gcrypto ng Gcash, now ko lang nalaman ng mabasa ko ang thread na ito.  Inaabangan ko rin ito dahil interesado ako kung ano ang magiging kalakaran ng Gcash sa pagimplement nila ng Gcrypto.I wonder kung need pa ng requirement or points to meet para maging available ito sa isang gcash user tulad ng gcredit at gloan na nangangailangan na ma meet ang required Gscore.  Nakita ko na rin pala  iyong Gcrypto pero nung tinap ko ay coming soon ang nakalagay.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "qwertyup23",
      "created_time": "February 18, 2023, 11:57:16 PM",
      "body": "Quote from: Astvile on February 18, 2023, 01:55:28 AMQuote from: abel1337 on February 17, 2023, 06:54:23 PMI saw the original post na nasa loob ng article complaining na ang taas ng bawas ng gcash sa pag convert ng peso to btc. Madaming speculations about dun like the spread , fees , etc. I don't know if totoo yung 5% fee nila pero if legit man yun ehhh napakalaki nun and marami naman tayong options to use kaya nakapag tataka na bago palang ang crypto feature nila is ganito na agad kalaki yung fee nila. I never see myself using this service even na active gcash user ako. I always prefer my own way of storing and buying btc. Same thoughts. 5% fee for every swap is sobrang sakit talaga kahit na small volume lang yung iiswap mo is ramdam na ramdam mo yung spread what more if malakihan pa since madaming gusto mag invest sa crypto pero di marunong gumamit ng Binance or any other exchange may tendency na Gcash nalang ang gamitin nila and pagkaswap palang nila lugi na sila.I am actually one of those people na sobrang nag lolook forward dito sa implementation ni GCash ng GCrypto. Gaya nga ng sabi nila, mas magiging accessible ito sa lahat ng tao given na halos lahat din ngayon gumagamit at may GCash application sa kanilang mobile phones. Not to mention, this will definitely garner more people in the crypto space which is a long-term advantage for all.Pero for a 5% transaction fee, sobrang bigat nito especially if you are someone who transacts using high amounts of cryptocurrencies. I guess, medyo catered ito towards the newbies na bago lang sa space na to.Though ito nga yung situation, it is nice na at least may alternative tayo na wallet. Hindi na lang si coins.ph ang main wallet na pwede nating gamitin for transactions, given na napaka stringent ng rules nila doon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LogitechMouse",
      "created_time": "February 19, 2023, 03:54:44 AM",
      "body": "Quote from: qwertyup23 on February 18, 2023, 11:57:16 PMI am actually one of those people na sobrang nag lolook forward dito sa implementation ni GCash ng GCrypto. Gaya nga ng sabi nila, mas magiging accessible ito sa lahat ng tao given na halos lahat din ngayon gumagamit at may GCash application sa kanilang mobile phones. Not to mention, this will definitely garner more people in the crypto space which is a long-term advantage for all.Pero for a 5% transaction fee, sobrang bigat nito especially if you are someone who transacts using high amounts of cryptocurrencies. I guess, medyo catered ito towards the newbies na bago lang sa space na to.Though ito nga yung situation, it is nice na at least may alternative tayo na wallet. Hindi na lang si coins.ph ang main wallet na pwede nating gamitin for transactions, given na napaka stringent ng rules nila doon.Sinubukan kong icompute kung magkano ang fee ng coins.ph. Nagbase ako sa current price ng coingecko at current conversion price ng coins.ph at lumalabas na nasa around 1-2% lang difference. Hindi ko alam kung ganito ang computation pero if may nakakaalam man ng transaction fees sa coins.ph, pwedeng ishare niyo rito.5% transaction fee? Paano na lang kung malaking amount ang gagamitin mo pambili ng Crypto. Halimbawa, nag-invest si Pedro ng 100,000 PHP gamit ang gCrypto, may kaltas na kaagad na 5,000 PHP yun at gaya nga ng sinabi mo napakabigat niyan lalo na sa mga gusto talagang mag invest sa crypto. May access nga sila dahil maraming gumagamit ng Gcash pero ang tanong, afford ba nila yung ganun kalaking transaction fees.Kakalabas pa naman ng feature na iyan at panigurado, magkakaroon pa yan ng mga adjustments sa hinaharap depende sa experiences at feedbacks ng gumamit ng gCrypto feature nila.Quote from: SFR10 on February 18, 2023, 12:02:09 PMQuote from: LogitechMouse on February 18, 2023, 02:24:54 AMAyoko pa ring mag-store ng Crypto sa isang non-custodial wallet.Wala pa akong experience ng nascam or anything na related sa nangyari sa FTX pero for safety purposes na lang rin siguro para sa akin na mas ok i-store ang crypto sa isang custodial wallet. I think baligtad dapat Salamat sa pag-correct dun. Custodial wallet pala namali ako . Kung hindi nag-notif sa Telegram Bot, hindi ko malalaman na baliktad yung sinabi ko",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "February 19, 2023, 09:39:11 PM",
      "body": "Read this news all over the social media pero personally hinde ko pa sya natratry but this is a good progress if available na sa nakakarami. Maganda si Gcash and very convenient, though hinde perfect when it comes to security but i hope they will improve more kase maraming issue with gcash especially yung mga nahack and nawalan ng pera sa gcash. For now since nasa testing period palang ito, will wait muna sa mga future updates and if secured ba talaga ang crypto using gcash. Meron naba nagiimbak ng crypto sa gcash dito? Possible naba ang option na ito?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "February 19, 2023, 10:10:16 PM",
      "body": "Quote from: crzy on February 19, 2023, 09:39:11 PMRead this news all over the social media pero personally hinde ko pa sya natratry but this is a good progress if available na sa nakakarami. Maganda si Gcash and very convenient, though hinde perfect when it comes to security but i hope they will improve more kase maraming issue with gcash especially yung mga nahack and nawalan ng pera sa gcash. For now since nasa testing period palang ito, will wait muna sa mga future updates and if secured ba talaga ang crypto using gcash. Meron naba nagiimbak ng crypto sa gcash dito? Possible naba ang option na ito?Huli na pala ako hehehe. Madalas kung tingnan yung tab na yan sa Gcash. Pero mukhang hindi ako kasama dun sa selected users,  . Definitely, tayo ang panalo dito, again, mas maraming options mas maganda para sa ting mga crypto enthusiast.At isa rin factor to kung paano lalago ang crypto sa ting bansa dahil ang laki na ng sakop ng Gcash at sa tingin ko mas marami ang merong apps na to kesa as Coins.ph. So widely available sya even sa ordinary citizens na baka magbalak mag invest. Tama rin, antay antay muna tayo ng mga updates nila sa susunod.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}