{
  "id": "topic_5409639",
  "title": "Cryptornd",
  "author": "Cryptornd",
  "created_time": "August 12, 2022, 04:49:40 PM",
  "content": "this is a SMS service which allows sending bitcouns with a text. Read the full article belowhttps://cointelegraph.com/news/bitcoin-without-internet-sms-service-allows-sending-btc-with-a-text",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409639",
  "comments": [
    {
      "author": "Potato Chips",
      "created_time": "August 12, 2022, 09:44:13 PM",
      "body": "SMS are easily intercepted which makes it insecure, see: https://proton.me/blog/stop-using-sms?  I guess if you understand the risk, you can do amounts you're comfortable losing but significant ones? nahhhh. Let's not forget that someone near me can easily pluck out my sim card with some sort of needle and if they replace it with a new one, it would probably take some time for me to notice.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "August 12, 2022, 10:43:50 PM",
      "body": "SMS is not a good option for sending Bitcoin there is a thread recently that talks about SMS 2FA which I think is a bit related and in most of the responses there is SMS hijacking where SMS provider and selected staff can able to check or monitor your text messages or someone who physically have your sim card can able to make a sim clone which is not safe because both of you can able to receive a message or if it's bitcoin then both of you receive the same then the clone one can able to make a transaction send to the hacker's wallet. It is likely a grin coin but the only difference is that you can't send it through SMS instead you can send a grin coin through a file or HTTP listener without internet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PX-Z",
      "created_time": "August 12, 2022, 11:38:56 PM",
      "body": "Good alternative for sending tips but not really safe for larger amount. Sim clones are very common and it's easy to do it, most probably if the person works in the sim provider. You can try just like the idea of storing in an exchange, only store the one you afford to lose, nothing else.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "August 13, 2022, 12:02:18 PM",
      "body": "Other member mention there's security risk with SMS. But i'd be more concerned with fact this service is centralized.Quote from: Potato Chips on August 12, 2022, 09:44:13 PMI guess if you understand the risk, you can do amounts you're comfortable losing but significant ones? nahhhh. Let's not forget that someone near me can easily pluck out my sim card with some sort of needle and if they replace it with a new one, it would probably take some time for me to notice.IMO it's not realistic scenario since they could just steal your phone altogether.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "August 13, 2022, 06:57:16 PM",
      "body": "The solutions are multiple, some enable you to send your currencies via radio waves or any method by which the information can be delivered to a party that has access to a full node or a wallet linked to full node.Therefore, this technology is not exclusive to South Africa and they are not the first to contribute to it, so the way the news is worded is very misleading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "August 27, 2022, 06:35:20 PM",
      "body": "BTC via text will bring about financial inclusion of the unbanked majority, if this becomes a thing and widely spread, it will definitely increase the number of btc users. No internet connection or not having a compatible device will no longer be an issue, people from remote locations can easily have access to btc without any stress.  The simplicity of this process is what will attract non-tech users to accept it, an average user won't care so much about other technical details.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "August 27, 2022, 07:08:07 PM",
      "body": "I am not getting how will it interact with the Bitcoin Blockchain. Going over my head. Is it something like a custodial wallet? Just transfer p2p without Blockchain? Then I think it's something like MFS (Mobile Financial System) that can't send or receive money through a mobile phone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "August 27, 2022, 09:34:25 PM",
      "body": "Quote from: The Cryptovator on August 27, 2022, 07:08:07 PMI am not getting how will it interact with the Bitcoin Blockchain. Going over my head. Is it something like a custodial wallet? Just transfer p2p without Blockchain? Then I think it's something like MFS (Mobile Financial System) that can't send or receive money through a mobile phone. Apparently it involves the lightning network. Now I am not yet conversant with the lightning network because I haven't read extensively about it or used it practically but this video might help you understand how they are doing it- https://twitter.com/BitcoinMagazine/status/1563539340428382215",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "spiker777",
      "created_time": "August 28, 2022, 09:51:40 AM",
      "body": "Quote from: Potato Chips on August 12, 2022, 09:44:13 PMSMS are easily intercepted which makes it insecure, see: https://proton.me/blog/stop-using-sms?  I guess if you understand the risk, you can do amounts you're comfortable losing but significant ones? nahhhh. Let's not forget that someone near me can easily pluck out my sim card with some sort of needle and if they replace it with a new one, it would probably take some time for me to notice.SMS are insecure but we need to know how this thing works. I don't think there is any issue as long as your private key is safely stored somewhere else. we will be sending just bitcoins. not our pivate keys and seeds via SMS to anyone (should never be done)Quote from: JeromeTash on August 27, 2022, 09:34:25 PMQuote from: The Cryptovator on August 27, 2022, 07:08:07 PMI am not getting how will it interact with the Bitcoin Blockchain. Going over my head. Is it something like a custodial wallet? Just transfer p2p without Blockchain? Then I think it's something like MFS (Mobile Financial System) that can't send or receive money through a mobile phone. Apparently it involves the lightning network. Now I am not yet conversant with the lightning network because I haven't read extensively about it or used it practically but this video might help you understand how they are doing it- https://twitter.com/BitcoinMagazine/status/1563539340428382215I see it works pretty much same like how we send mobile loads to other mobiles. dial a code starting with * and ending with #. and it seems a custodial wallet to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "August 28, 2022, 03:26:38 PM",
      "body": "Quote from: spiker777 on August 28, 2022, 09:51:40 AMSMS are insecure but we need to know how this thing works. we will be sending just bitcoins. not our pivate keys and seeds via SMS to anyone (should never be done)That's only one way of accessing funds/crypto and it doesn't diminish the insecurities of SMS/USSD. Take centralized exchanges for instance, a hacker could wipe a user's funds long as they have access to the login information of relevant accounts + OTPs (if any), the private keys would not be necessary. Quote from: spiker777I don't think there is any issue as long as your private key is safely stored somewhere elseThat's the thing, according from the article, the service is custodial and we have no way of knowing how are they safekeeping funds. There is no 100% secure setup but we'd be able to mitigate lots of risk by opting for self-custody. All in all, I can only see this for day-to-day transactions.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fivestar4everMVP",
      "created_time": "August 31, 2022, 10:48:18 PM",
      "body": "I read the article, and first, let me say that the invention is indeed a good one, but not one that will be widely adopted, except a way is found to make this invention decentralized and open source.Secondly, upon reading the post of the OP, I thought this was something the south African government made possible, but through the article, I discovered its just an invention one man made, what is the guarantee that the south African government are not going to come after this invention in the future?I think users of this service should be extremely careful, as, if anything goes wrong and the government seizes the account of the developer of this service, all the money belonging to those using this service is gone, this is downside of centralization.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 01, 2022, 02:06:02 AM",
      "body": "\"SIM cards as private keys?\" This doesn't seem a good innovation where security is of utmost consideration. I cannot imagine holding my private keys in the open public where anybody could just snatch it from me. I cannot imagine putting my private keys on a table in a coffee shop or in a restaurant or in places where if you forget about it when you leave you might not be able to have it back.This seems to be a try-hard attempt just to make Bitcoin relevant at the expense of something which is more fundamentally important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 01, 2022, 05:31:13 AM",
      "body": "While it may not be perfect, it seems like they’re doing what is necessary to help spread adoption which could really benefit these people in the future. I doubt sms will be a widely used way to send Bitcoin but if it helps then now then it seems like a pretty awesome project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 01, 2022, 05:51:35 AM",
      "body": "Quote from: OgNasty on September 01, 2022, 05:31:13 AMWhile it may not be perfect, it seems like they’re doing what is necessary to help spread adoption which could really benefit these people in the future. I doubt sms will be a widely used way to send Bitcoin but if it helps then now then it seems like a pretty awesome project. that's the point i guess. they see to it that there will be an  adoption  despite having an internet connection that is not very stable. there are also digital payment (GCASH) in my country which we use all the time with internet connection. Its widely adopted that even prostitutes are using it nowadays. but if we are not connected to the internet, we can also send the cash thru SMS.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "September 01, 2022, 11:07:33 AM",
      "body": "I will be all for something like this, because I worked on contract in a lot of African countries before... and their cellphones are ancient.. compared to cellphones being used in first world countries. They use a payment system called MPESA on their mobile phones, so it will be an easy transition to Bitcoin for many of them, if they can use Bitcoin via SMS's. We should support innovation like this, because it enables the unbanked to enter the financial world with a click of a few buttons on their phones.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "September 02, 2022, 05:53:51 AM",
      "body": "Quote from: ETFbitcoin on September 01, 2022, 11:47:35 AMQuote from: Darker45 on September 01, 2022, 02:06:02 AM\"SIM cards as private keys?\" This doesn't seem a good innovation where security is of utmost consideration.No, your SIM card isn't used as private key. Phone number of that SIM card is used to login on their centralized service. But obviously it has different security concern.Yeah, I get it. I was just reacting to what was written on the article. Those were the exact words, that the developer was innovating \"for a way to use SIM cards as private keys.\"In a way, it could be likened to it. Having access to the SIM card means having access to the phone number which is like the address, where the load or points or credit is sent. Although if a PIN is needed not just when you register an account but every time you will send or receive Bitcoin, the SIM isn't entirely comparable to private keys. But, just the same, this is essentially more or less like how prepaid SMS load works. It's just that it is Bitcoin-denominated and not fiat. But, of course, you don't really have real Bitcoin in this case but just credit or load redeemable for Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pmalek",
      "created_time": "September 04, 2022, 08:06:48 AM",
      "body": "Quote from: Fivestar4everMVP on August 31, 2022, 10:48:18 PMI read the article, and first, let me say that the invention is indeed a good one, but not one that will be widely adopted, except a way is found to make this invention decentralized and open source. It has to be centralized and custodial otherwise it wouldn't be possible to use or set up. No private keys or seeds are involved because the receivers are not generating their own wallets. Anyone with a mobile phone and a valid SIM card can receive bitcoin without needing to set anything up the way we do. Download/buy/set up a wallet, generate a seed, back it up, send the person your receiving address, and finally receive the coins. All you need here is a phone number. The bitcoin aren't really moving over the blockchain, so it's account balance updates. But at one point in the future, something has to be recorded to the blockchain.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 05, 2022, 09:49:55 AM",
      "body": "The \"sim as private key\" part is definitely a marketing word. Quite a nice strategy to make sure you look great for the average joe, but completely misleading as usual. IMO I'd not spend an extra dime just to move some balance from my exchange account to another, especially if the alternative like logging in directly exists. But I guess the \"offline\" part must be really good for publicity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 06, 2022, 06:48:31 AM",
      "body": "Quote from: Pmalek on September 04, 2022, 08:06:48 AMQuote from: Fivestar4everMVP on August 31, 2022, 10:48:18 PMI read the article, and first, let me say that the invention is indeed a good one, but not one that will be widely adopted, except a way is found to make this invention decentralized and open source. It has to be centralized and custodial otherwise it wouldn't be possible to use or set up. No private keys or seeds are involved because the receivers are not generating their own wallets. Anyone with a mobile phone and a valid SIM card can receive bitcoin without needing to set anything up the way we do. Download/buy/set up a wallet, generate a seed, back it up, send the person your receiving address, and finally receive the coins. All you need here is a phone number. The bitcoin aren't really moving over the blockchain, so it's account balance updates. But at one point in the future, something has to be recorded to the blockchain.  Technically it could be implemented in a more decentralized way with a little more effort which would also solve the security problem.For example the user's phone could send a message to the centralized server with the user's address to first fetch a list of UTXOs. Then the user can locally build a transaction spending any of the given outputs, even sign it offline (for example on another device) and then send it back to that server through SMS.The first contact could also act as a registration so that the server can associate your phone number with your address so that if anybody wanted to send you coins they send a message to that server with your phone number and get your address.The only limitation I can think of is the SMS size which user may need to send/receive multiple ones per tx considering the size of the transaction could be bigger.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}