{
  "id": "topic_5444930",
  "title": "nigeta",
  "author": "nigeta",
  "created_time": "March 15, 2023, 12:03:26 AM",
  "content": "I had a half-baked idea, an event open to everyone involved in the cryptocurrency space  When everyone who sees this news, each person invests according to their own strength, the minimum 1USDT upper limit, this cycle can be one week, one month, one quarter, half a year or one year, all contributors vote to decide, or divide according to the total amount of funds raised, Invest the raised funds, and distribute the profit according to the proportion of the owner's contribution. If it fails, the remaining funds will be voted for reinvestment or returnOf course, whether we succeed or fail, we will meet new friends from all over the world who share our interests  Finally, please invest rationally, no matter in any field                                                                                                                                                                                                                                                                                                                       tribute to all",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5444930",
  "comments": [
    {
      "author": "nigeta",
      "created_time": "March 15, 2023, 12:10:49 AM",
      "body": "MetaMask address 0x977576103A8DB40d5B8C169f4Cde4D8625D0ca63Publish the address and amount of the remittance every week",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "March 15, 2023, 02:35:16 AM",
      "body": "is this how you wanted to become from Poor to millionaire as what your last created thread says here? https://bitcointalk.org/index.php?topic=5441362.msg61825128#msg61825128as a newbie none of us will send you even a penny mate , there are even other trusted people here that have this in the day and yet only few supported so how come that with you as new account will find more?even if you use escrows i don't think it will progress , better to establish your name first and invest instead of asking others to invest in you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nigeta",
      "created_time": "March 15, 2023, 04:57:09 AM",
      "body": "there is no relationship between the two",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "March 15, 2023, 09:39:44 AM",
      "body": "I think that messed up idea to build wealth. Why need to send their own funs on other wallet when they could do their own contributions on their own wallet right? Its like saving but together, maybe it is applicable to friends already and put their savings to some staking program and withdraw the interest and shared among members but if its an online meet up like this one then possibly it would be no trust about it. Who would send money to someone they barely knew right?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "March 21, 2023, 06:48:47 AM",
      "body": "Quote from: nigeta on March 15, 2023, 04:57:09 AMthere is no relationship between the twoso how come that the 2 post created by yours are not related? in the other you wanted to become a millionaire(and seems to be in short time) and here you are asking this?best to try offering an Escrow to this and maybe you will get at least a little interest from the community( but hoping it will come for newbie like you)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fvb",
      "created_time": "March 21, 2023, 11:07:16 AM",
      "body": "Some people are always trying to find or offer what they think are ideas that will supposedly bring prosperity to others. What is offered here is as old as the world and is called a simple word that everyone knows. It's a waste of time",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "March 21, 2023, 11:25:41 AM",
      "body": "Quote from: nigeta on March 15, 2023, 12:03:26 AM  I had a half-baked idea...It is good that you realised that your idea is half baked. I would advise that you should refine your idea and come up with a project that is tangible or that has a good road map. Maybe people may decide to crowdfund your idea. But this half-baked idea you put up is not worth anyone's effort and I am sure you will have no clients to patronize you. Not only because you are a newbie also because there is no future in what you are talking about. People are wiser with their money and they would invest it wherever they think there is future and with whom that is reliable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wexnident",
      "created_time": "March 21, 2023, 11:28:29 AM",
      "body": "I see absolutely no reason why we should send the funds to you. Might as well have said to give you free money really. I honestly agree, it is indeed a half-baked idea and was probably something you thought up of while you just woke up or drunk. Even escrow wouldn't help establish trust in an idea like this. If you really wanted something like this try it with your friends, if you have any. They might be more willing to partake in your idea since they know you, but on the internet on a public forum like this? Good luck getting even one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}