{
  "id": "topic_5468360",
  "title": "Mia Chloe",
  "author": "Mia Chloe",
  "created_time": "September 27, 2023, 10:25:27 PM",
  "content": "Every since I got to know about the MEMPOOL I have been kinda obsessed with it today while I was browsing through the mempool I noticed a particular transaction of over 6 Bitcoins having a fee of $0.00 this was odd to me because I usually come across those with very little fees but not with zero fees.What baffled me the most was the fact that the transaction had 33 confirmations.Here is the hash id of the transaction 6036af43db95e0ef572f9bbc536739838b680a053a564a41120ab77b0697500eThe transaction was mined in block 809608 and was confirmed about 5 hours ago",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468360",
  "comments": [
    {
      "author": "logfiles",
      "created_time": "September 27, 2023, 11:22:16 PM",
      "body": "It's known as a Coinbase transaction -- regarded as the first transaction in the block, and it involves addition of newly mined Bitcoins into the block or even the Bitcoin circulating supply. So the 6.56711563 BTC you see are the Block rewards and total transaction fees in the block that the miners in the ViaBTC mining pool will earn because their mining pool confirmed the block.1. https://cointelegraph.com/explained/what-is-a-coinbase-transaction",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "September 27, 2023, 11:59:11 PM",
      "body": "As mentioned by logfiles, that's coinbase transaction and note that miners are free to even include non-coinbase transactions not paying any fee.Miners usually prioritize transactions based on their fee rate to maximize their profit and nodes usually don't relay transactions paying less than 1 sat/vbyte, but there's nothing preventing miners from including transactions with zero fee. Quote from: Mia Chloe on September 27, 2023, 10:25:27 PMEvery since I got to know about the MEMPOOLIt seems that you are confusing mempool with the blockchain.This may be off topic, but I think it's worth mentioning that mempool is like a waiting room which nodes keep unconfirmed transactions there. If a transaction has been confirmed, that has been included in the blockchain and nodes no longer keep that in their mempool.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "EL MOHA",
      "created_time": "September 28, 2023, 12:09:37 AM",
      "body": "Just as explained above it is a coin base transaction which is usually use to collect the block reward and corresponding rewards from the transaction fees. It is similar to regular transactions just that it’s own data is has an empty input. It is also special in a such a way that miners can only spend it after at least 100 block rewards. I see you were surprise about the 0 fees but do you know that even regular transactions can get confirmed with 0 fees, it depends on the miners. If you get access to one they can just insert your transaction to their candidate block and if it goes through they mined yours, the only thing is they won’t get the transaction fee which is their reward. So it is not a must that a transaction should be with a fee base on protocol. Another link on coinbase transactionsEdit: already posted before I saw hosseinimr93 reply",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "September 28, 2023, 01:30:47 AM",
      "body": "You can use this API to get data for transaction with zero transaction fee excluding Coinbase transactions.https://api.blockchair.com/bitcoin/transactions?q=fee(0),is_coinbase(false)https://api.blockchair.com/bitcoin/transactions?q=fee(0),is_coinbase(false)&a=date,count()&export=csvZero fee for bitcoin transaction [Historical data]",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "September 28, 2023, 03:10:24 AM",
      "body": "Quote from: logfiles on September 27, 2023, 11:22:16 PMIt's known as a Coinbase transaction -- regarded as the first transaction in the block, and it involves addition of newly mined Bitcoins into the block or even the Bitcoin circulating supply. So the 6.56711563 BTC you see are the Block rewards and total transaction fees in the block that the miners in the ViaBTC mining pool will earn because their mining pool confirmed the block.1. https://cointelegraph.com/explained/what-is-a-coinbase-transactionIt's crazy that I just learned that the first ever coinbase bitcoin block never got confirmed for 50 BTC!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BVeyron",
      "created_time": "September 29, 2023, 09:33:06 PM",
      "body": "Quote from: Mia Chloe on September 27, 2023, 10:25:27 PMEvery since I got to know about the MEMPOOL I have been kinda obsessed with it today while I was browsing through the mempool I noticed a particular transaction of over 6 Bitcoins having a fee of $0.00 this was odd to me because I usually come across those with very little fees but not with zero fees.What baffled me the most was the fact that the transaction had 33 confirmations.Here is the hash id of the transaction 6036af43db95e0ef572f9bbc536739838b680a053a564a41120ab77b0697500eThe transaction was mined in block 809608 and was confirmed about 5 hours agoThe verification queue is something weird, actually such things can happen due to some features of verification process. In general, the common rule is \"the more the fee - the faster the transaction\", but miners are able to set the order of transactions in any way they want. So in general these things happen due to miners' preference (I think so)...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}