{
  "id": "topic_5445833",
  "title": "tvbcof",
  "author": "tvbcof",
  "created_time": "March 21, 2023, 06:14:38 PMLast edit: March 21, 2023, 06:27:45 PM by tvbcof",
  "content": "There is no reason for Nuland to be snuffling around here in PH other than for something bad, and especially if it is being kept secret even from the Senate!  I strongly suggest to keep an eye on things and hold the feet of those who might sell you out to the fire.  Nuland puts Philippines in next war after Ukraine?  https://www.bitchute.com/video/8ftFKzebq4Li/  https://archive.md/po6s4For me and my family, we can vacate the islands rather easily if need be.  Most other people are not so fortunate.  I don't wish to leave, and I also don't wish to see harm brought upon the Filipino people many of who I know and like.  What would be ideal would be if the people demand that the country stay as neutral as possible for the next couple years of turmoil.Some bridges have already been burnt by the vote with the 'Collective West' to steal Russian and Russian oligarch's money via the soon-to-be-dead petro-dollar monetary system.  I do expect The Philippines to be now chronically at the end of the line when it comes to energy, and for all the cement I use to be labeled 'product of Vietnam' for a long time to come.  Think you are going to make it on 'green energy'?  Good luck with that.  For my part I upgraded my generator (and am fooling around with solar just for the fun of it.)My analysis is that China is pretty busy with their belt-n-road initiative for a while, and The Philippines is a little bit off the path.  Defend by means of discouraging rampant direct exploitation by the Chinese.  Making a barrier to simply moving in physically is about the best you can do.  They'll steal oil, fish, etc one way or another.  Sucks, but it is what it is, and you could probably get at least something (without giving up to much) if your leaders played their cards right.The U.S. is currently under leadership of a form which has some sort of a seemingly religious zeal for causing death and destruction and seeing people suffer.  And they lie and deceive apparently just for the joy of doing it.  These are the so-called 'neocons' and they are bad bad news.All roads lead to China's 'social credit' form of slavery no matter what, but it's important to note that China was just the contractor to develop and test the system.  It's a WEF 'technocratic' thing.  I told all my friends here that it didn't matter if Robredo or Marcos wone because they are both puppets of the same director.  The paths might vary a bit is all.  The 'neocon' path is wanton death and destruction.  'kinetic' if you will. The other would probably rely more on (equally devastating) biological, psychological, and surveillance methods.  There is plenty of overlap.  An illustration is the 'young innovators' lingo.  That would be internal operatives cultivated by the WEF.Kissinger is a very evil but also very wise and at times an unusually honest person.  He reportedly said:  “To be an enemy of America can be dangerous, but to be a friend is fatal.”Truer words were never spoken, and it's even more true now.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5445833",
  "comments": [
    {
      "author": "blockman",
      "created_time": "March 21, 2023, 11:31:42 PM",
      "body": "This is making me miss more the past administration and of course, former president Duterte. When he's still on the seat, he's being told that he's a lapdog of China but he sure knows what he's doing and not startling any fight that will make our country in a really terrible situation. Alliance with the US and giving them free base camps was what Duterte has pointed out that they can't go here and get those things for free and the other one (China) might think that there's something that's happening. It's true that when a war starts, many of the citizens that are able will just flee from this country but the sad reality is, too many that are in poverty that even bares something to eat. In the current administration with Marcos, it's obvious that he's more with the US and giving them all of the benefits and didn't pursue what Duterte has started and they seem to put into waste in terms of being neutral and friends to anyone. Although both have said that they can be friends with anyone and enemy with none, Duterte has proved that but after almost 1 year of Marcos' leadership, I don't think so.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvbcof",
      "created_time": "March 23, 2023, 05:31:03 PMLast edit: March 23, 2023, 06:06:18 PM by tvbcof",
      "body": "Quote from: blockman on March 21, 2023, 11:31:42 PMThis is making me miss more the past administration and of course, former president Duterte. When he's still on the seat, he's being told that he's a lapdog of China but he sure knows what he's doing and not startling any fight that will make our country in a really terrible situation.Looked to me as though Duterte was 'for real' and actually did care about the country and it's people to a reasonable degree.  There is little doubt that the dis-like for him among the globalist types who own the media was 'for real'.  I suspect that Duterte had some understanding of 'their game' and wasn't interested in much of it for his country.  Alas, by the time I got here they guys seemed to have been pretty beat down.  I suspect they did Marawi and asked him if he wanted more.  He declined and didn't cause any more real problems.  It's possible that he influenced uptake of the less dangerous non-genetic Chinese de-population shots which, if true, is better than nothing but his performance through the scamdemic was generally bleak.  Seems to me that he left office pretty much a beaten man.I remember early on Duterte saying that the U.S. wanted Filipinos to fight China.  Duterte said something to the effect of \"they have nuclear ballistic missiles and I have nothing.  That's insane!\"  I don't particularly doubt his story, and I don't doubt that the basic idea of 'fighting China to the last Filipino' remains desirable to the U.S. in SE Asia as it is with Ukroids in Eastern Europe.  They have said for 50 years that there are to many Filipinos in The Philippines and that it's a high priority national security task to rectify the problem.  See: NSSM 200.  And see the 'tetanus shot' shenanigans of a couple decades ago.  Not to mention the myriad of foreign NGO's active in 'family planning' issues.Quote from: blockman on March 21, 2023, 11:31:42 PM Alliance with the US and giving them free base camps was what Duterte has pointed out that they can't go here and get those things for free and the other one (China) might think that there's something that's happening. It's true that when a war starts, many of the citizens that are able will just flee from this country but the sad reality is, too many that are in poverty that even bares something to eat. In the current administration with Marcos, it's obvious that he's more with the US and giving them all of the benefits and didn't pursue what Duterte has started and they seem to put into waste in terms of being neutral and friends to anyone. Although both have said that they can be friends with anyone and enemy with none, Duterte has proved that but after almost 1 year of Marcos' leadership, I don't think so.Letting the U.S. use The Philippines for stockpiling weapons is probably the stupidest thing I've ever heard.  The U.S. is in a desperate race against their collapsing monetary system to get a war going with China.  As soon as that happens, any American garrisons or stockpiles are legitimate targets.  Unlike in Europe where there is some threat of NATO Article 5, SEATO never got off the ground.  I'd be surprised if any other SE Asian countries would lift much more than a finger to help The Philippines as I would expect that they don't really welcome the U.S. as a house-guest in the area and they obviously can easily predict the problems that the invitation is going to bring to the area. If anything I would expect that the whole outcome of such a conflict would be pre-planned, and this would be some pre-arrange trade of The Philippines to the Chinese for something else Maybe Japan or Korea or some such.  I mean it is unlikely that the Chinese would come in physically as an occupying force absent a military excuse to do so.  Everyone makes money, and, as you say, the connected people can easily bail to one of their overseas place and wait things out. I predict that there will be no significant war on Taiwanese soil.  There are to many personal, family, and business relationships between the Chinese on Formosa and Mainland.  They'd all prefer to do the bulk of the fighting on the soil of a third-party, and The Philippines is a natural for that just as was Ukraine.As an aside I just heard that it's getting difficult for Filipinos to get past immigration on their way out.  Some crackdown under the excuse of 'human trafficking' or something like that.  That could be another early indication of storm-clouds on the horizon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Beparanf",
      "created_time": "March 23, 2023, 05:43:29 PM",
      "body": "This is the reason why President Duterte is the best. He knew what’s coming if he allow US to help since they will instigate war against China that is now having an issue with the country due to territory dispute on West Philippines Sea. BBM is more on economic growth of the Philippines and less on country alliances. I’m sure that his cabinet is dealing with US for an economic boost request in exchange for what’s coming. I’m not aware of this kind of development but one thing is for sure that the current administration is not thinking straight on the effect when US becomes close allies once again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 23, 2023, 09:25:19 PMLast edit: March 23, 2023, 09:51:42 PM by blockman",
      "body": "Quote from: Beparanf on March 23, 2023, 05:43:29 PMThis is the reason why President Duterte is the best. He knew what’s coming if he allow US to help since they will instigate war against China that is now having an issue with the country due to territory dispute on West Philippines Sea. Yeah, he understands more what may happen if given the situation of the continuation of aid from the US. But he managed to mitigate it and got respect from China and Russia. That's literally the friends to all but enemies to none.Quote from: Beparanf on March 23, 2023, 05:43:29 PMBBM is more on economic growth of the Philippines and less on country alliances. I’m sure that his cabinet is dealing with US for an economic boost request in exchange for what’s coming. I’m not aware of this kind of development but one thing is for sure that the current administration is not thinking straight on the effect when US becomes close allies once again. We've just come from the recovery due to the pandemic and other disasters that have hit pre-pandemic even up to now. Yeah, I thought he will be more friendly with the agriculture sector since he's also the secretary of that department but it seems that he's too loaded up and needs to give that to someone who can manage better than him and focus more on the presidential tasks. With all of his state visits, he's more focused into foreign investors and attracting them to invest in the Philippines. Yeah, there have been pledges but they'll remain pledges and promises until they actually land those checks and do the actual thing. I just don't like what's happening that he's getting close to the US since there's a huge gap between them and China, how I wished that he just continued Digong's(Duterte) friendship style.Quote from: tvbcof on March 23, 2023, 05:31:03 PMLetting the U.S. use The Philippines for stockpiling weapons is probably the stupidest thing I've ever heard.  The U.S. is in a desperate race against their collapsing monetary system to get a war going with China.  As soon as that happens, any American garrisons or stockpiles are legitimate targets.  Unlike in Europe where there is some threat of NATO Article 5, SEATO never got off the ground.  I'd be surprised if any other SE Asian countries would lift much more than a finger to help The Philippines as I would expect that they don't really welcome the U.S. as a house-guest in the area and they obviously can easily predict the problems that the invitation is going to bring to the area. If anything I would expect that the whole outcome of such a conflict would be pre-planned, and this would be some pre-arrange trade of The Philippines to the Chinese for something else Maybe Japan or Korea or some such.  I mean it is unlikely that the Chinese would come in physically as an occupying force absent a military excuse to do so.  Everyone makes money, and, as you say, the connected people can easily bail to one of their overseas place and wait things out. I predict that there will be no significant war on Taiwanese soil.  There are to many personal, family, and business relationships between the Chinese on Formosa and Mainland.  They'd all prefer to do the bulk of the fighting on the soil of a third-party, and The Philippines is a natural for that just as was Ukraine.We've got no choice if some trouble is at hand and China starts to initiate or just retaliates to the provocation of what the US is doing. As I've said that there have been some joint military exercises that have happened between PH and US troops while Japan should join but they didn't. We'll be the battlefield if these two startled something that will trigger any of the two but more with China's retaliation since US is the one that's provoking them but it makes sense since they'll just reason out about honoring the arbitration award and who's the clear winner on the West Philippine Sea which they're naming the South China Sea. This is what Duterte has understood and he doesn't want to happen, we'll be in a terrible situation and I doubt that most alliances of Philippines will help if ever something happen or worst case scenario has come.Quote from: tvbcof on March 23, 2023, 05:31:03 PMAs an aside I just heard that it's getting difficult for Filipinos to get past immigration on their way out.  Some crackdown under the excuse of 'human trafficking' or something like that.  That could be another early indication of storm-clouds on the horizon.That's true, it's been trending and these IOs are getting to the nerve of our fellow countrymen that just want to have a good day vacation offshore. But with all stuff and requirements, as in crazy conditions and requirements. With all of the thousands of their offloading, only a few of them were actually legitimate catch. In one report/news, the IO asked the traveler about her graduation yearbook. I still don't see some action from BBM or some words with it. While in the past with Duterte's administration, he threatened the corrupt \"pastillas\" group in the airport that they'll be humiliated and be out of their service if someone reports to him directly. All good until the administration and leadership has changed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BADecker",
      "created_time": "March 24, 2023, 08:10:21 PM",
      "body": "You Philippine jokers are simply out of luck... if the US lives up to its current stupid state.America could turn the Philippines into the next Ukraine in proxy war with Chinahttps://www.naturalnews.com/2023-03-24-philippines-next-ukraine-us-proxy-war-china.htmlThe United States could turn the Philippines into the next Ukraine by using the Southeast Asian nation to fight a proxy war against China.The Office of the Spokesperson of the U.S. Department of State recently announced that Under Secretary for Political Affairs Victoria Nuland will be meeting with senior Philippine officials “to discuss key aspects of the U.S.-Philippines alliance,” to consult with other leaders, civil society executives and young entrepreneurs to discuss “the full range of global issues.” (Related: China may have already deployed unstoppable hypersonic missiles capable of targeting American bases in the Pacific.)The Integrated Development Studies Institute (IDSI), a Manila-based think tank, warned that Nuland’s visit could raise the possibility of the Philippines being involved in a future war between China and the U.S. “in which the U.S. will fight a proxy war against China up to the last Filipino – just like what it did to us in World War II and what the U.S. did in Ukraine from 2014 up to now.”“Over 100,000 Ukrainians have already been killed; with the security and peace, economy and democracy of Ukraine all destroyed,” warned IDSI.IDSI further warned that Nuland already has substantial experience setting up a third nation to act as America’s main proxy in foreign conflicts.In 2013, Nuland was instrumental in providing Ukraine with $5 billion to bring about a “secure and prosperous and democratic Ukraine.” But this money ended up being used, in part, on genocidal attacks on Russians in eastern Ukraine, killing over 14,000 of them before the beginning of Moscow’s special military operation.“We can predict that this is now again the ‘mission’ of top CIA or Deep State agent Victoria Nuland in coming to the Philippines: To create a new war, from Ukraine to Asia, between the Philippines and China, with the poor, hapless and helpless Filipinos as the new cannon fodders of the U.S. right after the equally poor, hapless and helpless Ukrainians,” wrote IDSIAmerica to expand military presence in the Philippines...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "March 26, 2023, 11:52:58 PM",
      "body": "Quote from: BADecker on March 24, 2023, 08:10:21 PMYou Philippine jokers are simply out of luck... if the US lives up to its current stupid state.America could turn the Philippines into the next Ukraine in proxy war with Chinahttps://www.naturalnews.com/2023-03-24-philippines-next-ukraine-us-proxy-war-china.htmlThe United States could turn the Philippines into the next Ukraine by using the Southeast Asian nation to fight a proxy war against China.~snip~You have said it so and you know what the situation is right here? Many don't seem to be aware of the state affairs of these visits that have happened in our country. And it was the total opposite of the past administration to the current one we've got. The peace and relationship between China and the Philippines were on good terms under Duterte's leadership but then it appears to be that type of relationship became lesser and lay low due to the favor that the administration is showing to the flag of the US. It's best for our president BBM to just be neutral on this and think of the welfare and status of our country because we're not really in a good area where the US can send troops as soon as possible. This is one of the latest news that I've seen that the US + the Philippines have sent 17k troops to the South China Sea where the arbitral dispute has been hot like pancakes. Quote from: BADecker on March 24, 2023, 08:10:21 PMAmerica to expand military presence in the Philippines...And more US troop bases are about to be built in our country soon. I just wish that we won't be ending up in a war because China doesn't really like what's with it. Everyone knows that US and China aren't really in good terms with Biden's administration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "April 05, 2023, 06:15:24 PM",
      "body": "There have been 4 more EDCA sites that have been announced. Just for the sake of those that don't know what EDCA is, can refer to this (https://en.wikipedia.org/wiki/Enhanced_Defense_Cooperation_Agreement) or in short, an agreement for military exercises and forces of the US and the Philippines to join forces. And there have been mixed feelings on this, I've seen defense experts say that this is good and normal for the sake of patrolling our seas. But an international expert on foreign policy said that this could provoke China. While the past administration is like a friend to China and Russia and to everyone, our new admin and president are most likely in favor of having Uncle Sam on the back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvbcof",
      "created_time": "April 05, 2023, 08:12:38 PM",
      "body": "I'm not suggesting what anyone else should or should not do, but for my part I'm accelerating my belated plans to develop a 'third option' somewhere else in SE Asia and actively planning a relatively long scouting operation with the fam.  Finally I and my family can get back into the country without taking the lethal injection so this might be a brief window of opportunity before Marburg or Monkeypox or whatever Gates' WHO cooks up and distributes around for his \"next one.\"I've dropped a hell of a lot of money on The Philippines with property, building projects, businesses, and etc.  Too much to simply walk away from, and again, I like the people and the society and so on.  I plan to be away mainly when it is not safe to be here...and Chinese ballistic missiles raining down on the American (aka, Great Satan) guests would certainly create an unsafe condition.  As far as I can tell it would be completely within acceptable rules of war for China to bomb the place back to the stone age and/or perform a in-situ cleansing with boots on the ground if they and the U.S. get into a conflict assuming that The Philippines is actively hosting the U.S..It should be noted also that it is almost certain that any American ship within a few thousand miles will be at the bottom of the ocean within about 30 minutes of the start of a serious conflict.  Naval surface vessels are simply not able to be viable in today's state of technology.  Filipinos can hope that the Americans will swim 12,000 miles to defend their islands because they are such good friends of their 'little brown brothers', but I'm telling you it probably isn't going to happen.  Again, the horse-trading of the outcome vis-a-vis 'spheres of influence' would probably have been worked out before the first bullet goes down-range, and I highly doubt that it will be agreed upon to allow The Philippines to exist as 'Airstrip-II' even if the 5-eyes were inclined to put in even a modest effort to pull it off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvbcof",
      "created_time": "May 06, 2023, 06:00:16 PM",
      "body": "Here's something produced fairly recently about the situation.  Berletic is a pretty good analyst, and fairly up on SE Asian politics since he lives in Thailand.  I hate to link to Jewtube but it's all I can find.  About the 40:00 minute mark here:  https://www.youtube.com/watch?v=H6Br54YwwdgI personally agree with much of what these guys say, although the presenter, at least, seems to have rose-colored glasses about China.  I do not believe that at this point in time China does or should have any extraordinary claim over the resources of the so-called 'South China Sea'.  From the (relatively little) research I've done, I would say that straight mathematical and tectonic factors should define who derives the primary economic benefit of the resources found in the area...and China is a LONG way away.  Beyond that, the Filipino people really do need their resources...although they being within the territory of The Philippines, and their value accruing to the average people in any proportional way are two entirely different things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}