{
  "id": "topic_5434748",
  "title": "SatoPrincess",
  "author": "SatoPrincess",
  "created_time": "January 14, 2023, 09:02:18 PM",
  "content": "Quote from: https://www.theafricareport.com/240607/tesla-wants-to-mine-lithium-in-nigeria-what-are-the-hidden-costs/In August, Nigeria’s minister of mines and steel development, Olamilekan Adegbite, said the country had rejected Tesla Inc’s request to mine lithium, unless the company were to situate a battery-making factory in the West African nation. He said this is to retain value along the global processing chain of lithium.Lithium is expected to triple in demand by 2040, according to the World Bank. The price of a tonne of lithium jumped from about $6,000 in 2020 to over $78,000 in 2022. Lithium has so far been discovered in the northern states of Kogi, Nasarawa, Kwara and Plateau, as well as Oyo, Ekiti and Cross River in the south. I found this article interesting because it was news to me that we had lithium as a mineral resource in Nigeria. We are so focused on oil that we forget everything else that God has blessed us with. I know we have gold in the northern parts of the country but our leaders (whom are mostly Northerners) for some reason focus only the resources of the South (crude oil). Lithium is high in demand in the market, its utility can be compared to the fictional vibranium of Wakanda. I urge our leaders and our people not to make the same mistake we made with our oil sector. It’s no secret that we export crude oil and import the refined products because our refineries are not working therefore spending billions and trillions of naira. Foreign companies will come to take what is ours, Let’s not make the mistake Zimbabwe made. Quote from:  https://qz.com/why-zimbabwe-has-banned-the-export-of-raw-lithium-1849918099In 2015, it was estimated that Zimbabwe lost $12 billion through illegal trade involving multinational companies from rich countries in the mining sector. Such funds are enough to clear its foreign debt of $13.7 billion. Western companies have been accused of exploiting Africa’s lithium mines and leaving the countries poorer only to come back and sell them processed minerals in the form of smartphones, car batteries, and other rechargeable electronicsNigeria need to invest in local businesses, our mentality need to change from giving hair dryers, sewing machines as youth empowerment fund. Instead we should be looking to fund fintech companies and tech ideas that take us to another level. Imagine if the government create an enabling environment for those guys in computer village, those guys can make an android into apple, they do unspeakable things lol. I believe that if we can harness our resources to the full potential we would truly become the giant that we ought to be. Instead of completing turning down Musk’s offer, a better deal could have been struck maybe demanding Tesla cars to be manufactured here in Nigeria and the company would be required to have 70% of their staff to be Nigerians. What do you guys think?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5434748",
  "comments": [
    {
      "author": "Cryptomiles1",
      "created_time": "January 14, 2023, 11:59:52 PM",
      "body": "My Sister let me just tell you the Truth, we can deliberate this here but the important aspect of it is for government to implement it, sorry to say, in a way we have an illiterate as a leader what do you expect would come out of the country if I may asked?So I would rather focused than talking anything about our country because it seems to be audio talks and no one is hearing our cry does that make any meaning to us?Yes, Lithium is not the only good mineral sources we could find over the northern states but there were so many we could have from them but nothing is really happening whereas their leaders only focused on Oil, they forgotten that we haveCode:Kaolin Gemstones TalcGold BitumenRock Salt Bentonite and Baryte Coal Lead/ZincIron OreGypsum TalcWhy must it be only Oil?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "January 16, 2023, 11:30:43 AM",
      "body": "Quote from: SatoPrincess on January 14, 2023, 09:02:18 PMQuote from: https://www.theafricareport.com/240607/tesla-wants-to-mine-lithium-in-nigeria-what-are-the-hidden-costs/In August, Nigeria’s minister of mines and steel development, Olamilekan Adegbite, said the country had rejected Tesla Inc’s request to mine lithium, unless the company were to situate a battery-making factory in the West African nation. He said this is to retain value along the global processing chain of lithium.Lithium is expected to triple in demand by 2040, according to the World Bank. The price of a tonne of lithium jumped from about $6,000 in 2020 to over $78,000 in 2022. Lithium has so far been discovered in the northern states of Kogi, Nasarawa, Kwara and Plateau, as well as Oyo, Ekiti and Cross River in the south. I found this article interesting because it was news to me that we had lithium as a mineral resource in Nigeria. We are so focused on oil that we forget everything else that God has blessed us with. I know we have gold in the northern parts of the country but our leaders (whom are mostly Northerners) for some reason focus only the resources of the South (crude oil). Lithium is high in demand in the market, its utility can be compared to the fictional vibranium of Wakanda. I urge our leaders and our people not to make the same mistake we made with our oil sector. It’s no secret that we export crude oil and import the refined products because our refineries are not working therefore spending billions and trillions of naira. Foreign companies will come to take what is ours, Let’s not make the mistake Zimbabwe made. Quote from:  https://qz.com/why-zimbabwe-has-banned-the-export-of-raw-lithium-1849918099In 2015, it was estimated that Zimbabwe lost $12 billion through illegal trade involving multinational companies from rich countries in the mining sector. Such funds are enough to clear its foreign debt of $13.7 billion. Western companies have been accused of exploiting Africa’s lithium mines and leaving the countries poorer only to come back and sell them processed minerals in the form of smartphones, car batteries, and other rechargeable electronicsInstead of completing turning down Musk’s offer, a better deal could have been struck maybe demanding Tesla cars to be manufactured here in Nigeria and the company would be required to have 70% of their staff to be Nigerians. What do you guys think? I quite buy into the idea because if we look at it, it'd be another way of diversifying from exporting oil and entering something else. Looking at the price of lithium in 2020, and it's rise to $78k in 2022, there's a good chance of using such to offset debts and if it's considered, out youths would have more job opportunities to choose from. But, I doubt Elon Musk would follow through with some of the agreement since he can be a renegade sometimes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 16, 2023, 07:37:04 PM",
      "body": "Quote from: SatoPrincess on January 14, 2023, 09:02:18 PMWe are so focused on oil that we forget everything else that God has blessed us with. Lithium is high in demand in the market, its utility can be compared to the fictional vibranium of Wakanda. I think the Nigeria government are gradually turning their attention to the lithium discover and it's relevance. I find other articles released early last year 2022; How Nigeria can leverage lithium, others for improved earnings, green energy High-grade lithium discovered in Nigeria attracting investors – FGMining: Agency discloses discovery of high grade lithiumQuoteIt’s no secret that we export crude oil and import the refined products because our refineries are not working therefore spending billions and trillions of naira.It's unfair for a country like Nigeria to drill its crude oil, sell it to a foreign country for refining, and then buy back the refined products by so doing, they spend more than they would have earned if their refineries were working.In the aspect of the crude oil, Nigeria has the money to invest in the NNPC's refineries  to avoid the exportation of crude and the importation of refined products, but due to the cabals that are in charge of those processes, it becomes a business for them where they make their own millions of dollars, so it is hard for them to even think of stopping the process.I have a question @SatoPrincess: Imagine you are an overseer in the oil exploration sector, and on every export of crude oil, you make like $200,000, and on every import of refined products, you also make $200k; what will be your mindset at that time?\" Virtually, you will be like, \"Hmm, let this deal always continue, so I can be making my money.\"That's exactly what the cabals in charge of oil exploration are doing, and that's why they don't care if the refinaries works or not. I read an article last year on \"How Nigeria’s High Petrol Importation and Dead Refineries Affect its Struggling Economy.\"I felt bad for Nigeria after reading that article.From old data of 2015–2019, Nigeria's estimated daily petrol consumption was 65.7 million liters per day, of which if all the NNPC’s refineries work effectively, they can refine 66.36 million liters which is even more than enough of the 65.7 million litters daily consumption but yet, the government will not consider making their refinaries to be functional.QuoteInstead of completing turning down Musk’s offer, a better deal could have been struck maybe demanding Tesla cars to be manufactured here in Nigeria and the company would be required to have 70% of their staff to be Nigerians. What do you guys think?Hey OP, from your article, I see that the Nigerian minister of mines and steel development, with the name Olamilekan Adegbite, turned down the offer of Tesla CEO as he said,Quote from: https://www.theafricareport.com/240607/tesla-wants-to-mine-lithium-in-nigeria-what-are-the-hidden-costs/the country had rejected Tesla Inc’s request to mine lithium, unless the company were to situate a battery-making factory in the West African nation.He added, this is to retain value along the global processing chain of lithium.That was a good point to start with, followed by the comment of Olamilekan's special assistance who's name is Ayodeji Adeyemi. He said, QuoteThere is a new overarching policy that guides the mining of lithium. The Nigeria Mineral Value Chain Regulation aims to end the export of crude mineral ores from Nigeria and thus demands that miners add some value,”“As for lithium, it doesn’t necessarily mean investors must produce batteries here before they can mine, but some form of industrial processing of the ore is required,” he says.Mining of lithium can cause air pollution, disruption of the ecosystem, and some health risks to the communities and the miners; therefore, Tesla cannot just come to Nigeria, mine lithium, and export it; there should be an added value to the country through the mining process. That's not too much to ask, but I guess Elon has not agreed to the terms.You can see another article to why Nigeria turned down the Elon's offer.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "January 22, 2023, 03:31:57 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on January 16, 2023, 07:37:04 PMI have a question @SatoPrincess: Imagine you are an overseer in the oil exploration sector, and on every export of crude oil, you make like $200,000, and on every import of refined products, you also make $200k; what will be your mindset at that time?\" Virtually, you will be like, \"Hmm, let this deal always continue, so I can be making my money.\"That's exactly what the cabals in charge of oil exploration are doing, and that's why they don't care if the refinaries works or not. For a private company it is understandable that the owners may turn greedy and overlook the damage done on the country’s economy. In this case, it is being run by the government sworn to protect and serve, they have no patriotic character in them and run the country like a personal business. That is why the cabals whoever they may be will never let go of power, like wealthy businessmen groom their children in their trade to takeover the family business, our politicians are doing the same. The country affairs is a family business imo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 23, 2023, 10:40:24 PM",
      "body": "@Satoprincess there, This is not only in your opinion, because, categorically speaking, the country's economy is indeed being run like a family business. How can the people in charge decide to do things in any way that pleases them while cabals are just making decisions in their shackles? Nigeria is a great place, though, because despite the situation, the citizens are just trying to do their best. Let Pet Obi be voted in so that there will be a little turnaround in the country. I think he is young and vibrant enough to lead well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptoHeadlineNews",
      "created_time": "January 26, 2023, 09:57:01 PM",
      "body": "Quote from: SatoPrincess on January 14, 2023, 09:02:18 PMQuote from: https://www.theafricareport.com/240607/tesla-wants-to-mine-lithium-in-nigeria-what-are-the-hidden-costs/In August, Nigeria’s minister of mines and steel development, Olamilekan Adegbite, said the country had rejected Tesla Inc’s request to mine lithium, unless the company were to situate a battery-making factory in the West African nation. He said this is to retain value along the global processing chain of lithium.Lithium is expected to triple in demand by 2040, according to the World Bank. The price of a tonne of lithium jumped from about $6,000 in 2020 to over $78,000 in 2022. Lithium has so far been discovered in the northern states of Kogi, Nasarawa, Kwara and Plateau, as well as Oyo, Ekiti and Cross River in the south. That was a very nice move by the minister of mines and steel, and I'm happy he actually made a vital suggestion of which if accepted by Tesla motors, will create a massive job opportunities to people living in west Africa (Nigeria). And I must confess that Nigeria is the way it is today simply because we lack the right people at the right places (i.e visionary leaders) and not that we do not have the resources or what it takes to actually be the giant of Africa we are always known for. So I think now is the right time our government consider harnessing lithium, now that it's value at $78,000",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "January 26, 2023, 10:15:24 PM",
      "body": "This is interesting. Me sabi say plenty Chinese people dey forest for ogun state or one of those western states dey mine our gold for export. Some others dey Taraba state dey mine other of our resources dey carry go their country. So I dey a little surprise say Naija been turn down Telsa offer. I know say them day after out natural resources sha but good one from the people in charge, I guess our eyes don open and it is no longer business as usual.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptodebjoe",
      "created_time": "January 29, 2023, 09:47:05 PM",
      "body": "I only bemoan the fact that our government can't fix the power sector... If we can have steady power then we can Maje good use of this natural resources but as it stands it lays waste because industrialization isn't feasible without power so don't be surprised if another administration comes and accept the deal. We need visionary and selfless leadership",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}