{
  "id": "topic_5461113",
  "title": "bonfire66",
  "author": "bonfire66",
  "created_time": "July 26, 2023, 02:16:16 PM",
  "content": "Попытаюсь доказать свою точку зрения, используя исторические примеры и факты.          Факт первый, современный. Что делает прямо сейчас РФ? Принимает законы, позволяющие призывать как можно больше людей. Живой силы. Мяса. А что делает Украина? Правильно! Требует все больше и больше современной техники! Техники! А не людей. В этом и есть разница подходов к стратегии. РФ понимает, что современную технику, танки, самолеты – ей никто не продаст. Поэтому компенсирует отсутствие техники человечьим мясом. БОЛЬШЕ призывников! А вот Украина – наоборот! Она ценит свои людские ресурсы, и требует только технику. Почему так? А потому, что РФ умеет воевать только  за счет мяса. Логично?        Факт второй. Исторический. На рубеже 1930-40 гг. СССР имела САМУЮ Крутую (технически) армию мира. Только одних танков там было больше, чем во ВСЕХ остальных армиях мира вместе взятых. Гуглите цифры. Лениво гуглить – я приведу цифры по запросу. Приводил уже тут. И каков итог? Итог таков, что ВОВ СССР смогла только выиграть ЗА СЧЕТ немерянной помощи Америки и Британии в материальных ресурсах. Танках, самолетах, автомобилях, порохе, латуни, проводах, прицелах и станках. Расплатившись за это самыми большими потерями в людской силе среди всех остальных стран, участвующих в войне. Мясо в обмен на танки! Так символично, не так ли?   Мясные штурмы придумал не Суровикин (Кстати, где он? Уже больше месяца прошло как он исчез!). Главным адептом их на протяжении современной истории этой страны является военный преступник Маршал Жуков. Хотя, конечно, идея была тоже не его, но он довел ее до суперсовершенства. Про это даже фильм сняли. И не один. Например, фильм «Ржев»  2020 года. Или фильм «Ленинград» 2007 года. Или фильм «Зоя»...    Если Россия (СССР) начинала войну – то это государство старалось начинать ее ТОЛЬКО против слабого государства. Типа Финляндии, Японии, Ирана или Польшы и др. И зачастую эту войну проигрывало. А вот если нападали на Россию (СССР) –то обычно (без посторонней помощи) эта страна воииы проигрывала. Взять, например, 1-ю Мировую войну или 2-ю мировую войну. Не хватало мяса. Нужно было не 27 миллионов трупов, а 127 миллионов! Тогда может быть и смогли..    Если погуглить соотношение сил Россия(СССР) в разных войнах – см. Википедия. То.. цифры получаются удручающие. Если Россия (СССР) и выигрывала какую-то там локальную войну (например, вторжение в Иран в 1941 г.), то достигалось это конкретным перевесом в технике и войсках. Да и то, не всегда.    Однако пропаганда и так называемые «историки» НА ЗАРПЛАТЕ у власти ВСЕГДА вещали обратное. И НИ РАЗУ потом не понесли никаких наказаний. И не принесли НИКАКИХ извинений за искажения и перевирания Истории. Зато всегда получали звания, ордена и медали. И бабло от власти. Так было всегда, так есть сейчас, так и будет потом. Жаль....   Прикол в том, что никакой явной мобилизации не будет. Не потому, что ее не хотят проводить. Могли бы – уже давно провели бы! Проблема в том, что НЕЧЕМ вооружать солдат. Да, бронники, каски и форму можно купить в Китае. Но где купить автоматы, пушки, танки и самолеты? Нигде! А произвести тоже не получится в  достаточном количестве, ибо Путин уже давно (почти) умертвил всю промышленность и задавил ее проверками и налогами. Да и разворовал на взятках. Поэтому и не призывают массово никого. Потому что просто нет такой возможности! НЕ черенками же от лопат вооружать новобранцев? Возможно, скоро будет и такое. Не удивлюсь. Мясо – они и есть мясо с мозгами мяса. Все стерпит!   Так что все рассказы «историков» и пропаганды о (якобы) великих победах – это все брехня и пропаганда. В большинстве случаев. Потому что, обычно, забывают упомянуть, какой ценой была добыта та или иная победа. Ценой каких жизней или усилий или 100 кратного превосходства. Но ни разу это не было достигнуто в примерно равных условиях.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461113",
  "comments": [
    {
      "author": "be.open",
      "created_time": "July 26, 2023, 06:57:37 PM",
      "body": "Вот чё ты гонишь опять всякую нелепую хуйню? У России щас по всем признакам самая боеспособная армия в мире. Силы обороны Украины при активной поддержке НАТО сосут хуй у армии мирного времени, которая проводит ограниченную выездную спецоперацию силами контрактников, наёмников и добровольцев. Вот это - факт.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bonfire66",
      "created_time": "July 28, 2023, 10:54:55 AM",
      "body": "Будьте добры привести цифры расходов на вооружение. В доказательство ваших слов.А зачем тогда Россия расконсервирует танки Т55? Производства 1955 года? А где обещанные еще года три назад, выпускающиеся СЕРИЙНО, то есть, на конвейере, БОЕВЫЕ РОБОТЫ ШОЙГУ? Ведь кто-то тянул его за язык рассказать про \"боевых роботов\"? Или нет? НЕт, он сам признался. И подтвердил, что роботы уде вовсю выпускаются. Как и танки Армата. Серийно. Гуглите.Еще есть вопрсы? Прежде чем задавать новые вопрсы, сначала ответьте на вопрос про боевых роботов. Заранее спасибо за ответы, подтвержденные доказательствами.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "grosserK",
      "created_time": "November 03, 2023, 10:53:35 AM",
      "body": "Россия числом только может да и то не всегда. Сейчас наступает в нескольких направления, тупо теряет технику и народ сотнями. В обороне еще могут более менее стоять, а остальное ерунда и пропаганда. Техника старая со складов тащится. КНДР боеприпасы везут, так что в целом состояние хлипкое, НО рф держит в целом рубежи. Контрнаступление Украины провалилось, тут чисто позиционка настает аки в первую мировую.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "liebefreund",
      "created_time": "November 03, 2023, 10:56:28 AM",
      "body": "Quote from: be.open on July 26, 2023, 06:57:37 PMВот чё ты гонишь опять всякую нелепую хуйню? У России щас по всем признакам самая боеспособная армия в мире. Силы обороны Украины при активной поддержке НАТО сосут хуй у армии мирного времени, которая проводит ограниченную выездную спецоперацию силами контрактников, наёмников и добровольцев. Вот это - факт.С чего вдруг самая боеспособная? Вы из РИА вычитали это? Так там мурзилка написала про какую-то там боеспособность, мысли обычных людей и не аналитиков даже. Это как в \"тещином языке\" написать, что Киев через неделю заберут, брехня. По реальному факту те и те встали, тупик.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ivan1975",
      "created_time": "November 03, 2023, 03:48:13 PM",
      "body": "Думайте сами, читайте сами:https://www.usnews.com/news/best-countries/rankings/strong-militaryи выводы тоже ).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "antiark",
      "created_time": "November 06, 2023, 09:10:13 AM",
      "body": "Я не за РФ, но скажу как есть по факту - воевать они научились! В обороне хорошо стоят, сдержали контрнаступление в общем и целом. Учатся быстро! Не стоит не дооценивать их!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 06, 2023, 09:12:32 AM",
      "body": "Quote from: BAIROT on November 06, 2023, 08:44:28 AMТуфта, на деле надо сравнивать.Дык, полтора года уж на деле сравнивают на украинском полигоне с бесплатными запукрами.РФ vs вся НАТО.Нынешний результат: «Великий тупик Залужного» Quote from: BAIROT on November 06, 2023, 08:44:28 AMА лучше - НЕ НАДО.Надо, Вася, надо! (с)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letterman1",
      "created_time": "November 06, 2023, 09:27:07 AM",
      "body": "Quote from: Snork1979 on November 06, 2023, 09:12:32 AMQuote from: BAIROT on November 06, 2023, 08:44:28 AMТуфта, на деле надо сравнивать.Дык, полтора года уж на деле сравнивают на украинском полигоне с бесплатными запукрами.РФ vs вся НАТО.Нынешний результат: «Великий тупик Залужного» Quote from: BAIROT on November 06, 2023, 08:44:28 AMА лучше - НЕ НАДО.Надо, Вася, надо! (с)Зачем третью мировую то устраивать? Это же конец всем.А по НАТО, авианосцы и флот в целом всех стран НАТО участвуют? Авиация НАТО участвует? Весь контингент НАТО участвует? Ракеты и бомбы все калибров участвуют? Те же хаймарсы с дальнобойными ракетами долбят? Так что гнать то не надо, тут не РИА новости и не зэт каналы, в такую брехню не поверят",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 06, 2023, 09:33:37 AM",
      "body": "Quote from: letterman1 on November 06, 2023, 09:27:07 AMЗачем третью мировую то устраивать? Это же конец всем.Полностью в этом с тобой согласен.Нахуй это никому не нужно.И выход то простой и очевидный: прекратить военные поставки на Ураину.Как только это до муриканцев дойдёт - так за пару недель всё и закончится",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BAIROT",
      "created_time": "November 09, 2023, 08:52:55 AM",
      "body": "С февраля армия РФ набрала на контракт 300к с лишним и это не шутки, то ли еще будет. Так что Россия опасный соперник.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "krasavinivan",
      "created_time": "November 14, 2023, 07:56:13 AM",
      "body": "Quote from: Snork1979 on November 06, 2023, 09:33:37 AMQuote from: letterman1 on November 06, 2023, 09:27:07 AMЗачем третью мировую то устраивать? Это же конец всем.Полностью в этом с тобой согласен.Нахуй это никому не нужно.И выход то простой и очевидный: прекратить военные поставки на Ураину.Как только это до муриканцев дойдёт - так за пару недель всё и закончится С чего бы? Давай тебе по лицу дадут - ты отступишься и сдашься? Даже за свою честь не постоишь?)) Пусть россия уходит и будет всем счастье.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 14, 2023, 09:38:33 AM",
      "body": "Quote from: krasavinivan on November 14, 2023, 07:56:13 AMQuote from: Snork1979 on November 06, 2023, 09:33:37 AMИ выход то простой и очевидный: прекратить военные поставки на Ураину.Как только это до муриканцев дойдёт - так за пару недель всё и закончится С чего бы? Давай тебе по лицу дадут - ты отступишься и сдашься?С того, что без муриканских поставок оружия Украине «давать сдачу» тупо нечем.Очевидно же! Quote from: krasavinivan on November 14, 2023, 07:56:13 AMПусть россия уходит и будет всем счастье. Дык, РФ сейчас лишь продолжает зачищать от украинских оккупантов свои новые регионы, если ты не курсе.Делает это неторопливо и очень гуманно. Пока что.Как всех этих крыс из РФ прогонят поганой метлой - так и наступит всем счастье",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ManOftheWorld",
      "created_time": "November 14, 2023, 09:41:04 AM",
      "body": "Quote from: Snork1979 on November 14, 2023, 09:38:33 AMQuote from: krasavinivan on November 14, 2023, 07:56:13 AMQuote from: Snork1979 on November 06, 2023, 09:33:37 AMИ выход то простой и очевидный: прекратить военные поставки на Ураину.Как только это до муриканцев дойдёт - так за пару недель всё и закончится С чего бы? Давай тебе по лицу дадут - ты отступишься и сдашься?С того, что без муриканских поставок оружия Украине «давать сдачу» тупо нечем.Очевидно же! Quote from: krasavinivan on November 14, 2023, 07:56:13 AMПусть россия уходит и будет всем счастье. Дык, РФ сейчас лишь продолжает зачищать от украинских оккупантов свои новые регионы, если ты не курсе.Делает это неторопливо и очень гуманно. Пока что.Как всех этих крыс из РФ прогонят поганой метлой - так и наступит всем счастье Вы имели в виду оккупированные россией регионы? А у меня тоже сравнение есть одно интересное, сосед к вам придет домой, зайдет на кухню и скажет \"а это моя кухня теперь\", не красиво же получится, отдадите кухоньку и прекратите борьбу?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 14, 2023, 09:52:32 AM",
      "body": "Quote from: ManOftheWorld on November 14, 2023, 09:41:04 AMА у меня тоже сравнение есть одно интересное, сосед к вам придет домой, зайдет на кухню и скажет \"а это моя кухня теперь\", не красиво же получится, отдадите кухоньку и прекратите борьбу?Хреновая и хромающая на обе ноги у тебя аналогия получилась.Если у тебя на кухне коммунальной квартиры живут люди, которые решили (проголосовали), что не хотят больше делить свою кухню с алкашом-Васей и хотят жить вместе с нормальным соседом Ваней, то алкаш Вася с кухни должен съебаться.Ну, или, если он совсем тупой и «не согласен», то его с этой кухни выгонят поганой метлой.Что, собственно, сейчас и происходит",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JackyRyan",
      "created_time": "November 15, 2023, 08:11:50 AM",
      "body": "Ору с вас всех, что там пропаганда, что тут. Нужно по факту смотреть, а факт таков, что весь фронт стоит и русские потеряли часть приобретенных территорий.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "antiark",
      "created_time": "November 17, 2023, 09:26:18 AM",
      "body": "Мясом только умеют, на каждом участке подтягивают большие резервы. Под Работино точно также, как выбили их там так сразу 10-20к человек подтянули, народа же много в стране значит мясом много, это показывает то, как властям не жалко людей. Мало того ,что в чужую страну залезли так мясом еще закидывают. Тут враг не Украина, а кремль. Очнитесь ватные дебилы, включите мозг, критическое мышление и здравый смысл! Вас имеют, а вы рады этому.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 17, 2023, 11:53:00 PMLast edit: November 18, 2023, 02:22:55 AM by Snork1979",
      "body": "Quote from: antiark on November 17, 2023, 09:26:18 AMОчнитесь ватные дебилы, включите мозг, критическое мышление и здравый смысл! Вас имеют, а вы рады этому.… сказала очередная жертва Департамента Укропиздежа, которую имеют все, кому не лень Наш очередной вышиватник, ты ежели подискутировать хочешь, то нужно приводить хоть какие-то аргументы и фактуру в подтверждение своих высеров.Так у нормальных людей принято делать на форумах, понимаешь?А если всё, на что ты способен, это лишь визги «Всё будет Украина!», то тебе дальше по коридору до кабинета с надписью «психиатр». Тут тебе не помогут",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "leonello",
      "created_time": "November 18, 2023, 10:41:50 AM",
      "body": "Quote from: Snork1979 on November 17, 2023, 11:53:00 PMQuote from: antiark on November 17, 2023, 09:26:18 AMОчнитесь ватные дебилы, включите мозг, критическое мышление и здравый смысл! Вас имеют, а вы рады этому.… сказала очередная жертва Департамента Укропиздежа, которую имеют все, кому не лень Наш очередной вышиватник, ты ежели подискутировать хочешь, то нужно приводить хоть какие-то аргументы и фактуру в подтверждение своих высеров.Так у нормальных людей принято делать на форумах, понимаешь?А если всё, на что ты способен, это лишь визги «Всё будет Украина!», то тебе дальше по коридору до кабинета с надписью «психиатр». Тут тебе не помогут У кастрюль сейчас массово происходит столкновение с реальностью. Очень больно и неприятно, по этой причине их тут не видно. Однако самые отбитые и зомбированные телемарафонами испытывая последние приступы истерят еще сильнее  Не исключено что этой зимой экономика некрономика нэзалэжной сложится и громадяне начнут прозревать массово. Клоун вроде как уже ляпнул что без дотаций от рептилоидов платить бюджетникам нечего. Ну такая вот цена русофобского угара.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Snork1979",
      "created_time": "November 20, 2023, 02:49:56 AM",
      "body": "Quote from: leonello on November 18, 2023, 10:41:50 AMНе исключено что этой зимой экономика некрономика нэзалэжной сложится и громадяне начнут прозревать массово. Клоун вроде как уже ляпнул что без дотаций от рептилоидов платить бюджетникам нечего.Как я понял, клоун открыто сказал, что без дотаций запада ему придётся выбирать, кому платить - военным или бюджетникам?Соврал, конечно, как всегда.Без дотаций запада выбирать ему уже не придется.Просто нечем будет платить ни тем, ни другим Кстати, интересно будет тогда выяснить, сколько польских и прочих наемников в ВСУ \"идейные\" и готовы воевать за укро-наци даже без хорошей зарплаты? Quote from: leonello on November 18, 2023, 10:41:50 AMНу такая вот цена русофобского угара.После такого опьяняющего продолжительного угара обязательно будет сильное похмелье.И, похоже, что у кастрюль оно может наступить уже довольно скоро ))",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}