{
  "id": "topic_5440633",
  "title": "yhiaali3",
  "author": "yhiaali3",
  "created_time": "February 21, 2023, 02:08:09 AM",
  "content": "عمان تُعلن عن سعيها لوضع إطار تنظيمي للأصول الافتراضيةتتسارع وتيرة دخول الدول العربية وخاصة دول الخليج إلى مجال العملات المشفرةحيث تتطلع هيئة السوق المالية (CMA) ، وهي الجهة المنظمة للأسواق المالية في سلطنة عمان، إلى إنشاء إطار تنظيمي جديد لقطاع الأصول الافتراضية في السلطنة.ووفقا لبيان صحفي صدر في 14 فبراير: Quote\"الهدف من هذه اللائحة التنظيمية الجديدة هو إنشاء نظام متخصص بسوق الأصول الافتراضية، يشتمل على قوانين تعمل على منع إساءة استخدام السوق، بما في ذلك آليات المراقبة والتطبيق [الشاملة]\".طبعا البنك المركزي العماني غير سعيد بالخبر ويستمر في التحذير: Quoteوبينما تتطلع عمان لأن تجعل من نفسها رائدة في مجال تبني الأصول الافتراضية في الشرق الأوسط من خلال الإشراف التنظيمي المقترح، يتعامل البنك المركزي في البلاد بحذر شديد عندما يتعلق الأمر بالعملات المشفرة.ومع ذلك، فإن التحذير لم يمنع العمانيين من الاحتفاظ بالأصول والاستثمار فيها، فوفقاَ للمسح الذي أجراه Souq Analyst الأخير، يمتلك حوالي 65000 من المقيمين، أو 1.9٪ من السكان البالغين، عملاتاً مشفرةً في البلاد.وقد وجدت الدراسة أيضاً أن 62٪ من السكان المحليين يحتفظون بالعملات المشفرة للاستثمار طويل الأمد، وقال 25٪ إنهم يستخدمون الأصول الرقمية للتعلم والتعليم، بينما قال الباقون أنهم يستخدمون العملات المشفرة للتداول اليومي.هذه أول مرة أسمع فيها شيء عن وضع العملات المشفرة في عمان، طبعا لاتزال النسبة ضعيفة جدا لكن من الجيد أن نرى أن 62% من السكان يحتفظون بالعملات المشفرة للاستثمار البعيد. طبعا هذه القوانين التنظيمية بعد تنفيذها ستوفر الأرضية المناسبة للشركات والمنصات التي ترغب بالعمل في البلاد وأتوقع أن تبدأ الشركات بالتنافس للدخول إلى السوق العماني كونه لايزال سوق جديد وسيكون هناك العديد من الفرص. مصدر الخبر:  عمان تُعلن عن سعيها لوضع إطار تنظيمي للأصول الافتراضية",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440633",
  "comments": [
    {
      "author": "Kavelj22",
      "created_time": "February 21, 2023, 11:56:03 PMLast edit: February 26, 2023, 03:51:25 PM by Kavelj22",
      "body": "لقد كنت اتوقع ان تكون سلطنة عمان هي الدولة التالية في لائحة دول الخليج التي تتجه الى سياسات التبني و التعامل بمرونة اكثر مع تكنولوجيا الكريبتو. اقتصاديات دول الخليج متصلة بعضها ببعض و من الطبيعي ان تتاثر سياساتها بعضها ببعض.في البحرين كان اول المتحمسين للمنظومة الحديثة هو نزل اي في المجال السياحي و هذا سيسهل على الشركات العاملة بنفس المجال في بقية دول الخليج توجه سياساتها بنفس المسار.هذا و يظهر جليا ان العديد من منصات الخدمات قد فهمت ان السوق الخليجي مهم جدا و يمكن العمل عليه فيقدم نتائج افضل بكثير من باقي دول العالم بما ان المنطقة تشهد موجة انفتاح اقتصادي تتجه الى اقتصاد مفتوح بالاخص في مجال التكنولوجيات الحديثة و مشاريع التطوير التكنولوجي. من المرجح ان تكون السعودية هي المحطة القادمة خصوصا ان المملكة هي اكثر دولة تشهد موجة انفتاح كبير على جميع الأصعدة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 22, 2023, 01:35:43 AM",
      "body": "نعم أخي صحيح دول الخليج مرتبطة ببعضها البعض بحكم الموقع الجغرافي والتاريخي وكذلك الاتفاقيات والتسهيلات بين هذه الدول. لذلك من الطبيعي أن القرارات الاقتصادية في أي دولة ستؤثر على بقية الدول، يعني حتى لو قررت دولة خليجية منع كريبتو فلن تستطيع ذلك طويلا بحكم ارتباطها مع بقية دول الخليج التي أصبحت منفتحة بشكل كبير على كريبتو. هذه الأخبار المتسارعة التي أسمعها بشكل يومي تقريبا عن مشاريع كريبتو وقبول الدفع والتنظيم وما إلى ذلك تسعدني بالفعل. حتى أن هذا الاندفاع الكبير الأخير جعل الرئيس التنفيذي لبينانس CZ  يقول في تغريدة أن السوق الصاعدة القادمة ربما تبدأ من الشرق الأوسط وتحديدا دول الخليج بالطبع :Quoteأشار الرئيس التنفذي لبينانس، Changpeng Zhao، رداً على تغريدة من قبل الشريك المؤسس لبورصة جيميناي، Cameron Winklevoss، إلى أن السوق الصاعدة القادمة قد تبدأ من \"وسط الشرق\" المصدر كوينتلغراف",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "February 22, 2023, 05:29:12 PM",
      "body": "Quote from: yhiaali3 on February 22, 2023, 01:35:43 AM حتى أن هذا الاندفاع الكبير الأخير جعل الرئيس التنفيذي لبينانس CZ  يقول في تغريدة أن السوق الصاعدة القادمة ربما تبدأ من الشرق الأوسط وتحديدا دول الخليج بالطبع :Quoteأشار الرئيس التنفذي لبينانس، Changpeng Zhao، رداً على تغريدة من قبل الشريك المؤسس لبورصة جيميناي، Cameron Winklevoss، إلى أن السوق الصاعدة القادمة قد تبدأ من \"وسط الشرق\" المصدر كوينتلغراف  نعم أخي يحيى صراحة لدى هذه البلدان مجموعة كبيرة من الكبار المستثمرين المؤثرين فعلاً إذا قامت هذه الشخصيات و الشركات من الإستثمار في التشفير من خلال تأسيس صناديق التحوط و قبول الدفع بالبتكوين بكل تأكيد سيكون له تأثير كبير على نمو السوق و تغيير مسار سعر العملة المشفرة نحو قمم جديدة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}