{
  "id": "topic_5470879",
  "title": "zasad@",
  "author": "zasad@",
  "created_time": "October 19, 2023, 08:20:04 AM",
  "content": "https://www.reuters.com/business/finance/basel-proposes-crypto-disclosures-by-banks-january-2025-2023-10-17/\"Global banking regulators on Tuesday proposed a standardised format for major banks to disclose their holdings of cryptoassets from January 2025 to support \"market discipline\" by giving a complete picture to investors.The Basel Committee of banking regulators from the world's main financial centres agreed new rules last December on how much capital banks should hold to cover different types of cryptoassets. On Tuesday, they set out for public consultation how the holdings should be disclosed to investors.\"Under the proposals, banks would be required to disclose qualitative information on their activities related to cryptoassets and quantitative information on exposures to cryptoassets and the related capital and liquidity requirements,\" the Basel Committee said in a statement.Banks would also be required to provide details of the accounting classifications of their exposures to cryptoassets and crypto liabilities, it said.The public consultation ends on Jan. 31, 2024.\"___The simplest conclusion that follows from this is that cryptocurrency is not a scam and it will be used in the future.But if the global banking regulator gets down to business, then supervision of cryptocurrency will be serious in all countries, regardless of politics, relationships, etc.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5470879",
  "comments": [
    {
      "author": "albert0bsd",
      "created_time": "October 19, 2023, 01:02:42 PM",
      "body": "Quote from: zasad@ on October 19, 2023, 08:20:04 AMThe simplest conclusion that follows from this is that cryptocurrency is not a scam and it will be used in the future.Yes that is interesting, this mean that we as users need to keep bitcoin and other alt-coints out of any CEX and Bank. Just to not give them more power",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "October 19, 2023, 02:30:58 PM",
      "body": "That's fine! When common people is expected by the tax man to disclose their cripto earnings, why not banks! I mean everything should be transparent as the regulators say. Quote from: albert0bsd on October 19, 2023, 01:02:42 PMQuote from: zasad@ on October 19, 2023, 08:20:04 AMThe simplest conclusion that follows from this is that cryptocurrency is not a scam and it will be used in the future.Yes that is interesting, this mean that we as users need to keep bitcoin and other alt-coints out of any CEX and Bank. Just to not give them more powerThis is not really on the users. But it is more on the banks to disclose how much cryptocurrency assets they are holding as their investment. That is very fair!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "October 20, 2023, 09:01:05 AM",
      "body": "Good. This would both help further legitimize cryptocurrencies as well as make sure that the banking sector stays transparent while continuing to integrate cryptocurrency-related offerings. Let's see what comes of it though, given that it's only a proposal for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 20, 2023, 12:39:50 PM",
      "body": "Quote from: avikz on October 19, 2023, 02:30:58 PMThat's fine! When common people is expected by the tax man to disclose their cripto earnings, why not banks! I mean everything should be transparent as the regulators say. Quote from: albert0bsd on October 19, 2023, 01:02:42 PMQuote from: zasad@ on October 19, 2023, 08:20:04 AMThe simplest conclusion that follows from this is that cryptocurrency is not a scam and it will be used in the future.Yes that is interesting, this mean that we as users need to keep bitcoin and other alt-coints out of any CEX and Bank. Just to not give them more powerThis is not really on the users. But it is more on the banks to disclose how much cryptocurrency assets they are holding as their investment. That is very fair! In Russia, in almost any banking application you can open a brokerage account in 1 click and trade shares and other assets, and all taxes from each transaction are taken by the broker and submitted reports to the tax office. A citizen has no obstacles to trade.In Europe and the USA, I heard that a trader fills out complex forms for reporting to the tax authorities. In Russia, these forms are filled out by the broker for free.And banks will only be happy if the number of assets for trading in cryptocurrencies increases, but people will trade “air” because real assets belong to the bank.Look at the statistics. People understand that cryptocurrencies that are stored on custodial services do not belong to them, but they still use exchanges, banks and other custodial services for storage.I'm not talking about trading, I'm talking specifically about storage.People find it difficult or have no time to buy a hardware wallet for $50.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TravelMug",
      "created_time": "October 25, 2023, 11:01:44 AM",
      "body": "Quote from: HeRetiK on October 20, 2023, 09:01:05 AMGood. This would both help further legitimize cryptocurrencies as well as make sure that the banking sector stays transparent while continuing to integrate cryptocurrency-related offerings. Let's see what comes of it though, given that it's only a proposal for now.Yes, specially for banks, we really don't know how much assets they have (if they did) as far as crypto goes. At least with this proposal ordinary people will know it as they will become transparent on everything related to crypto.It's just a question whether they will opposed on this regulations.And it could go back and forth before they will agree on the the new rules. So let's see how it goes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "user210822",
      "created_time": "October 25, 2023, 12:37:55 PM",
      "body": "Quote from: zasad@ on October 20, 2023, 12:39:50 PM In Russia, in almost any banking application you can open a brokerage account in 1 click and trade shares and other assets, and all taxes from each transaction are taken by the broker and submitted reports to the tax office. A citizen has no obstacles to trade.In Europe and the USA, I heard that a trader fills out complex forms for reporting to the tax authorities. In Russia, these forms are filled out by the broker for free.And banks will only be happy if the number of assets for trading in cryptocurrencies increases, but people will trade “air” because real assets belong to the bank.Look at the statistics. People understand that cryptocurrencies that are stored on custodial services do not belong to them, but they still use exchanges, banks and other custodial services for storage.I'm not talking about trading, I'm talking specifically about storage.People find it difficult or have no time to buy a hardware wallet for $50.Let me get it strait! How exactly a person can understand that there is a lie on the blockchain? Is it possible to covert dirty transactions in blockchain? How transparency fails in case of blockchain? How easy it is to sponsor really BAD GUYS using blockchain?If anyone can answer me those questions than send this guy to SEC!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "October 25, 2023, 05:30:45 PM",
      "body": "Quote from: user210822 on October 25, 2023, 12:37:55 PMQuote from: zasad@ on October 20, 2023, 12:39:50 PM In Russia, in almost any banking application you can open a brokerage account in 1 click and trade shares and other assets, and all taxes from each transaction are taken by the broker and submitted reports to the tax office. A citizen has no obstacles to trade.In Europe and the USA, I heard that a trader fills out complex forms for reporting to the tax authorities. In Russia, these forms are filled out by the broker for free.And banks will only be happy if the number of assets for trading in cryptocurrencies increases, but people will trade “air” because real assets belong to the bank.Look at the statistics. People understand that cryptocurrencies that are stored on custodial services do not belong to them, but they still use exchanges, banks and other custodial services for storage.I'm not talking about trading, I'm talking specifically about storage.People find it difficult or have no time to buy a hardware wallet for $50.Let me get it strait! How exactly a person can understand that there is a lie on the blockchain? Is it possible to covert dirty transactions in blockchain? How transparency fails in case of blockchain? How easy it is to sponsor really BAD GUYS using blockchain?If anyone can answer me those questions than send this guy to SEC!This way, any user can receive dirty coins, and as soon as these coins arrive at any custodial service, they will be blocked.Cascodial services handle coin confiscation and should not be used if you want to be safe from loss or legal action.Or then work in accordance with the laws of your countries and buy coins on licensed exchanges for legal income.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}