{
  "id": "topic_5438729",
  "title": "Nwada001",
  "author": "Nwada001",
  "created_time": "February 08, 2023, 09:47:15 AM",
  "content": "Looking back at how I started on this forum, after registration I left the account for some months with the fear of what to post and what not to post, before I made a move and dropped my first question, which lots of DT members and others helped me clear my fear of, and since then I have been learning day after day in this forum without feeling reluctant about how to post, new technologies, the blockchain in general, and all that.Without much expectation, I was able to see my member rank, which I sometimes believe is difficult to achieve, but I achieved it by just being myself, just as I was advised to be.My first Signature My application was on my Junior Member rank, which I was accepted for, and the pay was supposed to be the project token, but due to not meeting the required post count and other circumstances, I missed the entire two weeks. My 2nd and my first Signature pay is  SellDefi  managed by @Royse777 which the campaign lasted for about 2 weeks, which I fully participated in, after my first week payment, which did not arrive on time but later did after I created a thread regarding a bitcoin deposit that had not arrived, and I learned a lot from the thread too. I am a Bitcoin holder, which I bought on different occasions and for different purposes, and which I am also holding in different wallets.  This is my first Bitcoin payment that I have received since learning about crypto. I have received other forms of crypto payment though. I'm just happy about this, and to me, it's worth celebrating.To some degree, I am still a newbie and my learning process is advancing to other levels, especially in the aspect of post quality improvement. @Royse777 never complained about it 😏, but within myself, I know I need to work a little more on these.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5438729",
  "comments": [
    {
      "author": "_act_",
      "created_time": "February 08, 2023, 10:14:39 AM",
      "body": "This is not about bitcoin, but about one if the members on this forum, which is you. Move this to reputation board.Nice to see your growing on this forum, this forum is not hard if you are consistent and ready to read and understand what others are posting. I hope you will rank up to full member and then next rank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "February 08, 2023, 01:06:49 PM",
      "body": "Quote from: _act_ on February 08, 2023, 10:14:39 AMThis is not about bitcoin, but about one if the members on this forum, which is you. Move this to reputation board.even for this, there is a better solution.BitcoinGirl.Club opened a useful thread where all users can share their \"achievements, self-praising and etc...\". with such a large number of users, the reason is more than obvious.Announce your rank up, merit or any achievements that makes you feel great!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Edwardard",
      "created_time": "February 08, 2023, 01:55:31 PM",
      "body": "Quote from: Nwada001 on February 08, 2023, 09:47:15 AM@Royse777 never complained about it 😏, but within myself, I know I need to work a little more on these. From your recent post history (in local board), I came to know that you are from Nigeria. Its very interesting to have a well english spoken guy from a third world country. Keep it up brother and I think you are not bad considering your rank. You got enough knowledge already to help others in the forum. Just need a bit of activity in the technical boards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "February 08, 2023, 02:55:55 PM",
      "body": "@Nwada001, Nigeria has spawned some great and best members lately in the forum, they have great experience in their respective fields, I'm also sure you can also follow in the footsteps of other members in the region of Nigeria in particular.I see you are so happy to earn from your first signature here.* What do you think and do next, after you succeed to get BTC.There is a saying for you:Never chase money, make it chase you.There are many things you can contribute to other members here with the knowledge you have, your success will determine yourself and get more Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "February 08, 2023, 03:32:19 PM",
      "body": "Thanks @Edwardard and @YOSHIE, for your kind words and encouragement. With the little knowledge that I have accumulated here, I have also been doing what I can to share it with new members here and outside the forum.Quote from: YOSHIE on February 08, 2023, 02:55:55 PMI see you are so happy to earn from your first signature here.* What do you think and do next, after you succeed to get BTC.There is a saying for you:Never chase money, make it chase you.will keep that in mind. And I believe hard work on the right track will trigger money to chase me. ☺️Quote from: examplens on February 08, 2023, 01:06:49 PMeven for this, there is a better solution.BitcoinGirl.Club opened a useful thread where all users can share their \"achievements, self-praising and etc...\". with such a large number of users, the reason is more than obvious.Announce your rank up, merit or any achievements that makes you feel great!Lesson well learned, and such a mistake won't happen next time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "February 08, 2023, 03:53:17 PM",
      "body": "Congratulations on your first payment when it comes to signature campaigns because it is certainly nice to combine participation in the forum through the acquisition of new knowledge with the possibility of earning something along the way.Quote from: Nwada001 on February 08, 2023, 03:32:19 PMLesson well learned, and such a mistake won't happen next time.When it comes to mistakes, I would like to draw your attention to one very serious thing that I noticed in Meta - and it is that you are accused of word spinning (plagiarism). As far as I can see, your post has been deleted, but you have not received any punishment (so far), and it seems that the moderators had mercy. I hope you will take advantage of this opportunity, because not everyone gets it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "February 08, 2023, 03:57:22 PM",
      "body": "I checked your posts and making about 137 posts in about 6 months is something that indicates that you do not try to spam, then continues learning.Just want to notify u that such posts and although you are trying to be proud of your achievements, it may put you on the ignore lists of many members, so post all your upcoming achievements This topic should be in an off-topic board.Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "White pawn",
      "created_time": "February 08, 2023, 04:02:38 PM",
      "body": "Quote from: Edwardard on February 08, 2023, 01:55:31 PMQuote from: Nwada001 on February 08, 2023, 09:47:15 AM@Royse777 never complained about it 😏, but within myself, I know I need to work a little more on these. From your recent post history (in local board), I came to know that you are from Nigeria. Its very interesting to have a well english spoken guy from a third world country. Keep it up brother and I think you are not bad considering your rank. You got enough knowledge already to help others in the forum. Just need a bit of activity in the technical boards It would be more interesting to you to know that there are loads of people from developing nations that are proficient in the use of written and spoken English despite the language being a second language. Besides the term “third world country” seems to be derogatory, don’t you think? I know you mean well(I hope you do).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "armanda90",
      "created_time": "February 08, 2023, 04:06:36 PM",
      "body": "Congrats with your first signature payment and becoming first time earning Bitcoin trough signature campaign, I don't think bad earned 0.00016 Bitcoin for two weeks active on signature campaign because your account level still member. I checked with your account post history seems good and you have potential one step close get Full Member level left 38 merit points.One thing about your statement with Bitcoin payment received delay because have busy transaction in Bitcoin blockchain and needed more than few hours for first confirmation and received in your wallet.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "February 08, 2023, 04:50:53 PM",
      "body": "Quote from: Lucius on February 08, 2023, 03:53:17 PMWhen it comes to mistakes, I would like to draw your attention to one very serious thing that I noticed in Meta - and it is that you are accused of word spinning (plagiarism). As far as I can see, your post has been deleted, but you have not received any punishment (so far), and it seems that the moderators had mercy. I hope you will take advantage of this opportunity, because not everyone gets it.I was not aware of this; thanks for bringing it to my attention. Don't even have anything to say to that accusation.Quote from: hugeblack on February 08, 2023, 03:57:22 PMThis topic should be in an off-topic board.Good luck.Thanks for all. This topic suggestion is just confusing to me; this is the 3rd suggestion as to where the perfect place for the post will be, and I don't know where it's best again. Quote from: armanda90 on February 08, 2023, 04:06:36 PMCongrats with your first signature payment and becoming first time earning Bitcoin trough signature campaign, I don't think bad earned 0.00016 Bitcoin for two weeks active on signature campaign because your account level still member. I checked with your account post history seems good and you have potential one step close get Full Member level left 38 merit points.It's 0.0016 BTC actually 😏Quote from: armanda90 on February 08, 2023, 04:06:36 PMOne thing about your statement with Bitcoin payment received delay because have busy transaction in Bitcoin blockchain and needed more than few hours for first confirmation and received in your wallet.Yes, that's what I learned from that thread. Lots of members explained reasons for the delay, which added a lot to my knowledge.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "February 08, 2023, 06:06:00 PM",
      "body": "Quote from: White pawn on February 08, 2023, 04:02:38 PMBesides the term “third world country” seems to be derogatory, don’t you think? I know you mean well(I hope you do). It is, and I'm not even sure which countries fall into that category anymore--but I can't say I haven't used the phrase myself, since it's useful in some cases.  I guess if your country's capitol doesn't have massive skyscrapers and a business district, it's a third world country.  Eh.OP, congrats on earning some bitcoin but are you using Coinomi for a wallet?  That's what it looks like, and I'd probably switch to Electrum if I were you and if you're going to keep it on your smartphone, use a strong password.  Those suckers can get stolen or lost in the blink of an eye, and then you're screwed if the person who ends up with it knows what he's doing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Little Mouse",
      "created_time": "February 08, 2023, 06:14:40 PM",
      "body": "Quote from: Edwardard on February 08, 2023, 01:55:31 PMFrom your recent post history (in local board), I came to know that you are from Nigeria. Its very interesting to have a well english spoken guy from a third world country.A very wrong statement. Did you compliment him or complaint?Is Russia or Japan or even China is 3rd world country? English isn't widely practiced there. I have talked with Japanese whose English was shit. I have talked with Russian who took more than 10 minutes to confirm that he was talking about \"catch\". English is a language only.Now, if you come to general discussion about English in Nigeria, you will be surprised. It's the official language there though used by the officials mostly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "February 08, 2023, 06:21:13 PM",
      "body": "Quote from: The Sceptical Chymist on February 08, 2023, 06:06:00 PMOP, congrats on earning some bitcoin but are you using Coinomi for a wallet?  That's what it looks like, and I'd probably switch to Electrum if I were you and if you're going to keep it on your smartphone, use a strong password.  Those suckers can get stolen or lost in the blink of an eye, and then you're screwed if the person who ends up with it knows what he's doing.I am using TrustWallet since it's a non-custodial wallet. But I created a thread a few days ago concerning how to create a safer offline wallet, which I have yet to achieve. Don't trust the trust wallet thou, after an argument with a friend who was trying to convince me that Binance has access and control over the users of trust wallet, but I doubt, but for the security reasons i still want to move out all my funds from there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saxydev",
      "created_time": "February 08, 2023, 09:42:48 PM",
      "body": "Congrats man.I am not a fan of any kind of paid posting, but this is a great way to make people joining and talking about bitcoin, spreading the word of SN. To many more payments and HODL, we are the elite!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "February 09, 2023, 04:23:30 AM",
      "body": "Quote from: Nwada001 on February 08, 2023, 09:47:15 AM... but within myself, I know I need to work a little more on these. Yes, it is good that this feeling inside you stays with you constantly, this will give you a strong incentive to work hard and try to progress constantly.I also felt afraid of the forum at the beginning. Frankly, the name of the forum is very large and infects beginners with fear and the feeling that they are nothing in front of the crypto giants present here in the forum, but with time and the member acting freely in his nature, this fear will automatically disappear and progress will begin in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rigon",
      "created_time": "February 09, 2023, 06:00:32 PM",
      "body": "Congratulations to you. After coming to the forum you wait for some time and then you start working and earning money. It is a matter of great joy. But slowly but surely you are progressing towards a full member. I think there will be no unethical act by you in the forum. You discover or discover something that will start a friendship here and last forever. Maybe the campaign you entered to work on has been closed for two weeks. Wait good keep posting next campaign actually apply there and if selected keep earning again thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LTU_btc",
      "created_time": "February 09, 2023, 09:07:09 PM",
      "body": "Congrats with your first earnings. It should be great feeling! I still remember my first earnings from signature campaign. Initially I didn't believed that someone can pay money for posting on forum. I realized that's real thing only after I got first BTC to my wallet.Quote from: Edwardard on February 08, 2023, 01:55:31 PMFrom your recent post history (in local board), I came to know that you are from Nigeria. Its very interesting to have a well english spoken guy from a third world country. English is widely used in Nigeria, it's official and most popular language there. So, maybe it's not so surprising that he have good English skills. And I think it's more like stereotype that people in so called third world countries don't speak English. Opposite, try to find someone talking decent English in France or Spain. Probably not easiest task.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "February 10, 2023, 04:41:22 PM",
      "body": "Quote from: Edwardard on February 08, 2023, 01:55:31 PMQuote from: Nwada001 on February 08, 2023, 09:47:15 AM@Royse777 never complained about it 😏, but within myself, I know I need to work a little more on these. From your recent post history (in local board), I came to know that you are from Nigeria. Its very interesting to have a well english spoken guy from a third world country. Keep it up brother and I think you are not bad considering your rank. You got enough knowledge already to help others in the forum. Just need a bit of activity in the technical boards Huh? Is it how you judge people or a country? Suppose I am from a poor country doesn't mean I am poor. I am from a rich country doesn't mean I am rich as well. A country like the USA has homeless people. A country like India has the richest entrepreneur in the world. It's not surprising if you see the next Elon musk from Nigeria. English is widely used in Nigeria. I am not surprised at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Asiska02",
      "created_time": "February 10, 2023, 05:33:36 PM",
      "body": "It's encouraging to see users like you, Nwada001, on the forum, working hard not to give up and become better. Your zeal and determination to improve here on the forum has brought you this far. I'm confident you can do better than this. This is an encouragement to other newbies in the forum not to give up and to try to learn, ask questions, and follow the forum's rules and regulations. Congratulations, Nwada001 on your first signature paid campaign, and I hope you achieve even more in the coming months on the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}