{
  "id": "topic_5476867",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "December 07, 2023, 06:53:43 AM",
  "content": "[the all caps is just to get attention, this is not a rant.]In case you missed the news, Ocean Mining ran by Jack Dorsey, luke-jr, Giacommo Zummo and some other folks are refusing to mine Samourai whirlpool transactions. But this thread is not about that. This thread is about this tweet:Why do people think that coordinators, mixers, coinjoin software, etc.  have something to hide?Would you sow anyone your bank account transactions just because they want to see? Is it any of their business?People are not taking their blockchain privacy seriously enough. It wasn't too long ago that FTX users' financials were exposed in a hack!(And follow me on X/Twitter )",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5476867",
  "comments": [
    {
      "author": "Mia Chloe",
      "created_time": "December 07, 2023, 06:59:51 AM",
      "body": "This is very interesting.alot of members come online and speak in support of privacy but only a few of them actually take it seriously.Most persons don't take it seriously because of lazinessSome have the feeling no harm can come to my fundsSome feel they are too careful for their privacy to leak outSome are reluctant to using privacy tools like Bitcoin and mixers because the government is against it.besides the average Joe always wants to please the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "vitya1982",
      "created_time": "December 07, 2023, 07:04:11 AM",
      "body": "People think that they have something to hide because most likely there is. It's just a low percentage. You never know who uses crypto and why. You can't deny that some criminals are using crypto, the number is just hyperbolized by the government.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 07, 2023, 07:05:59 AM",
      "body": "Quote from: vitya1982 on December 07, 2023, 07:04:11 AMPeople think that they have something to hide because most likely there is. It's just a low percentage. You never know who uses crypto and why. You can't deny that some criminals are using crypto, the number is just hyperbolized by the government.Samourai is a bitcoin wallet. You'd think that people who want to do illegal stuff would use mixers, not a bitcoin wallet with an obscure coordinator.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jrrsparkles",
      "created_time": "December 07, 2023, 07:09:05 AM",
      "body": "Privacy seems to be non achievable day by day due to a lot of factors but an average Joe who lives paycheck to paycheck doesn't take it seriously because even if someone finds their identity they have nothing to lose from there.Also, Ignorance and Influence lead to a myth that if someone is trying to hide something means it's related to illicit/unlawful activities among the people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2023, 07:56:21 AM",
      "body": "financial privacy is serious, but most people dont understand it. they just want the easy life to do as they please and think its their right that privacy should be a default right where people dont need to do anything to achieve financial privacycrypto has not been deemed private property for a decade now. we all suffer the consequences of crypto being classed as legal currency instead of private property, and the financial regulations that then apply due to itprivacy is achievable but requires people to do something about it.NotATether... the only bad thing about your tweet is that you use an analogy of a bank statement.. everyone knows banks mess with peoples accounts and stop suspicious transactions and send data to government",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "December 07, 2023, 08:16:00 AM",
      "body": "Since I'm neutral on this issue, I can only express this: \"Let them use it however they want.\" The fact that we see the right side of this issue always assumes that it has a lot to do with negativity, but it is not entirely true because it is clear that if the freedom to use any service tool is limited, it will lose the decentralization that is inherently a premise. So the key is balance here, I can agree to things that are limited but not forced because there will still be many cases of privacy that we want to exploit. And if this problem is always looked at from a negative perspective, then I think we should catch criminals first before preventing their actions from being committed later, like we are not capable of controlling someone, and we just want them to act in the way we think is right, but right/wrong is not a way to justify this issue, and actually I also think the core issue is morality in behavior use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "December 07, 2023, 08:20:11 AM",
      "body": "Quote from: franky1 on December 07, 2023, 07:56:21 AMcrypto has not been deemed private property for a decade now. we all suffer the consequences of crypto being classed as legal currency instead of private property, and the financial regulations that then apply due to itWhat do you say? As of today, only El Salvador and the Central African Republic have bitcoin as legal tender. In the rest of the countries it has been regulated as a financial asset.I don't see how you can conclude anything about privacy from that, which is false.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shield132",
      "created_time": "December 07, 2023, 08:46:19 AM",
      "body": "People don't care about privacy, as simple as ABC.Today you'll see people who post on their facebook when they eat, where they eat, with whom their eat. They also post other their activities, what they watch, where they plan to go. You can see that millions of people post that on public. Then there we have Instagram where people post their almost nude photos, some of them even post their nude photos and upload their private intimate lives. So, tell me why do you expect from people to take care of their privacy when they use bitcoin for making transactions? Majority of bitcoin users don't even use it for the purpose of getting rid of 3rd parties and improving privacy, they use it because it's a good and cool way to earn money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "December 07, 2023, 08:49:31 AM",
      "body": "Quote from: franky1 on December 07, 2023, 07:56:21 AMNotATether... the only bad thing about your tweet is that you use an analogy of a bank statement.. everyone knows banks mess with peoples accounts and stop suspicious transactions and send data to governmentThat is true and everyone does indeed know that.But what if your neighbor asked to see your bank transaction history? Or some guy on the street? Or the bartender or waiter who is serving you? Or the taxi driver? Or anonymous people on social media?Banks may have a business in inspecting your transaction history, because it is hosted on their infra, but random people don't have any business in looking at your financials.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "December 07, 2023, 09:00:30 AM",
      "body": "Imagine people calling you a criminal for not keeping your money in the bank, instead you choose to keep it in Bitcoin, the next question they will throw at your face is what do you have to hide? This is part of my own very story, it is easier for people to think that you have something you are hiding when you choose a different part, but I am very glad that Bitcoin transactions are very transparent.  This is why I don't talk ill about those who use mixers, not all of them are criminals and they have their tangible reasons for choosing to hide their transactions, I choose to get away from my government, I don't want the bank to know my real worth, I don't want them to monitor my life and finance, this was why I choose Bitcoin, but in the eye of the government, why wouldn't they believe that I have something to hide?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2023, 09:06:19 AM",
      "body": "Quote from: Don Pedro Dinero on December 07, 2023, 08:20:11 AMQuote from: franky1 on December 07, 2023, 07:56:21 AMcrypto has not been deemed private property for a decade now. we all suffer the consequences of crypto being classed as legal currency instead of private property, and the financial regulations that then apply due to itWhat do you say? As of today, only El Salvador and the Central African Republic have bitcoin as legal tender. In the rest of the countries it has been regulated as a financial asset.I don't see how you can conclude anything about privacy from that, which is false. legal tender and defined as currency mean two things.you also cant use a small countries example to attempt to debunk the US/EU regulationsfirst of all legal tender means that the country allows people to purchase goods and services in shops and pay taxes and debts with governmentsthis is completely different to defining crypto as a currency instead of private propertyfor instance if it was private property. then buying crypto would be the same as buying pokemon cards. a merchant serviceby being a currency a service selling crypto is a money service business..moving along from the US-EU defining bitcoin as currency a decade ago so that they can then regulate businesses using crypto.. more recently is the ping pong game of which regulator.. by sub defining cryptos as either an asset currency(SEC) or a commodity(CFTC)you really need to learn these things to then learn which regulators are getting involved in which types of businesses/services to then learn what stipulations policies are set up to then learn how to counter such policiesemphasis again legal tender is not the same situation as currencyEGall fiats are currencies.. euro, dollar but..in the US the dollar is legal tender but euro is notin the EU the euro is legal tender but euro is notEU recognise dollar as currency so EU currency laws apply to dollar. but EU legal tender laws do not apply to dollarUS recognise euro as currency so US currency laws apply to euro. but US legal tender laws do not apply to europrivate property is different then currencycurrency is different than legal tenderget it yet",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2023, 09:12:45 AM",
      "body": "Quote from: NotATether on December 07, 2023, 08:49:31 AMQuote from: franky1 on December 07, 2023, 07:56:21 AMNotATether... the only bad thing about your tweet is that you use an analogy of a bank statement.. everyone knows banks mess with peoples accounts and stop suspicious transactions and send data to governmentThat is true and everyone does indeed know that.But what if your neighbor asked to see your bank transaction history? Or some guy on the street? Or the bartender or waiter who is serving you? Or the taxi driver? Or anonymous people on social media?Banks may have a business in inspecting your transaction history, because it is hosted on their infra, but random people don't have any business in looking at your financials.bitcoin by default is a open public ledger...a better analogy would be car number/licence platesthey are all in public, people can see cars driving around displaying a number plate.you rent a new rental car each week.. the number plate does not reveal the drivers name. but if people are not careful other people can find ways to link a drivers name to a number plate via how they obtained the carso when you drive down the road pretending you are completely anonymous because your are is not displaying your name on the cars bumper. you then become ignorant and lazy about the ability for someone to just wait for you to park your car and ask you questions, or find which service the car came frompeople need to put effort into their privacy and not believe the whole anonymity by default pipe dream sold to themyes bitcoin does not request your ID. but your information can be found via other means. EGdid you know people trying to remain private in their car using blacked out windows are more likely to be stopped by the police and questioned as to why they have window tint.. sometimes trying to make yourself more private is what gets you noticed morebe smarter then that",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hewlet",
      "created_time": "December 07, 2023, 09:13:47 AM",
      "body": "Quote from: NotATether on December 07, 2023, 06:53:43 AMWould you sow anyone your bank account transactions just because they want to see? Is it any of their business?People are not taking their blockchain privacy seriously enough.  your privacy is very important and some people mistake being conscious of ones privacy to being unnecessarily secretive. The same way you take care of the funds in your normal banks and will never even allow a third party access to it or even their tell them how much you have in your account, it's what's expected of you as regarding your privacy in the bitcoin space.Their is a popular statement in my locality that you can't destroy what you don't have a knowledge about and this is very much applicable in this sense, you can't even think of hacking and sourcing after my private key if you don't even know that I'm a bitcoin holder, I becomes a serious carelessness on my part if I now allow you to know how much of bit on I am accumulating.Take your privacy seriously, if anything goes wrong, the highest people will do is to tell you \"sorry\" and that doesn't undo what has already been done.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lorence.xD",
      "created_time": "December 07, 2023, 09:16:50 AM",
      "body": "Quote from: shield132 on December 07, 2023, 08:46:19 AMPeople don't care about privacy, as simple as ABC.Today you'll see people who post on their facebook when they eat, where they eat, with whom their eat. They also post other their activities, what they watch, where they plan to go. You can see that millions of people post that on public. Then there we have Instagram where people post their almost nude photos, some of them even post their nude photos and upload their private intimate lives. So, tell me why do you expect from people to take care of their privacy when they use bitcoin for making transactions? Majority of bitcoin users don't even use it for the purpose of getting rid of 3rd parties and improving privacy, they use it because it's a good and cool way to earn money.People have the freedom to share what they want, but they have to choose what they share just for their privacy and for their safety. The thing is if you really want to be safe, you would literally take steps and action to avoid this kind of incident for example from what you said, sharing their food, what they eat, and with whom, you can share it in the social media after days or a week to avoid people to follow you.The thing is people nowadays can't live without validation from the public in social media since everything now runs on the internet so people love the attention they can get online even selling the private parts of their bodies. The thing is people now are used to sharing things online so even their Bitcoin transactions which they think are okay to share, of course not, that is one of the reasons why you can use Bitcoin anonymously to avoid being tracked. But from OP's post, it seems they are milking the issue if it's getting the target views or retweets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Plaguedeath",
      "created_time": "December 07, 2023, 09:23:50 AM",
      "body": "Most of people are in middle zone.If we use a scale from 0 to 100 in privacy level, they're in 40-60, it's not necessary they're in 0 where they will express everything they have to everyone else. So if I ask them, do you have any investment? they will answer yes. But when I ask how much money you have invested? most of them will refuse to answer it. The Average Joe only protect their identity against friend, acquaintance, and stranger. But they're being transparent when it comes to government, organization, company and family, that's why most people are hold their coins in centralized exchanges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 07, 2023, 09:39:41 AM",
      "body": "if you are driving alone but want to use a \"car pool\" lane. dont waste money on window tints because the vehicle checking cameras that count passengers in car pool lane will flag you. and send a message to transport police up the road to pull you over and ask you questions.. instead learn the rules of the road and stay in the appropriate lane to not highlight yourself. then you wont get pulled overi laugh when i see reels and shorts of people driving with window tints and arguing about why they get pulled over so much. learn what the investigators are on the look-out for and do the opposite to not get looked attrying to think the solution is to get every car to black out their windows in the hope investigators give up, wont work. the best option is to just become unnoticeable by looking like everyone else in public. dont stand out by using sophisticated crap. because in most cases these sophisticated crap is just a money earner for those promoting the sophisticated crap advertised as privacy, but ends up getting you on a watch listtake the bip47it pretends to be privacy. but ends up being watched and noticed more regularly than a standard legacy transactiontake mixersit pretends to be privacy. but ends up being watched and noticed more regularly than a standard legacy transaction",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ABCbits",
      "created_time": "December 07, 2023, 09:44:50 AM",
      "body": "Quote from: NotATether on December 07, 2023, 06:53:43 AMIn case you missed the news, Ocean Mining ran by Jack Dorsey, luke-jr, Giacommo Zummo and some other folks are refusing to mine Samourai whirlpool transactions. But this thread is not about that.If statement by Samourai Wallet is true, then it's irony knowing statement on their website.Quote from: https://ocean.xyz/aboutToday, pools operate like custodial bank accounts and have the ability to decide who can and who can't use Bitcoin. The so-called \"51%\" attack vector is already a reality because it only actually takes 20-30% of network hashrate to have a good probability of getting away with an attack.As for censorship, it is no longer a matter of actual resistance but merely if and when the pools choose to do it there are 11 entities who decide what transactions go in (or stay out) of almost every block, and simply the 2 largest can impose censorship on everyone else with 100% success. This is not some future risk but a present reality, and it's not sustainable if Bitcoin is to remain a permissionless currency. Quote from: NotATether on December 07, 2023, 06:53:43 AMWhy do people think that coordinators, mixers, coinjoin software, etc.  have something to hide?In addition, why having something to hide is perceived negatively?Quote from: NotATether on December 07, 2023, 06:53:43 AMWHY PEOPLE ARE NOT TAKING THEIR PRIVACY SERIOUSLY.I believe some people think they take privacy seriously. But IMO the real problem is they don't know privacy risks of using 3rd party or don't realize what information could be gained if someone were to collect all of information they made publicly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SquirrelJulietGarden",
      "created_time": "December 07, 2023, 10:14:30 AM",
      "body": "Quote from: NotATether on December 07, 2023, 06:53:43 AMWould you sow anyone your bank account transactions just because they want to see? Is it any of their business?People are not taking their blockchain privacy seriously enough. It wasn't too long ago that FTX users' financials were exposed in a hack!People are naively enough to think they don't have anything to hide. Especially newbies who can easily be scammed or give up any personal information around the Internet. They don't know that if they post anything on Internet, it is there forever and if it is thing related to privacy, it means their privacy lost forever.Many senior people even don't mind about privacy but whenever they realize awful mistakes they did in the past, it's too late to gain their privacy back. Because they can not simply summon all posts, documents back. They only can hope that nobody will dig into their past documents and try to make exploitation from what they found.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinremitter",
      "created_time": "December 07, 2023, 10:23:28 AM",
      "body": "Certainly, I understand the importance of addressing privacy concerns in the crypto community. It's crucial for individuals to realize that financial privacy is a fundamental right. Just as you wouldn't share your bank account transactions indiscriminately, it's wise to prioritize the confidentiality of your blockchain activities. Recent incidents, like the FTX hack, highlight the need for heightened privacy measures. Stay informed, use reliable privacy tools, and make conscious choices to protect your financial data.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}