{
  "id": "topic_5464484",
  "title": "Good_Doctor",
  "author": "Good_Doctor",
  "created_time": "August 24, 2023, 10:39:29 PMLast edit: August 25, 2023, 07:18:26 AM by Good_Doctor",
  "content": "Just as we have many misconceptions about so much verification process that we feel may compromise our financial privacy I think it's cool we see some of the benefits of having to verify so we can balance our understanding and know how and why it's important we do these verification while we're careful too when doing it. Verification of investors and users in an ecosystem is crucial for several reasons-1. **Protection from Fraud** Verification shields both investors/users and the Bitcoin ecosystem from fraudulent schemes. By confirming identities and conducting thorough checks, the ecosystem can promptly identify and prevent fake investors or malicious entities from engaging in scams, illegal transactions, or deceptive activities.2. **Regulatory Compliance** Verification ensures adherence to essential regulatory standards like anti-money laundering (AML) and Know Your Customer (KYC) requirements. Complying with these regulations not only safeguards investors but also establishes a transparent and secure framework for Bitcoin transactions.3. **Fostering Trust** Stringent verification processes foster trust among participants. When users perceive that the Bitcoin platform undertakes measures to authenticate participants, they gain confidence in their investment decisions and view the ecosystem as legitimate and reliable.4. **Risk Management** Verification strategies contribute to risk management within the Bitcoin ecosystem. By confirming the authenticity of investors and enforcing certain eligibility prerequisites, the potential for scams, money laundering, and illicit activities is significantly reduced. This in turn promotes a safer environment for all stakeholders.5. **Enhanced User Interaction** Verification facilitates improved user interaction. Accurate user data collection enables platforms to communicate more effectively, provide relevant updates, and tailor investment options to the specific preferences of verified Bitcoin investors.6. **Seamless Onboarding and Access** Verification is integral to the onboarding of investors into the Bitcoin ecosystem. It ensures that only eligible and credible individuals or entities can partake in Bitcoin transactions and access investment opportunities. This preserves the integrity of the ecosystem and prevents unauthorized or fraudulent entities from infiltrating.In conclusion, the verification of participants within the Bitcoin ecosystem is indispensable for ensuring security, regulatory compliance, user confidence, and the overall vitality and credibility of the cryptocurrency space. This practice cultivates an atmosphere of trustworthiness and transparency that ultimately benefits all stakeholders involved. Gaining knowledge about these verification practices equips us to detect potential risks and respond effectively when needed.I actually replied briefly to a post that raised alarm of users or investors personal privacy being intruded- https://bitcointalk.org/index.php?topic=5464196.msg62734176#msg62734176 ... So, this is a complete version of my reply which also I am sure is important of note by many others In all these it's good we go for knowledge so that we can decipher fictitious acts in the case of any and know how to respond at such times I hope this helps.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5464484",
  "comments": [
    {
      "author": "Z-tight",
      "created_time": "August 24, 2023, 11:05:39 PM",
      "body": "You kept on mentioning the \"BTC ecosystem\" in your post, so take note that using BTC in itself doesn't involve any verification, it is a permissonless and censorship resistant currency that you can use without any verification or permission whatsoever. The network is also trustless and secure, so you don't have to trust anyone or verify your identity before using BTC.Verification is for centralized crypto exchanges and services and not for BTC in itself, if you use centralized exchanges you'll have to comply with their kyc laws, but if you don't want data farms to harvest your personal information, use p2p exchanges and trade BTC in a safe, secure and private manner and then use self custody wallets to store or hold your coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Potato Chips",
      "created_time": "August 25, 2023, 12:20:51 AM",
      "body": "Identity verification is only on centralized services, not on bitcoin.Frankly, I don't see any benefit from verification. These are just the same crap CEx says to make KYC more palatable to their users.There are ways to bypass the system which has been going on for yearsDarknet hackers are selling crypto accounts for as low as $30 a popFor $200, You Can Trade Crypto With a Fake IDBinance support employees help customers in China bypass KYC.To put it simply, fraudsters get out with little to no damage by gaming the checks and the average users have to bear the weight of a possible data leaks/when exchanges share your data to who knows who.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "August 25, 2023, 01:06:51 AM",
      "body": "I mean, you tried. Your post content is good if we compare it to other newbies, you could have done the formatting better.Like you can use the  (Bold)  on the headings to make it look bold. And I like that you even added a conclusion to your post, helps in reading quicker.And now coming to the topic, KYC is an attack against Crypto or especially Bitcoin. Bitcoin was meant to be decentralized. I am totally against KYC and verification, only thing that should have it is Banks. And we are not a Bank.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richkiedx",
      "created_time": "August 25, 2023, 01:43:12 AM",
      "body": "To protect their account in to avoid the hacker",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "August 25, 2023, 02:35:28 AM",
      "body": "KYC is mentioned as a protective tool for cryptocurrency users against hackers and scammers but it fails to do that. In return, people who KYCed already lost their identity documents and they can still be scammed by projects, exchanges but there are worse things, their identity is leaked to those centralized exchanges and even can be leaked further. Dark markets will likely be destinations for those identity documents.Why KYC is extremely dangerous – and useless",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jawhead999",
      "created_time": "August 25, 2023, 03:01:17 AM",
      "body": "Verification is important for miner to confirm whether the transaction is valid or not, but verification is completely useless when it's related with centralized site. KYC can be faked, it can be edited, or it was someone else KYC. Let's say you KYC in many sites and there's a site suffer data breach, what do you think if there's a criminal use your identity?This scenario is similar like you're ordered a pizza with pineapple topping in Italy, the employee will retire after they hear your request.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "August 25, 2023, 03:41:49 AM",
      "body": "You're not talking about Bitcoin. You're talking about banks and the rest of the traditional financial institutions. Bitcoin doesn't discriminate. It offers a public system that is free for all. No screening, no censorship, no favoritism, no prioritization, etc. Bitcoin doesn't suspect. It accepts transactions coming from anybody. It's a completely neutral tool.  Verification doesn't seem to assure security, confidence, vitality, credibility. It doesn't cultivate an atmosphere of trustworthiness and transparency. On the contrary, it adds unnecessary risks. Asking and keeping people's personal information breeds lack of confidence, suspicion, and doubt. And the way these data are handled aren't transparent. If you insist on these, we shouldn't have made Bitcoin in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adaseb",
      "created_time": "August 25, 2023, 04:06:47 AM",
      "body": "KYC with exchanges was never a thing back in 2014 when I first started with crypto. It was when crypto gained popularity and attracted the governments attention and that is why many exchanges had to implement it. They say it’s to prevent money laundering but very small amounts are laundered thru crypto. For years I used bitfinex, poloniex, bittrex, Bitmex and KYC was never an issue. These days there is pretty much no exchange except defi which is KYC free.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cheezcarls",
      "created_time": "August 25, 2023, 04:55:40 AM",
      "body": "This is only applicable towards centralized exchanges and other platforms that are not decentralized at all. I only appreciate about the low fees of CEXs in terms of trading fees and has instant transactions.But what I do not like about centralized exchanges and other similar platforms is that we do not have the full custody of our funds. Despite that they will do their best to protect our funds via multiple layers like 2FA, Google Authenticator, biometrics or retina scan, recovery email, etc., the control of the funds isn’t really ours as they have the power to hold and freeze our funds anytime they want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "michellee",
      "created_time": "August 25, 2023, 06:39:57 AM",
      "body": "KYC verification is only required when you use exchanges, services, or payments. But if you don't use your Bitcoin and only keep it for the long term, you don't need KYC verification because you keep the Bitcoin without being used for other things.Bitcoin is decentralized where people don't have to reveal who owns the Bitcoin. And if you send Bitcoin from wallet to wallet, you also don't need to do KYC as long as it's not associated with a service provider.But even if you use a service from a third party that requires KYC verification, that doesn't guarantee that your data will be safe, especially if you do the KYC online. So be careful if you want to do KYC and make sure that the service provider can provide security in keeping customer data even though it can't be 100% safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "August 25, 2023, 10:09:23 AM",
      "body": "The OP is a law-abiding citizen who grew up on the laws written by the state, which in turn implies strict control, which means infringement on the freedoms of his citizens. Bitcoin was created for other purposes—exactly the opposite. The position seems to be correct from the banking system's side. Then, in turn, it can be assumed that you will trust all centralized exchanges, and therefore, since everything is so convenient and the laws come from the idea of protecting the user, how do you leave your funds on the exchanges?Are you ready to lose everything if the exchange wants to break down or just block your funds? Based on this, the more you provide your information, the more you become the most profitable target for various kinds of fraud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coinremitter",
      "created_time": "December 04, 2023, 09:02:37 AM",
      "body": "Absolutely, your comprehensive explanation on the importance of verification in the cryptocurrency space is spot on. It addresses key concerns and highlights the crucial role verification plays in safeguarding users, ensuring regulatory compliance, fostering trust, managing risks, and enhancing user interaction within the Bitcoin ecosystem. Your response to the privacy concerns is thoughtful, emphasizing the importance of knowledge in navigating potential risks. This well-rounded perspective contributes significantly to the community's understanding of the necessity of verification processes. Well done!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 04, 2023, 09:09:55 AM",
      "body": "for me KYC does not give customers 'trust' in the serviceregulated exchanges do NOT offer customers a insurance whereby if exchange went bankrupt, insolvent or charged, people can instantly be settled out and refunded.the KYC is to police customers to stop certain customers doing suspicious things. IF KYC was only used to sign people into a group insurance where they would get paid out within 14days of business insolvency. and KYC was only used for this consumer protection.. then great KYC would be a benefitbut exchanges do not use KYC for consumer protection. its used for consumer policinghopefully one day regulators will start to care more about consumer protection, not consumer policing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "December 04, 2023, 06:56:37 PM",
      "body": "The only reason I can say kyc verification is important in crypto is for global acceptance. The fact that kyc was introduced to cryptocurrency is not to benefit the crypto community or enhance the network. It is to satisfy the demand of the government authorities to be more crypto friendly.A technology that is decentralized by nature does not need a centralized platform to flourish. Users can interact just fine without any issues, but this goes against the control mechanism of the authorities.I highly doubt many crypto users are happy to go through the kyc process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "December 04, 2023, 07:19:45 PM",
      "body": "Quote from: Richkiedx on August 25, 2023, 01:43:12 AMTo protect their account in to avoid the hacker Verification into cryptocurrency is all about to prevent hackers, it about to know the difference between the real business people or the difference between customers and scammers, sometimes some people refused to showcase their identity because they doesn't want someone to know them, and sometimes the reason while KYC verification is been demanded is due to issues of you been sincere or not [trust] I believe that is what is the major reason while any platform that involves money do demand or request for a KYC, not only because of scammers but base on trust and been transparent in business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "December 04, 2023, 08:00:56 PM",
      "body": "Quote from: franky1 on December 04, 2023, 09:09:55 AM-snip-the KYC is to police customers to stop certain customers doing suspicious things. As with the practice of illegal money laundering transactions and the like, this is the basis for them to implement KYC, and it is also a recommendation from the government that they still have control.As is the case with the current Mixer Platform Service, which is the target of government operations to tackle illegal transactions that support crime. But in the end, there is no more privacy.Quote from: franky1 on December 04, 2023, 09:09:55 AMIF KYC was only used to sign people into a group insurance where they would get paid out within 14days of business insolvency. and KYC was only used for this consumer protection.. then great KYC would be a benefitbut exchanges do not use KYC for consumer protection. its used for consumer policingThe use of KYC as a Consumer Policy is for the benefit of the Exchange itself, and they do not only focus on one consumer, but several groups of consumers. If using Consumer protection, individually consumers will be guaranteed, it will burden the Exchange.Regarding consumer protection and policy, of course this is also related to SAFU, does SAFU really provide a solution when assets are lost, and will asset replacement be done in full?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "December 04, 2023, 09:41:29 PM",
      "body": "(1)Projects need to have faces...yes, they need to have recognized people, yes, but that does not prevent fraud.(2) once again, read the above, yes and no, the crypto ecosystem offers yes for those who want to stick to KYC and no, it is still possible, although the gap is closing more and more. It should be an option and obligation where legally applicable.(3) we did not get here with bitcoin precisely by doing KYC to anyone, trust prevails over what bitcoin means and the trust that individuals have in bitcoin, it is the bridge that achieved that trust between individuals, not individuals in itself, woa it is curious.(4)No, not really, it is something of all of the above, it is the architecture of bitcoin as a technology that has made trust grow, not individuals, is the trust of individuals for bitcoin.(5), so, what? (6)... loading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Latviand",
      "created_time": "December 04, 2023, 11:14:20 PM",
      "body": "Quote from: Bitstar_coin on December 04, 2023, 06:56:37 PMThe only reason I can say kyc verification is important in crypto is for global acceptance. The fact that kyc was introduced to cryptocurrency is not to benefit the crypto community or enhance the network. It is to satisfy the demand of the government authorities to be more crypto friendly.Such a sad thing that the crypto people have to compromise when it comes to this kind of stuff, unless we really want to fight the government I guess can we really start becoming independent from them and not having to comply with their demands but the way I see it, I don't think that the crypto community wants to fight for that freedom the crypto offers in terms of anonymity because a lot of us just wants to make money out of it, make good until it lasts right?Quote from: Bitstar_coin on December 04, 2023, 06:56:37 PMA technology that is decentralized by nature does not need a centralized platform to flourish. Users can interact just fine without any issues, but this goes against the control mechanism of the authorities.I highly doubt many crypto users are happy to go through the kyc process. Exactly but the problem of transaction fee is just too much for some people, imagine having to store your 100 USD worth of bitcoin and you have to sell it when the price are at its supposed peak and we all know that during this time, transaction fees are always going up because there's a lot of transactions going on and some wants to pay for the highest priority, now you with the 100 USD worth of bitcoin which has doubled want to sell because you're smart enough to know that it's good to take a profit now but when you see the transaction fees, you're probably with the original 100 USD or higher if you can wait for days to have your transaction processed. Centralized platform like Binance helps with that conversion so you can quickly go to a different stablecoin and sell that stablecoin in P2P marketplace.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "December 04, 2023, 11:34:26 PM",
      "body": "Quote from: Good_Doctor on August 24, 2023, 10:39:29 PMJust as we have many misconceptions about so much verification process that we feel may compromise our financial privacy I think it's cool we see some of the benefits of having to verify so we can balance our understanding and know how and why it's important we do these verification while we're careful too when doing it. I think you don't get the point about the actual reason why most people in the cryptocurrency space never like the idea of KYC verification and it's we never understand the advantages but people are concerned about the disadvantages.If the government cannot do something about the Big Brother tech company that's abusing the people's private information and also making billions every year through it there's no guarantee they will with ID verification information collected.Until the government introduces a decentralized blockchain for private data storage people will never trust their private information with them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}