{
  "id": "topic_5477104",
  "title": "bearinthewoods",
  "author": "bearinthewoods",
  "created_time": "December 08, 2023, 09:32:47 PM",
  "content": "Hey guys,I am a newbie to mining. I am tempted to make the jump to buy an Iceriver KS03M: https://asicmarketplace.com/product/iceriver-ks3m-kas-miner-6000gh/ and run it through a service in Norway for 0,10 euro per kW/h with a 25 euro per month rent.It would currently make 110 euro a day, so I would have an ROI of about 3 months. However, the block reward is going down every month and the difficulty rises. I am trying to make the math for the coming months but I am new to this so I am sure missing some things.By increasing the difficulty monthly based on the average increase of the last months, and entering the reduced block amount for every month+ the increased difficulty, keeping the 'exchange BTC' the same and keeping the fees the samen, now I get an ROI at 6 months.Do you guys think an ROI of 6 months is realistic?Would you advice in buying this miner now?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5477104",
  "comments": [
    {
      "author": "iKon_Mining",
      "created_time": "December 20, 2023, 01:52:50 PM",
      "body": "Hrmm... I have been chasing ROI on kaspa asics for 4 months now.. Meaning every month i have to by another asic to keep same profit margin this month here just a few days ago i bought 5 ks3 to try and get ahead of the curve so man if you going to get involved i would think bigger picture...Ya think the price would keep the growth down but nope people like me i guess are jsut dumping all there krypto assets or something to buy more of these asics wild stuff next month ill by another batch as well...All i can do i go further down the rabbit hole hahha",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "December 20, 2023, 02:50:00 PM",
      "body": "I wouldn't bother mining with a price of 0.10 euros per kWh and additional rent. Your competitors have a much lower price and the profit will fall as the coin hashrate increases. And also this ASIC cannot mine other coins. 3400W is a very high consumption for expensive electricity.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}