{
  "id": "topic_5413826",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "September 16, 2022, 11:41:24 PM",
  "content": "QuotePatagonia founder Yvon Chouinard, his spouse and two adult children are giving away their ownership in the apparel maker he started some 50 years ago.The company’s non-voting stock, worth close to $3 billion, will be owned by a collective that will use all profits that aren’t reinvested into the business to fight climate change.The company expects to contribute about $100 million a year, depending on the health of the business.Patagonia founder Yvon Chouinard, his spouse and two adult children are giving away their ownership in the apparel maker he started some 50 years ago, dedicating all profits from the company to projects and organizations that will protect wild land and biodiversity and fight the climate crisis.The company is worth about $3 billion, according to the New York Times.In a letter about the decision, published on the Patagonia website on Wednesday, Choiunard wrote of “reimagining capitalism,” and said:Quote“While we’re doing our best to address the environmental crisis, it’s not enough. We needed to find a way to put more money into fighting the crisis while keeping the company’s values intact. One option was to sell Patagonia and donate all the money. But we couldn’t be sure a new owner would maintain our values or keep our team of people around the world employed.Another path was to take the company public. What a disaster that would have been. Even public companies with good intentions are under too much pressure to create short-term gain at the expense of long-term vitality and responsibility.Truth be told, there were no good options available. So, we created our own.”The privately held company’s stock will now be owned by a climate-focused trust and group of nonprofit organizations, called the Patagonia Purpose Trust and the Holdfast Collective respectively, the company said in a statement, noting “every dollar that is not reinvested back into Patagonia will be distributed as dividends to protect the planet.”The trust will get all the voting stock, which is 2% of the total, and will use it to create a “more permanent legal structure to enshrine Patagonia’s purpose and values.” It will be overseen by members of the family and close advisors.The Holdfast Collective owns all the non-voting stock of Patagonia, which amounts to 98%.Patagonia expects to generate and donate about $100 million annually depending on the health of the business. The company now sells new and used outdoor apparel, gear for outdoor activities like camping, fishing and climbing, and food and beverages made from sustainable sources.As a certified B-Corp and California Benefit Corporation, Patagonia was already donating one percent of its sales each year to grassroots activists, and it intends to keep doing so. Fewer than 6,000 companies around the world are certified as B-Corp businesses. They have to meet strict environmental, social and governance standards and benchmarks set by B Labs to gain certification.Ryan Gellert will continue to serve as Patagonia’s CEO, and the Chouinard family will remain on Patagonia’s board following the apparel maker’s expanded philanthropic strategy. After informing its employees on Wednesday about this move, the company updated its website to state that “Earth is now our only shareholder.”https://www.cnbc.com/2022/09/14/patagonia-founder-donates-entire-company-to-fight-climate-change.html....Interesting news. I hope they publish regular updates on how estimated $100 million per year is used to address climate change.There was a similar case a few years ago, although climate change was not the reported motive.QuoteBillionaire Chuck Feeney has finally given away his entire $8 billion fortune after making secret donations for decadesAfter 38 years, Irish-American billionaire Chuck Feeney reached his lifetime goal of wanting to give away his entire $8 billion fortune.Feeney, who made his fortune after cofounding the retail giant Duty Free Shoppers, has been making secret donations to charities, universities, and institutions worldwide under his foundation, Atlantic Philanthropies, for decades.This week, the foundation — which was first set up in 1982 — officially ran out of money.Feeney, who is 89 years old and in poor health, signed the documents marking the end of Atlantic Philanthropies in a Zoom ceremony attended by his wife and the foundation's board members on Monday.Speaking from San Francisco, the former billionaire said he was very happy with \"completing this on my watch.\" \"We learned a lot. We would do some things differently, but I am very satisfied,\" Feeney, told Forbes. \"My thanks to all who joined us on this journey. And to those wondering about Giving While Living: Try it, you'll like it.\"Feeney also received letters of thanks from Microsoft founder Bill Gates and former California Gov. Jerry Brown, who praised him for his work.  House Speaker Nancy Pelosi also thanked the former billionaire on behalf of the US Congress.The 89-year-old told Forbes in 2012 that he had set aside around $2 million for his retirement plans but that he was hoping that he would lose the rest of his fortune before the end of his life.https://www.insider.com/billionaire-chuck-feeney-gives-away-entire-8-billion-fortune-2020-9On the opposite end of the get rich quick spectrum, we have some who are literally giving away their billion dollar empires.It is also known that Bill Gates and Warren Buffett have pledged their entire fortunes to charities and non profits when they die.It seems like an interesting trend. Could this become more common in the future?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413826",
  "comments": [
    {
      "author": "dothebeats",
      "created_time": "September 16, 2022, 11:49:52 PM",
      "body": "I think they have reached enlightenment that not everyone of us will ever experience. These guys already felt what it's like to own an excess beyond their imagination, and what are they even going to do with it when they die anyway if they already have some allotted money for their loved ones? They can't take it to the grave, nor there will be guarantees that it will be used for good once they are long gone, so why not do the giving while they are still around? They already made a dent in history and I think that's enough of a legacy for them to not want the billions they have earned over their lifetimes and just donate it for the greater good instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maus0728",
      "created_time": "September 17, 2022, 03:34:25 AM",
      "body": "I am pretty sure that this could increase demand for Patagonia brands. However, even while purchasing from them could help better the environment, we should also remember that given the way their brands encourage protecting the environment by means of recycling, you only need to buy things when you really need them. I mean that's also another way to reducing product waste that's align to their cause  But yeah, hoping that every capitalist is just as pure as Yvon when donating for a cause like this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "September 17, 2022, 03:54:36 AM",
      "body": "Quote from: dothebeats on September 16, 2022, 11:49:52 PMI think they have reached enlightenment that not everyone of us will ever experience. These guys already felt what it's like to own an excess beyond their imagination, and what are they even going to do with it when they die anyway if they already have some allotted money for their loved ones? They can't take it to the grave, nor there will be guarantees that it will be used for good once they are long gone, so why not do the giving while they are still around? They already made a dent in history and I think that's enough of a legacy for them to not want the billions they have earned over their lifetimes and just donate it for the greater good instead. Our environment is dying slowly due to economic activities that enrich a few sets of people, while the majority suffer the consequences. But of this these capitalists prefer to waste their riches on luxuries and extravagant lifestyles without considering their communities. It is really encouraging to see people donate to a just and important course like climate change. This pattern of giving back to the world is most rampant in the developed world where these billionaires have understood the vanity of wealth and life. They are aware that death brings an end to all these great wealth and achievements. Also, most of them are aware that keeping too much wealth for their children or relatives can sometimes be dangerous or counterproductive. But in some developing nations in Africa, greed, materialism and ceaseless thirst for wealth are still prevalent. The rich care less about the poor. Most of the medical and economic aid Africans receive is from Western billionaires, meanwhile, some African billionaires are richer than their Western counterparts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "so98nn",
      "created_time": "September 17, 2022, 08:26:44 AM",
      "body": "That is one of the best donation done until now. I mean giving away 50 years of owned company for the sake of climate change is huge thing. I am really not sure how they are going to contribute? Like news mentions they will donate the profits but how the money flows? Like they will contribute for the planting the trees or are they willing to save up forests or are they going to donate straight to the different trusts around the world. This is big step for the owners, I just hope Money goes into wel hands and we see big change with this donation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "$anounimus$",
      "created_time": "September 17, 2022, 09:00:27 AM",
      "body": "What sells better than solutions to climate change?  I don't know if this is the future of giving or just a one-off situation. It's encouraging to see more word spreading about the issue of climate change, and it makes good business sense too. Corporate culture is shifting ever so slightly towards sustainability, and people, in general, are becoming more attentive to their carbon footprint, If we can get companies that are major polluters to pay into a fund that stops greenhouse gas emissions, then I'd say it's quite a brilliant idea.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 17, 2022, 02:21:10 PM",
      "body": "Quote from: $anounimus$ on September 17, 2022, 09:00:27 AMWhat sells better than solutions to climate change?  That's right, and I think that many people play this very card in order to lighten their stained face, because they have participated in climate change in a negative sense all their lives. With so many benefactors donating their billions to the world, one would think that we would all be better off and that we would see some changes for the better, but the exact opposite is happening.Quote from: Hydrogen on September 16, 2022, 11:41:24 PMIt is also known that Bill Gates and Warren Buffett have pledged their entire fortunes to charities and non profits when they die.I also know that at least one of them will leave his children billions of dollars as an inheritance, and the rest should supposedly be donated, the only question is to whom and for what purposes. Many charities and non-profit organizations are just parasites that do nothing useful for the world around them. Therefore, if you want to do something good with all that wealth you have, then do it today, because it is extremely hypocritical to say \"wait until I die, then I will help you\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "September 18, 2022, 07:18:51 AM",
      "body": "I've never heard of Patagonia before. Looks like they're a U.S. company (HQ is in the U.S.)So hypothetically let's say that all funds of this climate trust group are all allocated to the U.S and factor in basic facts on the climate change debate.The U.S. produces 12-13% of cumulative global emissions. China, India, are among the other major polluters. China produces the most carbon emissions by far.Out of only 12-13% of emissions, transportation is the largest contributor of U.S. carbon emissions at 40% of total emissions. Other contributors are electricity production, agriculture, home heating/cooling.Take 100M USD of their estimated contributions and their impact on temperatures globally will be virtually...zero.This is what climate change activists don't understand. They think throwing money at the issue will somehow slow global temperature rise when the U.S and EU are the only countries at the forefront of the climate change revolution. It isn't enough.Take the money and give it to the Germans so they can set it on fire for heat this winter. It'll be put to better use.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obito",
      "created_time": "September 18, 2022, 07:23:39 AM",
      "body": "Quote from: Maus0728 on September 17, 2022, 03:34:25 AMBut yeah, hoping that every capitalist is just as pure as Yvon when donating for a cause like this one.You're wishfully thinking, I don't think that Yvon is a special case because I don't think that not every capitalist has the environment as the best interest in their mind, I mean we are still using coal for energy and we still don't have a permanent solution to plastics and other environmental concerns. Maybe if they fully used that 3 billion to better the world, it might really make a difference.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lucius",
      "created_time": "September 18, 2022, 10:16:36 AM",
      "body": "Quote from: Gyfts on September 18, 2022, 07:18:51 AMThis is what climate change activists don't understand. They think throwing money at the issue will somehow slow global temperature rise when the U.S and EU are the only countries at the forefront of the climate change revolution. It isn't enough.There are few of these activists who really fight for what they present publicly, and it is only important for them to make as much profit as possible in all this - because if in this particular case $100 million will be donated, the question is how much will be spent on salaries, bonuses, luxurious receptions for all those who will participate in it. Also, all those stories about the EU or the US fighting against climate change are more than ridiculous, because all those measures they talk about a lot would only make them uncompetitive on the global market if we know that China, Russia, and India, don't care for climate environment.Quote from: Gyfts on September 18, 2022, 07:18:51 AMTake the money and give it to the Germans so they can set it on fire for heat this winter. It'll be put to better use.I'm tired of reading and hearing every day that the Germans will freeze this winter (and they certainly won't), but if anyone made the EU dependent on Russian gas, it was them. The politics of Angela Merkel and various Germans who were in very close relations with Moscow (Schröder) bear a lot of the blame, of course with the addition of the impotent EU policy to see beyond its nose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "eaLiTy",
      "created_time": "September 18, 2022, 01:46:17 PM",
      "body": "Quote from: Hydrogen on September 16, 2022, 11:41:24 PM~On the opposite end of the get rich quick spectrum, we have some who are literally giving away their billion dollar empires.It is also known that Bill Gates and Warren Buffett have pledged their entire fortunes to charities and non profits when they die.Warren Buffet said he will be giving his money to Bill and Melinda foundation and obviously Bill Gates will be distributing that wealth to anyone he likes and that he is what he did by investing the foundation money in pharmaceutical companies and many other investment by their foundation in companies like Walmart, FedEx etc. I am yet to identify what real changes these foundations have made in improving the life of people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}