{
  "id": "topic_5430780",
  "title": "virginorange",
  "author": "virginorange",
  "created_time": "December 21, 2022, 09:59:21 AMLast edit: December 22, 2022, 09:15:46 AM by virginorange",
  "content": "3 Möglichkeiten Bitcoin zu kaufen:❶ zentrale regulierte Börsen (z.B. Binance, Kraken)❷ dezentrale Handelsplätze (z.B. Bisq, Localcryptos, Hodlhodl)❸ peer to peer außerhalb von HandelsplätzenIch habe alle 3 Möglichkeiten genutzt und mir nachfolgend Gedanken zu den Vor- und Nachteilen der 3 Möglichkeiten gemacht. Kosten (EUR pro Bitcoin inklusive Transaktionskosten)❶ Auf regulierten Börsen kostet Bitcoin den Marktpreis plus rund 0.2% (Transaktions- und Auszahlungsgebühren)❷ und ❸ Auf dezentralen Handelsplattformen liegt der Preis von Bitcoin i.d.R. etwas über dem Marktpreis auf zentralen Börsen. Bitcoin auf Bisq, die zuvor aus einer regulierten Börse stammen, kosten inklusive Handelsgebühren üblicherweise 4-5% über Marktpreis. Gleiches gilt für Bitcoin, die außerhalb von zentralen Handelsplätzen verkauft werden.➤ Fazit: Du zahlst außerhalb von zentralen Börsen einen Aufpreis für deine Bitcoin.Zeitaufwand Geschäftsbeziehung aufzubauenAn allen drei Orten ist der Zeitaufwand ähnlich hoch, aber erfordert unterschiedliche Tätigkeiten (ca. 10 Stunden)❶ Bürokratische Arbeit: Zentrale Börsen ermöglichen eine einfache Anmeldung. Wenn sie dich erst mal als Kunden gewonnen haben und dein Geld bereits eingezahlt hast, dann kommen sie hinterher mit zusätzlichen Anforderungen um die Ecke (z.B. KYC und Mittelherkunftsnachweise).  Kraken habe ich hier nicht so schwierig in Erinnerung.  Mit Binance hatte ich aber schon häufiger Probleme: ⓐ Abruf von Steuerunterlagen war problematisch mit unterschiedlichen Formaten, nur maximal 3 Abrufen mit maximal 90 Tagen Historie pro Tag, verschiedenen Abrufen für verschiedene Geschäfte, Einzahlungen, Auszahlungen. Es gab Formatbrüche im Zeitverlauf. ⓑ Beim Mittelherkunfsnachweis war das Uploadformular unpassend. Die Ablehnung erfolgte ohne Begründung. Es gab keine direkte Kommunikation mit dem Sachbearbeiter. ⓒ Binance wurde für einen gewissen Zeitraum die Bankverbindung gekündigt.  DIe Insolvenz von FTX führt nicht nur zu einem Verlust an Guthaben sondern auch an Daten für die Steuererklärung, wer diese nicht rechtzeitig abgerufen hat.➤ Fazit: eine zentrale Börse zu nutzen ist keineswegs der einfachste Ort Bitcoin zu kaufen. Man kommt leicht rein aber den Ärger hat man hinterher.❷ IT-Arbeit: Die meisten dezentralen Handelsplätze basieren auf einer Webseite die Käufer und Verkäufer zusammen bringt. Im Gegensatz zu einer Börse sammeln die dezentralen Handelspätze von dir weniger Daten und verwahren keine Bitcoin. Der Handel findet direkt zwischen Verkäufer und Käufer statt. Ein Teil deiner Daten bleibt jedoch zentral gespeichert. Bei Bisq bist du selbst Herr deiner Daten. Musst aber ⓐ eine Software herunterladen und solltest ⓑ die Signatur vor ⓒ Installation überprüfen. Wenn du sowieso schon dabei bist, kannst du alles (Bisq und Wallets) über Whonix laufen lassen, um wenig Daten zu hinterlassen. ❸ Kommunikations-Arbeit: Wenn du Bitcoin außerhalb einer Plattform kaufst, dann musst du natürlich erst mal einen ⓐ Verkäufer finden, ⓑ die Datails zum Handel und zum Settlement EUR gegen BTC klären, und ⓒ prüfen ob der Verkäufer vertrauenswürdig ist. Der Arbeitsaufwand liegt hier eher im reden mit Hilde [verschlüsselter] Email und Whatsapp/Signal. Ein gewisses Grundverständnis solltest du heir schon mitbringen. Zeitaufwand für das Kaufen von Bitcoin❶ Der Kauf allein kostet auf einer zentralen Börse nur 1 Minute. Vor dem Kauf musst du EUR auf die Börse überweisen (ca. 1 Tag) und deine Bitcoin auszahlen lassen (ca. 30 Minuten). Die Herkunft deiner Bitcoin musst du nicht überprüfen, da sie ja aus der zentralen Börse kommen.▶ Insgesamt 10 Minuten Arbeit und 1 Tag Warten.❷ Der Kauf selbst ist etwas langsamer z.B. 1-5 Minuten. Dadurch dass zügigere Überweisungsmethoden möglich sind (z.B. Revolut, SEPA Instant) gibt es weniger Wartezeit. Wenn du darauf acht gibst, Käufe von Bitcoin mit einer schlechten Historie zu vermeiden, musst du hier noch die Historie überprüfen und beim Verkäufer vermerken, damit du nach und nach weist welcher Verkäufer Bitcoin mit welcher Historie verkauft.▶ Insgesamt 10 Minuten Arbeit und 1 Stunde Warten. Plus 5-60 Minuten Arbeit die Historie nachzuvollziehen.❸ Der Kauf selber ist schnell. Du musst aber dem Verkäufer schon 1-2 Tage vorher Bescheid geben, damit er Geld an die zentrale Börse überweist. Beim Settlement (EUR gegen BTC) hast du mehrere Teilbeträge. Überweisung von Revolut auf SEPA (1 Minute), Überweisung der BTC (2 Minuten bis unconfirmed). Die Bitcoin kommen mit 1-2 Hopps aus der vereinbarten Quelle, eine Prüfung der Historie ist deswegen einfach. (2 Minuten).▶ Insgesamt 1 Stunde Arbeit und 1 Tag WartenKaufgröße❶ Zentrale Börsen bieten sehr flexible Kaufgrößen von 10€ bis 1 Mio. am Tag❷ Bisq hatte über die letzten zwei Jahre durchschnittlich 4 BTC am Tag umgesetzt. Obergrenze 50.000 EUR am Tag. Realistische Untergrenze 0.005 BTC pro Trade.❸ Mindestens 0.1 BTC pro Trade, und am besten 0.5 - 1 Bitcoin über einen Zeitraum von 1-2 Jahren. Sonst lohnt sich das für die Gegenpartei nicht. ▶ Über Bisq mit kleinen Volumina anfangen (100€ - 100.000€), bei größeren Volumina (5.000 EUR bis 100.000 EUR) ein paar direkte Handelspartner ergänzen. RisikenRisiken von Raub und Enteignung (weil Name, Adresse, Ausweis, Vermögensstand in einer zentralen Datenbank liegt, die regelmäßig gehacked & veröffentlicht wird)❶ Regulierte zentrale Börsen haben deine Daten in einer zentralen Datenbank, deswegen ▶ hohes Risiko. ❷ und ❸ weniger Daten die zudem noch dezentral (=weniger interessantes Ziel für Hacker) gespeichert sind, deswegen ▶  niedriges RisikoRegulatorisches Risiko (Staat denkt sich etwas aus, um Eigentümern mit schlechter Bitcoin Historie das Leben schwer zu machen)❶ und ❸ weil Bitcoin aus einer regulierten Börse stammen,  ▶ sehr geringes regulatorisches Risiko,❷ Bisq Trades sind klar auf der Blockchain erkennbar (2of2 Multisig, Timelock, statische Adresse für Handelsgebühren, Sicherheitsleistung). Andere Handelsplatfromen nutzen ebenfalls Escow-Wallets. Chain analysis kann dies erkennen und sieht den Kauf von Bitcion peer to peer oder auf wenig regulierten Börsen als (moderaten) Risikofaktor. Zusätzlich kommen die Bitcoin vor dem Kauf ggf. aus einer schlechten Quelle. Quelle   Anteil   (Urteil Chain Analysis)Mining 1-5%  (sehr gut)regulierte Börse 75%  (sehr gut)Hacks / Scam  5-10% (sehr schlecht)Coinjoin 5-10% (schlecht)Bisq / Gehalt, 10-15%  (mittel)Source: Meine eigenen Erfahrungen auf Bisq.▶ moderates regulatorisches Risiko, aber für Teilbestände sehr hohes regulatorisches Risiko Settlement Risiko (du bezahlst EUR, bekommst deine Bitcoin aber nicht)❶ Nach der Insolvenz von vielen zentralen Börsen, könnte man ein hohes Risiko vermuten. Wer sein Geld aber direkt nach dem Handel von der Börse abzieht, ist nur einen Tag im Risiko. Da müsste die Börse schon gerade zu diesem Zeitpunkt pleite gehen. ▶ Ausfallrisiko unter 0.1%❷ Das Ausfallrisiko bei der Handelsplattform Bisq liegt extrem niedrig, weil der Verkäufer die Bitcoin inklusive Sicherheitsleistung in die Multisig-Wallet einbezahlt. ▶ Ausfallrisiko unter 0.01%❸ Wer außerhalb von Handelsplätzen kauft und in Vorleistung EUR bezahlt, geht schon ein Risiko ein. Dieses Risiko kann durch verschiedene Sicherheitsvorkehrungen reduziert werden: ⓐ Verkäufer am richtigen Ort finden ⓑ Kommunikation ⓒ Aufspalten in mehrere kleine Settlement Beträge ⓓ langfristige Geschäftsbeziehung ⓔ erwarteter Gewinn aus der verbleibenden Geschäftsbeziehung mehr als ein Settlement Betrag. ▶ Ausfallrisiko unter 1% und fällt damit weniger ins Gewicht als die 4% Preisaufschlag beim Kauf. Fazit:➤ ❶ Zentrale Börsen sind nicht zu empfehlen. Das Risiko von Raub und Enteignung möchte ich auf jeden Fall vermeiden. ➤ ❷ Käufe auf Bisq sind empfehlenswert. Man findet schnell Angebote und die Verkäufer auf Bisq handeln ggf. auch außerhalb der Plattform mit dir. Das Downside ist, dass du teilweise schlechte Historien kaufst. Im schlimmsten Fall hast du in Zukunft einen Wertverlust auf deine Bitcoin mit schlechter Historie. Du solltest deswegen die UTXOs nicht mischen.  ➤ ❸ Käufer außerhalb schützender Handelsplattformen würde ich auch empfehlen. Ggü. Variante 2 verringerst du dein regulatorisches Risiko und erhöhst im Gegenzug dein Settlementrisiko.➤ Ich würde 1/2 bis 2/3 meiner Bitcoin über Bisq kaufen [= Variante ❷]  und 1/3 bis 1/2 außerhalb von Handelsprotokollen [Variante ❸]. Ich habe auf meine letzten Post viele qualitativ hochwertige Antworten erhalten. Diese Antworten fand ich oft überzeugend und konnte ich meinen anfänglichen Post dadurch verbessern.Ich würde also gerne wieder die klugen Gehirne hier im Forum anzapfen.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5430780",
  "comments": [
    {
      "author": "mr.relax",
      "created_time": "December 24, 2022, 11:56:30 AM",
      "body": "Es gibt weitere Möglichkeiten.zB am BTC-Automaten und in der Wechselstube.Beide Möglichkeiten sind in Deutschland relativ schlecht bis gar nicht vorhanden, in anderen Ländern aber schon.Ich hatte in Istanbul im Urlaub mir mal eine Wechselstube angesehen, die nahmen 2% Gebühr beim Tausch mit Bargeld. Das ist schon sehr gut.Auf Börsen ist zwar die Handelsgebühr meist um sie 0,2%, aber es gibt eine Withdraw und häufig auch DEpositgebühr.In den Boomzeiten von BTC lag alleine die Withdrawgebühr bei meist 25-50 Euro, das schlägt dann auf den Gebührenprozentsatz gut durch, so daß man besonders bei kleineren Beträgen eben doch mehr als die 0,2% zahlt.Realistisch auf Zentralen Börsen beim Kauf von unter 0.5BTC ist eher eine Reale Gebühr von 0.5-1%, dafür bekommt man aber auch einen meist guten Kurs.Zu beachten ist der Spread. Je kleiner die Börse, um so größer der Spread, man kauft also , wenn man ins Orderbuch zum Market kauft, ÜBER dem Mittelkurs.Dann gibts auch noch Retail-Reseller. Die bieten keine Börsenfunktion  mit eigener Preisfindung, sondern handeln auf eigene Rechnung und übernehmen die Kurse von echten Börsen(meist mit Aufschlag).Hier sind die Gebühren meist niedrig, aber die Kurse schlechter. Dafür klappt es einfacher und unkomplizierter.Will man Bargeld in BTC tauschen, bietet sich in Deutschland meist nur P2P an.P2P bei andren Zahlungsmethoden ist noch riskanter für mindestens einen der Handelspartner.P2P mit Cash ist erst mal auch nicht unriskant, und meist mit recht hohen Gebühren verbunden(Typischerweise um die 5-6%).Kennt man aber jemand persönlich, gibts vielleicht auch mal sehr günstige Möglichkeiten.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "December 26, 2022, 05:57:07 PM",
      "body": "Danke für die Einschätzungen. Ich bin zwar weiterhin bei dem Thema Historie/Fungibilität nicht ganz deiner Meinung, denke aber, dass zumindest allgemeine Hinweise auf mögliche Risiken dabei nicht schaden.Eine Sache, die ich nicht ganz verstehe:Quote from: virginorange on December 21, 2022, 09:59:21 AM❸ Der Kauf selber ist schnell. Du musst aber dem Verkäufer schon 1-2 Tage vorher Bescheid geben, damit er Geld an die zentrale Börse überweist. Beim Settlement (EUR gegen BTC) hast du mehrere Teilbeträge. Überweisung von Revolut auf SEPA (1 Minute), Überweisung der BTC (2 Minuten bis unconfirmed). Die Bitcoin kommen mit 1-2 Hopps aus der vereinbarten Quelle, eine Prüfung der Historie ist deswegen einfach. (2 Minuten).▶ Insgesamt 1 Stunde Arbeit und 1 Tag WartenHier geht es ja um P2P-Käufe außerhalb von Plattformen. Das scheint mir aber doch eine spezielle Methode zu sein. Hier mal das, was ich meine zu verstehen:1) Du machst mit dem Verkäufer eine zentrale Börse aus, die als Quelle für deine Bitcoins dienen soll (wohl damit eine \"gute Historie\" vereinbart wird).2) Der Verkäufer kauft dort Bitcoin (sonst verstehe ich das mit der Überweisung auf die Börse nicht).3) Nach 1-2 Hopps kommen die Coins zu dir, du überweist direkt an den Verkäufer. Aber warum unbedingt mit der Kombination Revolut / SEPA? Ist das z.B. bezüglich Privatsphäre / Sicherheit besser als eine einzelne Überweisung?Habe ich das richtig verstanden? Bzw. würdest du nur auf diese Weise Bitcoins außerhalb von Plattformen kaufen? Ist Schritt 2 wirklich notwendig? Der Käufer könnte ja auch Coins, die er woanders (andere Wallet) hat, auf die Börse transferieren, also ohne sie dort extra zu kaufen.Ich vermute mal das ist sozusagen auch ein Geschäftsmodell für Leute, die sowieso schon bei einer Börse KYCed sind, und somit an Käufer, die Wert auf eine makellose Historie legen, Bitcoins mit Aufpreis verkaufen können. Warum sollten sie sich sonst die ganze Mühe machen?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "planingkoala",
      "created_time": "January 03, 2023, 06:32:20 PM",
      "body": "@mr.relax: Entschuldigt / entschuldige mich bitte, dass ich mich in die Diskussion einmische, aber weißt Du zufällig, wie es im restlichen deutschsprachigen Raum, Tschechien, Polen und der Slowakei bezüglich der BTC-ATMs und der Wechselstuben aussieht? Vielen Dank vorab!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mr.relax",
      "created_time": "January 04, 2023, 11:28:16 AM",
      "body": "ATMs international findest Du ua hier: https://coinatmradar.com/Dort sind auch einige Verkaufsstuben gelistet.In der Türkei gibt es jedenfalls sehr viele.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virginorange",
      "created_time": "January 04, 2023, 02:33:33 PM",
      "body": "Quote from: d5000 on December 26, 2022, 05:57:07 PMAber warum unbedingt mit der Kombination Revolut / SEPA?Ich habe ein Girokonto (Gehalt, Bankkredite), davon gehen meine EUR auf die Amazon-Kreditkarte, von hier weiter zu Revolut und von dort aus an den Verkäufer.1) Geringes Risiko von Kontoverlust: Revolut hat keine Probleme mit dem Kauf von Bitcion. Und selbst wenn Revolut seine Politik ändern sollte, dann wäre der Verlust des Revolut-Kontos weniger schlimm als von meinem normalen Girokonto. 2) Kostenlos SEPA instant: Revolut zu SEPA ist sofort verfügbar und vereinfacht das Settlement. Alternative wäre SEPA Instant, aber das kostet Geld pro Überweisung. 3) Rabatt: 1000€ Einzahlung auf Revolut von der Kreditkarte kostet mich von Seiten Revolut nichts aber bringt mir Amazon-Punkte auf meiner Kreditkarte 0,5%.4) Liquidität: Kreditkarte muss ich erst am Monatsende ausgleichen.Quote from: d5000 on December 26, 2022, 05:57:07 PMHabe ich das richtig verstanden? Bzw. würdest du nur auf diese Weise Bitcoins außerhalb von Plattformen kaufen? Ist Schritt 2 wirklich notwendig? Der Käufer könnte ja auch Coins, die er woanders (andere Wallet) hat, auf die Börse transferieren, also ohne sie dort extra zu kaufen.Mir ist es persönlich egal, ob der Verkäufer Bitcion neu auf der Börse kauft oder bestehende Bestände verkauft. Aber der Verkäufer möchte ja sein Marktrisiko ggü. Bitcion beibehalten. Quote from: d5000 on December 26, 2022, 05:57:07 PMIch vermute mal das ist sozusagen auch ein Geschäftsmodell für Leute, die sowieso schon bei einer Börse KYCed sind, und somit an Käufer, die Wert auf eine makellose Historie legen, Bitcoins mit Aufpreis verkaufen können. Warum sollten sie sich sonst die ganze Mühe machen?Du kannst 0.2 BTC (3200€) zu 3% Aufpreis (ca. 96€) mit einer Stunde Arbeitsaufwand weiterverkaufen. Ist doch TOP. Geld mit Bitcoin ohne (Marktpreis)risiko.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mr.relax",
      "created_time": "January 06, 2023, 09:31:24 AMLast edit: January 06, 2023, 09:51:57 AM by mr.relax",
      "body": "Besonders \"toll\" ist dieses Geschäftsmodell, wenn sich nach einem halben Jahr herausstellt, daß das Konto, von dem die Überweisungen kamen einem Betrüger gehörte, der das Geld per Betrug erlangte.Damit bezahlte er bei dir BTC, und du hast dich damit der Geldwäsche strafbar gemacht, ohne daß dir das bewusst war.Vor allem, wenn der Betrüger nicht geschnappt wird, wird dir das Gericht einen Strick draus drehen.Du hast Dich nicht nur strafbar gemacht, sondern wirst zusätzlich uU den Schaden der Dritten auch noch ersetzen müssen, ganz abgesehen von der möglichen Geldstrafe, und den Gerichts und Anwaltskosten.Da kannst gar nicht so schnell schauen, wie das 5-stellig wird.Die Mühlen der polizeilichen Ermittlungen mahlen sehr langsam.Es kann also passieren, daß Du munter im Laufe der Monate richtig hohe Beträge gewechselt hast, bevor die erste Vorladung kommt.Rechne ausserdem mit Haftstrafe, falls man Dir gewerbsmässige Absicht unterstellt!!! Wenn Du erst mal in einem Strafverfahren wegen Geldwäsche als Angeklagter vor Gericht stehst, dann rechne nicht damit,daß das gut ausgeht. Nein, Du wirst vielleicht sogar mehr einräumen müssen als Du tatsächlich getan hast, um nicht noch höher bestraft zu werden.So etwas läuft heutzutage stets auf einen Deal raus, und der kann für Dich übel aussehen.Kann vor so einem Geschäftsmodell nur abraten. Aus eigener schlechter Erfahrung.Selbst wenn es gut geht, wie viel musst Du denn wechseln, damit ein annehmbarer Gewinn entsteht?Sagen wir 500 Euro im Monat Gewinn?das sind in einem Jahr also 6000 Gewinn, bei 3% Gewinnspanne ein Umsatz von 180000Euro.Kannst Du Dir nicht vorstellen, daß das deiner Bank vielleicht nicht so gefällt? Oder dem Finanzamt? Oder der Bafin?Die Bank ist sogar verpflichtet, eine Meldung wegen vermutlicher Geldwäsche zu machen und darf Dir das nicht mal erzählen.Kann natürlich auch gut gehen, aber ICH RATE ABSOLUT ZUR VORSICHT!!!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "d5000",
      "created_time": "January 06, 2023, 11:26:32 AM",
      "body": "Ja, vorsichtig müsste man bei einem solche Vorgehen sein - und für mich wäre es z.B. nix.Es gibt aber durchaus Möglichkeiten, sich da abzusichern. Beispielsweise, wenn man die Sache per Bisq abwickelt, darauf achten, dass der Geschäftspartner immer mit dem gleichen Zahlungskonto bezahlt und sein Konto mindestens 1-2 Monate alt ist und \"gesignt\" ist (also von einem Geschäftspartner per digitaler Signatur bestätigt wurde, dass es existiert und ein Handel durchgeführt wurde). Dann kann er nicht einfach so das Konto ändern.Die Wahrscheinlichkeit für den Betrugsfall \"gekapertes Konto\" sinkt damit schon deutlich, wenn vielleicht nicht auf Null, aber doch auf sehr tiefe Werte, da die meisten Menschen ein gekapertes Konto schnell melden werden und daher in der Regel die Betrüger nur Tage bis maximal ein paar Wochen haben.Es gibt natürlich auch andere Betrugformen, aber wenn der Betrüger mehrere Monate mit einem einzigen Konto operiert, ist das denke ich mal ziemlich ungünstig für ihn (bei jedem Einloggen und mit jeder Überweisung hinterlässt er eventuell Spuren, etc.).Ich glaube @virginorange ging es bei diesem Geschäftsmodell auch um längere Geschäftsbeziehungen, also jemand, der regelmäßig Coins mit guter Historie kaufen will, da ist dann die Chance, dass es sich um einen Betrüger handelt, eher gering.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sam00",
      "created_time": "January 06, 2023, 07:59:23 PM",
      "body": "Hier im Forum gab es auch schon mehrere Personen, die derartige Probleme bekommen haben, nachdem sie Überweisungen bekommen haben. Nichtsahnend wurde in diesen Fällen glaube ich auf Bitcoin.de gehandelt und wie aus dem Nichts kamen dann die ersten Schreiben der Polizei zuhause an...Meine ersten Bitcoins habe ich damals auch auf Bitcoin.de gekauft. Verkauft habe ich dort noch nichts und habe es auch nicht vor",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virginorange",
      "created_time": "January 11, 2023, 01:45:56 PM",
      "body": "Quote from: mr.relax on January 06, 2023, 09:31:24 AMRechne ausserdem mit Haftstrafe, falls man Dir gewerbsmässige Absicht unterstellt!!! Wenn Du erst mal in einem Strafverfahren wegen Geldwäsche als Angeklagter vor Gericht stehst, dann rechne nicht damit,daß das gut ausgeht. Nein, Du wirst vielleicht sogar mehr einräumen müssen als Du tatsächlich getan hast, um nicht noch höher bestraft zu werden.So etwas läuft heutzutage stets auf einen Deal raus, und der kann für Dich übel aussehen.Quote from: sam00 on January 06, 2023, 07:59:23 PMHier im Forum gab es auch schon mehrere Personen, die derartige Probleme bekommen haben, nachdem sie Überweisungen bekommen haben. Das hört sich nicht gut an.Ich selbst bin ja Käufer, aber durch diese Aussagen schätze ich die Dienstleistung meiner Verkäufer höher ein. Aber es gibt hier schon mehrere Verkäufer, die das gewerblich machen.Dadurch, dass ich die Geschäftsbeziehung über Jahre anstrebe, bin ich hoffentlich ein risikoarmer Kunde.Man könnte so eine Geschäftsbeziehung (Risikoarm für den Verkäufer von Bitcoin) auch langsam starten. Also 50€ im ersten Monat. 1000€ im sechsten Monat. 2000€ im 12. Monat. Und dann feuer frei.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chripto",
      "created_time": "January 15, 2023, 08:52:50 AM",
      "body": "Ich habe noch keinen Ledger, weil sich das für mich aktuell noch nicht lohnt. Ich nutze die BTC Kauffunktion von Scalable Capital und wollte da mal erfragen, wie die Meinungen dazu sind? Ist nur ein kleiner Klick auf Kauf und ich kann mir sicher sein, dass eine Bank alles für mich professionell regelt. Dafür zahle ich 1,9% im Jahr.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mr.relax",
      "created_time": "January 16, 2023, 07:31:15 AMLast edit: January 16, 2023, 07:55:12 AM by mr.relax",
      "body": "Wenn Du BTC kaufst und lässt das andere für dich aufbewahren, verpasst Du den größten Vorteil von Bitcoin: Die unabhängige Eigenkontrolle über seine Werte.Be your own Bank.Jeder Kauf oder Verkauf kostet Gebühren, ganz klar. Warum aber eine Aufbewahrung Gebühren kosten soll, verstehe ich nicht.Man braucht niemand der es für einen aufbewahrt und dann vielleicht pleite geht, oder einem vorschreibt ob man wofür wieviel wohin wann senden darf. Oder nicht.Und der darüber Buch führt an wen man was sendet. Wobei man BTC von SC gar nicht senden kann.Man wird also dort nur Eigentümer von Zertifikaten, nicht von BTC.Aber ich glaube, hier geht es um eine Trading Plattform. Gut davon gibt es unzählige, ohne jede Wertung.Wenn ich das richtig verstehe, kann man sich auf Scalable Capital gar keine  BTC auszahlen lassen. Man kann also gar keine echten BTC kaufen, nur (elektronische)BTC-Zertifikate, die BTC repräsentieren sollen.Diese Papiere sind nicht auf andere übertragbar.Wer auf so etwas steht, bitte, aber hier ging die Frage darum, wo man sich BTC kaufen kann.Ja, die \"Bank\" regelt das so professionell für Dich, daß sie dir nicht mal echte BTC verkauft.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "January 16, 2023, 10:44:28 AM",
      "body": "Quote from: Chripto on January 15, 2023, 08:52:50 AMIch habe noch keinen Ledger, weil sich das für mich aktuell noch nicht lohnt. Ich nutze die BTC Kauffunktion von Scalable Capital und wollte da mal erfragen, wie die Meinungen dazu sind? Ist nur ein kleiner Klick auf Kauf und ich kann mir sicher sein, dass eine Bank alles für mich professionell regelt. Dafür zahle ich 1,9% im Jahr. Zunächst einmal solltest du wissen, dass du bei Scalable Capital keine physischen Bitcoin kaufst, sondern ein Finanzprodukt: Nämlich einen Crypto-ETP. Weitere Infos, hier im Verkaufsprospekt (etwas scrollen, dann folgt die Erklärung).Diese bieten gegenüber einem Direktkauf von Bitcoin auf einer Handelsbörse (wie z.B. Kraken oder Binance) viele Nachteile, aber auch einige Vorteile. Dementsprechend muss man je nach Situation schauen, welcher Kauf mehr Sinn macht:Nachteile:laufende Gebühren für den ETPHandelszeiten der Börse (Wichtiger Punkt: Denn bei Scalable handelst du auf Gettex und Xetra. Diese sind am Wochenende geschlossen, d.h. ein Verkauf an einem Samstag oder Sonntag wird schwierig)Keine Steuerfreiheit nach einem Jahr Haltedauer, sondern pauschal 25% Kapitalertragssteuer + Soli + KircheEmittentenrisiko, die läufst Gefahr, dass der Herausgeber des ETPs Pleite geht - interessanterweise wäre dies bei einigen Scalable ETPs beim FTX-Crash fast passiert. Hier einmal ins Kleingedruckte schauen, wer die ETPs überhaupt herausgibtdu hältst keine physischen Bitcoin, sondern ein Finanzprodukt, dass an den Preis der jeweiligen Kryptowährung gekoppelt ist (wohl der wichtigste Punkt, wenn man Bitcoin nicht nur auf Profitgründen halten möchte, siehe vorheriger Post)Du kannst jederzeit von deinem Konto seitens der Bank ausgesperrt werden und kommst nicht mehr an deine Bitcoin dein FinanzproduktidR deutlich schlechtere Kurse als auf einer regulären Börse wie Kraken oder BinanceVorteile:Pauschale Besteuerung von 25% + Soli + Kirche, ermöglicht bei Haltedauer unter einem Jahr, ggf. eine günstigere Besteuerung als der reguläre SteuersatzEinfachheit. Gewohntes Scalable Interface. Bank verwahrt den ETP für dich. Kundensupport etc. (wohl der wichtigste Punkt für viele die auf Scalable kaufen)Daneben gibt es sicherlich noch einige weitere. Aber das ist das war mir auf den ersten Blick einfällt. Ich würde bei Haltezeiten größer als ein Jahr immer zu einem Direktkauf mit anschließender Verwahrung auf einer Paper- bzw. Hardware-Wallet raten. Nur in seltenen Fällen bei kürzerer Haltedauer und zur Steueroptimierung macht es Sinn Bitcoin-ETPs zu kaufen.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chripto",
      "created_time": "January 16, 2023, 11:09:12 AM",
      "body": "Verstehe mich bitte nicht falsch, wir reden hier über Peanuts zum Anfangen, um der FOMO gerecht zu werden  Ich wollte zunächst nur eine BTC Position, damit ich in meinen Finanzroutinen des Öfteren über den BTC \"stolpere\" und dran bleibe. Mein einziges Argument für SC war: Quote from: bullrun2020bro on January 16, 2023, 10:44:28 AMEinfachheit. Gewohntes Scalable Interface. Bank verwahrt den ETP für dich. Kundensupport etc. (wohl der wichtigste Punkt für viele die auf Scalable kaufen)Die Nachteile waren mir in Teilen bewusst, trotzdem ein dickes Dankeschön @bullrun2020bro für die klare Ansage. Mittlerweile ist der Ledger im Warenkorb und die Gier nach Coins groß genug",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bullrun2024bro",
      "created_time": "January 16, 2023, 11:20:06 AM",
      "body": "Quote from: Chripto on January 16, 2023, 11:09:12 AMVerstehe mich bitte nicht falsch, wir reden hier über Peanuts zum Anfangen, um der FOMO gerecht zu werden  Ich wollte zunächst nur eine BTC Position, damit ich in meinen Finanzroutinen des Öfteren über den BTC \"stolpere\" und dran bleibe.Und genau diese Einfachheit finde ich bei Plattformen wie Scalable auch sehr gelungen. Man handelt dort sowieso Aktien und ETFs und hat so die Möglichkeit als blutiger Anfänger (!) ersten Kontakt mit \"Bitcoin\" zu sammeln. Wenn man dann tiefer in die Materie einsteigt, merkt man schnell, dass es aber noch viel bessere Möglichkeiten gibt Bitcoin zu kaufen (und das Prinzip \"Be your own Bank\" wirklich aufleben zu lassen). Viele wagen erst dann den Schritt auf eine richtige Kryptobörse.Dementsprechend haben Plattformen wie Scalable, die hier im Forum zurecht oft für ihr Krypto-Angebot kritisiert werden, mMn nicht nur schlechtes. Neulinge erhalten so eine Möglichkeit unkompliziert zu starten, auch wenn man am Anfang noch keine \"richtigen\" Bitcoin kauft.Quote from: Chripto on January 16, 2023, 11:09:12 AMDie Nachteile waren mir in Teilen bewusst, trotzdem ein dickes Dankeschön @bullrun2020bro für die klare Ansage. Mittlerweile ist der Ledger im Warenkorb und die Gier nach Coins groß genug   Super! Sehr gerne. Und toll, dass du dich hier so aktiv beteiligst. Herzliches Willkommen auch noch einmal von meiner Seite. Unser deutschsprachiges Board kann aktive Mitglieder immer gut gebrauchen. Am Anfang mögen viele Dinge hier noch kompliziert und unübersichtlich erscheinen, aber das legt sich mit der Zeit. Viel Erfolg!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chripto",
      "created_time": "January 16, 2023, 11:34:49 AM",
      "body": "Quote from: bullrun2020bro on January 16, 2023, 11:20:06 AMUnd genau diese Einfachheit finde ich bei Plattformen wie Scalable auch sehr gelungen. Man handelt dort sowieso Aktien und ETFs und hat so die Möglichkeit als blutiger Anfänger (!) ersten Kontakt mit \"Bitcoin\" zu sammeln. Wenn man dann tiefer in die Materie einsteigt, merkt man schnell, dass es aber noch viel bessere Möglichkeiten gibt Bitcoin zu kaufen (und das Prinzip \"Be your own Bank\" wirklich aufleben zu lassen). Viele wagen erst dann den Schritt auf eine richtige Kryptobörse.Dementsprechend haben Plattformen wie Scalable, die hier im Forum zurecht oft für ihr Krypto-Angebot kritisiert werden, mMn nicht nur schlechtes. Neulinge erhalten so eine Möglichkeit unkompliziert zu starten, auch wenn man am Anfang noch keine \"richtigen\" Bitcoin kauft.Absolut wichtiger Punkt, gerade wenn man sich aus seiner Bubble heraus bewegt und erkennt, wie scheu der \"konservative\" Investorfreund bzgl. BTC ist. Allerdings muss man schon sagen, dass die jährliche Gebühr von fast 2% an aktive Fonds aus den 1990ern erinnert und sich jeder Rechtfertigung entzieht. Außerdem finde ich den Punkt valide, dass auf diesem Wege wirklich nur \"blind\" in BTC investiert wird ohne den Sinn des Produktes wirklich zu verstehen. Quote from: bullrun2020bro on January 16, 2023, 11:20:06 AMSuper! Sehr gerne. Und toll, dass du dich hier so aktiv beteiligst. Herzliches Willkommen auch noch einmal von meiner Seite. Unser deutschsprachiges Board kann aktive Mitglieder immer gut gebrauchen. Am Anfang mögen viele Dinge hier noch kompliziert und unübersichtlich erscheinen, aber das legt sich mit der Zeit. Viel Erfolg! Danke sehr  bisher kämpfe ich tatsächlich am meisten mit der Search Funktion in diesem Forum, die offensichtlich gebugged ist (hoffe ich zumindest, ansonsten gebe ich meinen Schulabschluss zurück   )",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "January 16, 2023, 02:19:51 PM",
      "body": "Quote from: virginorange on January 04, 2023, 02:33:33 PMQuote from: d5000 on December 26, 2022, 05:57:07 PMAber warum unbedingt mit der Kombination Revolut / SEPA?Ich habe ein Girokonto (Gehalt, Bankkredite), davon gehen meine EUR auf die Amazon-Kreditkarte, von hier weiter zu Revolut und von dort aus an den Verkäufer.1) Geringes Risiko von Kontoverlust: Revolut hat keine Probleme mit dem Kauf von Bitcion. Und selbst wenn Revolut seine Politik ändern sollte, dann wäre der Verlust des Revolut-Kontos weniger schlimm als von meinem normalen Girokonto. Nachvollziehbar. Gehst du den umgekehrten Weg auch? Falls ja, denke ich dass bei großen ankommeneden Summen auf dein Girokonto die Bank irgendwann nachfragen könnte, woher das ganze Geld stammt.------------Zu Bisq: Das Prinzip finde ich super. Allerdings finde ich den größten Nachteil, dass man sein IBAN preisgeben und damit immer einen kleinen Teil seiner persönlichen Daten.---------------Quote from: Chripto on January 16, 2023, 11:34:49 AMDanke sehr  bisher kämpfe ich tatsächlich am meisten mit der Search Funktion in diesem Forum, die offensichtlich gebugged ist (hoffe ich zumindest, ansonsten gebe ich meinen Schulabschluss zurück   )Die Such Funktion ist so wie sie ist.   Am besten direkt über eine Suchmaschine auf bitcointalk suchen. Das geht meistens schneller.Ansonsten scheinst du schon auf dem richtigen Weg zu sein um oranged pilled zu sein.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "1miau",
      "created_time": "January 16, 2023, 10:04:09 PM",
      "body": "Früher oder später könnte es schon möglich sein, dass Scalable Capital anbietet, die \"Papier-Bitcoins\" in echte Bitcoins umzutauschen, damit man sie von seinem Scalable Capital Account zur eigenen Bitcoin-Brieftasche zu senden. Wenn das die Konkurrenz anbietet, wäre das zumindest ein plausibler Schritt, wenn sie keine Marktanteile verlieren wollen.   Vermutlich dann aber gegen eine Gebühr.  Quote from: bct_ail on January 16, 2023, 02:19:51 PMAnsonsten scheinst du schon auf dem richtigen Weg zu sein um oranged pilled zu sein.  Vor der Darstellung Bitcoins als Kultgut einer Sekte kann ich nur warnen. In erster Linie ist Bitcoin vor allem eine technische Innovation und sollte auch als eine solche betrachtet werden. Jedem steht die Nutzung offen und damit ist es das Gegenteil einer Sekte. Sollte Bitcoin tatsächlich zum Kultgut einer Sekte missbraucht werden (was einige Nutzer auf Twitter fordern), würde das in eine Sackgasse führen, was Bitcoin sehr schaden würde. Es ist also weder technisch gerechtfertigt, noch förderlich für Bitcoin, es als Kultgut einer Sekte einzustufen. Twitter neigt dazu aber das liegt vor allem daran, dass viele Nutzer dort hoffnungslos verblödet sind. Generell sollte man die Innovationskraft dezentraler Anwendungen nicht unterschätzen, auch wenn diese aktuell noch schwer greifbar sind. Wer dazu mehr Infos möchte, dem empfehle ich die Artikel von Prof. Dr. Philipp Sandner vom Blockchain Center der Fankfurt School of Finance. Nicht alles davon sind mega interessante Texte aber für einen groben Überblick ist der Querschnitt ganz gut.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lakai01",
      "created_time": "January 17, 2023, 04:21:43 AM",
      "body": "Quote from: bct_ail on January 16, 2023, 02:19:51 PMNachvollziehbar. Gehst du den umgekehrten Weg auch? Falls ja, denke ich dass bei großen ankommeneden Summen auf dein Girokonto die Bank irgendwann nachfragen könnte, woher das ganze Geld stammt.Hier möchte ich kurz einhaken, die Bank muss sogar nachfragen wenn die Beträge weit über deinen durchschnittlichen Eingängen liegen, da gibt es prinzipiell keine festen Beträge. Heißt wenn du Student bist und monatlich 800€ verdienst und plötzlich kommt eine 5k-Überweisung von bspw. einem ausländischen Konto rein dann ist die Bank verpflichtet nachzufragen woher das Geld kommt. Meistens geht das dann auch mit einer Herkunftsüberprüfung mit ein - wobei ich mir nicht sicher bin, ob das bereits bei 5k passiert - wo du darlegen musst, woher das Geld stammt und warum es tatsächlich dir gehört.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bct_ail",
      "created_time": "January 17, 2023, 08:07:00 AM",
      "body": "Quote from: Lakai01 on January 17, 2023, 04:21:43 AMQuote from: bct_ail on January 16, 2023, 02:19:51 PMNachvollziehbar. Gehst du den umgekehrten Weg auch? Falls ja, denke ich dass bei großen ankommeneden Summen auf dein Girokonto die Bank irgendwann nachfragen könnte, woher das ganze Geld stammt.Hier möchte ich kurz einhaken, die Bank muss sogar nachfragen wenn die Beträge weit über deinen durchschnittlichen Eingängen liegen, da gibt es prinzipiell keine festen Beträge. Ja, da hast du recht und gut, dass du es nochmal genauer definiert hast. Das ist \"uns alten Hasen\" natürlich bekannt, aber sollte immer wieder erwähnt werden. Ich finde aber den Weg, denn virginorange geht schon gut durchdacht. Leider wird man ja als Kunde bei einigen Banken rausgeschmissen (also gekündigt), wenn man etwas mit Krypto zu tun hat. Trifft es dann das Hauptkonto, sind Schwierigkeiten vorporgrammiert.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}