{
  "id": "topic_5413331",
  "title": "Majestic-milf",
  "author": "Majestic-milf",
  "created_time": "September 12, 2022, 09:04:47 PM",
  "content": "The death of queen Elizabeth has affected world activities and if I'm not mistaken, there has been over a thousand condolence messages from leaders over the world and even Kenyan president, Kenyatta declared a three day holiday of sorts to honor the late monarch. Prior to her death, the United kingdom had had it's ups and downs financially and recently they are battling with energy concerns and it's not getting better because energy bill which was £1,971 per year will increase to £2500 by 1st October 2022 At present, the country is under recession and according to  economic experts, it was gathered that  they began experiencing such hard times from April and it went downhill from there. Now the queen has passed on and in her stead is her son, King Charles III who is the oldest king to be crowned in English History at 73.  With the country in deep recession and citizens struggling to meet up and cope on daily basis, will he be able to run with the baton she left for him or will UK experience more setbacks? https://www.bbc.com/news/business-62504789https://www.cnbc.com/2022/09/09/queen-elizabeths-death-comes-as-a-new-economic-era-for-uk-begins.html",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5413331",
  "comments": [
    {
      "author": "jackg",
      "created_time": "September 12, 2022, 09:22:49 PM",
      "body": "I think there's going to be a bias change since two of the main signers of law have changed over the past week (both the monarch and the prime minister) but they seem like two people who might counterbalance each other. Charles will probably start trying to heavily push investments in green energy alternatives which would do something for reducing energy rates - even though most of the new government cabinet are in denial over the effects of global climate change and their contribution to it.I'm not sure if you saw any videos on social media at the time but the royal family who flew back returned on commercial jets with other people on them instead of private ones which seems like an interesting change to have started (not sure if it's happened before though).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "September 12, 2022, 09:30:35 PM",
      "body": "The queen died at a very tumultuous time not only for UK but also for the whole world. It'll be an exceptionally hard challenge for the King to make some decisions that can either make or break UK's short-term future, especially with all the necessities rising up in prices with seemingly no end. Also, the popularity of the idea that a monarch should still exist up to this day will also be put to test. A lot of people have expressed their disinterest in monarchy and wanted to abolish it since they think that the royal family is only eating up on the public's budget, and not really helping much when it comes to the country's state of affairs.Quote from: jackg on September 12, 2022, 09:22:49 PMI'm not sure if you saw any videos on social media at the time but the royal family who flew back returned on commercial jets with other people on them instead of private ones which seems like an interesting change to have started (not sure if it's happened before though). A step in the right direction, I should say. It can help save some money on their own coffers and perhaps re-align it to some other things that the royal household needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "n0ne",
      "created_time": "September 12, 2022, 11:18:35 PM",
      "body": "Came across the amount required for the change of the throne. It is huge and the succession by Charles is marked to make a big change over each and everything, because for a long term of 70 years we everything is with Queen Elizabeth II. The change will happen slowly, and it is said that the currency will also have the change. In such a bad time it'll be a big suffering. However it looks like a to be done things.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "September 13, 2022, 05:17:01 AM",
      "body": "Quote from: Majestic-milf on September 12, 2022, 09:04:47 PM The death of queen Elizabeth has affected world activities and if I'm not mistaken, there has been over a thousand condolence messages from leaders over the world and even Kenyan president, Kenyatta declared a three day holiday of sorts to honor the late monarch.Lol! Sending condolence messages are included in the protocol of the world leaders and that's why we have seen such things. It didn't effect the world activities in any way whatsoever. It could have an impact in UK itself but nowhere else! Kenya is not the world! Every country in the world is facing a great challenge called recession. UK is a democratic country and the king and queen literally had no control on the policies of UK. They have a parliamentary committee to take care of the country. The King is a honorary post and it will remain that way. Financial challenges are different and there's no impact from Queen's death!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Moneyprism",
      "created_time": "September 13, 2022, 05:20:45 AM",
      "body": "problems like this must have been foreseen long before the death of Queen Elisabeth, so I think it will certainly be no problem for King Charles III if he can follow the scenario that has been set.. hopefully the UK can get through this recession",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mauser",
      "created_time": "September 13, 2022, 06:01:20 AM",
      "body": "Quote from: Majestic-milf on September 12, 2022, 09:04:47 PM With the country in deep recession and citizens struggling to meet up and cope on daily basis, will he be able to run with the baton she left for him or will UK experience more setbacks? I don't think King Charles III has to worry about his personal financial situation. He is inheriting everything from the Queen and doesn't have to pay any succession duty for all the castles and estates he is getting. The royal family is exempt from such taxes to make sure they don't lose any wealth. This is also why the King or the Queen will always concentrate the wealth, there is no tax benefit to distribute it within your family. Also the King or like the Queen in the past had no real direct impact on politics of UK, they have the prime minister and the government for that. UK just got a new government last week and it's in their hands now to fix the economy. There are a lot of similarities between the struggle in the European Union and the UK at the moment. Especially the inflation needs to be brought down in 2023 for the economy to recover.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 13, 2022, 12:38:40 PM",
      "body": "Quote from: Majestic-milf on September 12, 2022, 09:04:47 PMThe death of queen Elizabeth has affected world activitiesNo it did not. It only affected England and the governments in their colonies. In fact majority of the people in those colonies were angry about the condolences their governments sent.QuotePrior to her death, the United kingdom had had it's ups and downs financially and recently they are battling with energy concerns and it's not getting better because energy bill which was £1,971 per year will increase to £2500 by 1st October 2022The cost of living crisis could get worse in England as time goes on and things don't change specially since the queen's death has imposed a huge financial burden on Brits considering her funeral alone was estimated to cost billions of pounds.The transition itself is also going to cost a lot with all the things they have to change like the picture on the currencies!On top of that if more of the colonies start declaring independence, England will start facing much more problems both geopolitically and economically.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Leviathan.007",
      "created_time": "September 13, 2022, 08:40:01 PM",
      "body": "While I do not know exactly how the death of Queen Elizabeth will impact the economy, I am certain that it will because we all know that she was the world's most powerful woman and that she had several countries under her control indirectly, and we all know that this will impact the economy, especially in these countries, in a negative way. We are still unsure how King Charles III is going to govern and what his economic plan will be if he has any so far. On the other hand, we have no information about how he is going to govern, but even after all these things, we still do not know exactly how it will affect us. In my opinion, however, the effect will only be temporary and for a while, since it will not affect anything for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bocyaj",
      "created_time": "September 13, 2022, 08:46:32 PM",
      "body": "It’s bad news for most of people from United Kingdom.But we should way forward on the bad incident.The parliament of the UK will take care of the financial stability of the country.Most of the people with less knowledge about the UK will think,their will be instability after the death of the queen.But the crown is just a nominal head and parliament is the real head ,which take care of the economy of the country.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "September 13, 2022, 09:32:09 PM",
      "body": "Quote from: bocyaj on September 13, 2022, 08:46:32 PMIt’s bad news for most of people from United Kingdom.But we should way forward on the bad incident.The parliament of the UK will take care of the financial stability of the country.Most of the people with less knowledge about the UK will think,their will be instability after the death of the queen.But the crown is just a nominal head and parliament is the real head ,which take care of the economy of the country.UK is already suffering from a big financial problem with a high inflation as well, and we will see that effect in the coming months since many are still didn’t know what will happen after the death of the queen, that’s a normal reaction of the market though. There’s a king already and they did that to stabilize everything, if something goes wrong then it’s not on the monarchy anymore maybe their government is really having a hard time taking control of their economy. There’s a lot of issues going on, they have to address that issues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "September 14, 2022, 02:08:49 AM",
      "body": "The expressions of respect through official channels of several countries in the assumption of  tributes formalities in each of these countries is something unprecedented, that demonstrates the leadership that the Queen represented at a global level. On the other hand, his son has reformist ideals as is known, and intends to modernize the monarchy, in any case he has his heir son as the card up his sleeve to give up the crown in case things do not look good economically , it would be difficult to see him abdicate, but it would be part of his ideals of modernization in the traditional rules.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "electronicash",
      "created_time": "September 14, 2022, 02:22:15 AM",
      "body": "it got me thinking the other day when someone said in the other thread that UK is very backwards because they are still in monarch. King's decisions still reflects PM's decision. if liz truss does the same as the previous boris johnson, the economic crash will still go on. energy crisis starts the cause of street protest. its going to be hard to control anymore when the entire country is unsatisfied with how they govern. this winter could be more devastating to entire Europe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "2stout",
      "created_time": "September 14, 2022, 02:46:13 AM",
      "body": "I don't really see where her death poses Charles any financial constraints.  If anything, he will be greatly enriched from a royal inheritance.  So for him individually, his finances, while not bad at all, have dramatically improved along with his wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "P2PECS",
      "created_time": "September 14, 2022, 05:47:40 AM",
      "body": "Quote from: 2stout on September 14, 2022, 02:46:13 AMI don't really see where her death poses Charles any financial constraints.  If anything, he will be greatly enriched from a royal inheritance.  So for him individually, his finances, while not bad at all, have dramatically improved along with his wealth.I think the same. Besides, monarchies usually receive an allowance from public budgets, like 40 million pounds or so. If anyone wants to know the specific figure, it is published in the budgets. The only thing that could happen is that his allowance could be reduced a bit, but he is not going to starve to death, apart from all the wealth he has inherited....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "September 14, 2022, 07:08:52 AM",
      "body": "I think the monarchy have a lot less \"teeth\" than what they had before, the Prime minister and the the House of Lords and the House of Commons are governing the UK now. The \"crown\" is just a legacy of the past that are uphold for traditional reasons.   In any way, the decision to postpone all Sport in the UK last weekend, had a significant financial affect on the global economy... if you look at the money that they have lost. (Bookmakers and Sport stadiums etc...)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "September 14, 2022, 02:05:58 PM",
      "body": "Quote from: Kakmakr on September 14, 2022, 07:08:52 AMI think the monarchy have a lot less \"teeth\" than what they had before, the Prime minister and the the House of Lords and the House of Commons are governing the UK now. The \"crown\" is just a legacy of the past that are uphold for traditional reasons.   In any way, the decision to postpone all Sport in the UK last weekend, had a significant financial affect on the global economy... if you look at the money that they have lost. (Bookmakers and Sport stadiums etc...)  Sports event and anything else is not important. In fact is no news flash about anything else like energy crisis in UK but the Queens death. I can understand  they are mourning though. Peace be upon her.But its also true that Windsors monarchy is not as what it was before. There were even discussions already that US will tax the Windsors since the kids of Megan had now ranked to which by the way are Americans. Giving the US the right to tax the Royal kids.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fiulpro",
      "created_time": "September 14, 2022, 06:50:59 PM",
      "body": "Some countries who considers the British Monarchy as the State Head are honestly also rethinking, the whole system and are trying to honestly try and get out of it after Queen Elizabeth's Death. Therefore I do think that it's indeed very complicated situation for UK as well since most of them are undergoing problems regarding: 1. Covid 2. Job instability 3. Massive inflation certain percentage due to war as wellPeople are honestly looking for ways to take care of their families as well, I do think that Monarchy is not only loosing their grip but at the same time in countries like, UK hold it very dear sa well therefore I do think Queen's death might not be responsible for majority of the crisis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Haunebu",
      "created_time": "September 14, 2022, 07:02:22 PM",
      "body": "I predict that the economic situation in UK will get worse before it gets better. Charles is an absolute idiot who luckily became the King and is way, way less popular when compared to his mother.This is why I feel that he will worsen their economic situation in their country due to his inability to take correct decisions at correct times.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "September 14, 2022, 08:06:43 PM",
      "body": "Quote from: Moneyprism on September 13, 2022, 05:20:45 AMproblems like this must have been foreseen long before the death of Queen Elisabeth, so I think it will certainly be no problem for King Charles III if he can follow the scenario that has been set.. hopefully the UK can get through this recessionI hope that is the case however I'm not so sure anymore, recently we have seen videos of the King Charles getting really mad just because he got some ink on his hands, so it seems that he has some character flaws that can be exploited by others and this is never good for the people that eventually have to follow his ruling, Queen Elizabeth lived through a very tumultuous time and this shaped her character, so it is quite possible that King Charles has been shaped as well by the incredibly long amount of time he had to wait in order to become King.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}