{
  "id": "topic_5449617",
  "title": "karam22",
  "author": "karam22",
  "created_time": "April 20, 2023, 08:11:09 PM",
  "content": "تجنب شبكات الاتصال Wi-Fi العامة:يمكن لشبكة Wi-Fi تحويل متصفحك إلى أي صفحة. قد يكون التحويل أحيانا نحو نسخة تحاكي منصة التداول أو المحفظة التي تستخدمها. وعليه سيكون من وراء الشبكة العامة \"الواي فاي\" قادر على جمع البيانات المنقولة عبر الشبكة، وفي حالة حملها لكلمة المرور التي كتبتها، فسيسهل ذلك عليه الدخول من ورائك. لذا نوصي بعدم الإتصال محفظتك من شبكة Wi-Fi عامة. وفي حالة الضرورة القصوى، استخدام شبكة افتراضية خاصة (VPN). حيث إنها طريقة تستخدم لإضافة الخصوصية والأمان إلى الشبكات الخاصة والعامة، مثل الإنترنت ونقاط اتصال Wi-Fi. حيث أن الشركات تستخدم VPN في الغالب لحماية بياناتها الحساسة.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5449617",
  "comments": [
    {
      "author": "yhiaali3",
      "created_time": "April 21, 2023, 12:13:54 AM",
      "body": "شكرا لك أخيلكن في مثل هذه الحالات الأفضل استخدام متصفح يحمي الخصوصية مثل TOR أو استخدام علامة تبويب التصفح الخفي في جوجل كروم حيث أنها لا تحتفظ بأي بيانات بعد انتهاء الجلسة. هذه هي الطريقة الأضمن في حال استخدام شبكات عامة.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kavelj22",
      "created_time": "April 21, 2023, 04:26:36 PM",
      "body": "Quote from: karam22 on April 20, 2023, 08:11:09 PMتجنب شبكات الاتصال Wi-Fi العامة:يمكن لشبكة Wi-Fi تحويل متصفحك إلى أي صفحة. قد يكون التحويل أحيانا نحو نسخة تحاكي منصة التداول أو المحفظة التي تستخدمها. وعليه سيكون من وراء الشبكة العامة \"الواي فاي\" قادر على جمع البيانات المنقولة عبر الشبكة، وفي حالة حملها لكلمة المرور التي كتبتها، فسيسهل ذلك عليه الدخول من ورائك. لذا نوصي بعدم الإتصال محفظتك من شبكة Wi-Fi عامة. وفي حالة الضرورة القصوى، استخدام شبكة افتراضية خاصة (VPN). حيث إنها طريقة تستخدم لإضافة الخصوصية والأمان إلى الشبكات الخاصة والعامة، مثل الإنترنت ونقاط اتصال Wi-Fi. حيث أن الشركات تستخدم VPN في الغالب لحماية بياناتها الحساسة.اقدر كثيرا هذا الحرص على تجنب استعمال الشبكات العامة لغايات حمائية بالاساسا تتعلق بالبيانات الشخصية و بيانات التصفح بالاضافة الى عنوان Ip الذي قد يحمل اخطارا لم نكن نتوقعها. و لكن بالنسبة لعمليات اتصال المحفظة فانه من شبه المستحيل ان يتم اختراقها باستخدام شبكة WiFi عمومية الا ان تمكن الهاكر من سرقة جهازك الهاتف. يعني لو تمكن من الحصول على كلمة السر الخاصة بالمحفظة فكيف سيتمكن من الوصول اليها بدون كلمات البذرة او مفاتيح خاصة؟ نفس الشيء بالنسبة لمنصات التداول و باقي المنصات المالية فانه اذا كانت مؤمنة بطبقات حماية كافية فانه حتى لو تمكن شخص من الحصول على كلمة السر لن يستطيع القيام بشيء بما انه سيحتاج الى الرقم في الرسالة الهاتف النصية و الى معرفة البريد الالكتروني و رقم سره و كل البيانات الأخرى. الأمر لا يمكن أن يحصل بهذه السهولة يا صديقي و لكن عموما ليس جميع المستخدمين قادرين على استيعاب جميع وسائل الحماية و لهذا فان تقديم التوصية لازم. بالنسبة للاحتمالات التي طرحتها فاتمنى ان يفيدنا اصحاب الخبرة عن مدى فاعلية عمليات التهكير باستخدام الشبكات العمومية و كيف من الممكن ان تتعرض محفظة او حساب للاختراق من خلالها.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ulven",
      "created_time": "April 21, 2023, 10:42:34 PM",
      "body": "Quote from: karam22 on April 20, 2023, 08:11:09 PMتجنب شبكات الاتصال Wi-Fi العامة:يمكن لشبكة Wi-Fi تحويل متصفحك إلى أي صفحة. قد يكون التحويل أحيانا نحو نسخة تحاكي منصة التداول أو المحفظة التي تستخدمها. وعليه سيكون من وراء الشبكة العامة \"الواي فاي\" قادر على جمع البيانات المنقولة عبر الشبكة، وفي حالة حملها لكلمة المرور التي كتبتها، فسيسهل ذلك عليه الدخول من ورائك. لذا نوصي بعدم الإتصال محفظتك من شبكة Wi-Fi عامة. وفي حالة الضرورة القصوى، استخدام شبكة افتراضية خاصة (VPN). حيث إنها طريقة تستخدم لإضافة الخصوصية والأمان إلى الشبكات الخاصة والعامة، مثل الإنترنت ونقاط اتصال Wi-Fi. حيث أن الشركات تستخدم VPN في الغالب لحماية بياناتها الحساسة.من الجيد تذكير المستخدم بالخصوصية و الحماية من سرقة المعلومات الشخصية و أود إضافة خاصية ربما غائبة عن البعض و هي تفعيل المصادقة الثنائية في حالة كان المستخدم يعتمد في إتصاله على النت بالشبكة الواي فاي من أجل ضمان الحماية،فعلاً هناك الكثير من المستخدمين تعرضوا للسرقة من خلال تلغيم الروتر",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "April 22, 2023, 10:30:05 PM",
      "body": "Quote from: yhiaali3 on April 21, 2023, 12:13:54 AMشكرا لك أخيلكن في مثل هذه الحالات الأفضل استخدام متصفح يحمي الخصوصية مثل TOR أو استخدام علامة تبويب التصفح الخفي في جوجل كروم حيث أنها لا تحتفظ بأي بيانات بعد انتهاء الجلسة. هذه هي الطريقة الأضمن في حال استخدام شبكات عامة. اخي يحى, استخدام Tor او اي متصفح لايحفظ الكوكيز لا يحميك من انواع الهجوم التي يتكلم عنها صاحب الموضوع, مثل احد اشهر انواع الهجوم المعروفة باسم man-in-the-middle,  بما انك تسخدم شبكة عامة يعني ان شخص ما قد يمتلك الوصول الى الراوتر, هنا وفي حال التعرف على نوع الاتصال والبايانات التي يقوم حاسوبك او هاتفك بارسلها يمكنه ان ينتحل \"شخصية\" الخادم التي تحاول الاتصال به, ولنفرض مثلا انك تحاول ان تصل الى موقع بايناناس.يقوم جهاز بارسال باكت الى الراوتر , يقوم ذلك الشخص بالتنصت عليها ويعرف انك تحاول الوصول الى باينانس, يقوم بالرد من الراوتر الى جهازك ويعتقد جهازك هنا انه يتكلم مع موقع باينانس, وهنا تبداء عملية التصيد.طبعا الموضوع ليس بهده البساطة لان معظم الباينات المرسلة مشفرة, لهدا يجب عليك دائما التأكد انك تستخدم https ولي فقط http للوصول للمواقع, يجب عليك ان تستعمل محفظة لاتقوم بارسال بياناتك في Plain text بدون تشفير, كل هده الاشياء تزيد من صعوبة اختراقك حتى وان كنت متصل بشبكة عامة, ولكن الافضل ومن باب الاحتياط هوا تجنب استخدام هاتفك او حاسوبك الذي توجد به اموالك سواء بتكوين او حسابات بنكية على شبكة عامة من مبداء الامان.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "April 22, 2023, 11:10:48 PM",
      "body": "Quote from: mikeywith on April 22, 2023, 10:30:05 PMيقوم جهاز بارسال باكت الى الراوتر , يقوم ذلك الشخص بالتنصت عليها ويعرف انك تحاول الوصول الى باينانس, يقوم بالرد من الراوتر الى جهازك ويعتقد جهازك هنا انه يتكلم مع موقع باينانس, وهنا تبداء عملية التصيد.شكرا لك أخي ميكي على التوضيح. لكن حبذا مزيد من الشرح على هذه النقطة، على حد علمي التصيد يكون عن طريق إدخال البيانات في مواقع مزيفة، لذلك في مثال منصة بينانس الذي ذكرته أخي هل يكون ذلك الهاكر مجهز موقع شبيه لبينانس سلفا؟ أم أنه فقط يقوم بالتقاط البيانات المرسلة إلى موقع بينانس الحقيقي وسرقتها؟",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "April 22, 2023, 11:32:29 PM",
      "body": "Quote from: yhiaali3 on April 22, 2023, 11:10:48 PMQuote from: mikeywith on April 22, 2023, 10:30:05 PMيقوم جهاز بارسال باكت الى الراوتر , يقوم ذلك الشخص بالتنصت عليها ويعرف انك تحاول الوصول الى باينانس, يقوم بالرد من الراوتر الى جهازك ويعتقد جهازك هنا انه يتكلم مع موقع باينانس, وهنا تبداء عملية التصيد.شكرا لك أخي ميكي على التوضيح. لكن حبذا مزيد من الشرح على هذه النقطة، على حد علمي التصيد يكون عن طريق إدخال البيانات في مواقع مزيفة، لذلك في مثال منصة بينانس الذي ذكرته أخي هل يكون ذلك الهاكر مجهز موقع شبيه لبينانس سلفا؟ أم أنه فقط يقوم بالتقاط البيانات المرسلة إلى موقع بينانس الحقيقي وسرقتها؟ أعتقد أنه قصد أن المخترق يمكنه التقاط جميع بياناتك من خلال موقع ويب مصاب بهجوم man in the middle. هنا المرجع من موقع بينانس https://www.binance.com/ar-BH/feed/post/432106تأكد من إلقاء نظرة عليه",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "April 23, 2023, 12:02:48 AM",
      "body": "Quote from: yhiaali3 on April 22, 2023, 11:10:48 PMلكن حبذا مزيد من الشرح على هذه النقطة، على حد علمي التصيد يكون عن طريق إدخال البيانات في مواقع مزيفة، لذلك في مثال منصة بينانس الذي ذكرته أخي هل يكون ذلك الهاكر مجهز موقع شبيه لبينانس سلفا؟ أم أنه فقط يقوم بالتقاط البيانات المرسلة إلى موقع بينانس الحقيقي وسرقتها؟ انواع الهجوم متعددة جدا, والمفردات قد تسبب لخبطة في الفهم, فكلمة تصيد هي كلمة عامة لاي اختراق يتمضن في طياته الحصول على بيانات من شخص ما دون علمه بغض النظر عن التفاصيل.في حالة هجوم man-in-the-middle يوجد العديد من الطرق لتصيد بياناتك, احد اشهر الطرق هي البدء بما يعرف ب ARP spoofing حيث يقوم المخترق بتقمص دور الراوتر, هنا ستتوجه كل الحزم من جهازك الى جهاز المهامج ضننا من جهازك انه يقوم بمراسلة الراوتر مباشرة.من الجهة الاخرى, سوف يقوم المخترق بايهام الراوتر ان جهازه هوا جهازك انت عن طريق ارسال ARP messages مزيفة, مما يعني ان الان الهجوم فعليا نجح وكل شي ترسله او تستقبله من الراوتر سوف يمر على جهاز المهاجم, ولهدا السبب يطلق عليه هجوم (الرجل في المنتصف) لان المهاجم الان يقف في وسط الطريق بينك وبين الراوتر.مايكمن للمهاجم فعله في هده اللحظة يصعب تعداده في هدا الموضوع ولكن احد الاشياء هوا SSL stripping, يعني عندما تتصل ب https://.biance.com سوف يقوم المهامج فعليا بالاتصال ب https ولكن سوف يبقي شهادة ال  SSL بينه وبين باينانس وسوف يرسل لك نسخة من الموقع الحقيقي لباينانس بدون SSL, وهنا عند ادخال بياناتك وارساله (والتي بدورها ستمر على المهاجم) ستكون خالية من التشفير وسيتمكن المهاجم من الحصول على بيانات الدخول الخاصة بك.الطريقة الاخرى هوا عند معرفة المهاجم انك تحاول الوصول لى Binance يمكنه فعليا ان يعيد لك موقع مطابق للباينانس تقوم انت بأدخال بياناتك فيه يقوم هوا بتخزينها ومن تم نقلها فعليا لموقع لباينانس الحقيقي وارسال الصفحة الحقيقية لك, هنا سوف تتمكن من الدخول للموقع بينما يكون هوا تحصل على بياناتكيمكنه ايضا ان يتحصل على cookies فعالة لدخولك لاحد المواقع واستخدامه مباشرة للدخول لنفس الموقع.لحماية نفسك من هدا الهجوم عليك ان تتأكد انك دائما موجود داخل https://.biance.com ولي http://.biance.com, حرف ال s يشار اليه بعلامة قفل في معظم المتصفحات لان هدا يعني, استخدام برامج internet secruity و firwewall يمكنها ايضا حمايتك من هدا الهجوم الى حد ما, استخدام VPN جيد حيث ان المهاجم لن يمتكن من قراءة الحزم الخارجة من جهازك اصلا ولن يعرف اي موقع تحاول الوصول اليه لانها تخرج مشفرة اصلا.الهجوم نظريا ناجح وفعال ولكنه في الواقع ليس بهده السهولة لان الحماية في الراوتارات والانظمة الجديدة تطورت, ولكن ايضا الهجوم تطور, ان كنت تمتلك الخبرة الكافية في هدا المجال سوف يكون من المستحيل تنفيد هدا الهجوم عليك حتى باستخدام الشبكات العامة ولكن حتى بامتلاك الخبرة وجميع الادوات التي تحميك منه لماذا المخاطرة من الاساس؟ كما يقول المثل العربي الشهير (الباب إللي يجيك منو الريح سدو واستريح).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "April 25, 2023, 11:57:24 PM",
      "body": "إضافة للشرح المفصل الذي تفضل به الأخ ميكي حول كيف يمكن للمخترق تنفيذ هجمة mitm عند اتصالك بشبكة وايفي عمومية و كيف يمكن خداع متصفحك لسرقة بياناتك او تحويلك لصفحة مزورة فإن هذا ليس الخطر الوحيد عند إيصال جهازك بشبكة محلية غير محمية سواء كانت سلكية او لاسلكية.الخطر الاخر هو أن عملية اختراق جهازك تصبح أسهل عندما تكون متصل مع المخترق على نفس الشبكة المحلية. مثلا يمكن لشخص متصل معك على نفس الشبكة فحص المنافذ المفتوحة في جهازك و اكتشاف البرامج التي تعمل عليه و حتى نظام التشغيل الذي تستعمله و من ثم استغلال ان كانت هناك ثغرات في إحدى هذه البرامج لاختراق جهازك و حتى السيطرة عليه بشكل كامل.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}