{
  "id": "topic_5450464",
  "title": "Ammaa",
  "author": "Ammaa",
  "created_time": "April 28, 2023, 06:25:18 AM",
  "content": "Is it better to have  a place to discuss only about NFTs? I think that would be a good for NFT lovers",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450464",
  "comments": [
    {
      "author": "o48o",
      "created_time": "April 28, 2023, 10:03:22 AM",
      "body": "Quote from: Ammaa on April 28, 2023, 06:25:18 AMIs it better to have  a place to discuss only about NFTs? I think that would be a good for NFT loversYou mean that there should be a section in this forum for them? I am not against it but i can't see why those threads wouldn't fit on altcoin section. They are technically tokens as well, and build on top of cryptocurrencies.And if you want more, then every nft project has their own discord server and there are generic nft discord servers and subreddits out there as well. Twitter is pretty much a mecca for nft hype talk. You can't avoid those threads in here either so there's no shortage on the places that people talk about them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FP91G",
      "created_time": "April 28, 2023, 10:36:06 AM",
      "body": "In 2021 Logan Paul bought a NFT for $623,000 that is now only worth $10But it’s not just digital influencers, celebrities like Paris Hilton, Lindsay Lohan and Bella Hadid have also jumped on the bandwagon, all of whom have made millions of dollars through digital assets like NFTs, and Logan Paul’s 2021 purchase should have boosted his net worth but didn’t.His Azuki collection, purchased for $623,000, is only valued at $10 today.https://www.geekmetaverse.com/in-2021-logan-paul-bought-a-nft-for-623000-that-is-now-only-worth-10/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Strongkored",
      "created_time": "April 28, 2023, 11:35:33 AM",
      "body": "What for? isn't NFT the same as altcoins so this place is enough for anyone to create a thread and discuss about NFT. If this is done then when a new trend emerges in crypto there will also be a request to have a special place that discusses this trend, so it's not an important thing to do at any time.I'm quite curious whether NFT is still so interesting to own, and whether it still opens opportunities for owners to get big profits by continuing to hold it, because I don't follow its development and NFT is one of the trends in crypto that I've never been interested in getting involved in because of the new trend in altcoins only temporarily and only provides benefits for those who enter and leave early without thinking about keeping it for a long time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reid",
      "created_time": "April 28, 2023, 11:43:31 AM",
      "body": "NFT's are also altcoins so we won't really need to add more space that would just eat the performance of the forum. If you really want to talk more about NFT's there is Discord for every NFT game or applications which are all energetic. I stay there most of the time just to keep myself updated about my bought NFTs and of course to see if the value is going high. But here in the forum, you won't see that kind of enthusiasm about them, it's normal, this is Bitcointalk and not NFTtalk. I recommend to just look for their groups in the said application.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Apocollapse",
      "created_time": "April 28, 2023, 12:31:16 PM",
      "body": "One or two years ago when NFT is still hype there are few users demand to create section for NFT, but until now it's not created yet and seems never will be created. You can check the previous threads:https://bitcointalk.org/index.php?topic=5367417.0https://bitcointalk.org/index.php?topic=5357077.0https://bitcointalk.org/index.php?topic=5367417.0https://bitcointalk.org/index.php?topic=5408273.0I don't think it's good to have NFT board when not many people really discuss about NFT, most of them only shill their NFT and spamming.Quote from: FP91G on April 28, 2023, 10:36:06 AMIn 2021 Logan Paul bought a NFT for $623,000 that is now only worth $10What you're talking about? did the @OP discuss about NFT price went to worthless or celebrities jump to invest in NFT?Move this thread to Meta.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rampagoe004",
      "created_time": "April 28, 2023, 02:18:38 PM",
      "body": "That's irrelevant for now. First I thought NFT is not a cryptocurrency. They are art-based projects and are priced according to bid figures at auction. At the moment I think technically NFT doesn't need a special section and we can discuss about NFT in the thread and I'm welcome to talk about NFT.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gladitorcomeback",
      "created_time": "April 28, 2023, 03:01:35 PM",
      "body": "Quote from: Ammaa on April 28, 2023, 06:25:18 AMIs it better to have  a place to discuss only about NFTs? I think that would be a good for NFT loverswe can divide alt coins into two parts 1) fungible and 2) non fungible. fungible tokens are this which we buy and trade on many exchange like Eth, matic etc while Non fungible are in the shape of image, gif or video. now its cleared non fungible is also an Altcoins.We can discuss NFT related discussion in altcoins thread. some thread has been already created in this section for this purpose by Appocollapse and i think there is no need of separate section for nft now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomiles1",
      "created_time": "April 28, 2023, 04:32:51 PM",
      "body": "Can't we classified them as altcoin? Despite is not altcoin but I think that is the right place to discuss about NFTs are on the altcoin sections. I think few people already shared about it, but if I may ask why do you wanna venture into NFTs I don't think it's worth investing or to give attention to it, if you ask me I would advised you to focused on real project that just looking towards NFTs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BenCodie",
      "created_time": "April 28, 2023, 04:42:24 PM",
      "body": "There should be a forum for Bitcoin Ordinals as this is a part of Bitcoin that was recently integrated. The main board being for discussion, and a sub-board for people to promote (or even trade/advertise) their owned Ordinals. NFTs on the other hand are on other blockchains. NFTs do not truly exist on the Bitcoin blockchain, ordinals have just been dubbed as \"Bitcoin NFTs\" or \"NFTs on Bitcoin\".",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "April 28, 2023, 10:14:58 PM",
      "body": "Quote from: BenCodie on April 28, 2023, 04:42:24 PMThere should be a forum for Bitcoin Ordinals as this is a part of Bitcoin that was recently integrated. The main board being for discussion, and a sub-board for people to promote (or even trade/advertise) their owned Ordinals. NFTs on the other hand are on other blockchains. NFTs do not truly exist on the Bitcoin blockchain, ordinals have just been dubbed as \"Bitcoin NFTs\" or \"NFTs on Bitcoin\". I agree. Currently the only place to discuss NFTs is in the altcoin tokens section. Now that NFTs are a reality on the Bitcoin blockchain it makes sense to have a place to discuss and learn more about them. I for one think that Ordinals are a great step towards being able to bridge some of the missing functionality of smart chains to Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "April 28, 2023, 11:10:35 PM",
      "body": "Quote from: Apocollapse on April 28, 2023, 12:31:16 PMOne or two years ago when NFT is still hype there are few users demand to create section for NFT, but until now it's not created yet and seems never will be created. You can check the previous threads:https://bitcointalk.org/index.php?topic=5367417.0https://bitcointalk.org/index.php?topic=5357077.0https://bitcointalk.org/index.php?topic=5367417.0https://bitcointalk.org/index.php?topic=5408273.0I don't think it's good to have NFT board when not many people really discuss about NFT, most of them only shill their NFT and spamming.I don't even see much discussion about NFT in the forum, unless probably in the altcoins board, which I don't really find much interest in going through. I think it was around 2021 and last year that NFT was hyped, but not so much today as in the past.From the second and last link you provided, a staff member gave out merit to those suggestions, which means he may also have had interest in them, but I think theymos will probably not approve it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "April 29, 2023, 01:37:51 PM",
      "body": "Quote from: Ammaa on April 28, 2023, 06:25:18 AMIs it better to have  a place to discuss only about NFTs? This is bitcointalk majorly created for bitcoin discussions but Non Fungible Tokens can also be discussed here but that is on altcoins discussion board, this is the major section assigned for such discussions on this forum, you can scroll abit downward from the home page where you have the list of boards available on the forum with respect to their child boards, there you will discover the alternative currencies discuss board and you can make your post as needed.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "April 29, 2023, 02:20:50 PM",
      "body": "If you care to search for the topic you have created then you would find lot of similar threads on forum where this discussion was carried on about different board for NFT discussion but the answer remains the same that it's altcoin related discussion and we have dedicated board for it.It was time when it was in hype but at this time most of the NFT's are dead while the existing one's are there with little progress to what projects they have set in roadmap on most of the chains but the overall NFT market is not in much hype so demanding a separate place for these discussions is not important according to me especially when there are lot of important updates pending for the forum and @theymos will implement them first of all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "April 29, 2023, 03:22:18 PM",
      "body": "Quote from: FP91G on April 28, 2023, 10:36:06 AMIn 2021 Logan Paul bought a NFT for $623,000 that is now only worth $10But it’s not just digital influencers, celebrities like Paris Hilton, Lindsay Lohan and Bella Hadid have also jumped on the bandwagon, all of whom have made millions of dollars through digital assets like NFTs, and Logan Paul’s 2021 purchase should have boosted his net worth but didn’t.His Azuki collection, purchased for $623,000, is only valued at $10 today.https://www.geekmetaverse.com/in-2021-logan-paul-bought-a-nft-for-623000-that-is-now-only-worth-10/Context? No? I didn't get what is the point of sharing this here. This is not an NFT Discussion thread, for sure. OP asked if there is a place in this forum for discussing NFT. He created This topic and moved to Meta, asking if there is a separate section. But, You are sharing who bought the NFT, when and how much it's worth. Answering any post without reading the content is called shit post / Signature spam. I hope you know that because you are an experienced member wearing a good campaign signature. Quote from: Ammaa on April 28, 2023, 06:25:18 AMIs it better to have  a place to discuss only about NFTs? You can discuss NFT on the Altcoin discussion board. NFTs are tokens AKA alt coins. (non-fungible tokens). So, it fits in Altcoin Discussion",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "April 29, 2023, 05:25:37 PM",
      "body": "Quote from: Ammaa on April 28, 2023, 06:25:18 AMIs it better to have  a place to discuss only about NFTs? I think that would be a good for NFT loversWait, so we still have people falling for this scams called NFT that mostly their creators or influencer are those profiting from this trend while the rest of us buy worthless piece of arts that can be easily screenshots or shared. NFT are worthless and doesn't fit to have a board on its own. If we give NFT a baord then we have to be ready to give every trend that get introduced to the market their own board. After NFT are we also going to give Metaverse, AI , Defi etc their own boards? All this trends can still be classified as an altcoins or fits in the alternative discussion boards.Best the forum avoids giving NFT much attention as any positive decision they take now would be interpreted by the members as some form of endorsement, if NFT gets its own board then the forum members would pick more interest in the trend and it would definitely end badly for them, many people have been rekted by investing in NFT and at this point, it's best to stay away from them. Just because people are been lucky and making money from it doesn't mean it's a credible form of investing, NFT aren't any different from memecoins to me, they all need the same type of hype (celebrity hype) for them to get value, they're worthless without that hype.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cryptomultiplier",
      "created_time": "April 29, 2023, 08:33:34 PM",
      "body": "I understand the angle you ask from as a rather new member of this forum. The sections/threads are for exploring and you could get only useful news about NFTs or other special services on the Alt discussion thread. More than just pointing you in the direction is also the need to know and distinguish it.NFTs is a major service offered by Ethereum. It is the kind of technology on which it runs that Ethereum was designed for. This is clearly Bitcoin talk and forum. Bitcoin is more or less a digital currency, just like we have CBDC. But it and both are functional on a decentralized system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "virasog",
      "created_time": "April 29, 2023, 10:35:10 PM",
      "body": "Quote from: Ammaa on April 28, 2023, 06:25:18 AMIs it better to have  a place to discuss only about NFTs? I think that would be a good for NFT loversNFTs are dead now and the hype of NFT is now over at least for the time being. So do you want to have a separate board for something which is not of much interest to the community???However, You can still discuss them in Altcoin sections and that is the most appropriate place for them. No more boards can be created for things that can be fitted in already established boards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "coin-investor",
      "created_time": "April 29, 2023, 11:34:47 PM",
      "body": "Quote from: Ammaa on April 28, 2023, 06:25:18 AMIs it better to have  a place to discuss only about NFTs? I think that would be a good for NFT loversThere are a lot of NFT supporters in the altcoin section I consider NFT part of the altcoin community so there's no need to create a dedicated board for NFT and besides NFT is not a long-term and dedicated industry if you set up a poll you'll see that many are not in favor of setting up a dedicated board for NFT, especially those who lose a lot of money investing in NFT, and I don't there's a huge number of NFT lovers this is just a hype that will soon fade away.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "libert19",
      "created_time": "April 30, 2023, 02:31:06 AM",
      "body": "Have seen several threads requesting for same, in all of them there was answer that nft threads can be posted in altcoin discussion and thus ends the discussion. Quote from: BenCodie on April 28, 2023, 04:42:24 PMThere should be a forum for Bitcoin Ordinals as this is a part of Bitcoin that was recently integrated. The main board being for discussion, and a sub-board for people to promote (or even trade/advertise) their owned Ordinals. NFTs on the other hand are on other blockchains. NFTs do not truly exist on the Bitcoin blockchain, ordinals have just been dubbed as \"Bitcoin NFTs\" or \"NFTs on Bitcoin\". Neither needs a new sub, post about ordinals in Bitcoin discussion section and about rest nfts in altcoin discussion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}