{
  "id": "topic_5467332",
  "title": "Abzzy",
  "author": "Abzzy",
  "created_time": "September 19, 2023, 02:46:31 PM",
  "content": "For those unfamiliar, Casino Guru is an online casino review platform that also doubles as an alternate dispute resolution service. Their role is to mediate disputes between players and casinos, potentially impacting the casino's rating based on the outcome of these disputes.This system serves as a regulatory mechanism in an industry where some licensors fail in their responsibilities. Many players rely on Casino Guru to discover reputable online casinos. However, there's more to this story.Casino Guru includes referral links on casino profiles, even on those with poor ratings. But why? It's so they can earn commissions when users sign up through these links, regardless of the casino's trustworthiness. In essence, they have undisclosed agreements with all the casinos they feature.Now, let me share my experience. I had a dispute with Cloudbet due to their misleading advertising, where they pretended to be licensed and regulated in my jurisdiction. They took advantage of my problem gambling, despite my self-exclusion.I turned to Casino Guru for help.First, I raised a “Complaint” but they rejected my complaint and refused to get involved because they don’t deal with jurisdiction  issues and license breaches. https://i.ibb.co/1JF43pD/39-F4-B7-EF-87-EC-4852-A0-CE-B7223-E36-E437.jpgNo problem, I thought. I then tried  to leave a review of the casino instead, but again they rejected that too, claiming that because of my serious accusations, I would need to raise a complaint instead with evidence. They also state that the reason for this is because they don’t want to “confuse” players.https://i.ibb.co/Dpv7ZZ9/6-AE215-EC-EB82-4-EBB-840-D-888-C9-FA98-DF0.pngThat’s odd, so they want me to raise a complaint again, ok. So, I raised a complaint, attached all my evidence, and what did they do? Yes, you guessed it. They rejected it again, saying they already told me couldn't assist with my case with the same issue.https://i.ibb.co/F052c8H/44-F71-D4-F-75-A7-4-DE1-B2-CC-5-B8850605271.pngWhat did I do? Simply went back and left  a review of the casino once more, and unsurprisingly, it got rejected again because at Casino Guru they “focus on a fair approach”. Whatever the hell that means.https://i.ibb.co/WDDb1dx/1550-B8-AB-4-C64-40-D9-BEF7-DD7-DCC10-DEBF.jpgIt didn’t take long for me to realise they were taking me for a ride in circles and not a word of my experience would make it published on their website.Casino Guru seems to cherry-pick which complaints and reviews they allow on their platform. They prefer issues that are easily resolvable or don't severely criticize the operators. This way, casinos keep running, referral links keep getting clicked, and everyone keeps making money.My advice: Be cautious of this website and think twice before trusting their reviews and dispute resolution services.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5467332",
  "comments": [
    {
      "author": "FatFork",
      "created_time": "September 20, 2023, 08:20:30 AM",
      "body": "Quote from: Abzzy on September 19, 2023, 02:46:31 PM<cut>Casino Guru seems to cherry-pick which complaints and reviews they allow on their platform. They prefer issues that are easily resolvable or don't severely criticize the operators. This way, casinos keep running, referral links keep getting clicked, and everyone keeps making money.I'm not sure I agree with this. I've been following Casino.Guru and going through their reviews and complaint resolutions for quite a while now. From what I've seen, there are numerous complaints that have taken months to resolve, often involving ongoing discussions between the players, the casino operator, and Casino.Guru. That's simply not the case; they don't favor issues that are easy to resolve or avoid criticizing operators! To illustrate my point, I recommend looking into some of the complaints, such as this example, where Casino.Guru ruled in the player's favor. You cannot form your judgment solely based on your case, especially if it doesn't align with their guidelines for an acceptable complaint. For example, they also don't handle complaints related to sports betting, but that doesn't imply their review process lacks impartiality.Quote from: Abzzy on September 19, 2023, 02:46:31 PMMy advice: Be cautious of this website and think twice before trusting their reviews and dispute resolution services.You should always exercise caution when dealing with gambling review sites since many of them lack credibility and may have hidden agendas. However, unless you can provide some hard evidence for your claims, I can't fully accept your accusations. Casino.guru has a track record of providing comprehensive and impartial reviews and assisting players with resolving issues. While they may not be flawless, they have earned their reputation in the gambling community.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abzzy",
      "created_time": "September 20, 2023, 09:03:20 AM",
      "body": "Quote from: FatFork on September 20, 2023, 08:20:30 AMQuote from: Abzzy on September 19, 2023, 02:46:31 PM<cut>Casino Guru seems to cherry-pick which complaints and reviews they allow on their platform. They prefer issues that are easily resolvable or don't severely criticize the operators. This way, casinos keep running, referral links keep getting clicked, and everyone keeps making money.I'm not sure I agree with this. I've been following Casino.Guru and going through their reviews and complaint resolutions for quite a while now. From what I've seen, there are numerous complaints that have taken months to resolve, often involving ongoing discussions between the players, the casino operator, and Casino.Guru. That's simply not the case; they don't favor issues that are easy to resolve or avoid criticizing operators! To illustrate my point, I recommend looking into some of the complaints, such as this example, where Casino.Guru ruled in the player's favor. You cannot form your judgment solely based on your case, especially if it doesn't align with their guidelines for an acceptable complaint. For example, they also don't handle complaints related to sports betting, but that doesn't imply their review process lacks impartiality.Quote from: Abzzy on September 19, 2023, 02:46:31 PMMy advice: Be cautious of this website and think twice before trusting their reviews and dispute resolution services.You should always exercise caution when dealing with gambling review sites since many of them lack credibility and may have hidden agendas. However, unless you can provide some hard evidence for your claims, I can't fully accept your accusations. Casino.guru has a track record of providing comprehensive and impartial reviews and assisting players with resolving issues. While they may not be flawless, they have earned their reputation in the gambling community.While I understand that Casino Guru may choose not to get directly involved in my complaint due to their “policies”, it's puzzling why they've rejected my reviews of this operator on two separate occasions. I didn’t make any allegations without evidence supplied to them.Regarding your point about Casino Guru helping players in some cases, I never disputed that. However, it appears they tend to prioritize and allow straightforward issues like KYC verification, ID problems, and slow payouts, which make up the majority of complaints on their website. This is as far as their agreement with most of these operators allow them to go. In my experience, more serious allegations of misconduct, like in my case, seem to be ignored and rejected, whether presented as a complaint or a review.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "September 20, 2023, 09:17:28 AM",
      "body": "I believe this was your complaint to CG, and to summarize the complaint [correct me if I'm wrong], you feel cheated because they're restricted in Australia, yet you feel that CG didn't do good enough effort to protect the users by giving the casino negative rating for providing services outside of their jurisdiction, although CG has put this warning banner?And your proposed solution/demand is,QuoteWhy don’t you give Cloudbet the opportunity to make amends by returning my funds. Whether they pay or not is not even my main concern. I’m more concerned that you leave a negative score if they don’t pay so that your users are aware of what’s happened.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 20, 2023, 11:21:21 AM",
      "body": "Quote from: Abzzy on September 20, 2023, 09:03:20 AMWhile I understand that Casino Guru may choose not to get directly involved in my complaint due to their “policies”, it's puzzling why they've rejected my reviews of this operator on two separate occasions. I didn’t make any allegations without evidence supplied to them.Since I haven't seen the content of your reviews, I can't comment on that. Casino.guru reserves the right to remove user reviews that do not comply with their rules. But again, this does not mean that they are biased or that they favor the casino.Quote from: Abzzy on September 20, 2023, 09:03:20 AMRegarding your point about Casino Guru helping players in some cases, I never disputed that. However, it appears they tend to prioritize and allow straightforward issues like KYC verification, ID problems, and slow payouts, which make up the majority of complaints on their website. This is as far as their agreement with most of these operators allow them to go. In my experience, more serious allegations of misconduct, like in my case, seem to be ignored and rejected, whether presented as a complaint or a review.You basically accuse casino.guru of colluding with casino operators against players, which is, to say the least, quite the stretch! Your assumptions seem to be founded on a subjective impression related to your experience with Cloudbet and your personal interpretation of \"more serious allegations of misconduct.\" In my view, cases involving hundreds of thousands of dollars of user funds are what I would consider as more serious allegations of misconduct. But again, as already explained to you, this is not why your complaint was rejected.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abzzy",
      "created_time": "September 20, 2023, 01:55:34 PM",
      "body": "Quote from: FatFork on September 20, 2023, 11:21:21 AMQuote from: Abzzy on September 20, 2023, 09:03:20 AMWhile I understand that Casino Guru may choose not to get directly involved in my complaint due to their “policies”, it's puzzling why they've rejected my reviews of this operator on two separate occasions. I didn’t make any allegations without evidence supplied to them.Since I haven't seen the content of your reviews, I can't comment on that. Casino.guru reserves the right to remove user reviews that do not comply with their rules. But again, this does not mean that they are biased or that they favor the casino.Quote from: Abzzy on September 20, 2023, 09:03:20 AMRegarding your point about Casino Guru helping players in some cases, I never disputed that. However, it appears they tend to prioritize and allow straightforward issues like KYC verification, ID problems, and slow payouts, which make up the majority of complaints on their website. This is as far as their agreement with most of these operators allow them to go. In my experience, more serious allegations of misconduct, like in my case, seem to be ignored and rejected, whether presented as a complaint or a review.You basically accuse casino.guru of colluding with casino operators against players, which is, to say the least, quite the stretch! Your assumptions seem to be founded on a subjective impression related to your experience with Cloudbet and your personal interpretation of \"more serious allegations of misconduct.\" In my view, cases involving hundreds of thousands of dollars of user funds are what I would consider as more serious allegations of misconduct. But again, as already explained to you, this is not why your complaint was rejected.Why consider it a stretch to suggest that Casino Guru might be colluding with casino operators when they openly acknowledge being on the payroll of casinos? Your in-depth knowledge of my situation and the reasoning behind what Casino Guru does raises questions—are you affiliated with them?I'm simply a user sharing my experiences, supported by four distinct rejections from Casino Guru, each with inconsistent explanations. While my complaint does stem from their refusal to address my concerns, it primarily centers on their reluctance to allow me to post a customer review, not necessarily the dispute.Users have a legitimate expectation to access personal experiences of individuals using the casino, and that's precisely the purpose of a review system.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abzzy",
      "created_time": "September 20, 2023, 02:04:24 PM",
      "body": "Quote from: holydarkness on September 20, 2023, 09:17:28 AMI believe this was your complaint to CG, and to summarize the complaint [correct me if I'm wrong], you feel cheated because they're restricted in Australia, yet you feel that CG didn't do good enough effort to protect the users by giving the casino negative rating for providing services outside of their jurisdiction, although CG has put this warning banner?https://talkimg.com/images/2023/09/20/6hLGW.pngAnd your proposed solution/demand is,QuoteWhy don’t you give Cloudbet the opportunity to make amends by returning my funds. Whether they pay or not is not even my main concern. I’m more concerned that you leave a negative score if they don’t pay so that your users are aware of what’s happened.The casino specifically targeted me with jurisdiction-specific marketing, even though I was in a prohibited jurisdiction, and I provided the emails to Casino Guru.On their website, Casino Guru acknowledges the potential breach of the Interactive Gambling Act in my jurisdiction, so they are aware of the legalities.My review, which was rejected twice during this dispute, aimed to caution players about Cloudbet's practice of targeting individuals in prohibited jurisdictions. It's noteworthy that Cloudbet's terms and conditions allow them to close your account and retain your funds if they find you're playing from a prohibited jurisdiction. This strategy lures players to deposit and then, upon initiating Know Your Customer (KYC) procedures, blocks their accounts, effectively seizing their funds.This vital information, intended to be a fair warning to all users, should have been accessible in my review, but Casino Guru chose not to make it public.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 20, 2023, 03:16:16 PM",
      "body": "Quote from: Abzzy on September 20, 2023, 01:55:34 PMWhy consider it a stretch to suggest that Casino Guru might be colluding with casino operators when they openly acknowledge being on the payroll of casinos?Being on the payroll of casinos? You mean those affiliate links on their site, right? This is standard practice on almost all casino review sites. Gambling.com and AskGamblers are probably among the most popular casino review sites, alongside Casino.guru. They all follow a similar financial model, using affiliate links to generate revenue, which allows them to continue offering reviews and maintain their website operations. What alternative funding method would you suggest for such platforms?Quote from: Abzzy on September 20, 2023, 01:55:34 PMYour in-depth knowledge of my situation and the reasoning behind what Casino Guru does raises questions—are you affiliated with them?Now you're just being ridiculous.Quote from: Abzzy on September 20, 2023, 01:55:34 PMI'm simply a user sharing my experiences, supported by four distinct rejections from Casino Guru, each with inconsistent explanations. While my complaint does stem from their refusal to address my concerns, it primarily centers on their reluctance to allow me to post a customer review, not necessarily the dispute.Users have a legitimate expectation to access personal experiences of individuals using the casino, and that's precisely the purpose of a review system.And this is where your argument falls short. Take a look at user reviews for the casino in question: https://casino.guru/Cloudbet-Casino-review#tab=js-tab-reviewsTwo of the three most recent reviews are negative. How do you explain that?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abzzy",
      "created_time": "September 20, 2023, 03:58:12 PM",
      "body": "Quote from: FatFork on September 20, 2023, 03:16:16 PMQuote from: Abzzy on September 20, 2023, 01:55:34 PMWhy consider it a stretch to suggest that Casino Guru might be colluding with casino operators when they openly acknowledge being on the payroll of casinos?Being on the payroll of casinos? You mean those affiliate links on their site, right? This is standard practice on almost all casino review sites. Gambling.com and AskGamblers are probably among the most popular casino review sites, alongside Casino.guru. They all follow a similar financial model, using affiliate links to generate revenue, which allows them to continue offering reviews and maintain their website operations. What alternative funding method would you suggest for such platforms?Quote from: Abzzy on September 20, 2023, 01:55:34 PMYour in-depth knowledge of my situation and the reasoning behind what Casino Guru does raises questions—are you affiliated with them?Now you're just being ridiculous.Quote from: Abzzy on September 20, 2023, 01:55:34 PMI'm simply a user sharing my experiences, supported by four distinct rejections from Casino Guru, each with inconsistent explanations. While my complaint does stem from their refusal to address my concerns, it primarily centers on their reluctance to allow me to post a customer review, not necessarily the dispute.Users have a legitimate expectation to access personal experiences of individuals using the casino, and that's precisely the purpose of a review system.And this is where your argument falls short. Take a look at user reviews for the casino in question: https://casino.guru/Cloudbet-Casino-review#tab=js-tab-reviewsTwo of the three most recent reviews are negative. How do you explain that? Out of the reviews for this casino, there are 9 positive ones and 4 negative ones, creating an even better than 2:1 ratio in the casino's favor. It's worth noting that the negative reviews mainly revolve around customer service and identification issues, with no mentions of license breaches or illegal activities like my review.The 2:1 positive-to-negative ratio seems suspicious, potentially designed to maintain the appearance of honesty while justifying the casino's 8/10 rating, especially since referrals are involved.One can only wonder how many reviews similar to mine are missing, which would undoubtedly tip the scales toward the negative side. Just on bitcointalk.org, there are approximately 70 accusations of scams against Cloudbet, yet only 4 negative reviews on Casino Guru. Quite a contrast, isn't it? 😄",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "September 20, 2023, 08:34:12 PM",
      "body": "These are the images you posted in the OP but did not display because of your rank.--------------------------------------------------Quote from: Abzzy on September 20, 2023, 03:58:12 PMOut of the reviews for this casino, there are 9 positive ones and 4 negative ones, creating an even better than 2:1 ratio in the casino's favor. It's worth noting that the negative reviews mainly revolve around customer service and identification issues, with no mentions of license breaches or illegal activities like my review.The 2:1 positive-to-negative ratio seems suspicious, potentially designed to maintain the appearance of honesty while justifying the casino's 8/10 rating, especially since referrals are involved.One can only wonder how many reviews similar to mine are missing, which would undoubtedly tip the scales toward the negative side. Just on bitcointalk.org, there are approximately 70 accusations of scams against Cloudbet, yet only 4 negative reviews on Casino Guru. Quite a contrast, isn't it? 😄I cannot see any reason to suspect collusion between any casino or online gambling website and Casino Guru. FatFork has basically covered the situation with detailed explanations aptly therefore you should not look to link any form of collusion when it does not exist. Also, just because a forum member presents an alternative vision to the one that you hold, it does not mean they are on the payroll of those that you are making allegations against. Please refrain form that form of conduct.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "September 21, 2023, 09:21:08 AM",
      "body": "If I may add to other explanations already given here, as well as been implied on my previous post, they've put a warning banner when someone from restricted jusrisdiction accessed Cloudbet's page. If they're on casinos's payroll or taking casinos's side at any degree, wouldn't they try to get as many revenue as they can and thus, obscuring or probably won't even bother to put these warning?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abzzy",
      "created_time": "September 21, 2023, 10:07:13 AM",
      "body": "Quote from: holydarkness on September 21, 2023, 09:21:08 AMIf I may add to other explanations already given here, as well as been implied on my previous post, they've put a warning banner when someone from restricted jusrisdiction accessed Cloudbet's page. If they're on casinos's payroll or taking casinos's side at any degree, wouldn't they try to get as many revenue as they can and thus, obscuring or probably won't even bother to put these warning?Casino Guru openly acknowledges its affiliation with the casinos if you ask them. This is not a mere allegation. When you click 'visit casino' on the casino's profile, you're redirected through a referral link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abzzy",
      "created_time": "September 21, 2023, 10:15:31 AM",
      "body": "Quote from: JollyGood on September 20, 2023, 08:34:12 PMThese are the images you posted in the OP but did not display because of your rank.----------https://i.ibb.co/1JF43pD/39-F4-B7-EF-87-EC-4852-A0-CE-B7223-E36-E437.jpg----------https://i.ibb.co/Dpv7ZZ9/6-AE215-EC-EB82-4-EBB-840-D-888-C9-FA98-DF0.png----------https://i.ibb.co/F052c8H/44-F71-D4-F-75-A7-4-DE1-B2-CC-5-B8850605271.png----------https://i.ibb.co/WDDb1dx/1550-B8-AB-4-C64-40-D9-BEF7-DD7-DCC10-DEBF.jpg----------Quote from: Abzzy on September 20, 2023, 03:58:12 PMOut of the reviews for this casino, there are 9 positive ones and 4 negative ones, creating an even better than 2:1 ratio in the casino's favor. It's worth noting that the negative reviews mainly revolve around customer service and identification issues, with no mentions of license breaches or illegal activities like my review.The 2:1 positive-to-negative ratio seems suspicious, potentially designed to maintain the appearance of honesty while justifying the casino's 8/10 rating, especially since referrals are involved.One can only wonder how many reviews similar to mine are missing, which would undoubtedly tip the scales toward the negative side. Just on bitcointalk.org, there are approximately 70 accusations of scams against Cloudbet, yet only 4 negative reviews on Casino Guru. Quite a contrast, isn't it? 😄I cannot see any reason to suspect collusion between any casino or online gambling website and Casino Guru. FatFork has basically covered the situation with detailed explanations aptly therefore you should not look to link any form of collusion when it does not exist. Also, just because a forum member presents an alternative vision to the one that you hold, it does not mean they are on the payroll of those that you are making allegations against. Please refrain form that form of conduct.First of all, I believe in the importance of expressing personal experiences and sharing thoughts openly, especially within a forum section literally titled 'scam accusations.'It's crucial that we maintain a respectful environment for discussing such matters, free from any attempts to discredit or invalidate users who have concerns about their experiences like you and your pals are trying to do.Casino Guru undeniably employs referral links on all  casino profiles on their platform. In the case of Cloudbet, this link leads to a homepage tailored for that referral, with 'best-rated casino' prominently displayed.Their own admission to receiving referral fees adds to the credibility of these claims. To those who doubt these allegations, I encourage you to seek clarification directly from Casino Guru as to whether or not they get paid.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "September 21, 2023, 11:12:04 AM",
      "body": "Quote from: Abzzy on September 21, 2023, 10:15:31 AMCasino Guru undeniably employs referral links on all  casino profiles on their platform. In the case of Cloudbet, this link leads to a homepage tailored for that referral, with 'best-rated casino' prominently displayed.As I've previously explained, all well-established and reputable review platforms use referral links for revenue generation, and this doesn't necessarily compromise their objectivity. And you still haven't addressed my question: What alternative financing method would you suggest for them?Quote from: Abzzy on September 21, 2023, 10:15:31 AMTheir own admission to receiving referral fees adds to the credibility of these claims.But it doesn't. The fact that they are open about it actually gives them credibility. Think logically. Would you rather trust a platform that lacks transparency about its finances, leaving you in the dark about their funding sources?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abzzy",
      "created_time": "September 21, 2023, 11:37:57 AM",
      "body": "Quote from: FatFork on September 21, 2023, 11:12:04 AMQuote from: Abzzy on September 21, 2023, 10:15:31 AMCasino Guru undeniably employs referral links on all  casino profiles on their platform. In the case of Cloudbet, this link leads to a homepage tailored for that referral, with 'best-rated casino' prominently displayed.As I've previously explained, all well-established and reputable review platforms use referral links for revenue generation, and this doesn't necessarily compromise their objectivity. And you still haven't addressed my question: What alternative financing method would you suggest for them?Quote from: Abzzy on September 21, 2023, 10:15:31 AMTheir own admission to receiving referral fees adds to the credibility of these claims.But it doesn't. The fact that they are open about it actually gives them credibility. Think logically. Would you rather trust a platform that lacks transparency about its finances, leaving you in the dark about their funding sources?Why haven't you addressed my question? Why there are over 70 scam complaints about Cloudbet on this platform, yet there are only 4 negative reviews on Casino Guru, a site dedicated to reviews and complaints. If I've been denied the chance to post on Casino Guru, do you honestly think I'm the sole person rejected? Isn't it more likely that there are others, leading to the stark difference in bad reviews between Casino Guru and other platforms? Let's use some common sense here, mate. Im not sure why your so passionate in their defence, Casino Guru are not a horse worth backing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "September 21, 2023, 03:08:47 PM",
      "body": "Quote from: Abzzy on September 21, 2023, 10:07:13 AMCasino Guru openly acknowledges its affiliation with the casinos if you ask them. This is not a mere allegation. When you click 'visit casino' on the casino's profile, you're redirected through a referral link.I'm a bit swamped right now, so I can't do a thorough search at the moment. Can you please provide the link or other reference that clearly states this open acknowledgement that CG is affiliated with casinos upon being asked? Because... I looked at their \"About Us\" page and couldn't find such acknowledgement. What I found is the exact opposite,if you can point us out to this claim, it'll be very much appreciated.Quote from: Abzzy on September 21, 2023, 11:37:57 AMWhy haven't you addressed my question? Why there are over 70 scam complaints about Cloudbet on this platform, yet there are only 4 negative reviews on Casino Guru, a site dedicated to reviews and complaints. [...]And oh, while you're at it, though this topic is about CG and not cloudbet, can you please also list all of those 70+ scam accusations on this board with their link? I'd be more than happy to visit each of the cases and look around when I have more time in hand",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abzzy",
      "created_time": "September 21, 2023, 05:46:49 PM",
      "body": "Quote from: holydarkness on September 21, 2023, 03:08:47 PMQuote from: Abzzy on September 21, 2023, 10:07:13 AMCasino Guru openly acknowledges its affiliation with the casinos if you ask them. This is not a mere allegation. When you click 'visit casino' on the casino's profile, you're redirected through a referral link.I'm a bit swamped right now, so I can't do a thorough search at the moment. Can you please provide the link or other reference that clearly states this open acknowledgement that CG is affiliated with casinos upon being asked? Because... I looked at their \"About Us\" page and couldn't find such acknowledgement. What I found is the exact opposite,https://talkimg.com/images/2023/09/21/6Dk69.jpegif you can point us out to this claim, it'll be very much appreciated.Quote from: Abzzy on September 21, 2023, 11:37:57 AMWhy haven't you addressed my question? Why there are over 70 scam complaints about Cloudbet on this platform, yet there are only 4 negative reviews on Casino Guru, a site dedicated to reviews and complaints. [...]And oh, while you're at it, though this topic is about CG and not cloudbet, can you please also list all of those 70+ scam accusations on this board with their link? I'd be more than happy to visit each of the cases and look around when I have more time in handYou're actually reinforcing my argument here, which is that this information isn't readily available or easily found in their 'about us' section. Instead, they seem to admit it when people specifically ask them.https://casino.guru/forum/general-discussion-1/how-casino-guru-works“Regarding the affiliate systems - we have a team that is responsible for registering into different affiliate systems so whenever we see that some casino gets a decent traffic from our website, we register in their affiliate system”As for your other request, just in this post from 2020 on Bitcointalk, you can uncover 30 scam accusations against Cloudbet on this platform alone along with their respective links.https://bitcointalk.org/index.php?topic=5279500.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JollyGood",
      "created_time": "September 21, 2023, 07:57:04 PM",
      "body": "If you feel Casino Guru have not been useful/fair in your case that should not really negate the fact there are many cases where they have arbitrated without complaint from the accused or accuser. Also, they have concluded in favour of the complainant on many occasions.In the general sense, I am very much against affiliate or referral links to be used in websites that claim they are 100% impartial when they arbitrate (or when they compare websites). If you feel there is something untoward going you will need to provide tangible evidence if you intend to gather support for your claim otherwise it will be something you will continue to believe but most others will not. I do not think FatFork is passionate in defending them, he is stating what you should accept as the obvious.Quote from: Abzzy on September 21, 2023, 11:37:57 AMWhy haven't you addressed my question? Why there are over 70 scam complaints about Cloudbet on this platform, yet there are only 4 negative reviews on Casino Guru, a site dedicated to reviews and complaints. If I've been denied the chance to post on Casino Guru, do you honestly think I'm the sole person rejected? Isn't it more likely that there are others, leading to the stark difference in bad reviews between Casino Guru and other platforms? Let's use some common sense here, mate. Im not sure why your so passionate in their defence, Casino Guru are not a horse worth backing",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "holydarkness",
      "created_time": "September 22, 2023, 09:48:31 AM",
      "body": "Quote from: Abzzy on September 21, 2023, 05:46:49 PMQuote from: holydarkness on September 21, 2023, 03:08:47 PMQuote from: Abzzy on September 21, 2023, 10:07:13 AMCasino Guru openly acknowledges its affiliation with the casinos if you ask them. This is not a mere allegation. When you click 'visit casino' on the casino's profile, you're redirected through a referral link.I'm a bit swamped right now, so I can't do a thorough search at the moment. Can you please provide the link or other reference that clearly states this open acknowledgement that CG is affiliated with casinos upon being asked? Because... I looked at their \"About Us\" page and couldn't find such acknowledgement. What I found is the exact opposite,[image snip]if you can point us out to this claim, it'll be very much appreciated.Quote from: Abzzy on September 21, 2023, 11:37:57 AMWhy haven't you addressed my question? Why there are over 70 scam complaints about Cloudbet on this platform, yet there are only 4 negative reviews on Casino Guru, a site dedicated to reviews and complaints. [...]And oh, while you're at it, though this topic is about CG and not cloudbet, can you please also list all of those 70+ scam accusations on this board with their link? I'd be more than happy to visit each of the cases and look around when I have more time in handYou're actually reinforcing my argument here, which is that this information isn't readily available or easily found in their 'about us' section. Instead, they seem to admit it when people specifically ask them.https://casino.guru/forum/general-discussion-1/how-casino-guru-works“Regarding the affiliate systems - we have a team that is responsible for registering into different affiliate systems so whenever we see that some casino gets a decent traffic from our website, we register in their affiliate system”As for your other request, just in this post from 2020 on Bitcointalk, you can uncover 30 scam accusations against Cloudbet on this platform alone along with their respective links.https://bitcointalk.org/index.php?topic=5279500.0The passage indeed piqued my curiosity, and, as we all here simply act as overseer, a neutral ground, we strive to look for more in-depth truth. I'll say it's very convenient that it's snipped right on that part, while the full explanation actually also inform people that they are not taking payment to boost a rating, which hold a major basis of your argument. I'll provide the statement in a screenshot version, just to maintain originality and transparencyNow, addressing the affiliate system you talked about, I am sure we are all here understand that, especially with the complete paragraphs above, the \"affiliate\" being mentioned here simply refer to \"referral earning\" [which the purpose of it already nicely explained by FatFork] instead of \"affiliate\" in the sense of being a subsidiary or having an official attachment to a platform?Regarding the list, I am not joking when I said I am swamped, thank you for that link, I'll glance at it once I've freed some space from my plate. And since that's about Cloudbet [while this thread is for CG] and I see that you have another thread about cloudbet --which I also haven't read-- I'll probably move this discussion there",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Abzzy",
      "created_time": "September 22, 2023, 04:11:47 PMLast edit: September 22, 2023, 09:51:49 PM by Mr. Big",
      "body": "Quote from: JollyGood on September 21, 2023, 07:57:04 PMIf you feel Casino Guru have not been useful/fair in your case that should not really negate the fact there are many cases where they have arbitrated without complaint from the accused or accuser. Also, they have concluded in favour of the complainant on many occasions.In the general sense, I am very much against affiliate or referral links to be used in websites that claim they are 100% impartial when they arbitrate (or when they compare websites). If you feel there is something untoward going you will need to provide tangible evidence if you intend to gather support for your claim otherwise it will be something you will continue to believe but most others will not. I do not think FatFork is passionate in defending them, he is stating what you should accept as the obvious.Quote from: Abzzy on September 21, 2023, 11:37:57 AMWhy haven't you addressed my question? Why there are over 70 scam complaints about Cloudbet on this platform, yet there are only 4 negative reviews on Casino Guru, a site dedicated to reviews and complaints. If I've been denied the chance to post on Casino Guru, do you honestly think I'm the sole person rejected? Isn't it more likely that there are others, leading to the stark difference in bad reviews between Casino Guru and other platforms? Let's use some common sense here, mate. Im not sure why your so passionate in their defence, Casino Guru are not a horse worth backingWe’re kind of going around in circles here.I understand that there are indeed cases where they side with complainants. If they didn't, their entire Alternative Dispute Resolution (ADR) concept would be undermined and exposed.However, my belief, which I've substantiated with what I consider to be compelling arguments and and my own situation as  evidence, is that they selectively decide which complaints and reviews to accept. It's possible that casinos with highly profitable referral links, generating substantial revenue, receive more leniency. Conversely, certain types of complaints and reviews, like mine, might be turned awayThis is not as far fetched of an argument as you make it seem.Quote from: holydarkness on September 22, 2023, 09:48:31 AMQuote from: Abzzy on September 21, 2023, 05:46:49 PMQuote from: holydarkness on September 21, 2023, 03:08:47 PMQuote from: Abzzy on September 21, 2023, 10:07:13 AMCasino Guru openly acknowledges its affiliation with the casinos if you ask them. This is not a mere allegation. When you click 'visit casino' on the casino's profile, you're redirected through a referral link.I'm a bit swamped right now, so I can't do a thorough search at the moment. Can you please provide the link or other reference that clearly states this open acknowledgement that CG is affiliated with casinos upon being asked? Because... I looked at their \"About Us\" page and couldn't find such acknowledgement. What I found is the exact opposite,[image snip]if you can point us out to this claim, it'll be very much appreciated.Quote from: Abzzy on September 21, 2023, 11:37:57 AMWhy haven't you addressed my question? Why there are over 70 scam complaints about Cloudbet on this platform, yet there are only 4 negative reviews on Casino Guru, a site dedicated to reviews and complaints. [...]And oh, while you're at it, though this topic is about CG and not cloudbet, can you please also list all of those 70+ scam accusations on this board with their link? I'd be more than happy to visit each of the cases and look around when I have more time in handYou're actually reinforcing my argument here, which is that this information isn't readily available or easily found in their 'about us' section. Instead, they seem to admit it when people specifically ask them.https://casino.guru/forum/general-discussion-1/how-casino-guru-works“Regarding the affiliate systems - we have a team that is responsible for registering into different affiliate systems so whenever we see that some casino gets a decent traffic from our website, we register in their affiliate system”As for your other request, just in this post from 2020 on Bitcointalk, you can uncover 30 scam accusations against Cloudbet on this platform alone along with their respective links.https://bitcointalk.org/index.php?topic=5279500.0The passage indeed piqued my curiosity, and, as we all here simply act as overseer, a neutral ground, we strive to look for more in-depth truth. I'll say it's very convenient that it's snipped right on that part, while the full explanation actually also inform people that they are not taking payment to boost a rating, which hold a major basis of your argument. I'll provide the statement in a screenshot version, just to maintain originality and transparencyhttps://talkimg.com/images/2023/09/21/6Wr0J.jpegNow, addressing the affiliate system you talked about, I am sure we are all here understand that, especially with the complete paragraphs above, the \"affiliate\" being mentioned here simply refer to \"referral earning\" [which the purpose of it already nicely explained by FatFork] instead of \"affiliate\" in the sense of being a subsidiary or having an official attachment to a platform?Regarding the list, I am not joking when I said I am swamped, thank you for that link, I'll glance at it once I've freed some space from my plate. And since that's about Cloudbet [while this thread is for CG] and I see that you have another thread about cloudbet --which I also haven't read-- I'll probably move this discussion thereThe only distinction in the screenshot you've shared is that they explicitly mention you can't 'buy' the top position among recommended casinos. Naturally, ofcourse that would be the case otherwise it would undermine and expose their entire Alternative Dispute Resolution (ADR) operation.While they can't openly 'buy' their position, it doesn't mean that Casino Guru doesn't operate in a manner that indirectly protects high-traffic and revenue-generating referral links. In my view, it involves selectively handling certain complaints and reviews to maintain a balanced casino profile, including those like CloudbetYou can try to reframe the 'affiliate' arrangement any way you want, but it doesn't change the fact that they are essentially on casinos' payrolls through referral links. This was a point you seemed uncertain about just a few posts ago, yet I've been highlighting it from the beginning.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}