{
  "id": "topic_5410384",
  "title": "jcojci",
  "author": "jcojci",
  "created_time": "August 18, 2022, 03:19:10 PM",
  "content": "A few weeks ago, I took my nephew shopping at one of the big supermarkets in my city. While waiting for the cashier to count my groceries, my nephew whined about playing a game in one of the corners of the supermarket.My wife was confused because my nephew kept pointing to one of those games. And after exchanging some money for coins, my nephew went straight to the doll claw machine, the UFO Catcher. In one go, my nephew could catch one doll and we were confused and asked each other, how did she catch the doll?An illustration of a doll claw machine or UFO Catcher is below.Source: https://assets.indozone.news/local/5e607e201b1b5.jpgThis kind of game can indirectly teach children about gambling because they buy coins with a certain amount of money to play in certain games. If they can't win, they lose the coins and have to use another coin if they want to play.In some countries, such games are prohibited because games can be equal to gambling, leading to addiction in children.What's your thought? Have you ever played this kind of game?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410384",
  "comments": [
    {
      "author": "qwertyup23",
      "created_time": "August 18, 2022, 03:45:19 PM",
      "body": "There are tons of claw machines (UFO Catcher) in the Philippines. They are easily accessible in arcade places which are visited generally by kids and young adults which can be found on almost every mall. Unfortunately, the game is somehow rigged in a way that the claw is slippery and the spring of the claw is quite impactful. TI tried playing this several times and I never won a prize. There were also times where I would get the doll but as soon as the claw pulls its string back, the impact would cause the doll to fall. This somehow gives me the false impression that I have to try and try again to win the prize.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "August 18, 2022, 04:04:20 PM",
      "body": "Yes, it seems to me that catching and delivering a prize for this kind of machines is not an easy task due to the capture settings and movements of the manipulator, no matter how much I tried, I never managed to catch anything, the manipulator is too fast, and the capture is very sensitive. As for getting used to devices of this type in children, to be honest, I have never seen them have any queue of children, it seems to me even children understand that this is a waste of time.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "August 18, 2022, 04:30:29 PM",
      "body": "I agree these machines should belong to the gambling category. When I was younger I was constantly trying to get some prizes from claw machines, although I never got anything, just wasted my money. Some of them are filled with dolls, others with technological gadgets, candies and in US I know they have machines filled with dollars in paper money. It's common to find plenty of them at malls. At youtube there are channels focused on this kind of activity. There are people who claim they are making a living from this, especially picking dollars with the claw in US, although what actually happens is that players are making it possible for machines' owners to make a living for themselves just by placing those machines in different spots at crowded areas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "avikz",
      "created_time": "August 18, 2022, 05:13:23 PM",
      "body": "I believe we all have played it during our childhood. Such kind of Claw machines are still found in big malls in almost all countries and their main consumers are children. I don't think it's harmful in any way till the time they are catching soft toys and chocolates with it. They do not form gambling habit due to such games. This is something we are overthinking. Gambling is a serious business. When the kids are attracted to money, then it won't be a great thing and that's when the guardians need to get serious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "August 18, 2022, 05:53:27 PM",
      "body": "Quote from: jcojci on August 18, 2022, 03:19:10 PMWhat's your thought? Have you ever played this kind of game?For children it's a fun game, it's a game that most children like, especially girls, with cute and adorable dolls that many children have always dreamed of.That game almost every shopping center such as mall has the game, by using claws, I often do games for my family, unfortunately sometimes it irritates me dozens of coins come in and cards are swiped, always makes me angry, not the doll I got in the claw machine box, really annoying.Maybe, I thought a game like that was easy to play and get, it turned out I was wrong, I just didn't get anything, I think this is a game of picking up dolls, just a game of children's fun and luck, spending 100 coins, one doll gets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Piesel",
      "created_time": "August 18, 2022, 05:53:42 PM",
      "body": "I use to pay for my kids to play such games in the mall and most cases I load some credit on the gaming card so they continue to play until the credit gets exhausted or they keep winning more free spin and credits them from playing the game.Not until now I never have thought of it being considered gambling because I was wired to think that their actions were just for fun but they win some prizes just as we do in real casinos.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panjul07",
      "created_time": "August 18, 2022, 06:09:57 PM",
      "body": "Quote from: jcojci on August 18, 2022, 03:19:10 PMIn some countries, such games are prohibited because games can be equal to gambling, leading to addiction in children.What's your thought? Seriously? Can you give a valid information about countries that ban this kind of game? If the reason is because it can lead to addiction in children then theses countries should ban all kind of games. Basically any kind of game may lead to an addiction including mobile games where children can use money to buy something in order to play the game or to upgrade their account. Quote from: jcojci on August 18, 2022, 03:19:10 PMHave you ever played this kind of game?Sure, it is available to be played in my countries there is no age requirement to play this game. It is just an entertainment, we should not take it as a bad thing that can lead to addiction.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WeedGoW",
      "created_time": "August 18, 2022, 06:19:17 PM",
      "body": "Very popular in Japan among other machines like gacha capsule, slot as Japanese consider them the norm even though they have a gambling element. If you think those UFO catchers only require skill, don't! There is pressure randomness on that grabber to make the game even more unpredictable if the reward in the UFO catchers was at a high value. TBH, I rather gamble where odds are more transparent like sports betting than try my luck with the UFO Catcher.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "acroman08",
      "created_time": "August 18, 2022, 06:27:34 PM",
      "body": "Quote from: jcojci on August 18, 2022, 03:19:10 PMWhat's your thought? Have you ever played this kind of game?Yes, I've played this game before and yeah, it's a form of gambling but a lot of people don't see it that way because the prizes are toys. and to be honest these things are no different than those loot boxes people buy on MMORPG games. what's worse with these claw machines is that majority of them are rigged. the owner of these claw machines can program it so it only gives a reward after \"X\" times of attempts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "August 18, 2022, 06:36:41 PM",
      "body": "Yes, i played several times on those machines when I was younger, there are not very common here in my country but it is possible to find them in Arcade stores.  I never won anything on those machines, to be honest which made me feel a bit disappointed even tho my father warned me that he considered those machines to be basically an \"scam\". I don't regret tohave played on them whatsoever it was part of my chilhood.i assume UFO Catchers will eventually disappear around here, since children now prefer to stay home and play videogames over going out to arcades.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "|MINER|",
      "created_time": "August 18, 2022, 06:40:17 PM",
      "body": "A few years ago I was introduced to this type of game.  I came across this machine at a resort when I was traveling with my wife. I played a few rounds but didn't make much profit.  At one point this game drove me crazy because I'm a very impatient person.  I think this game is perfect for patient people and can also be played in gambling queues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noorman0",
      "created_time": "August 18, 2022, 06:47:18 PM",
      "body": "Yes I saw this game machine a few months ago booming around where I live, they are on the terraces of every grocery store. In the end, the city government issued a ban on the installation of claw machines because it was included in the category of gambling that was not suitable for children to play.Quote from: panjul07 on August 18, 2022, 06:09:57 PMSeriously? Can you give a valid information about countries that ban this kind of game? Malaysia's Ministry of Religion has banned this game since 2019. Although it is not an absolute ban, as long as the majority of Malaysia's population is Muslim, the rule will be an orientation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "August 18, 2022, 06:50:50 PM",
      "body": "If a child is exposed to many things like that then i am sure sooner or later that child will get into gambling since the child wanted to spend some money just to get what he desired that he saw on the machine. Gambling is similar to that where you have to risk your money to earn big bucks. Just educate the child that being a gambler is not a good way to earn money and how it will affect your life not just in financial but also emotional.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cabron",
      "created_time": "August 18, 2022, 07:31:30 PM",
      "body": "Kids wouldn't mind spending real money to play these sort of game because they already think tokens they were using isn't the real money. Its sort of the play money already or chips in casino.I never look at it that way until you pointed it out. Spending those coins to win a stuffed toy sounds like a gamble in a away. I have some nephews who could also catch those toys not just this UFO catcher. Made me gave some coins for them to divert attention so we could catch up with their dad.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "suzanne5223",
      "created_time": "August 18, 2022, 07:38:00 PM",
      "body": "Quote from: Daltonik on August 18, 2022, 04:04:20 PMYes, it seems to me that catching and delivering a prize for this kind of machines is not an easy task due to the capture settings and movements of the manipulator, no matter how much I tried, I never managed to catch anything, the manipulator is too fast, and the capture is very sensitive. As for getting used to devices of this type in children, to be honest, I have never seen them have any queue of children, it seems to me even children understand that this is a waste of time. You have a point because the UFO catcher is a tricky game and winning something big when playing it depends on the fair setting used by the owner, the player's composure, and luck. However, this is another form of gambling, and the player also needs to keep his/her buzz in check to avoid addiction.In the meantime, the fun in it is worth trying the game.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "August 18, 2022, 09:03:52 PM",
      "body": "Quote from: jcojci on August 18, 2022, 03:19:10 PMIn some countries, such games are prohibited because games can be equal to gambling, leading to addiction in children.I confess that I cannot understand how this game could lead children to become addicted when it is a game in which children can only play if their parents have time to take them to the place (which most of the time always is a place very far from people's homes) and children can play, and we also have to take into account that most parents work a lot, so they don't have much time to go for walks with their children and take them to these places. that has these games, so how would kids become addicted to these kind of games if they can't even play constantly, maybe it can even go 1, 2 or more than 3 months without them even playing itQuote from: jcojci on August 18, 2022, 03:19:10 PMWhat's your thought? Have you ever played this kind of game?unfortunately i have never played it, and it is definitely something i would play if i had the opportunity, but here in my country it is very far from where i live and i don't have time to leave the house and go play it, one day i will play itQuote from: nakamura12 on August 18, 2022, 06:50:50 PMIf a child is exposed to many things like that then i am sure sooner or later that child will get into gambling since the child wanted to spend some money just to get what he desired that he saw on the machine. Gambling is similar to that where you have to risk your money to earn big bucks. Just educate the child that being a gambler is not a good way to earn money and how it will affect your life not just in financial but also emotional.children have no idea about the things they do and that's why they hardly get addicted to gambling, because they have many other things to play, for children games are just fun, they don't have goals like: \"I have 10$ so I have to play to get 100$\". Children don't have this mindset, that's why they don't get addicted as easily as adults or young people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "August 18, 2022, 09:22:23 PM",
      "body": "Quote from: Slow death on August 18, 2022, 09:03:52 PMchildren have no idea about the things they do and that's why they hardly get addicted to gambling, because they have many other things to play, for children games are just fun, they don't have goals like: \"I have 10$ so I have to play to get 100$\". Children don't have this mindset, that's why they don't get addicted as easily as adults or young people.Well that's very true. They don't have any idea that when they do play that game is that they are risking something just to get something and which in this case is they risk rheir money to get the doll. Once they know about it then they'll surely do it again by  risking what they have. In my country, age starting from 6 or 7 are already betting against another at the same age or not. I myself was also like that when I was 8 years old and at that time I did experienced where we came to an agreement that we bet our money on which one will win and I did won several times. Anyway, if you compare the total amount of money involved that time versus the total amount of money that a gambler spend on a casino is nothing close but because of that it experience before, I started gambling before I stopped.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "August 18, 2022, 09:25:55 PM",
      "body": "Quote from: qwertyup23 on August 18, 2022, 03:45:19 PMThere are tons of claw machines (UFO Catcher) in the Philippines. They are easily accessible in arcade places which are visited generally by kids and young adults which can be found on almost every mall. Unfortunately, the game is somehow rigged in a way that the claw is slippery and the spring of the claw is quite impactful. TI tried playing this several times and I never won a prize. There were also times where I would get the doll but as soon as the claw pulls its string back, the impact would cause the doll to fall. This somehow gives me the false impression that I have to try and try again to win the prize.Its business!It would be understandable that they would really be that not easy to pull off those dolls considering that the token price to be put up on a slot is cents in equivalent i believe or very cheap.So it would be common sense that it would be a tough one but not impossible since there are people who do able to manage on getting those dolls despite of those claws on being soft and the clamping power isnt really that strong or tight.So play for fun and not trying out to spend up which would be possibly be more than on the prize that you are aiming for.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "August 18, 2022, 09:37:20 PM",
      "body": "Quote from: jcojci on August 18, 2022, 03:19:10 PM...///::,,,What's your thought? Have you ever played this kind of game?I don't know! Sometimes I don't deny that anyone user can are out of that On-Topic/Board route, we all go through it at some point, but what does this game have to do with what we tried to do in the discussion about betting here at gambling.I remember a long time ago someone posted something about some bets of spiders, it involved even minors were involved, it was something bizarre.I never thought that someone could come and try to make a topic of one of the traditional games for adults and children that perhaps exist anywhere in the world and that after so many years since its creation, it is only putting money and knowing what to get an object/thing from game, that's like winning the lottery, haha.Please if this topic reaches page 5, surely close it. Ty.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}