{
  "id": "topic_5451785",
  "title": "tread93",
  "author": "tread93",
  "created_time": "May 07, 2023, 01:34:04 AM",
  "content": "Sooooo I just took a look at my merit and its exactly 350 as of writing, i'm actually not sure how much I have given out but i'm actually curious now as to what my give/take ratio is! I am trying to be more cognizant of giving credit where credit is due. If anyone has any good posts they think are worthy and deserving of merit would you be so kind as to post it in the comments?Anyways every time I see that number I just can't help but think of the South Park episode w/ the couple talking about the Lock Ness Monster asking them for $3.50 lmaooooo here is the video on YT https://www.youtube.com/watch?v=tuh8Hip_B3w On another note, has South Park made any Bitcoin references recently? That other one on the Bank of China call in the restaurant about banning bitcoin gets me every time lmao.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5451785",
  "comments": [
    {
      "author": "EFS",
      "created_time": "May 07, 2023, 02:30:14 AM",
      "body": "https://bpip.org/Profile?id=1978664You've sent 150 merit and earned 350 merit. You can see other details from that link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PowerGlove",
      "created_time": "May 07, 2023, 03:21:16 AM",
      "body": "It's good to spend your sMerit (it won't do anyone any good just leaving it sitting around), and you're already doing a pretty good job I would say; out of the 175 sMerit you've accumulated, you've spent ~86% of it. I've spent ~95% of mine (977/1032.5), and whenever my sMerit balance gets too low (it's at 55, right now) I start to feel like I should slow down a bit and work on some \"big\" posts, so that I can replenish it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "May 07, 2023, 05:54:24 AM",
      "body": "Quote from: PowerGlove on May 07, 2023, 03:21:16 AMIt's good to spend your sMerit (it won't do anyone any good just leaving it sitting around), and you're already doing a pretty good job I would say; out of the 175 sMerit you've accumulated, you've spent ~86% of it. Props to you and tread93 for giving back to the community.  When I'm doing post history reviews on request, sometimes I take a look at how many sMerits members are sending--just out of curiosity; I don't take that into account when I'm actually making a decision whether to merit posts.  I try to gently encourage people to pay it forward when they thank me for showering them with merits, and I hope they do, but it'd take more of a madman than me to keep tabs on stats like that.OP, have you never visited the BPIP site EFS linked to?  If not, I highly encourage you to check it out.  It was Vod's baby before he left the forum, and he did an excellent job with the features.  If I'm not mistaken, suchmoon is now in charge of it (but correct me if I'm wrong).  In any case, it's a site you'll probably want to bookmark.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "May 07, 2023, 06:05:39 AM",
      "body": "Quote from: tread93 on May 07, 2023, 01:34:04 AMSooooo I just took a look at my merit and its exactly 350 as of writing, i'm actually not sure how much I have given out but i'm actually curious now as to what my give/take ratio is!You can use BPIP to get that stats.You can make simple math by yourself. Because you joined the forum after the merit system kickoff in December 2017, you did not receive any airdrop merit. All your merit is earned by yourself. It makes the calculation more simple.Each earned merit will give you 0.5 smerit (sendable merit).With 350 merit (earned), you get 175 smerit (sendable merit).Now, you will know how many smerit you have used, by click on Merit button with any post, you will see how many smerit leftQuoteYou have received a total of 350 merit. This is what determines your forum rank. You typically cannot lose this merit. You have xxx sendable merit (sMerit) which you can send to other people. There is no point in hoarding sMerit; keeping it yourself does not benefit you, and we reserve the right to decay unused sMerit in the future.Calculating total smerit you have used by 175 - x.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crwth",
      "created_time": "May 07, 2023, 07:41:39 AM",
      "body": "Definitely visit the BPIP site, it's definitely worth looking at. Aside from the merits, etc. You can check some rankings that maybe you are of interest.Your reference is funny lol. Loch ness monster wants $3.50. Lol. That might have stuck with you to remember that lol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "WatChe",
      "created_time": "May 07, 2023, 11:52:03 AM",
      "body": "Quote from: PowerGlove on May 07, 2023, 03:21:16 AMIt's good to spend your sMerit (it won't do anyone any good just leaving it sitting around), and you're already doing a pretty good job I would say; out of the 175 sMerit you've accumulated, you've spent ~86% of it. I've spent ~95% of mine (977/1032.5), and whenever my sMerit balance gets too low (it's at 55, right now) I start to feel like I should slow down a bit and work on some \"big\" posts, so that I can replenish it. My ratio is 155/169.5 and that shows I have spent almost 92% of my total sMerits. Its good to send merits to quality posts we see on the forums since that's the only way to encourage a poster.  I am sure by \"big\" you mean a quality post. You don't need to write a lengthy post to get merits, if you have quality in your post then few words can give you good reward.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "May 07, 2023, 01:54:44 PM",
      "body": "Keeping sMerit is not good, you have to spend them so that you can also received. Op you have tried for not keeping yours and looking at them as if they are increasing every day while they are not if you are not receiving. Others have told you where to check the merits stat which you have sent and the ones you have received. Op you have sent 150 merits, earned 350 Merits and S/Ratio is 0.96.  You don't have to wait for members to drop their quality posts here before giving them merits but you can give them whenever you see a good merit worth posts and that is your part of appreciating the post.I have sent 508. I also do the same to give out Merits. Whenever I see a good post I gave merit. Right now my sMerit bank is very low and it contains only 30.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "May 07, 2023, 05:40:18 PM",
      "body": "Quote from: The Sceptical Chymist on May 07, 2023, 05:54:24 AMOP, have you never visited the BPIP site EFS linked to?  If not, I highly encourage you to check it out. I'm still finding my feet here and I've visited BPIP sometimes ago but I didn't understand some of the stats but when I revisited it now and input my username, all the information displayed about my profile were crystal clear to me this time. Vod indeed did a great job.Quote from: The Sceptical Chymist on May 07, 2023, 05:54:24 AMWhen I'm doing post history reviews on request, sometimes I take a look at how many sMerits members are sending--just out of curiosity; I don't take that into account when I'm actually making a decision whether to merit posts.  I try to gently encourage people to pay it forward.Whenever I see a quality post that's worth meriting and if I've some sMerit to throw around I don't hold back because I don't want it to decay. So far I have earned 141 Merit and sent 65 sMerit and I do hope to give more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "May 07, 2023, 07:05:41 PM",
      "body": "Quote from: tread93 on May 07, 2023, 01:34:04 AMi'm actually not sure how much I have given out but i'm actually curious now as to what my give/take ratio is! I am trying to be more cognizant of giving credit where credit is due. If anyone has any good posts they think are worthy and deserving of merit would you be so kind as to post it in the comments?Dear op, IDK, what good answers to your question will bring but i want to share mine with you (haha), well we can check our S/R on the BPIP tool and mine is 0.75 which means i have earned 178 merits and sent 85 merits. Actually, i spent a hell lot of time on bounties and never though to get merits, in fact i used to think we have to buy them or have to ask someone so that they can send you, but when first time i posted in my local community and someone sent me 1 merit, it's all changed. (then i was guided by some local community members) of like how things work here.Since then, i have earned this many merits. Talking of time, i have seen many newbies who were faster than me as they get to understand this forum better than me and thus they contributed more and appreciated more (by merits). well for your query about good posts, then there is a lot you should check mine (hahaha), not asking for merits just kidding, but i think you will find many good posts in the economic or trading section. Quote from: PowerGlove on May 07, 2023, 03:21:16 AMIt's good to spend your sMerit (it won't do anyone any good just leaving it sitting around)...First, i checked your merits i thought you would be legendary and then i saw your rank, i was like \" what!!\" haha, no offense sir, just amazed to see. Actually you have contributed a lot to this forum after reading some of your posts (mostly posted in Meta).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "May 07, 2023, 07:13:31 PM",
      "body": "QuoteYou have received a total of 888 merit. This is what determines your forum rank.You typically cannot lose this merit. You have 9 sendable merit (sMerit) which you can send to other people. There is no point in hoarding sMerit; keeping it yourself does not benefit you, and we reserve the right to decay unused sMerit in the future.Despite this warning and/or encouragement to spend smerits, there are people who never spends their smerits and they have never been penalised for not spending their smerits, it doesn't also stop them from receiving new merits and funny enough, no earned  smerit has ever been decayed",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "May 07, 2023, 10:40:41 PM",
      "body": "Quote from: KingsDen on May 07, 2023, 07:13:31 PMQuoteYou have received a total of 888 merit. This is what determines your forum rank.You typically cannot lose this merit. You have 9 sendable merit (sMerit) which you can send to other people. There is no point in hoarding sMerit; keeping it yourself does not benefit you, and we reserve the right to decay unused sMerit in the future.Despite this warning and/or encouragement to spend smerits, there are people who never spends their smerits and they have never been penalised for not spending their smerits, it doesn't also stop them from receiving new merits and funny enough, no earned  smerit has ever been decayed  I believe merits are supposed to be circulated, there is no benefit in hoarding merits. I don’t know why some users choose to hoard smerits, maybe their criteria for sending merits is high and they hardly see posts that they feel deserves merit or it could be they are just too lazy to find and merit quality posts. While I do not think the number of smerits sent by a person should determine if that person should receive merits, I do believe the pressure on merit sources will reduce if other members spend their smerits on quality posts.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "May 07, 2023, 11:30:29 PM",
      "body": "Quote from: KingsDen on May 07, 2023, 07:13:31 PMDespite this warning and/or encouragement to spend smerits, there are people who never spends their smerits and they have never been penalised for not spending their smerits, it doesn't also stop them from receiving new merits and funny enough, no earned  smerit has ever been decayed  There will never be a penalty for hoarding sMerit and never sharing it. But this is also one of the links between users, and how loyal you are to other people's posts that have good quality and deserve merits. This also relates to the law of reciprocity, whoever gives will receive. If you are loyal to other users' quality posts or threads, then you will get the same or more merits when there are quality posts or threads that you create.I spend my sMerit on some deserving users.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TelolettOm",
      "created_time": "May 08, 2023, 12:16:55 AM",
      "body": "Quote from: EFS on May 07, 2023, 02:30:14 AMhttps://bpip.org/Profile?id=1978664You've sent 150 merit and earned 350 merit. You can see other details from that link.Besides BPIP, we can check merit details on Ninjastic Space.  https://ninjastic.space/user/tread93I also often use ninjastic space to know my post stats, activity overview, or merit information.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "May 08, 2023, 08:38:01 PM",
      "body": "bpip site actually gives you full details and a total rundown of users profile, including their activeness, progress and recognitions as well as most trusted users. The very first time I explored the site it was very helpful, I think few people already explained it for you maybe just take your time to download the chrome extension if you are using PC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KingsDen",
      "created_time": "May 08, 2023, 09:28:50 PM",
      "body": "Quote from: SatoPrincess on May 07, 2023, 10:40:41 PMQuote from: KingsDen on May 07, 2023, 07:13:31 PMQuoteYou have received a total of 888 merit. This is what determines your forum rank.You typically cannot lose this merit. You have 9 sendable merit (sMerit) which you can send to other people. There is no point in hoarding sMerit; keeping it yourself does not benefit you, and we reserve the right to decay unused sMerit in the future.Despite this warning and/or encouragement to spend smerits, there are people who never spends their smerits and they have never been penalised for not spending their smerits, it doesn't also stop them from receiving new merits and funny enough, no earned  smerit has ever been decayed  I believe merits are supposed to be circulated, there is no benefit in hoarding merits. I don’t know why some users choose to hoard smerits, maybe their criteria for sending merits is high and they hardly see posts that they feel deserves merit or it could be they are just too lazy to find and merit quality posts. While I do not think the number of smerits sent by a person should determine if that person should receive merits, I do believe the pressure on merit sources will reduce if other members spend their smerits on quality posts. It might not be that their criteria for sending merits is very high, it is just unwillingness to send merits.You know some persons follow principles to the later, it could be that those who don't spend their smerits are practicing the principle of holding. As they hodl their btc, they also hold their smerits. It's sounding silly right? But to me it's making a sense. It could be that they believe that in the future, merits could be monetized and they would definitely become merit millionaires.And then, hence they aren't merit sources, they owe no one obligations to spend their smerits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "May 08, 2023, 10:01:59 PM",
      "body": "Quote from: KingsDen on May 07, 2023, 07:13:31 PMQuoteYou have received a total of 888 merit. This is what determines your forum rank.You typically cannot lose this merit. You have 9 sendable merit (sMerit) which you can send to other people. There is no point in hoarding sMerit; keeping it yourself does not benefit you, and we reserve the right to decay unused sMerit in the future.Despite this warning and/or encouragement to spend smerits, there are people who never spends their smerits and they have never been penalised for not spending their smerits, it doesn't also stop them from receiving new merits and funny enough, no earned  smerit has ever been decayed  Possibly these users are just too lazy to merit a post or find it stressful when the browser creates another tab to merit a post before returning back to the main page. Hopefully when Smerit are being decayed in the future, users will begin to pay more attention to their Smerit and would send them all out before they get decayed. I don’t know if it’s cool or not, but that feature won’t be a bad one either…lol",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oneandpure",
      "created_time": "May 09, 2023, 04:32:51 AM",
      "body": "You can tracking about your merit statistic from how many merit sending and receiving by using this link bpip, put your Bitcointalk username and search there will show about account statistic from merit received last 30 days, last 60 days until last 120 days. Its seems easy for user have received many points merit and try for joining signature campaign without have count manually and I sure all Bounties Manager will use this method for counting the signature campaign participants. You can tracking which one user have more contribution sending merit to your account there, lets tryhere your account merit statistic",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "May 09, 2023, 10:48:41 AM",
      "body": "Quote from: KingsDen on May 07, 2023, 07:13:31 PMDespite this warning and/or encouragement to spend smerits, there are people who never spends their smerits and they have never been penalised for not spending their smerits, it doesn't also stop them from receiving new merits and funny enough, no earned  smerit has ever been decayed  Perhaps that's the reason no one is fretting that theymos' warning could be carried out eventually. Nonetheless, it's a selfish idea to hoard merit since it doesn't also even benefit the user hoarding it. What's the need then?From https://bpip.org/Profile?p=Tread93 data, OP has earned a total of 350 merits and has despatched a total of 161 merits to 52 profiles. That leaves OP with 350 – (161*2) = 350 – 322 = 28.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "May 09, 2023, 11:25:43 AM",
      "body": "Quote from: tread93 on May 07, 2023, 01:34:04 AMSooooo I just took a look at my merit and its exactly 350 as of writing, i'm actually not sure how much I have given out but i'm actually curious now as to what my give/take ratio is! I am trying to be more cognizant of giving credit where credit is dueMaybe some don't really have interest in sending others smerit or they often forget to do so, or probably they also don't know how to identify such post that may deserve merit,  but as everyone has said, hoarding smerit profit not, but that doesn't mean one should give to any post that does not deserve getting a merit, such being low quality post, though it's our right and responsibility to choose and descern who to give but we must also never forget the quality post assessment needed before meriting someone.Quote from: tread93 on May 07, 2023, 01:34:04 AMIf anyone has any good posts they think are worthy and deserving of merit would you be so kind as to post it in the comments?There are many merit giveaway threads that has their rules and standards as requirements for eligibility, it will make sense doing that through any of those threads than on replies where it may sound off topic if the thread is not all about application for merit or review.Quote from: The Sceptical Chymist on May 07, 2023, 05:54:24 AMProps to you and tread93 for giving back to the community.  When I'm doing post history reviews on request, sometimes I take a look at how many sMerits members are sending--just out of curiosity; I don't take that into account when I'm actually making a decision whether to merit posts.  I try to gently encourage people to pay it forward when they thank me for showering them with merits, and I hope they doUnlucky enough for me, i think I've made it up to your ignore list since am unable to apply for your review through PM on my profile, i wish you can give it another opportunity for me to apply back as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}