{
  "id": "topic_5412641",
  "title": "edward500",
  "author": "edward500",
  "created_time": "September 06, 2022, 07:46:57 PM",
  "content": "I think I made a mistake buying at $23,500 (obviously), so when should I really start to panic now that we dropped to $18K?At what price point now should I consider to add more to average in at? Like, if you owned a bitcoin at $23,500, would you wait for $10K or 15K to start adding more to average in your high price of $23,500?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5412641",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "September 06, 2022, 07:52:06 PM",
      "body": "1 BTC equals to 1 BTC. This is an unrealized loss, you do not have to panic, check the price history of bitcoin and see the good reason not to panic. If you can hold for like 2 years, you can just leave it there and see when the bull run will start. I will not advice you to sell in loss if you do not need the money for anything now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oilacris",
      "created_time": "September 06, 2022, 08:25:08 PM",
      "body": "Quote from: edward500 on September 06, 2022, 07:46:57 PMI think I made a mistake buying at $23,500 (obviously), so when should I really start to panic now that we dropped to $18K?At what price point now should I consider to add more to average in at? Like, if you owned a bitcoin at $23,500, would you wait for $10K or 15K to start adding more to average in your high price of $23,500?Hold your position as long you dont still need some funds or do still able to live and survive then its not really that wise on making some panic sell.Where you should average down? current price would be asweet spot but if we do talk about technicals then price could go down as deep as $13k but it wont be an assured thing to happen and its up to someone whether they would able to take risk or not.This is very subjective because we dont really have different perception and views towards the market but you should bare up into your mind that you shouldntpanic sell and its the worst thing to be done on a bear market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jackg",
      "created_time": "September 06, 2022, 09:06:00 PM",
      "body": "$14-17k looks like a good price to buy in next imo if we do indeed go that low..If we don't, would you be more confident buying a rise than buying a drop as that might be the next best thing you can look at doing - if we get there too after waiting a while just to confirm it wasn't a bull trap.I don't think $20k will be that hard a price to reach again but we might be stuck down here for a while so you might want to get used to it a bit - also if you'll ever panic sell you might want to consider not investing too much while th ings are this uncertain (selling at a loss is something that's possible if you think you'll panic/get annoyed with the market and just sell).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "STT",
      "created_time": "September 06, 2022, 09:38:22 PMLast edit: June 11, 2023, 11:39:45 PM by STT",
      "body": "Its only a mistake if you are compelled to sell, come here before the buy to discuss I guess might be best.    Its a rough market sure, I was noticing the price was stuck sideways or what I would call a triangle neither up or down.   It has now broken that sequence, we went down:So the triangle holding pattern wasnt really a buy it was a wait and see observation, I guess you were higher and a prior price range anyway.   Resolving downwards like this looks bad, however recovery can and will happen and we judge by the quality of that recovered price.     So quite a simple target, 19200 we need to trade above this and hold it as a low.   4hr bar, daily and then weekly is best to decide a buy/hold type decision.    Theres lots of time and  development needed now, we can recover just have to check how its acting and gauge vs your expectation and hopes.   Anyone new I would recommend to buy over 12 months, split it up dont hope to guess the bottom just be glad all these prices make your BTC purchased far larger then previous buyers so you are better off in this long term view.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OgNasty",
      "created_time": "September 06, 2022, 09:53:26 PM",
      "body": "If any price drop for BTC would leave you in a panic, you are already overinvested.  However, it is the time to start dollar cost averaging into Bitcoin.  I would recommend setting up weekly or bi-weekly buys and letting it run for a while without worrying about the price.  If you buy through this bear market, you will come out stronger on the other side.  Just make sure you aren't investing too much, because you won't want to sell for the next 2 years.  Check back on the price in 2025 and you'll be glad you ignored the noise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "September 06, 2022, 09:58:28 PM",
      "body": "Quote from: OgNasty on September 06, 2022, 09:53:26 PMIf any price drop for BTC would leave you in a panic, you are already overinvested.  However, it is the time to start dollar cost averaging into Bitcoin.  I would recommend setting up weekly or bi-weekly buys and letting it run for a while without worrying about the price.  If you buy through this bear market, you will come out stronger on the other side.  Just make sure you aren't investing too much, because you won't want to sell for the next 2 years.  Check back on the price in 2025 and you'll be glad you ignored the noise.the OP is looking at short term here, hence, he is too worried about the price. if he will look at the price on a daily basis, for sure, he is already feeling panic here. but should remind himself, what is his goal why he invested on this market? in my opinion, you can panic if you think btc market is slowly fading its popularity and no one is talking anymore about its existence. but for now, i believe, there's nothing to worry. just one of the bearish seasons of this market.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Scripture",
      "created_time": "September 06, 2022, 09:58:42 PM",
      "body": "Now you have to be more patient and hold longer. The price is down again but you should not sell at panic instead buy again later on to average down the cost. $18k might be more possible to happen now because of so many failed attempts to break the resistance. BTC can still go down though. If you are just doing trades, it’s good to always have a cut loss price so you can know when to stop but it looks like you are still not familiar with the market, and miss to sell short.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Swordsoffreedom",
      "created_time": "September 06, 2022, 10:02:23 PM",
      "body": "Quote from: edward500 on September 06, 2022, 07:46:57 PMI think I made a mistake buying at $23,500 (obviously), so when should I really start to panic now that we dropped to $18K?At what price point now should I consider to add more to average in at? Like, if you owned a bitcoin at $23,500, would you wait for $10K or 15K to start adding more to average in your high price of $23,500?You don't make a single mistake, once you haven't sold you won't have any loss here. The first thing you should keep in mind once you have decided to buy, never think that it is the bottom of the market but that it is the right price at which you should begin your buy. Bitcoin can still continue to fall but will definitely rise again later, don't put too much pressure on yourself, relax.Bitcoin investing is a long term investment so don't panic and sell at a loss on short term volatility, let's look at the long term, bitcoin has never dropped in the long term. Currently, we are at $19k and if bitcoin goes below $18k then you can DCA from there, I think that will be the right distance for us to make a new buy order.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "South Park",
      "created_time": "September 06, 2022, 10:19:28 PM",
      "body": "Quote from: edward500 on September 06, 2022, 07:46:57 PMI think I made a mistake buying at $23,500 (obviously), so when should I really start to panic now that we dropped to $18K?At what price point now should I consider to add more to average in at? Like, if you owned a bitcoin at $23,500, would you wait for $10K or 15K to start adding more to average in your high price of $23,500?You could begin to DCA even right now, however I think that before you do that you need to really question yourself about your goals in this market, the price of 23k was a good entry point, you bought at a price which is only a third from the highest price bitcoin reached, that is good enough and over the long term you will get great profits, and yet you are worried about your investment due to the current drop, so you need to do some soul searching before you put more money into a market which could keep going down during the next months.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "September 06, 2022, 10:28:41 PM",
      "body": "Quote from: edward500 on September 06, 2022, 07:46:57 PMI think I made a mistake buying at $23,500 (obviously), so when should I really start to panic now that we dropped to $18K?At what price point now should I consider to add more to average in at? Like, if you owned a bitcoin at $23,500, would you wait for $10K or 15K to start adding more to average in your high price of $23,500?It's your choice to make your decision, because at this moment any decisions you make is the perfect one. A situation like this, the best option is to hold the coin either or weather it's increasing or decreasing more or more than the price stage you bought, the best suggestion is to allow it to propagate before you sell. Because if you panic to sell having in mind that it will continuously decreasing, i believe that it will prompt you to sell and also adventure into lost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "examplens",
      "created_time": "September 06, 2022, 11:51:17 PM",
      "body": "if you urgently need that money then close everything and cash out. if you have the possibility to wait, then definitely hold.Just remember that someone bought it when the value was $53500. of course, some of them don't panic and are waiting for the market to return.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oceat",
      "created_time": "September 06, 2022, 11:59:04 PM",
      "body": "There's no need to panic anyway even if you bought your BTC at the ATH it's still the same as 1 BTC, unless if you needed the money which is in fiat dollar then you should have to panic since you lost some of your investment. But overall if you are only investing and planning to go for long term that's just enough while holding and extending your patience or do something that won't consume your time looking always at the market.Besides, it's an accumulation phase since this is the bear market and you are just on the right time to buy, you just have to work your patience though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "September 07, 2022, 02:58:07 AM",
      "body": "As others pointed out, this is as much dependant on your need for cash. If you were looking to hold for less than a year, in order to take profits at higher levels, it could be considered buying a bit early. But given you bought around the 200 Week MA (4 Year average), maybe intentionally, then if you intend to hold for this similar period of time (4 years minimum), then $23.5K isn't a bad price whosoever, even if price does drop down to half that. If price did fall to around ~$12K, but that level became the low and price swiftly recovered, than $23.5K wouldn't be seen as a bad entry level imo. It'd be similar to around $6K in 2018.If you otherwise want to keep things very simple, then you could buy more (same amount ideally) at 400 Week MA (8 Year Average) if it get's there in order to get a better average. This would be around $13.1K, would would also be around 50% lower than your current entry. If price only get's to $14K and doesn't reach this target, and instead rebounds strong, then you'd likely have little to worry about in the immediate term.At least you are asking the right question on when to average more. There is a strong argument for if $17.5K low is broken then price can fall significantly lower, so I'd avoid trying to re-buy that level personally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "September 07, 2022, 03:18:09 AM",
      "body": "Bitcoin ATH is 69k $ and compared to the price you bought it, you bought it at a very cheap price, many people bought bitcoin at a higher price than you and they are still holding and focusing on DCA. you should define bitcoin as an investment for the future and long term should not panic when the price goes down because bitcoin fluctuates non-stop, no market can only go up without going down.You can DCA from now on and bitcoin can also drop further or not. So think twice before putting more money into the market. Be consistent and firm with your decision whether the market continues to dump or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Don Pedro Dinero",
      "created_time": "September 07, 2022, 04:25:28 AM",
      "body": "Quote from: edward500 on September 06, 2022, 07:46:57 PMI think I made a mistake buying at $23,500 (obviously), so when should I really start to panic now that we dropped to $18K?Yes, you have made a mistake, but not the mistake you are thinking of. The mistake is buying bitcoin expecting it to go up in the short term rather than for what it is. Also, I think you have started to panic.The best thing you can do is to inform yourself very well about what bitcoin is and stop making short term bets with it as if you were trying your luck at the casino.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pooya87",
      "created_time": "September 07, 2022, 05:05:18 AM",
      "body": "All those who think like this have to first ask themselves a very important question: why did I buy bitcoin?Did you buy bitcoin to make a quick profit?Then you made mistake buying bitcoin regardless of the price, bitcoin is not going to give you quick profit. It is too risky for that specially at times like this when the market is very unpredictable and manipulation is at highest.Did you want to make a long term investment?In which case there is nothing wrong with buying at $23.5k. It was a good price to buy at since nobody can see the future and the analysis says bitcoin is currently undervalued regardless of how much lower the price goes. For any future purchase I'd wait a little to see how effecting this current market manipulation is before deciding what the bottom is to start buying.Long term investment is at least a year or two.Did you want to day trade?In which case you should be actively buying and selling bitcoin in all dips and rises not just any specific price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Reatim",
      "created_time": "September 07, 2022, 05:34:38 AM",
      "body": "Quote from: edward500 on September 06, 2022, 07:46:57 PMI think I made a mistake buying at $23,500 (obviously), so when should I really start to panic now that we dropped to $18K?At what price point now should I consider to add more to average in at? Like, if you owned a bitcoin at $23,500, would you wait for $10K or 15K to start adding more to average in your high price of $23,500?the right question here is that \"What is your capacity to keep your coin and how long you can wait\" because if you wanna deal with panicking then better to sell all your coins now and remain nothing .this is not the place for you to keep in risky market like this.I would advise you mate to please keep your funds inside your folio and forget the market for a while .I know this is hard but if you will look into what the market manage all this years? then you will understand that Holding is the best tools to profit here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "September 07, 2022, 07:53:20 AM",
      "body": "Quote from: edward500 on September 06, 2022, 07:46:57 PMI think I made a mistake buying at $23,500 (obviously), so when should I really start to panic now that we dropped to $18K?At what price point now should I consider to add more to average in at? Like, if you owned a bitcoin at $23,500, would you wait for $10K or 15K to start adding more to average in your high price of $23,500?No, you bought bitcoin at a pretty good price. However, you made the mistake of not researching the volatility of bitcoin before investing, it is very normal for bitcoin to drop in price. Looks like you invest in bitcoin and you expect bitcoin to increase continuously so you can profit. Let go of that silly thinking if you want to continue investing in bitcoin, bitcoin is not a fast food box that we can indulge in quickly. Bitcoin profits come from long-term holding and only those who end up can enjoy its rewards.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kotajikikox",
      "created_time": "September 07, 2022, 10:03:31 AM",
      "body": "Quote from: edward500 on September 06, 2022, 07:46:57 PMI think I made a mistake buying at $23,500 (obviously), so when should I really start to panic now that we dropped to $18K?that wasn't a mistake mate instead that is a normal way of buying when you fully trust the market you are investing , buying at high shows us how you believe in bitcoin to climb in the future.QuoteAt what price point now should I consider to add more to average in at? Like, if you owned a bitcoin at $23,500, would you wait for $10K or 15K to start adding more to average in your high price of $23,500?just let that 23k price in your folio and only buy more in the coming months or at least this September will make us have a chance to buy more in much lower prices.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}