{
  "id": "topic_5432568",
  "title": "Dr.Bitcoin_Strange",
  "author": "Dr.Bitcoin_Strange",
  "created_time": "January 01, 2023, 12:01:12 AM",
  "content": "An early apology to the moderator if this is a scored up thread, but being the first topic of mine created on this board, it's been 2 months and 21 days on this forum, and it really has been worth something for me to have expressed my opinions, unlearned some misinformation, and learned something new about Bitcoin transaction delays, double spending, paper wallets, the lighting network, hardwear wallets, and more.Happy New Year, everyone, and thanks to every friend from afar, side admirer, and member who helped me grow. I express my gratitude in this thread. Thanks!",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432568",
  "comments": [
    {
      "author": "Timelord2067",
      "created_time": "January 01, 2023, 12:38:23 AM",
      "body": "Dang - I was going to do the same thing and remind people - New Year = New You.Time to reset your passwords.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tipeform$",
      "created_time": "January 01, 2023, 01:32:06 AM",
      "body": "Say goodbye to the year 2022..... Happy New Year 2023.  🌄Good morning 🌄--Happy New Year to all our bitcoin forum members.  And may the future of Bitcoin continue to move towards a bright future from today.  Today 1 January 2023 every man can spend time with his family.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "January 01, 2023, 01:37:22 AM",
      "body": "Happy New Year. Still a few hours away for me but a decent portion of the world has celebrated the new year already. I wish you all the best for 2023 and remember to get health checks throughout 2023 so nothing creeps up on you or your families.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "January 01, 2023, 02:19:13 AM",
      "body": "OP, at least I've seen 2 similar threads in the META that @Lafu and @BlackBoss_ created. why did you add one more?although everyone has their initiative. but it's important to read and find out first before creating a thread. and it would be wiser for you to post in an existing thread and lock your thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Timelord2067",
      "created_time": "January 01, 2023, 07:11:51 AM",
      "body": "Quote from: Awaklara on January 01, 2023, 02:19:13 AMOP, at least I've seen 2 similar threads in the META ... why did you add one more?Probably because like me they probably don't go into META too often?Quotealthough everyone has their initiative. but it's important to read and find out first before creating a thread. and it would be wiser for you to post in an existing thread and lock your thread.Let's all start the new year with good wishes for each-other and let people decide for themselves where they want to post.(the first of your two links was started on 2018-12-24, 05:03:43 while the second thread was started 2022-12-20, 18:29:34 - both have \"Christmas\" in their title and the second thread was locked a week ago...)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Free Market Capitalist",
      "created_time": "January 01, 2023, 07:19:06 AM",
      "body": "Quote from: yahoo62278 on January 01, 2023, 01:37:22 AMHappy New Year. Still a few hours away for me but a decent portion of the world has celebrated the new year already. I wish you all the best for 2023 and remember to get health checks throughout 2023 so nothing creeps up on you or your families.Yes, in another thread I said that for this year 2023 I wish the forum members above all good health and good personal relationships. This is a Bitcoin forum and it is normal that we put the perspective on it, on an economic/financial component of life and the best element created to store and transfer wealth, but first you have to have good health and a good relational environment. Best wishes to you, yahoo62278, that all goes well and you have a fresh start in 2023. We will be waiting to hear from you and your return to the forum when you are fully recovered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "January 01, 2023, 12:53:44 PM",
      "body": "Quote from: Awaklara on January 01, 2023, 02:19:13 AMOP, at least I've seen 2 similar threads in the METAif you visit the Beginners & Help board you will also find a thread with the same purpose. but this is Christmas and new year. everyone will celebrate. it doesn't matter where they post, as Timelord2067 said, not everyone is active and visits all the boards on the forum. a similar thread may exist on the local board as well. but that won't be a problem, they just want to share congratulations to all forum members.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bobrox",
      "created_time": "January 01, 2023, 01:26:10 PM",
      "body": "I don't think with serious problem about similar topic have been exist before on other board, I know with topic made by @Dr.Bitcoin_Strange about \"Happy New year Bitcointalk\" have created before on META board, but why some of you never complaint about many similar topic made actually in gambling board.There are have duplicate topic made about Primer League discussion until with several sport predicting have created early and coming another person made new topic with similar discussing.I want to said \"happy new year for Bitcointalk user\" wish in 2023 have better than last year and actually always in healthy and having better financial freedom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "skarais",
      "created_time": "January 01, 2023, 01:40:44 PM",
      "body": "Quote from: Dr.Bitcoin_Strange on January 01, 2023, 12:01:12 AMHappy New Year, everyone, and thanks to every friend from afar, side admirer, and member who helped me grow. I express my gratitude in this thread. Thanks!Happy new year to you too, and keep hoping for the best to keep motivating yourself to be better.There are a lot of goals that we need to write down, but the most important thing is which one we are most likely to achieve in 2023. I needed to set that target from January 1st so I'm really focused on achieving it, and maybe you need to set it too. New year should be a new passion for something realistic, and staying healthy is also important.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 01, 2023, 09:52:56 PM",
      "body": "I almost started thinking I messed up on my first thread on this board with @Awaklara's word, but what do I know 🥴? I just felt to share the new year's joy with the forum after dismissal from church service in the early hours of today. I guess I was too excited and did not search to see if such a thread existed. but is just a compliment to the season.Thanks @skarais.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Coyster",
      "created_time": "January 01, 2023, 10:14:13 PM",
      "body": "Quote from: yahoo62278 on January 01, 2023, 01:37:22 AMHappy New Year. Still a few hours away for me but a decent portion of the world has celebrated the new year already. I wish you all the best for 2023 and remember to get health checks throughout 2023 so nothing creeps up on you or your families.Quite right, health is wealth is a very popular axiom, and it is true; we cannot use Bitcoin if we aren't healthy, we can do prolly nothing if our health fails us, so health checks are very important in detecting problems early and finding possible solutions to them.Yahoo our hearts are definitely solidly with you, get ready for a fun-filled 2023 because soon i believe everything will be over and you will be fine and healthy. Happy New Year to every bitcointalk user, in sound health and wealth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "January 01, 2023, 10:36:53 PM",
      "body": "Quote from: Coyster on January 01, 2023, 10:14:13 PMQuote from: yahoo62278 on January 01, 2023, 01:37:22 AMHappy New Year. Still a few hours away for me but a decent portion of the world has celebrated the new year already. I wish you all the best for 2023 and remember to get health checks throughout 2023 so nothing creeps up on you or your families.Quite right, health is wealth is a very popular axiom, and it is true; we cannot use Bitcoin if we aren't healthy, we can do prolly nothing if our health fails us, so health checks are very important in detecting problems early and finding possible solutions to them.Yahoo our hearts are definitely solidly with you, get ready for a fun-filled 2023 because soon i believe everything will be over and you will be fine and healthy. Happy New Year to every bitcointalk user, in sound health and wealth.Maybe 2024 will be fun filled. I had open heart surgery in 2021 and it took at least 6 months to heal up where I could even sleep on my side, let alone go out in public feeling ok. I am assuming this surgery will be 6 months or longer as well. So depending on when the surgery happens, it'll be late 2023-end of 2023 before I'm feeling healed up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Awaklara",
      "created_time": "January 02, 2023, 02:05:32 AM",
      "body": "Quote from: Timelord2067 on January 01, 2023, 07:11:51 AMLet's all start the new year with good wishes for each-other and let people decide for themselves where they want to post.Yes, everyone would want to start this year with something good. also with good wishes. I think you know what I mean, it's no good seeing if 100's members create their thread on the same topic.If there is already a place that has existed for a long time and is still active, why not join the existing one?but I can accept your explanation, not all members are active in META, maybe the OP didn't check it first.Quote from: Pandu Geddon on January 01, 2023, 12:53:44 PM but that won't be a problem, they just want to share congratulations to all forum members.As I said before. it might even become a habit like the achievement thread that members create every time they reach a new rank. it was fine at first, but maybe after a bit longer, it starts to get annoying.but really, this is just a congratulation. I probably shouldn't mind it too much.Quote from: Dr.Bitcoin_Strange on January 01, 2023, 09:52:56 PMI almost started thinking I messed up on my first thread on this board with @Awaklara's word, but what do I know 🥴? no problem, maybe I'm just overdoing it. didn't mean to pressure you with your thread. I hope you understand what I mean to you.hope you have a nice day.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "reagansimms",
      "created_time": "January 02, 2023, 02:28:48 AM",
      "body": "There is still a long way to go, what happened in 2022 is a beautiful memory even though there are several targets that have not been achieved. 2023 is the right year to fix many things that have been delayed, hopefully in the new year there will be lots of beautiful surprises and success waiting for you. New year, new enthusiasm, new work, new hopes, and of course continue to have discussions with great people.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LDL",
      "created_time": "January 02, 2023, 02:50:25 AM",
      "body": "Happy New Year 2023Our journey with the determination to welcome the new year, forgetting all the sorrows, disappointments and disputes of the old year.Wishing good health and well-being to all those for whom the year 2022 was full of sorrow and hardship, I wish that the year 2023 brings endless prosperity and prosperity in their lives.Especially this year 2023 is very important for @yahoo62278 one of the respected and well known in our forum.  Everyone knows that he is seriously ill and is going to have a major surgery in 2023.  We all wish him well and good health.  I pray that God heals him and that he may spend his next life with great happiness and endless joy.ThanksAll Bitcoin forum members",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "January 02, 2023, 04:33:54 AM",
      "body": "Quote from: Awaklara on January 01, 2023, 02:19:13 AMOP, at least I've seen 2 similar threads in the META that @Lafu and @BlackBoss_ created. why did you add one more?He's fishing for merits, that's all there is to it.  In fact, OP sent me a PM in which he acknowledged that he read my thread in which I said I'm not taking any new requests for post history reviews and then went on to fucking request a review.  So hey OP, you got put on my PM ignore list for being such a selfish idiot.  Hate to be harsh, but your PM was beyond stupidity.Happy new year, blah blah blah.  No more Mr. nice guy in 2023.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "January 02, 2023, 04:58:25 AM",
      "body": "Quote from: The Sceptical Chymist on January 02, 2023, 04:33:54 AMQuote from: Awaklara on January 01, 2023, 02:19:13 AMOP, at least I've seen 2 similar threads in the META that @Lafu and @BlackBoss_ created. why did you add one more?He's fishing for merits, that's all there is to it.  In fact, OP sent me a PM in which he acknowledged that he read my thread in which I said I'm not taking any new requests for post history reviews and then went on to fucking request a review.  So hey OP, you got put on my PM ignore list for being such a selfish idiot.  Hate to be harsh, but your PM was beyond stupidity.Happy new year, blah blah blah.  No more Mr. nice guy in 2023.Guy has enough merit to be a full member, why does he want a post review? I like to help users out who are close to ranking up as it is a little tougher than the old days, but I also believe those that put some effort into posting will get the merits they seek eventually. @OP pissing members off that are merit sources isn't really a smart move is it? Why the hurry to get merits?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "January 02, 2023, 05:21:28 AM",
      "body": "Quote from: yahoo62278 on January 02, 2023, 04:58:25 AMGuy has enough merit to be a full member, why does he want a post review? Greed?  Manipulation?  Who knows?  And the thing is, I did take a look at his posts and while he certainly puts effort into most of them, a lot of what he writes is disjointed rambling and often with a very strong religious tone.  Had he not been such a bonehead and ignored the guidance I gave everyone about post reviews I might eventually have been able to help him out once requests slowed down.Some people, you know?  Can't read, didn't read, ignored what they read....there's a lot of ambition on this forum that's not matched by writing ability or intelligence or morals.  Been seeing it for years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "January 02, 2023, 10:42:07 AM",
      "body": "Quote from: Awaklara on January 02, 2023, 02:05:32 AMno problem, maybe I'm just overdoing it. didn't mean to pressure you with your thread. I hope you understand what I mean to you.hope you have a nice day.I guess not; you are doing your best to keep the forum clean from spam. I understand and I appreciate it. Thanks.Quote from: The Sceptical Chymist on January 02, 2023, 04:33:54 AMHe's fishing for merits, that's all there is to it.  In fact, OP sent me a PM in which he acknowledged that he read my thread in which I said I'm not taking any new requests for post history reviews and then went on to fucking request a review.  So hey OP, you got put on my PM ignore list for being such a selfish idiot.  Hate to be harsh, but your PM was beyond stupidity.Happy new year, blah blah blah.  No more Mr. nice guy in 2023.I really can't say for sure how the forum judges someone based on their post. But the intention of this post was really not to fish for merit; out of sincerity of heart, joy, and excitement for a new year, I made it. I created this post on the 31st and saved it on my draft, saying to myself, \"I will be the first person to wish the forum a happy new year.\" (No hidden intentions.)Woow 😯🥴,  did I  screwed up this time? .. sir, it's really depressing to find out that my messages angered you, owing to the fact that the year just started and with me pissing off someone like yourself in this forum. If I am not yet on your ignore list, I plead guilty and ask for a second chance. My messages may have been centered on selfishness, but that's really not what it is, sir. I just wanted to get your thoughts and advice on my posting style. Back then, in school, if a lecturer reviews a student's work, they apparently give a comment (either good or bad), and that is exactly what I meant when I said review and advice. Quote from: yahoo62278 on January 02, 2023, 04:58:25 AM@OP pissing members off that are merit sources isn't really a smart move is it? Why the hurry to get merits? People have their intentions for every action they take, but if you ask me, I never intended to piss him off. It's true I have enough merit to be a full member, but being a full member by rank alone and not in knowledge, does it make any sense? My request to him was not to cause a fight; I guess he was right when he said my PM is beyond stupidity, but it is just painful to mean something in a fair approach, but it gets interpreted the other way around.Quote from: The Sceptical Chymist on January 02, 2023, 05:21:28 AMGreed?  Manipulation?  Who knows? Not any of it sir. QuoteAnd the thing is, I did take a look at his posts and while he certainly puts effort into most of them,a lot of what he writes is disjointed ramblingIt seems like I still got the review, just the way I meant it. Thanks.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}