{
  "id": "topic_5439517",
  "title": "tread93",
  "author": "tread93",
  "created_time": "February 11, 2023, 09:44:22 PM",
  "content": "Okay guys, what are they doing here? And in other countries? Any thoughts?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439517",
  "comments": [
    {
      "author": "OgNasty",
      "created_time": "February 11, 2023, 10:14:14 PM",
      "body": "The China spy balloon is sort of old news now.  People are now talking about the UFO balloon shot down over Alaska, apparently in a place called cumtown.  Cumtown was then trending on Twitter, which is pretty funny if you think about it.  Still no word on whether the UFC is aliens or another spy balloon or possibly an actual weather balloon.  It does seem that instead of a circular white balloon, this one was a cyndrical silver object, which makes it somewhat unique.  I am concerned that China is surveying our military bases and shooting down green lasers from their satellites.  Hopefully that's fine.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gyfts",
      "created_time": "February 11, 2023, 10:26:16 PM",
      "body": "https://www.pbs.org/newshour/show/new-details-about-chinese-balloons-spying-capabilities-revealed-by-u-sApparently these balloons have spanned numerous countries and contain advanced onboard equipment that's used for surveillance. So we know China is spying on other countries.The one shot down in Alaska was shot down because it interfered with civilian airspace, allegedly. Biden administration has given excuses that these air balloons existed in the previous administration, an allegation that Trump officials deny (even the ones that left on a sour note). Seems like the government did not want this story to let out. Wonder what they were trying to hide.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hispo",
      "created_time": "February 12, 2023, 01:11:54 AM",
      "body": "Nothing too weird if you think about it, the chinese government wants to have better resolution of the planet and their adversaries from the sky, I assume satellite images are not enough anymore for whatever reason.China spies on everyone, so USA spies on all of us and them. Basic spying going on.I have read that Biden does not want to be criticized any more and accidentally ordered to shoot down an alien vessel.Let us expect our secret over lords to fire him at 2024.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tread93",
      "created_time": "February 12, 2023, 03:01:54 AM",
      "body": "Quote from: OgNasty on February 11, 2023, 10:14:14 PMThe China spy balloon is sort of old news now.  People are now talking about the UFO balloon shot down over Alaska, apparently in a place called cumtown.  Cumtown was then trending on Twitter, which is pretty funny if you think about it.  Still no word on whether the UFC is aliens or another spy balloon or possibly an actual weather balloon.  It does seem that instead of a circular white balloon, this one was a cyndrical silver object, which makes it somewhat unique.  I am concerned that China is surveying our military bases and shooting down green lasers from their satellites.  Hopefully that's fine.Yeah, and another object shot down by a US fighter jet in Canada today! So wild. The green lasers thing is wild, matrix type stuff here. And then silver object that sounds like a UFO. Wtf is happening in this world we live in lmao",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}