{
  "id": "topic_5458905",
  "title": "God Of Thunder",
  "author": "God Of Thunder",
  "created_time": "July 07, 2023, 01:05:09 AM",
  "content": "What happened:  A phishing scam website asks users to connect their wallet before clicking on anything. Websites linkCode: https://stakedao.clalm.xyz/, https://clalm.xyz/The funny thing is the first website is hosted on a subdomain of clalm.xyz which is the main phishing website. I don't know if this domain has multiple subdomains of phishing scams. If you visit both domains, you will notice that you cannot click anywhere on this website. Whenever I click on any links, it asks me to connect my wallet first. Here is the domain info:Code:Domain InformationDomain:clalm.xyzRegistrar:NamecheapRegistered On:2023-06-02Expires On:2024-06-02Updated On:2023-06-26Status:serverTransferProhibitedclientTransferProhibitedName Servers:cory.ns.cloudflare.comerin.ns.cloudflare.comTheir website footer says they have been on the market since 2021, while their domain info shows the domain was registered a month ago",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5458905",
  "comments": [
    {
      "author": "BD Crypto",
      "created_time": "July 07, 2023, 04:52:50 AM",
      "body": "Quote from: Learn Bitcoin on July 07, 2023, 01:05:09 AMWhat happened:  A phishing scam website asks users to connect their wallet before clicking on anything. Hi Learn Bitcoin , It would be better if you ad the original website link of Stake Dao platform in your thread. Because that will help to get more clarification. It's a staking platform and have some investment strategies.Original Website Link: https://stakedao.orgAnyway these types of web3 based Phising sites are now a lot in crypto space. Basically scammers create these Phising sites and they target to trap community members from Telegram, Twitter or Discord. They either create fake community group or send this Phising link in the member's inbox. Fake Stake Dao Telegram Group:  Code:https://t.me/stakedao_tokenn",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "July 07, 2023, 02:26:07 PM",
      "body": "Quote from: BD Crypto on July 07, 2023, 04:52:50 AMHi Learn Bitcoin , It would be better if you ad the original website link of Stake Dao platform in your thread. Because that will help to get more clarification. It's a staking platform and have some investment strategies.Original Website Link: https://stakedao.org Thanks for adding the original website link. I didn't even know that there was a platform named Stakedao. I thought this was just a typical web3 scam website that wanted to connect users' wallet and drain it. It looked like a phishing but I didn't search for the original website. QuoteBasically scammers create these Phising sites and they target to trap community members from Telegram, Twitter or Discord. They either create fake community group or send this Phising link in the member's inbox. Yes, I found this link from a social media group as well. It seems this is their main channel to scam people. Anyways, Thanks again for the original link.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}