{
  "id": "topic_5427802",
  "title": "noormcs5",
  "author": "noormcs5",
  "created_time": "December 11, 2022, 09:04:05 AM",
  "content": "Well, we all know Tether has issues and many people say that USDC is much safer than USDT which is not true according to this research. Although this tweet is few months old but it is a moment of concern. All of these coins USDT, and USDC and even BUSD are not safe. The Algorithmic stable coins like Dai can also lose their peg against the dollar in a crisis situation.In this situation, what can be the best way to store our stable coins  https://twitter.com/CryptoInsider23/status/1542027718677504002",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5427802",
  "comments": [
    {
      "author": "Jawhead999",
      "created_time": "December 11, 2022, 09:17:06 AM",
      "body": "Quote from: noormcs5 on December 11, 2022, 09:04:05 AMAll of these coins USDT, and USDC and even BUSD are not safe. The Algorithmic stable coins like Dai can also lose their peg against the dollar in a crisis situation.This is why I never trust in anything that link with \"centralization\" because of the are scam or has poor security. If you mention the risk of holding DAI is, DAI can't survive during crisis situation, then explain to me which fiat money can survive during crisis situation?  None!Fiat also lose it's value when crisis happen, this is why DAI need a time to adjust with the current fiat price. Actually that's a risk of holding stable coin, but it has nothing to do with a centralization risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "December 11, 2022, 09:26:38 AM",
      "body": "Quote from: noormcs5 on December 11, 2022, 09:04:05 AMIn this situation, what can be the best way to store our stable coins  BITCOIN!Dollar and dollar base stablecoins are just a medium of exchange not a place to store wealth. You store walth in commodities, stocks, real estate.But to be honest I think its just a FUD. Stablecoins is a serious game with big money. You can't have better stable coin. Stable coin is stable coin. So the only way to convince custommers to use your is to FUD the other one. The author claims that circle can't keep money in the bank without losing money...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "December 11, 2022, 09:47:25 AMLast edit: May 15, 2023, 05:10:00 PM by pawanjain",
      "body": "Quote from: noormcs5 on December 11, 2022, 09:04:05 AMIn this situation, what can be the best way to store our stable coins  https://twitter.com/CryptoInsider23/status/1542027718677504002We have seen how decentralized stable coins can lose their value although DAI is still safer but we never know what might happen.We know how Tether has been rumored to fake its reserves and now the same is happening with USDC.In this case one thing we can acknowledge is that holding stable coins is not a good choice.So the ideal solution to this is don't hold stable coins at all. Directly buy bitcoin with fiat money and otherwise keep holding bitcoin or altcoins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "December 11, 2022, 10:49:42 AM",
      "body": "Quote from: pawanjain on December 11, 2022, 09:47:25 AMSo the ideal solution to this is don't hold stable coins at all. Directly buy bitcoin with fiat money and otherwise keep holding bitcoin or altcoins.Yes, i agree to this part that buying bitcoin is a safer bet at least in the current bear season. Convert all your stablecoins in bitcoin and hold bitcoin. The more chances are bitcoin will rise from here or even if it goes further down, it will be for very short time.The problem will arise, in the next bull season. At that moment, you will want to convert your money in stablecoins when bitcoin is at 50,000$, 100,000$, or 150,000$. At that time, it will not be a good idea to keep money in bitcoin. So we need a reliable stable coin before the end of the next bull cycle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "December 11, 2022, 11:40:48 AM",
      "body": "Quote from: noormcs5 on December 11, 2022, 09:04:05 AMWell, we all know Tether has issues and many people say that USDC is much safer than USDT which is not true according to this research. Although this tweet is few months old but it is a moment of concern. All of these coins USDT, and USDC and even BUSD are not safe. The Algorithmic stable coins like Dai can also lose their peg against the dollar in a crisis situation.In this situation, what can be the best way to store our stable coins  I don't use USDC, I use BUSD because most of me trade on Binance, but in the end, I don't trust anyone including BUSD, even though I'm using them daily. Everything is centralized, there is no such thing as safe, so don't compare, look at FTX they are always overrated and safe until crash. So don't compare which is better but use it wisely, don't keep it for too long, only use it when the need arises. Between stable coin and fiat, I would choose fiat.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 11, 2022, 01:02:22 PM",
      "body": "Quote from: noormcs5 on December 11, 2022, 09:04:05 AMIn this situation, what can be the best way to store our stable coins  CASH only!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RealMalatesta",
      "created_time": "December 11, 2022, 02:03:04 PMLast edit: December 11, 2022, 03:09:20 PM by RealMalatesta",
      "body": "Quote from: zasad@ on December 11, 2022, 01:02:22 PMQuote from: noormcs5 on December 11, 2022, 09:04:05 AMIn this situation, what can be the best way to store our stable coins  CASH only!If you are saving cash means literally you are losing every year approximately 5% of your saving as global average inflation rate for current times is around that. When we are talking about crypto stable coins are not safer to store value, we must need to remember government's cash are practically danger to our saving. If you prefer cash to store your wealth then I guess you may go risking your wealth even with anything as cash got guaranteed depression of 5% whereas most investment things got at least 10% chances for appreciations.Quote from: noormcs5 on December 11, 2022, 09:04:05 AMAll of these coins USDT, and USDC and even BUSD are not safe. The Algorithmic stable coins like Dai can also lose their peg against the dollar in a crisis situation.We do not have much options for the need of stable coin hence we need to depend on one of these. USDT is the first and long running hence we may assume it may last forever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "December 11, 2022, 02:16:58 PMLast edit: December 13, 2022, 01:37:25 PM by mindrust",
      "body": "No stable coin is safe. The sooner people understand this the better it is for everyone. Stable coins require your trust to operate. You don’t need to trust anybody when using bitcoin. Stable coins are centralized, require your trust and these are against the ideals of crypto completely. Crypto itself is rock solid and can endure any attack but this, this is not a direct attack at crypto. These unbacked tokens artificially shoot up the crypto asset prices and that made everybody feel good but when these tokens disappear all the hell will break loose. The problem is, tether shouldn’t have existed in the first place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "janggernaut",
      "created_time": "December 11, 2022, 02:20:05 PM",
      "body": "There was UST, then got depeged, then HUSD, got depeged again, now we have USDC, USDT & BUSD as the other options. Many people converted their FIAT to stablecoins, just in case bitcoin or other coins falling, they can buy it with their stablecoins because its \"stable\". Even if USDC got depeged, we still have BUSD & USDT, if BUSD depeged, we still have USDT, but if USDT depeged, we are done. No any stablecoin anymore should be trusted",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "December 11, 2022, 02:34:58 PM",
      "body": "Even with big peg these stablecoins arent really gonna make us safe. Yes in crypto world the importance of stablecoin are being valued at. But to be more safe is hold your actual fiat to be more precisely safer. In trading I think usdt is much better to use due to massive volume but this isnt decentralized as it can be. Frozen asset were recorded foe such accounts in the past. Means even at this point it can happen to anyone. Stablecoin like ust before is trusted and become a trash token now due to destabilisation of its system which could happen again to any of these.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "December 11, 2022, 03:22:08 PM",
      "body": "Quote from: noormcs5 on December 11, 2022, 09:04:05 AMWell, we all know Tether has issues and many people say that USDC is much safer than USDT which is not true according to this research. Although this tweet is few months old but it is a moment of concern. All of these coins USDT, and USDC and even BUSD are not safe. The Algorithmic stable coins like Dai can also lose their peg against the dollar in a crisis situation.I trust BUSD caused by has backed by the real money. I don't even trust DAI caused by it's only gimmick. Algorithmic stable token was BS. All of things in the crypto have the same issue. Quote from: noormcs5 on December 11, 2022, 09:04:05 AMIn this situation, what can be the best way to store our stable coins  You have no choice other than converting your stable token into the native coin like bitcoin but will you deal with the volatility in the native coin? This is the main question for you as you are feeling worried to hold stable token but you have no choice other than using it to keep your value from volatility. It's better if you are waiting for CBDC to be launched and that will be the safe thing to keep your value stable",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Maidak",
      "created_time": "December 11, 2022, 03:30:31 PM",
      "body": "Quote from: janggernaut on December 11, 2022, 02:20:05 PMEven if USDC got depeged, we still have BUSD & USDT, if BUSD depeged, we still have USDT, but if USDT depeged, we are done. No any stablecoin anymore should be trustedSo far, all three are stable, but in my opinion, they are not reliable, don't wait for an incident to be alert, it's too late. They are all centralized coins and can crash or freeze our assets anytime. The influence of stablecoins on the market is vast but let's always be careful and take precautions because anything can happen, don't forget the death of UST.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "December 11, 2022, 03:40:36 PM",
      "body": "Quote from: noormcs5 on December 11, 2022, 09:04:05 AMWell, we all know Tether has issues and many people say that USDC is much safer than USDT which is not true according to this research. Although this tweet is few months old but it is a moment of concern. All of these coins USDT, and USDC and even BUSD are not safe. The Algorithmic stable coins like Dai can also lose their peg against the dollar in a crisis situation.In this situation, what can be the best way to store our stable coins  So far i only heard about the issues with USDT with their funds and that they don't tell us what their reserves are and that we therefore can not really be sure, how those reserves look like and if they even exist at all. In that context it was always mentioned, that USDC was way more secure and reliable than USDT, because the company behind USDC is Coinbase which is based in the United States. That means that Coinbase obviously has to comply to US-american laws and standards and so far i always thought that they are pretty strict and therefore that Coinbase and USDC is audited and checked regularly. I always thought USDC really have enough funds to cover every USDC 1:1 with a real USD. I have to take a deeper look.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "December 11, 2022, 03:48:16 PM",
      "body": "I think is only whenever they want to convert their coin before stablecoin could be used maybe when they seems the market is not stable just as the dip some weeks ago, holders could convert to USDC, USDT, BUSD, DAI and any other stable coin out there. Naturally investment are being left on bitcoin and with any other cryptocurrencies. All less the attack is being launched when there are much holders of USDC.Have this in back of your mind, no stablecoin are reliable and trusted with 100 percent sure so any breakdown would likely occur that is why is best to hold reputable coin just as bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Odusko",
      "created_time": "December 11, 2022, 04:30:03 PM",
      "body": "Quote from: zasad@ on December 11, 2022, 01:02:22 PMQuote from: noormcs5 on December 11, 2022, 09:04:05 AMIn this situation, what can be the best way to store our stable coins  CASH only!Best advice, if everything is falling against the dollar then the best currency to hold in time of crisis is cash which will be the saving grace of the moment,  and if one wants to hold anything aside from cash then the best shout is bitcoin. But that should be on a long term base, because even the bitcoin market is also affected by this current market crisis, USTD or other stablecoins can fall at any time since their algorithm is centralized the developer can take an exit at any time and everything will drop back to zero.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "December 11, 2022, 07:44:35 PM",
      "body": "If there's no other option then I'd like to agree about cash, it's somewhere safe and there's no need to worry about with it. But you still need to look at how's your economy doing then it should be bitcoin. If you just want to store wealth and value, cash and then look for some other assets where it might grow together with the inflation. I guess we all have these issues with the stable coins and we need to be wary with all of them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "December 11, 2022, 08:28:21 PM",
      "body": "In my opinion USDT and USDC are not obviously completely safe, infact you hardly find a complete safe stablecoin now. But I see it as taking the one with the less poison.Popularity wise I don’t think it gets better than USDT. I don’t know if there has been any complaints in the past about it. Most crypto-currency related services payment are don’t using it, so I would say it’s been the safest to me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 11, 2022, 09:12:35 PM",
      "body": "Well with the way the market is moving in the last couple of days and then stable coins also being one of those people claiming as not safe then so be it. I just have like a couple of hundreds of USDT not USDC, not that big so maybe I won't be affected as others when it collapse.And with that we don't know which stable coin is good at this point because they are all vulnerable right now.Specially about Algorithmic stable coins as the OP said, I guess it's more prone to collapse than stable coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "December 11, 2022, 09:43:56 PM",
      "body": "If there’s another FUD about stable coins, we might not be able to break the resistance again and maybe we stay longer on this bear trend. There’s an on-going issue with USDT and yes, USDC is not safe either. The best thing to do right now is to buy Bitcoin and instead of buying stable coins, a big collapse might still happen and that could be the worst to happen. Let’s see how they will handle this and let’s see if they can survive.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}