{
  "id": "topic_5439366",
  "title": "alecano38",
  "author": "alecano38",
  "created_time": "February 10, 2023, 04:34:33 PM",
  "content": "Hi everyone, I have a Whole Rack with 16 s19Jpro divided in 4 rows of 4 each. The problem is sometimes, The power company cuts only 1  of the 3 Phases, so two of the rows stay of, and in consecuent hot air start to enter the cold zone through the Offline ASICs of the OFF ROw, so, all temp in ON asics start to increase, and is a problem. I decided tu put manually a sheet of plastic glass on hotzone, on  the rear of the Offline ASICS, so when power will come back, the power of the fans themselves will put the sheet out and everything ok again. I made this temporal, anyone has another thing taht solve this Issue. Thanks a lot.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5439366",
  "comments": [
    {
      "author": "BitMaxz",
      "created_time": "February 10, 2023, 07:25:32 PM",
      "body": "What exactly does your room look like and what places of your units?Do you have any images to show the room and position of the whole rack?We can't suggest if we don't know exactly what they look like.Why not swap the power from your 2 first and 2nd rows to the 3rd and 4th rows since you said the company sometimes cuts the power? That's what I think would be the best option depending on their position or having an extra exhaust might work to bring the hot air out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "February 10, 2023, 08:01:01 PM",
      "body": "Adding to what BitMaxz said the can room layout accommodate some other fans to keep the air moving in the direction you want? Can you get an exhaust fan on the hot zone side that spins up when the power drops on one of the phases so you can force the air out of the room?How long is the power out for? And you might want to play a bit with the setup. There might be a layout of the 4 x 4 that you have that even when you loose a phase the other running miners on either side are forcing enough air in the proper direction that it can't come back. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "February 12, 2023, 11:33:47 AMLast edit: February 12, 2023, 01:13:07 PM by mikeywith",
      "body": "Quote from: BitMaxz on February 10, 2023, 07:25:32 PMWe can't suggest if we don't know exactly what they look like.Why not swap the power from your 2 first and 2nd rows to the 3rd and 4th rows since you said the company sometimes cuts the power? That's what I think would be the best option depending on their position or having an extra exhaust might work to bring the hot air out.I think I can answer your question, in a 3-phase system, there is a limited amount of amps on which you can draw on each phase, you can't just move the load from L1 to L2 and expect everything to work unless the wirings are oversized, and by oversized, I mean doubled, it's also pretty damn stupid for the power company to cut just one phase at a time, it puts extreme pressure on their transformers, every transformer I saw is protected by a phase failure relay which will shut down the low end of the transformer when one of the phases is absent.With that said you have two options:1- Split the cold/hot side of the miner using a split room design, so you have a cold aisle and a hot one, you can use sheet metal, MDF or foam board, this will prevent hot air from entering the cold side as it will have to pass through the heatsinks of the \"OFF miners\".2-Create a negative pressure zone on the exhaust side by adding an exhaust fan attached to the wall which faces the miners' exhaust fans, air moves from positive to negative, so even 2 rows off, the air will still go from the cold side to the hot side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alecano38",
      "created_time": "February 13, 2023, 08:06:05 PM",
      "body": "Thanks a lot for your replies, I will add a diagram and photos of my setup to see my case. Thanks again",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}