{
  "id": "topic_5454618",
  "title": "Bitcoadvice",
  "author": "Bitcoadvice",
  "created_time": "May 31, 2023, 10:33:25 AM",
  "content": "Hello friends, while browsing the Internet, I discovered a fake cryptomixer that pretends to mix several cryptocurrencies. However, this one is fake and will steal money of every victim who uses Mymixer.io (SCAM) site. The Scammer has bought reviews on Trustpilot and Sitejabber and uploads Youtube videos en masse on hacked/stolen Youtube channels like here:https://www.youtube.com/watch?v=frCWNd6WdZIhttps://www.youtube.com/watch?v=TmLvVoEVPoQhttps://www.youtube.com/watch?v=kIRX4MZwQ6IThe Videos can be reported, but Youtube is pretty slow doing something against this if they ever do anything at all.These are just 3 of them, they got more and keep uploading more.They also hack/steal Twitter accounts and abuse them to promote their fake bitcoin mixer and other fraudulent crypto services like here:https://twitter.com/RaziaKhan_0/status/1651124935345987585https://twitter.com/crypto_moneky/status/1616729821807271938They can be reported too there but Twitter is a bit like Youtube on this Topic.Fraudsters use in this case social engineering, they do upload between their scams some authentic videos to trick the support teams. That is how they can stay longer alive. They got a full network of fake crypto mixers.The phishing domain MyMixer.io is registered with Registrar.eu registrar, as of 31.05.2023 and can be reported to them here: https://abuse.registrar.eu/Please beware of the !SCAM!phishing site MyMixer.io.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454618",
  "comments": [
    {
      "author": "Cantsay",
      "created_time": "May 31, 2023, 10:40:34 AMLast edit: May 31, 2023, 11:00:19 AM by Cantsay",
      "body": "I rarely use mixers and the only one I have used in the past was whirlwind.money so I doubt I'd easily fall a victim for this site.As per the site they are relatively new and not even up to two months yet according to whois.comCode:Domain:mymixer.ioRegistrar:Hosting Concepts B.V. d/b/a Registrar.euRegistered On:2023-04-14Expires On:2024-04-14Updated On:2023-04-19Status:clientTransferProhibitedName Servers:scott.ns.cloudflare.comkeira.ns.cloudflare.comhttps://www.whois.com/whois/mymixer.ioAnd for new sites it's hard to come across any bad reviews since all the review you'll see are paid reviews or those testing the site and a new site with bad motive will always serve those reviewing their site well so there could get more people, I will continu my search to see if I can find more information about the mixer.EditI just went throught their Trustpillot reviews and for a site that's still new to have recieved those negative reviews shows that truly they are not to be trusted. That also applies to the youtube videos link in OP all two of them are the same video posted by different channels with bots praising the mixer, this is the main reason why newbies have being adviced countless number of time to stay away from crypto influencers that are constantly shilling different projects.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hugeblack",
      "created_time": "May 31, 2023, 11:02:59 AM",
      "body": "I think you got it wrong, the phishing link is that scam site imitates the same reputable real site. What is happening here is scam not phishing.The design of the site looks professional, but it says that they are CoinJoin technology, so it is better to use reliable services instead of an unknown site, since the mixing service is based mainly on trust.Overall, thank you for reporting and I hope no one will fall victim to such scam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitcoadvice",
      "created_time": "May 31, 2023, 11:36:35 AM",
      "body": "Quote from: Cantsay on May 31, 2023, 10:40:34 AMI rarely use mixers and the only one I have used in the past was whirlwind.money so I doubt I'd easily fall a victim for this site.As per the site they are relatively new and not even up to two months yet according to whois.comCode:Domain:mymixer.ioRegistrar:Hosting Concepts B.V. d/b/a Registrar.euRegistered On:2023-04-14Expires On:2024-04-14Updated On:2023-04-19Status:clientTransferProhibitedName Servers:scott.ns.cloudflare.comkeira.ns.cloudflare.comhttps://www.whois.com/whois/mymixer.ioAnd for new sites it's hard to come across any bad reviews since all the review you'll see are paid reviews or those testing the site and a new site with bad motive will always serve those reviewing their site well so there could get more people, I will continu my search to see if I can find more information about the mixer.EditI just went throught their Trustpillot reviews and for a site that's still new to have recieved those negative reviews shows that truly they are not to be trusted. That also applies to the youtube videos link in OP all two of them are the same video posted by different channels with bots praising the mixer, this is the main reason why newbies have being adviced countless number of time to stay away from crypto influencers that are constantly shilling different projects.These are bidding, stolen and hacked Youtube channels that are misused to promote their fraud. The channels were adapted by the scammers in each case to gain the trust of. Positive Trustpilot reviews can also be purchased online, the scammers pay attention to this. Nowadays it is not a particularly decisive point.victims so that they would send more crypto money to them.Quote from: hugeblack on May 31, 2023, 11:02:59 AMI think you got it wrong, the phishing link is that scam site imitates the same reputable real site. What is happening here is scam not phishing.The design of the site looks professional, but it says that they are CoinJoin technology, so it is better to use reliable services instead of an unknown site, since the mixing service is based mainly on trust.Overall, thank you for reporting and I hope no one will fall victim to such scam.In any case, you can call it a scam, but nevertheless the fake site appears to be real and authentic, which is also part of phishing.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "May 31, 2023, 03:44:57 PM",
      "body": "The mixer is for real scamming. I made some research on the mixer site, the features of the site very much attractive so I went further to see the site review in trustpilot and this is what I saw there.You can check this about the above image https://au.sitejabber.com/reviews/mymixer.io/amp",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "May 31, 2023, 11:20:22 PM",
      "body": "Thanks OP for posting this. You can't expect Google/YouTube and even Facebook to take these scam and phishing websites to be down as soon as possible. But as soon as you're able to report them, they'll deal with it. That's what we can hope for them because if we will just rely on them and no one reports these type of websites, they'll not filter and won't remove it unless someone reports it.With a tough competition gone to the market of mixers, they'll keep coming and only a few legitimate will remain because it's like a gold rush for the genuine ones but as well as for the scammers.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "June 01, 2023, 02:23:29 AM",
      "body": "Quote from: Bitcoadvice on May 31, 2023, 11:36:35 AMIn any case, you can call it a scam, but nevertheless the fake site appears to be real and authentic, which is also part of phishing.Phishing usually refers to a website that mimics a real service and scams its users in this case, while a scam is just that, a scam. For example, there is a phishing website that pretends to be a Coinomize website that I wear on my signature, but they are not the real ones. If a service claims to do one thing but do not do that even if its design looks amazing, people just call them a scam. Anyway, there are too many phishing mixer websites out there so it's a good thing you posted a notice here. CMIIW.People should not rely on search results or online public reviews if they want to find a mixer anyway. I do believe looking for reviews on this forum is way better if you want to know whether a mixer service is legitimate or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "khaled0111",
      "created_time": "June 01, 2023, 08:36:08 PM",
      "body": "This scam website is a copy-paste of [banned mixer] (I knew I've seen it before the moment I opened it), they just changed the logo/buttons color from purple to blue.It's obvious the scammer is going to great lengths to promote his fake website and spread its link everywhere.Thank you OP for exposing it and I encourage everyone to report it to the domain registrar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "albon",
      "created_time": "June 01, 2023, 11:59:55 PM",
      "body": "Quote from: Bitcoadvice on May 31, 2023, 10:33:25 AMHello friends, while browsing the Internet, I discovered a fake cryptomixer that pretends to mix several cryptocurrencies. However, this one is fake and will steal money of every victim who uses Mymixer.io (SCAM) site. The Scammer has bought reviews on Trustpilot and Sitejabber and uploads Youtube videos en masse on hacked/stolen Youtube channels.Scammers are trying with all their might to harass customers of crypto mixers, so they create a lot of scam domains with names similar to the original mixer domain. I'm sure they're spending a lot of money for their scam domains and fake mixers to spread everywhere, they buy YouTube reviews and promote their fake domains with Google Ads and social media, and they could create a signature campaign here on the forum. In any case, there are a lot of honest mixers here on the forum, and by doing your research, you can choose the right mixer without falling victim to a new mixer through a promoted phishing link. Through the mixers Announcements topics here, and reviews of trusted members, you can be sure you will put your assets in the right place.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}