{
  "id": "topic_5417624",
  "title": "NotATether",
  "author": "NotATether",
  "created_time": "October 19, 2022, 08:17:16 AM",
  "content": "I have read some good reviews about Bitstamp from other forum members here who've been using them for several years.But recently their trustpilot page got flooded with 1-star reviews accusing them of blocking withdrawals of even KYC'ed accounts and basically stealing the money: https://www.trustpilot.com/review/bitstamp.netWhat's going on here? Have they gone rogue?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5417624",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "October 19, 2022, 08:40:46 AM",
      "body": "Quote from: NotATether on October 19, 2022, 08:17:16 AMWhat's going on here? Have they gone rogue?Maybe. Or maybe not. But best to use reputed exchanges that has excellent reviews and ratings.If there are good ratings on reviewing sites, it can be fake or paid for, but I do not know how poor/bad reviews and ratings can be than being a truthful review. Maybe this is manipulatimed, but I do not think so. It would be better to use a reputed exchange with positive reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "October 19, 2022, 09:11:47 AM",
      "body": "Quote from: NotATether on October 19, 2022, 08:17:16 AMWhat's going on here? Have they gone rogue?There was quite a scandal in July when they wanted to charge some sort of inactivity fee (https://bitcointalk.org/index.php?topic=5405505) I'm almost sure that also got them a fair amount of negative reviews.I've stopped using their service back then, since I've taken it as a sign that something may no longer be OK there.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "October 19, 2022, 09:58:09 AM",
      "body": "Quote from: NeuroticFish on October 19, 2022, 09:11:47 AMThere was quite a scandal in July when they wanted to charge some sort of inactivity fee (https://bitcointalk.org/index.php?topic=5405505) I'm almost sure that also got them a fair amount of negative reviews.I've stopped using their service back then, since I've taken it as a sign that something may no longer be OK there.That is possible, that could be part of the reason, but the few reviews that I checked are more about how Bitstamp scammed them, how the they were unable to withdraw, withdrawal problem that was unsolved and others issues related to scam. I only read just few of the negative reviews, probably some could be because of other reasons too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Solosanz",
      "created_time": "October 19, 2022, 10:43:02 AM",
      "body": "I ever use this exchange before, to be honest I don't have any issue at all.But when I do research about few thread in this forum and also looking from the representative account feedback [1] I stop using Bitstamp and now I only use Bisq for better privacy reason.IMO if you want to search about reviews, don't use trustpilot since Binance [2] and Kucoin [3] has received very bad reviews too. Although there's a case where Binance force KYC to every users and Kucoin has a case about slow support, but they're not steal people money which mean still trusted enough.[1] https://bitcointalk.org/index.php?topic=38711.0[2] https://www.trustpilot.com/review/binance.com[3] https://www.trustpilot.com/review/kucoin.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 19, 2022, 01:07:45 PM",
      "body": "Quote from: Solosanz on October 19, 2022, 10:43:02 AMIMO if you want to search about reviews, don't use trustpilot since Binance [2] and Kucoin [3] has received very bad reviews too. Although there's a case where Binance force KYC to every users and Kucoin has a case about slow support, but they're not steal people money which mean still trusted enough.I'm honestly not sure who to trust anymore. But what seriously concerns me is that 64% out of a total of 620 reviews are 1 star, much higher than the rest of the categories. And that rings alarm bells inside my head, because no good service should have a majority of bad reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 19, 2022, 02:27:32 PM",
      "body": "Quote from: NotATether on October 19, 2022, 08:17:16 AMBut recently their trustpilot page got flooded with 1-star reviews accusing them of blocking withdrawals of even KYC'ed accounts and basically stealing the money: I don't trust trustpilot reviews because they can easily be fake and posted by their competition, but I also don't trust centralized exchanges like Bitstamp.It's possible that things turned in bad direction after Bitstamp was sold few years ago to some Belgian investment fund, and who knows what happened after that.I know that original founder team was from Slovenia and lot of people used their exchange for years without any issues, but lot of things changes since than.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "October 19, 2022, 02:59:51 PM",
      "body": "Quote from: NotATether on October 19, 2022, 01:07:45 PMI'm honestly not sure who to trust anymore. But what seriously concerns me is that 64% out of a total of 620 reviews are 1 star, much higher than the rest of the categories. And that rings alarm bells inside my head, because no good service should have a majority of bad reviews.64% of 1 star ratings is nothing compared to Coinbase and its 78% and FTX is not any better with 70% 1 star ratings. Coinbase , FTX and other most popular exchanges have their flaws and problems and I have no doubts that some people got screwed by them, but I don't trust these Trustpilot ratings at all and I don't think that they paint realistic picture. Another thing to keep in mind when checking these pages is that rarely anyone will bother to register and leave review if everything is working smoothly while that's not the case when something is wrong.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "October 19, 2022, 05:40:43 PM",
      "body": "Quote from: NotATether on October 19, 2022, 08:17:16 AMI have read some good reviews about Bitstamp from other forum members here who've been using them for several years.But recently their trustpilot page got flooded with 1-star reviews accusing them of blocking withdrawals of even KYC'ed accounts and basically stealing the money: https://www.trustpilot.com/review/bitstamp.netWhat's going on here? Have they gone rogue?I use Bitstamp since 2017. Never had problems, but it is not my main exchange (which is binance, where I use larger volumes).I made KYC 2 times since 2017. About a month ago my documents were outdated and they requested new docs. I just sent my driver license from Brazil. They approved it in about 6 hours and I was able to trade again.I made a quick withdrawal of about 300 EUR which was in my bank account in less than 30 minutes.Edit:Quote from: NotATether on October 19, 2022, 01:07:45 PMI'm honestly not sure who to trust anymore. But what seriously concerns me is that 64% out of a total of 620 reviews are 1 star, much higher than the rest of the categories. And that rings alarm bells inside my head, because no good service should have a majority of bad reviews.about trust. well, you shouldn't trust any of them.Even when using binance, which looks to be the most solid exchange out there, I am always worried.I don't leave my funds in any exchange. When I need to sell, i always sell in small batches because I am afraid to be frozen or stuck or whatever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 19, 2022, 06:46:06 PM",
      "body": "Opinion / conjecture: Over the years a lot of people opened accounts in a lot of places with information that may not have been accurate then, or over time changed like address / license information / whatever. And unlike your bank that you by default used legit information with and knew to keep updated with the crypto exchanges they never did. Now that KYC is becoming mandatory a lot of people are having trouble verifying that they live at 1234 nowhere street. Or they moved twice since they registered with 100% legit info but now they can't prove they ever lived where they did in 2014. And so on....Going back to the motorcycle world, we had a club member have to take a few 1/2 days at work because in 2002 he bought and titled a project bike, but never registered it. Moved a few times since then and lost the title. Went through hell at the DMV trying to get a new one sent to where he lived now, not where he lived in 2001 to 2004.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "October 20, 2022, 07:11:37 AM",
      "body": "Quote from: dkbit98 on October 19, 2022, 02:27:32 PMIt's possible that things turned in bad direction after Bitstamp was sold few years ago to some Belgian investment fund, and who knows what happened after that.I know that original founder team was from Slovenia and lot of people used their exchange for years without any issues, but lot of things changes since than.I get the issue with using trustpilot for looking at reviews. But when exactly was Bitstamp sold?It's starting to look like an exchange where you'd be safe putting/withdrawing a maximum of 4-digits funds in there, assuming you already have KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "October 20, 2022, 07:49:46 AMLast edit: October 20, 2022, 07:59:48 AM by hosseinimr93",
      "body": "Quote from: NotATether on October 20, 2022, 07:11:37 AMBut when exactly was Bitstamp sold?The Belgium-based investment company bought Bitstamp in October, 2018. Below is the announcement they made about that on their blog.Bitstamp acquired by NXMHQuoteToday I am pleased to announce that Bitstamp has been acquired by NXMH, a Belgium-based investment company.More information on Coindesk:Bitcoin Exchange Bitstamp Confirms Sale to Gaming Group NXC",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "maydna",
      "created_time": "October 20, 2022, 08:31:08 AM",
      "body": "I don't know what Bitstamp's reputation is for now because I already left them a long time ago. At that time, Bitstamp is one place for many whales who play pump and dump, and I feel it is hard to stay with them. But I don't have a problem using their services at that time.I prefer to use Poloniex or Bittrex, although those exchanges have now lost their good performance compared to Binance. But still, those exchanges suit for me to trade and use their lending page to earn some profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}