{
  "id": "topic_5402034",
  "title": "ImThour",
  "author": "ImThour",
  "created_time": "June 10, 2022, 06:43:41 AM",
  "content": "Hash Ribbon Indicator on $BTC just gave Capitulation alert. Mind blowing.This is what happened last time when Hash Ribbon - Capitulation occurred on $BTC. Price went down 50%.Let's see what happens this time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5402034",
  "comments": [
    {
      "author": "dragonvslinux",
      "created_time": "June 10, 2022, 06:01:03 PM",
      "body": "Re-posting my response to this in the correct thread...Quote from: dragonvslinux on June 10, 2022, 01:48:42 PMTo clarify, for anyone reading this indicator incorrectly, the \"Capitulation alert\" (grey circle) appears as the MA30 dropped below the MA60, not because hash rate has dropped below them both. Bare in mind hash rate hit new ATH yesterday, likely due to cost of mining dropping to lowest level in around 9 months, so we might not have the 2018 style capitulation shown below, or what happened in 2019 and 2021.For reference sake (because it's very relevant here), this is what happened in 2020. Red arrows are the sell signals and green arrows are the buy signals.March 2020: Sell $5.4K --- Buy $7.5KMay 2020: Sell $8.7K --- Buy $9.3KOctober 2020: Sell $13.4K --- Buy $19.2KI imagine you can see the issue with selling capitulation and buying the recoveries here. You'd simply be losing substantial amount of Bitcoin by doing so.This is why it's advised not to trade the capitulations, but only the buy signals. The creator of the indicator emphasised this quite heavily based on back-testing. Based on current metrics (hash rate, difficulty and mining cost), it seems a buy signal is more likely than further capitulation, unless price drops below mining cost (currently $25.5K). Further capitulation would be based on hash rate declining, not just consolidating, and therefore difficulty declining (over a multi-bi-weekly period), but so far difficulty has again increased, and is so far estimated to increase further. So for me, this doesn't yet signal any alarm bells like in 2018, 2019 and 2021.This indicator instead now suggests two possible outcomes: 1. Price dropping below $25K could signal much further downside (as miners capitulate switching off machines), to an uber bearish target of $12K - $14K. Or not, as the signal isn't very reliable.2. Price maintaining above $30K in the coming days/weeks would likely lead to a highly reliable buy signal (MA30 and MA60  bullish crossover), as hash rate would continue increasing.This isn't intended to install hopium, just providing the background and purpose of this indicator. Notably how reliable it has been with buy signals, but how unreliable it is for capitulations.Edit: If any states want to try and have a short-term influence over BTC price by banning mining then now would be there moment. Similar to China in 2021 for example.A few of the metrics to keep an eye in the coming days of weeks are the following (as referenced above):Mining cost: https://en.macromicro.me/charts/29435/bitcoin-production-total-costMining difficulty: https://www.blockchain.com/charts/difficulty?timespan=2years&scale=0Difficulty estimator: https://www.bitrawr.com/difficulty-estimatorHash rate: https://www.blockchain.com/en/charts/hash-rate?timespan=2yearsThere is also a hash ribbons chart, but it doesn't appear to be accurate or up to date*:https://www.lookintobitcoin.com/charts/hash-ribbons/*Or uses different hash rate data than the trading view indicator therefore hasn't signalled capitulationWill contribute any relevant updates to the above metrics to this thread",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 10, 2022, 08:41:59 PM",
      "body": "It's the first time I've heard of this indicator. It has been released in October 2019, but the philosophy behind it seems to be applicable, I will look for more during the day.Thanks @dragonvslinux for the reply, you have added a lot of arguments that seem more logical to me . I have some questions as I understood above:We do not need to review these indicators unless the price drops below $25.5K, right?If the price drops to lower levels, the miners will not close the mining tools directly, which means that we may see the effect after two or three months and not directly.During this period, if the price goes back up, will it cancel the effect?Are miners affected by the daily or weekly changes in the bitcoin price? I thought they were investing in the long term.Quote from: dragonvslinux on June 10, 2022, 06:01:03 PMRe-posting my response to this in the correct thread...------------------updating....",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "June 10, 2022, 09:14:56 PM",
      "body": "Quote from: Husires on June 10, 2022, 08:41:59 PMWe do not need to review these indicators unless the price drops below $25.5K, right?Not quite. $25.5K is only the current mining cost (today's). Yesterday it was $20.4K, tomorrow it could be $30K. The issue would be price dropping below the average mining cost, whatever that may be at the time. What's always more relevant however has been the buy signal (when the hash rate recovers), as opposed to the capitulations. Sometimes the miner capitulations can be during healthy upwards price recoveries.Quote from: Husires on June 10, 2022, 08:41:59 PMIf the price drops to lower levels, the miners will not close the mining tools directly, which means that we may see the effect after two or three months and not directly.If price drops below the average mining cost, you will inevitably see some miners switching off (more so than miners switching on). Of course this is subjective to where in the world you are mining. In the US the average cost is reportedly the $30K level, so US miners are likely to switch off below this level (and switch back on above it), to avoid mining at a loss. For other countries, it could be $20K, even $10K, so they'd be switching more on if they can, especially if the mining cost reduces. Or with renewable energy, it could be substantially lower, though the cost of ASIC Miners still exists for the green miners.Quote from: Husires on June 10, 2022, 08:41:59 PMDuring this period, if the price goes back up, will it cancel the effect?More of less, but again this depends on the mining cost, hash rate, as well as difficulty. If the mining cost were to stay at $25K levels, and price then stays above $30K, then sure it's likely to provide a buy signal, as more miners switch back on. But without checking specifically at which hash rate level (and time-frame) the 30MA and 60MAs would crossover again, it's far from a certainty even if very likely.Quote from: Husires on June 10, 2022, 08:41:59 PMAre miners affected by the daily or weekly changes in the bitcoin price? I thought they were investing in the long term.To put it simply, yes. They aren't affected by the daily/weekly hash rate, but more so the difficulty that changes every 2 weeks. So if the difficulty decreases (and therefore costs reduced), it becomes more profitable to mine, and when it increases it becomes less profitable. If on one day the cost of a US miner is $30K, and price goes below it, then for sure these miners would likely switch off - until the price goes back above it.While miners as an industry are known to sell large amounts Bitcoin when it is high, and avoid selling too much when it is low, it's just like any other business - it's about making profits, not hodling. This is where the phrase mining capitulation comes from. It's nothing to do with miners selling their BTC, but to do with miners switching off their machines because the cost of mining is higher than the current price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Tytanowy Janusz",
      "created_time": "June 11, 2022, 06:26:51 AMLast edit: June 11, 2022, 07:47:21 AM by Tytanowy Janusz",
      "body": "But in 2018 there was a lot of space to go down. Let me remind that 2015-2017 bull run was the one we pumped x16 from previous ATH and x140 from the bottom. This time it was x3 from last ATH and x20 from bottom. Last bubble ended with classical crash. This one with 3 moth consolidation at ATH and new ath after 6 months. I would not expect same price action during bear market because bull markets were completely different. Also environment is completely different (interest rates, inflation, Russia war).Also this -50% event that was posted by OP appeared at -70% form ATH. We are at -55% from ATH now. Dump stopped 177% above precious ATH means that this bear market should stop at 53k (177% above 19700). We are already at 30k. Each bitcoin cycle is different. We should stop compering them and start to look into the future rather than past.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "June 12, 2022, 01:17:46 PM",
      "body": "So far, this \"capitulation\" has already subsided as hash rate continues to increase, hence the hash ribbons indicator already showing yesterday's circle with a green background (recovery stage):In case it's not obvious, this looks nothing like previous capitulations where the MA30 and MA60 were both trending downwards, with hash rate below both and continuing to drop.Zooming in on the 4hr chart, the 30MA and 60MA continue to climb and now closer to a bullish crossover (and therefore closer to a buy signal):Compared to yesterday, the relevant metrics are as follows:BTC price: $27.4K (down)Mining cost: $24,679 (down)Hashrate: 231.83m (up)Difficulty estimator: +3.65%Realized price is otherwise at $23,471. While price actions looks bad, this indicator is already looking promising.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "June 20, 2022, 01:14:11 PMLast edit: June 20, 2022, 01:45:58 PM by dragonvslinux",
      "body": "As a capitulation update, given mining cost has flutuated between $20K and $30K in recent days, as price remains under $25K, there has been some minor capitulation it seems (excuse the pun!)BTC price: $20.5K (down)Mining cost: $24,129  (sideways)Hashrate: 200.217 (down)Difficulty estimator: -1.64% (in 2 days)While some miners do appear to be switching off, this still isn't the usual capitulation style based on this indicator. The 30MA has declined, but the 60MA has otherwise remained neutral. Hence hash rate remains relatively sideways in the same range it has been in for the past 6 months. Based on hash rate alone, there is more stagnation of growth as opposed to an outright correction right now. This currently is very similar to early 2020, when there were so-called miner capitulations while the hash rate remained stable, instead moving sideways for approximately 6 months.A move back to $30K, or potentially back above $25K (recent average mining cost) could cause an increase of hash rate as mining becomes more profitable again. Likewise another drop below $20K would likely lead to a decrease in hash rate and further capitulation of miners. While the process has become unprofitable for some more unsustainable miners, notably for others they remain profitable.To claim that \"Bitcoin mining becomes unprofitable\" would therefore be a complete oversimplification of the current situation. Of course for serious miners who's costs are $25K per BTC don't want to be spending that on Bitcoin while it trades at $20K, as that $25K would be better spent on 1.2 BTC rather than 1 BTC, the cost for others is notably much less, even if less profitable at present.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "June 24, 2022, 01:17:05 PM",
      "body": "A few relevant changes based on this minor capitulation, that so far remains a very \"orderly\" correction after already 2 weeks of hash rate consolidation (stagnation of growth):Most notably, yesterday's average mining cost is now lower than current price @ 19 682 while hash rate has remained stable over the past 2 weeks. Difficulty dropped -2.35%, which isn't much of a drop at all, while the estimated drop in 12 days (so far) is a similar correction. This is unlike the 15-20% drops in difficulty (based on a collapsing hash rate) we've seen in the past, most recently in 2021.If the average mining cost stays below current price, it's likely we'll see a full recovery in the near future. For example if mining cost remains at $20K or lower and price remains above that. Bitcoin's price will then need to return to the capitulation price of $30K in order for a buy signal to be confirmed (after hash rate recovery). As I stated for the past 2 weeks, this still isn't ringing any alarm bells yet.BTC price: $21.3K (up / sideways)Mining cost: $19 682 (down & new low)Hashrate: 223.431 (up / sideways)Difficulty change: -2.35% (2 days ago)Difficulty estimator: -1.99% (in 12 days)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "July 03, 2022, 03:40:41 PM",
      "body": "A few key takeaways from this current minor capitulation:Hash rate reached it's highest level in 3 weeks since ATH a few days, and third highest recorded level in Bitcoin's history @ 251m. At the same time, average mining cost was estimated at $16.8K, the lowest price in over 6 months, but has since returned to $20K level. As hash rate has continued to consolidate sideways for the past month since this so-called capitulation, the network has seen a reasonable recovery.As I put a couple of weeks ago, there is simply stagnation of growth as opposed to a capitulation from miners:Quote from: dragonvslinux on June 20, 2022, 01:14:11 PMBased on hash rate alone, there is more stagnation of growth as opposed to an outright correction right now. This currently is very similar to early 2020, when there were so-called miner capitulations while the hash rate remained stable, instead moving sideways for approximately 6 months.Looking in-depth at the hash ribbons indicator, after the capitulation was signalled on June 12th, there was only 5 days of miner capitulation. Since June 17th the gap between the MA30 and MA60 has been decreasing, particularly in the past few days, signalling that the network has been recovering (the MA30 has starting rising while the MA60 continues to fall), even close to crossing bullish to confirm a \"full recovery\".BTC price: $19K (sideways/down)Mining cost: $20.3K (down)Hashrate: 202.852 (sideways)Difficulty estimator:+0.36 (in 3 days)There is still the possibility of further capitulation, notably if price capitulates below $19K and therefore significantly below the average mining cost, but so far this has yet to be seen. We have already seen the network correct itself after price fell below $25K, which at the time was the average mining cost during that period. On the flipside, price rebounding to and maintaining $25K would likely see increased hash rate  and therefore a full recovery signalled, with price 25% above current mining cost, while the buy signal would occur once price returns to the capitulation levels of $30K (after the recovery signal).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "July 03, 2022, 04:21:33 PM",
      "body": "Quote from: dragonvslinux on July 03, 2022, 03:40:41 PMAs I put a couple of weeks ago, there is simply stagnation of growth as opposed to a capitulation from miners:The language used in the explanation has made it more complicated, are we in a new correction wave or will the price see some bounce up (MA30 started to rise while MA60 continues to fall) and will it be to the next resistance level or are we just going back to the 22k barrier.In the previous months, we wanted to notice that the beginning of the month was always bad, or the places where most of the correction occurred.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "July 03, 2022, 04:44:14 PM",
      "body": "Quote from: Husires on July 03, 2022, 04:21:33 PMQuote from: dragonvslinux on July 03, 2022, 03:40:41 PMAs I put a couple of weeks ago, there is simply stagnation of growth as opposed to a capitulation from miners:The language used in the explanation has made it more complicated, are we in a new correction wave or will the price see some bounce up (MA30 started to rise while MA60 continues to fall) and will it be to the next resistance level or are we just going back to the 22k barrier.Maybe you have confused the purpose of this thread (or at least my reclamation of it), it's analysing the Bitcoin network based on it's hash rate, not the price. The only relevance or connection to the price is it's relation to the average mining cost, as well as the capitulation price of $30K. As if $30K is reclaimaed, after network has recovered, the Hash Ribbons indicator would provide a buy signal - for price analysis.In summary, this isn't intended to predict Bitcoin's price, but instead analysing the Bitcoin network - ie attempting to predict whether growth will continue to stagnate, or whether there will be a recovery or decline. Anticipating a price recovery can only come at a much later stage, above $30K, once the network has fully recovered and is back above capitulation levels. Until then, price analysis is not possible using these metrics alone, as at present, it's largely price that will determine whether there will be hash rate recovery or a considerable decline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "July 04, 2022, 05:48:53 PM",
      "body": "Hash Ribbons is getting extremely close to a bullish cross-over (recovery) as hash rate continues to remain stable. Average mining cost has reduced to $18.3K while price bouncing back to $20K levels.I previously referenced that price would need to return to $30K (miner capitulation price) for a \"buy signal\" (in blue) to appear. However after further analysis, it seems price merely needs to increase beyond the recovery price, as opposed to the capitulation price. While this usually happens sooner after, as circled below this isn't always the guarantee (such as in May 2021) @ $43K.In this example the hash rate signalled a recovery at $43K, but price continued to decline, actually instigating another miner capitulation soon after. While the mining economics aren't the same as in Summer 2021 when China banned mining, and therefore hash rate saw a considerable decline, the green recovery signal isn't enough to confirm a strong buy signal.This would otherwise be the first buy signal since August 2021 @ $44.6K, when price saw a 50% increase after such a signal, as one of the lowest % returns from this signal.BTC price: $20K (sideways/up)Mining cost: $18.3K (down)Hashrate: 227m (sideways/up)Difficulty estimator:+1.2 (in 2 days)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dragonvslinux",
      "created_time": "July 05, 2022, 09:50:22 PMLast edit: September 10, 2023, 01:04:20 PM by dragonvslinux",
      "body": "Quote from: dragonvslinux on July 04, 2022, 05:48:53 PMHash Ribbons is getting extremely close to a bullish cross-over (recovery) as hash rate continues to remain stable. Hash Ribbons is now confirming a recovery on all time-frames. Needs to close the Daily, as well as ideally Weekly in the green, but already feeling like  No blue buy signal yet, but positive price action post hash rate recovery should provide the signal, if it doesn't lead to a fake-out like in May 2021.This would be an incredibly bullish sign in the long-term, despite bearish price action at present, based on the history of this indicator:Quote from: dragonvslinux on November 28, 2019, 11:20:21 AMLast signal was in August 2021. The buy signal only comes around every year or so. Here's some previous data from 2019, though % increases have declined since then:Quote from: dragonvslinux on November 28, 2019, 11:20:21 AMQuote from: Charles Edwards - Hash Ribbons & Bitcoin Bottoms",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}