{
  "id": "topic_5473757",
  "title": "Kelward",
  "author": "Kelward",
  "created_time": "November 11, 2023, 08:24:23 PM",
  "content": "I base my question about whether a gambler can become a good bitcoin trader, because both of them share one factor which is risk. A gambler is a risk taker, he stakes his money without knowing the outcome of the game that he is about to play. There is no guarantee that he will win, yet he goes ahead to play, knowing fully well that he can lose his bet. Same thing with a bitcoin trader, he goes ahead to engage in trading knowing fully well that the market can turn around  negatively for him, making him to lose his bitcoin. Yet he goes ahead to trade in the hope of making profit.Although there are some differences between the two, like most gambling depends mainly on luck. You play and let luck decide fate of the game, that is the risk factor, because the gambler doesn't have any control or influence to determine the outcome of the bet. Also a bitcoin trader doesn't have any control or influence to determine how the market swings, he takes the risk to trade his bitcoin without knowing the outcome whether it'll be profit or lose. The diffidence between the two is that a bitcoin trader can predict the market, while a gambler can not predict the outcome of a bet, except in sports bet. So if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473757",
  "comments": [
    {
      "author": "Oshosondy",
      "created_time": "November 11, 2023, 08:27:52 PM",
      "body": "Can a gambler become a good trader? Yes. If he learns how to trade. He has little to read about risk management and he should still know that he should trade with the amount of money that he can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wheelz1200",
      "created_time": "November 11, 2023, 08:35:05 PM",
      "body": "Quote from: Kelward on November 11, 2023, 08:24:23 PMI base my question about whether a gambler can become a good bitcoin trader, because both of them share one factor which is risk. A gambler is a risk taker, he stakes his money without knowing the outcome of the game that he is about to play. There is no guarantee that he will win, yet he goes ahead to play, knowing fully well that he can lose his bet. Same thing with a bitcoin trader, he goes ahead to engage in trading knowing fully well that the market can turn around  negatively for him, making him to lose his bitcoin. Yet he goes ahead to trade in the hope of making profit.Although there are some differences between the two, like most gambling depends mainly on luck. You play and let luck decide fate of the game, that is the risk factor, because the gambler doesn't have any control or influence to determine the outcome of the bet. Also a bitcoin trader doesn't have any control or influence to determine how the market swings, he takes the risk to trade his bitcoin without knowing the outcome whether it'll be profit or lose. The diffidence between the two is that a bitcoin trader can predict the market, while a gambler can not predict the outcome of a bet, except in sports bet. So if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?Although some traits cross over they are mutually exclusive.  The only thing that would probably help is the risk level and the ability to lose a lot in a quick fashion.  If a gambler is also a good crypto trader its most likely either due to luck, coincidence or 2 separate skillets they are good at.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MainIbem",
      "created_time": "November 11, 2023, 08:45:21 PM",
      "body": "From what I understand, both are not the same gambler as you described doesn't know the future of his bet but we knows it as a blind game or a game of guess which if you guess correctly you have a winning, but in trading if the market is going against you there are chances that you can exit a trade to secure the remaining funds. Then your question, as far as I know gambler can become a good trader provided he knows the technicality involved while trading I don't see anything bad a gambler can't trade except he doesn't want to remain focused in the trade process before he would lose his trade otherwise I can basically say that trading is more preferable than gambling.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rruchi man",
      "created_time": "November 11, 2023, 08:53:49 PM",
      "body": "Quote from: Kelward on November 11, 2023, 08:24:23 PMSo if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?The only advantage is they would be able to worry less when they loose money trading because they are already used to the concept of loosing money. It may also feel different because while gambling involves having fun and loosing money, there is no fun loosing money to trading.A gambler can be a good trader if they take the time to learn to trade properly either by themselves or preferably from experts with more experience than them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "komisariatku",
      "created_time": "November 11, 2023, 08:58:34 PM",
      "body": "Quote from: Kelward on November 11, 2023, 08:24:23 PMSo if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?Anyone can become a trader, including gamblers as long as they know about bitcoin and are willing to learn about bitcoin trading analysis. In my opinion, the risks of trading and gambling are different, and cannot be generalized. The risk of gambling is losing money and the risk of trading is losing money, even if we sit all day we also have the risk of losing money because we don't go to work. Even though the risk is the same, namely losing money, the management to overcome the risk is different Gambling is entertainment and luck, but bitcoin trading is market and sentiment analysis. When gambling we don't need to analyze, just play and enjoy. However, when trading we need analysis, trading without analysis is also possible but the trading model is the same as gambling, just relying on luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gormicsta",
      "created_time": "November 11, 2023, 09:02:57 PMLast edit: November 21, 2023, 10:57:20 AM by Gormicsta",
      "body": "Quote from: Kelward on November 11, 2023, 08:24:23 PMI base my question about whether a gambler can become a good bitcoin trader, because both of them share one factor which is risk.Being a gambler is one thing and being a responsible gambler is another. An irresponsible gambler knows very little or nothing about risk management.  One thing about irresponsible gamblers is that, they don't know when to stop, observe and employ a new technique which is a good quality of a good trader.A responsible gambler knows when to call it a quit, has very good management skills. Gambling of a truth has striking similarities with trading as much as they also have their differences too but Despite their fundamental differences, trade and gambling do share certain similarities in a few areas: Both entail some risk: There is a chance of losing money when trading or gambling. Both activities carry no guarantees of success and always carry the risk of financial loss.  And then again Compared to investors, gamblers have fewer opportunities to reduce their losses. Compared to gamblers, investors have access to more relevant information sources.So to answer your question, Yes a gambler can be a good and successful trader IF the person in question is a responsible gambler and has a good risk management skill.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ruttoshi",
      "created_time": "November 11, 2023, 09:03:13 PM",
      "body": "I don't think that any bitcoin trader will take the risk to loose his bitcoin in the market if he knows that the market will go opposite his thought. Gambling is different from trading even though both of them share similar thing in common which is high level of risk.Back to your question, a gambler can be a good trader if he takes his time to learn everything about trading, and if he can also discipline himself not to be too greedy with his trading activities. One thing that I see in these two is that, anyone involve in both must be able to control his emotions and never be greedy so that you don't end up losing big. This is because the level of loss in both activities is very high compared to the profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AmoreJaz",
      "created_time": "November 11, 2023, 09:04:18 PM",
      "body": "Quote from: komisariatku on November 11, 2023, 08:58:34 PMQuote from: Kelward on November 11, 2023, 08:24:23 PMSo if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?Anyone can become a trader, including gamblers as long as they know about bitcoin and are willing to learn about bitcoin trading analysis. In my opinion, the risks of trading and gambling are different, and cannot be generalized. The risk of gambling is losing money and the risk of trading is losing money, even if we sit all day we also have the risk of losing money because we don't go to work. Even though the risk is the same, namely losing money, the management to overcome the risk is different Gambling is entertainment and luck, but bitcoin trading is market and sentiment analysis. When gambling we don't need to analyze, just play and enjoy. However, when trading we need analysis, trading without analysis is also possible but the trading model is the same as gambling, just relying on luck.there's no correlation between the two, maybe, the feeling of taking risk. but they are totally different. trading requires at least a lil bit of knowledge of the market itself. what's going on and where it is heading at. but when you talk about luck-based casino games, you don't need to think about it because most of these games just need common sense to continue playing. but when it comes to trading, at least give yourself some knowledge of the currency you want to trade with. otherwise, you will easily be liquidated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yatsan",
      "created_time": "November 11, 2023, 09:05:22 PM",
      "body": "Yes, and what would link those two is risk tolerance. Gamblers are also investors in the first place; they know how risk works and they tend to gauge tendencies of winning over losing. With trading, analysis would work more often than with gambling which involves more of one’s luck. Anyone could be a gambler but not all gambler would be good with trading or investment; either it is too fast or that profit in gambling is harder to earn and get unlike with trading wherein one could adjust the margin of his bet. Problem only is the difference with the risk present on each category. Actually not only a good bitcoin trader but also investor of other fields than to just rely solely with your luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Westinhome",
      "created_time": "November 11, 2023, 09:26:26 PM",
      "body": "Quote from: Kelward on November 11, 2023, 08:24:23 PMI base my question about whether a gambler can become a good bitcoin trader, because both of them share one factor which is risk. A gambler is a risk taker, he stakes his money without knowing the outcome of the game that he is about to play. There is no guarantee that he will win, yet he goes ahead to play, knowing fully well that he can lose his bet. Same thing with a bitcoin trader, he goes ahead to engage in trading knowing fully well that the market can turn around  negatively for him, making him to lose his bitcoin. Yet he goes ahead to trade in the hope of making profit.Although there are some differences between the two, like most gambling depends mainly on luck. You play and let luck decide fate of the game, that is the risk factor, because the gambler doesn't have any control or influence to determine the outcome of the bet. Also a bitcoin trader doesn't have any control or influence to determine how the market swings, he takes the risk to trade his bitcoin without knowing the outcome whether it'll be profit or lose. The diffidence between the two is that a bitcoin trader can predict the market, while a gambler can not predict the outcome of a bet, except in sports bet. So if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?Now the gambling sites was mostly based on the cryptocurrency,this was the reason for the many bitcoin traders was in the gambling now.The profit from the cryptocurrency trade was used by the trader to bet in the gambling sites.Since the money from the trade profit,So the gambler won’t worry if he had loss in the gambling site.So this will be the stress free gambling site game,it help the gambler to do the easy win by the control of their emotion.Because the money was used by the free sources like the crypto based trading win,the gambler also use the free money from the income to the gambling sites every month of the gambling sites.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "November 11, 2023, 09:31:35 PM",
      "body": "Quote from: Kelward on November 11, 2023, 08:24:23 PM(...)So if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?No one succeeds without experiencing failures, and in any field, knowledge and experience give them the right results that they can apply.I know a number of professional gamblers whose analysis I consider to be the difference in helping them succeed at it. And similarly, bitcoin trading also requires a lot of different skills.It may or may not have an interactive relationship, but the key point is still the application of acquired knowledge in each specific field.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "November 11, 2023, 09:40:27 PM",
      "body": "gambling and day trading are very different things, a person who plays in a casino, a person who buys a lottery ticket in most cases thinks about playing to get rich quick, for example when that person puts 1$ on the lottery ticket and the jackpot is 3 million dollars, this person is praying to win the 3 million dollars, when a person plays blackjack they also hope to win a lot of money quickly, but when the same person goes to day trade, they will have to spend a lot of time studying the market , you will have to spend a lot of time putting in a lot of money to make a profit from little money, for example having to put in $100,000 and expect a profit of 1% sometimes, this makes the person impatientTherefore, the person sells early when they buy and instead of making a 1% profit they start to make losses constantly and give up. The reason why people don't trade and prefer gambling is because they don't want to spend months trading and make very low profits, this becomes visible even when a person hodls bitcoin. for example, a person buys bitcoin at a price of $25,000 and sets a sales target of $50,000 to make a 2X profit, stays for 1 year and the price of bitcoin does not rise to $50,000, 2 years pass and the price of bitcoin still does not rise for 50,000$Then the person goes to a casino and looks at a football game with odds of 2.00 for the favorite, that is, in just one game if that person gets it right they would already have 2X profit, so that person forgets the words patience and hodl and goes to She thinks she will make a quick profit and loses everything, but even so she continues to put more money into the casino to play because I believe that next time she will be lucky. gambling and trading are very different things",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wakate",
      "created_time": "November 11, 2023, 09:46:53 PM",
      "body": "Quote from: Rruchi man on November 11, 2023, 08:53:49 PMQuote from: Kelward on November 11, 2023, 08:24:23 PMSo if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?The only advantage is they would be able to worry less when they loose money trading because they are already used to the concept of loosing money. It may also feel different because while gambling involves having fun and loosing money, there is no fun loosing money to trading.A gambler can be a good trader if they take the time to learn to trade properly either by themselves or preferably from experts with more experience than them. it is good for us to have other things we are doing apart from gambling so that when we make loses, we can always get funds else where to keep gambling but not to the extend of becoming an addictive gambler. Anyone can decide what to do with there time even though it's a trader. A trader have equal opportunity with non trader too to gamble and make money for themselves if they know how to do it better. Being a trader going into a crypto casino to gamble can be more fun because they already good in trading and they can utilize there knowledge to bet and try there luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Weawant",
      "created_time": "November 11, 2023, 09:47:22 PM",
      "body": "Quote from: Kelward on November 11, 2023, 08:24:23 PMI base my question about whether a gambler can become a good bitcoin trader, because both of them share one factor which is risk. A gambler is a risk taker, he stakes his money without knowing the outcome of the game that he is about to play. There is no guarantee that he will win, yet he goes ahead to play, knowing fully well that he can lose his bet. Same thing with a bitcoin trader, he goes ahead to engage in trading knowing fully well that the market can turn around  negatively for him, making him to lose his bitcoin. Yet he goes ahead to trade in the hope of making profit.Although there are some differences between the two, like most gambling depends mainly on luck. You play and let luck decide fate of the game, that is the risk factor, because the gambler doesn't have any control or influence to determine the outcome of the bet. Also a bitcoin trader doesn't have any control or influence to determine how the market swings, he takes the risk to trade his bitcoin without knowing the outcome whether it'll be profit or lose. The diffidence between the two is that a bitcoin trader can predict the market, while a gambler can not predict the outcome of a bet, except in sports bet. So if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?Firstly you risk experience is not all you need as a trader, there are people who have been into very risky business and professions aswell and when they eventually ventured into trading, all that didn't really mattered, because the risk in trading could be seen in a different perspective.As a professional trader, it's never your risk is always defined even before you place a trade and you are most likely knowing where your trading is going and what the possible outcome could be, but in gambling your risk is not always as well defined as it can be with trading regardless of your experience or how well you have been in the game, so when it comes to risk management and definition, they are not the same with gambling and trading.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Marvelman",
      "created_time": "November 11, 2023, 09:49:22 PM",
      "body": "You know, you make a good point that gamblers and bitcoin traders actually have a lot in common.  They are both willing to take some risks for the chance to hit it big.  i definitely see why you draw the parallel - with both, you're putting your hard-earned cash on the line without any guarantees you'll come out ahead.  Whether its at a roulette wheel or investing in crypto the outcome is uncertain.  Of course, the bitcoin trader has that extra layer where they try to analyze the market and read the trends.  It ain't all just luck; some strategy and critical thinking can come into play too.  So, no. I don't think that a gambler can be a good trader just because he has gambling experience. Not without proper training first.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Josefjix",
      "created_time": "November 11, 2023, 09:58:56 PM",
      "body": "Quote from: Oshosondy on November 11, 2023, 08:27:52 PMCan a gambler become a good trader? Yes. If he learns how to trade. He has little to read about risk management and he should still know that he should trade with the amount of money that he can afford to lose.Bitcoin trading is not difficult, it requires one to know the system, the coins and market seasons before triggering trading. A gambler can be anything he aspires to be in the system as long as he's serious and consistent, he will definitely achieved his goals within a small range of time. But before going into the space, he should be able to understand the system and knows the basic necessities, that way his chances of losses will decrease and boosts his opportunities to grab hugh wins from the system. It's advisable to trade what you can afford to lose and not staking significant figures.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Saint-loup",
      "created_time": "November 11, 2023, 09:59:18 PM",
      "body": "Quote from: Kelward on November 11, 2023, 08:24:23 PMI base my question about whether a gambler can become a good bitcoin trader, because both of them share one factor which is risk. A gambler is a risk taker, he stakes his money without knowing the outcome of the game that he is about to play. There is no guarantee that he will win, yet he goes ahead to play, knowing fully well that he can lose his bet. Same thing with a bitcoin trader, he goes ahead to engage in trading knowing fully well that the market can turn around  negatively for him, making him to lose his bitcoin. Yet he goes ahead to trade in the hope of making profit.Although there are some differences between the two, like most gambling depends mainly on luck. You play and let luck decide fate of the game, that is the risk factor, because the gambler doesn't have any control or influence to determine the outcome of the bet. Also a bitcoin trader doesn't have any control or influence to determine how the market swings, he takes the risk to trade his bitcoin without knowing the outcome whether it'll be profit or lose. The diffidence between the two is that a bitcoin trader can predict the market, while a gambler can not predict the outcome of a bet, except in sports bet. So if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?Yes I'm convinced of that, because most traders thinks they are able to predict the trend of the market while most of them perform worse than a dice or a monkey placing random orders in reality. A gambler will be more likely to have a money management similar to the one he has when he's gambling, and to use common gambling strategy such as the Kelly Criterion one for example. So at the end even if he doesn't know or understand anything about trading, he will be more likely to have better results than an average trader as the monkey.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "macson",
      "created_time": "November 11, 2023, 10:01:17 PM",
      "body": "Quote from: Kelward on November 11, 2023, 08:24:23 PMsnipSo if a gambler where to go into bitcoin trading, do you think that the experience of taking risk in gambling will be an added advantage to face the risk of bitcoin trading?i never thought how a gambler could be a good bitcoin trader because they both have different focuses.  however, i am aware that the education that each person receives is different, so i am not surprised by the views of people out there who still think that trading is an activity that is not much different from gambling.  If you are a slot addict then don't expect to be a good trader because you will definitely only depend on luck, trading is not an easy buying/selling activity, there are many considerations and knowledge that must be mastered to become a good trader which makes good profits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "famososMuertos",
      "created_time": "November 11, 2023, 10:34:11 PM",
      "body": "Specifically everything will depend on the individual and how successful they are, gambling does not make you a financial expert, ,although it depends, because in the area of poker you handle many statistical concepts, etc. in traditional games there are other types of skills that are based more on bank management, and finally there are sports betting, another area of ​​skills. It is relative.From that point of view, a gambler who has never made a trade learns to master it quickly and is one step ahead in relation to someone who has never made a trade, but that does not guarantee anything to give him a good rating.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}