{
  "id": "topic_5420873",
  "title": "Len Saldua",
  "author": "Len Saldua",
  "created_time": "November 13, 2022, 07:36:49 PM",
  "content": "I just sold my 150 Solana out of FUD ( thinking I might buy it back at $5 soon ), and I am now worried many other projects were backed by Alameda Research. Are these projects doomed too, or can some of them ( like Helium ) survive and eventually thrive again ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5420873",
  "comments": [
    {
      "author": "BIT-BENDER",
      "created_time": "November 13, 2022, 07:46:10 PM",
      "body": "Does Solana have any strong connection with FTx pls correct if you have a strong prove. I personally don't hold Solana but if I actually believed in it strongly as to buy it I won't just sell it off because of the recent FTX block buster movie.I have checked Solana as a coin I Think it's ok apart from it trying to do to much like getting its own network which I think won't be a success . The coin has really been average. I think if it drops now it's just a good opportunity because it has the ability to also rise. Solana has been one coin on my radar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jossiel",
      "created_time": "November 13, 2022, 07:57:31 PM",
      "body": "Quote from: Len Saldua on November 13, 2022, 07:36:49 PMI just sold my 150 Solana out of FUD ( thinking I might buy it back at $5 soon ), and I am now worried many other projects were backed by Alameda Research. Are these projects doomed too, or can some of them ( like Helium ) survive and eventually thrive again ?I don't know that Solana is backed up by Alameda research. But with things that FTX shown together with their founders, then it's a must thing to do for those that want to be safe with their money.Everyone who knows what happened with their exchange and people's money will start to get away from any project where Alameda is also part of. That's like a protocol for those that are too concerned with their money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "November 13, 2022, 08:35:23 PM",
      "body": "Quote from: Len Saldua on November 13, 2022, 07:36:49 PMI just sold my 150 Solana out of FUD ( thinking I might buy it back at $5 soon ), and I am now worried many other projects were backed by Alameda Research. Are these projects doomed too, or can some of them ( like Helium ) survive and eventually thrive again ?Most likely... We already had projects like Serum Network  having their native tokens dumb so badly due to the strong connection with Alameda.The bear market is still on. I think we are yet to see more and more coins collapse especially if the Alameda money mess caught up with them too. I wouldn't touch any coin connected to Alameda for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dothebeats",
      "created_time": "November 13, 2022, 08:52:13 PM",
      "body": "At this moment we won't really know unless the project openly gives out info that they are affiliated with Alameda. Honestly, in light of the FTX fuck up, it's best to stay away from anything held by Alameda, or anything that has their influence. FUD will soon follow and people will be wary and fear that their holdings are not safe. Imagine just a few wrong decisions and the whole cryptomarket is in shambles and anxious of their stash and their next move.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "November 13, 2022, 10:08:26 PM",
      "body": "Quote from: BIT-BENDER on November 13, 2022, 07:46:10 PMDoes Solana have any strong connection with FTx pls correct if you have a strong prove. I personally don't hold Solana but if I actually believed in it strongly as to buy it I won't just sell it off because of the recent FTX block buster movie.I have checked Solana as a coin I Think it's ok apart from it trying to do to much like getting its own network which I think won't be a success . The coin has really been average. I think if it drops now it's just a good opportunity because it has the ability to also rise. Solana has been one coin on my radar.FTX and alameda are said to be the VCs that invest the most in solana and they hold the majority of solana. The success of sol in 2021 is not only due to sol's team but also to SBF's strong support, with the collapse of FTX, it is likely that SBF will find a way to dump sol. 4 days ago, sol just unlocked 51 million sol for big investors, which also caused sol to be seriously dumped recently. It must be said that sol is the project that has been hit the hardest as their success is tied to SBF. Sol's ICO price is only $0.2 compared to current price, ROI is still very high so VCs will still sell sol in the near future to take profit. Be careful, it's still not a good time to invest in Sol.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GreatArkansas",
      "created_time": "November 13, 2022, 11:24:17 PM",
      "body": "Quote from: Len Saldua on November 13, 2022, 07:36:49 PMI just sold my 150 Solana out of FUD ( thinking I might buy it back at $5 soon ), and I am now worried many other projects were backed by Alameda Research. Are these projects doomed too, or can some of them ( like Helium ) survive and eventually thrive again ?Take Solana as an example of what happened. We all know FTX Exchange is the major backer of Solana and look what happened to Solana, it seems Solana is following the FTT token.But I believe Solana will still stay even though FTX/Alameda is already out of the market.Solana is the most used L1 network after Ethereum, so I believe Solana is still worthy, wrong timing only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "merekamo",
      "created_time": "November 14, 2022, 08:33:35 AM",
      "body": "I can't really predict what will happen to most of the projects that Alameda Research has invested in.I think it's too early to say, given that many projects are under the control of Alameda Research. But it's quite possible for some (if not all) of them to bounce back. We have already seen some of them bounce back after a slight drop in value (like Zennet and Solana).In my opinion, this is the impact of tokens or coins as a whole as people nowadays are hesitant to invest in certain crypto projects nowadays or trade coins because of the FTX case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "November 14, 2022, 08:41:00 AM",
      "body": "Quote from: Len Saldua on November 13, 2022, 07:36:49 PMI just sold my 150 Solana out of FUD ( thinking I might buy it back at $5 soon ), and I am now worried many other projects were backed by Alameda Research. Are these projects doomed too, or can some of them ( like Helium ) survive and eventually thrive again ?Rest assured that any project connected to Alameda Research will be compromise. If they have major shares or tokens on those projects, now that they need liquidity, obviously they will unlock it and sell for quick funds. Now that they are in trouble, theres no doubt that their move is that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Adbitco",
      "created_time": "November 14, 2022, 08:52:55 AM",
      "body": "Well seriously speaking for now you should avoid solana and move on with any others coin which you fund very much interesting with. I think FTX should have a connection with Solana for me I don't seem is actually good time to hold back Solana, although it depends on personal choice due to the market turbulence could get corrected any time soon and if its happens to get back it's feet's and make a better change which might not dip to your predicted price of buying at $5 then you apportion blame to people around for their advise.To read more about Solana FTX connections",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zasad@",
      "created_time": "December 28, 2022, 03:18:29 PM",
      "body": "https://decrypt.co/118049/alameda-linked-addresses-begin-swapping-ethereum-erc-20-tokens-bitcoinAlameda-linked Addresses Begin Swapping Ethereum, ERC-20 Tokens for BitcoinIt is currently unclear who was behind the latest transfers from crypto wallets associated with Alameda Research.Several wallets associated with Sam Bankman-Fried’s trading firm Alameda Research came to life late a few hours ago, swapping various cryptocurrencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jackl87",
      "created_time": "December 29, 2022, 08:59:17 PM",
      "body": "Quote from: Len Saldua on November 13, 2022, 07:36:49 PMI just sold my 150 Solana out of FUD ( thinking I might buy it back at $5 soon ), and I am now worried many other projects were backed by Alameda Research. Are these projects doomed too, or can some of them ( like Helium ) survive and eventually thrive again ?Alameda was one of the biggest and most active investors withing the crypto space in the last few year or so and until a few weeks it was kind of a seal of approval and quality if a new project received backing from Alameda. This fact alone created interest of small investors to maybe invest into that project also once it is tradeable or to join a pre- or even a private sale if possible.Now with the bankruptcy of FTX this whole construction crumbled. Project that received a huge share from their funding from FTX could really get in trouble. On the other hand if Alameda invested with stable coins and if those projects already received those stablecoins, then it should not really matter that alameda does not exist anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "December 29, 2022, 09:11:49 PM",
      "body": "I would stay away from anything related and connected to Alameda, FTX and SBF. We don't know how deep are their roots with the projects they are partnered with, so just for precaution avoid them, at least for now, until the dust settles. The lack of transparency from their side forces us to act like this in order to preserve ourselves and our funds in crypto market during the storm. Remember this mess started singly with Luna, and like a domino effect, it has reached the second biggest crypto exchange in the world, FTX. Who knows where it's going to stop...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "December 29, 2022, 09:32:02 PM",
      "body": "Even if they are good, I’m sure they can be affected as well so better to sold now than to lose everything. Though it might already too late as most of those altcoins are already on their bottom. Alameda is affected that much in connection with SBF and FTX, their integrity is damage already that’s why many are taking cautious with their investments. If I were to be asked, I will also sell even at a loss right now and just reinvest it with the good coins.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o48o",
      "created_time": "December 29, 2022, 10:36:56 PM",
      "body": "Quote from: Len Saldua on November 13, 2022, 07:36:49 PMI just sold my 150 Solana out of FUD ( thinking I might buy it back at $5 soon ), and I am now worried many other projects were backed by Alameda Research. Are these projects doomed too, or can some of them ( like Helium ) survive and eventually thrive again ?Eventually yeah, but i wouldn't invest into them for a half year or so. Not until people are getting over the fear. And that takes a long time, public opinion is what it is and normies won't be buying alts for a while. If i was brave this could be an opportunity but i don't think the fear is over. Some people are just slow to dump their coins. But they eventually will. Rest of them are diamond hands and they are bringing us a strong new bottom.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "December 29, 2022, 11:50:47 PM",
      "body": "Quote from: Len Saldua on November 13, 2022, 07:36:49 PMI just sold my 150 Solana out of FUD ( thinking I might buy it back at $5 soon ), and I am now worried many other projects were backed by Alameda Research. Are these projects doomed too, or can some of them ( like Helium ) survive and eventually thrive again ?For me yes, everything that has something or some connection with Alameda, I will stay away from it right now. Maybe it could also be dragged on the case with SBF right now because we all know that FTX and Alameda are connected. So in a sense, if one party is guilty the other one might be as well. So just to be on the safe side, I wouldn't put money on them. Besides, there is also the question of reputation and we all know than in crypto it is very important, because once you lose it, your name will be tainted, just saying. I will say good call for you selling your SOL, just try to buy it back if you really believed on this project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "December 30, 2022, 02:00:51 AM",
      "body": "If I were in your shoes, I would also stay away from projects that are funded or even closely associated with either Alameda Research or FTX. The case and the bankruptcy proceeding are still going on. And it is hard to tell whether lost funds would be returned. If they will be returned, it will definitely take a lot of time. So it is good to just keep them away from your portfolio. In terms of buy back, be watchful of the developments. I'd rather risk on a coin that has potential and has no dirty past than no a coin that has already fallen hard. It is very possible they cannot recover anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BlackBoss_",
      "created_time": "December 30, 2022, 03:12:19 AM",
      "body": "Quote from: Len Saldua on November 13, 2022, 07:36:49 PMI just sold my 150 Solana out of FUD ( thinking I might buy it back at $5 soon )I don't judge about Solana project because it can result in controversy or you might think I am attacking you. It's unnecessary.I only give you historic snapshots and their stories. You read snapshots and have your own thinkings.Don't buy altcoins because they are top altcoinsTop altcoins can be dead and never be able to reclaim their past all time highs in new bull markets. It is a fact from history.Solana used to be a top altcoin in top 10 in 2021 with about $60B marketcap. In December 2022, its marketcap is only ~ $6B and it fell to a 15th position.Quoteand I am now worried many other projects were backed by Alameda Research. Are these projects doomed too, or can some of them ( like Helium ) survive and eventually thrive again ?You should prioritize safety than take risk so to have best safety, avoid other projects were backed by Alameda Research. If you did not know all of those projects, here is a graphic for you.Quote from: Ratimov on December 29, 2022, 11:11:12 PM",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Yaunfitda",
      "created_time": "December 30, 2022, 10:38:40 AM",
      "body": "And this is very unfortunate, because in the beginning, there are a lot of promise from this project and even hit all time high in the bull run. Unfortunately, after that and just like the rest of altcoins, it went down. But it's just the bear market so everyone is going to decline right? yeah, but there were issues like the hacks and it's network security. Now, it's name was also in the middle of the Alameda Research/FTX controversy that I will say like the majority of most experience members here, stay away from Solana for now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Natalim",
      "created_time": "December 30, 2022, 11:12:52 AM",
      "body": "Solana was once been called another strong coin in the market before the issue come out but as people know their connection to Alameda, investors are moving out and rejecting this coin. Solana is declining, people can't afford to take risks if they know the possibility of losing their money is too high. There are a lot of projects that are safe and free from the influence of this huge group in Alameda, better we choose them to avoid losses and also to have peace of mind thinking about our investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}