{
  "id": "topic_5462352",
  "title": "Broadanbig",
  "author": "Broadanbig",
  "created_time": "August 07, 2023, 12:33:27 PM",
  "content": "I was going through one of the newspaper dailies  and I came across a particular one that caught my attention. So I was wondering who this guy is. He has 1300 mining servers which he earns ₦6500 from each on daily basis and a total of ₦15million ( currency calculations based on my local currency) daily when calculated together according to the source. He claimed to have started mining since 2017 and has accumulated mining servers to this extent  years past.The location of this mining farm was not disclosed by the media possibly they do not have knowledge of it as I saw it was culled from his titok account  named ZAC.SAFRON. I was amazed to have seen this because not everyone can afford this. From my findings he has been on this for years before now and possibly, he started with just a few or one minner and gradually he started purchasing the rest of the others reaching today. This goes to show how commitment, consistency and focus could go a long way to keep your dreams come true. https://ibb.co/FHpcfkFI believe Bitcoin is legally approved in his country for him to have such a large Bitcoin mining farm fully powered with electric supply and also since he is making profit from it, then I believe he is also paying tax to the government of his country for running a Bitcoin mining farm together with the power supply he enjoys on daily basis to sustain the smooth running of the farm. Sources You can scroll down the page on the website to see the video for yourself.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5462352",
  "comments": [
    {
      "author": "348Judah",
      "created_time": "August 07, 2023, 01:23:40 PM",
      "body": "Quote from: Broadanbig on August 07, 2023, 12:33:27 PM I was going through one of the newspaper dailies  and I came across a particular one that caught my attention. So I was wondering who this guy is. He has 1300 mining servers which he earns ₦6500 from each on daily basis and a total of ₦15million ( currency calculations based on my local currency) daily when calculated together according to the source. He claimed to have started mining since 2017 and has accumulated mining servers to this extent  years past.I don't know how true this could be but i can assure you that cloud mining today is nothing than a bit of crap and time waster, maybe then, those that got into it earlier have taken advantage in it before the whole thing exploded into scam after going through series of events and suverys, the amount received is too low to what bitcoin miners can generate in bitcoin mining or if they set up a mining rig, you would have given us the link to such news because i know that couldn't be bitcoin mining, the amount used was presented in Nigerian currency and i don't think in Nigeria they've got any bitcoin mining rig than a numbers of cloud mining sites which are mostly unreliable and scam.Quote from: Broadanbig on August 07, 2023, 12:33:27 PMThe location of this mining farm was not disclosed by the media possibly they do not have knowledge of it as I saw it was culled from his titok account  named ZAC.SAFRON. I was amazed to have seen this because not everyone can afford this. From my findings he has been on this for years before now and possibly, he started with just a few or one minner and gradually he started purchasing the rest of the others reaching today. This goes to show how commitment, consistency and focus could go a long way to keep your dreams come true.Be careful, don't allow yourself to be a scam victim.Quote from: Broadanbig on August 07, 2023, 12:33:27 PMI believe Bitcoin is legally approved in his country for him to have such a large Bitcoin mining farm fully powered with electric supply and also since he is making profit from it, then I believe he is also paying tax to the government of his country for running a Bitcoin mining farm together with the power supply he enjoys on daily basis to sustain the smooth running of the farm.In bitcoin, we don't run a mining farm, we run a miming rig, don't let them use the word bitcoin and their posted articles to convince you to run into their investment, make good research before taking any step.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AbuBhakar",
      "created_time": "August 07, 2023, 01:31:58 PM",
      "body": "Quote from: 348Judah on August 07, 2023, 01:23:40 PMQuote from: Broadanbig on August 07, 2023, 12:33:27 PM I was going through one of the newspaper dailies  and I came across a particular one that caught my attention. So I was wondering who this guy is. He has 1300 mining servers which he earns ₦6500 from each on daily basis and a total of ₦15million ( currency calculations based on my local currency) daily when calculated together according to the source. He claimed to have started mining since 2017 and has accumulated mining servers to this extent  years past.I don't know how true this could be but i can assure you that cloud mining today is nothing than a bit of crap and time waster, maybe then, those that got into it earlier have taken advantage in it before the whole thing exploded into scam after going through series of events and suverys, the amount received is too low to what bitcoin miners can generate in bitcoin mining or if they set up a mining rig, you would have given us the link to such news because i know that couldn't be bitcoin mining, the amount used was presented in Nigerian currency and i don't think in Nigeria they've got any bitcoin mining rig than a numbers of cloud mining sites which are mostly unreliable and scam.The guy on his post own a mining rig farm and not through cloud mining if you check the screenshot he provided on the OP. Probably, the OP way of describing mining rig is a network server because of what it look likes. Cloud mining is relly a scam because they are claiming to have a mining rig farm by sending picture of other mining farm then do a ponzi scheme by using the payment of new member to pay the old member.On this story, The person being described is an owner of a mining rig farm. He might be super rich if he didn’t sold all of his holdings since he start mining last 2017.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ndabagi01",
      "created_time": "August 07, 2023, 01:35:36 PM",
      "body": "Bitcoin mining is a more profitable way to make money than trading bitcoin. However, it necessitates one's efforts, time, and money. He doesn't need to trade bitcoin or diversify his source of income because he won’t have time to focus on them with the money he's making with that mining tool. He's still making a lot of money after deducting money for electrical bills. Along with network infrastructure and mining infrastructure, electricity is one of the most expensive costs associated with mining. Electricity consumed by mining machinery is expensive when compared to the energy required by those machines to mine. He's come a long way and reaped significant profits from his investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cuenta Alternativa",
      "created_time": "August 07, 2023, 01:42:57 PM",
      "body": "Quote from: AbuBhakar on August 07, 2023, 01:31:58 PMOn this story, The person being described is an owner of a mining rig farm. He might be super rich if he didn’t sold all of his holdings since he start mining last 2017.Converting the Naira to dollars, he would be making about $12,700 a day, which would be about $380,000 a month or 4.5 million a year.It is not clear to me whether this is gross or net. I assume it will be gross and that we will have to deduct what he pays for electricity, for example. We also don't know if he took a loan to start the business, which wouldn't be unusual, and we'd have to see how much is net.Quote from: 348Judah on August 07, 2023, 01:23:40 PMI don't know how true this could be but i can assure you that cloud mining today is nothing than a bit of crap and time waster, <...>Be careful, don't allow yourself to be a scam victim.If we add the fact that the case is in Nigeria, which is well known for several scams, including the famous alleged Nigerian grandfather who allegedly left you an inheritance, I can only be suspicious of the news.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 07, 2023, 05:08:03 PM",
      "body": "The guy is lucky to live in a country where the electrical rate is low unlike in a country where I live in that charge electricity so high and even charging us for the system generation loss which I think is very unfair.  Anyway, if the guy is mining since 2017 then if he does not have the habit of selling all his coins every time he accumulated enough and there is a surge in market price, then I also think that this guy have accumulated enough Bitcoin for people to consider him rich in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "www.Gambler.Casino",
      "created_time": "August 07, 2023, 05:18:26 PM",
      "body": "Quote from: Cuenta Alternativa on August 07, 2023, 01:42:57 PMQuote from: AbuBhakar on August 07, 2023, 01:31:58 PMOn this story, The person being described is an owner of a mining rig farm. He might be super rich if he didn’t sold all of his holdings since he start mining last 2017.Converting the Naira to dollars, he would be making about $12,700 a day, which would be about $380,000 a month or 4.5 million a year.It is not clear to me whether this is gross or net. I assume it will be gross and that we will have to deduct what he pays for electricity, for example. We also don't know if he took a loan to start the business, which wouldn't be unusual, and we'd have to see how much is net.Quote from: 348Judah on August 07, 2023, 01:23:40 PMI don't know how true this could be but i can assure you that cloud mining today is nothing than a bit of crap and time waster, <...>Be careful, don't allow yourself to be a scam victim.If we add the fact that the case is in Nigeria, which is well known for several scams, including the famous alleged Nigerian grandfather who allegedly left you an inheritance, I can only be suspicious of the news. Equipment depreciates over time, it turns out that mining is also a big risk.Much more profitable to explore buying when the market is bottoming",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "August 07, 2023, 05:32:22 PM",
      "body": "Quote from: 348Judah on August 07, 2023, 01:23:40 PMI don't know how true this could be but i can assure youThat you have no idea what you're talking about- this is not about a cloud mining thing- mining rigs usually refer to gpu mining, this is a whole farm with 1000+ ASICs- OP has stated that he used the conversion to Niara, the original video which you could have watched clearly shows $So how about reading before giving advice?Also, Zac used to have an account here on Bitcointalk:https://bitcointalk.org/index.php?action=profile;u=1154084Quote from: Broadanbig on August 07, 2023, 12:33:27 PMI believe Bitcoin is legally approved in his country for him to have such a large Bitcoin mining farm fully powered with electric supply and also since he is making profit from it, then I believe he is also paying tax to the government of his country for running a Bitcoin mining farm together with the power supply he enjoys on daily basis to sustain the smooth running of the farm.It's in the USA.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 07, 2023, 05:47:43 PM",
      "body": "Well anyone with a mining farm is rich. As long as he knows when to sell, I'm sure he learned all these since he had been around for years. There is a mining farm near my house, a few miles. I have only visited there once but I have talked to the girls working on that farm and they were pretty much aware of ICOs they did invest some tokens in the past. Those girls have cars prettier and newer than mine. I couldn't find any signs they are rich but the cars they have.  Check that dudes car if you can, what type of car he has, will tell he is rich.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sokani",
      "created_time": "August 07, 2023, 06:35:55 PM",
      "body": "Quote from: Cuenta Alternativa on August 07, 2023, 01:42:57 PMConverting the Naira to dollars, he would be making about $12,700 a day, which would be about $380,000 a month or 4.5 million a year.It is not clear to me whether this is gross or net. I assume it will be gross and that we will have to deduct what he pays for electricity, for example. We also don't know if he took a loan to start the business, which wouldn't be unusual, and we'd have to see how much is net.When I saw the post, I became interested and wanted to know if this is true but it turns out to be another fake news made by legit.ng to feed their gullible readers and to draw traffic to their website. From the source website, what is there is a merged picture of a black guy and 2 mining farms which could have been gotten from anywhere. The TikTok video link is completely different video that's not related in any way to the post. The video from the TikTok account @ZAC.SAFRON, is a white guy showing off his mining farm and from the background it obvious the video wasn't recorded in Nigeria.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aikidoka",
      "created_time": "August 07, 2023, 06:56:03 PM",
      "body": "This could be real, even though 1300 BTC sounds like a huge amount. However, considering that the person has been involved in the crypto field for a long time it's possible that it's true. Bitcoin mining is known for its profitability over trading, I mean don't get me wrong both are very profitable but I think trading is more riskier, but it's important to have a clear understanding of what you're doing when it comes to both.Predicting profits can be really hard in mining since they are influenced by the fluctuating price of Bitcoin. Nevertheless, if you're not burdened by electricity costs such as having a renewable energy setup in your mining factory, you are more likely to make a huge profit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "flyingcarpet",
      "created_time": "August 07, 2023, 07:07:52 PM",
      "body": "Quote from: serjent05 on August 07, 2023, 05:08:03 PMThe guy is lucky to live in a country where the electrical rate is low unlike in a country where I live in that charge electricity so high and even charging us for the system generation loss which I think is very unfair.  Anyway, if the guy is mining since 2017 then if he does not have the habit of selling all his coins every time he accumulated enough and there is a surge in market price, then I also think that this guy have accumulated enough Bitcoin for people to consider him rich in Bitcoin.A lot of people who want to mine have electricity barriers. Most countries don't have these barriers, but we don't have the power to change the country we live in to do this mining. Some people are really lucky in this. They are lucky and they use their brains. That's how they get ahead of a lot of people financially.If there is an accumulation since 2017, that person is really rich. Still, it would be wrong not to talk about injustice in such a situation. If mining conditions were equal all over the world, things could be very different in a positive way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "August 07, 2023, 07:38:40 PMLast edit: August 07, 2023, 08:00:22 PM by Obari",
      "body": "This is an amazing feet to achieve and I was wondering why you converted his earnings to naira and not dollar?But nevertheless I think his achievements are truly worth celebrating and emulating and that is truly a show of consistency and dedication.I guess the miner should be in a country with a very stable electric power supply because I'm very sure that running a mining farm requires alot of electricity and and some sort of serious attention to achieve such great success and it will definitely  have his own challenges and I could  only imagine how much effort and work the miner must have inputted into this.I also tried checking the details of the miner on ticktok and it seems his not a Nigerian but rather a white guy showing off his mining farm and I was really amazed by what I saw on his page and I could only wish I could own something like this someday 😀",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "karabiber",
      "created_time": "August 08, 2023, 06:08:23 AM",
      "body": "Quote from: Ndabagi01 on August 07, 2023, 01:35:36 PMBitcoin mining is a more profitable way to make money than trading bitcoin. However, it necessitates one's efforts, time, and money. He doesn't need to trade bitcoin or diversify his source of income because he won’t have time to focus on them with the money he's making with that mining tool. He's still making a lot of money after deducting money for electrical bills. Along with network infrastructure and mining infrastructure, electricity is one of the most expensive costs associated with mining. Electricity consumed by mining machinery is expensive when compared to the energy required by those machines to mine. He's come a long way and reaped significant profits from his investment.Every venture carries its own risks and this includes Bitcoin mining. Mining may be less risky but it is more difficult for humans to mine than to trade. Nowadays if you don't have a significant amount of savings, you cannot mine and if you have chosen the crypto markets as an economic exit, there is not much that can be done other than trading or researching projects. The original idea of ​​mining was that anyone with a computer could become a miner. Now we see that those who profit from mining are big investors with new and expensive equipment. The original idea is now obsolete and it's not possible for anyone with computer to be able to mine. Most of the people do not have mining facilities and they have to trade to multiply their money. Making smart moves and mastering technical terms while trading will bring success in trading. Finally trading or mining both have their advantages and disadvantages. I would not recommend people who are new to this business to start mining unless they have large capital. With direct mining, there is a risk that your equipment will break or the difficulty of a block increases sharply, electricity costs skyrocketing. Even if you buy and trade Bitcoin directly, the risks lie in storing your cryptocurrencies and losing your bitcoins in trading. Would you rather trust them on the exchange or keep them yourself with a hardware wallet? Either way, there is a risk and whether you choose to mine or directly invest in Bitcoin depends entirely on your style, capital and preferences.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}