{
  "id": "topic_5416553",
  "title": "nullama",
  "author": "nullama",
  "created_time": "October 10, 2022, 01:45:25 AM",
  "content": "Here's an interesting project I found that makes it easy to accept bitcoin through lightning on any ESP32 microcontroller.https://github.com/lnbits/bitcoinSwitchThat means you can accept sats with any kind of device:The setup is pretty simple:\"ToTheMoon\" is of course the default password  I think some people here would be interested in playing around with something like this, so wanted to share.Here's a video of it in action: https://www.youtube.com/watch?v=FeoIwTjv3YM",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5416553",
  "comments": [
    {
      "author": "joniboini",
      "created_time": "October 10, 2022, 11:43:13 AM",
      "body": "Nice find. I thought it will allow my smart lamp to accept Bitcoin, but it looks like it requires a specific microcontroller so any led/smart device is not going to cut it. The microcontroller itself looks cheap though, just $5 in my local market, half the price of most smart lamps in the market. The problem is probably preparing the device itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 10, 2022, 11:50:01 AM",
      "body": "There are a lot of smart home devices that have public APIs. the TP-Link Kasa is one that I know of. Although you would now be relying on their service to take care of the on & off or whatever other control you want building a front end to deal with the lightning payments should not be that hard. It's an interesting / fun idea but with the abundance of smart home products out there and the fact that you are dealing with 'real' voltages I would not want to do it with an off the shelf controller. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 10, 2022, 01:45:26 PM",
      "body": "Quote from: nullama on October 10, 2022, 01:45:25 AMI think some people here would be interested in playing around with something like this, so wanted to share.It reminds me of the Scrooge McDuck comic in which there's a payment machine for everything. This is so cool! I see so many possibilities to annoy the kids: watch TV? 5 sats! Charge your tablet? 5 sats! Allowance? In sats Quote from: joniboini on October 10, 2022, 11:43:13 AMNice find. I thought it will allow my smart lamp to accept Bitcoin, but it looks like it requires a specific microcontroller so any led/smart device is not going to cut it.Turn on your light: 5 sats QuoteThe microcontroller itself looks cheap though, just $5 in my local market, half the price of most smart lamps in the market.One drawback is the energy consumption. Paying your own lamp per hour is fun, but paying for the lamp to be off sucks.Quote from: DaveF on October 10, 2022, 11:50:01 AMIt's an interesting / fun idea but with the abundance of smart home products out there and the fact that you are dealing with 'real' voltages I would not want to do it with an off the shelf controller.With a decent quality relay, I wouldn't worry about switching 230V, but it does need more precautions. Especially the housing should be safe.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 10, 2022, 03:14:44 PM",
      "body": "Quote from: nullama on October 10, 2022, 01:45:25 AMHere's an interesting project I found that makes it easy to accept bitcoin through lightning on any ESP32 microcontroller.Cool stuff and I know about this guy Ben Arc from LNbits very well, he made a bunch of Bitcoin related things based on cheap ESP32 devices.He made hardware wallet signing device Bowser I wrote before, and I also wrote about his LNURLPoS device that is using Lightning Network, and about his cheap offline ATM machine.He is going to be a speaker in upcoming El Salvador Adoption conference, so that is worth checking out.Quote from: LoyceV on October 10, 2022, 01:45:26 PMOne drawback is the energy consumption. Paying your own lamp per hour is fun, but paying for the lamp to be off sucks.C'mon man... just pull off the lamp electric plug from wall socket",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "October 10, 2022, 03:24:58 PM",
      "body": "Quote from: dkbit98 on October 10, 2022, 03:14:44 PMC'mon man... just pull off the lamp electric plug from wall socket  Then you can't use your LN-switch.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "November 01, 2022, 06:31:42 AM",
      "body": "This can actually open up a whole new industry, if you can implement this successfully. The \"Pay per use\" concept can work well, in a student village for example, where people can charge students to use their appliances. (Microwave) You can also implement this in a Guesthouse to charge people to use the Jacuzzi or the vibrating bed for instance... so it is a very cool idea.    The question remains..... Is the LN matured enough to get enough business to pay for this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "November 01, 2022, 06:52:32 AM",
      "body": "Quote from: Kakmakr on November 01, 2022, 06:31:42 AMThis can actually open up a whole new industry, if you can implement this successfully. The \"Pay per use\" concept can work well, in a student village for example, where people can charge students to use their appliances. (Microwave) You can also implement this in a Guesthouse to charge people to use the Jacuzzi or the vibrating bed for instance... so it is a very cool idea.    The question remains..... Is the LN matured enough to get enough business to pay for this.  I think this has a huge potential.First, it can replace basically all the current vending machines that require cash or credit cards.But it can also create new types of interactions in which you pay wirelessly with sats and you see/get the effect in the real world.For example, you could have a lightning address such as pickyourmusic@thisbar.com and the amount of sats you send there select the song, say 101 sats for song 1, 104 sats for song 4, etc.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "November 01, 2022, 05:36:52 PM",
      "body": "Quote from: nullama on November 01, 2022, 06:52:32 AMFirst, it can replace basically all the current vending machines that require cash or credit cards.Kudos for suggesting that. I was thinking maybe we could slap a Raspberry Pi controller inside a vending machine skeleton, that is connected to a small pixel screen that displays QR codes and also to an NFC scanner, the point being so that users can scan a Lightning invoice once they press a button for their snack which they can pay with any wallet - including their apps, and they get their snack.It would be completely theft-proof as there are no private keys in the vending machines, just the snacks (and the machine itself, but you could just put a Kensington lock and bullet-proof glass on it to deter theft).I'm going off a tangent but perhaps there could be a way for it to scan Cash App/Venmo/... invoices as well.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "November 01, 2022, 10:06:26 PM",
      "body": "Quote from: NotATether on November 01, 2022, 05:36:52 PM~snip~Kudos for suggesting that. I was thinking maybe we could slap a Raspberry Pi controller inside a vending machine skeleton, that is connected to a small pixel screen that displays QR codes and also to an NFC scanner, the point being so that users can scan a Lightning invoice once they press a button for their snack which they can pay with any wallet - including their apps, and they get their snack.It would be completely theft-proof as there are no private keys in the vending machines, just the snacks (and the machine itself, but you could just put a Kensington lock and bullet-proof glass on it to deter theft).I'm going off a tangent but perhaps there could be a way for it to scan Cash App/Venmo/... invoices as well.I would still prefer the sat selection idea for that use case.Send 1001 sats for chocolate bar.Send 2103 sats for soda can.Etc... And having a lightning address makes this extremely simple. Just sent X amount to Y address.That way you only need to interact once, just sending the money also selects the item you want.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 02, 2022, 11:21:56 AM",
      "body": "Quote from: nullama on November 01, 2022, 10:06:26 PMI would still prefer the sat selection idea for that use case.Send 1001 sats for chocolate bar.Send 2103 sats for soda can.I think this is terrible  Not only does the number of sats fluctuate when Bitcoin goes up and down, you'll also need to show the price for each individual item. And if you show the price anyway, why not give each item their own QR-code to pay to? Then the QR code selects the item, instead of the paid amount.QuoteAnd having a lightning address makes this extremely simple. Just sent X amount to Y address.Quote from: nullama on November 01, 2022, 06:52:32 AMFor example, you could have a lightning address such as pickyourmusic@thisbar.comDid I miss a LN-update that allows to send funds to an email address instead of an invoice?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 02, 2022, 11:36:03 AMLast edit: November 02, 2022, 12:04:52 PM by DaveF",
      "body": "Quote from: LoyceV on November 02, 2022, 11:21:56 AMQuote from: nullama on November 01, 2022, 06:52:32 AMFor example, you could have a lightning address such as pickyourmusic@thisbar.comDid I miss a LN-update that allows to send funds to an email address instead of an invoice?https://lightningaddress.com/Don't know how many people are actually using it or want to use it but it does work. You can actually send me money just by sending to mrdave@bitrefill.me from a service that supports it.I also have one that is running on my own node but since it's tied to a personal email I don't want to put it out here since I get enough spam / junk as it is :-)Since I have been giving both email address out I have gotten, do some math...carry the 1....yeah 1 payment that way. (not including my tests)-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 02, 2022, 12:35:31 PM",
      "body": "Quote from: DaveF on November 02, 2022, 11:36:03 AMhttps://lightningaddress.com/You can actually send me money just by sending to mrdave@bitrefill.me from a service that supports it.I'm happily surprised Phoenix Wallet supports this! I would have sent you a few sats, but my wallet is currently empty.How does this work though? Do funds go to your Bitrefill account?QuoteI also have one that is running on my own node but since it's tied to a personal email I don't want to put it out here since I get enough spam / junk as it is :-)Is the link between the email address and your server custodial? In other words: is there someone who can change where funds go by changing where your email address sends the funds?I found it, it looks like it's doesn't need any third parties:(source)QuoteDon't know how many people are actually using it or want to use it but it does work.I haven't used LN for a while, but this looks good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 02, 2022, 06:52:03 PM",
      "body": "Quote from: LoyceV on November 02, 2022, 12:35:31 PMQuote from: DaveF on November 02, 2022, 11:36:03 AMhttps://lightningaddress.com/You can actually send me money just by sending to mrdave@bitrefill.me from a service that supports it.I'm happily surprised Phoenix Wallet supports this! I would have sent you a few sats, but my wallet is currently empty.How does this work though? Do funds go to your Bitrefill account?Yes, it just goes into my bitrefill balance.And, as I said before and since I admit I didn't think it through when I 1st tested and gave it out, If you are going to do this yourself instead of using a hosted service you really should create a new / vanity email instead of using one that you use as your normal email. Otherwise you do wind up with even more spam / junk then normal coming in.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "November 02, 2022, 10:14:39 PM",
      "body": "Just in case someone wants to have some ready to use lightning addresses, here are two services that work great for this:https://getalby.comThis is a website dedicated to help creators get paid in sats through their content. They have a plugin that makes payment in websites extremely easy. You end up with a lightning address like this: nullama@getalby.comhttps://stacker.newsThis is a news website that uses sats as the native upvoting system. When you create an account you end up with a working lightning wallet and a lightning address like this: nullama@stacker.newsYou can use those wallets and lightning addresses in other services of course, and it all works like a charm.If you only want one, I would go with stacker news since it's actually a great website anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "November 03, 2022, 11:25:15 AM",
      "body": "Quote from: nullama on November 02, 2022, 10:14:39 PMJust in case someone wants to have some ready to use lightning addressesThose are both custodial, right? I almost forgot I'm okay with that for small amounts.Quotehttps://getalby.comThis is a website dedicated to help creators get paid in sats through their content. They have a plugin that makes payment in websites extremely easy. You end up with a lightning address like this: nullama@getalby.comI don't like that it wants me to install a browser plugin:Quote\"This add-on is not actively monitored for security by Mozilla. Make sure you trust it before installing.\"I'll skip this one.Quote from: nullama on November 02, 2022, 10:14:39 PMhttps://stacker.newsThis is a news website that uses sats as the native upvoting system. When you create an account you end up with a working lightning wallet and a lightning address like this: nullama@stacker.newsFirst impression: That's better, .onion available!On second thought: after entering my email address:Quote from: http://snsnsnya6h3ot563f3p566wuhfoklkg5f62hokdlaqzcaub3gf4xlxyd.onion/api/auth/errorErrorstacker.newsIt works after I try again, but it's a weird system: it doesn't let me create a password, I have to click a link in my email every time to login. And the link brings me to the non-onion site again. Even if I manually edit the link, it doesn't allow me to login on the .onion domain. Also, the login link expires after each click, so I have to copy/paste my email address to get a new link each time. Not a very convenient website, unfortunately.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nullama",
      "created_time": "November 03, 2022, 11:48:10 AM",
      "body": "Quote from: LoyceV on November 03, 2022, 11:25:15 AM~snip~Those are both custodial, right? I almost forgot I'm okay with that for small amounts.Both are custodial by default, yes. With alby you can connect to your own node, and I think that's also planned with Stacker News in the near future.Quote from: LoyceV on November 03, 2022, 11:25:15 AMI don't like that it wants me to install a browser plugin:It's not needed, it's just a better experience but I don't have it installed and everything works just fine.Quote from: LoyceV on November 03, 2022, 11:25:15 AMhttps://stacker.newsFirst impression: That's better, .onion available!On second thought: after entering my email address:It works after I try again, but it's a weird system: it doesn't let me create a password, I have to click a link in my email every time to login. And the link brings me to the non-onion site again. Even if I manually edit the link, it doesn't allow me to login on the .onion domain. Also, the login link expires after each click, so I have to copy/paste my email address to get a new link each time. Not a very convenient website, unfortunately.I haven't used the onion service, but personally it just works great, it logins once from email and then you're always logged in. You could try use a lightning wallet for login, no need for email. Have a look here for wallets: https://stacker.news/items/88811",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "November 03, 2022, 01:38:32 PM",
      "body": "Quote from: LoyceV on November 03, 2022, 11:25:15 AMThose are both custodial, right? I almost forgot I'm okay with that for small amounts.If you don't mind custodial then https://www.walletofsatoshi.com/ is probably one of the most popular ones. For the lightningaddress you can only have an @walletofsatoshi.com email that they auto generate but it is what it is. Also, they have a map in the wallet that lets you find nearby places that accept BTC and BATMs. I think we are drifting a lot from the OT, so someone should probably start a new thread if we want to keep talking about lightningaddress. -Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NotATether",
      "created_time": "November 03, 2022, 05:25:27 PM",
      "body": "@LoyceVI just used Github to sign into Stacker News. That way I can just log into the wallet later I ever want to withdraw data. Though [actual] work has taken its toll on me and it's been a while since I last browsed that site...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "November 06, 2022, 06:20:20 PM",
      "body": "This project has a huge potential, it could be implemented for streamers to let the viewers change the color lights or change the background song on the stream or do some other crazy stuff to let the viewers interact with the viewers. Another implementation that would be nice is for gambling, can you imagine a coin pusher working this way and paying the profit to the bettors, that would be something nice to see, and it could be create with this software.Thanks for sharing it, i will look at the source code.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}