{
  "id": "topic_5440523",
  "title": "mxfwzzwizqbz",
  "author": "mxfwzzwizqbz",
  "created_time": "February 20, 2023, 07:27:31 AM",
  "content": "I don't care what you guys change it to, you can change it to Michael23913 or something like that but please I just want to remove my last name from my account. I don't want my full name on this thing lmao",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440523",
  "comments": [
    {
      "author": "Little Mouse",
      "created_time": "February 20, 2023, 07:30:07 AM",
      "body": "If you want to change your name, you have to PM theymos, the admin of the forum. Usually, he doesn't allow changing username unless you can convince him with a reasonable excuse. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_BlackStar",
      "created_time": "February 20, 2023, 07:50:13 AM",
      "body": "Quote from: Little Mouse on February 20, 2023, 07:30:07 AMIf you want to change your name, you have to PM theymos, the admin of the forum. Usually, he doesn't allow changing username unless you can convince him with a reasonable excuse. Good luck.I don't know if newbie who has 20 posts and 14 activity who probably hasn't made any major contributions to the forum can convince an admin to change the username. But there's nothing wrong with trying, even The Skeptical Chymist had to wait quite while for it to be approved to change its username from The Pharmacist.I don't think it's the admin's fault if not accepting a user's request to change their username, but for some plausible reason I think it will be considered.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rikafip",
      "created_time": "February 20, 2023, 07:58:00 AM",
      "body": "Since you created that account yesterday, wouldn't it be easier to just abandon it and create a new one instead? Its not like you put much effort into it so you would lose something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "February 20, 2023, 08:02:53 AM",
      "body": "Mate just create a new account. You only have like 20 posts. Historically, Theymos only changed the username of accounts that have been registered for years, and that have been contributing a good amount. The chances of your username getting changed is slim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "digaran",
      "created_time": "February 20, 2023, 08:08:17 AM",
      "body": "I would suggest that he gets a name change since that's a minor, a 16 years old teenager boy who has apparently consumed a lot of sugar having an outburst of energy. Please change the name @admin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LoyceV",
      "created_time": "February 20, 2023, 08:26:59 AM",
      "body": "Quote from: _BlackStar on February 20, 2023, 07:50:13 AMThe Skeptical Chymist had to wait quite while for it to be approved to change its username from The Pharmacist.From what I've seen, Admin can be faster when it's for privacy reasons. But even if OP's name gets changed, his name can always be found back later. Once it's on the internet, it can't be forgotten.Quote from: Rikafip on February 20, 2023, 07:58:00 AMwouldn't it be easier to just abandon it and create a new one instead?That would really break the link with OP's current account.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MusaMohamed",
      "created_time": "February 20, 2023, 08:32:58 AM",
      "body": "Quote from: theymos on August 28, 2011, 11:16:31 PMDone. Now only moderators, Donators, and VIP members can change their names automatically. Other members should contact me. I'll probably ignore your request if you have less than 50 posts (unless your posts are very good).Quote from: hilariousandco on January 06, 2020, 10:38:23 AMYou can't. You can try PM an admin and they may do it, but they usually don't. You can just create another account  with that name if you feel like you need it.If you are not VIP or Donator member, you can not change your username.Admin can change your username without VIP or donator member condition if he sees you have good reasons for your privacy, dox or something dangerous to you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "imamusma",
      "created_time": "February 20, 2023, 08:33:51 AM",
      "body": "Quote from: mxfwzzwizqbz on February 20, 2023, 07:27:31 AMI don't care what you guys change it to, you can change it to Michael23913 or something like that but please I just want to remove my last name from my account. I don't want my full name on this thing lmaoYour login or username can only be changed by an admin, so try contacting them for change request. Then for your other thread: Deletion of my account, imo the account deletion act is also only handled by the admin and if you are really concerned about your privacy then contact them ASAP and explain what the problem is. Good luck.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Sceptical Chymist",
      "created_time": "February 20, 2023, 08:39:35 AM",
      "body": "Quote from: _BlackStar on February 20, 2023, 07:50:13 AMeven The Skeptical Chymist had to wait quite while for it to be approved to change its username from The Pharmacist.Just to clarify, Theymos implied in his PM to me that I didn't need to wait nearly as long as I did before he granted my name change (which was over 2 years I think).  He told me I should have been more persistent in reminding him, which I basically just did none of.But to OP here, I'm thinking that just deleting all of his posts and creating a new profile should do the trick.  That name is common enough that I doubt anyone is going to associate the person behind it with the bitcointalk account.  Theymos might grant his request, but I'm not sure he does name changes for trivial reasons.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "UserU",
      "created_time": "February 20, 2023, 09:22:03 AM",
      "body": "Quote from: The Sceptical Chymist on February 20, 2023, 08:39:35 AMJust to clarify, Theymos implied in his PM to me that I didn't need to wait nearly as long as I did before he granted my name change (which was over 2 years I think).  He told me I should have been more persistent in reminding him, which I basically just did none of.I wonder though, why didn't he just change the name, rather than asking you to remind him later?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "February 20, 2023, 02:39:52 PM",
      "body": "Quote from: The Sceptical Chymist on February 20, 2023, 08:39:35 AMJust to clarify, Theymos implied in his PM to me that I didn't need to wait nearly as long as I did before he granted my name change (which was over 2 years I think).  He told me I should have been more persistent in reminding him, which I basically just did none of.Your case won't be as that of OP. You're not just a veteran member, you're also a reputable one. Expectedly and quite understandably too, theymos will have a soft spot for users like that. If it were any different, theymos may not even have given the pm a second thought. If I were the OP, I would just create a fresh account and abandon this vexatious one instead of going through the wait and stress of expecting that the moniker would be changed. However, it's surprising to me how anyone would include their surname to their moniker when it's not a professional career site/forum like we've in LinkedIn.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "February 20, 2023, 02:58:58 PM",
      "body": "Quote from: Mpamaegbu on February 20, 2023, 02:39:52 PM However, it's surprising to me how anyone would include their surname to their moniker when it's not a professional career site/forum like we've in LinkedIn.You're forgetting that the OP is still a child. He turns 16 on February 26th. He recently registered on the site, and we are already literally familiar with his entire history, including photos and videos. Likewise, he had previously been warned not to be so open, but the boy thought that deleting information from the forum by deleting his account would be a very simple matter. Apparently, when he decided to do this, something went wrong.How often do we see such stories when our children can foolishly tell everyone about us, everything that we have hidden for years? The naivety of children, even if they are 16 years old, can play a trick on them in the future. Probably, the dangers of the network should be explained as soon as the child gets a bottle of milk in his mouth.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mpamaegbu",
      "created_time": "February 20, 2023, 03:28:42 PM",
      "body": "Quote from: lovesmayfamilis on February 20, 2023, 02:58:58 PMQuote from: Mpamaegbu on February 20, 2023, 02:39:52 PM However, it's surprising to me how anyone would include their surname to their moniker when it's not a professional career site/forum like we've in LinkedIn.You're forgetting that the OP is still a child. He turns 16 on February 26th.Ok, I see you've dug the lad out already 🙆‍♀️. Are you in anyway referring to his \"sophomore\" comment somewhere in the other thread? Well, to tell you the truth I tend to take what people say is their age on social forum with a pinch of salt, especially a faceless one like we've here where you don't get to see users' pictures.QuoteHe recently registered on the site, and we are already literally familiar with his entire history, including photos and videos.That's the trend this day with people seeking validation online of whatever they do. It disgusts me and it's worse when you see adults do it. We see these shameless adults display their so called romantic life and wealth on Tiktok and Instagram just to give the globe the impression that their lives are better. What for?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "February 20, 2023, 04:10:20 PM",
      "body": "That's a pretty good name for you to use mate. Consider if you want to change it.Your account registration on 19 Feb 2023 is exactly one day if we count today, meaning that your age on the forum is only one day which is worthy of being considered not to have contributed anything.Before you register, you should first consider the name you will use so that you don't have the desire to change it as you currently want.From various experiences that have been experienced by several other users related to changing names with the age of registering long enough and already contributing quite a lot to the forum is not fulfilled easily like turning the palm of the hand. Moreover, the age has not reached 1 week.My advice, it is better if you consider the input from Rikafip regarding your wishes.Quote from: Rikafip on February 20, 2023, 07:58:00 AMSince you created that account yesterday, wouldn't it be easier to just abandon it and create a new one instead? Its not like you put much effort into it so you would lose something.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}