{
  "id": "topic_5418868",
  "title": "Aysop",
  "author": "Aysop",
  "created_time": "October 30, 2022, 09:51:13 PM",
  "content": "Anyone know any good gambling sites with good live blackjack? I played a lot of blackjack on Stake.com and found Evolution's blackjack experience to be pretty good. Unfortunately for most sites that allow US players, crypto or not, they have pretty awful ugly UI that's laggy and kind of ruins the experience. Anyone have any recommendations for crypto casinos that allow US players either directly or indirectly (VPN allowed and no KYC for normal play or KYC locking withdrawal)?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5418868",
  "comments": [
    {
      "author": "Beparanf",
      "created_time": "October 31, 2022, 11:33:33 AM",
      "body": "Most of the live blackjack provider has same license coverage and US always excluded to there operation. There is no casino here that allows US citizen to play directly unless you are using a VPN but still not legal. Try to search on reddit or your local online casino hub. US has a different license regulator so most of the live blackjack provider doesn't do much effort due to there limited market unlike Evo and Pragmatic which serves globally. You can check this topic https://www.reddit.com/r/onlinegambling/comments/7ohyhp/places_to_play_online_blackjack/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aysop",
      "created_time": "November 04, 2022, 11:03:01 PM",
      "body": "Quote from: Beparanf on October 31, 2022, 11:33:33 AMMost of the live blackjack provider has same license coverage and US always excluded to there operation. There is no casino here that allows US citizen to play directly unless you are using a VPN but still not legal. Try to search on reddit or your local online casino hub. US has a different license regulator so most of the live blackjack provider doesn't do much effort due to there limited market unlike Evo and Pragmatic which serves globally. You can check this topic https://www.reddit.com/r/onlinegambling/comments/7ohyhp/places_to_play_online_blackjack/I don't mind using a VPN and submitting fake information (just address not documents like ID). I'm just worried about getting suspended and then not being able to get my money out if they ask for extra KYC.I was using Stake.com successfully on 2 accounts, one of them had 50-60k wagered (1k profit before losing my last $340) before getting suspended (withdrawal only). When it asked for my ID, I would just submit an invalid picture and then deposits would unlock, then a day or 2 later, it would ask for ID, rinse and repeat for over a month. Not sure if they changed that policy because I got limited immediately when I tried it on a new account, and when I tried a blurry photo, I was able to deposit and bet my $25, but within a few minutes it's asking for ID again... Expecting my second ID submission to result in a suspension.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "November 05, 2022, 12:35:15 PM",
      "body": "On the website https://stake .us has only blackjack from Stake originals and Pragmatic, but there is no live casino, but it also seems to me that there are a sufficient number of online casinos with live blackjack in US, that's what the search gives out, for example, but of course everything should be checked for trust https://www.bestuscasinos.org/live-dealer/blackjack/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "November 05, 2022, 01:21:46 PM",
      "body": "One platform that had been promoted in the forum for months was https://blackjack.fun I'm not sure if this is accessible in your area but most likely you can with VPN. UI isn't so bad too.If you mean normal users like not depositing $100K and withdrawing $100K also I guess this casino won't be asking KYC.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "November 05, 2022, 02:02:26 PM",
      "body": "Quote from: Aysop on October 30, 2022, 09:51:13 PMAnyone know any good gambling sites with good live blackjack? I played a lot of blackjack on Stake.com and found Evolution's blackjack experience to be pretty good. Unfortunately for most sites that allow US players, crypto or not, they have pretty awful ugly UI that's laggy and kind of ruins the experience. Anyone have any recommendations for crypto casinos that allow US players either directly or indirectly (VPN allowed and no KYC for normal play or KYC locking withdrawal)?I'm not really a fan of the game of blackjack, but maybe you can check it out here maybe you find something you might be looking for, I quote your words above if you are comfortable and have a great experience playing blackjack on Stake.com why look for something else elsewhere other",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}