{
  "id": "topic_5498352",
  "title": "Cubewaldo",
  "author": "Cubewaldo",
  "created_time": "May 30, 2024, 05:27:42 PMLast edit: May 30, 2024, 06:01:13 PM by Cubewaldo",
  "content": "https://coinmarketcap.com/currencies/notcoin/ wow this is rising like foam since the release how do you think? to buy or not to buy?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5498352",
  "comments": [
    {
      "author": "Cubewaldo",
      "created_time": "May 30, 2024, 06:49:01 PMLast edit: May 30, 2024, 07:01:49 PM by Cubewaldo",
      "body": "I'm looking here to try to play this games and earn some free NOT but i still cannot join any, are you having the same issue? Do ypu know how to join this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cointable.de",
      "created_time": "May 30, 2024, 07:22:16 PM",
      "body": "it is a little bit a coin you dump, because you get it with staking of ton. After this, the coin will be dumped. So i sell my not coin every time i get one from staking it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cubewaldo",
      "created_time": "May 30, 2024, 07:59:15 PM",
      "body": "Quote from: cointable.de on May 30, 2024, 07:22:16 PMit is a little bit a coin you dump, because you get it with staking of ton. After this, the coin will be dumped. So i sell my not coin every time i get one from staking it.I'm gathering infos and i found this in general: https://www.coinspeaker.com/guides/all-you-need-to-know-notcoin-how-to-mine-coins-in-telegram-and-what-to-do-with-them/So if you can please link me to your source where explain how to mine $not via $ton? https://youtu.be/pEu4AZjEDHk in this tutorial there's no infos about neither.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "May 31, 2024, 03:45:22 AM",
      "body": "Quote from: Cubewaldo on May 30, 2024, 05:27:42 PMhttps://coinmarketcap.com/currencies/notcoin/ wow this is rising like foam since the release how do you think? to buy or not to buy?    I prefer not to buy. It's kinda stupid to bought a coin that has already pumped so high like this. The better to buy another token which are still being traded at the bottom this time. Keep in your mind that if we may be facing another decline that is gonna happen soon. For someone who keen to lose their money this time. They can buy notcoin and wait it for midterm. The last waves may be coming soon and i expect it to dump again. The chart has been telling me that. So, let's wait and see.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tomos81",
      "created_time": "May 31, 2024, 04:04:39 AM",
      "body": "Quote from: cointable.de on May 30, 2024, 07:22:16 PMit is a little bit a coin you dump, because you get it with staking of ton. After this, the coin will be dumped. So i sell my not coin every time i get one from staking it.It has only been listed on the exchange for a short time, but it can definitely improve. Because it has massive investors and daily volume is massive. Since the coin was listed and dumped and is now pumping again, it will definitely reap more benefits if you hold it long enough.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "God Of Thunder",
      "created_time": "May 31, 2024, 05:22:41 AM",
      "body": "Quote from: Cubewaldo on May 30, 2024, 05:27:42 PMhttps://coinmarketcap.com/currencies/notcoin/ wow this is rising like foam since the release how do you think? to buy or not to buy?    Nope. This isn't raised like foam bro. You should know more about the Notcoin project. They gave away $1 billion to their community and the coin hit 0.03 in the first hour of listing. However, since they were giving 1 billion dollars to their community, the bounty hunters were selling them all on the market, and it started crashing after a few hours of listing. Since then, the price of Not coin has touched 0.005 USD, which was a great buying opportunity. Since they had the airdrop, it was expected that people would dump all their airdrop earnings in the first 15 days which has happened already.But as you know, this is the coin of Telegram itself. The same developer who has built TON coin. NOT is just a parody of the TON coin. I am sure that telegram will invent more and more use case for Notcoin and I can see the future of this coin. Notcoin will be used on TON ecosystem in the future. I have been holding 25K Not since the first day and still holding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "shinratensei_",
      "created_time": "May 31, 2024, 05:37:09 AM",
      "body": "Quote from: Cubewaldo on May 30, 2024, 05:27:42 PMhttps://coinmarketcap.com/currencies/notcoin/ wow this is rising like foam since the release how do you think? to buy or not to buy?    should've bought when the airdrop receiver are still dumping the coin and the prices were still around 0.005 dollar or even lower, thats like the best time you can get in with this coin anything more than 0.01 is a fomo in my books.just remember that the market cap of this coin has reached 1 billion, the price going forward may be quite difficult to get up as easily as it is before it reached 0.01 but some people thinks that its the next pepe, i don't know whether this coin falls under meme coin category some people consider it because the description in CMC literally says that this coin is just nothing, there's no clear explanation but some people said this coin is a gaming coin which i think isn't really gaming to be honest.just wait until the price dips again if you want to buy, i'm sure it will, right now current market of this is in euphoria, it will subsides soon.I'm also waiting for a chance to buy but definitely not a good idea to buy it when market cap still more than 1 billion will be coming back to this coin again when the market cap come back to half billion again then it make sense.but maybe by then even better coin and newer coin appear so its tough decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bluebit25",
      "created_time": "May 31, 2024, 06:30:29 AM",
      "body": "I like what the TON ecosystem is doing including its user outreach strategy to gain a large community of supporters through NOT. But in terms of investment, I have completed the plan with NOT, I used to spend on some pre NOT before and after reaching x2 profit, I prepared that part for TON. I always want to prioritize the ecosystem as the main coin, although there are still many things surrounding NOT, but it depends on each person's approach and I always respect everyone's decisions when they feel satisfied with that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Andrija Branislav",
      "created_time": "May 31, 2024, 06:52:08 AM",
      "body": "Quote from: bluebit25 on May 31, 2024, 06:30:29 AMI like what the TON ecosystem is doing including its user outreach strategy to gain a large community of supporters through NOT. But in terms of investment, I have completed the plan with NOT, I used to spend on some pre NOT before and after reaching x2 profit, I prepared that part for TON. I always want to prioritize the ecosystem as the main coin, although there are still many things surrounding NOT, but it depends on each person's approach and I always respect everyone's decisions when they feel satisfied with that.NOT coin always attracts attention, especially now, even at the beginning of its launch it was already hotly discussed. I look at the coins that were launched in the TON ecosystem such as UpToken, NOT Coin which can now be said to have been successful, or one that caught my attention is Fish meme coin and they also use the same network, will UP and Not Coin be as lucky as those who buy it? ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ludmilla_rose1995",
      "created_time": "May 31, 2024, 08:47:04 AM",
      "body": "Quote from: tomos81 on May 31, 2024, 04:04:39 AMQuote from: cointable.de on May 30, 2024, 07:22:16 PMit is a little bit a coin you dump, because you get it with staking of ton. After this, the coin will be dumped. So i sell my not coin every time i get one from staking it.It has only been listed on the exchange for a short time, but it can definitely improve. Because it has massive investors and daily volume is massive. Since the coin was listed and dumped and is now pumping again, it will definitely reap more benefits if you hold it long enough.where did you get the information about this, I couldn't find it anywhere, in my opinion notcoin is not much different from other coins (it was created to compete with bitcoin) but as time goes by that will never happen I recommend it to anyone who wants to invest in it Big money in this coin requires in-depth research first, study the team and also the concept behind which this coin was created",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "May 31, 2024, 09:27:23 AM",
      "body": "Those who were able to participate in the mining event if they haven't sold the coin they will be happy with the pump. Those who have sold thier coins will be regretting thier decisions. I guess most free coin holders have already sold thier coin and now the whales are buying it. It has already gone above $0.001 and might be able to reach $0.002 if the pump continues.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeffBrad12",
      "created_time": "May 31, 2024, 12:17:57 PMLast edit: May 31, 2024, 12:48:29 PM by JeffBrad12",
      "body": "Quote from: Bureau on May 31, 2024, 09:27:23 AMThose who were able to participate in the mining event if they haven't sold the coin they will be happy with the pump. Those who have sold thier coins will be regretting thier decisions. I guess most free coin holders have already sold thier coin and now the whales are buying it. It has already gone above $0.001 and might be able to reach $0.002 if the pump continues.You mean about above 1 cents, right? I think you are getting typo by typing the price of notcoin. It must be 0.01. It's too far to call it not coin is now worth 0.001. I would like to buy tens hundreds millions of it if there will be no notcoin with such price.The fuckin whale have been pumping this one. It's my bad caused by i were not even paying attention with this. This is the main problem that was happening this time. NOT coin has been fliwying so high, i was missing a chance to buy this token at the bottom. It's fuckin sad for me to miss an opportunity in making a lot of money in a short time. It seems like that the chart has not yet stopped. There is sign for parabolic chart to happen soon. NOT is still having a lot of potential to grow even higher. The last wave can possible to happen soon.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dunamisx",
      "created_time": "May 31, 2024, 12:49:01 PM",
      "body": "As for those who have taken risk in making investment on NOTcoin, they should be smiling by now because it has given then enough reason to do so, the market pumped well as expected and if they are going to be more wise in their decision making concerning this coin, they had better sell now to reload on making another investment by buying the dip and hold, because the market can fall at anything, if bitcoin should fall, then expect more of it from NOTcoin, we should not hold it for too long.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hallroom",
      "created_time": "May 31, 2024, 04:27:16 PM",
      "body": "This is where the highest trading takes place and you can see the market moving up.  You will notice that it will reach higher prices in the future as the bull market season actually tries to peak.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dunfida",
      "created_time": "May 31, 2024, 04:56:10 PM",
      "body": "Quote from: Dunamisx on May 31, 2024, 12:49:01 PMAs for those who have taken risk in making investment on NOTcoin, they should be smiling by now because it has given then enough reason to do so, the market pumped well as expected and if they are going to be more wise in their decision making concerning this coin, they had better sell now to reload on making another investment by buying the dip and hold, because the market can fall at anything, if bitcoin should fall, then expect more of it from NOTcoin, we should not hold it for too long. I have NOTCOIN (NOT) which i havent invested totally but im one of those people who do took that airdropped and grinded up seriously. Honestly, i didnt expect that it would really be that become this big.Come to think that on its first launched its been listed out on multiple exchangers specially or including Binance and OKX which are considered to be 1st tier platforms on which this is really indeed shocking.If i have known that this one becomes big then i have seriously make those multiple accounts and grind it all away but well whats done is done.  Totally i have been able to make $1000+ with the airdropped that they had made on the current price as of this moment on which it isnt really that bad on getting via tapping on your free time.As for potential then i could say that this one is really having that  good community. Whales are also that joining up. So i wont be shocked if this one could hit up at at least 0.1 or 0.2$.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "senyorito123",
      "created_time": "May 31, 2024, 05:06:26 PM",
      "body": "Quote from: Cubewaldo on May 30, 2024, 05:27:42 PMhttps://coinmarketcap.com/currencies/notcoin/ wow this is rising like foam since the release how do you think? to buy or not to buy?    You should buy when there's a possible downtrend that you see, what I observed at the chart now is at pumping progress. Monitor price while hype still there and don't wait when spikes happen during fluctuations. This coin is currently popular due to massive adoption, and same with previous projects that became out limelight always expect the possibilities that rug pull might be a huge danger zone. Always prepare on that certain scenario, because if you have no alternatives for your asset, I think it's not easy to handle emotionally.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mate2237",
      "created_time": "May 31, 2024, 05:27:43 PM",
      "body": "Quote from: Cubewaldo on May 30, 2024, 05:27:42 PMhttps://coinmarketcap.com/currencies/notcoin/ wow this is rising like foam since the release how do you think? to buy or not to buy?    Op please reduce all the sizes of  your images, it affecting my view. And if you want to edit it, follow the following format.Code:[img width=200]the image in this middle [/img]Notcoin is trying im the cryptocurrency market and if it continues like this it will make a good name in the crypto community. Investors have gained tremendously in that airdrop and now it is trying to join the altcoins but it is still at the memecoin stage.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jacafbiz",
      "created_time": "May 31, 2024, 07:33:46 PM",
      "body": "I am very bullish on the coin, my thought was that the price will go lower than $0.004 before the pump, I like the way Telegram team goes about their thing, they make less noise and allowed their work to speak for them, if $Pepe can reach $5 billion marketcap, NOTCOIN will hit $5 billion Mcap is it just a matter of time. I have confidence in the team to deliver a sound V2 of their project, advising people not to fade TON ecosystem project this bull market",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GxSTxV",
      "created_time": "May 31, 2024, 08:12:21 PM",
      "body": "I have got about 7000 NOT coins from their airdrop for only doing daily clicks on their Telegram bot, honestly I wasn’t expecting anything from this project as it doesn’t mean anything to the community, the fact that they didn’t spend much money on promoting the project but still got a huge number of participants on the airdrop and interested on this project have impressed me. Unfortunately I sold my coins early on low price.For now I’m thinking to really invest more money in this coin seeing the burning progress of the supply and many events, collaborations with famous and popular projects trending these days.Personally, I see a better future for this project, some people may see the price now ATH but for me it is just a beginning to reach 1$ in the future or more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}