{
  "id": "topic_5473526",
  "title": "bitmover",
  "author": "bitmover",
  "created_time": "November 09, 2023, 06:17:56 PM",
  "content": "Ethereum já está em alta, agora que a blackrock lançou a notícia desse Ethereum TrustiShares Ethereum Trusthttps://www.coindesk.com/markets/2023/11/09/ether-soars-above-2k-as-blackrock-ishares-ethereum-trust-registered-as-corporate-entity-in-delaware/https://coinmarketcap.com/community/post/331642360/Pelo q eu li, isso seria o primeiro passo para um registro formal de etf de ethereunhttps://br.cointelegraph.com/news/blackrock-registers-ethereum-etf-and-could-forward-request-to-sec-next-weekEthereum já está sendo negociaod acima de 2k usd",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5473526",
  "comments": [
    {
      "author": "joker_josue",
      "created_time": "November 09, 2023, 07:53:44 PM",
      "body": "O que será que aconteceria, se o ETF Ethereum fosse aprovado primeiro que o ETF Bitcoin?Acham que seria a oportunidade do Ehtereum realmente se aproximar mais do valor do Bitcoin?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "November 09, 2023, 07:55:35 PM",
      "body": "Parece que o trabalho necessário para aprovação do ETF de BTC já está feito e agora já estão focando no próximo. A subida do ETH hoje foi bem interessante e agora com esse pedido encaminhado ele automaticamente deve subir junto caso  o ETF do BTC for aprovado, daqui para frente a volatilidade dos dois deve ficar mais correlacionada.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "November 09, 2023, 07:58:43 PM",
      "body": "Quote from: joker_josue on November 09, 2023, 07:53:44 PMO que será que aconteceria, se o ETF Ethereum fosse aprovado primeiro que o ETF Bitcoin?Acham que seria a oportunidade do Ehtereum realmente se aproximar mais do valor do Bitcoin?Acho impossível isso acontecer.. a principal desculpa da SEC é que o mercado do Bitcoin pode ser manipulado.. e o Ethereum está no mesmo mercado..Além disso tem a questão do ETH ser uma security.. a SEC não se decidiu ainda sobre isso, mas pode a qualquer momento..Antes dos ETFs à vista, tem que ver se vão aprovar os ETFs de futuros.. que também estão na fila.. tenho minhas dúvidas se a SEC aprovará esses ETFs de ETH.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "November 09, 2023, 11:20:52 PM",
      "body": "Quote from: sabotag3x on November 09, 2023, 07:58:43 PMAntes dos ETFs à vista, tem que ver se vão aprovar os ETFs de futuros.. que também estão na fila.. tenho minhas dúvidas se a SEC aprovará esses ETFs de ETH.Porque? Por casa de eles estarem a pensar classificar o ETH como security?Mesmo que seja, uma coisa não implica outra. Existe ETF's ligados a security's.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 09, 2023, 11:39:24 PM",
      "body": "Quote from: sabotag3x on November 09, 2023, 07:58:43 PMQuote from: joker_josue on November 09, 2023, 07:53:44 PMO que será que aconteceria, se o ETF Ethereum fosse aprovado primeiro que o ETF Bitcoin?Acham que seria a oportunidade do Ehtereum realmente se aproximar mais do valor do Bitcoin?Acho impossível isso acontecer.. a principal desculpa da SEC é que o mercado do Bitcoin pode ser manipulado.. e o Ethereum está no mesmo mercado..Além disso tem a questão do ETH ser uma security.. a SEC não se decidiu ainda sobre isso, mas pode a qualquer momento..Também acho impossível ocorrer isso Primeiro que quem abriu a porteira foram os pedidos do bitcoin, como o tg88 falou os trabalhos já foram feitos ee agora estão pensando no próximo Outro ponto é que o ethereum tem todo o comportamento de uma security,  difetente do bitcoin que é uma commodity e isso ja esta encerrado. Nem esqueçam que o ethereum nasceu de uma ICO (ou seja, basicamente uma IPO, igual qualquer empresa). E o ethereum assumiu desde o começo algo próximo a um CEO. Além disso, aquela distribuição de moedas entre a diretoria e tudo mais, igualzinho uma IPO.Terceiro ponto, o marketcap. O do bitcoin é muito maior.O bitcoin é a blue chip das criptomoedas, é o próprio mercado de criptomoedas. O ethereum é só mais uma altcoin. A maior, mas mais uma, facilmente substituível. Substituir o bitcoin já é mais complicado. A descentralização,  a distribuição das moedas,  a infraestrutura,  toda a mística da história do satoshi e seu desaparecimento, o \"first mover\"  , o pioneiro da tecnologia e do conceito...Eu diria que o bitcoin é um bem público, a melhor definição q eu já vi dele.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "November 09, 2023, 11:52:41 PM",
      "body": "Quote from: joker_josue on November 09, 2023, 11:20:52 PMExiste ETF's ligados a security's.O Ethereum violou diversas leis de valores mobiliários americanas.. até hoje não sei como nunca foram multados/processados como outras criptomoedas que fizeram exatamente a mesma coisa que o ETH.Pessoal da CFTC fala que é commodity, então deve ter uma briga ali entre os reguladores.Quote from: bitmover on November 09, 2023, 11:39:24 PMO ethereum é só mais uma altcoin. A maior, mas mais uma, facilmente substituível. Substituir o bitcoin já é mais complicado. A descentralização,  a distribuição das moedas,  a infraestrutura,  toda a mística da história do satoshi e seu desaparecimento, o \"first mover\"  , o pioneiro da tecnologia e do conceito...Ethereum já dominou seu nicho também.. mesmo com tanta \"blockchain inteligente\" com taxas baratas, etc, nenhuma chega perto do ETH.. maioria dos projetos escolhe o ETH como base. (mesmo assim é uma security e deveria ser multado como outros projetos, na minha opinião)Vitalik está longe de ser um Satoshi, mas é o nome mais famoso em atividade.. agrega bastante ao projeto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 10, 2023, 01:25:43 AM",
      "body": "Quote from: sabotag3x on November 09, 2023, 11:52:41 PMQuote from: joker_josue on November 09, 2023, 11:20:52 PMExiste ETF's ligados a security's.O Ethereum violou diversas leis de valores mobiliários americanas.. até hoje não sei como nunca foram multados/processados como outras criptomoedas que fizeram exatamente a mesma coisa que o ETH.A regra é existir ETF de security. Etf de commodity sao muito menos numerosos...Afinal, quantas empresas existem, e quantas commodities existem?Mas se ethereum quiser virar security e ir por esse caminho, vai ter que seguir  a legislação de security. E isso provavelmente iria mudar totalmente o ethereum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikel_012",
      "created_time": "November 10, 2023, 01:26:20 AM",
      "body": "Quote from: sabotag3x on November 09, 2023, 11:52:41 PMO Ethereum violou diversas leis de valores mobiliários americanas.. até hoje não sei como nunca foram multados/processados como outras criptomoedas que fizeram exatamente a mesma coisa que o ETH.Devem ver a ethereum como muito grande já, então fazem vista grossa para que não destruam uma moeda que tem o potencial grande no futuro e para inovações tecnologicas dentro do país.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "November 16, 2023, 06:03:30 PM",
      "body": "A Black Rock entrou oficialmente com o pedido do etf de ethereun https://www.infomoney.com.br/onde-investir/blackrock-entra-oficialmente-com-pedido-de-etf-de-ethereum/Impressionante como as coisas estão acontecendo. Agora  provavelmente teremos 2 etf aprovados nos eua. Maravilha!A expectativa de que os juros dos EUA já passaram do topo  já está de realizando. As bolsas do mundo voltaram a subirTudo pronto pro bull market!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}