{
  "id": "topic_5507510",
  "title": "Mia Chloe",
  "author": "Mia Chloe",
  "created_time": "August 27, 2024, 06:46:00 PMLast edit: August 27, 2024, 10:10:03 PM by Mia Chloe",
  "content": "Generally, when it comes to the crypto space especially in the concept of Hodling coins, crypto holders and enthusiasts often anticipate bulls and almost no one wants to see a dip in the crypto currency of his interest. Yeah yeah , every one sings about hodling however some persons in-depth don't fully understand the concept of Hodling so I guess I'll start this discussion with that.Most users often misquote having bitcoin in your wallet for a very long time probably a couple of years as what the concept of Hodling is about only. However having some bitcoins in your wallet for just a short period of time even as low as a minute can classify you as a HODLER. The concept is actually the fact that you having some bitcoins in you possession ( with having full control over the coins ) makes you a HODLER . However having those coins on an exchange doesn't count as hodling since you don't have total control over it.Now bitcoin for a very long time has kept up with it's bullish trend unlike many volatile coins out there. For most coins people panic when in dips however in the case of bitcoin people don't panic when it comes to hodling bitcoin. That brings us to the big question;Did bitcoin adoption really bring about people trusting bitcoin even in dips?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5507510",
  "comments": [
    {
      "author": "Amphenomenon",
      "created_time": "August 27, 2024, 08:42:45 PM",
      "body": "Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMDid bitcoin adoption really bring about people trusting bitcoin even in dips?I believe it does now, since we use mostly use earlier adopters and it price history to hold firm that when it price dips with time as long as we HODL then we will gain more and this is also from the fact that all this trust was built on knowing the truth about Bitcoin and how far it as gone and will go.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SatoPrincess",
      "created_time": "August 27, 2024, 09:16:38 PM",
      "body": "No one wants to miss an opportunity. Investors are waiting to see the impact of the halving on the market. When you look at bitcoin’s historical data, the market has always been bullish after a halving. So even if the market dips to $48k, investors will still be hodling because they know the market will break the previous resistance and form a bullish trend.   Source",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "August 27, 2024, 09:27:18 PM",
      "body": "Altcoin Run swings are much, much wilder than Bitcoin swings.  Altcoins can drop by 99 percent in a matter of WEEKS.  Bitcoin has never had such a drop and most of the harder ones have recovered in relatively short time span.  Altcoins usually stick to the bottom once they drop.  Bitcoin does not.  It is like a ping pong ball put underwater and let go.  It dips and then bounces out of the depths of the water.So yes, us Bitcoin users are pretty much there for it even if Bitcoin dips.  Because we know it will eventually bounce back, most likely.  Although I would argue we are kind of silly for believing so, considering it is still kind of new around and unexpected turns of Events did happen before.  But I am happy with Trusting Bitcoin and its future.  After all, if ultimately even Bitcoin fails, then my hope for a better future of humanity is honestly to drop to about zero.  Bitcoin is one of those last strings of Freedom for me.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "August 27, 2024, 09:39:04 PM",
      "body": "Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMGenerally, when it comes to the crypto space especially in the concept of Hodling coins, crypto holders and enthusiasts often anticipate bulls and almost no one wants to see a dip in the crypto currency of his interest.A dip in the market can actually create momentum. This happens when investors quickly buy in during the dip, taking advantage of the opportunity. If an investor is uncomfortable with market dips, they should consider selling their coins and exiting the market, as dips are inevitable. The only time an investor should worry during a dip is if they invested in a project that turned out to be a pump and dump scheme, which may not recover from its dip.Quotehowever having some bitcoins in your wallet for just a short period of time even as low as a minute can classify you as a HODLER. How possible is that? QuoteDid bitcoin adoption really bring about people trusting bitcoin even in dips?Over the years, Bitcoin has shown great potential as a long-term investment. It's considered the king of the crypto market, and its price movements often affect other coins. When Bitcoin's price drops, other coins usually follow. However, when Bitcoin recovers, not all coins can bounce back. Bitcoin's ability to recover from past dips and its growing adoption are reasons why people trust it. Each recovery and halvings sets a new high, making Bitcoin an even more profitable investment in the long run.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mia Chloe",
      "created_time": "August 27, 2024, 10:30:06 PM",
      "body": "Quote from: PrivacyG on August 27, 2024, 09:27:18 PMAltcoin Run swings are much, much wilder than Bitcoin swings.  Altcoins can drop by 99 percent in a matter of WEEKS.  Bitcoin has never had such a drop and most of the harder ones have recovered in relatively short time span.  Altcoins usually stick to the bottom once they drop.  Bitcoin does not.  It is like a ping pong ball put underwater and let go.  It dips and then bounces out of the depths of the water.So yes, us Bitcoin users are pretty much there for it even if Bitcoin dips.  Because we know it will eventually bounce back, most likely.  Although I would argue we are kind of silly for believing so, considering it is still kind of new around and unexpected turns of Events did happen before.  But I am happy with Trusting Bitcoin and its future.  After all, if ultimately even Bitcoin fails, then my hope for a better future of humanity is honestly to drop to about zero.  Bitcoin is one of those last strings of Freedom for me.I guess you've pretty much said it. Although bitcoin is volatile too just like other crypto currencies, it has been a better store for value overtime than many altcoins, shit likes and meme coins. Bitcoin has much adopters including whales which pretty much affect the price of bitcoin indirectly. Based on simple market economics, many altcoins out there have low adopters out there and so when their prices liquidate, there are no potential investors available to assist the price to either resume the bull or prevent the coin from dropping below a certain price.Quote from: Hatchy on August 27, 2024, 09:39:04 PMHow possible is that?Lol like I said in the OP, many py really don't get the concept of Hodling. Did you know that having bitcoins in a wallet which you have full control over the keys for the slightest moment can be classified as hodling?  Though it's very short term. Owning bitcoins alone classifies you as a HODLER as long as you have full control of the wallet keys.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ambatman",
      "created_time": "August 27, 2024, 10:36:30 PM",
      "body": "I understand where you coming from but I don't fully agree According to the words of the creator of holdling, they are users that don't sell even in a dip. Quote from: GameKyuubi on December 18, 2013, 10:03:03 AMI type d that tyitle twice because I knew it was wrong the first time.  Still wrong.  w/e.  GF's out at a lesbian bar, BTC crashing WHY AM I HOLDING? I'LL TELL YOU WHY.  It's because I'm a bad trader and I KNOW I'M A BAD TRADER.  About your question adoption did help but not by much, it's the history and precedence it has set that improves people trust towards it. Now many believe that no matter how much bitcoin corrects It would recover with a bang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Wiwo",
      "created_time": "August 27, 2024, 11:01:14 PM",
      "body": "Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMGenerally, when it comes to the crypto space especially in the concept of Hodling coins, crypto holders and enthusiasts often anticipate bulls and almost no one wants to see a dip in the crypto currency of his interest. Yeah yeah , every one sings about hodling however some persons in-depth don't fully understand the concept of Hodling so I guess I'll start this discussion with that.As I crypto trader, I always expect dip because when there is a dip in  bitcoin market, this give traders the chance to open trading position with a low entry price and also increase they chances to make more profits when the price of bitcoin will recover. Also even as a bitcoin holder, dip market give an opportunity to buy Bitcoin at a discounted price, but when the price is highe it can only benefit those long term holder's who have bought bitcoin at previous discounted price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "August 27, 2024, 11:05:22 PM",
      "body": "Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMNow bitcoin for a very long time has kept up with it's bullish trend unlike many volatile coins out there. For most coins people panic when in dips however in the case of bitcoin people don't panic when it comes to hodling bitcoin. That brings us to the big question;Did bitcoin adoption really bring about people trusting bitcoin even in dips?People panic too when Bitcoin dips but because the market volume of Bitcoin is big and there is always people waiting to buy, you wouldn't notice much that people are panicking but you can notice in other coins because they don't have large market value and not many people are trading them, making them an easy target for market manipulation. As Bitcoin falls and it gets notice, people don't see it as a reason to be scared but they they use it as an avenue to make profits by buying the dips. Bitcoin has shown people that it can be trusted hence when the market dips, people buy Bitcoin and not other coins. Bitcoin has never failed to come back up to its previous price after it has fallen then grow more higher and popular so people have no other options then to believe in Bitcoin. Bitcoin is the first cryptocurrency and it has alot of investors who believe Bitcoin is the best cryptocurrency.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "peter0425",
      "created_time": "August 27, 2024, 11:48:41 PM",
      "body": "Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMMost users often misquote having bitcoin in your wallet for a very long time probably a couple of years as what the concept of Hodling is about only. However having some bitcoins in your wallet for just a short period of time even as low as a minute can classify you as a HODLER. The concept is actually the fact that you having some bitcoins in you possession ( with having full control over the coins ) makes you a HODLER . However having those coins on an exchange doesn't count as hodling since you don't have total control over it. I do agree that you are classified as a holder even if you haven’t held your coins for that long. It’s less about the duration but more about the intention. However HODL is an acronym for holding on for dear life so I don’t know if people still use it like that or the meaning has been overlooked in recent. If you plan to HODL then you will not be selling despite dips in the market.QuoteDid bitcoin adoption really bring about people trusting bitcoin even in dips?Bitcoin has been around for almost 2 decades and anyone can see how despite the dips, it always comes back and places even more so yes it did make people trust more bitcoin. The more history there is, the more trustworthy it is.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minor Miner",
      "created_time": "August 27, 2024, 11:50:40 PM",
      "body": "Quote from: Wiwo on August 27, 2024, 11:01:14 PMQuote from: Mia Chloe on August 27, 2024, 06:46:00 PMGenerally, when it comes to the crypto space especially in the concept of Hodling coins, crypto holders and enthusiasts often anticipate bulls and almost no one wants to see a dip in the crypto currency of his interest. Yeah yeah , every one sings about hodling however some persons in-depth don't fully understand the concept of Hodling so I guess I'll start this discussion with that.As I crypto trader, I always expect dip because when there is a dip in  bitcoin market, this give traders the chance to open trading position with a low entry price and also increase they chances to make more profits when the price of bitcoin will recover. I think traders are just afraid of bitcoin going sideways and having no volatility because then it will be very difficult for them to make a profit. As long as bitcoin remains volatile, they don't care if the price is high or low. You like to open position when bitcoin price is down probably because you want to be safe.Quote from: Wiwo on August 27, 2024, 11:01:14 PMAlso even as a bitcoin holder, dip market give an opportunity to buy Bitcoin at a discounted price, but when the price is highe it can only benefit those long term holder's who have bought bitcoin at previous discounted price. For long term holders, the drop in bitcoin price is actually an opportunity and everyone knows it because they have the opportunity to buy bitcoin at a good discount. But in reality, not everyone has USD reserves available every time the market corrects, so not many people want to witness the market correction. Also, when the market corrects there will be hesitation because we cannot know whether bitcoin will rise again or continue to correct after we buy. That is why when bitcoin price corrects, not many people dare to buy even though they always say they will buy more if bitcoin drops.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "August 28, 2024, 01:06:22 AM",
      "body": "I see no need to further qualify hodling. Hodling was originally a simple concept as opposed to trading. That's it. If you have Bitcoin and you aren't trying to make profit out of its short-term rise and fall, you are basically hodling. If you are merely keeping your Bitcoin as opposed to timing the market and try to buy low sell high, you are a basically a hodler. Whether your coins are in a hot wallet or cold wallet, custodial wallet or non-custodial wallet, open-source wallet or closed-source wallet, and so on is another story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Text",
      "created_time": "August 28, 2024, 01:08:42 AM",
      "body": "It’s true that Bitcoin’s volatility can be daunting, but history has shown that it often recovers stronger after a dip, unlike many altcoins that may never bounce back. I think the idea that simply holding Bitcoin even for a short period in a wallet where you control the keys makes you a HODLER aligns with the ethos of decentralization and ownership in crypto. Despite the risks, the belief in Bitcoin's long-term potential and its role as a store of value is what keeps many of us committed, even during the lows. Trust in Bitcoin is as much about its proven resilience as it is about its promise for the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "OcTradism",
      "created_time": "August 28, 2024, 01:34:18 AM",
      "body": "Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMDid bitcoin adoption really bring about people trusting bitcoin even in dips?Dips are fearful events for newcomers in Bitcoin market and they can not trust Bitcoin more in dips.They only can have bigger trust on Bitcoin if they already witnessed dips, and went through it without panic sell and lose money or they can panic sell in dips but some weeks and months later, they look back and realize that it's their mistake. It means newcomers in this market needs time, need dip experience, loss experience and witness Bitcoin strong survival against market fud, dips to trust it more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yhiaali3",
      "created_time": "August 28, 2024, 02:58:09 AM",
      "body": "Obviously the answer is yes, at least for me and the people I know in my circle, everyone trusts Bitcoin even the big institutions.Over the past few years we have noticed a difference in people's view of Bitcoin, whether at the level of individuals, institutions or even governments, we notice that almost everyone has great confidence in Bitcoin and everyone is rushing to acquire Bitcoin in the long term because they have realized that it is a successful investment and the best hedge against inflation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tabas",
      "created_time": "August 28, 2024, 04:33:04 AM",
      "body": "Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMDid bitcoin adoption really bring about people trusting bitcoin even in dips?Yeah, adoption is a clear reason why Bitcoin is being trusted even in ugly times when the market doesn't look good at all. Let's just say you and I, even the dips have been happening from time to time, do we care about it? Probably yes, if we want to buy more of it but then if we're just the typical holder, who cares about the dips? We're just parked and we don't have to make any effort at all but then wait for the market reversal and decide whether to sell or not. And as for adoption, it's not only about acceptance but people who get to understand bitcoin and the knowledge that they have acquired from whichever source or community they are in, the trust and confidence are there so it gets to show why the adoption has increased. And that is because people have understood the basic concepts of Bitcoin, and as well as its feature for being a store of value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "August 28, 2024, 04:37:12 AM",
      "body": "Quote from: Darker45 on August 28, 2024, 01:06:22 AMI see no need to further qualify hodling. Hodling was originally a simple concept as opposed to trading. That's it. If you have Bitcoin and you aren't trying to make profit out of its short-term rise and fall, you are basically hodling. If you are merely keeping your Bitcoin as opposed to timing the market and try to buy low sell high, you are a basically a hodler. Whether your coins are in a hot wallet or cold wallet, custodial wallet or non-custodial wallet, open-source wallet or closed-source wallet, and so on is another story. People do trades because they are addicted to watching the charts. They simply can’t stand still for more than a couple of weeks. They want to move around and try to beat the markets and in the end they end up losing more money. We really need to stop checking the prices every minute. We need to put our alts and btc in a bag, seal its entrance and come back at least 5 years later to see if we made it or not. I can almost guarantee that anyone who does this will “make it”.If you don’t trust the alts you’re holding then it means you shouldn’t be holding them for the long term. Just dump them away whenever an opportunity emerges.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "August 28, 2024, 05:29:36 AM",
      "body": "Unfortunately no, most people still buy Bitcoin without any reason except the price, that's why they have no idea about Bitcoin and don't mind to sell at loss. Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMHowever having some bitcoins in your wallet for just a short period of time even as low as a minute can classify you as a HODLER. The concept is actually the fact that you having some bitcoins in you possession ( with having full control over the coins ) makes you a HODLER . However having those coins on an exchange doesn't count as hodling since you don't have total control over it.That's your own definition.Hodling doesn't mean you must have full control over it, but it require some period of time, not just a minute or few days.Knowing someone is actually hodling Bitcoin or not in non custodial wallet is easy since we can check the balance on explorer. Someone can hold in centralized exchange, but most people are thinking any coins moved to centralized exchange will be sold.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stepstowealth",
      "created_time": "August 28, 2024, 05:56:39 AM",
      "body": "Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMDid bitcoin adoption really bring about people trusting bitcoin even in dips?There would have been more panic if the situation is one where bitcoin's value was dropping and then the number of people adopting Bitcoin was reducing with the number of people abandoning its increasing. The statistics would have been alarming for anybody who is investing in Bitcoin because Bitcoin actually needs people to grow. Due to the fact that there are more people adopting Bitcoin even though the value of the price has been fluctuating increasing and decreasing, it is a trust increaser, that it will do better later in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lizarder",
      "created_time": "August 28, 2024, 06:01:01 AM",
      "body": "Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMNow bitcoin for a very long time has kept up with it's bullish trend unlike many volatile coins out there. For most coins people panic when in dips however in the case of bitcoin people don't panic when it comes to hodling bitcoin. That brings us to the big question; Historically we can see the journey of bitcoin from the time it was launched to its journey till now so there is a big picture of why panic should be avoided and not thought too much. The panic cases that occur are nothing more than people not understanding the journey of bitcoin so they get involved in it because of the desire or seeing other people can make a lot of money and this kind of approach should indeed be avoided by anyone when they want to get involved in bitcoin investment.It is important to have knowledge and understanding about bitcoin because in this way people can behave or take the right approach so that involvement in bitcoin can provide positive benefits to improve financial capabilities.Quote from: Mia Chloe on August 27, 2024, 06:46:00 PMDid bitcoin adoption really bring about people trusting bitcoin even in dips? In economics, the better the product produced, the more trust it will get from consumers because it talks about how to bind consumers to choose the product. But if it comes to Bitcoin, then can adoption influence people to believe in Bitcoin? My answer is that it is very influential because the more adoption that occurs, the greater the opportunity for it to be discussed, besides that the facts that occur will strengthen the that Bitcoin is the best investment ever.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}