{
  "id": "topic_5465333",
  "title": "Paredao",
  "author": "Paredao",
  "created_time": "September 01, 2023, 08:00:21 PM",
  "content": "Hoje estava a ler está noticia e me deparei com isso. A própria Binance está forçando seus clientes a abandonarem de vez a BUSD e migrarem suas moedas para uma tal de First Digital USD (FDUSD). Será que essa FDUSD é confiável como Stablecoin? Tenho um pequeno saldo em BUSD, estou pensando se converto para FDUSD, pois não queria transformar para fiat. O que vocês acham ?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5465333",
  "comments": [
    {
      "author": "TryNinja",
      "created_time": "September 01, 2023, 08:08:49 PM",
      "body": "Primeira vez que ouço falar dessa FDUSD, então fui dar uma pesquisada.Site deles: https://firstdigitallabs.com/Eles dizem ter lastro 1:1 em USD. Realizam atestações (como a Tether e Circle) com a Prescient Assurance. De acordo com o último documento do mês de Julho, eles tem 100% desse lastro em saldo de pelo menos 2 bancos, um suiço e outro afiliado em Hong Kong, sem títulos do tesouro americano ou qualquer comercial paper: https://firstdigitallabs.com/workspace/uploads/fdusd-attestation-2023-07-31-64dd74a323e70.pdfDetalhe que seu FAQ menciona “or asset of equivalent fair value”, então não parecem querer se limitar ao puro USD.Pessoalmente ainda preferiria USDC, mas interessante essa stable. Vamos ver se pega.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tg88",
      "created_time": "September 01, 2023, 11:32:01 PM",
      "body": "O projeto parece ter apoio público do CZ desde o seu lançamento, faz pouco mais de 1 mes que foi listado na Binance e eles estão oferecendo fee zerada para conversão de BUSD para FDUSD. Fico pensando se o CZ não tem um interesse maior sobre essa migração para FDUSD e de alguma forma é sócio da empresa. Stablecoins tem se mostrado um negócio super rentável.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alegotardo",
      "created_time": "September 02, 2023, 12:31:31 AM",
      "body": "Estou achando que a Binance está metida nisso de alguma forma ainda \"sombria\", a moeda foi lançada em Junho/2023? Apenas 2 meses atrás?Complicado ein... esse incentivo de migração da BUSD para FDUSD está forçado demais para eu acreditar que é apenas uma sugestão \"mais segura\".Pelo menos, é uma stable que a princípio está fora da jurisdição dos EUA... pelo que pesquisei e descobri também a empresa fiduciária, First Digital Trust Limited, está registada e licenciada sob o abrigo da legislação de Hong Kong. Pelo que sabemos sabemos até então o Japão é um grande Bitcoin-Friendly Countries.Eu só não consegui encontrar ao certo quem são os rostos por trás dessa empresa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 02, 2023, 01:11:02 AMLast edit: September 02, 2023, 11:50:55 AM by TryNinja",
      "body": "Quote from: alegotardo on September 02, 2023, 12:31:31 AMEu só não consegui encontrar ao certo quem são os rostos por trás dessa empresa.No Linkedin dá para ver quem são os 50+ funcionários registrados: https://www.linkedin.com/company/first-digital-trust/people/CEO: https://www.linkedin.com/mwlite/in/vincent-chok-60216719CFO: https://www.linkedin.com/mwlite/in/aleck-lee-cpa-0830bb91O atual CEO tambem é CEO de uma firma de wealth management “Legacy Trust”: https://www.legacytrustcompany.com/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 02, 2023, 10:34:07 AM",
      "body": "Antes da FDUSD a Binance também ajudou a True USD (TUSD) a crescer bastante com benefícios parecidos (taxa zero, etc).. então imagino que eles não estejam ganhando algo com a FDUSD.Pelo que acompanho, eles estão tentando empurrar o máximo de stablecoins possíveis.. incluindo com lastro em outras moedas além do dólar..Vejo como uma tática de proteção da Binance.. afinal se USDT e USDC tomarem uma marretada igual a BUSD, eles conseguem ter outras stablecoins (quanto mais projetos diferentes, mais difícil derrubar).. Binance sem stablecoins simplesmente morre..Talvez até voltem com um par único para consolidar o volume, como tentaram um tempo atrás.Outro ponto é que eles estão na mira dos reguladores, não imagino que fariam algum negócio 'por baixo dos panos' em tempos assim.Quote from: CZ - https://twitter.com/cz_binance/status/1634538913854308352You view stablecoin as the safe land?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 02, 2023, 12:34:04 PM",
      "body": "Quote from: Paredao on September 01, 2023, 08:00:21 PMHoje estava a ler está noticia e me deparei com isso. A própria Binance está forçando seus clientes a abandonarem de vez a BUSD e migrarem suas moedas para uma tal de First Digital USD (FDUSD). Será que essa FDUSD é confiável como Stablecoin? Tenho um pequeno saldo em BUSD, estou pensando se converto para FDUSD, pois não queria transformar para fiat. O que vocês acham ?Se eu fosse você,  converteira para usdc ou usdt , ou até bitcoin mesmo (que está num preço bem atrativo)Eu não arriscaria em uma nova stable nesse momento... com tantas opções consolidadas.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 02, 2023, 06:22:31 PM",
      "body": "Quote from: alegotardo on September 02, 2023, 12:31:31 AMEstou achando que a Binance está metida nisso de alguma forma ainda \"sombria\", a moeda foi lançada em Junho/2023? Apenas 2 meses atrás?Complicado ein... esse incentivo de migração da BUSD para FDUSD está forçado demais para eu acreditar que é apenas uma sugestão \"mais segura\".Então não é o SEC que tem estado a tentar complicar a vida a Binance por causa do BUSD? Acho que é.Por isso, isto parece uma estratégia de mudar de stable oficial, antes de terem complicações maiores com o SEC. Daí terem escolhido uma coin que não está ligada ao USD.Veremos o que vai dar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 02, 2023, 07:03:42 PM",
      "body": "Quote from: joker_josue on September 02, 2023, 06:22:31 PMEntão não é o SEC que tem estado a tentar complicar a vida a Binance por causa do BUSD? Acho que é.Por isso, isto parece uma estratégia de mudar de stable oficial, antes de terem complicações maiores com o SEC. Daí terem escolhido uma coin que não está ligada ao USD.Veremos o que vai dar.Como assim “terem escolhido uma coin que não está ligada ao USD”? A nova escolhida (FSUSD) tem o lastro completamente em USD. Aliás, isso de não estar ligado a fiat nenhuma me lembra do ponzi OHM. Era uma moeda que em certo momento virou um tipo de (un)stable com free float total. Ou seja, não está lastreado a nenhuma fiat de valor fixo. Era tipo, 1 OHM hoje vale $3000, amanha vale $2850… e isso era totalmente aceitável (na narrativa deles). No final claro que colapsou.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 03, 2023, 12:34:23 AM",
      "body": "Quote from: TryNinja on September 02, 2023, 07:03:42 PMComo assim “terem escolhido uma coin que não está ligada ao USD”? A nova escolhida (FSUSD) tem o lastro completamente em USD. Desculpa. Expliquei mal.O que eu queria dizer é que não está sediada nos USA. É pelo que percebi, querem usar outras fiat como lastro.Foi isto que percebi, ou estou errado?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 03, 2023, 12:37:53 AM",
      "body": "Quote from: joker_josue on September 03, 2023, 12:34:23 AM[…] É pelo que percebi, querem usar outras fiat como lastro.Foi isto que percebi, ou estou errado? Está sim. “FDUSD is intended to be a fully backed by cash and cash equivalent assets. Tokens are intended to be redeemable 1:1 for U.S. dollars.”Até nome já diz USD, não faria sentido ter EUR ou BRL aí. O que te leva a crer que eles querem usar outras fiats como lastro?Ou está falando da Binance, no futuro, adotar outra stable?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 03, 2023, 07:49:18 AM",
      "body": "Quote from: TryNinja on September 03, 2023, 12:37:53 AM Ou está falando da Binance, no futuro, adotar outra stable?Desculpem, percebi tudo mal.  Mas a empresa está fora dos States ou não? No caso da Binance, talvez vão querer entrar noutra stable, fora da esfera EUA, que tendencialmente é mais restritivo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 03, 2023, 01:06:42 PM",
      "body": "Quote from: joker_josue on September 03, 2023, 07:49:18 AMDesculpem, percebi tudo mal.  Mas a empresa está fora dos States ou não? No caso da Binance, talvez vão querer entrar noutra stable, fora da esfera EUA, que tendencialmente é mais restritivo. Acho que a binance só não quer mais botar o nome dela na reta e se relacionar com a sec sobre stablecoins. Ela está simplesmente negociando outra stablecoin, de outra empresa. Essa outra empresa q se cuide com relação a sec.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "TryNinja",
      "created_time": "September 03, 2023, 01:39:54 PM",
      "body": "Quote from: joker_josue on September 03, 2023, 07:49:18 AMDesculpem, percebi tudo mal.  Mas a empresa está fora dos States ou não? No caso da Binance, talvez vão querer entrar noutra stable, fora da esfera EUA, que tendencialmente é mais restritivo. Aparentemente está em Hong Kong, mas isso não vem muito ao caso. Mexendo com USD, é “dois palitos” para o governo sair impondo sanções aos bancos que não seguirem as suas regras e demandas.Lembrando também que q Tether tem USD mas nenhum dos seus bancos é nos EUA, quase como se eles tentassem ao máximo esconder quem faz o holding de seus ativos para evitar bloqueios e sanções.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rdluffy",
      "created_time": "September 04, 2023, 01:54:26 PM",
      "body": "Eu ainda tenho umas poucas BUSD paradas, uns 10 ou 15 dólares, preciso converter pra BTC, senão vou me esquecerMas no momento atual, o USDT, o bom é velho Tether parece ser uma boa opção Paredao, eles estão aí firmes e fortesEu também não conhecia essa FDUSDQuote from: sabotag3x on September 02, 2023, 10:34:07 AMOutro ponto é que eles estão na mira dos reguladores, não imagino que fariam algum negócio 'por baixo dos panos' em tempos assim.Concordo 100%, a Binance tem que evitar a qualquer custo se envolver com polêmicas ou projetos que não estão totalmente dentro das leis, todos os olhos dos reguladores estão voltados pra eles, qualquer pisada na bola pode custar caro.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gagux123",
      "created_time": "September 05, 2023, 03:14:00 AM",
      "body": "Quote from: Paredao on September 01, 2023, 08:00:21 PMHoje estava a ler está noticia e me deparei com isso. A própria Binance está forçando seus clientes a abandonarem de vez a BUSD e migrarem suas moedas para uma tal de First Digital USD (FDUSD). Será que essa FDUSD é confiável como Stablecoin? Tenho um pequeno saldo em BUSD, estou pensando se converto para FDUSD, pois não queria transformar para fiat. O que vocês acham ?Confesso que também é a primeira vez que ouço falar nessa First Digital USD (FDUSD). Por ser nova no mercado eu não sei, eu \"ficaria com o pé atrás\"... reiterando o que o @bitmover disse, de fato existem diversas outras alternativas mais consolidas nos dias de hoje, como por exemplo USDC e USDT. Não sei se seria válido arriscar nessa nova stable (atualmente)",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 05, 2023, 06:52:24 AM",
      "body": "Quote from: gagux123 on September 05, 2023, 03:14:00 AMPor ser nova no mercado eu não sei, eu \"ficaria com o pé atrás\"... reiterando o que o @bitmover disse, de fato existem diversas outras alternativas mais consolidas nos dias de hoje, como por exemplo USDC e USDT. Não sei se seria válido arriscar nessa nova stable (atualmente)Mas também se ninguém arriscar, ela nunca irá crescer.Assim, como as outras no passado, no inicio as pessoas tiveram de arriscar, com esta acontece o mesmo.Atenção, com isto eu não estou a dizer para se arriscar. Apenas digo, que deve ser feita uma analise com base nos mesmos critérios que foram usados com o USDC/USDT quando começaram. Acho que o critério \"ainda é nova\", não é justo para algo que seja honesto começar.Repito, não estou a dizer que esta FDUSD é para \"investir\", que cada um faça a sua analise.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitmover",
      "created_time": "September 05, 2023, 01:46:56 PM",
      "body": "Quote from: joker_josue on September 05, 2023, 06:52:24 AMQuote from: gagux123 on September 05, 2023, 03:14:00 AMPor ser nova no mercado eu não sei, eu \"ficaria com o pé atrás\"... reiterando o que o @bitmover disse, de fato existem diversas outras alternativas mais consolidas nos dias de hoje, como por exemplo USDC e USDT. Não sei se seria válido arriscar nessa nova stable (atualmente)Mas também se ninguém arriscar, ela nunca irá crescer.Assim, como as outras no passado, no inicio as pessoas tiveram de arriscar, com esta acontece o mesmo.O verdadeiro credores de stablecoins são as exchanges,e não as pessoasss físicas.Quem arrisca para as stables creaceram são eles. A binance ou qq outra que compra bilhões de stables para os usuários fazerem trade. E são eles que vão no emissor da stable trocar por usd.Nos operamos no mercado secundário,  não faz diferença pro emissor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joker_josue",
      "created_time": "September 05, 2023, 06:55:53 PM",
      "body": "Quote from: bitmover on September 05, 2023, 01:46:56 PMO verdadeiro credores de stablecoins são as exchanges,e não as pessoasss físicas.Quem arrisca para as stables creaceram são eles. A binance ou qq outra que compra bilhões de stables para os usuários fazerem trade. E são eles que vão no emissor da stable trocar por usd.Nos operamos no mercado secundário,  não faz diferença pro emissor.Então, se assim é, qual é a diferença para nos comprar USDC, USDT, FDUSD ou outra stable qualquer?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "sabotag3x",
      "created_time": "September 05, 2023, 07:14:01 PM",
      "body": "Quote from: joker_josue on September 05, 2023, 06:55:53 PMQuote from: bitmover on September 05, 2023, 01:46:56 PMO verdadeiro credores de stablecoins são as exchanges,e não as pessoasss físicas.Quem arrisca para as stables creaceram são eles. A binance ou qq outra que compra bilhões de stables para os usuários fazerem trade. E são eles que vão no emissor da stable trocar por usd.Nos operamos no mercado secundário,  não faz diferença pro emissor.Então, se assim é, qual é a diferença para nos comprar USDC, USDT, FDUSD ou outra stable qualquer?Acho que quem compra são os market makers, não as corretoras..Mas depois que eles empurraram essas stablecoins pra você, o risco é todo seu.. se perder a paridade com o dólar, você quem fica no prejuízo.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}