{
  "id": "topic_5457044",
  "title": "Arenga pinnata",
  "author": "Arenga pinnata",
  "created_time": "June 21, 2023, 03:21:26 AMLast edit: June 23, 2023, 01:40:22 AM by Arenga pinnata",
  "content": "Seperti dalam judul diatas. Dan sebenarnya ini adalah satu hal yang baru saya sadari akhir-akhir ini. Saya memiliki rencana perdagangan jangka panjang dalam bitcoin. Dan saya menargetkan akan menyimpannya hingga beberapa tahun. Karena saya tidak bisa analisa jadi awalnya tidak suka berdagang jangka pendek. Jadi saya hanya membeli untuk disimpan.Tapi kemarin atau lebih tepatnya tadi malam saya iseng melirik pasar bitcoin. Dan sebenarnya saya tidak berniat mau trading. Tapi sepertinya psikologis saya terpengaruh setelah melihat pasar mengalami lonjakan hebat. Sehingga saya memiliki pemikiran untuk menjual dulu bitcoin yang telah saya kumpulkan. Dan nanti mau dibelikan lagi ketika harga turun. Saya menjual di sekitar 27rb lebih. Tapi tadi pagi saya cukup kaget karena harga bitcoin bukannya turun kembali malah lanjut terus naik. Dan akhirnya saya menyesali keputusan saya untuk menjual di harga 27rb lebih. Dan saya frustasi karena menunggu btc untuk turun tapi tidak kunjung turun.Dari kejadian tersebut saya menyadari beberapa pelajaran yang bisa saya petik yaitu terkait mentalitas. Yaitu✓ Harus patuh pada perencanaan yang telah dibuat sejak awal (jangka panjang) / membutuhkan kekuatan mental dan disiplin. ✓ jika berniat dari awal untuk jangka panjang maka tidak boleh tergoda untuk menjual disaat ada kenaikan kecil. / Yang ini juga membutuhkan mental yang kuat dan disiplin.✓ harus menguatkan mental dan berpegang pada niat awal untuk berdagang jangka panjang✓ harus selalu update berita terbaru (saya baru menyadari tadi pagi bahwa banyak berita besar yang punys nilai bullish bagi pasar) / untuk menguatkan mental karena terkadang mental melemah karena tidak tahu berita terbaru dan menyangka pasar akan kembali turun dengan cepat jika tidak ada berita bagus.Berita terbaru yang saya maksud adalah seperti yang ada di gambar ini.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457044",
  "comments": [
    {
      "author": "Solokan",
      "created_time": "June 21, 2023, 12:59:11 PM",
      "body": "Dalam investasi di bitcoin memang Kita harus punya mental yang kuat dan harus punya tekad yang kuat, makanya saya kini selalu mempunyai 2 modal dalam berinvestasi yaitu modal untuk investasi jangka pendek dan modal untuk investasi jangka panjang.Jadi saya setiap ada kenaikan selalu menjual btc saya, dan menyeroknya lagi dari bawah ketika btc mengalami penurunan hargaNamun ketika tidak bisa menyerok lagi dari bawah saya selalu sabar menunggu sampai btc benar benar turun harga.Dan kalau harga btc terus naik saya masih bisa merasa bahagia karena saya berinvestasi di btc untuk jangka panjang juga ada.Dan selalu menggunakan strategi seperti itu, jadi saya sangat menikmati investasi saya dan mental juga tidak terganggu,Namun tentunya strategi setiap orang berbeda beda.Tapi memang kita harus kuat mental ketika berinvestasi di btc dan harus kuat menahan, dan jangan panikNamun memang bukanlah hal yang mudah untuk bisa kuat menahan kepanikan, namun menurut saya seiring berjalannya waktu pasti kita akan menjadi dewasa dan belajar dari pengalaman.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitLeap",
      "created_time": "June 21, 2023, 04:11:57 PM",
      "body": "Quote from: Arenga pinnata on June 21, 2023, 03:21:26 AM✓ Harus patuh pada perencanaan yang telah dibuat sejak awal (jangka panjang) / membutuhkan kekuatan mental dan disiplin. Dari awalnya saja anda sudah salah, maksud saya ketika anda berniat untuk memegang bitcoin dalam jangka panjang anda justru menjualnya ketika terjadi pelonjakan. Saya tidak tahu sudah berapa lama anda memegang bitcoin di dalam dompet anda, namun melihat dari apa yang anda ceritakan sepertinya anda memegang bitcoin baru baru ini dan belum begitu lama. Sebenarnya tidak salah ketika anda menjualnya pada saat mendapatkan keuntungan, namun dengan penyesalan yang anda utarakan, itu sepertinya perasaan penyesalan yang mendalam tidak bisa dibohongi.Quote✓ jika berniat dari awal untuk jangka panjang maka tidak boleh tergoda untuk menjual disaat ada kenaikan kecil. / Yang ini juga membutuhkan mental yang kuat dan disiplin.Sebenarnya itu bisa saja menggunakan metode pada harga berapa kita akan menjual, jadi ketika bitcoin menyentuh harga tersebut kita bisa menjualnya sekalipun itu dalam waktu yang sangat singkat. Jadi memegang jangka panjang juga harus dengan target, jadi kita tahu apa yang harus kita lakukan ketika target kita tercapai. Seperti misalnya, kita memegang dalam jangka panjang dan pada saat yang sama bitcoin sudah mencapai ATH baru, lalu kita membiarkannya tanpa mengambil keuntungan dan kita terus memegang, namun kita tahu pasar bisa turun kapan saja, dan jangan biarkan kita menyesal ketika bitcoin turun dari ATHnya lagi karena kita membiarkan ATH pergi tanpa mengambil keuntungan, ya meskipun kita tetap untung pada saat itu.Quote✓ harus menguatkan mental dan berpegang pada niat awal untuk berdagang jangka panjangSebelum kita memutuskan untuk memegang bitcoin dalam jangka panjang, maka mentalitas harus menjadi pengetahuan dasar, artinya apapun yang terjadi kita harus bisa berpegang teguh pada niat kita diawal. Jangan karena hanya ada penurunan lalu mentalitas kita goyah misalnya. Kita harus selalu ingat pada tujuan awal kita berinvestasi dalam bitcoin ini. Jadi ketika kita masih memiliki keraguan, saya akan mengatakan lebih baik jangan dulu memasukan uang kita karena jika mental kita belum sepenuhnya bulat itu akan sangat beresiko.Quote✓ harus selalu update berita terbaru (saya baru menyadari tadi pagi bahwa banyak berita besar yang punys nilai bullish bagi pasar) / untuk menguatkan mental karena terkadang mental melemah karena tidak tahu berita terbaru dan menyangka pasar akan kembali turun dengan cepat jika tidak ada berita bagus.Ada banyak faktor yang akan mempengaruhi naik turunnya harga bitcoioin, termasuk berita baik atau buruk (atau yang lebih kita kenal FUD). Kita memang harus selalu update dengan perkembangan yang ada, jadi kita akan tahu alasan apa yang menjadi naik turunnya harga pada saat itu.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uruhara",
      "created_time": "June 21, 2023, 11:44:00 PM",
      "body": "Tapi selama Om Arenga pinnata mendapatkan keuntungan maka syukuri saja om  Saya pribadi kalau untuk urusan investasi jangka panjang maka saya menyediakan dompet khusus yang bahkan jarang saya buka. Jadi setiap saya akumulasi dari CEX maka saya langsung kirim ke wallet tersebut. Dan kalaupun lihat harga naik saya tidak terlalu peduli jika itu tentang BTC. Karena saya sudah memiliki target harga yang sudah saya tentukan untuk investasi jangka panjang saya. Sehingga sebelum harga belum mencapai target maka tidak akan saya jual. Tapi apa yang om alami tersebut sebenarnya saya juga cukup banyak mendengarnya yang mengalami yang sama seperti Om. Biasanya mereka memang yang masih baru dalam mengenal crypto. Dan biasanya mereka masih belum sabaran soal crypto. Jadi hal penting lainnya yang harus dimiliki oleh Om Arenga dan semuanya dalam investasi jangka panjang adalah bersabar.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "June 22, 2023, 01:05:25 AM",
      "body": "Kalo mau jangka panjang bener-bener dipersiapkan untuk jangka panjang. jangan tolah toleh mau jual ketika harga naik. Tentukan target harga yang mau dicapai buat jangka panjang, sebelum harga target tercapai Hatam hukumnya untuk menjual. Jangan sering-sering buka exchange, tutup dan nikmati hidupmu dan buka tahun depan menjelang Halving. Awalnya mau jangka panjang dan yang terjadi ketika harga Bitcoin naik ke 27rb malah dijual, asking gak kuatnya. Rencana mau jual dulu malah tambah naik, bahkan sekarang udah neyntuh harga 30rb. Yang penting sih sampean profit dulu, gak rugi dan pasti bakal dapet kesempatan harga beli yang lebih murah. gak perlu frustasi.Coba metode swing trading mungkin cocok, lebih santai dengan periode waktu beberapa hari hingga beberapa minggu. Memanfaatkan setiap momentum pasar ketika bearis atau bullisQuote from: Uruhara on June 21, 2023, 11:44:00 PM-snip-Tapi apa yang om alami tersebut sebenarnya saya juga cukup banyak mendengarnya yang mengalami yang sama seperti Om. Biasanya mereka memang yang masih baru dalam mengenal crypto. Dan biasanya mereka masih belum sabaran soal crypto. Jadi hal penting lainnya yang harus dimiliki oleh Om Arenga dan semuanya dalam investasi jangka panjang adalah bersabar. jangankan yang masih baru, saya sendiri saja yang pernah kog ngalamin seperti yang di ceritakan OP. Kalo startegi dan mental sudah amburadul sudah gak bisa mikir, kadang kebalik Beli pas ijo jual pas merah. Pengendalian psikologi emang penting gak perlu grusa grusu. Manajemen resiko, manajemen keuangan juga perlu dilakukan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uruhara",
      "created_time": "June 22, 2023, 04:19:07 AM",
      "body": "Quote from: taufik123 on June 22, 2023, 01:05:25 AMQuote from: Uruhara on June 21, 2023, 11:44:00 PM-snip-Tapi apa yang om alami tersebut sebenarnya saya juga cukup banyak mendengarnya yang mengalami yang sama seperti Om. Biasanya mereka memang yang masih baru dalam mengenal crypto. Dan biasanya mereka masih belum sabaran soal crypto. Jadi hal penting lainnya yang harus dimiliki oleh Om Arenga dan semuanya dalam investasi jangka panjang adalah bersabar. jangankan yang masih baru, saya sendiri saja yang pernah kog ngalamin seperti yang di ceritakan OP. Kalo startegi dan mental sudah amburadul sudah gak bisa mikir, kadang kebalik Beli pas ijo jual pas merah. Pengendalian psikologi emang penting gak perlu grusa grusu. Manajemen resiko, manajemen keuangan juga perlu dilakukan.Iya om saya juga kalau untuk trading biasa kadang seperti itu. Apalagi kalau ngikutin token yang sedang hype. Tapi kalau untuk jangka panjang Alhamdulillah tidak berani nyentuh. Benar Om itulah pentingnya managemen resiko dan managemen keuangan dan Kalau kita disiplin dalam menjalankan managemen resiko dan managemen keuangan maka mungkin trading juga bakal sedikit teratur.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sarah Azhari",
      "created_time": "June 22, 2023, 05:14:33 AM",
      "body": "Quote from: Arenga pinnata on June 21, 2023, 03:21:26 AM✓ harus selalu update berita terbaru (saya baru menyadari tadi pagi bahwa banyak berita besar yang punys nilai bullish bagi pasar) / untuk menguatkan mental karena terkadang mental melemah karena tidak tahu berita terbaru dan menyangka pasar akan kembali turun dengan cepat jika tidak ada berita bagus.Strategi memanipulasi market dari corong media sudah sering dilakukan sejak crypto ini dilahirkan 2009 silam, bahkan sudah sejak tahun 1912 ketika bursa efek atau pasar modal hadir oleh koloni belanda. Jadi tidak heran, jika banyak perusahaan dan perorangan cuma berfokus kepada berita di media untuk melakukan keputusan penting dalam trading. Tapi lagi-lagi, jangan dijadikan 1 tolak ukur dalam mengambil keputusan, karena kalau untuk pemula, sulit untuk men-filter kalau berita yang disajikan itu benar atau hoax. Beda dengan perusahaan finance dan investasi, Mereka sangat profesional, mereka punya divisi atau departemen khusus untuk memantau media sehingga tahu kalau berita itu benar dan palsu, karena semua itu akan sangat bergantung dalam keputusan mereka bertrading untuk menghasilkan profit besar demi investor yang menitip uangnya pada mereka..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "June 22, 2023, 08:51:03 AM",
      "body": "Quote from: taufik123 on June 22, 2023, 01:05:25 AMKalo mau jangka panjang bener-bener dipersiapkan untuk jangka panjang. jangan tolah toleh mau jual ketika harga naik.Godaan ini sangat sering merubah rencana awal yang dapat menggoyahkan mental untuk segera menjual ketika harga naik, siapa yang bisa menolak profit jika rujukannya pada rencana awal beli di harga murah kemudian jual di harga mahal. Quote from: taufik123 on June 22, 2023, 01:05:25 AMJangan sering-sering buka tukar, tutup dan nikmati hidup dan buka tahun depan menjelang Halving.Kesabaran memainkan peran penting dalam situasi ini, target yang ditentukan kadang mulai pudar ketika tak kunjung datang. Meskipun ada sebagian kecil investor yang mampu melewati berbagai godaan, jumlahnya sangat sedikit.Agar rencana awal bisa berjalan dengan sempurna, investor harus memiliki sikap tegas untuk mencapai tujuan investasi agar bisa mencapai target yang direncanakan. Beli kemudian lupakan mungkin salah satu strategi yang cocok untuk pembentukan mental kuat, ketika waktu yang sudah ditentukan telah tiba, itulah saatnya mengambil buah dari kesabaran selama ini. Quote from: taufik123 on June 22, 2023, 01:05:25 AMAwalnya mau jangka panjang dan yang terjadi ketika harga Bitcoin naik ke 27rb malah dijual, minta gak kuatnya.Rencana mau jual dulu malah tambah naik, bahkan sekarang udah nyentuh harga 30rb.Merubah rencana awal seringkali berakhir dengan penyesalan, banyak sekali investor yang menyesal meski tidak pernah diungkapkan akibat menjual di harga 27rb kemudian tidak lama setelahnya Bitcoin mampu tembus harga 30rb. Untuk mencapai tingkat pada mentalitas kuat, investor harus menggunakan uang yang tidak seharusnya digunakan untuk keperluan lain atau yang lebih dikenal dengan uang dingin. Quote from: taufik123 on June 22, 2023, 01:05:25 AMCoba metode swing trading mungkin cocok, lebih santai dengan periode waktu beberapa hari hingga beberapa minggu.Memanfaatkan setiap momentum pasar ketika bearis atau bullisBagi trader yang memiliki modal terbatas sangat menggunakan metode swing trading untuk mengambil kesempatan kondisi pasar dalam jangka pendek, langkah ini bisa dilakukan sebagai metode penambahan modal untuk melakukan investasi jangka panjang seperti yang diharapkan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "June 22, 2023, 12:20:37 PM",
      "body": "Quote from: Arenga pinnata on June 21, 2023, 03:21:26 AMDari kejadian tersebut saya menyadari beberapa pelajaran yang bisa saya petik yaitu terkait mentalitas. Yaitu✓ Harus patuh pada perencanaan yang telah dibuat sejak awal (jangka panjang) / membutuhkan kekuatan mental dan disiplin. ✓ jika berniat dari awal untuk jangka panjang maka tidak boleh tergoda untuk menjual disaat ada kenaikan kecil. / Yang ini juga membutuhkan mental yang kuat dan disiplin.✓ harus menguatkan mental dan berpegang pada niat awal untuk berdagang jangka panjang✓ harus selalu update berita terbaru (saya baru menyadari tadi pagi bahwa banyak berita besar yang punys nilai bullish bagi pasar) / untuk menguatkan mental karena terkadang mental melemah karena tidak tahu berita terbaru dan menyangka pasar akan kembali turun dengan cepat jika tidak ada berita bagus.Terlepas dari persepsi dan analisa banyak orang, bagi saya Bitcoin lebih tepat dijadikan sebagai aset investasi jangka panjang.Jangka panjang memungkinkan setiap orang yang memegang akan mendapatkan pengembalian yang jauh lebih baik dan tingkat resikonya bisa terkontrol.Dari empat poin yang agan sebutkan, semuanya sangat tergantung pada godaan yang sering membuat pemegang mengalami keraguan yang akut.Biasanya hal tersebut diakibatkan karena salah dalam memahami setiap berita atau bisa juga terjadi karena terlalu sering melihat grafik harga.Jika grafik sedang hijau, mungkin akan membuat pemegang semangat ketika melihat. Tapi akan terbalik jika pas dilihat grafiknya merah berlarut dalam waktu yang lama.Mentalitas dalam memegang memang harus kuat agar tujuan akhir dibalik keputusan memilih jangka panjang terwujud.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bangjoe",
      "created_time": "June 22, 2023, 05:00:33 PM",
      "body": "Saya melihat itu seperti mentalitas yang perlu diterapkan pada investor jangka pendek/pemula jika di lihat dari sifatnya, jika itu bagi saya, mungkin karena sudah sering melakukan hal itu, menjadikan poin-poin itu bukanlah hal yang perlu di lakukan bagi saya. IMOTetapi memang jika untuk yang baru terjun dan ingin melakukan investasi di bitcoin untuk jangka panjang, mungkin perlu menggunakan poin-poin anda OP. Apalagi tentang poin yang terakhir, selalu melihat pemberitahuan, itu akan memberikan dorongan yang cukup negatif menurut ane gan, walaupun memang agan akan sangat bersemangat ketika bitcoin mengalami kenaikan lonjakan, tetapi ingat pasar bitcoin itu fluktuatif, jika agan mendapati berita buruk dan bitcoin mengalami lonjakan turun, saya cukup khawatir dengan mental agan.Ketika melihat kenaikan terkadang kita akan Fomo, dan ketika penurunan akan membuat kita panik, itu akan senantiasa menghiasi. Dan jika memang agan sedang melakukan strategi DCA, terkadang melihat dulu berita dan pasar perlu di lakukan untuk mencari harga terbaik di bulan atau di minggu jadwal agan melakukan DCA. Tetapi jika agan sudah merasa memiliki bitcoin yang cukup untuk investasi jangka panjang, saya pikir agan hanya perlu menyiapkan dompet penyimpanan bitcoin yang paling aman saja, kemudian simpan dengan baik, dan tunggu sesuai berapa lama agan ingin berinvestasi di bitcoin, jika sudah begitu agan tidak perlu melihat berita terbaru, karena tujuan dan waktunya sudah jelas.Tetapi ini juga kembali kepada diri sendiri, seberapa yakin berinvestasi dalam bitcoin, jika yakin investasi jangka panjang dalam bitcoin memberikan keuntungan, agan tidak perlu banyak tingkah.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Arenga pinnata",
      "created_time": "June 23, 2023, 02:32:58 AM",
      "body": "Quote from: Sarah Azhari on June 22, 2023, 05:14:33 AMQuote from: Arenga pinnata on June 21, 2023, 03:21:26 AM✓ harus selalu update berita terbaru (saya baru menyadari tadi pagi bahwa banyak berita besar yang punys nilai bullish bagi pasar) / untuk menguatkan mental karena terkadang mental melemah karena tidak tahu berita terbaru dan menyangka pasar akan kembali turun dengan cepat jika tidak ada berita bagus.Strategi memanipulasi market dari corong media sudah sering dilakukan sejak crypto ini dilahirkan 2009 silam, bahkan sudah sejak tahun 1912 ketika bursa efek atau pasar modal hadir oleh koloni belanda. Jadi tidak heran, jika banyak perusahaan dan perorangan cuma berfokus kepada berita di media untuk melakukan keputusan penting dalam trading. Tapi lagi-lagi, jangan dijadikan 1 tolak ukur dalam mengambil keputusan, karena kalau untuk pemula, sulit untuk men-filter kalau berita yang disajikan itu benar atau hoax. Beda dengan perusahaan finance dan investasi, Mereka sangat profesional, mereka punya divisi atau departemen khusus untuk memantau media sehingga tahu kalau berita itu benar dan palsu, karena semua itu akan sangat bergantung dalam keputusan mereka bertrading untuk menghasilkan profit besar demi investor yang menitip uangnya pada mereka..        Sepertinya saya juga harus lebih berhati-hati lagi dan tidak langsung mempercayai media berita yang saya baca. Karena baru-baru ini saya banyak melihat media berita yang beritanya berisi tentang hal-hal negative terkait pemilik Binance Changpeng Zhao.        Dan sepertinya banyak berita yang judulnya terkadang sedikit berbeda dengan isinya. Yang bisa membuat salah faham. Seperti berita dengan judul CZ jadi buron. Tapi setelah saya baca isinya tidak se ekstrim judulnya.Ini berita yang saya maksud https://www.google.com/amp/s/www.cnbcindonesia.com/tech/20230609171522-37-444663/cz-jadi-buronan-binance-bakal-lumpuh-mulai-13-juni-2023/amp .",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "masulum",
      "created_time": "June 23, 2023, 02:34:31 PM",
      "body": "Quote from: Arenga pinnata on June 23, 2023, 02:32:58 AM        Sepertinya saya juga harus lebih berhati-hati lagi dan tidak langsung mempercayai media berita yang saya baca. Karena baru-baru ini saya banyak melihat media berita yang beritanya berisi tentang hal-hal negative terkait pemilik Binance Changpeng Zhao.        Dan sepertinya banyak berita yang judulnya terkadang sedikit berbeda dengan isinya. Yang bisa membuat salah faham. Seperti berita dengan judul CZ jadi buron. Tapi setelah saya baca isinya tidak se ekstrim judulnya.Ini berita yang saya maksud https://www.google.com/amp/s/www.cnbcindonesia.com/tech/20230609171522-37-444663/cz-jadi-buronan-binance-bakal-lumpuh-mulai-13-juni-2023/amp . Media lokal memang seperti itu cara menyampaikan berita mas, ga klikbait ga ada yang baca. Makanya untuk membaca berita tentang kripto harus mencari berita yang lebih netral. Berita dari perusahaanya CT kebanyakan memang suka memberikan berita klikbait, CNN Indonesia, CNBC Indonesia, Detik dan lainnya yang masih satu induk sering membuat berita FUD dan FOMO. Jadi, sebaiknya menghindari media-media tersebut jika memang membutuhkan berita fundamental. Daripada membaca berita dari media lokal, sebaiknya mas mencari informasi di forum atau di twitter, tapi untuk twitter pastikan bukan akun shilling, ini akan lebih baik jika tujuannya untuk analisa fundamental.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "erep",
      "created_time": "June 23, 2023, 04:49:34 PM",
      "body": "Quote from: masulum on June 23, 2023, 02:34:31 PMMedia lokal memang seperti itu cara menyampaikan berita mas, ga klikbait ga ada yang baca. Makanya untuk membaca berita tentang kripto harus mencari berita yang lebih netral. Berita dari perusahaanya CT kebanyakan memang suka memberikan berita klikbait, CNN Indonesia, CNBC Indonesia, Detik dan lainnya yang masih satu induk sering membuat berita FUD dan FOMO. Jadi, sebaiknya menghindari media-media tersebut jika memang membutuhkan berita fundamental. Daripada membaca berita dari media lokal, sebaiknya mas mencari informasi di forum atau di twitter, tapi untuk twitter pastikan bukan akun shilling, ini akan lebih baik jika tujuannya untuk analisa fundamental.Saya sudah dari dulu tidak membaca berita kripto dari media lokal karena dari gaya penulisan judul saja sudah klikbait hanya mencari perhatian dari siapa saja yang sudah membaca judul berita akan tertarik membaca isi beritanya walaupun terkadang isi berita tidak ada keterkaitan dengan judulnya, namun berita yang menyangkut dengan kripto dinilai sangat sensitif untuk pemula yang akan berdampak pada kepanikan karena tidak memiliki pengetahuan untuk analisis berita, bahkan berita kripto di media global juga harus dipertimbangkan dengan mencari sumber berita yang akurat dan memuat berita sesuai fakta. Saya biasanya memantau berita di twitter dari postingan akun yang sudah terverifikasi dan pastinya tidak mengabaikan faktor analisis berita sebagai faktor penunjang untuk mengecek kebenaran dari berita yang beredar saat ini.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "taufik123",
      "created_time": "June 23, 2023, 05:09:16 PM",
      "body": "Quote from: masulum on June 23, 2023, 02:34:31 PMQuote from: Arenga pinnata on June 23, 2023, 02:32:58 AM        Sepertinya saya juga harus lebih berhati-hati lagi dan tidak langsung mempercayai media berita yang saya baca. Karena baru-baru ini saya banyak melihat media berita yang beritanya berisi tentang hal-hal negative terkait pemilik Binance Changpeng Zhao.        Dan sepertinya banyak berita yang judulnya terkadang sedikit berbeda dengan isinya. Yang bisa membuat salah faham. Seperti berita dengan judul CZ jadi buron. Tapi setelah saya baca isinya tidak se ekstrim judulnya.Ini berita yang saya maksud https://www.google.com/amp/s/www.cnbcindonesia.com/tech/20230609171522-37-444663/cz-jadi-buronan-binance-bakal-lumpuh-mulai-13-juni-2023/amp . Media lokal memang seperti itu cara menyampaikan berita mas, ga klikbait ga ada yang baca. Makanya untuk membaca berita tentang kripto harus mencari berita yang lebih netral. Berita dari perusahaanya CT kebanyakan memang suka memberikan berita klikbait, CNN Indonesia, CNBC Indonesia, Detik dan lainnya yang masih satu induk sering membuat berita FUD dan FOMO. Jadi, sebaiknya menghindari media-media tersebut jika memang membutuhkan berita fundamental. Daripada membaca berita dari media lokal, sebaiknya mas mencari informasi di forum atau di twitter, tapi untuk twitter pastikan bukan akun shilling, ini akan lebih baik jika tujuannya untuk analisa fundamental.Miris sih kalo ngeliat berita FUD yang terus di goreng, padahal berita dengan jdul yang dituduhkan tidak benar.  Permasalahan SEC vs Binance.us disamaratakan pada Binance.com, padahal itu tdiak berpengaruh diluar hukum US. Yang buat berita-berita Klikbait cuman pengen cari visitor, cari trafik saja. Padahal berita yang di tuduhkan tidak benar. FUD-FUD lokal semacam ini malah akan meracuni pengguna crypto yang masih awam dan akan beranggapan bahwa crypto sudah tidak aman, karena mendapat berita Binance yang bakal tutup. Sebelum terjun ke crypto, dulu saya juga bagian dari penulis artikel semacam itu. Pokok hajar yang viral-viral, meskipun berita di plesetkan dengan berbagai macam judul clickbait, yang penting banyak pengunjung dan tentu bakal banyak cuannya juga. Untuk berita yang aktual dan terpercaya saya cuman liat di media bule, tapi tidak semua media memiliki kerdibilitas tinggi, ada juga yang cuman manfaatin keadaan. dan beberapa akun twitter yang yang memang udah expert di crypto.Media Lokal ada juga beberapa yang menurut saya terpercaya dan gak asal-asalan post artikel seputar crypto.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CageMabok",
      "created_time": "June 24, 2023, 04:06:01 PM",
      "body": "Quote from: Arenga pinnata on June 23, 2023, 02:32:58 AM        Sepertinya saya juga harus lebih berhati-hati lagi dan tidak langsung mempercayai media berita yang saya baca. Karena baru-baru ini saya banyak melihat media berita yang beritanya berisi tentang hal-hal negative terkait pemilik Binance Changpeng Zhao.        Dan sepertinya banyak berita yang judulnya terkadang sedikit berbeda dengan isinya. Yang bisa membuat salah faham. Seperti berita dengan judul CZ jadi buron. Tapi setelah saya baca isinya tidak se ekstrim judulnya.Ini berita yang saya maksud https://www.google.com/amp/s/www.cnbcindonesia.com/tech/20230609171522-37-444663/cz-jadi-buronan-binance-bakal-lumpuh-mulai-13-juni-2023/amp . Apa yang dikatakan oleh om @masulum di atas itu benar, jika om @Arenga pinnata ingin menjaga mentalitas om sendiri dalam hal trading jangka panjang serta untuk upaya peningkatan fundamental yang lebih baik, om @Arenga pinnata tidak perlu sering membaca berita dari media lokal karena berita dari media luar jauh lebih berbobot serta juga jauh lebih lengkap. Contohnya seperti di https://news.bitcoin.com/ dan https://www.coindesk.com/ serta https://cointelegraph.com/Hal ini tentu bukan karena kita membenci media lokal kita sendiri, tetapi lebih kepada untuk menjaga mental kita sendiri dalam menyikapi setiap berita yang di publikasikan oleh pihak media. Lagi pula om sendiri juga mengatakan kalau isi dari berita dengan judulnya sangatlah berbeda yang mungkin hal itu memang sengaja dibuat oleh pihak media supaya bisa menarik lebih banyak perhatian dari semua orang ketika membaca judul beritanya om. Sedangkan untuk berita dari media luar negeri saya pikir antara isi dan judulnya selalu lebih balance dan tidak jauh berbeda.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ahli38",
      "created_time": "June 24, 2023, 09:32:52 PM",
      "body": "Untuk benar-benar bisa membangun mentalitas yang kuat dalam perdagangan crypto ataupun dalam investasi crypto maka salah satu caranya adalah dengan mengetahui posisi kita dipasar. Dalam artian anda harus tahu kapan waktu yang tepat untuk masuk dan kapan waktu yang tepat untuk keluar (cara ini cocok untuk pedagang harian seperti saya). Dan untuk bisa melakukannya agan harus terlebih dahulu menguasai dasar-dasar Analisa dalam perdagangan Crypto. Seperti diawali Analisa Fundamental (ex. selalu memantau berita terbaru dan semua event yang berpengaruh pada pergerakan pasar), Analisa sentimental (Ex. Melihat reaksi pasar atas setiap berita fundamental yang muncul) Dan Analisa Tekhnikal (Ex. Menentukan dimana titik harga yang paling tepat untuk masuk atau keluar setelah melalui tahap Analisa Fundamental dan sentimental).  Barulah setelah itu membuat keputusan dan patuh pada rencana yang telah dibuat oleh agan sendiri. Tapi karena agan mengatakan ini awalnya adalah investasi jangka panjang. Maka sebenarnya saat ini agan telah keluar dari rencana agan yang telah dibuat diawal (perubahan rencana). Terkadang perubahan rencana juga hal yang umum dalam investasi jangka panjang. Tapi tentunya harus dengan cara yang benar. Atau dengan pertimbangan atau analisa yang cukup matang. Dan bukan berdasarkan emosional saja. Contohnya jika agan sebelum memutuskan untuk merubah rencana dalam investasi jangka panjang agan. Maka alangkah baiknya agan juga tidak langsung mengambil keputusan secara tergesa-gesa. Agan sebenarnya harus terlebih dahulu menganalisa kembali kapan waktu yang tepat untuk keluar. Setidaknya agan harus melihat Pola Candle stik yang terbentuk dan juga menentukan titik support dan resisten terlebih dahulu. Dan menunggu konfirmasi apakah resisten tertembus atau tidak.  Dan sebenarnya ketika harga $27k tertembus maka sebenarnya itu sudah masuk dalam konfirmasi bahwa kenaikan harga akan berlanjut. Walaupun agan tidak melihat berita fundamental sekalipun. Maka jika agan faham secara tekhnikal maka sebenarnya diharga agan keluar itu sebenarnya sudah memang waktunya harga untuk melanjutkan kenaikan menuju resistance selanjutnya. Jadi belum waktu yang tepat untuk keluarKarena memang sudah jebol keatas gan.Ditambah dengan berita-berita yang positif yang memang secara fundamental juga akan memperkuat kenaikan menjadi lebih cepat. Tapi tenang saja gan. Harga tidak selalu naik. Nanti juga turun lagi. Jadi tetap semangat dan agan bisa mulai DCA kembali saat harga kembali terkoreksi. Tapi saat ini Nampaknya berita-berita positif terus bermunculan Seperti SEC Yang saat ini telah menyetujui ETF Futures Laverage Bitcoin yang pertama disana.Sourch 1 & Sourch 2Dan ada juga berita yang lebih positif lagi yaitu akan diluncurkannya EDX Market yang mana dibelakang market ini adalah perusahaan-perusahaan besar atau orang biasa mengatakan raksasa keuangan yaitu Fidelity, Charles Schwab, dan Citadel . Dan sebenarnya berita ini muncul kemarin saat harga Bitcoin mencapai $30k sehingga membuat Bitcoin sempat mengalami kenaikan hingga ke $31k. Dan untuk tahap awal Exchange tersebut akan melisting BTC, ETH, BCH dan LTC. Jadi siap-siap saja untuk pantau 4 koin tersebut. Soalnya bisa jadi makanan para Whales",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kawetsriyanto",
      "created_time": "June 25, 2023, 09:58:20 PM",
      "body": "Quote from: Arenga pinnata on June 21, 2023, 03:21:26 AMTapi kemarin atau lebih tepatnya tadi malam saya iseng melirik pasar bitcoin. Dan sebenarnya saya tidak berniat mau trading. Tapi sepertinya psikologis saya terpengaruh setelah melihat pasar mengalami lonjakan hebat.Sehingga saya memiliki pemikiran untuk menjual dulu bitcoin yang telah saya kumpulkan. Dan nanti mau dibelikan lagi ketika harga turun. Saya menjual di sekitar 27rb lebih. Tapi tadi pagi saya cukup kaget karena harga bitcoin bukannya turun kembali malah lanjut terus naik. Dan akhirnya saya menyesali keputusan saya untuk menjual di harga 27rb lebih. Dan saya frustasi karena menunggu btc untuk turun tapi tidak kunjung turun.Agan bagi saja BTCnya, sebagian agan hold untuk long term dan sebagian untuk trading (short term). - Yang long term jangan pernah dijual sebelum sampe target harga yang sesuai. Misalnya agan target mau jual di rate $75k, paling tidak jual ketika mendekati $75k. Untuk yang ini, lebih baik di kirim ke hardware wallet sehingga tidak mudah untuk dijual.- Yang untuk trading atau short term agan bisa jual ketika naiknya cukup lumayan dan untungnya dirasa memuaskan. Agan bisa beli lagi kapanpun harga BTC turun, cuman jangan mematok harga terendah sebelumnya karena harga BTC sudah pasti naik bertahap. Yang penting agan masih untung lumayan, agan bisa entry lagi untuk dihold lagi.Nah dengan dibagi dua seperti ini, agan bisa dapat dua-duanya. Agan bisa dapat profit cepat, agan juga masih punya BTC untuk target jangka panjang (target bullrun season).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Arenga pinnata",
      "created_time": "June 25, 2023, 10:44:59 PM",
      "body": "Quote from: kawetsriyanto on June 25, 2023, 09:58:20 PMAgan bagi saja BTCnya, sebagian agan hold untuk long term dan sebagian untuk trading (short term). - Yang long term jangan pernah dijual sebelum sampe target harga yang sesuai. Misalnya agan target mau jual di rate $75k, paling tidak jual ketika mendekati $75k. Untuk yang ini, lebih baik di kirim ke hardware wallet sehingga tidak mudah untuk dijual.- Yang untuk trading atau short term agan bisa jual ketika naiknya cukup lumayan dan untungnya dirasa memuaskan. Agan bisa beli lagi kapanpun harga BTC turun, cuman jangan mematok harga terendah sebelumnya karena harga BTC sudah pasti naik bertahap. Yang penting agan masih untung lumayan, agan bisa entry lagi untuk dihold lagi.Nah dengan dibagi dua seperti ini, agan bisa dapat dua-duanya. Agan bisa dapat profit cepat, agan juga masih punya BTC untuk target jangka panjang (target bullrun season).Sepertinya memang harus sepertu ini yang saya lakukan mas. Soalnya kalau kemarin-kemarin saya selalu jual langsung semua. Mungkin cara ini akan saya pakai jika sudah berhasil mengakumulasi kembali Bitcoin yang telah saya jual. Terima kasih semuanyanya atas tanggapan serta sarannya di topik ini. Saya belajar banyak setelah mendapatkan balasan dari mas-mas semua. Pelajaran yang saya dapat dalam hal ini seperti :✓ Harus lebih hati-hati dalam membaca berita tidak hanya mengandalkan berita lokal tapi juga harus baca juga dari web luar✓ Saya sepertinya harus belajar kembali dan mendalami tentang dasar-dasar ilmu trading. Karena saya belum faham tentang Analisa-analisa terutama tehnikal yang menurut saya masih cukup rumit. ✓ Saya tidak boleh all in. Baik dalam menjual atau dalam membeli kembali. Sepertinya saya juga harus belajar untuk menggunakan DCA dengan benar. Dan sepertinya memang harus punya dua jenis perdagangan yaitu Short term dan Long term.Tapi apakah menurut mas-mas semuan BTC bisa kembali turun dalam waktu dekat?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Chikito",
      "created_time": "June 28, 2023, 12:02:50 AM",
      "body": "Quote from: Arenga pinnata on June 25, 2023, 10:44:59 PMTapi apakah menurut mas-mas semuan BTC bisa kembali turun dalam waktu dekat?  Kalau sampeyan baca dari banyaknya berita baik, tentu untuk mengharapkan turun dalam waktu dekat itu sulit terjadi, apa lagi sekarang ini ada upaya untuk mendongkrak harga bitcoin dalam waktu dekat, seperti masive-nya berita pertumbuhan exchange, hype goverment dan rare golden cross  yang baru kali ini terjadi. Saya rasa sampeyan itu harus focus, jangan mencla-mencle, yang namanya trading itu untuk short term, jadi tidak perlu mempelajari itu, sedangkan long-term (sesuai judul thread sampeyan), mau beli hari ini pun harus punya target waktu untuk beberapa tahun kedepan, itu namanya investasi. Jadi ya jangan tanya kapan harga turun, mulailah berpikir kapan saya dapat uang untuk nimbun bitcoin dari sekarang.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MarjorieZimmermanGinger",
      "created_time": "June 29, 2023, 10:33:35 AM",
      "body": "Quote from: Arenga pinnata on June 21, 2023, 03:21:26 AMSaya memiliki rencana perdagangan jangka panjang dalam bitcoin. Dan saya menargetkan akan menyimpannya hingga beberapa tahun. Karena saya tidak bisa analisa jadi awalnya tidak suka berdagang jangka pendek. Jadi saya hanya membeli untuk disimpan.Ketika pemahaman trading yang kita memiliki tidak kuat maka sebaiknya lakukan pola investasi jangka panjang karena kita tidak perlu memantau pergerakan bitcoin setiap saat. Keputusan untuk membeli untuk di simpan sudah jauh lebih tepat dibandingkan untuk memaksakan terlibat dalam trading jangka pendek tetapi tidak menguasai caranya.Quote from: Arenga pinnata on June 21, 2023, 03:21:26 AMSehingga saya memiliki pemikiran untuk menjual dulu bitcoin yang telah saya kumpulkan. Dan nanti mau dibelikan lagi ketika harga turun. Saya menjual di sekitar 27rb lebih. Tapi tadi pagi saya cukup kaget karena harga bitcoin bukannya turun kembali malah lanjut terus naik. Dan akhirnya saya menyesali keputusan saya untuk menjual di harga 27rb lebih. Dan saya frustasi karena menunggu btc untuk turun tapi tidak kunjung turun.Anda belum begitu memahami cara menganalisa pasar dan di atas anda telah menjelaskan bahwa hanya membeli untuk disimpan, tetapi karena anda melakukan kesalahan dan mencoba menjual bitcoin yang anda miliki dan pada akhirnya harga kembali naik diluar perkiraan anda. Lakukan pemantapan terlebih dahulu dan buatlah skema investasi yang dapat membawa anda pada tahap keuntungan, pengetahuan adalah sesuatu yang penting dalam menjalani trading maupun investasi jangka panjang.Misalnya membuat target pada harga berapa bitcoin ingin anda lepas sesuai dengan konsep investasi yang anda gunakan, membeli untuk menyimpan seharusnya dapat membawa anda pada tahapan keuntungan akan tetapi jika anda dapat bersabar hingga mencapai harga yang di inginkan. Ingatlah bahwa jangka panjang merupakan langkah yang paling tepat untuk bitcoin yang anda miliki, selama anda mampu mengendalikan emosi, kepanikan dan psikologis dalam mengahadapi pasa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}