{
  "id": "topic_5431497",
  "title": "tyook",
  "author": "tyook",
  "created_time": "December 25, 2022, 09:53:36 PM",
  "content": "Imagine the following scenario (that could possibly occur in decades):Bitcoin becomes widely adopted, its marketcap surpass the dollar's, and it become so valuable that even a single satoshi is worth more than, for example, a couple of pens, a bottle of water, etc.In that case, payments for small amounts wouldn't be possible even with second layer solutions such as LN, because even a single satoshi would be more valuable than the price of the product. There would be a need for Bitcoin to be more divisible, for it to be broken down into even smaller parts.Would such need to use smaller denomination units (smaller than satoshi) require a hard fork? Can someone shed some light into it?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5431497",
  "comments": [
    {
      "author": "hZti",
      "created_time": "December 25, 2022, 10:03:48 PM",
      "body": "One satoshi is 0.00000001 BTC, wich means that is already quite small. In any case, the change of that would mean that there need to be consensus with more than 50% of the nodes as far as I know. But there could be other solutions where you could just own parts of a satoshi, like you can now own part of a stock.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 25, 2022, 10:26:34 PMLast edit: December 26, 2022, 08:13:26 AM by Charles-Tim",
      "body": "One satoshi is a very small unit. If bitcoin is worth $100 million, 1 sat would be just $1. Bitcoin price is $16800 presently, but with all-time-high of $69000. That is not close to $100 million at all.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 25, 2022, 10:58:56 PM",
      "body": "Quote from: tyook on December 25, 2022, 09:53:36 PMWould such need to use smaller denomination units (smaller than satoshi) require a hard fork? Can someone shed some light into it?Yes.For adding more decimal places, we have to change the consensus rules and a hard fork would be required. According to consensus rules, the amount field in a bitcoin transaction must be an integer between 0 and 2100000000000000 and we can't send 0.1 satoshi or 0.01 satoshi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "December 25, 2022, 11:06:32 PM",
      "body": "Quote from: hosseinimr93 on December 25, 2022, 10:58:56 PMFor adding more decimal places, we have to change the consensus rules and a hard fork would be required. According to consensus rules, the amount field in a bitcoin transaction must be an integer between 0 and 2100000000000000 and we can't send 0.1 satoshi or 0.01 satoshi. But will that be a hard fork or a soft fork? Just want to be clear about it. I thought anything that does not lead to creation of another coin is just a soft fork, I mean pertaining to this? Or will bitcoin blockchain be abandoned for a new one because of this?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tyook",
      "created_time": "December 25, 2022, 11:08:56 PM",
      "body": "I understand that one satoshi is very small and for one satoshi to reach $1 a single Bitcoin should be worth over $100 million, but what if that really happens in 30 years or more? If Bitcoin succeds in the long term, this is plausible.The bitcoin in the transactions on Bitcoin's timechain (aka blockchain) is in satoshis. If you inspect a block, you will find out that all value transfers are measured in satoshis. Currently, there is no way to own a fraction of a Satoshi. It is not possible to own a fraction of satoshi on Bitcoin layer 1 right now because other nodes of the network will reject any transaction that do not comply with the protocol standards (which is to measure value in satoshis). So, if you try to do some fancy thing to own a fraction of a satoshi, it will be reject by the network participants. It seems to me that if one day we need to own a fraction of a satoshi, this could only be done through a hard fork... this is not something we have to worry for the next years, but could be a problem in some decades. This concerns me",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 25, 2022, 11:46:14 PM",
      "body": "Quote from: Charles-Tim on December 25, 2022, 11:06:32 PMBut will that be a hard fork or a soft fork? Since we have to change the consensus rules for that and it's required that all the nodes accept the new rule, it would be a hard fork.Quote from: Charles-Tim on December 25, 2022, 11:06:32 PMI thought anything that does not lead to creation of another coin is just a soft fork, I mean pertaining to this? Or will bitcoin blockchain be abandoned for a new one because of this?Any upgrade that is not backward-compatible is a hard fork. As I already said, for increasing decimal places, we have to change the consensus rules. Nodes are free to not accept the new rules and have a separate chain. So, it would be a hard fork.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fundamentals Of",
      "created_time": "December 26, 2022, 12:02:21 AM",
      "body": "I don't think there is a need for a hard fork. And I don't think the smallest unit of Bitcoin is the Satoshi. An amount of Bitcoin could actually go smaller than that. The lightning network sometimes even uses millisatoshi or millisat or msat. If Satoshi has 8 decimal points, the millisatoshi has 11 decimal points. So it goes like 0.00000000001. That's 1.7e-7 in USD, way smaller than a cent. So I think there isn't a problem with Bitcoin's divisibility at all even if 1 Bitcoin goes up to a million USD.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "December 26, 2022, 04:05:34 AM",
      "body": "Quote from: hosseinimr93 on December 25, 2022, 10:58:56 PMYes.For adding more decimal places, we have to change the consensus rules and a hard fork would be required. According to consensus rules, the amount field in a bitcoin transaction must be an integer between 0 and 2100000000000000 and we can't send 0.1 satoshi or 0.01 satoshi. Correct me if I'm wrong — but couldn't this simply be done in the wallet side of things? As it's mostly just moving of decimal places anyway.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "December 26, 2022, 05:18:24 AM",
      "body": "Although Bitcoin does not support micro-payments, but I read in this presentation [1] it found there's a way to send micro payments using lightning network with probabilistic payments method (start read on the slide 15).[1] https://docs.google.com/presentation/d/1G4xchDGcO37DJ2lPC_XYyZIUkJc2khnLrCaZXgvDN0U/edit?pref=2&pli=1#slide=id.g85f425098_0_2",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "December 26, 2022, 07:13:53 AM",
      "body": "Quote from: mk4 on December 26, 2022, 04:05:34 AMCorrect me if I'm wrong — but couldn't this simply be done in the wallet side of things? As it's mostly just moving of decimal places anyway.You are right. As we all know, each bitcoin is divided to 100 million units and there are 8 decimal places for bitcoin. You can send 0.001 BTC and your wallet or block explorers can show that as 0.001 BTC, 1 milliBTC or 1000 microBTC. But in the bitcoin protocol, there are no decimal places and we always deal with satoshis.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "franky1",
      "created_time": "December 26, 2022, 07:29:50 AMLast edit: December 26, 2022, 07:40:49 AM by franky1",
      "body": "raw data of blockchain and transactions do not measure things in whole bitcoin nor bitcoin plus decimalsits measure is actually infact at the satoshi level. yes satoshis are the base and true units. bitcoins are an affect effect visual display calculationchanging amount of visual display calculation (decimals) breaks the value measure completelyyes in 2009 it was not 50 coins minedit was 5,000,000,000 units minedand thats hard coded into the protocol and block datathe term btc is a basket allotment of sats divided by 100,000,000where btc exists not as hard data or protocol. but as user interface easy view displaythis means in the reality of actual data and ruleit was 210,000 blocks of 5,000,000,000 units minedthen   210,000 blocks of 2,500,000,000 units minedand so onif we stupidly change the decimals of easy view display at GUI level . it does require breaking the blockchain and data store rulesand by doing so can easily cause miscount or mis-conversion bugs of creating more value than should exist, and/or the oppositeEGif there was a 11 decimal system in bitcoin to bastardise bitcoin to look like a stupid subnetwork of flaws..it would require making block rewards of 2009 change from being 50coin to being 0.05coinyep changing the calculation from 100,000,000 to 100,000,000,000makes 5,000,000,000 appear as 0.05,000,000,000lets not bastardise bitcoins strongest rules just to emulates some flawed buggy network created in 2017 that has not blockchain or consensus or network security of its ownif that network has a bug where its peg of 1:1000 can be broke easily.. thats their problem. lets not break bitcoin to fix their problems",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 26, 2022, 11:39:42 AM",
      "body": "Quote from: tyook on December 25, 2022, 09:53:36 PMBitcoin becomes widely adopted, its marketcap surpass the dollar's, and it become so valuable that even a single satoshi is worth more than, for example, a couple of pens, a bottle of water, etc.Here's a post from Ray Dillinger on this topic which you might find interesting: https://bitcointalk.org/index.php?topic=819656.msg9170781#msg9170781Even in such a case where bitcoin becomes a globally adopted currency, a satoshi is probably still going to be just fine as the smallest on-chain unit. The bigger issue would be dealing with fees and the dust limit for transactions which are only moving a few sats. No point paying 100 sats to move 1.That's where second layer solutions come in to play. No one is going to pay 100 sats to move 1, but would likely have no problems spending 100 sats to open a channel which could move 1 sat over and over again, thousands or even tens of thousands of times.Quote from: mk4 on December 26, 2022, 04:05:34 AMCorrect me if I'm wrong — but couldn't this simply be done in the wallet side of things? As it's mostly just moving of decimal places anyway.You can code your own wallet software to display any units you like. I could code my wallet so instead of displaying 8 decimal places it displays 20. Instead of sats being the base unit, now my base unit is picosats. None of that makes any difference to the protocol though, and the smallest amount I could work in would be 1,000,000,000,000 picosats, which is equivalent to 1 sat. Trying to change any of the 12 zeroes in that number would simply result in an invalid transaction which would be rejected by the network.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hZti",
      "created_time": "December 26, 2022, 12:00:03 PM",
      "body": "Another problem that would arise if bitcoin becomes so valuable that one satoshi is one USD is that transaction costs would make it impossible to spend the bitcoins. Right now, even a one satoshi transaction would require a few hundreds or thousand satoshi in transaction fees.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "December 26, 2022, 12:29:31 PM",
      "body": "Quote from: Fundamentals Of on December 26, 2022, 12:02:21 AMI don't think there is a need for a hard fork. And I don't think the smallest unit of Bitcoin is the Satoshi. An amount of Bitcoin could actually go smaller than that. The lightning network sometimes even uses millisatoshi or millisat or msat. If Satoshi has 8 decimal points, the millisatoshi has 11 decimal points. So it goes like 0.00000000001. That's 1.7e-7 in USD, way smaller than a cent. So I think there isn't a problem with Bitcoin's divisibility at all even if 1 Bitcoin goes up to a million USD.I think this is what will happen. There were several discussions of this in the forum about this to which we know they planned it ahead already before this adoption could take BTC to $1M. And it will be possible to pay for a water bottle using an LN wallet in stores like Starbucks. It wouldn't need hard forking anymore I suppose. Every company I think will also adopt LN as well after all everyone wants tiny bits for thier fee.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "PrivacyG",
      "created_time": "December 26, 2022, 01:17:28 PM",
      "body": "Quote from: o_e_l_e_o on December 26, 2022, 11:39:42 AMThat's where second layer solutions come in to play. No one is going to pay 100 sats to move 1, but would likely have no problems spending 100 sats to open a channel which could move 1 sat over and over again, thousands or even tens of thousands of times.Hope this is not a stupid idea, but.Say the scenario of Bitcoin uprising to $100,000,000 somehow turns into reality.  Is it possible to create a second layer on top of Bitcoin or a third layer on top of the second to allow payments under 1 satoshi and only return to layer 2 or 1 if you own exact amounts of Satoshi's with no decimals?So if I have 100 Satoshi's and I give you 0.1 through this third layer, I have 99.9 left.  Now I can only go back to layer one with 99 Satoshi's and will need 0.1 more if I want to send the remaining.  Bitcoin continues to have only 8 decimals but this layer allows micro payments.  Something like how faucet payments work.  You accumulate enough until you can 'withdraw' part of it to a previous layer.-Regards,PrivacyG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Gallar",
      "created_time": "December 26, 2022, 01:51:13 PM",
      "body": "it's better not to change bitcoin, because if you change it, especially if there are satoshi or bitcoin children, it will definitely change the bitcoin system.why should it be reproduced, things like that are not needed in bitcoin, because the results will be the same.if you think bitcoin has children, so it can be affordable and cheaper, it is the same thing, buy bitcoin within your financial means.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "o_e_l_e_o",
      "created_time": "December 26, 2022, 03:36:01 PM",
      "body": "Quote from: hZti on December 26, 2022, 12:00:03 PMAnother problem that would arise if bitcoin becomes so valuable that one satoshi is one USD is that transaction costs would make it impossible to spend the bitcoins. Right now, even a one satoshi transaction would require a few hundreds or thousand satoshi in transaction fees.This is much less of an issue. Although a satoshi is the base unit in the protocol (meaning introducing smaller units would require a hard fork), this is not the case for fees. Although we all think in terms of sats/vbyte for fees, in the protocol fees are actually define in terms of sats per virtual kilobyte, or kvb. The default setting is 1000 sats/kvb, which is obviously the same as 1 sat/vbyte. Because of this, if is easy to change that to 100 sats/kvb (for example), which would be the same as 0.1 sats/vbyte (which would obviously then be rounded up to the nearest sat). Indeed, not only do we not need to fork for this, but we don't even need an update to Core at all. Any node is free to change their minimum fee rate at any time, and miners are free to include any transaction paying any fee they like at any time.Quote from: PrivacyG on December 26, 2022, 01:17:28 PMIs it possible to create a second layer on top of Bitcoin or a third layer on top of the second to allow payments under 1 satoshi and only return to layer 2 or 1 if you own exact amounts of Satoshi's with no decimals?You can already do this with Lightning. You can open a channel and make transactions involving millisats for as long as your channel remains open. If you close a channel which is holding some fraction of a satoshi, then the balance you receive will be floored to the nearest satoshi.So for example I open a channel with 100,000,000 msats (100,000 sats). I transact back and forth over several months. At the end of those months my channel has a balance of 100,045,724 msats. If I close the channel, I'll receive 100,045 sats.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DooMAD",
      "created_time": "December 26, 2022, 03:48:16 PMLast edit: December 27, 2022, 05:58:14 PM by DooMAD",
      "body": "I wouldn't try to preempt the decision at this stage.  We have no idea what the landscape will look like when we reach a time when some might consider such a change to be important.  It's also worth pointing out that, at some point within the next ~80 years, Bitcoin does require a hardfork to fix a fatal bug.  So let's not have too much fear-mongering about the supposed dangers of hardforks when there's no chance of completely avoiding them.  People may well view it as an opportunity to make other changes.Ultimately, the network will collectively act in its own interests and individuals will have to decide if they still want to follow or not.                   Public Notice:This topic contains a post by user franky1, who has stated that there are nodes currently running on the Bitcoin network which do not follow consensus.  This is an impossibility from a technical standpoint.  They are in no position to make judgments on technical matters.  Along with derailing topics to discuss unrelated matters and generally being a disruptive nuisance, this vile user has also equated softforks to an act of rape, which is deplorable and unconscionable behaviour.  Consider adding them to your ignore list.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hd49728",
      "created_time": "December 26, 2022, 03:57:37 PM",
      "body": "The denomination to send bitcoins can be changed through consensus and community can support it in future if bitcoin value becomes too high. What a damnnhigh price $100M for bitcoin. We are too far and not too closely to that price.However I believe that community will never support a consensus to increase total supply of Bitcoin. Because at beginning and at the end, 21M in total supply is what help Bitcoin has high value and potentiality to keep up its high value.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}