{
  "id": "topic_5463141",
  "title": "Lida93",
  "author": "Lida93",
  "created_time": "August 13, 2023, 05:32:09 PM",
  "content": "It is conventionally taken that obsession to something is bad(wrong) and people are mainly advised to do away with behaviours of obsession to anything as it could result to their harm. And on this note I want us to look into bitcoin obsession, discussing objectively about it without sentiment or prejudice for the sake of  impacting rational knowledge in the course of the discuss.But before we proceed you might wanna have a refreshing definition/meaning of obsession. According to the Britannica dictionary, obsession is a state in which someone thinks about someone or something constantly or frequently especially in a way that is not normal. While, the Oxford dictionary defines it as an idea or thought that continually preoccupies or intrudes on a person's mind.Now, it is undeniable and an underlying fact that bitcoin possesses multiple advantageous features spanning from anonymity, decentralization, cancellation of third party, pseudonymity, P2P etc, all encapsulated towards financial freedom.With obsession when it's gambling we give a strong NO with our reasons attached cause obsession is just another form of addiction. So lets talk about obsession (addiction) to bitcoin. I felt in a way it might help bitcoin enthusiasts like myself and others to knows  and understand in clear terms if bitcoin obsession is bad(wrong) or not.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5463141",
  "comments": [
    {
      "author": "SamReomo",
      "created_time": "August 13, 2023, 05:42:05 PM",
      "body": "I don't think that our love for Bitcoin could be termed as Bitcoin obsession, but in a way it's a type of a hobby that we all want to have in our lives. Holding and trading of Bitcoin has huge impact on our lives and we can't ignore the fact that without Bitcoin we may not be able to live our lives happily. The features and all the positive aspects of Bitcoin make it a unique way for us to be attracted to it, and there is nothing like Bitcoin in the whole world.Most of us are doing hard work to acquire some amount of Bitcoin while others are putting their fiat money on exchanges and converting it into Bitcoin so that they may have a better and financially stable future only because of this amazing asset. Those investors are also enthusiasts who would do every thing to accumulate Bitcoin and their main goal is to increase their Bitcoin portfolios every day.I would say that the obsession or the love we have for Bitcoin is a different kind of love than an addict has and it's really a positive type of love and using of words like addiction may not be suitable to term this thing. We are obsessed to use Bitcoin for the features it offers, and it's human nature to love all those things that free them from the bondages. Bitcoin is true freedom for an enthusiast and if someone knows that then they will always want to have Bitcoin in their lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "August 13, 2023, 05:49:31 PM",
      "body": "Going by the literal definition of obsession and addiction, you can deduce that the two are almost similar in meaning. But hence anything is addictive, it becomes an abnormality which should be checked and nipped at the bud.For me, you can be enthusiastic about bitcoin, which is naturally okay.But being obsessed with it, is not too advisable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Lida93",
      "created_time": "August 13, 2023, 05:56:08 PM",
      "body": "Quote from: SamReomo on August 13, 2023, 05:42:05 PMI don't think that our love for Bitcoin could be termed as Bitcoin obsession, but in a way it's a type of a hobby that we all want to have in our lives. Holding and trading of Bitcoin has huge impact on our lives and we can't ignore the fact that without Bitcoin we may not be able to live our lives happily. The features and all the positive aspects of Bitcoin make it a unique way for us to be attracted to it, and there is nothing like Bitcoin in the whole world.Your contribution is noted. But can you throw more light to what you mean by without bitcoin we may not be able to live our lives happily . Or do you mean  bitcoin now an agent of happiness?There are people that are happily living their lives without having an idea of bitcoin and there are also those that have adopted bitcoin and investing in it making profits and earnings but are not living happily for some reasons or the other.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yudi09",
      "created_time": "August 13, 2023, 06:01:10 PM",
      "body": "Based on the basic facts about bitcoin, bitcoin can still be controlled by someone who understands the things that exist in bitcoin.I or he loves bitcoin very much, almost every time we think that bitcoin will reach its highest price later, so every day we are constantly trying to collect bitcoins in large quantities because with the amount of bitcoin ownership we have, we will definitely get a big profit.For me, it's a form of love that is different from obsession. Even if the direction is more towards obsession because you constantly think about bitcoin, I think it is more towards the positive because it is done on the basis of awareness without an element of compulsion.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "August 13, 2023, 06:09:50 PM",
      "body": "Pretty hard to talk about this knowing that there are various degrees of both obsession and addiction. It's not binary — it's a spectrum; just like how two money-obsessed persons have different degrees of obsession.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "August 13, 2023, 06:19:48 PM",
      "body": "Quote from: Lida93 on August 13, 2023, 05:32:09 PMIt is conventionally taken that obsession to something is bad(wrong) and people are mainly advised to do away with behaviours of obsession to anything as it could result to their harm. And on this note I want us to look into bitcoin obsession, discussing objectively about it without sentiment or prejudice for the sake of  impacting rational knowledge in the course of the discuss.I believe the first thing to be asked on this regard is on what exactly us someone being obsessed about and why, there are levels in life and how we all understand things are different, your own mindset may be different from mine because we all have different opinions and goals to achieve in life.Quote from: Lida93 on August 13, 2023, 05:32:09 PMSo lets talk about obsession (addiction) to bitcoin. I felt in a way it might help bitcoin enthusiasts like myself and others to knows  and understand in clear terms if bitcoin obsession is bad(wrong) or not.It's always good to be obsessed on something good and that is worth taking your time, but for every obsession you take on bitcoin, are you backing them up with required and necessary steps to sustain your thoughts, are you not just worrying for nothing sake, wisdom is profitable to direct, don't accumulate stress and worry about something on yourself and later get BP, take actions and be little worried.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "August 13, 2023, 06:43:59 PM",
      "body": "Quote from: Lida93 on August 13, 2023, 05:56:08 PMQuote from: SamReomo on August 13, 2023, 05:42:05 PMI don't think that our love for Bitcoin could be termed as Bitcoin obsession, but in a way it's a type of a hobby that we all want to have in our lives. Holding and trading of Bitcoin has huge impact on our lives and we can't ignore the fact that without Bitcoin we may not be able to live our lives happily. The features and all the positive aspects of Bitcoin make it a unique way for us to be attracted to it, and there is nothing like Bitcoin in the whole world.Your contribution is noted. But can you throw more light to what you mean by without bitcoin we may not be able to live our lives happily . Or do you mean  bitcoin now an agent of happiness?There are people that are happily living their lives without having an idea of bitcoin and there are also those that have adopted bitcoin and investing in it making profits and earnings but are not living happily for some reasons or the other.I haven't said about the people who aren't aware of the existence of Bitcoin because they might not even have the idea that there is something like Bitcoin in this world, but for us who know about Bitcoin and use it regularly then for us it's no less than an agent of happiness. I was talking about only those people who know the importance of Bitcoin and use it for the features it offers, and I would stick with my claim that we may not be able to live our lives happily without Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamza2424",
      "created_time": "August 13, 2023, 06:53:33 PM",
      "body": "I haven't seen any Bitcoin fan be obsessed with Bitcoin, which is termed as the driver form of gambling by OP. Also, what is the point in explaining the story of obsession with Bitcoin a person can be greedy, of impatient, or gambling with Bitcoin to make millions. Obsession reference to such cases seems very weird. I would like to continue to read the new posts on the thread haha maybe if I got lucky I can find a weird obsession story of a Bitcoin fan.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "August 13, 2023, 06:56:54 PM",
      "body": "Quote from: Lida93 on August 13, 2023, 05:32:09 PMSo lets talk about obsession (addiction) to bitcoin. I felt in a way it might help bitcoin enthusiasts like myself and others to knows  and understand in clear terms if bitcoin obsession is bad(wrong) or not.Why should someone be obsessed about BTC, i don't get it, do you mean obsessed about earning themselves BTC, are people obsessed about their fiat currencies? BTC is a currency, and people who have skills can earn BTC, or if a person earns enough in real life, they can use some of the money they make to buy BTC. People can be obsessed about what they use BTC for, traders can be obsessed with the charts and invesors might be waiting too much for a pump to happen, but why would someone be obsessed with BTC in itself.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ale88",
      "created_time": "August 13, 2023, 07:40:11 PM",
      "body": "Quote from: Lida93 on August 13, 2023, 05:32:09 PMWith obsession when it's gambling we give a strong NO with our reasons attached cause obsession is just another form of addiction. So lets talk about obsession (addiction) to bitcoin. I felt in a way it might help bitcoin enthusiasts like myself and others to knows  and understand in clear terms if bitcoin obsession is bad(wrong) or not.For me it mainly depends on the subject: I think that being obsessed with bitcoin is wrong because it's not something you have any kind of control over, I mean, of course you decide whether buying, selling or holding but if, for example, you keep checking the price every 5 minutes, that for me it is a problem. But if you are building your own business or whatever other project you are doing, so something that you control, you decide, then obsession is not necessarily bad, it just means you want to do things the best possible way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "August 13, 2023, 07:48:28 PM",
      "body": "Quote from: SamReomo on August 13, 2023, 05:42:05 PMI don't think that our love for Bitcoin could be termed as Bitcoin obsession, but in a way it's a type of a hobby that we all want to have in our lives. Holding and trading of Bitcoin has huge impact on our lives and we can't ignore the fact that without Bitcoin we may not be able to live our lives happily. The features and all the positive aspects of Bitcoin make it a unique way for us to be attracted to it, and there is nothing like Bitcoin in the whole world.Most of us are doing hard work to acquire some amount of Bitcoin while others are putting their fiat money on exchanges and converting it into Bitcoin so that they may have a better and financially stable future only because of this amazing asset. Those investors are also enthusiasts who would do every thing to accumulate Bitcoin and their main goal is to increase their Bitcoin portfolios every day.I would say that the obsession or the love we have for Bitcoin is a different kind of love than an addict has and it's really a positive type of love and using of words like addiction may not be suitable to term this thing. We are obsessed to use Bitcoin for the features it offers, and it's human nature to love all those things that free them from the bondages. Bitcoin is true freedom for an enthusiast and if someone knows that then they will always want to have Bitcoin in their lives. You forget that there are Maximalists out there who’s main purpose in life is to revere bitcoin as if it’s the second coming of christ. Then again, bitcoin was made to be an effective tool for this, so it just makes total sense for it to gain a following. But too much of a good thing is bad, and that applies to bitcoin too as much as people hate to admit it. Just take a look at Maximalists who see all cryptos as a trash can.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinPanther",
      "created_time": "August 13, 2023, 08:13:20 PM",
      "body": "Quote from: Lida93 on August 13, 2023, 05:32:09 PMWith obsession when it's gambling we give a strong NO with our reasons attached cause obsession is just another form of addiction. So lets talk about obsession (addiction) to bitcoin. I felt in a way it might help bitcoin enthusiasts like myself and others to knows  and understand in clear terms if bitcoin obsession is bad(wrong) or not.Anything that is not normal or not rational is a bad thing.  Obsession being an irrational feeling will often leads to a problem.  Since the balance is distorted, the person being obsessed can suffer stress, frustration and depression if his expectation was not met.  In short the person will find it hard to accept things if it does not go his way.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Die_empty",
      "created_time": "August 13, 2023, 09:24:20 PM",
      "body": "Quote from: Lida93 on August 13, 2023, 05:32:09 PMNow, it is undeniable and an underlying fact that bitcoin possesses multiple advantageous features spanning from anonymity, decentralization, cancellation of third party, pseudonymity, P2P etc, all encapsulated towards financial freedom.With obsession when it's gambling we give a strong NO with our reasons attached cause obsession is just another form of addiction. So lets talk about obsession (addiction) to bitcoin. I felt in a way it might help bitcoin enthusiasts like myself and others to knows  and understand in clear terms if bitcoin obsession is bad(wrong) or not.Bitcoin is just a currency or an investment. As a currency, I see it simply as a means to buy and sell goods and services. As an investment, it is where I plant my money intending to get profit in the future. Getting obsessed with bitcoin might be a sign that you are investing what you can't be able to forgo. Bitcoin has so many advantages but it is not the only thing that occupies my mind. There is a need for self-control and moderation in everything we do in life. To have confidence in bitcoin is good but to be obsessed with the currency is going to the extreme. Using or investing in bitcoin should be guided by knowledge and conscious planning and not obsession. So for me, to be obsessed with bitcoin is not ideal.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "August 13, 2023, 09:31:54 PM",
      "body": "we like Bitcoin, which is good.  We fell in love with Bitcoin, which is also good,  But,  if we got obsessed with Bitcoin, that is not good and devastating.  Obsession is always accompanied by negative results.  It is more likely being addicted to Bitcoin and we know addiction is not a good thing.  The compulsive thing will disrupt us from balance thinking, and possibly bring us financial ruin since we might use our resources to collect BTC without thinking of selling our Bitcoin when profit is seen.  Obsession especially on things often accompanied by greed and possessiveness and that is why we will try to collect and collect without thinking of selling or letting go of our collected BTC.  That will lead to our financial state imbalance and we may suffer from shortages of budget to other needs.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lousie9",
      "created_time": "August 13, 2023, 09:34:51 PM",
      "body": "Quote from: Lida93 on August 13, 2023, 05:32:09 PMWith obsession when it's gambling we give a strong NO with our reasons attached cause obsession is just another form of addiction. So lets talk about obsession (addiction) to bitcoin. I felt in a way it might help bitcoin enthusiasts like myself and others to knows  and understand in clear terms if bitcoin obsession is bad(wrong) or not.First, I think addiction and obsession are two different things, but it could be interrelated between addiction and obsession disorders. Basically, admiring anything in excess is not good for our mental health.I think it's okay to be obsessed with Bitcoin as long as we can still control our behavior, attitudes and views not to overdo it, in the sense that we don't exaggerate our thoughts about Bitcoin too much. Exaggerating here I mean like if we have thoughts and a view that only Bitcoin is the only one who can help all our economic problems, Bitcoin makes us rich quickly and fixes other problems which logically are not included in the purpose Bitcoin was created.Bitcoin can indeed help improve our finances, but we also have to be able to think rationally that all of that also depends on how we use Bitcoin and our conditions too.We should still think rationally and manage our thoughts so that they become a positive obsession, that is if we really have views and thoughts about Bitcoin as they should and not too much.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "The Cryptovator",
      "created_time": "August 13, 2023, 09:43:39 PM",
      "body": "I don't perceive obsession and addiction as identical. As you mentioned, not all addictions or obsessions are inherently negative. Take, for instance, an addiction to assisting others—it's undoubtedly positive, and you should persist. Conversely, being addicted to drugs is detrimental. Similar to this, being addicted to Bitcoin isn't harmful, but gambling can be. Occasionally, even if not actively trading, I find myself checking Bitcoin's price multiple times daily. This sort of addiction actually benefits me, aiding in decision-making.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DapanasFruit",
      "created_time": "August 14, 2023, 02:17:55 AM",
      "body": "I believe there are many levels of obsession and at a certain point when we are very much aware of what we are doing and can still be in control of things then it may never be harmful. Having some faith on something that we know is a game-changer in many aspects and being a part of its adoption and dissemination is very much alright with me. Maybe not being to sleep well thinking what can happen with BTC the day after is something that I discourage as it is not anymore normal. The key here is normalcy...beyond that is something that one must be addressing squarely. For example, it one's love with Bitcoin is already interfering with your marital life then it is time to talk to your wife and transfer your BTC to her as soon as possible as she can be a better manager of your holding - just kidding.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "fuguebtc",
      "created_time": "August 14, 2023, 03:11:44 AM",
      "body": "Quote from: Lida93 on August 13, 2023, 05:56:08 PMQuote from: SamReomo on August 13, 2023, 05:42:05 PMI don't think that our love for Bitcoin could be termed as Bitcoin obsession, but in a way it's a type of a hobby that we all want to have in our lives. Holding and trading of Bitcoin has huge impact on our lives and we can't ignore the fact that without Bitcoin we may not be able to live our lives happily. The features and all the positive aspects of Bitcoin make it a unique way for us to be attracted to it, and there is nothing like Bitcoin in the whole world.Your contribution is noted. But can you throw more light to what you mean by without bitcoin we may not be able to live our lives happily . Or do you mean  bitcoin now an agent of happiness?There are people that are happily living their lives without having an idea of bitcoin and there are also those that have adopted bitcoin and investing in it making profits and earnings but are not living happily for some reasons or the other.@SamReomo, you need to stay awake and live in reality rather than being too delusional and daydreaming. Bitcoin is also just money, a tool that gives us the opportunity to earn more money and of course, when we have a lot of money, we will be happy. But bitcoin is not the only tool for us to make money, hundreds of billionaires out there have made money, have been happy without knowing what bitcoin is. Not to mention not everyone who invests in bitcoin is profitable. One more thing, how old are you, and how many years have you known bitcoin? And years ago when you didn't know about bitcoin, you were never happy?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Uruhara",
      "created_time": "August 14, 2023, 03:19:09 AM",
      "body": "I am indeed interested in Bitcoin but at first I was not too obsessed with Bitcoin. It's just that there were times when I thought too much about Bitcoin. Especially when it comes to Bitcoin investment. I browsed and found out more about Bitcoin. But in the end I only consider Bitcoin as a potential and suitable digital asset to be used as a long-term investment. I like the decentralization that bitcoin has but for now I'm honestly focused on wanting to profit in the future.Being too obsessed with something can sometimes be bad or it can be good. Depends on what things we obsess over. And if it's about Bitcoin obsession then I think it could be a good thing if it encourages someone to learn more about Bitcoin before investing. Or it could be a good thing if eventually he becomes obsessed with learning the system that bitcoin has adopted and starts to become a developer in this regard.But if someone is obsessed with Bitcoin because they just want to get quick profits. Then it is not good.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}