{
  "id": "topic_5436398",
  "title": "altair_tech",
  "author": "altair_tech",
  "created_time": "January 22, 2023, 10:08:50 PM",
  "content": "Bitmain used Xilinx, BeagleBone and AMLOGIC control boards on S19 series of miners. Three different makes created a lot of hassles for anyone trying to overclock, run aftermarket firmware etc. It appears that they have now introduced a 4th model to the mix and this one looks like a Bitmain in-house design. It's the CV1835 board. One of our recent S19 XP came with this board. more pictures here. Needless to say that more board designs will create more hassles for miners, firmware developers, and resellers. Buyers often want to purchase machines with specific CBs and there's no way to tell until you open the factory-sealed box. I'm looking to understand Bitmain's rationale behind using so many different CB models from others here. It can't be a shortage of Xilinx boards, because Bitmain has had those on sale on their website for a long time and people can purchase as many as they like. Is this just an attempt to thwart the development of aftermarket firmware?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5436398",
  "comments": [
    {
      "author": "DaveF",
      "created_time": "January 22, 2023, 10:24:37 PM",
      "body": "I'm going with cost. Every dollar they save in making the boards is another dollar in their pocket. And, odds are they are not making them. The put out a RFQ for a board with whatever specifications they are looking for and then go with the cheapest bid. Would not be surprised if the cost of tweaking their code to work with the new board is included in the quote.No different then me having 3 of the exact same model Dell monitors in my office that were made by different companies and Dell just put their logo on it.Dell don't care since the specs are all the same, or at least supposed to be the same you can see a difference but according to the website it's the same.Home routers are also the same a lot of the time. Rev A Rev B Rev D and so on. Take them apart and they look nothing alike. But they are all the same model number and look the same on the outside.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mikeywith",
      "created_time": "January 24, 2023, 01:10:43 AM",
      "body": "alas, all of these mining manufacturers do the same stupid stuff every single day, MicroBT does something similar with their PSUs, they have a dozen of models, some output 12V some 14V, and in every voltage rating you got a handful of models, many are not cross-compatible, you ask the manufacturer at PSU model I am going to get? they will give you the same stupid answer that Bitmain gives \"it's a surprise, you need to open the box first\".So after buying a dozen gears of the same model, you will end up with a dozen different PSUs that aren't cross-compatible, and it's a nightmare when it comes to spare parts.I think I agree with Dave, it's all about the cost for all of these cheap manufacturers, if Bitmain finds another way to make a cheaper CB, they will add a 5th model to the same miner.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hashhorizon224",
      "created_time": "January 24, 2025, 08:54:54 PM",
      "body": "Has anyone had success with a fan spoofer for these boards?  I'm having a hell of a time finding something compatible.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CochnocherCrypto",
      "created_time": "February 10, 2025, 06:44:27 AM",
      "body": "noticed that as well... All of the 19K Pro's I sourced from you guys back in late 2023/early 2024 shipped with AMLogic boards - all of the S19's I've grabbed recently have shipped with the CV control board. I'd agree with what some of the others have said here - my gut-feeling is that it all boils down to cost.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}