{
  "id": "topic_5536004",
  "title": "Mrbluntzy",
  "author": "Mrbluntzy",
  "created_time": "March 22, 2025, 02:34:42 PM",
  "content": "Some people buy Bitcoin and they hold for a long time so that when the price push up, they will sell and rejoice in profit, while some people are trading Bitcoin, they are buying and selling almost instantly to get profit on a short time. I really want to know whom you guys refer to as investors, is it a person that buys and keeps buying through out the bear season with his intention to sell in bull market season OR you refer investors as the person that trade Bitcoin repeatedly for short time profit? Can both of them be seen investors and for what reason?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5536004",
  "comments": [
    {
      "author": "Charles-Tim",
      "created_time": "March 22, 2025, 02:43:19 PM",
      "body": "Bitcoin investors are people that bought bitcoin and leave it for months (short term investors) or years (long term investors). They do not buy and sell bitcoin instantly.Traders buy and sell bitcoin within short period of time like within few weeks or as short period not of time as a day, some hours or some minutes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "seoincorporation",
      "created_time": "March 22, 2025, 02:46:19 PM",
      "body": "Traders and investors are not the same, those Who buy and hold are not Traders they are investors, the Traders used to move their money and follow the markets, if the price is up they sell and wait the price goes down to buy again, while holders just keep their coins for a long term.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Charles-Tim",
      "created_time": "March 22, 2025, 02:57:28 PM",
      "body": "Quote from: seoincorporation on March 22, 2025, 02:46:19 PMTraders used to move their money and follow the markets, if the price is up they sell and wait the price goes down to buy again, while holders just keep their coins for a long term. Holders also can buy at low price, be patient and sell at a very high price during bull market. They even have the highest success rate. Everyone that is holding bitcoin since September 2024 are all still in profit right now and they can sell at high price. Unlike traders that will think to buy at low price and sell at high price but impatience makes them buy at prices that the coin will continue to fall. Traders have high fail rate. Most traders are losing. Which means they buy at high price and sell at low price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Helena Yu",
      "created_time": "March 22, 2025, 02:57:58 PM",
      "body": "Yeah traders can become investors when they're in that situation, I also in that situation because the altcoins I bought is still floating loss until now, my intention is to buy and sell in less than a week, but I have hold the coins like 2-3 months.When the traders unintentionally become investors, it means they're bad traders, they don't know when to take profit and when they have to cut loss.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "HeRetiK",
      "created_time": "March 22, 2025, 02:59:30 PM",
      "body": "Investors make money via long term appreciation, ignoring short term fluctations.Traders make money via short term fluctuations, ignoring long term appreciation.The difference is quite distinctive, though many people act as a bit of both, blurring the border a bit.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Frankolala",
      "created_time": "March 22, 2025, 03:01:30 PM",
      "body": "Traders are after quick profits from the market fluctuation, they can sell anytime they see little profits. Investors are those who hold their bitcoin for at least one circle and they are after long-term profits. Trading is very risky compared to investing because the market can go against you at anytime. A trader is not an investor but some traders don't know that they're traders. They call themselves investors.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitzizzix",
      "created_time": "March 22, 2025, 03:10:02 PM",
      "body": "Trading and investment are two different concepts.Trading is a term used by traders who aim to make a profit in a short time by buying and selling it again in the near future or short term such as minutes, hours, weeks or months with any profit and if you are lucky and have large capital then the profit you will get will also be large. However, being a trader tends to have a higher level of risk compared to investing, because trading is very dependent on and takes advantage of existing fluctuations and also to do it you must really have full time to observe the market in order to make purchases and sales at the right time.And investors are investments made for the long term that take years, dozens of years or even tens of years just to get very large profits by making periodic purchases or buying when the price is down and holding it for the long term and this is called an investor. And an investor will have a lower risk, which in my opinion is not risky at all because a new investor will take action to sell when they have made a very large profit without considering time and the market and if it is not as profitable as desired they will continue to hold it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hazink",
      "created_time": "March 22, 2025, 03:13:54 PM",
      "body": "From your own definition and explanation it's already clear that if you buy and sell instantly, you belong to the traders group. Investing in something means you will allow it to mature before you take off your investment profit, and it doesn't take instantly; it's something that takes a little bit of time, either months or weeks, which is why we have long- and short-term investors. Those who buy and hold are investors, and traders sell instantly or almost instantly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "March 22, 2025, 03:20:35 PM",
      "body": "Quote from: Mrbluntzy on March 22, 2025, 02:34:42 PMSome people buy Bitcoin and they hold for a long time so that when the price push up, they will sell and rejoice in profit, while some people are trading Bitcoin, they are buying and selling almost instantly to get profit on a short time. I really want to know whom you guys refer to as investors, is it a person that buys and keeps buying through out the bear season with his intention to sell in bull market season OR you refer investors as the person that trade Bitcoin repeatedly for short time profit? Can both of them be seen investors and for what reason? It is still an investment practice and they are still investors. It's just they start in a bear market and don't have too long vision for their investment and portfolio than a next bull market. Anyway there is nothing wrong with investment your money in Bitcoin and maintain it only within one market cycle.They are doing DCA, starting in a bear market, maintaining it for months and planning to take profit, making their withdrawals in a bull market. It's good.Are you ready for the Bitcoin bull market? What's your plan? Some ideas for youDCA vs Smart DCA, what do you choose?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "March 22, 2025, 03:32:00 PM",
      "body": "Quote from: dzungmobile on March 22, 2025, 03:20:35 PMIt is still an investment practice and they are still investors. It's just they start in a bear market and don't have too long vision for their investment and portfolio than a next bull market. Anyway there is nothing wrong with investment your money in Bitcoin and maintain it only within one market cycle.How about those who focus only on spot trading, both in a bear and bullish market? They are just in for short-term profit; they buy and sell almost in an instant with little price change and take whatever profit they can get and reopen another trading position. Are they also considered to be investors? Or as long as you put in your money and time in return for profit, you are automatically an investor?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dzungmobile",
      "created_time": "March 22, 2025, 03:38:06 PM",
      "body": "Quote from: Nwada001 on March 22, 2025, 03:32:00 PMHow about those who focus only on sports tradingSports or Spot?Quoteboth in a bear and bullish market? They are just in for short-term profit; they buy and sell almost in an instant with little price change and take whatever profit they can get and reopen another trading position. Are they also considered to be investors? Or as long as you put in your money and time in return for profit, you are automatically an investor?May you stay on topic, please.OP asked about buying in bear market and selling in bull market, is it investment?In my opinion, it is because the accumulation time and holding time is long enough. No exact number because a bear market lasts long enough, and with different entry time in a bear market, you will have different holding time compares to other people who buy earlier or later than you.You don't need to buy and hold your bitcoin more than 5 years to be considered as a Bitcoin investor.https://hodl.camp/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "March 22, 2025, 03:39:08 PM",
      "body": "Quote from: Mrbluntzy on March 22, 2025, 02:34:42 PMSome people buy Bitcoin and they hold for a long time so that when the price push up, they will sell and rejoice in profit, while some people are trading Bitcoin, they are buying and selling almost instantly to get profit on a short time. I really want to know whom you guys refer to as investors, is it a person that buys and keeps buying through out the bear season with his intention to sell in bull market season OR you refer investors as the person that trade Bitcoin repeatedly for short time profit? Can both of them be seen investors and for what reason? Traders can be call investors also, the difference that lies between a trader and someone investing to hold is only the duration of time involved, an investor will find a perfect entry position to buy the market at dip and hold till the market rises before selling, this may take a longer time as the market may be volatile as usual, while a trader is such that uses that same bitcoin with other currency pairs for trading against each other, this can also be on a short or long term trading depending on the kind of trade such person is doing, so investment is strictly on bitcoin while trading involves two currencies in pairs against each other, but at the end, we can say one is a trader and the other an investor, and it is still right to call a trader and investors, because he is using his bitcoin invested upon to trade other currencies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "March 22, 2025, 03:44:01 PM",
      "body": "Quote from: Charles-Tim on March 22, 2025, 02:43:19 PMBitcoin investors are people that bought bitcoin and leave it for months (short term investors) or years (long term investors). They do not buy and sell bitcoin instantly.Traders buy and sell bitcoin within short period of time like within few weeks or as short period not of time as a day, some hours or some minutes. Investors are not limited to long-term investments, there are also called short-term investments where traders fall in.  Before a trader starts his trading career he needs to invest money in the item he wants to trade and for this instance Bitcoin. If we can't consider the money spend by traders in buying their initial item for trading as an investment then what can we call that thing?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Churchillvv",
      "created_time": "March 22, 2025, 03:44:43 PM",
      "body": "Charles already made a clear difference but then let me add my 2 cents opinion: Traders are gamblers... in gambling you don't want for your risk to get mature you are even afraid it may go against your odds immediately same as trading you don't spend much time on its but hang around watching it sometimes not even up to a day (24hrs) while investors even take decades to reap or even take the profit. Hence the clear difference is there a trader is no investor and investors can be a trader but a trader is not an investor. it's not Viz vice not vice versa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Nwada001",
      "created_time": "March 22, 2025, 03:57:57 PM",
      "body": "Quote from: dzungmobile on March 22, 2025, 03:38:06 PMQuote from: Nwada001 on March 22, 2025, 03:32:00 PMHow about those who focus only on sports tradingSports or Spot?Quoteboth in a bear and bullish market? They are just in for short-term profit; they buy and sell almost in an instant with little price change and take whatever profit they can get and reopen another trading position. Are they also considered to be investors? Or as long as you put in your money and time in return for profit, you are automatically an investor?May you stay on topic, please.OP asked about buying in bear market and selling in bull market, is it investment?In my opinion, it is because the accumulation time and holding time is long enough. No exact number because a bear market lasts long enough, and with different entry time in a bear market, you will have different holding time compares to other people who buy earlier or later than you.You don't need to buy and hold your bitcoin more than 5 years to be considered as a Bitcoin investor.https://hodl.camp/I mean spot...  It was a typo error, corrected now, thanks.I understand the point you are making, but reading from the OP, in his first paragraph, he talks about buying and selling almost in an instant if the person is also considered an investor, which switching from a bear to a bull market doesn't just happen in minutes, which is where my question came from. And yes, I also know that one doesn't need to hold for a circle and above before they can be considered an investor, but still the selling shouldn't be in an instant, and that's the point I was trying to make and also asking my question.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbe",
      "created_time": "March 22, 2025, 03:59:40 PM",
      "body": "Quote from: Frankolala on March 22, 2025, 03:01:30 PM...but some traders don't know that they're traders. They call themselves investors.  Tell us one trader that doesn't know that he is a trader. And tell us the dichotomy of the both trader and investor with different tools used you know. I know where you are going and you have not make it clear for everyone in the forum bro know that yes you are talking about trading. Please I will want you to reread Charles -Tim first comment again and again to understand what is investment all about. Which I will quote it it again for you. There is Short Term and long term investment and short term investment is not trading because they are using different tools and methods. Now in short term investment tools are: either self custodial wallets or custodial wallets and why the investor used self custodial wallets is because they are not sure what will happen in that short period of time and they Short period can be a 2 months to 1 year or more and I strongly believed that is where you are saying that he is trader who doesn't know that he is one. Now if he is trader what are the tools he used? In trading the trader used custodial wallet and not self custodial wallets or non custodial wallets, he used market candle sticks, he used TP/SL, they used charts, timing, lines, indicators support/resistance and this resistance is one of the major tool traders use, you can see it from the images.You can see the time here.So in what sense or ways are you bringing investment to trading? Also provide the tools as well so we can clearly know the differences. And as I said investment is short term and long term and you are indirectly saying that those who are investing for short term are traders, how? In which tools are you using to to give this statement?Please can you see this as well. Are you saying he is wrong? If no, then who are those that don't know they are traders you are referring to?Quote from: Charles-Tim on March 22, 2025, 02:43:19 PMBitcoin investors are people that bought bitcoin and leave it for months (short term investors) or years (long term investors). They do not buy and sell bitcoin instantly.Traders buy and sell bitcoin within short period of time like within few weeks or as short period not of time as a day, some hours or some minutes. Did you see those tools I mentioned in investment? Traders are not called investors because they are different businesses. But you are merging them together by your statement, \" some traders don't know that they are traders\", meaning they are investors but in form of traders. Because they are using short term investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fara Chan",
      "created_time": "March 22, 2025, 04:05:36 PM",
      "body": "Quote from: Mrbluntzy on March 22, 2025, 02:34:42 PMSome people buy Bitcoin and they hold for a long time so that when the price push up, they will sell and rejoice in profit, while some people are trading Bitcoin, they are buying and selling almost instantly to get profit on a short time. I really want to know whom you guys refer to as investors, is it a person that buys and keeps buying through out the bear season with his intention to sell in bull market season OR you refer investors as the person that trade Bitcoin repeatedly for short time profit? Can both of them be seen investors and for what reason? Although both have the same goal of making a profit through Bitcoin, only one of them is worthy of being called an investor because the other one is clearly visible through the actions he does himself every time, which is trading with Bitcoin so he is only worthy of being called a trader not an investor in Bitcoin although the person could be an investor in other assets, but in this case (for Bitcoin) he is only suitable to be called a trader. Meanwhile, those who like to buy Bitcoin and store it for the long term are indeed suitable to be called investors because these people are not so tempted by small profits through Bitcoin price movements in the market, even though in the end they will also sell Bitcoin to gain more profits at the moment of a much greater price increase in Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "March 22, 2025, 04:11:03 PM",
      "body": "Quote from: Hazink on March 22, 2025, 03:13:54 PMFrom your own definition and explanation it's already clear that if you buy and sell instantly, you belong to the traders group. Investing in something means you will allow it to mature before you take off your investment profit, and it doesn't take instantly; it's something that takes a little bit of time, either months or weeks, which is why we have long- and short-term investors. Those who buy and hold are investors, and traders sell instantly or almost instantly.Oxford Dictionary defines an investor as:Quotea person or organization that puts money into financial schemes, property, etc. with the expectation of achieving a profit.From the above definition, both Bitcoin traders and holders are investors. However, it is generally perceived in the Bitcoin space that those who keep Bitcoin for a long time are investors. These set of people don't need to always monitor Bitcoin prices daily. But traders have the intention of selling anytime the price favours them. They usually monitor the market almost everytime to check when they can buy or sell.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Queentoshi",
      "created_time": "March 22, 2025, 04:22:57 PM",
      "body": "Quote from: Mrbluntzy on March 22, 2025, 02:34:42 PM I really want to know whom you guys refer to as investors, Dictionary meaning is very clear on who an investor is and also who a trader is. A trader can be an investor, but it is not through the trading that they engage in that they are called investors but having to buy cryptocurrency assets and store for a long time in expectation that the value increases with time. Buying and waiting for the value of your purchased cryptocurrency to increase in time without any direct action of yours other than trying to keep it safe is what is referred to as investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}