{
  "id": "topic_5415224",
  "title": "dkbit98",
  "author": "dkbit98",
  "created_time": "September 28, 2022, 03:10:06 PM",
  "content": "I am currently testing cool new app called BTCMap that is using open source dataset provided by OpenStreetMap, and it can be used as web app or as apps on Android and iOS devices.You can easily find places to spend sats anywhere on earth and you can contribute by adding new locations or correcting mistakes with current locations. It's not perfect and I see lot of space for improvements, but as they say - FOSS for the win, google maps in the bin Website: https://btcmap.org/Github: https://github.com/teambtcmapPlease test this this app and post your suggestions.I am not affiliated with BTCMap in any way, but I like the project and I like what they are doing.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415224",
  "comments": [
    {
      "author": "NeuroticFish",
      "created_time": "September 28, 2022, 04:06:43 PM",
      "body": "Quote from: dkbit98 on September 28, 2022, 03:10:06 PMIt's not perfect and I see lot of space for improvements, but as they say - FOSS for the win, google maps in the bin LOL!I've installed it onto my Android and.. since I don't really have too many places where to use it or to add, I will start criticizing:* It should exist on Google Play store and the page should show a link to that. Many won't just install APK, also people expect Android just install the updates.* The places need somewhat better description and easier to access (maybe half of the page filled with the info instead of expecting click onto the business name)But I don't deny it, it's a pleasant app and a good start (I see it's pretty young).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitMaxz",
      "created_time": "September 28, 2022, 04:15:11 PM",
      "body": "An interesting app I tried it today but sadly some stores are from my current location but it is still a good app I saw some stores that accept Bitcoin but a bit far 3 hours if I commute to those stores. It seems that Bitcoin is not fully developed here in my country unlike in other countries like Japan.Another thing that I notice is that the map is loading very slow I think they need to improve and optimized the map to speed up the loading map process or I think if they can host it to a faster one like DigitalOcean or Google cloud it might improve the loading speed of the map.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "September 29, 2022, 07:15:22 AM",
      "body": "It's a plan to find out people who are using bitcoin. They don't look for usd paying stores.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "joniboini",
      "created_time": "September 29, 2022, 10:10:49 AM",
      "body": "A bit confused about the location submission. Does it mean users can only report a new store but will have to wait for the team to update the map? It sounds like that from the add location page. Would be awesome if it automatically shows up on the map and others can verify instead.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 29, 2022, 10:15:40 AM",
      "body": "Quote from: joniboini on September 29, 2022, 10:10:49 AMA bit confused about the location submission. Does it mean users can only report a new store but will have to wait for the team to update the map? It sounds like that from the add location page. Would be awesome if it automatically shows up on the map and others can verify instead.If it would be automatic it would open the door to abuses, from companies added without accepting Bitcoin (in order to advertise them for free) to opponents removing legit companies just because they can.The team acting as mediator in add and remove operations is imho a must.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "September 29, 2022, 01:38:29 PM",
      "body": "Quote from: NeuroticFish on September 28, 2022, 04:06:43 PMIt should exist on Google Play store and the page should show a link to that. Many won't just install APK, also people expect Android just install the updates.Google Play store is not any guarantee or protection, and you can install BTCMap directly from github or by using Fdroid store that only contains open store apps.You don't even have to install anything if you use web app from your browser and just bookmark page.Quote from: BitMaxz on September 28, 2022, 04:15:11 PMAnother thing that I notice is that the map is loading very slow I think they need to improve and optimized the map to speed up the loading map process or I think if they can host it to a faster one like DigitalOcean or Google cloud it might improve the loading speed of the map. This could be related with OpenSteetMap that is not going to be fast as Gmaps, but it would be counter productive to use Google clous when you are want to ditch google all together Quote from: joniboini on September 29, 2022, 10:10:49 AMA bit confused about the location submission. Does it mean users can only report a new store but will have to wait for the team to update the map? It sounds like that from the add location page. Would be awesome if it automatically shows up on the map and others can verify instead.I didn't add any location yet so I don't know how everything works exactly.If I understand correctly, some volunteer will check if application was correct and they will approve it or not.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NeuroticFish",
      "created_time": "September 29, 2022, 01:55:30 PM",
      "body": "Quote from: dkbit98 on September 29, 2022, 01:38:29 PMQuote from: NeuroticFish on September 28, 2022, 04:06:43 PMIt should exist on Google Play store and the page should show a link to that. Many won't just install APK, also people expect Android just install the updates.Google Play store is not any guarantee or protection, and you can install BTCMap directly from github or by using Fdroid store that only contains open store apps.You don't even have to install anything if you use web app from your browser and just bookmark page.I guess that you've missed my point. This is not about you and me, we can handle an APK. But many will not touch it if it's not from Google Play. They will not enable this or that app install \"from unknown sources\". It's not about the real protection, it's about what's in-built in the Android phones and how it's that perceived (install from unknown sources sounds dangerous)Plus: the automatic updates, as I said.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 03, 2022, 07:05:02 PM",
      "body": "Quote from: NeuroticFish on September 29, 2022, 01:55:30 PMI guess that you've missed my point. This is not about you and me, we can handle an APK. But many will not touch it if it's not from Google Play. They will not enable this or that app install \"from unknown sources\". It's not about the real protection, it's about what's in-built in the Android phones and how it's that perceived (install from unknown sources sounds dangerous)Plus: the automatic updates, as I said.I understand what you are saying, but I will repeat again that BTCMap app is focused more on de-googling everything, and it doesn't want to depend at all on any google services.It's perfectly possible to use android phones without google store, first alternative is Aurora Store that you can use without real google mail account.Maybe BTCMap will release version version for Google store in future or you can make request for this, but like I said FDroid works very good and it auto-updates everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DaveF",
      "created_time": "October 04, 2022, 12:00:15 PM",
      "body": "Where are you getting the data from? It looks like it's a pull from coinmap.org which is very outdated, at least where I am in Long Island, NY. There are a bunch of places that no longer take BTC listed there, that it looks like you have listed. Or are you both pulling from someplace else that I don't know about?And you are also missing as are a lot of ATMs, none of the LibertyX are there.-Dave",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "October 04, 2022, 07:32:12 PM",
      "body": "Quote from: DaveF on October 04, 2022, 12:00:15 PMWhere are you getting the data from? It looks like it's a pull from coinmap.org which is very outdated, at least where I am in Long Island, NY. There are a bunch of places that no longer take BTC listed there, that it looks like you have listed. Or are you both pulling from someplace else that I don't know about?I am not getting any information and I already said that I am not connected with BTCMap in any way I don't know what exact sources they are using but I guess it's multiple websites, and you can always add suggestion to correct and update any mistakes you saw.Everything for BTCMap is open source, so this sources could probably be found on their github page.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitum",
      "created_time": "October 05, 2022, 06:51:48 PM",
      "body": "I just looked browser version and tested my city in my country. The locations that I know were displayed. I even found a few that I don't know. One location is even very close to where I work. If the database of locations is constantly expanding, I would definitely use it from time to time. I want to install the app now and try the mobile version in the next few days. And, what was already written above, ATM's would be very useful",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SFR10",
      "created_time": "October 06, 2022, 06:41:01 PM",
      "body": "Quote from: dkbit98 on September 28, 2022, 03:10:06 PMand it can be used as web app or as apps on Android and iOS devices.Looks like they're still looking for an iOS developer [source] to help them with the latter part.Quote from: BitMaxz on September 28, 2022, 04:15:11 PMAnother thing that I notice is that the map is loading very slowPerhaps you weren't viewing it with the default OpenStreetMap map tile [e.g. Watercolor, Imagery and other map tiles usually have slow loading speeds in comparison to OpenStreetMap]./Bookmarked",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}