{
  "id": "topic_5471940",
  "title": "Riginac111",
  "author": "Riginac111",
  "created_time": "October 27, 2023, 08:16:43 PM",
  "content": "For investment of Bitcoin I think it's good to invest with your own money instead of using a borrowed money because of the risk and disadvantages in the investment, if you want to invest in Bitcoin I think that you should use what you can be able to afford to loss for the investment. some of us who is new in Bitcoin investment have seen Bitcoin like a source of making money, and not knowing that Bitcoin invest have disadvantages and advantages, so using a borrowed for investment is a highest risk so far, so I will advice even our people who is coming to invest never to borrow money for a risk investment despite that theirs no investment that is not risky but we should amend our ways and know that Bitcoin investment is something you invest and forget about it for long time.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5471940",
  "comments": [
    {
      "author": "Ever-young",
      "created_time": "October 27, 2023, 08:40:49 PM",
      "body": "Eh really they very risky for person to invest with money way no be in own for any asset way they like bitcoin way you no fit predict Watin the price go be for future, if person borrow money say in wan carry buy bitcoin him fit just they for that debt forever if the person no take time, because you fit borrow come buy today and the price go just drop down after you buy and you buy with hope say in the next few days or month you go sell pay back, but as you they wait for the market to run up small so that you fit make gain way you go carry sell off, nah so the market go they dip the more and the more you they wait nah so the loan way you take they increase. The only place way eh fit they small advisable for person to take money way no be in own buy bitcoin nah fit you already hey means to carry pay the debt back and you no they put your payment plan for profit way they come from the bitcoin, that’s if you they expect money way you they sure off at the end of the month and this money you plan to carry am buy bitcoin, but the price come drop to where you plan to buy you fit take money from person buy that money then pay back immediately the money way you they expect enter to they on the safer side.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Egii Nna",
      "created_time": "October 27, 2023, 09:03:07 PM",
      "body": "Quote from: Riginac111 on October 27, 2023, 08:16:43 PMFor investment of Bitcoin I think it's good to invest with your own money instead of using a borrowed money because of the risk and disadvantages in the investment, if you want to invest in Bitcoin I think that you should use what you can be able to afford to loss for the investment. some of us who is new in Bitcoin investment have seen Bitcoin like a source of making money, and not knowing that Bitcoin invest have disadvantages and advantages, so using a borrowed for investment is a highest risk so far, so I will advice even our people who is coming to invest never to borrow money for a risk investment despite that theirs no investment that is not risky but we should amend our ways and know that Bitcoin investment is something you invest and forget about it for long time.That is why I always say you should not take bitcoin as a do-or-die affair. You shouldn’t take the risk that it will be very hard for you to talk less of borrowing money to invest in bitcoin, but the reason people usually end up borrowing is due to the Nigerian situation, in which I can say if the money you borrowed can be paid back yourself without any stress, then you are good to go because talking risk is just the definition of hustle. But mind you, even though you are taking the risk, take the risk that you can endure. Even though you lose, you will not end up broke or fall into suffering.And again, they say that the higher the risk, the higher the gain, while the lower the risk, the lower the gain, which means when you are borrowing money to invest. You are embarking on a very high risk, and we don’t know what the result will be, so I will just advise you to say if you can take the risks, take them; it might be your success, but don’t take any risk just to prosper; you might fall or lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Honyek",
      "created_time": "October 27, 2023, 09:03:33 PM",
      "body": "Bitcoin investment is not always good to borrow money for its investment, but one can choose to borrow sometimes depending on the situation of things at that particular time. Business is full of risk, likewise investment, and bitcoin investment is just like any other investments which are open to risk. So, if one can borrow money for other investments, there is nothing wrong with making such trial.  l think the most important thing is being very careful, and knowing a lot about bitcoin, and its record, and then know exactly the right time to make such investment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Majestic-milf",
      "created_time": "October 27, 2023, 09:19:34 PM",
      "body": "Quote from: Riginac111 on October 27, 2023, 08:16:43 PMFor investment of Bitcoin I think it's good to invest with your own money instead of using a borrowed money because of the risk and disadvantages in the investment, if you want to invest in Bitcoin I think that you should use what you can be able to afford to loss for the investment. Bitcoin is not a get rich quick scheme to put in money and expect huge returns so using borrowed money is not an option. E no get how e wan be, with the rate at which e dey volatile, e get the tendency to incur one loss pass the gain wey dey expected nai make e dey advised say if you dey look to invest in Bitcoin, use money wey you fit part with. Bitcoin investment is like gambling, and as such you no go fit carry money you don set aside for something important like say school fees, house rent or even people contribution do am, make e no go purge you later on. Except this advise is to newbies, I no sure say e dey necessary to point am out because such investment nah 50-50 and the chance of coming out the loser if you be bad trader dey high, so why incur more debt if things go south?People go dey tempted to put money into investing in Bitcoin especially as price dey go up fast and fit think to risk the borrowed fund but just as e sharparly rise, tendency to drop dey too.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptSafe",
      "created_time": "October 27, 2023, 09:33:25 PM",
      "body": "It is not advisable to borrow money for bitcoin investments because of the nature of bitcoin volatility. No one can predict the market trend. To talk about it, there is a saying that one should \"invest what they can afford to lose\" and also \"invest with their spare cash\". There are reasons why these phrases were formulated, and they stand as enlightenment and caution to the traders who are very much engaged in trading activities, but the newbie traders are mostly advised to take cognizance of them so as to be guided while trading or investing.Borrowed money does not belong to you, and I believe repaying it comes with interest on it. If it happens that after borrowing to invest in bitcoin, the price drops below your expectations, that would be a problem because you, as the borrower, would depend on the profit from the investment, and I believe there is a stipulated time of repayment. What if the bitcoin market does not pick up before that time to pay it back? What would happen to the borrower? Or do you expect the lender to wait for your bitcoin investment to grow before you pay it back with interest on top? A big no.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Davidvictorson",
      "created_time": "October 27, 2023, 10:22:41 PM",
      "body": "This is a good reminder that is very timely. Now that the price of Bitcoin has gone up and knowing the halving event is around the corner. We know a Nigerian mentality we want to cash out so if you'd go borrow money. What is loan sharks and respect that they will be able to pay back only to be disappointed in the end. E better say make you borrow the money from your papa and mama than to borrow from outsiders.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Jegileman",
      "created_time": "October 27, 2023, 11:40:31 PM",
      "body": "This reminder dey very important and for bringing it up again for our people here to know dey very good. Dis one no be for only newbies sha but for everybody. Dey get some people wey go don master dis bitcoin trading and go still wan like borrow money to put inside because dey feel say he go big bring money back for dem, make dem no try am because d money go just go like dat if d market move on a downtrend the time wey e put money inside. D market dey volatile and if you want or even if you no wan invest for long time, no use borrowed money to put inside for dis investment. You fit lose everything all to market volatility one day just like that.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hatchy",
      "created_time": "October 28, 2023, 09:22:07 AM",
      "body": "Quote from: Riginac111 on October 27, 2023, 08:16:43 PMFor investment of Bitcoin I think it's good to invest with your own money instead of using a borrowed money because of the risk and disadvantages in the investment, if you want to invest in Bitcoin I think that you should use what you can be able to afford to loss for the investment. some of us who is new in Bitcoin investment have seen Bitcoin like a source of making money, and not knowing that Bitcoin invest have disadvantages and advantages, so using a borrowed for investment is a highest risk so far, so I will advice even our people who is coming to invest never to borrow money for a risk investment despite that theirs no investment that is not risky but we should amend our ways and know that Bitcoin investment is something you invest and forget about it for long time.If someone has a reason to borrow money, he or should have a substantial way of paying back the Money. It will be wrong to borrow money to invest in Bitcoin and then you are unable to pay back hoping that you will make quick profits to enable you pay back. Bitcoin we all know is volatile investment with it's price  fluctuating. If one must invest in Bitcoin and hope to gain profit, he should consider a long term investment and using your own funds would be more appropriate in this regards",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Agbamoni",
      "created_time": "October 28, 2023, 09:29:21 AM",
      "body": "Quote from: Jegileman on October 27, 2023, 11:40:31 PMThis reminder dey very important and for bringing it up again for our people here to know dey very good. Dis one no be for only newbies sha but for everybody. Dey get some people wey go don master dis bitcoin trading and go still wan like borrow money to put inside because dey feel say he go big bring money back for dem, make dem no try am because d money go just go like dat if d market move on a downtrend the time wey e put money inside. D market dey volatile and if you want or even if you no wan invest for long time, no use borrowed money to put inside for dis investment. You fit lose everything all to market volatility one day just like that.My broda there is nothing like master Bitcoin trading o. Even professionals they lose money, make bad luck no just fall on person side nah why they bring up tthis matter. Because iof you con borrow money to go trade then bad luck com reach your side say you loose. Nah double wahala you go they. And e go pain you well, how you wan take explain to person say the problem wey you they wey make you go borrow money to go trade you even solve am you still come they on two problems now. Hmm, if you no get money to trade just lock up whenever your personal money come you fit go trade am, if you lose e no go pain but as nah your money you no go too they panic. I like as you talk true. Imagine say you lose person 1.5 million naira for trading how you wan take put mouth beg am to pay the debt and still pay interest on top.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "adultcrypto",
      "created_time": "October 28, 2023, 10:26:26 AM",
      "body": "I learnt the hard way in this area of investment. I remember when MMM been dey reign,  many of us been make this mistake of investing with money that is not our own. Some people took loan from bank and even juju. No be small thing o. If MMM no fit teach person something, I don't know wetin go make them learn. Anything investment should be with personal funds not borrowed funds. It does not always work out fine when you dey manage another person money. There is always risk involved in any investment and it is not safe putting another person's money into risk.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rachael9385",
      "created_time": "October 28, 2023, 12:27:38 PM",
      "body": "I believe say almost everybody for here more especially we Nigerians already know say no be better try to us borrowed money take invest inside Bitcoin, although, e get some kind of people way go like to try use person money or money way em borrow to use invest but for sure, no be better try be that.I dey always dey talk am right from time to time say, e no dey good to use money way person borrow you take invest for Bitcoin because possiblities dey say the capital way the person invest to dry off like water way them throw away for desert, so if investor use their own hard earned money take invest for Bitcoin and Bitcoin no profit am anything, then no body go harass am because nah em money and nah em decision.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Promocodeudo",
      "created_time": "October 28, 2023, 02:30:18 PM",
      "body": "I agree with you on this op, it is not a good idea to invest in Bitcoin with a borrowed fund when you are investing in anything apart from Bitcoin itself it doesn't make sense to invest with any money in your care or even borrowed money, is just like taking two risks at a time, when you lose such money you will repay the owner no matter what you do, you should use your money to do this so that if anything should occur in the process you take the loss independently, in bitcoin investment no one knows it all, so no matter what you think the market can disappoint your expectations, that's why is advisable to invest with the amount money that wont affect you when you lose it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DubemIfedigbo001",
      "created_time": "October 28, 2023, 04:44:34 PM",
      "body": "Quote from: Riginac111 on October 27, 2023, 08:16:43 PMFor investment of Bitcoin I think it's good to invest with your own money instead of using a borrowed money because of the risk and disadvantages in the investment.The only risk I see in bitcoin investment is having the wrong mentality when investing in it. Let me explain, bitcoin is clearly not an ordinary investment that you jump into with the expectation of having gains at a slated time frame. Its not like a ponzi scheme that you're promised some gains, its quite understandable that it has a volatile nature and practically nobody knows when it will increase in value or not, so whoever goes into bitcoin investment and cries for loses was misinformed in the first place, or embraced it with a totally wrong mindset. The beauty of bitcoin its that your loses can be transformed to big time gains only if you can wait for the bull run. It is also evident that the bull run occurs mostly after its halving.Quote using a borrowed for investment is a highest risk so far, so I will advice even our people who is coming to invest never to borrow money for a risk investment despite that theirs no investment that is not risky but we should amend our ways and know that Bitcoin investment is something you invest and forget about it for long time.Not only bitcoin investment, but all investments. It is not advisable at all to borrow money for an investment that you're not already into, and gaining from. You can only borrow to enhance your stake in an already productive venture. We call it good debt. The worst punishment you can give yourself as a starter its to borrow money for the business. If anything guess wrong, your problem will be doubled. And worse of it all, you borrow from banks or loan sharks, you're doomed as you may end up auctioning your valuable to repay before the collateral is forcefully collected from you.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mayor of ogba",
      "created_time": "October 28, 2023, 04:50:29 PM",
      "body": "E no good make person borrow money to invest in Bitcoin way you no get any means of repaying your debt because to make a profit from Bitcoin investment you need to hodl your Bitcoin for a very long term like 3-4 years before you go see better profit inside. But if you dey work with a good salary per month and you understand Bitcoin well well and you want to invest on it and you no get the money you fit borrow money invest when you get your salary you go dey repay small small until you pay am finished. Bitcoin is the only thing for the crypto way I know say you no fit lose your money as far as you still dey hodl am unless you sell at a loss when the price drops. Even due Bitcoin price drop e go still rise back just way tin we saw happen for Bitcoin price for few days back.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obim34",
      "created_time": "October 28, 2023, 06:00:03 PM",
      "body": "Quote from: Davidvictorson on October 27, 2023, 10:22:41 PMThis is a good reminder that is very timely. Now that the price of Bitcoin has gone up and knowing the halving event is around the corner. We know a Nigerian mentality we want to cash out so if you'd go borrow money. What is loan sharks and respect that they will be able to pay back only to be disappointed in the end. E better say make you borrow the money from your papa and mama than to borrow from outsiders.Sometimes sef even with the one you borrow from papa or mama as soon e reach when una talk to return the money and you no dey respond well na another big wahala and questioning dey go want understand wetin u use the money invest into and if e con be say na huge money omor... Na yawa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Franctoshi",
      "created_time": "October 28, 2023, 06:01:08 PM",
      "body": "Quote from: Riginac111 on October 27, 2023, 08:16:43 PMFor investment of Bitcoin I think it's good to invest with your own money instead of using a borrowed money because of the risk and disadvantages of the investment, if you want to invest in Bitcoin I think that you should use what you can be able to afford to lose for the investment. some of us who are new to Bitcoin investment have seen Bitcoin as a source of making money, and not knowing that Bitcoin investment has disadvantages and advantages, so using a borrowed for investment is the highest risk so far, so I will advise even our people who are coming to invest never to borrow money for a risk investment despite that theirs no investment that is not risky but we should amend our ways and know that Bitcoin investment is something you invest and forget about it for a long time.This is not only particular to Bitcoin investment but other investments or businesses in general, it is not a wise thing to do because it is a very risky one as there is no such guarantee or certainty that Bitcoin will always continue to increase in value, things could go otherwise, and you get screwed unless you have a solid way of repaying the loan, plus you are given a long duration of time or number of years to pay back the loan, maybe 2–5 years, in this case, your investment in Bitcoin might have appreciated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "CryptopreneurBrainboss",
      "created_time": "October 29, 2023, 03:52:45 AM",
      "body": "Quote from: Riginac111 on October 27, 2023, 08:16:43 PMFor investment of Bitcoin I think it's good to invest with your own money instead of using a borrowed money because of the risk and disadvantages in the investment, if you want to invest in Bitcoin I think that you should use what you can be able to afford to loss for the investment.You no supposed think, one of the main rules of investment na say make we no use borrowed money take invest. Investment supposed be sometime wey be say if things no go as you been plan am you fit adjust your investment timeframe add more waiting time. If you been plan to hold to 6 months and after that 6 months things no come out as you plan, you fit add more waiting time but when you dey use money wey no be your own like wey you borrow, e go make fear catch you well well and you go dey rush to sell make you no lose everything and in that process, you dun sell at loss wey be another thing wey you no supposed do when you invest. Borrowed money go make you no get peace of mind and na so you go dey over monitor the market because fear dey catch you. E no matter how small your money dey, no borrow to invest or na you go still suffer am. Quote from: CryptSafe on October 27, 2023, 09:33:25 PMBorrowed money does not belong to you, and I believe repaying it comes with interest on it. If it happens that after borrowing to invest in bitcoin, the price drops below your expectations, that would be a problem because you, as the borrower, would depend on the profit from the investment, and I believe there is a stipulated time of repayment. Very valid point, all this newbies dey think say the market na only one sided so as dem borrow everything go go as dem plan but the market dey always get another plans. Bitcoin na one of the worst assets to borrow money invest inside because the price volatility no be here and if you come get to pay back the money in the nearest future na big problem be dat because the market fit decline that period and put you at a very big disadvantage as you fit no go only lose but now you get to look for another means to arrange money take cover up which is unplanned expenses wey you for fit avoid, if you been just dey contended with what you have and invested with only your spare money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Richbased",
      "created_time": "October 29, 2023, 05:42:47 AM",
      "body": "Quote from: CryptSafe on October 27, 2023, 09:33:25 PMIt is not advisable to borrow money for bitcoin investments because of the nature of bitcoin volatility. No one can predict the market trend. To talk about it, there is a saying that one should \"invest what they can afford to lose\" and also \"invest with their spare cash\". There are reasons why these phrases were formulated, and they stand as enlightenment and caution to the traders who are very much engaged in trading activities, but the newbie traders are mostly advised to take cognizance of them so as to be guided while trading or investing.Borrowed money does not belong to you, and I believe repaying it comes with interest on it. If it happens that after borrowing to invest in bitcoin, the price drops below your expectations, that would be a problem because you, as the borrower, would depend on the profit from the investment, and I believe there is a stipulated time of repayment. What if the bitcoin market does not pick up before that time to pay it back? What would happen to the borrower? Or do you expect the lender to wait for your bitcoin investment to grow before you pay it back with interest on top? A big no.Borrowing money to invest in bitcoin will be a mistake because bitcoin is still very young to predict it's future and due to fluctuations in the market prices sometimes one can buy bitcoin with the hope that the price may rice in the future and before you know it the price might drop due to some uncertainty in the future so despite it's volatility, I feel borrowing money to invest on bitcoin isn't a good idea and most time in the essence of waiting for the price to go high that's how the interest of the money being borrowed will be accumulated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "October 29, 2023, 12:28:19 PM",
      "body": "Yeah, it's a big risk to loan money in order to invest in Bitcoin, but there are free interest loans that you can ask for from your relatives, friends, and family, which is less of a risk compared to when the investor is taking a huge loan with a significant percentage of interest from the commercial banks. If one takes a free interest loan from relatives, they can repay it gradually from their other sources of income, and even if they default on the loan repayment, they can still resolve the issue amicably, but if it's from the banks, defaulting on the loan will mean extra interest being added.Inasmuch, I would not advise anybody to take a loan in order to invest in Bitcoin, but I can still tell them to rather take a free interest loan, a loan that will not put them under pressure when they default on the repayment.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}