{
  "id": "topic_5440764",
  "title": "Hydrogen",
  "author": "Hydrogen",
  "created_time": "February 21, 2023, 11:37:56 PM",
  "content": "QuoteVarious projects supporting censorship resistance and Bitcoin education have received funding from the HRF.The Human Rights Foundation (HRF) has granted 2 billion satoshis, approximately $475,000, from the Bitcoin Development Fund to 10 global projects. The funding will support areas such as censorship-resistant communication, Bitcoin education in authoritarian regimes, core development and building local communities and education, with a focus on Africa and Southeast Asia. The grants include $100,000 to Qala, a fellowship program training the next generation of African Bitcoin and Lightning developers, allowing the program to continue their 13-week fellowship and sponsoring six Qala fellows to attend the Oslo Freedom Forum.The HRF has also awarded $75,000 to the Africa Bitcoin Conference, the largest Bitcoin-focused conference in Africa, and $50,000 to William Casarin for his work on Nostr, a censorship-resistant, open-source and decentralized social network platform. Additionally, $50,000 went to Bitcoin for Fairness, which focuses on raising awareness of Bitcoin for disadvantaged communities and in authoritarian states. Another $50,000 went to Vasil Dimov, a top-20 contributor to Bitcoin Core, to ensure continued development and stability of the Bitcoin protocol.The remaining $25,000 grants were awarded to Emmanuel Bronshtein for his contributions to Wallet Scrutiny, Exomunia to expand Bitcoin educational resources, Ekenimoh Elyan for EasePay, and Bitcoin Myanmar for financial freedom education. HRF has allocated over $2.2 million in BTC and USD to more than 70 developers, educators and open-source initiatives worldwide since early 2020. The organization continues to raise support for the Bitcoin Development Fund, with the next round of gifts to be announced in May 2023.\"Bitcoin is a powerful tool for human rights defenders around the world,\" and these grants support their belief that \"financial freedom is a human right,\" Alex Gladstein, Chief Strategy Officer of HRF, said. \"We are proud to support the amazing work of these individuals and organizations who are using Bitcoin to fight for human rights and freedom, especially in regions where it's needed most.\"HRF is a registered 501(c)(3) non-profit organization, and donations are tax-deductible to the fullest extent allowable by law. Proposals for support can be submitted to dev.fund@hrf.org, and more information can be found on HRF's website.https://bitcoinmagazine.com/culture/hrf-donates-2-billion-satoshis-bitcoin-projects....Interesting list of projects:$100,000 to Qala, a fellowship program training the next generation of African Bitcoin and Lightning developers$75,000 to the Africa Bitcoin Conference, the largest Bitcoin-focused conference in Africa$50,000 to William Casarin for his work on Nostr, a censorship-resistant, open-source and decentralized social network platform$50,000 went to Bitcoin for Fairness, which focuses on raising awareness of Bitcoin for disadvantaged communities and in authoritarian states$50,000 went to Vasil Dimov, a top-20 contributor to Bitcoin Core, to ensure continued development and stability of the Bitcoin protocol$25,000 to Emmanuel Bronshtein for his contributions to Wallet Scrutiny$25,000 to Exomunia to expand Bitcoin educational resources$25,000 to Ekenimoh Elyan for EasePay$25,000 to Bitcoin Myanmar for financial freedom educationIt is good to see that there still remains no shortage of positive activity and social movements as far as cryptocurrencies go.What observations and predictions might be made based upon the short summaries of these projects? $25k went to bitcoin myanmar. Interestingly enough I think the entire nation of myanmar has suffered from rolling internet blackouts, as well as its financial system being down intermittently. Perhaps this makes it a ripe environment for residents to appreciate benefits of crypto? $100k to crypto developer training in africa sounds interesting. Nostr sounds like it could be an interesting project as far as social media goes.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5440764",
  "comments": [
    {
      "author": "franky1",
      "created_time": "February 22, 2023, 09:16:00 PM",
      "body": "funny part is the HRF donates funds to the dev group that has the highest reputation of moderation policy to ban and delete posts of anyone not part of their groupspeek/roadmap",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}