{
  "id": "topic_5461510",
  "title": "nameMINE",
  "author": "nameMINE",
  "created_time": "July 30, 2023, 06:30:24 PM",
  "content": "Hey so i want to sell my house in Glyfada, Athens, Greece for 250,000 euro, btc, eth or usdt accepted if anyone is interested i would be happy to assist with getting a greek resident's visa since if you buy a house for 250k euros you are entitled to one, if anyone is interested just dm me. No scammers please there will be notarized contracts and a bunch of paperworks so no way for anyone to scam anyone. If you're interested in buying a house with crypto in Greece hit me up.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5461510",
  "comments": [
    {
      "author": "Latviand",
      "created_time": "July 31, 2023, 02:58:19 AM",
      "body": "OP, I don't know if you know this but you need to provide some proof that you're a legitimate seller, you can upload photos in Talkimg if you don't know where to upload the pictures, they even give you a code to put in your post. I don't know much about land or house selling but there should be a way for people to check out the property and the necessary papers that matches what you say.I'm not an expert in world economy but isn't Greece the one that filed for bankruptcy or something years ago and that there's been a lot of economic and social problems there right now?Code:https://talkimg.com",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "July 31, 2023, 07:15:48 PM",
      "body": "Quote from: nameMINE on July 30, 2023, 06:30:24 PMHey so i want to sell my house in Glyfada, Athens, Greece for 250,000 euro, btc, eth or usdt accepted if anyone is interested i would be happy to assist with getting a greek resident's visa since if you buy a house for 250k euros you are entitled to one, if anyone is interested just dm me. No scammers please there will be notarized contracts and a bunch of paperworks so no way for anyone to scam anyone. If you're interested in buying a house with crypto in Greece hit me up.Interesting offer and I didn't know Greece is giving away residency for buying a 250k house, but is it even legal in Greece to purchase a house with Bitcoin or with other crypto?One friend from Greece told me that you can't even buy anything for cash above 1000 euros (I think) because everyone is asking for digital confirmation of purchase, probably for tax purposes.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "owlcatz",
      "created_time": "August 01, 2023, 01:00:43 AM",
      "body": "Pics would certainly help lol... I love greece, but is it burnt down now? Where is it exactly/roughly?  ... Not being a dick, but you don't really provide much here TBH...",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aoluain",
      "created_time": "August 01, 2023, 06:04:28 AM",
      "body": "This sounds interesting and would suit anyone in the EU a lot because residency willbe easier achieved.You have to provide some evidence of ownership and some images of what exactlyyou are selling, a couple of lines of text isnt going to sell it for you, ---EXPOSE THE PRODUCT TO THE RISK OF SALE---You are probably selling at the right time because climatologists are statingits going to get hotter year after year.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nameMINE",
      "created_time": "August 08, 2023, 08:23:27 PM",
      "body": "Hey guys, thanks for the replies sorry for the late response I was on holiday, so I'll be happy to provide photos and the listing of the house and everything in DMs I somehow feel uncomfortable to provide photos of the house and dox myself, so if anyone is seriously interested hit me up in DMs, the house absolutely requires renovation but I'm selling it at market value in the current condition as is. About the guy asking if you can actually buy stuff with crypto in Greece you absolutely can't that's why the buyer pays in crypto but the transaction will be made in cash as far the Greek government is concerned. As for people that ask for prove of ownership or something similar, the buyer will have to hire a Greek attorney to check the deeds and all the required paperwork I can assist with giving a few suggestions although google is your friend too. Buying a house in Greece is a rather bureaucratic process so the transaction won't happen without checks and all. So yeah if you're like seriously interested in buying a house in Greece with crypto, send me a dm and I'll be happy to send more info and everything",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "September 26, 2023, 11:18:18 AM",
      "body": "Quote from: nameMINE on July 30, 2023, 06:30:24 PMHey so i want to sell my house in Glyfada, Athens, Greece for 250,000 euro, btc, eth or usdt accepted if anyone is interested i would be happy to assist with getting a greek resident's visa since if you buy a house for 250k euros you are entitled to one, if anyone is interested just dm me. No scammers please there will be notarized contracts and a bunch of paperworks so no way for anyone to scam anyone. If you're interested in buying a house with crypto in Greece hit me up.The best form of convinction for the people on this forum as concerning this transaction is when its pictorial. Most people will scroll past the thread but the pictures and the serenity of the environment the property is located will be catchy enough to awaken someone's interest. Consider adding the pictures and more concrete details that can be verifiable. Links, cordinates and other stuff. You must have put it up on other sites, the link to those sites are also relevant.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Ckone3333",
      "created_time": "October 03, 2023, 12:17:09 PM",
      "body": "It's funny that you mention it because I just bought my house paying with cryptocurrency",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wallet4bitcoin",
      "created_time": "October 28, 2023, 12:15:13 PM",
      "body": "I used to advise people to dispose off properties that they don't want to use but after I witnessed, first hand, the business proceeds of AirBnB, I had a rethink about my counsel and started working towards owning one. Real Estate might be a low risk low reward business but that's before, right now, it's raking in much money. I'll advice you to look into properties from the business standpoint.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pingrapole",
      "created_time": "October 29, 2023, 10:58:50 AM",
      "body": "I am very happy to hear that Bitcoin is slowly expanding its market I have many dreams I want to buy the mentioned products with Bitcoin I want to buy a house I do not know what I want Whether it will happen, but I will stick with it and I hope I will buy like you. Bitcoin expansion will expand when all countries accept it. I wish my country would accept it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tyz",
      "created_time": "November 14, 2023, 12:16:58 AM",
      "body": "Quote from: nameMINE on July 30, 2023, 06:30:24 PMHey so i want to sell my house in Glyfada, Athens, Greece for 250,000 euro, btc, eth or usdt accepted if anyone is interested i would be happy to assist with getting a greek resident's visa since if you buy a house for 250k euros you are entitled to one, if anyone is interested just dm me. No scammers please there will be notarized contracts and a bunch of paperworks so no way for anyone to scam anyone. If you're interested in buying a house with crypto in Greece hit me up.Why dont you just sell it for Euros and then exchange those into BTC/ETH?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}