{
  "id": "topic_5432771",
  "title": "Pezroly",
  "author": "Pezroly",
  "created_time": "January 02, 2023, 08:10:51 PMLast edit: January 02, 2023, 08:22:31 PM by Pezroly",
  "content": "Through contacts from Internet marketers I find investment company from Greece, which looks very promising - 35% profit per month, min. investment 200$. Nice design Web page and friendly chat. Investment in Bitcoin or ETH. I can not find any scam or negative report about this investment company, only two positive reports !!!.  They have also office address in Greece, and phone for VIP customers.Scammers Mistake Nr.1I decided to make investment in ETH, register the account and then find that they have withdraw only in Bitcoins.I write to the chat and they promise to add ETH withdraw in some minutes, and they did it. But then I started to think - may be scam - because they do not have ETH withdraw.Scammers Mistake Nr.2I started to search their management through search engine and find that all management are public and very rich people - millionaires - can not be in such a company, so this was their second mistake.So scammers fail completely.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5432771",
  "comments": [
    {
      "author": "digaran",
      "created_time": "January 04, 2023, 02:35:39 PM",
      "body": "Your first mistake: you posted a self moderated thread, people tend to stay away from such threads.Your second mistake, you posted this on a wrong board, off topic board is mostly for account farmers.Your third and last mistake was considering to invest, what would you do if they had legit looking team members and ETH withdrawal option? Probably posting to cry about the scam instead of this post.🤣",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pezroly",
      "created_time": "January 05, 2023, 02:21:33 AM",
      "body": "Quote from: digaran on January 04, 2023, 02:35:39 PMYour first mistake: you posted a self moderated thread, people tend to stay away from such threads.Your second mistake, you posted this on a wrong board, off topic board is mostly for account farmers.Your third and last mistake was considering to invest, what would you do if they had legit looking team members and ETH withdrawal option? Probably posting to cry about the scam instead of this post.🤣I did not see any problem or mistake with the thread posting. Self moderated thread helps avoid negative comments without any reason. Considering to invest is not the mistake. And the scammers companies do not have legit looking team members as such. That's the difference with real companies.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}