{
  "id": "topic_5457389",
  "title": "NerrawBTC",
  "author": "NerrawBTC",
  "created_time": "June 24, 2023, 07:16:57 AM",
  "content": "Good day, everyone! I wanted to reintroduce myself to this forum because I used to be a member here around 2016 or 2017. Back then, I was a fresh graduate and stumbled upon this forum through a link on social media that talked about altcoins.As my life became more busy, I took a break from the forum to focus on my girlfriend (who is now my wife, and we have an upcoming child) and my work. I didn't return to this forum until last year, in 2022. I started lurking again, trying to remember my old username and password (I tried using BPIP, but had no luck).I really don’t have intention of creating a new account as I just wanted to read and learn, as I had been doing in other non-crypto forums. Like I frequently visited ForexStation to learn about trading strategies and indicators in the Forex market.However, recently, I've felt a strong desire to create a new account here. The reason behind this is the Pizza Bake Off contest. I have a homemade pizza that I'd love to share, but I was hesitant due to the issue of some users farming merits by posting their pizzas and others claiming they're not \"proper\" pizzas. Personally, as long as a pizza has the basic ingredients it should be considered a pizza.I've come across various interesting threads. I remember reading about icopress asking for donations for Ukraine, The Pharmacist's request to change his username to The Sceptical Chymist, and the major news about exchanges (such as FTX) that Theymos posted in the announcements, advising users not to keep funds in online accounts. I also support the idea of having a Twitter account for updates, especially since the forum experienced a temporary shutdown for a couple of hours. Lastly, the image problem here in the forum is something that caught my attention.In regard to my old account, even if I recover or remember the details, I have no plans to use it for personal reasons. I also hope to become an active contributor to this forum in the future, but for the time being, my main goal is to continue learning and reading about Bitcoin and altcoins. I'm starting to save money now because I want to buy Bitcoin in preparation for the halving next year, and I also want to save some for the future of my upcoming child.Thank you for spending time reading my post. See you around! PS : I've read already the Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQand I am aware on this.Quote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5457389",
  "comments": [
    {
      "author": "Hyphen(-)",
      "created_time": "June 24, 2023, 07:44:58 AM",
      "body": "Hello and welcome back to the forum! We are delighted to have you back, even though you did not reveal your previous account, and you are quite welcome. I hope you learn a lot now about Bitcoin as you wanted.Quote from: NerrawBTC on June 24, 2023, 07:16:57 AMPS : I've read already the Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQand I am aware on this.Quote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.I'm delighted you're aware of the forum's regulations; there's no need for me to provide you with links and tips on how to use this forum. I hope you are aware that plagiarism is a serious offense and should be avoided.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Sim_card",
      "created_time": "June 24, 2023, 08:06:47 AM",
      "body": "Welcome back mate, it is nice that you decided to come back here after a very long time to learn again. You are not new and I believe you understand the forum better than every other newbies even though you are using a new account. You should take your time to enjoy the forum and make positive contributions to the forum so that other forum members can also learn from you since you are an OG in the forum. I hope you have decided to spend more time and get committed to the forum this time and you wouldn't go for long anymore.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NerrawBTC",
      "created_time": "June 24, 2023, 08:23:52 AM",
      "body": "Quote from: Hyphen(-) on June 24, 2023, 07:44:58 AMHello and welcome back to the forum! We are delighted to have you back, even though you did not reveal your previous account, and you are quite welcome. I hope you learn a lot now about Bitcoin as you wanted.Quote from: NerrawBTC on June 24, 2023, 07:16:57 AMPS : I've read already the Unofficial list of (official) Bitcointalk.org rules, guidelines, FAQand I am aware on this.Quote from: mprep on July 21, 2014, 05:27:51 PM18. Having multiple accounts and account sales are allowed, but account sales are discouraged.I'm delighted you're aware of the forum's regulations; there's no need for me to provide you with links and tips on how to use this forum. I hope you are aware that plagiarism is a serious offense and should be avoided.Thank you, mate! Yes, I am really aware of those plagiarism issues. I've seen a lot of new accounts posting in Meta asking moderators to lift the bans on their accounts. I also recently saw someone asking mods to lift the ban on his account as he is using his \"uncle's account\", but it still turns out he is eating his own shit and discovered that it is his alts.Quote from: Sim_card on June 24, 2023, 08:06:47 AMWelcome back mate, it is nice that you decided to come back here after a very long time to learn again. You are not new and I believe you understand the forum better than every other newbies even though you are using a new account. You should take your time to enjoy the forum and make positive contributions to the forum so that other forum members can also learn from you since you are an OG in the forum. I hope you have decided to spend more time and get committed to the forum this time and you wouldn't go for long anymore.I can't promise mate, as we don't know how busy I will be when my baby is born, but let's see, as I want to learn more, I probably won't be that frequent in visiting this forum when I am too busy, but I do make sure that I visit it at least twice a month or more. Thank you mate!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Husires",
      "created_time": "June 24, 2023, 09:18:44 AM",
      "body": "Welcome, try to give less details about your personal life because you want to learn and not start an activity or something that needs to reveal your identity, and since you do not remember the username, can you remember the events related to Bitcoin during the year 2016? It will be interesting to listen to your stories because you know things that most of us do not know.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "NerrawBTC",
      "created_time": "June 24, 2023, 11:18:56 AM",
      "body": "Quote from: Husires on June 24, 2023, 09:18:44 AMWelcome, try to give less details about your personal life because you want to learn and not start an activity or something that needs to reveal your identity, and since you do not remember the username, can you remember the events related to Bitcoin during the year 2016? It will be interesting to listen to your stories because you know things that most of us do not know.Oh sorry about it mate.Well way back 2016 I can recall that the price of bitcoin that time is around below $450 (not our main currency just converted it from where am I), I did buy Bitcoin way back on time from our local wallet/exchange just to invest HYIP and Ponzi scams   , I do also earn it by creating some logos and micro task coming from my online friends and they are paying me in Bitcoin(roughly $20 ) well that's too big that time as I am coming from poor family. Then that is the time I can recall that there are no merit system here in the forum , and also the era of Bounties raises(new tokens coming out and this is the time of ICO) which I can recall that I've joined some of it, this is where Bitcointalk having problems with spammers and shit posters(I admit this) and plagiarism which lot of higher ranks saying some suggestions to prevent it and the merit system was push through , that is the time I think I was gone from this forum. I can remember yahoo62278 is the best signature campaign manager before that I've known as most of the Bitcoin signature campaigns is he is the one managing it. There are a lot of giveaways of Collectible tokens before that the members here giving away and what's best is that they shoulder the expenses on shipping. Also unlike this year that a lot of exchanges closes before most of the exchanges are legit I mean we don't have issues that they go bankrupt and one of the famous exchange before is Bittrex (it is not the same UI now than before).I forgot other events happened here in the forum before but I'll edit this if  I can recall more  Oh, also I forgot that every April Fool's Day (1st of April) Theymos is doing some kind of trolling before. I just can't recall it, but Theymos is posting that if you do not achieve those required posts, your account will be deleted. I am not really sure if the merit system was also kind of done as a trolling before.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "rby",
      "created_time": "June 24, 2023, 02:09:29 PM",
      "body": "Welcome back mate!Quote from: NerrawBTC on June 24, 2023, 07:16:57 AMAs my life became more busy, I took a break from the forum to focus on my girlfriend (who is now my wife, and we have an upcoming child) and my work. Quote from: NerrawBTC on June 24, 2023, 08:23:52 AMI can't promise mate, as we don't know how busy I will be when my baby is born, but let's see, as I want to learn more, I probably won't be that frequent in visiting this forum when I am too busy, but I do make sure that I visit it at least twice a month or more. Thank you mate!I do not know your country and how busy people get there. You have emphasised on your busy life and I have to think if there is a time I will everly get such busy to resign from the forum. I mean no matter how busy or hectic my day will be, while on bed trying to sleep I can use 30 - 40 mins and use the forum. I am just imagining when I will be so busy that I can't spare 30mins for the forum.Quote from: NerrawBTC on June 24, 2023, 11:18:56 AMI can remember yahoo62278 is the best signature campaign manager before that I've known as most of the Bitcoin signature campaigns is he is the one managing it. No offense! How come you are able to remember yahoo62278 but you could not remember your username?Or was your username that type that looks like \"Ezms9922773\"?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SeriouslyGiveaway",
      "created_time": "June 24, 2023, 02:23:09 PM",
      "body": "Quote from: NerrawBTC on June 24, 2023, 11:18:56 AMOh, also I forgot that every April Fool's Day (1st of April) Theymos is doing some kind of trolling before. I just can't recall it, but Theymos is posting that if you do not achieve those required posts, your account will be deleted.I don't know that April fool. If your memory is right you will find that April fool from[Compilation] All pranks that was made by theymos in every April Fools Day come.A recap of Theymos April fool Jokes from 2015 till dateQuoteI am not really sure if the merit system was also kind of done as a trolling before.Merit system is real, not a troll.Merit & new rank requirements",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shamm",
      "created_time": "June 24, 2023, 02:34:36 PM",
      "body": "Hello mate good data and welcome back to this forum once again, we are all glad having you back and it will proves to us that bitcoin talk us the best forum. Also maga now you are back for sure you will continue what you've started before and you will contribute here in our community by your knowledge that you will be share to is soon. And also you can learn a lot of things here in our community because there are many changes since then. Op I also say that where happy to hear that you already a father.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aysg76",
      "created_time": "June 24, 2023, 04:14:36 PM",
      "body": "Quote from: NerrawBTC on June 24, 2023, 07:16:57 AMGood day, everyone! However, recently, I've felt a strong desire to create a new account here. The reason behind this is the Pizza Bake Off contest. I have a homemade pizza that I'd love to share, but I was hesitant due to the issue of some users farming merits by posting their pizzas and others claiming they're not \"proper\" pizzas. Personally, as long as a pizza has the basic ingredients it should be considered a pizza.So you have basically registered with this new account to participate in the pizza baking contest? If this is your motive then just to inform you we already have winners for the latest pizza competition and that was the last one being organised by @Cyrus in this manner due to all the mess that happened during this time and for more information read this ,thread .So can't say what will be format for next one or will there be more of them so till then focus on actual participation in the forum.Quote from: Cyrus on June 16, 2023, 04:01:18 PMThe contest was fun but this will be last year in which we are organizing the Bitcoin Pizza Bake-off Contest (in this form  ). It's not scalable and we've reached a good amount of controversy. For people that came late and/or wonder what's up with the Discord contest here is some backstory.Quote from: NerrawBTC on June 24, 2023, 07:16:57 AMIn regard to my old account, even if I recover or remember the details, I have no plans to use it for personal reasons. I also hope to become an active contributor to this forum in the future, but for the time being, my main goal is to continue learning and reading about Bitcoin and altcoins. I'm starting to save money now because I want to buy Bitcoin in preparation for the halving next year, and I also want to save some for the future of my upcoming child.So your old account might also be the newbie one but if you were active during 2018 you would have received airdropped merits which was not a troll by the way but now if you are interested in gaining knowledge you will be good to go and invest in bitcoin after making all the research.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "June 24, 2023, 05:26:55 PM",
      "body": "Welcome back to bitcointalk...I would love to believe that indeed you lost your account name ( which is hard to believe ) and it's kinda of strange that in your first thread you have manage to mention the name of more than 2 merit sources and also your first post is in a competition that promises the participants merits. Sorry to say but this look like the typical way an user that has been banned previously an wants to try to rank up their account. Like I said earlier, sorry for being skeptical but we have seen others with even more convincing claims that turns out to be a cover up story to try to mask the fact that they know so much about the forum, even though their account is still a newbie in the forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BIT-BENDER",
      "created_time": "June 24, 2023, 06:21:05 PM",
      "body": "Honestly no one really needs to here all this personal details about your life you just gave here. And if you have been here or learnt about this forum since 2016 you should know that majority of what you posted wasn't actually needed. But to be very kind welcome to the forum but it's sad to say after all those years you still have Alot to learn about the forum. Probably you can go back to some post you should have already seen. https://bitcointalk.org/index.php?topic=2766177.0https://bitcointalk.org/index.php?topic=14356.0https://bitcointalk.org/index.php?topic=703657.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Dr.Bitcoin_Strange",
      "created_time": "June 24, 2023, 07:13:16 PM",
      "body": "Was your account banned, or did you just forget about the forum and also forget about your login details? Well, carelessness is not welcome in the crypto journey; otherwise, you may also end up forgetting your private key after creating your Bitcoin wallet. For now, I will join others in saying welcome back to the forum until you establish yourself here and your intention is made known. By the way, don't forget that criticism may also be the odder of the day for you here on some kind of topic or comment you would make here, and by the way, this thread doesn't add up; I don't think quite a lot here is really concerned about the story you are telling now.Well, see you around. Cheers 🥂, Dr.Bitcoin_Strange 👺👺",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "June 24, 2023, 07:29:56 PMLast edit: June 24, 2023, 07:45:02 PM by alastantiger",
      "body": "Too many personal information man...but I understand your excitement. A lot of users have taken a break from the forum for several reasons ranging from the need to focus on school work, focus on work and or some personal issues. Being an \"old-new\" member, you have a solid grasp of the forum already and you should have no problem whatsoever. One thing you may want to get updated on is the \"unofficial AI assisted writing rule on the forum\". So far, I think it is a no-no area and for some signature campaigns, it is a solid no to use AI for writing. Do take note of this. You should go to this thread created by nutildah to get the gist - https://bitcointalk.org/index.php?topic=5456516.0",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "letteredhub",
      "created_time": "June 24, 2023, 10:17:49 PM",
      "body": "Quote from: rby on June 24, 2023, 02:09:29 PMWelcome back mate!Quote from: NerrawBTC on June 24, 2023, 07:16:57 AMAs my life became more busy, I took a break from the forum to focus on my girlfriend (who is now my wife, and we have an upcoming child) and my work. Quote from: NerrawBTC on June 24, 2023, 08:23:52 AMI can't promise mate, as we don't know how busy I will be when my baby is born, but let's see, as I want to learn more, I probably won't be that frequent in visiting this forum when I am too busy, but I do make sure that I visit it at least twice a month or more. Thank you mate!I do not know your country and how busy people get there. You have emphasised on your busy life and I have to think if there is a time I will everly get such busy to resign from the forum. I mean no matter how busy or hectic my day will be, while on bed trying to sleep I can use 30 - 40 mins and use the forum. I am just imagining when I will be so busy that I can't spare 30mins for the forum.There levels to these things and the nature of work you are doing in your country may not be same as that of the OP,  and there are some persons that are not late night posters, that is, they are not moved in making posts at night next to bed time and for such people now having a hectic job that keeps them busy all through the day it's simple and easy for them to abandon the forum. Don't you think so mate?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "348Judah",
      "created_time": "June 26, 2023, 01:07:51 PM",
      "body": "Quote from: NerrawBTC on June 24, 2023, 07:16:57 AMI wanted to reintroduce myself to this forum because I used to be a member here around 2016 or 2017. Back then, I was a fresh graduate and stumbled upon this forum through a link on social media that talked about altcoins.Which this means that you're telling us that this is your alt to the main account you have been using before for a long time after it has been inactive, well there's no rule against having alt account on the forum as long as the first one wasn't banned for any reason if not it's a call for a ban evasion.Quote from: NerrawBTC on June 24, 2023, 07:16:57 AMIn regard to my old account, even if I recover or remember the details, I have no plans to use it for personal reasons. I also hope to become an active contributor to this forum in the future, but for the time being, my main goal is to continue learning and reading about Bitcoin and altcoins. I'm starting to save money now because I want to buy Bitcoin in preparation for the halving next year, and I also want to save some for the future of my upcoming child.If truly you see the need for you to continue learning each day then the forum is the best place to first get some reliable information source about bitcoin, and this will require from you being active as well till the day you're satisfied enough with what you've learnt so far.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fiatless",
      "created_time": "June 26, 2023, 02:29:22 PM",
      "body": "Quote from: NerrawBTC on June 24, 2023, 07:16:57 AMGood day, everyone! I wanted to reintroduce myself to this forum because I used to be a member here around 2016 or 2017. Back then, I was a fresh graduate and stumbled upon this forum through a link on social media that talked about altcoins.You are welcome to the forum and I hope you will enjoy your second coming to the forum. I even wished I have known this forum for a long time because I use to feel that I lost some opportunities. But I am glad you are back to contribute your quota because you have a wealth of experience. Quote from: Cantsay on June 24, 2023, 05:26:55 PMLike I said earlier, sorry for being skeptical but we have seen others with even more convincing claims that turns out to be a cover up story to try to mask the fact that they know so much about the forum, even though their account is still a newbie in the forum.He can come in any form he wants as much as he is not going against the forum rules. I have come across so many stories about accounts in the forum and it won't take time the real intention of the person will be revealed. If his intention is to start a new life in the forum with a new account, I think he is not breaking any rules of the forum. But you are right to be sceptical Cantsay because the amount of newbie account that introduces themselves as old members are increasing. Like this on I have been gone for a while and the dates are almost similar 2016.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tvplus006",
      "created_time": "June 27, 2023, 07:30:43 PM",
      "body": "Quote from: NerrawBTC on June 24, 2023, 07:16:57 AM...Thank you for spending time reading my post. See you around! The purpose of your presentation is unclear. If you were a previously known member of the forum who left it and returned again, such a presentation would be appropriate. In your case, the decision to return does not play any significant role for the forum. So come on bro without pathos, join the life of the collective.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "nakamura12",
      "created_time": "June 27, 2023, 08:05:08 PM",
      "body": "Welcome back mate, if you want to get reintroduced here in thid forum then you should just use your username here as it is fine if you want some privacy or you don't want anyone here in the forum know your personal information like your real name. It's okay to tell what you do before and whatever you want us to know about your journey here in the forum before. I am sure you know why we ere here and that is to learn and also earn some money. Why not try recovering your old account here in the forum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zaim7413",
      "created_time": "June 28, 2023, 02:43:08 AM",
      "body": "Old members who return to the forum are not too difficult to adapt, from what you have described it is not difficult for you to understand all the rules in the forum and how to make your account rank higher. Nice to welcome you, reading some useful threads will allow you to contribute to the forum. It takes a strong commitment to survive in the forum under any circumstances, people who have managed to achieve a better ranking are not without other activities outside the forum, they always manage their time to visit the forum on the sidelines of their busy lives.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}