{
  "id": "topic_5459795",
  "title": "JarekT",
  "author": "JarekT",
  "created_time": "July 14, 2023, 11:38:18 AM",
  "content": "What do you think about real world asset and anonymous payments?Will the times of tokenization of everything come?I recently saw that 4automatewhich deals with the anonymous purchase of products and services with cryptocurrencies in the real world. They also offer tax optimisations.They added that their goal is a real world asset, is it possible?Quote",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5459795",
  "comments": [
    {
      "author": "passwordnow",
      "created_time": "July 14, 2023, 01:13:28 PM",
      "body": "You don't have to bold everything.Quote from: JarekT on July 14, 2023, 11:38:18 AMWhat do you think about real world asset and anonymous payments?You can't do that if you're talking about real-world assets. Most payments for these assets will either be known by the two people dealing with each other or there's gonna be a public record for it through receipts.Quote from: JarekT on July 14, 2023, 11:38:18 AMWill the times of tokenization of everything come?It had already come to the world through these ICOs, IEOs, STOs, etc. But did it flourish? The majority of them didn't.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bayudndy",
      "created_time": "July 14, 2023, 01:27:51 PM",
      "body": "Almost all of your posts are directed to this site, i think you don't need to spam that here, spend some money on product marketing services instead of trying Try to spread this here, most people will not care.I want to warn you before you get flagged by other premium members here for this spam.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Godday",
      "created_time": "July 14, 2023, 03:56:32 PM",
      "body": "Quote from: bayudndy on July 14, 2023, 01:27:51 PMAlmost all of your posts are directed to this siteI want to warn you before you get flagged by other premium members here for this spam.What website is given by the JarekT? Was there a previous link and then the OP re-edited the thread? I want to know what website and want to visit that link",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}