{
  "id": "topic_5455972",
  "title": "pawanjain",
  "author": "pawanjain",
  "created_time": "June 10, 2023, 04:54:48 PM",
  "content": "Hi all,What is the most secure way of buying a hardware wallet in India ?I know etherbit is a reputable seller from where we can buy hardware wallets in India.But lets discuss the possible risks of buying from this site and alternatives to this site.I am kinda paranoid when it comes to hardware wallet. What if the seed is leaked or tampered.Even if I consider buying it from this site then which one should we go for. Ledger Nano S costs 7k INR while the Ledger Nano S Plus costs 10k INR.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5455972",
  "comments": [
    {
      "author": "pakhitheboss",
      "created_time": "June 12, 2023, 04:58:59 AM",
      "body": "Go through this article which compares both versions of Ledger wallet. I am only aware of etherbit if you choose to purchase a Ledger wallet in India. I won't recommend Amazon or Flipkart for making a purchase. If you have any doubt then buy directly from the Ledger website, the price would be on the higher side as it is an international purchase.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "June 12, 2023, 08:09:44 AM",
      "body": "Why do you specially need a Ledger wallet or a hardware wallet? If you have an extra PC or a Laptop then use it store your cryptocurrency without connecting it to the internet. I am assuming that you are planning on long term hodl, which might be the reason you created this topic. You can achieve the same level of security doing what I wrote above. If you have other reasons then check out KeepKey hardware wallet. Cost is $49 but for international shipping additional charges would be applicable.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "elevates",
      "created_time": "June 12, 2023, 12:34:31 PM",
      "body": "I am only aware of etherbit for ledger wallets They have a good reputation and I have not heard any negative news about them. Any other platform claiming they are selling genuine Ledger wallets is either a scam or compromised. Depending on your requirement choose the version that you need. If your condition is only to hold your crypto assets then buy Ledger Nano S. If you trade quite frequently then buy S Plus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "June 12, 2023, 03:10:39 PM",
      "body": "Quote from: pakhitheboss on June 12, 2023, 04:58:59 AMGo through this article which compares both versions of Ledger wallet. I am only aware of etherbit if you choose to purchase a Ledger wallet in India. I won't recommend Amazon or Flipkart for making a purchase. If you have any doubt then buy directly from the Ledger website, the price would be on the higher side as it is an international purchase. That's a nice comparison between the 2 devices and it seems Nano S would be sufficient for me since I don't do much transactions.Nobody involved in crypto would ever buy a hardware wallet from Amazon or Flipkart. Official website and their trusted resellers are the only best options.Quote from: Bureau on June 12, 2023, 08:09:44 AMWhy do you specially need a Ledger wallet or a hardware wallet? If you have an extra PC or a Laptop then use it store your cryptocurrency without connecting it to the internet. I am assuming that you are planning on long term hodl, which might be the reason you created this topic. You can achieve the same level of security doing what I wrote above. If you have other reasons then check out KeepKey hardware wallet. Cost is $49 but for international shipping additional charges would be applicable. Airgapped PC is a good alternative but it still doesn't provide the same level of security as a hardware wallet.Hardware wallets are the most secure option to store cryptocurrencies as of current date.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IIrik11",
      "created_time": "June 12, 2023, 04:29:48 PM",
      "body": "Quote from: pawanjain on June 10, 2023, 04:54:48 PMI am kinda paranoid when it comes to hardware wallet. What if the seed is leaked or tampered.u know that it generates new seed, right?unless someone has messed with the hardware..u reset it and it is as good as new..i bought mine from amazon and someone previously owned it..have been using it for more than 3 years and nothing has happened.and i have held upwards of 2 lakh inr bitcoin in it.i don't even use it anymore, i just keep mine on offline electrum now.i'll sell it to u if u wants, for 3k, lemme know..",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bitcoinblog",
      "created_time": "June 13, 2023, 10:28:03 AM",
      "body": "Make sure whoever is buying an hardware \" There have also been cases of customers receiving fraudulent hardware wallets. These bogus wallets include malware, allowing attackers to steal private keys and drain your accounts. \" i saw few complains regarding this. If want to hold something offline for long why not use paperwallet instead ?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bureau",
      "created_time": "June 13, 2023, 03:04:54 PM",
      "body": "Quote from: bitcoinblog on June 13, 2023, 10:28:03 AMMake sure whoever is buying an hardware \" There have also been cases of customers receiving fraudulent hardware wallets. These bogus wallets include malware, allowing attackers to steal private keys and drain your accounts. \" i saw few complains regarding this. If want to hold something offline for long why not use paperwallet instead ?Dude use Hinglish if you are not comfortable in writing in English. What I meant was reply like you do using WhatsApp. Words should be English and language would be Hindi. I hope I am not breaking any rules around here as gora would neve know what I said in Hinglish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawanjain",
      "created_time": "June 14, 2023, 03:11:39 PM",
      "body": "Quote from: IIrik11 on June 12, 2023, 04:29:48 PMQuote from: pawanjain on June 10, 2023, 04:54:48 PMI am kinda paranoid when it comes to hardware wallet. What if the seed is leaked or tampered.snipi'll sell it to u if u wants, for 3k, lemme know..I would never do that. I won't recommend anyone buying a second hand hardware wallet.The major reason is it can be tampered and we can never know if the hardware is corrupted.We would lose all our earnings in a jiffy.Quote from: bitcoinblog on June 13, 2023, 10:28:03 AMMake sure whoever is buying an hardware \" There have also been cases of customers receiving fraudulent hardware wallets. These bogus wallets include malware, allowing attackers to steal private keys and drain your accounts. \" i saw few complains regarding this. If want to hold something offline for long why not use paperwallet instead ?Even I have read people buying new wallets but received wallets which were tampered in between and people lost funds.This is why it is always said to buy only from official websites only.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajaxtempest",
      "created_time": "June 15, 2023, 04:33:13 AM",
      "body": "I ordered jade wallet for 65$+12$ shipping from official website. No customs was charged! I have yet to setup as i am apprehensive.I would reccomend you burn your wallet.dat file in dvd drive as it is EMP proof. In an event of carrington event solar flare or nuke war, all electronics will be kaput.  https://store.blockstream.com/product/jade-transparent-hardware-wallet/https://store.blockstream.com/product/jade-hardware-wallet/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Heisenberg_Hunter",
      "created_time": "June 17, 2023, 07:47:11 AM",
      "body": "Quote from: pawanjain on June 10, 2023, 04:54:48 PMWhat is the most secure way of buying a hardware wallet in India ?I have purchased almost 5-10 hardware wallets from different sellers and dealers globally. When it comes to purchasing a secure hardware wallet to store your coins, you should probably purchase a Trezor as opposed to Ledger. Ledger has been notorious in leaking KYC data over the past years and in addition to that their recently introduced backup feature is quite risky if you hold a significant amount of crypto. The only reason why Trezor is lagging in hardware wallet space is that, they have been primary designed for Bitcoin Maxis and they don't have the best shitcoin support & NFT support out there while comparing it with Ledger. Other than that, they are considered superior to Ledger in terms of transparency, cost and trustworthiness.While you are ordering directly from Ledger/Trezor website, you need to undergo customs charges where they tear open your wallet from the packaging bag and check manually (happened in my case). Through this, you never know if your wallet has been tampered or has been intact as you can never trust Indian customs when it comes to crypto related items. Etherbit, OTOH eases this procedure as they import the wallets for you and sell them through their site by adding a minor charge for customs. Also, Etherbit is an official partner of Ledger & Trezor Wallets, so you never need to worry if they are selling legit products.On top of that, when you are ordering directly from Etherbit you will have an edge over to your data because your data stays within Etherbit servers and never reach Ledger/Trezor and even if hackers target the latter your data would be safe with Etherbit.Quote from: pawanjain on June 10, 2023, 04:54:48 PMI am kinda paranoid when it comes to hardware wallet. What if the seed is leaked or tampered.When it comes to usage of any crypto wallets be it hardware or software, there are varying levels of trust which must be kept on the creator/programmer of the wallet. Considering software wallets such as Electrum, you need to know to compile the source and read the code to know if there aren't any backdoors added in the code. When it comes to hardware, you need to know Chip Design, build your own wallet from scratch based on the github repo of Trezor. If you do not want to go along all these shits, then a minimal trust is required for you to start using your HW wallet.Quote from: pawanjain on June 10, 2023, 04:54:48 PMLedger Nano S costs 7k INR while the Ledger Nano S Plus costs 10k INR.Nano S is deprecated and you should not purchase that as there won't be any future security updates to the wallet. Please check this blog post for reference : LEDGER NANO S SUNSET FAQ Additionally, S Plus has NFT support which isn't available in S. So, my opinion would be to move over to S Plus.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cafter",
      "created_time": "June 18, 2023, 06:18:32 AM",
      "body": "the most secure way i think is buying from official manufacturing sites, instead buying from third part resellers.here some advantages i listed: you will get genuine product, not used product fully 'pety pack', fast shipment, cheap from third party resellers.don't buy this type of items from third party resellers which have bad reviews, etc, always buy from trusted resellers with positive reviews.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}