{
  "id": "topic_5433484",
  "title": "zaq123x",
  "author": "zaq123x",
  "created_time": "January 08, 2023, 02:31:19 PM",
  "content": "Twitterowe grafiko analizy hossa przewidywania. Jaka maja wartosc ?Rozpoznaja hossa rakieta bitcoin:https://twitter.com/TATrader_Alanhttps://twitter.com/StockmoneyL",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433484",
  "comments": [
    {
      "author": "Tytanowy Janusz",
      "created_time": "January 11, 2023, 04:20:15 PM",
      "body": "Quote from: zaq123x on January 08, 2023, 02:31:19 PMTwitterowe grafiko analizy hossa przewidywania. Jaka maja wartosc ?Rozpoznaja hossa rakieta bitcoin:https://twitter.com/TATrader_Alanhttps://twitter.com/StockmoneyLSzczerze uważam, że niewiele ma się to do realiów. Sam pomysł zerkania na historię bitcoina, na to jak się układała cena od 1 dolara do 1000 dolarów i na tego podstawie rysowanie długoterminowych trendów wydaje się nie być słuszny. Bitcoin jest innym walorem niż był w 2014 a przeciętny inwestor obecnie jest zupelnie inną osobą. Inwestor z okresu 2009-2014 to nerd, posjonat technologii, użytkownik darkneta. Inwestor 2023 to instytucje, wielkie korporacje, rządy, może nawet banki centralne. Ich zachowanie jak i horyzont inwestycyjny jest zupełnie inny. Samo podejscie inwestorów do bitcoina zmieniło się bardzo. Mówimy więc o zupełnie innym aktywie. Poza tym od 2009 roku do 2021 roku byliśmy w hossie na rynkach światowych. Teraz wszystko wskazuje na początek bessy/recesję, czego bitcoin jeszcze nie doświadczył, więc otoczenie tez się zmieniło. Bardziej skłonny jestem do tego, że właśnie zakończył się supercykl (złożony z 3 mniejszych baniek - do trzech razy sztuka). Przed nami dekada bokiem połączona z zawirowaniami gospodarczymi na całym świecie i potem kolejny supercykl. Nie mówię, że tak będzie, wydaje się to jedynie bardziej prawdopodobne niż to, że zobaczymy jeszcze kolejne, równe jak w zegarku cykle zaczynające się x dni po halvingu i kończące y dni po halvingu. Wszystkie tego typu analizu da się wykonać tylko na wykresie logarytmicznym, bo na każdym innym widać tylko jedną wielką bańkę. A nie jest to typ wykresu, na którym zwykło się robić analizę techniczną.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "wwzsocki",
      "created_time": "January 11, 2023, 07:24:18 PM",
      "body": "Quote from: zaq123x on January 08, 2023, 02:31:19 PMTwitterowe grafiko analizy hossa przewidywania. Jaka maja wartosc ?...fajnie by było żeby jak największą ale tak na prawde to od 10 lat nie widziałem jeszcze jakiejś wartościowej analizy czy chociaz predykcji, która była by opublikowana online w odpowiednio wczesnym czasie, a co więcej, żeby była trafna...Quote from: Tytanowy Janusz on January 11, 2023, 04:20:15 PMSzczerze uważam, że niewiele ma się to do realiów... nie jest to typ wykresu, na którym zwykło się robić analizę techniczną.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}