{
  "id": "topic_5428088",
  "title": "pawel7777",
  "author": "pawel7777",
  "created_time": "December 12, 2022, 06:55:08 PMLast edit: January 27, 2023, 11:26:52 PM by pawel7777",
  "content": "---I thought it would be worth starting a dedicated thread for BlockFi creditors, a.k.a. those who held funds with them at the time they went under (or are otherwise affected) and are hoping to recoup whatever is left of their funds to minimise losses.This topic is not intended for discussing how bad BlockFi or any other centralised exchanges are, or for “not your keys – not your bitcoins” preaching. We all know that. Added a self-moderated option to keep it clean and relevant if needed.Let's post any updates here, share any information (i.e. any communication received from Kroll), ask questions, and try to help each other. So if you're one of their affected customers - feel free to watch this thread, ask questions and contribute.--- Summary: On 28 November 2022, BlockFi filed petitions for Chapter 11. The appointed claims agent is Kroll. Links: BlockFi: https://blockfi.com/ - the site is still up, you should be able to log in and check your balance but any transfers or withdrawals are currently \"paused\".Kroll (claims agent): https://restructuring.ra.kroll.com/blockfi - you can find a lot of information there including hearing dates or how to submit a claim.Things to do for now:- Keep a record of your balances (check both wallet and interest accounts) make screencaps and keep evidence of any deposits you’ve made to the BlockFi in case their website goes down.- You could familiarise yourself with a claim form (you can download from Kroll website - link above) and either submit it now (only hardcopies sent by mail are currently supported) - or give it a bit of time and see if they produce any special forms for BF customers and make it possible to file online as promised (see updates) (it would make sense as that’d make processing much easier for them). It's not clear whether we are allowed to submit forms both online and as a hardcopy.- Keep monitoring https://restructuring.ra.kroll.com/blockfi for any updatesUpdates (at 12 Dec 2022):Reply I got to my inquiry:QuoteThank you for your inquiry.On November 28, 2022, BlockFi Inc. and 8 affiliated debtors (collectively, the \"Debtors\" or \"BlockFi\") each filed a voluntary petition for relief under Chapter 11 of the United States Bankruptcy Code in the United States Bankruptcy Court for the District of New Jersey (Trenton).BlockFi encourages clients to maintain their BlockFi app and account at this time.BlockFi intends to request approval from the Bankruptcy Court to restore withdrawal activities for BlockFi Wallet accounts.  However, at this time, withdrawals from BlockFi continue to be paused.  BlockFi also continues to ask clients not to submit any deposits to BlockFi Wallet or Interest Accounts. If you believe you are owed any amount prior to the chapter 11 process, you have the right to file a proof of claim. The Debtors cannot pay any outstanding prepetition claims without specific approval from the Bankruptcy Court.  At this time, you may file a claim by mail.  However, if you wish to file a claim electronically, you may monitor the case website for when the electronic proof of claim form becomes available.  Information, including access to court documents, instructions on how to file a proof of claim, and important dates and deadlines will be available throughout the case at https://restructuring.ra.kroll.com/blockfi.PLEASE NOTE: Kroll is the appointed claims and noticing agent for BlockFi Inc. and 8 affiliated debtors’ chapter 11 cases.  As such, we are not permitted to provide legal or financial advice.  Further, Kroll is not permitted to accept claims via email or fax, and any such information provided via either of these methods will not constitute a claim in these proceedings.Regards,Kroll InquiriesCurrently, as per their website, only 55 claims have been registered, ranging from $0 (?) to $1.3m. But the number is growing fast.The Bankruptcy Court has not yet set a deadline for filing proofs of claim.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5428088",
  "comments": [
    {
      "author": "pawel7777",
      "created_time": "December 25, 2022, 01:06:54 PM",
      "body": "Some updates from BlockFi:QuoteToday, we took an important step toward our goal of returning assets to clients through our chapter 11 cases. It is our belief that clients unambiguously own the digital assets in their BlockFi Wallet Accounts. As such, we filed a motion requesting authority from the U.S. Bankruptcy Court to allow clients to withdraw digital assets that are held in their BlockFi Wallet Accounts. We will be seeking similar relief from the Supreme Court of Bermuda with respect to BlockFi Wallet Accounts held at BlockFi International Ltd. This motion does not impact withdrawals or transfers from BlockFi Interest Accounts, which remain paused at this time.In order to facilitate withdrawals from BlockFi Wallet Accounts, we also requested permission to update the User Interface to properly reflect transactions as of the platform pause on November 10, 2022 at 8:15 p.m. (prevailing Eastern Time). This is a necessary step towards ensuring all clients are treated fairly and that the User Interface properly reflects the digital assets in Wallet Accounts as of the pause so BlockFi can honor all withdrawal requests from Wallet Accounts properly if authorized by the U.S. Bankruptcy Court and, with respect to BlockFi International Ltd., the Supreme Court of Bermuda.While filing this motion is an initial step, we will continue to work towards solutions that maximize value for all clients and other stakeholders and will share updates as quickly as practicable.We are looking forward to discussing this motion with the U.S. Bankruptcy Court and key parties in our cases, and expeditiously moving towards a path that returns Wallet Accounts assets to clients. We expect that our request will be heard by the U.S. Bankruptcy Court at our hearing currently scheduled for January 9, 2023, at 10:00am ET. We expect that our request for similar relief with respect to BlockFi International Ltd. will be first heard before the Supreme Court of Bermuda at our hearing currently scheduled for January 13, 2023 at 10:30am AST and then scheduled for a full hearing after that on a date to be fixed.Additional information regarding our chapter 11 cases, including court documents and claim information, can be found by visiting BlockFi’s claims agent Kroll at https://restructuring.ra.kroll.com/blockfi.Clients with questions about the process may call Kroll at (888) 773-0375 (Toll Free) or (646) 440-4371 (International), or email1 blockfiinfo@ra.kroll.com.BlockFiAs per the embolden part - this would be great news for those who held their funds in \"wallet\" accounts, but I don't think the court would allow this, as it would be simply unfair to other users who held their funds in \"interest\" accounts (and other creditors). So I wouldn't get my hopes too high for this one.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "December 28, 2022, 12:26:16 AM",
      "body": "Another update just got in:QuotePlease find below a link to the following important document, related to the bankruptcy proceedings of BlockFi Inc., et al., Case No. 22-19361, United States Bankruptcy Court for the District of New Jersey: · AMENDED Notice of Chapter 11 Bankruptcy Cases. Meeting of Creditors: January 20, 2023, at 10:00 a.m. (ET). By Telephone: Dial In - 888-946-3502 - Passcode – 5743575 (Related Document No. 129) For additional information, and to download all documents filed in the Debtors’ chapter 11 cases free of charge, please visit https://restructuring.ra.kroll.com/blockfi.Link to the amended notice (pdf download) hereAs per info on Kroll's website, the Debtors' representative must attend the meeting to be questioned under oath. Creditors (aka BlockFi's customers) may attend, but are not required to do so.Current number of registered claims: 728. I'm still waiting for the promised electronic version of the claim form though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "January 12, 2023, 05:20:55 PM",
      "body": "UPDATE 12 Jan 2023Finally Kroll made it possible to file a claim form electronically. Direct link to online file claim: https://restructuring.ra.kroll.com/blockfi/EPOC-IndexLooking at the form, it looks like it's possible to use it to amend any previously filed hardcopy forms, which could be good if you want to correct any errors or update the claim value (i.e. to reflect the ongoing Bitcoin price upward movement).There are quite a few entities listed in \"Debtor selection\" section, but I reckon, for the regular users this would be:BlockFi Inc. (Case No. 22-19361) - for US residentsBlockFi International Ltd. (Case No. 22-19368) - for non-US residentsThis is based on BlockFi T&Cs:https://blockfi.com/termsQuoteIn the Terms, users of this Online Platform and holders of BlockFi Accounts, including owners, employees, agents and affiliates of any business, corporation, partnership or other entity that is a user, borrower or investor, are sometimes referred to in the Terms as “you” or “your.” The applicable operator of the Online Platform, BlockFi, Inc., a Delaware corporation, if you are a resident in the United States of America or a partnership or corporation organized or incorporated under the laws of the United States of America (“US client”) and BlockFi International Ltd., a Bermuda exempted company which holds a Class F (full) license from the Bermuda Monetary Authority to conduct digital assets business, if you are a resident outside of the United States of America or a partnership or corporation that is not organized or incorporated under the laws of the United States of America (“Non-US client”) is referred toas “BlockFi,” “we,” “us” or “our” in the Terms. Together, you and we may be collectively referred to as “Parties.”",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "January 23, 2023, 09:34:56 PM",
      "body": "Small update.I messaged Kroll with some questions regarding filling out the claim form, they replied with a dismissive \"we are not permitted to provide legal advice, including advising you regarding how to complete the proof of claim form\" etc, but also included interesting info:QuoteBlockFi has filed a motion requesting approval from the Bankruptcy Court to restore withdrawal activities for BlockFi Wallet accounts (Docket No. 121).  BlockFi anticipates this motion will be heard by the Bankruptcy Court at the hearing currently scheduled for January 24, 2023, at 10:00am ET.  While the motion is pending, withdrawals from BlockFi continue to be paused.  BlockFi also continues to ask clients not to submit any deposits to BlockFi Wallet or Interest Accounts.  BlockFi encourages clients to maintain their BlockFi app and account at this time.  Any claims filed against the Debtors will be addressed through the chapter 11 process.So the hearing regarding BlockFi's motion to allow clients' withdrawals from their \"wallet\" accounts will be held tomorrow morning. Unfortunately, if approved, you could only withdraw the balance held at the time of \"pausing\" withdrawals, which, I believe, according to BlockFi was 10th November at 8.15 pm, so before any pause had been properly communicated. Meaning people i.e. transferred their holdings from their Interest account to their Wallet account after that time, not only won't be able to withdraw but likely in the end will get less money as if the remaining funds were distributed proportionally to every creditor.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "January 27, 2023, 11:26:02 PM",
      "body": "Another interesting update directly from BlockFi this time. Full message below with the most important part highlighted.QuoteLast week, as part of our Chapter 11 process, we participated in our 341 Meeting, which is a customary meeting of creditors required for all companies who go through the Chapter 11 process. For anyone who was not able to join, this meeting was an opportunity for creditors to ask us about the state of BlockFi’s financial position and the Schedule of Assets & Liabilities we filed with the Court.Our clients asked a lot of great questions and we wanted to share the answers to three that were asked most frequently.1. What is the deadline to submit a proof of claim? Do I need to submit a claim?As part of the Chapter 11 process, creditors can submit a “proof of claim” form to indicate the amount they believe they are owed by BlockFi. Clients will not need to submit a claim if they agree with the amounts BlockFi filed for them in the Schedule of Assets and Liabilities. At this time, no action is needed from you regarding the proof of claim process. We will be in contact with all clients as the process moves forward.The Court has yet to set the bar date, or deadline, to file a proof of claim. Once the bar date is set, clients will receive information from our claims agent, Kroll, with their individual claim information and instructions regarding how to file a proof of claim if they believe a different amount is owed than what is reflected on the Schedule of Assets and Liabilities.2. What is the status of my Retail Loan?All retail crypto-backed loans remain in administrative forbearance. Clients should not send any amounts to BlockFi nor Scratch at this time.Any amounts due, including interest and maturity payments, are placed on hold until further notice. The interest rate on your loan will be set to 0% from November 11, 2022, onwards and clients will not be charged additional interest after November 11, 2022. Your loan will not be reported as delinquent to any credit bureaus.Clients should not make a payment at maturity while your loan is on hold, and there will be no late fees associated with any payments, including at maturity. Additionally, autopay has been turned off for your account, if it was enabled.The treatment of loans will be determined as part of the bankruptcy process. We intend to keep clients updated if there are changes to the status of their loan. Additional questions related to Retail Loans can be found here.3. What is the status of my BlockFi Card and how do I pay it?The BlockFi Rewards Card is paused and cannot be used to make purchases at this time and new cards are not being issued. The BlockFi Rewards Card is issued through a third party and any claims on account of such statements are not claims against BlockFi. Clients are required to continue to make their regular statement payments. Assets held on the BlockFi platform cannot be used towards these payments.At this time, however, payments can be made either through BlockFi’s portal or directly to the BlockFi Rewards Card provider, Deserve. For additional information, clients should refer to their cardholder agreement and can contact Deserve with any questions regarding fees or bill payment.BlockFi continues to provide updates on our Chapter 11 cases through our official channels, including our blog and Twitter. Additional information regarding our Chapter 11 cases, including court documents and claim information, can be found by visiting the website for BlockFi’s claims agent Kroll.Thank you.BlockFiThe Schedule of Assets and Liabilities they mentioned is available on >Kroll website< but it's pretty useless as the names and account numbers are redacted for data protection reasons and just showing as \"Name on file\", so can't verify if your balance is what it should be. So guess we're just waiting for BlockFi to contact each customer individually.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "February 06, 2023, 10:08:45 PM",
      "body": "Yet another email from BlockFi, confirms the deadline for filing Proof of Claim is set to 31 March 2023. They also confirm that there's no need to file such if you agree with the amount BlockFi stated in the Schedules of Assets and Liabilities. Within the coming days, Kroll will supposedly send info on how can we access and view our account balances.QuoteLast week, we took another important step in our chapter 11 proceedings. At the January 30th hearing, the Court approved our motion setting forth the procedures for the claims process. To protect our clients’ personal information, BlockFi received interim Court approval to redact clients’ names and other personal information from the Schedule of Assets and Liabilities.In the coming days, clients will receive information from our claims agent, Kroll, which will include information on how to view account balances, details regarding the client’s individual claim(s), deadlines for the proof of claim process, and instructions on how to file a proof of claim. Communications from Kroll will be sent via mail and/or by email to the address associated with your BlockFi account.BlockFi provided its claims agent, Kroll, with clients’ addresses and emails as of the Petition Date, November 28, 2022. If your address or email has since changed, or if you would like to confirm that your account details are accurate, please contact Kroll directly to update your information. Clients may contact Kroll at (888) 773-0375 (Toll Free) or (646) 440-4371 (International), or email blockfiinfo@ra.kroll.com.The general bar date, which is the deadline to submit proof of claims and applies to all clients, has been set for 5:00 P.M. (prevailing Eastern Time) on March 31, 2023. Clients will not need to submit a claim if they agree with the amounts that BlockFi filed for them in the Schedules of Assets and Liabilities.We understand that you may have questions during this process. Additional information regarding our chapter 11 proceedings, including the proof of claim process, can be found by visiting the website for BlockFi’s claims agent Kroll at https://restructuring.ra.kroll.com/blockfi.We will continue to communicate with our clients throughout this process as we work to maximize value for all clients and stakeholders.BlockFi",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "pawel7777",
      "created_time": "February 13, 2023, 10:44:10 PM",
      "body": "Two more email updates today, one from Kroll, 2nd from BlockFiKroll:QuotePlease find below links to the following important documents, related to the bankruptcy proceedings of BlockFi Inc., et al. (the \"Debtors\"), Case No. 22-19361, United States Bankruptcy Court for the District of New Jersey:  · Notice of Bar Dates for Submitting Proofs of Claim and Claims Under Section 503(b)(9) of the Bankruptcy Code Against the Debtors. General Bar Date: March 31, 2023, at 5:00 p.m. (prevailing Eastern time).    · Guide to Filling out Your Proof of Claim Form(s)  To file a proof of claim, to obtain a downloadable proof of claim form, or to obtain additional information on the Debtors’ cases free of charge, please visit https://restructuring.ra.kroll.com/blockfi/EPOC-Index.  PROOFS OF CLAIM MUST BE SUBMITTED BY MAIL, BY HAND, OR THROUGH KROLL RESTRUCTURING ADMINISTRATION LLC’S WEBSITE.  PROOFS OF CLAIM SUBMITTED BY FACSIMILE OR ELECTRONIC MAIL WILL NOT BE ACCEPTED AND WILL NOT BE DEEMED TIMELY SUBMITTED.All known creditors of the Debtors, as of the November 28, 2022 petition date, are listed on the Debtors’ Schedules of Assets and Liabilities (“Schedules”), filed with the Court on January 12, 2023.  In addition, the Debtors listed certain amounts held by clients in BlockFi Wallet Accounts on the Debtors’ Statements of Financial Affairs (“Statements”). To protect the confidentiality of individual clients in these cases, the names and addresses of clients are not detailed on the publicly filed Schedules and Statements.  Information relating to your Scheduled Claim(s) and/or your Wallet Account Balance(s) (as of November 10, 2022, at 8:15 pm prevailing Eastern Time (equivalent to November 11, 2022, at 1:15am UTC)) is below.  For additional information please contact Kroll by phone at 888.773.0375 (Toll-free) or 646.440.4371 (International).The Amount, Nature, and Priority of your Scheduled Claim(s) are set forth below.  If you agree with the nature, amount, and classification of your Claim as listed in the Debtors’ Schedules, and if you do not dispute that your Claim is only against the Debtor specified by the Debtors, and if your Claim is not described as “disputed,” “contingent,” or “unliquidated,” you need not submit a Proof of Claim. Otherwise, or if you decide to submit a Proof of Claim, you must do so before March 31, 2023, at 5:00 p.m. (prevailing Eastern time).BlockFi International Ltd. General Unsecured; Amount $[redacted]; Basis: BIABlockFi International Ltd.; General Unsecured; Amount $[redacted]; Basis: BIA InterestCustodial BlockFi Wallet Account contents as listed on Statement of Financial Affairs Question 21 are set forth below.  Clients do not have a Scheduled Claim for the below BlockFi Wallet Account.  (If you are not listed on the Debtors’ Statements as having Custodial BlockFi Wallet Account contents, no information will appear below.)Debtor: BlockFi International Ltd.; Currency Code: usdt; Value: [redacted]Debtor: BlockFi International Ltd.; Currency Code: eth; Value: [redacted]The amount stated (redacted) are as at 10 November 2022, at 8:15 pm prevailing Eastern Time, so when BTC was pretty low at below $16,000. The quote I got is over 20% less than per my statement at the end of October. Not ideal, but will probably accept that and won't be filing a proof of claim.2nd email from BlockFi:QuoteBeginning today, BlockFi clients will receive important information regarding the proof of claim process from BlockFi’s claims agent Kroll.Here are five things to know about BlockFi’s proof of claim process:1. You can now look up your listed claim(s) and BlockFi Wallet account balance onlineYou can check how BlockFi has listed your claim(s) in the Schedules of Assets and Liabilities (the “Schedules”) for BlockFi Interest Account, BlockFi Private Client, and Loans, as well as your BlockFi Wallet account balances, by visiting the website of BlockFi’s claims agent, Kroll, here.Here is an example of what you will find on your personalized dashboard on the Kroll website, which will include all of your claim(s) and your BlockFi Wallet account balances.2. You do not need to submit a claim if you agree with your scheduled amountIf you agree with your scheduled claim information and Wallet account balance(s), then you do not need to file a claim and no further action is required at this time.If you believe that your scheduled claim information is incorrect or incomplete, you may file a proof of claim. The bar date, or deadline to submit a proof of claim, is 5:00 P.M. (prevailing Eastern Time) on March 31, 2023.More information on how to understand your scheduled claim amount and fill out your proof of claim form can be found here by clicking the Client Guide to Filling Out Proof Of Claim Form(s).3. The Scheduled amounts are listed in U.S. dollars; BlockFi Wallet account balances are listed in cryptocurrencyThe dollar amounts listed on the Schedules are based on coin values as of November 28, 2022, the day BlockFi filed chapter 11. Please refer to the table in question 7b on the proof of claim form to see the price that was used to convert your in-kind cryptocurrency into U.S. dollars in the Schedules.BlockFi Wallet account balances are represented as cryptocurrency in-kind as of the platform pause, rather than dollar amounts, since they were not included in the Schedules.4. Clients will be receiving information from Kroll, BlockFi’s claims agentInformation regarding the proof of claim process will be sent to the email address associated with your BlockFi account and mailing address on file with BlockFi as of November 28, 2022, the Petition Date. Emails will be sent from BlockFiBankruptcyNoticing@noticing.ra.kroll.com. Please check your spam folder if you do not receive this email by February 14, 2023.5. Here is where you can turn for additional informationWe understand that you may have questions during this process. You can refer to our Proof of Claims FAQ for more information. Additional information regarding BlockFi’s chapter 11 proceedings, including the proof of claim process, can be found by visiting the website for BlockFi’s claims agent Kroll at https://restructuring.ra.kroll.com/blockfi. Clients may contact Kroll at (888) 773-0375 (Toll Free) or (646) 440-4371 (International), or email blockfiinfo@ra.kroll.com.BlockFiStrangely enough, the 2nd email is referring to the USD amount as at 28 November. I can't check the balances under the link provided, as it just won't load. Their servers mau be overloaded atm.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}