{
  "id": "topic_5415654",
  "title": "Shaha98",
  "author": "Shaha98",
  "created_time": "October 02, 2022, 04:24:17 AMLast edit: October 18, 2022, 03:07:05 AM by Shaha98",
  "content": "The price of Bitcoin increased drastically in late 2020 and early 2021. The price of Bitcoin touched about 72k dollars.But from there the price has come down to its lowest level. Bitcoin price is currently 19302 dollars but the possibility of Bitcoin price increase from here is very high.And I think Bitcoin price in 2023 Chances of reaching $100,000 per year are very high so if one wants to invest then now is the best time to invest in Bitcoin.If you invest at this time then you will definitely be able to reap huge benefits as I believe that Bitcoin price will increase greatly by 2023.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5415654",
  "comments": [
    {
      "author": "KennyR",
      "created_time": "October 02, 2022, 04:39:47 AM",
      "body": "Quote from: SeeBiscuit on October 02, 2022, 04:33:41 AMI personally think things are different now. The general public's view on crypto is kinda negative thanks to influencer shilling and the like. I think we may not see another spike like 72k until something major happens like covid to cause such a thing.Bitcoin price movement is cyclic and the same could drive the price reach new ATH. Based on the four year cyclical move we're getting closer to the days of marking the new ATH. The cyclical pattern can be calculated from the previous ath that is during the end months of 2021. Based on that calculation we'll get to see a new ath close to the days of upcoming halving.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shaha98",
      "created_time": "October 02, 2022, 04:42:42 AMLast edit: December 16, 2022, 12:18:43 AM by Shaha98",
      "body": "Quote from: SeeBiscuit on October 02, 2022, 04:33:41 AMI personally think things are different now. The general public's view on crypto is kinda negative thanks to influencer shilling and the like. I think we may not see another spike like 72k until something major happens like covid to cause such a thing.covid19 One of the factors that works as a plus point for Bitcoin. Covid-19 didn't start when people were retired, which is why more and more people are turning to cryptocurrencies. And everyone invested in all the coins including Bitcoin due to which cryptocurrency was destined to flourish.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "October 02, 2022, 04:45:59 AM",
      "body": "Quote from: Shaha98 on October 02, 2022, 04:24:17 AMThe price of Bitcoin increased drastically in late 2020 and early 2021. The price of Bitcoin touched about 72k dollars.But from there the price has come down to its lowest level. https://i.ibb.co/SwZRFXh/22b6e9eb5212.jpgBitcoin price is currently 19302 dollars but the possibility of Bitcoin price increase from here is very high.And I think Bitcoin price in 2023 Chances of reaching $100,000 per year are very high so if one wants to invest then now is the best time to invest in Bitcoin.If you invest at this time then you will definitely be able to reap huge benefits as I believe that Bitcoin price will increase greatly by 2023.I remember the ATH that bitcoin reached was $69k not $72k like you said, correct me if I'm wrong. The possibility of bitcoin hitting $100k or hitting a new ATH in 2023 is very unlikely, usually bitcoin will only hit a new ATH after each halving event, so predicting bitcoin reaching ATH in 2024-2025 will be much more feasible than predicting next year. It's all speculation and no one knows exactly when it might happen but I can only say for sure it will happen in the future. But buying bitcoin now is absolutely the right thing to do, bitcoin price is already a lot cheaper than its peak, the perfect time to buy bitcoin is now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mk4",
      "created_time": "October 02, 2022, 04:49:20 AM",
      "body": "If you meant lump sum investing, then I'd say probably not as there's simply too much economic uncertainty. On the other hand, if you meant investing in bitcoin by starting to dollar-cost average(which the majority should do), I'd say this price point is a good starting point.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Shaha98",
      "created_time": "October 02, 2022, 04:50:04 AMLast edit: October 18, 2022, 03:07:45 AM by Shaha98",
      "body": "Quote from: KennyR on October 02, 2022, 04:39:47 AMQuote from: SeeBiscuit on October 02, 2022, 04:33:41 AMI personally think things are different now. The general public's view on crypto is kinda negative thanks to influencer shilling and the like. I think we may not see another spike like 72k until something major happens like covid to cause such a thing.Bitcoin price movement is cyclic and the same could drive the price reach new ATH. Based on the four year cyclical move we're getting closer to the days of marking the new ATH. The cyclical pattern can be calculated from the previous ath that is during the end months of 2021. Based on that calculation we'll get to see a new ath close to the days of upcoming halving.Four years Bitcoin Chart 📉📈",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "AnotherAlt",
      "created_time": "October 02, 2022, 05:21:55 AM",
      "body": "Quote from: SeeBiscuit on October 02, 2022, 04:33:41 AMI personally think things are different now. The general public's view on crypto is kinda negative thanks to influencer shilling and the like. I think we may not see another spike like 72k until something major happens like covid to cause such a thing.You got the point, but that's not all. I am not a person for that kind of debate, but I got the point too. The more BTC spreads worldwide, the more possibility it will pump up. The world didn't have Covid19 in 2017. What miracle happened in 2017, then? On Jan 12, 2017, BTC touched the lowest price of that year which was $755. On Dec 14, 2017, BTC touched another ATH, $20,089. Jokes aside, You don't have to believe what I am saying. You can search yourself, or you can check here",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Obari",
      "created_time": "October 02, 2022, 05:42:30 AM",
      "body": "Quote from: SeeBiscuit on October 02, 2022, 04:33:41 AMI personally think things are different now. The general public's view on crypto is kinda negative thanks to influencer shilling and the like. I think we may not see another spike like 72k until something major happens like covid to cause such a thing.Yeah you're right about the negative attitude of people towards Bitcoin especially in developing countries maybe because of the stories heard of it. But from my time of research Bitcoin has fallen and also rose in the time past without any major global crisis though it is one of the major enhances and determinants of Bitcoin price movement.In response to the OP and in affirmation that now is the best time to buy Bitcoin though there is no wrong time to buying Bitcoin as all time is the right time but you must have to bear in mind of making profit which involves buying at a certain price and expecting to sell at an increased or higher price from the bought price.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "davis196",
      "created_time": "October 02, 2022, 05:58:22 AM",
      "body": "Nah, 2023 would most likely be as bearish as 2022. Would you mind sharing with us a bunch of reasons why you think that 2023 will be extremely bullish?This is the 1000th \"Now is the best time to invest in Bitcoin\" forum thread here.  There's no point of writing such forum threads.2024-2025 will be the bullish period, if you ask me. I really hope that the war in Ukraine will be over by 2024 and the global economy will start recovering from the high inflation, that is combined with FUD and fears of recession. If there are optimistic expectations about the global economy, the optimism will spread across the cryptocurrency markets and another bull run will come.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Henrobakkara",
      "created_time": "October 02, 2022, 06:16:24 AM",
      "body": "Quote from: Shaha98 on October 02, 2022, 04:24:17 AMThe price of Bitcoin increased drastically in late 2020 and early 2021. The price of Bitcoin touched about 72k dollars.But from there the price has come down to its lowest level. https://i.ibb.co/SwZRFXh/22b6e9eb5212.jpgBitcoin price is currently 19302 dollars but the possibility of Bitcoin price increase from here is very high.And I think Bitcoin price in 2023 Chances of reaching $100,000 per year are very high so if one wants to invest then now is the best time to invest in Bitcoin.If you invest at this time then you will definitely be able to reap huge benefits as I believe that Bitcoin price will increase greatly by 2023.I understand investing in Bitcoin at this time is not a bad idea even if some analysts still believe that the price might drop to around $12-$13K which might not also happen and that is why DCA is a good strategy so that we don't totally miss out catching some lower BTC price, however, I believe that $68-$69K+ was the highest BTC price went during the last ATH as against your $72K, when did that happen  From CMC From CG",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Editbar",
      "created_time": "October 02, 2022, 06:19:36 AM",
      "body": "Bitcoin recently touch twenty thousand dollars a lot of people want to take profits at these levels will they regretthat decision is Bitcoin going to go on a tear  this is a very psychological number for Bitcoin investors and everyone has their eyes on 20 thousand dollars if it goes up from here I mean is this the confirmation that the bear market is over and that we are that the bottom is in and we are moving up you know Toby is often saying we survived the UST collapse we survived the massive deleveraging events from Celsius and Voyager and Bitcoin went down to 17. what is going to happen next to bring Bitcoin even lower very sceptical that we're going to see muchlower lows than we have already but sotwenty thousand dollars is a big deal for Bitcoin",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "m2017",
      "created_time": "October 02, 2022, 06:21:26 AM",
      "body": "Quote from: davis196 on October 02, 2022, 05:58:22 AMNah, 2023 would most likely be as bearish as 2022. Would you mind sharing with us a bunch of reasons why you think that 2023 will be extremely bullish?This is the 1000th \"Now is the best time to invest in Bitcoin\" forum thread here.  There's no point of writing such forum threads.2024-2025 will be the bullish period, if you ask me. I really hope that the war in Ukraine will be over by 2024 and the global economy will start recovering from the high inflation, that is combined with FUD and fears of recession. If there are optimistic expectations about the global economy, the optimism will spread across the cryptocurrency markets and another bull run will come.Not most likely, but with a probability of 99%, 2023 will be bearish if forecasts are made based on bitcoin cycles. I am sure that OP will not be able to explain the reasons for his optimistic views on the next year, since these are just his personal optimistic expectations without any arguments. OP would like 2023 to be profitable for his investment in btc, but expectations and reality are usually very different.If we talk about the perfect time to invest in bitcoin, then this is voiced millions of times: the best time is now. In the long run, it will still pay off.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yazher",
      "created_time": "October 02, 2022, 08:33:57 AM",
      "body": "If you are someone who has some spare money to invest even in this kind of market we have right now, then you are good to invest. Just remember you might not gonna earn as much as when the ATH because of the current situation of the crypto world but if you are patient enough to hold it for long, then that would be the best thing you could do because you might have a chance to hold it until bitcoin halving and you just need to wait months after that, the old ATH will be reached again or a new ATH will be recorded.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "October 02, 2022, 08:35:03 AM",
      "body": "OP, you are saying banal things. I don't see a single spark of novelty that I haven't heard before. The fact that someday bitcoin will grow, or that it falls from time to time, happens regularly; your words are just a repetition of the mantra. The problem is that none of the predictors like you will tell you exactly the time and date of growth. Your post looks like fishing based on the posts you posted earlier, but again, it doesn't deserve merit. Do your best.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Rahul09",
      "created_time": "October 02, 2022, 09:39:48 AM",
      "body": "In fact, it is impossible to say what happens in the market. Maybe there is a bear market going on in Bitcoin now, so you might want to invest here. But I think now is not the right time to invest in Bitcoin. Because the market situation may worsen and the price of Bitcoin may decrease further. You can invest in Bitcoin now if you want but I would wait for Bitcoin to go down further.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "LFC_Bitcoin",
      "created_time": "October 02, 2022, 10:37:52 AM",
      "body": "Yep now is a great time to buy bitcoin. Bear markets are the time to accumulate, this is at conflict with average joe’s wired psychology though.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bitstar_coin",
      "created_time": "October 02, 2022, 10:45:42 AM",
      "body": "If you can, buy whatever you can afford because it is not easy to determine where will be bottom will be, you can buy periodically when there is price dip to dca. Those who are waiting for 15k and below may not be able to catch that price.This is accumulation phase, you can either be buying in small quantity, lump sum or earn it. As long as you understand that holding for long-term brings great benefits.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "8rch7",
      "created_time": "October 02, 2022, 11:01:33 AM",
      "body": "Quote from: yazher on October 02, 2022, 08:33:57 AMIf you are someone who has some spare money to invest even in this kind of market we have right now, then you are good to invest. Just remember you might not gonna earn as much as when the ATH because of the current situation of the crypto world but if you are patient enough to hold it for long, then that would be the best thing you could do because you might have a chance to hold it until bitcoin halving and you just need to wait months after that, the old ATH will be reached again or a new ATH will be recorded.Very true as you said if we have more money and have spare money we can invest in crypto currency especially in bitcoin currency, but if we don't have spare money it's better for you to invest elsewhere, because to invest in bitcoin certainly takes a very long time, because the price of bitcoin is now declining and the market is now not supportive of investing, but I personally will not invest in bitcoin and I prefer to invest elsewhere, because my finances are now is on the decline.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "October 02, 2022, 11:08:08 AM",
      "body": "Nobody can guarantee that Bitcoin won't eventually experience another major drop in the price. So, if someone invests now, it's possible that it is not the bottom, and investors will see temporary losses at some point. To help ensure that people are satisfied, it's important to understand that now is indeed a good time for investment, provided that a person believes in Bitcoin's eventual full recovery (which alone would bring more than 3x profits), likely further growth, and is also prepared and capable of hodling for what can be from several months to a few years.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "KaliLinux",
      "created_time": "October 02, 2022, 11:16:29 AM",
      "body": "Quote from: KennyR on October 02, 2022, 04:39:47 AMQuote from: SeeBiscuit on October 02, 2022, 04:33:41 AMI personally think things are different now. The general public's view on crypto is kinda negative thanks to influencer shilling and the like. I think we may not see another spike like 72k until something major happens like covid to cause such a thing.Bitcoin price movement is cyclic and the same could drive the price reach new ATH. Based on the four year cyclical move we're getting closer to the days of marking the new ATH. The cyclical pattern can be calculated from the previous ath that is during the end months of 2021. Based on that calculation we'll get to see a new ath close to the days of upcoming halving.I truly doubt if we are going to see a new ATH before the next Helvin with regards to this Bitcoin Rainbow Price ChartThe ATH of 2013 was in November and that of 2017 was in December so do you really think the market will see that before the next halving plus I don't also see a V shape recovery for the market which could only be the case for this to happen that is without periods of accumulation.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}