{
  "id": "topic_5437936",
  "title": "lorewayix",
  "author": "lorewayix",
  "created_time": "February 03, 2023, 02:32:34 PM",
  "content": "BTCAbout BantuPayBantuPay is a community driven, multi digital asset management infrastructure built on blockchain. It includes the simple and user-friendly BantuPay wallet that lets you send, receive, swap and store digital assets. BantuPay also has an API that enables blockchain developers to build their decentralized apps and wallets without having to worry about the low-level implementation details. We believe that working together as a community in the spirit of UBUNTU is better for everyone.The BantuPay infrastructure is maintained by the Bantu Blockchain Foundation (BBF), a not for profit organization created in 2020 to support the development of the Bantu blockchain.Bantu Blockchain applications and services ready to use from Day OneThe Bantu Blockchain Network is ready to be used from day one. It comes with applications and services which will give users access to the full functionality of the network and ecosystem. Through a fair incentive model, we believe that the creativity of our global community will be unleashed. The following applications and services are ready to support the community in interaction with the Bantu Blockchain Network.BantuPay WalletThe BantuPay wallet is a simple, secure and non-custodial wallet that lets you send, receive, swap and store digital assets. The BantuPay wallet is built on top of the BantuPay payment infrastructure with a free API for developers and integrators to use to plugin.Bantu Network DashboardThis presents an easy-to-use high level overview of the entire Bantu network in real time. A major convenience for anyone to be able to see how the network is running; the nodes that support the network, recent operations on the network, and other statistics that will be provided.Bantu Blockchain ExplorerThe Bantu Blockchain explorer makes it possible for anyone to browse, search and view all activities taking place on the Bantu Network transparently and in real time, this will ensure that transactions are easily tracked anytime by the users.Bantu LaboratoryThis is a tool for Bantu Network developers to perform tests and transactions using the network testnet and mainnet, it is like the wallet but more for developers. It enables developers to create a wallet, send and receive assets and carry out other operations.BantuTalk ForumBantuTalk is the Bantu Blockchain community forum created to offer a platform for sharing ideas and collaboration on Bantu Blockchain-related projects, DApps, protocols, and activities. It is where the vibrant community of users, developers and traders come to hangout.Bantu Network Token (XBN)The XBN is the native asset/token for the Bantu Network. It is a utility token that powers all operations and transactions on the network. Users who carry out transactions on the network pay transaction fees in XBN. The smallest unit of the Bantu Network Token is called a Spirit.1 Spirit = 0.0000001 XBNSecureAll your transactions are protected by industry-standard cryptography tools and techniques.FastAll your transactions are confirmed in less than 5 seconds.Low costMake all payments and other transactions for less than $0.001 per transaction.EmpoweringYou are in full control of all your money and digital assets all the time. Your wallet is non-custodial.TEAMhttps://bantufoundation.org/team/https://www.reddit.com/r/bantublockchainhttps://bantufoundation.org/https://bantublockchain.medium.com/",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5437936",
  "comments": [
    {
      "author": "lorewayix",
      "created_time": "February 05, 2023, 04:06:38 PM",
      "body": "Visa Collaborates with the Bantu Blockchain Foundation to Educate and Foster Financial Inclusion and Empowerment; in Africa and Other Emerging EconomiesThe world leader in digital payments Visa, is collaborating with the Bantu Blockchain Foundation (Bantu), custodians of the Bantu Blockchain Network infrastructure, to connect its digital asset-linked Visa cards to the Bantu Network Token (XBN), a utility token developed by Bantu to facilitate fast and secure transactions on the Bantu blockchain.Head of Social Impact in CEMEA for Visa, Carl Manlan also said “Visa believes that greater financial knowledge can empower people to better manage their money and improve their quality of life. We are delighted to partner with Bantu to help young people learn the fundamentals of personal finance, including budgeting, saving and responsible spending”Bantu is also joining Visa’s Fast Track Programme which makes it quicker and easier for Visa’s fintech partners to build and deliver new commerce experiences on Visa’s payments network. Bantu will be the first Africa-led Blockchain Infrastructure to enter this strategic partnershiphttps://cointelegraph.com/press-releases/visa-bantu-collaborate-to-foster-financial-inclusion-in-africa-other-economies",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}