{
  "id": "topic_5403873",
  "title": "Bthd",
  "author": "Bthd",
  "created_time": "June 24, 2022, 09:28:05 AM",
  "content": "https://etherscan.io/address/0x0d043128146654c7683fbf30ac98d7b2285ded00Harmony twitter duyurusuKöprüler bir zincirde işlem gerçekleştirdiğinizde diğer zincirde size eş değer bir bilet yaratır ve çıkış yapacağınız zaman tekrar tersinir işlem yaparak ana zincire geri dönersiniz. Sahte bilet yaratmanın bir yolu bulunduğundaysa havuz kolaylıkla boşaltılır. Geçmişteki saldırıların çoğu bu şekildeydi ancak Horizon Bridge farklı şekilde boşaltıldı. Platform 2/5 multisig wallet ile fonları korumaya çalışıyordu. Yani beş yetki sahibinden ikisinin kötü niyetli bir harekette bulunması tüm yatırımların çalınabileceği anlamına geliyordu. İki cüzdan işlemleri onaylayınca saldırı gerçekleşmiş oldu.Onaylayan adresler:Code:0x812d8622C6F3c45959439e7ede3C580dA06f8f250xf845A7ee8477AD1FB4446651E548901a2635A915Saldırgan aldığı bütün birimleri zincir üzerinde kilitlenme olasılığına karşılık ETH'ye swaplamış durumda (85,867.25 ether = 100m $). Ekip wBTC havuzlarının güvende olduğunu paylaşmış ama eklediğiniz likidite varsa kesinlikle çekin.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5403873",
  "comments": [
    {
      "author": "execijutiere",
      "created_time": "June 24, 2022, 05:38:45 PM",
      "body": "Yanlış bilmiyorsam bridgelerin hacklenme olasılığı daha yüksek. Çünkü bridgelerde kontratlara daha fazla emek ve daha fazla kod yazılması gerekiyor. Anlık bir açık veya yanlış yazılan/unutulan bir kod güvenlik açığı oluşturur. Bu hackerların veya açgözlü sinsi yazılımcıların hedefi haline gelir. Bu aralar acayip hacklenme olayları arttı. Aslında piyasaya güven biraz da bundan dolayı kaçıyor diyebiliriz. Yeterli derecede önlem alınmıyor firmalar tarafından. Önde gelen audit firmaları da artık eskisi gibi güven vermiyor bana kalırsa.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Bthd",
      "created_time": "June 24, 2022, 09:47:09 PM",
      "body": "Quote from: execijutiere on June 24, 2022, 05:38:45 PMYanlış bilmiyorsam bridgelerin hacklenme olasılığı daha yüksek. Çünkü bridgelerde kontratlara daha fazla emek ve daha fazla kod yazılması gerekiyor. Anlık bir açık veya yanlış yazılan/unutulan bir kod güvenlik açığı oluşturur. Bu hackerların veya açgözlü sinsi yazılımcıların hedefi haline gelir. Bu aralar acayip hacklenme olayları arttı. Aslında piyasaya güven biraz da bundan dolayı kaçıyor diyebiliriz. Yeterli derecede önlem alınmıyor firmalar tarafından. Önde gelen audit firmaları da artık eskisi gibi güven vermiyor bana kalırsa. Aynı zincir üzerinde haberleşmek çok kolay iken farklı zincirlerde bulunan en az iki farklı kontratın birbirleriyle sorunsuz iletişim kurmasını, senkronize çalışmalarını sağlamaları gerekiyor. Cross-chain köprüler için işin zor olan kısmı tam olarak bu.  Arada oluşabilecek en küçük yanlış tüm fonların yok olmasına sebep oluyor. Bir diğer zorluk ise gerçek birimlerin sürekli olarak platforma emanet konumunda olması. Bir BTC'yi köprüden geçirerek wBTC'ye çevirdiğinizde sizin elinizdeki gerçek bitcoinin sadece yansımasıdır, eşdeğeridir. Platformun kasasında size ait BTC durduğu sürece 1 BTC = 1 wBTC'dir ancak cüzdan bir şekilde boşalırsa elinizdeki 1 wBTC artık karşılıksız boş bir tokendir sadece.Bir birimi kendi zincirinde tutarak wrapped ve benzeri türevlerine sahip olmanın borsalara para emanet etmekten hiç farkı yok. Horizon olayında 2/5 multisig saçmalığı yüzünden ve bu konuda bir çok eleştiri almış olmalarına rağmen insanlar varlıklarını kaybetti.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bobita",
      "created_time": "June 25, 2022, 03:25:46 PM",
      "body": "wBıdıbıdılara asla güvenmedim zaten ve güvenmem.Birebir aynı senaryo değil tabii ama, düşünsene dolar alacaksın ve hırdavatçıya gidiyorsun, 100 dolar karşılığı para veriyorsun ve adam sana 100 dolar resmi basılmış bir kağıt veriyor ve diyor ki: \"Merak etme sana verdiğime karşılık gelen 100 doları çekmeceme koyacağım, garantisi bizzat benim abicim...\"",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ajanwalker",
      "created_time": "June 25, 2022, 05:36:25 PM",
      "body": "Bu köprüler ve defiler ne yazık ki çok fazla patlıyor. Hack problemine çözüm bulunamadı. Bir de köprüler ile iş yapmak hiç mantıklı değil bence.En güzeli ne alacaksan git borsadan al ne yapacaksan yap. Ferrum'un da böyle köprü olayı oldu. Patlama yapar diye düşünüyordum ama yeterli talep görmedi.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "June 27, 2022, 09:00:42 PM",
      "body": "Ne ilk olacak ne de son olacak bu köprülerin boşaltılması, her gün farklı bir ağın köprüsünü boşaltıyorlar.Neden 2 onayda işlem bitiyor mesela, mantıken zaten 5 kişilik bir onay mekanizması var hadi sen bunu çoğunluk diye 3 yaparsın, salak saçma işler. Şu onay saçmalığını 5/5 yapmaları lazım, işlemler uzayabilir ama daha güvenli olacağını düşünüyorum.Gram güvenmiyorum ben bu köprülere cartlara curtlara, param kendi cüzdanımda dursun.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mandown",
      "created_time": "June 28, 2022, 09:33:21 AM",
      "body": "Quote from: MK-74 on June 27, 2022, 09:00:42 PMNe ilk olacak ne de son olacak bu köprülerin boşaltılması, her gün farklı bir ağın köprüsünü boşaltıyorlar.Neden 2 onayda işlem bitiyor mesela, mantıken zaten 5 kişilik bir onay mekanizması var hadi sen bunu çoğunluk diye 3 yaparsın, salak saçma işler. Şu onay saçmalığını 5/5 yapmaları lazım, işlemler uzayabilir ama daha güvenli olacağını düşünüyorum.Gram güvenmiyorum ben bu köprülere cartlara curtlara, param kendi cüzdanımda dursun.Paran her ne kadar kendi cüzdanında dursada diğer networkler için köprüleri kullanmak zorundayız birileri para koyacakki o taraflara para aktarabilelim.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "MK-74",
      "created_time": "June 28, 2022, 01:40:21 PM",
      "body": "@mandown  Tercih meselesi tabiki ama ben çok sıcak bakmıyorum.Bugün bu köprüden çalınan 36.000 Ethereum hareket ettirildi ve Tornado Cash'e gönderildi, burada takip olayını bitirip paraları yiyecekler.Kalan ethereumları da aynı şekilde işlem yapıp, takibini bitirecekler.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "zonefloor",
      "created_time": "June 28, 2022, 05:01:54 PM",
      "body": "Şu son günlerde böyle haberler çok çıkmaya başladı. Önceki dönemlerde de çok çıkıyordu fkat gerçekten hack mi değil mi insanın aklını karıştıran nokta burası. Piyasalar çok iyi giderken bu hack olaylarını çok nadir duyuyoruz fakat piyasalar kötüye gittiği anda hack olayları başını alıp gidiyor. Ben artık bunları çalanların sıradan hırsızlar olduğuna inanmıyorum takım ve birlikteliğinde yapıldığını düşünüyorum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}