{
  "id": "topic_5433583",
  "title": "Crypt0Gore",
  "author": "Crypt0Gore",
  "created_time": "January 09, 2023, 08:09:17 AM",
  "content": "I am still building my long term crypto portfolio and I've add almost all available crypto genres to my wallet including • Play to Earn • Layer 0, 1, 2 • A.I Projects • Move to Earn • Storage & Data etcBut I have not add any gambling token to my list at all, I went on coin market cap and I saw many gambling tokens, I never knew they are that much in number. My questions is • Is there any reason to add gambling tokens to my crypto portfolio? What drives their value? Do they appreciate in value just like other altcoins whenever we are in a bull market? • If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5433583",
  "comments": [
    {
      "author": "Beparanf",
      "created_time": "January 09, 2023, 08:15:51 AM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AM• Is there any reason to add gambling tokens to my crypto portfolio? What drives their value? Do they appreciate in value just like other altcoins whenever we are in a bull market? • If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why? Most gambling tokens perform poorly in terms of price growth because it’s designed as reward tokens for user that play in the casino although they have other utility but the emission rate is always greater than it’s benefits plus the team is using a portion of its supply for marketing which makes the liquidity drained to dump the price. This kind of token is good for investment once all the token supply is already mined.Token burn coming from buy back is what makes the price for this token drive up. But it all depends on casino profitability minus the expenses.BFG is the most successful gambling token while the price is currently on the deepest part. I believe this is the best gambling token for me to invest based on current condition. You can add FUN and OWL since they are both a good contender to BFG.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "RILWAN",
      "created_time": "January 09, 2023, 08:20:01 AM",
      "body": "DYOR if you ask source question in a discussion forum as this, you may have misleading information from token chillers who will want to influence for their token.Since you already know about the coin market cap you can make your choice from that place, we also have a few of them who have their presence here in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "January 09, 2023, 08:25:34 AM",
      "body": "Take a look at every platform that has tokenized themselves. To my knowledge all the tokens end up basically worthless so I wouldn't add any toke s to my portfolio.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cantsay",
      "created_time": "January 09, 2023, 09:11:36 AM",
      "body": "I currently don't have any gambling token in my portfolio because I fear that they won't do well in the future. And since you plan on going for a long term investment I will advice that you do your own research combined with all the suggestions you will get from this thread. Quote from: RILWAN on January 09, 2023, 08:20:01 AMDYOR if you ask source question in a discussion forum as this, you may have misleading information from token chillers who will want to influence for their token.Exactly, most users here are team member of some certain gambling site and you wouldn't expect them to talk bad about their project all they are going to do is to try as much as possible to promote their project even if they know that their project have no future. And again for those that are not in anyway affiliated with any gambling might end up giving advice/suggestions based on the experience they got from just one project.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ryzaadit",
      "created_time": "January 09, 2023, 09:26:09 AM",
      "body": "Most of the gambling tokens focused on sharing revenue from the platform.However, all-will be depends on the token price you're entering + the revenue has been made by the platform. But in my opinion, a gambling platform who offering an investment with tokens & without tokens. Using a token, have more risk rather than without a token (Shares).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Desmong",
      "created_time": "January 09, 2023, 09:33:29 AM",
      "body": "It all depends on the token project and the casino involved because there are some casinos that are always promoting there coin using different influencers on different social media like YouTube, Twitter, Facebook, Telegram and many more so that gamblers can see good reasons to buy and hold there token. There some casino that are going extra miles to have a huge market cap.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Kakmakr",
      "created_time": "January 09, 2023, 09:35:44 AM",
      "body": "I do not see the need for those \"gambling\" tokens... other than some casinos making more money out of the gambling tokens that they developed. Most of these tokens have zero utility, because it cannot be used for anything else... other than using it for gambling.  If you want to invest in one token that has some utility and trading value, then go with the FUN token that are used on one of the biggest and oldest Crypto casinos, called Freebitco.in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "piebeyb",
      "created_time": "January 09, 2023, 09:43:25 AM",
      "body": "you think that 2025 is a bull market and believe that all gambling tokens will have a high value along with the price of bitcoin and other cryptos, I'm not sure about that either, but I don't recommend gambling tokens as an investment but to get benefits I think it's possible, because usually casinos issuing their tokens to share the benefits only and not on the value, but all the risk returns to you, I'm not sure I can choose a good gambling token for you",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "January 09, 2023, 09:58:11 AM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AM• Is there any reason to add gambling tokens to my crypto portfolio? What drives their value? Do they appreciate in value just like other altcoins whenever we are in a bull market? • If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why? None, I will not add any gambling token. The only reason I can have them is the reward or customer advantage of the user's that have it on the gambling site they are, aside that, I can not have it. Presently I am not having any gambling token. I do make research on coins, not because they are gambling tokens but about how their future can be is what I look into before taking any coin, no gambling token on my list as at now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypt0Gore",
      "created_time": "January 09, 2023, 10:38:14 AM",
      "body": "Quote from: Kakmakr on January 09, 2023, 09:35:44 AMI do not see the need for those \"gambling\" tokens... other than some casinos making more money out of the gambling tokens that they developed. Most of these tokens have zero utility, because it cannot be used for anything else... other than using it for gambling.  If you want to invest in one token that has some utility and trading value, then go with the FUN token that are used on one of the biggest and oldest Crypto casinos, called Freebitco.in.   The same FUN token? Wow I don't know that this token belongs Freebitco.in, I used this platform to get some Satoshis some time ago, I was hesitant to buy any gambling token because I wasn't so sure why they existed in the first place that's I created this topic but thanks for your contribution, I will look into FUN token right away and stay away from the rest.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Daltonik",
      "created_time": "January 09, 2023, 10:59:17 AM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AMI am still building my long term crypto portfolio and I've add almost all available crypto genres to my wallet including • Play to Earn • Layer 0, 1, 2 • A.I Projects • Move to Earn • Storage & Data etcBut I have not add any gambling token to my list at all, I went on coin market cap and I saw many gambling tokens, I never knew they are that much in number. My questions is • Is there any reason to add gambling tokens to my crypto portfolio? What drives their value? Do they appreciate in value just like other altcoins whenever we are in a bull market? • If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why? You can easily look at gambling tokens on coinmarketcap and evaluate their potential for your investment opportunities yourself, there are quite a lot of them you can choose from the 58 tokens presented on cmc: https://coinmarketcap.com/view/gambling/",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "tbct_mt2",
      "created_time": "January 09, 2023, 11:19:42 AM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AMI am still building my long term crypto portfolio and I've add almost all available crypto genres to my wallet including • Play to Earn • Move to Earn Project developers and early investors will earn from late comers. You will have serious losses by holding Play to Earn, Move to Earn tokens.Quote• Layer 0, 1, 2I only know of Layer 1, Layer 2 projects. What is Layer 0?Invest in Layer 1 projects is better than Layer 2 projects.Quote• A.I Projects • Storage & Data etcAI projects are hot lately but with Storage & Data projects, they are not new. I would like to choose Storage & Data projects with Proof of Work algorithms, not Proof of Stake algorithms.QuoteBut I have not add any gambling token to my list at all, I went on coin market cap and I saw many gambling tokens, I never knew they are that much in number.FUN token from Freebitco.inOWL token from Owl.games",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "len01",
      "created_time": "January 09, 2023, 11:28:01 AM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AM-snip• Is there any reason to add gambling tokens to my crypto portfolio? What drives their value? Do they appreciate in value just like other altcoins whenever we are in a bull market? • If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why? there is no reason to add gambling tokens in my portfolio, because for me gambling tokens only have the function to bet on one gambling platform. although the utility is high but for me there is no reason to buy held as a futures investment. and as far as I know gambling tokens were created not only to bet, but also to promote the gambling platform. for driving the value of gambling tokens such as FUN tokens, of course, they will also have value when the BTC price rises when the bullish arrives, because all tokens still depend on the king of coins.I'm not going to recommend any gambling tokens as I haven't added anything to my portfolio myself, but you can consider all the suggestions from some of the replies of other members in this forum.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dimonstration",
      "created_time": "January 09, 2023, 11:39:03 AM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AM• If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why? If I were on your shoe, I will not on gambling tokens and focus on blockchain coins such us Bitcoin, Ethereum and others that is currently on down trend too. Most of this gambling tokens lost already the hype and you can see a same trend on all of this token which is downtrend. Gambling industry in web3 is not that hype anymore since centralized casino is still the top choice of gamblers.You will just burn money by investing on gambling tokens since most of them is still not finished on there token vesting for the circulating supply. I will wait for the perfect time when there’s no new token being mint before I purchase these tokens.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "robelneo",
      "created_time": "January 09, 2023, 11:41:05 AM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AM• Is there any reason to add gambling tokens to my crypto portfolio? What drives their value? Do they appreciate in value just like other altcoins whenever we are in a bull market?I have two BFG tokens and an Owl token the value of these tokens depends so much on the platform, the reputation of the platform and its roadmap, and how dedicated the development team is to accomplish what's on their roadmap like all the other coins/tokens in the market, it will appreciate and depreciate based in the market condition, but as long as you follow the development of the project. you can take the right action in every given situation, right now there is no safe coin/token/project only Bitcoin enjoys the trust of the whole community.Even if I recommend these two tokens to you I still recommend that you do your own research and invest what you can afford to lose.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "klidex",
      "created_time": "January 09, 2023, 11:47:52 AM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AM• Is there any reason to add gambling tokens to my crypto portfolio? What drives their value? Do they appreciate in value just like other altcoins whenever we are in a bull market?• If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why?For whether to add gambling tokens to the crypto portfolio.I think gambling tokens are better to only use when gambling or betting on certain gambling platforms and there is no benefit to saving in a crypto portfolio, especially saving for the long term because in my opinion it's just a waste of money and time because it has a very big risk and it is even more risky to keep gambling tokens than to keep Altcoins.In addition to getting gambling tokens from bonus results or for free, it is possible to store them in a crypto portfolio because we don't spend any money at all to be able to buy and own them.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Slow death",
      "created_time": "January 09, 2023, 12:45:35 PM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AM• Is there any reason to add gambling tokens to my crypto portfolio? I don't see any reason for you to buy these tokens from casinos, for example if you buy bitcoin, you will be expecting that in 4 years the price will go up a lot because there will be the halving, also the price in the past managed to reach $68000 and it just dropped a lot because the entire international market is going through a financial crisis due to the war in ukraine, so there is a high probability that this war will end sooner or later and the price will go back to 68000$ or more, so it's worth buying bitcoinQuote from: Crypt0Gore on January 09, 2023, 08:09:17 AMWhat drives their value? agreeing with the same thought I wrote above and at the same time answering your question, the truth is that there is nothing concrete that could lead to an increase in the price of these casino tokens, you can sit down and do research on your own and then decide ask what's special about these casino tokens you won't find anythingQuote from: Crypt0Gore on January 09, 2023, 08:09:17 AMDo they appreciate in value just like other altcoins whenever we are in a bull market? see this:Quote from: https://igaming.org/casino/is-casino-coin-a-good-investment/Having long-term potential also shows that the currency is stable and won’t experience drastic changes over time. Plus, having good long-term potential means that there should be plenty of room for growth for new investors looking to get into cryptocurrency for the first time.There are some that believe CasinoCoin may not be a good investment is that it may be difficult for beginners to understand how the technology works. For example, if you don’t understand computer code or technology, then you may have difficulty trading in casino coin or even using it at all. Additionally, there are likely going to be many different types of cryptocurrencies out there, and casino coin may not stand out enough compared to others to make it worth your while as an investor.One last possibility why casino coin may not be a good investment is that it may fall out of favor with casinos and thus become worthless in the future. In order for cryptocurrencies like casino coin to succeed, they need to find ways to appeal more broadly than just casino owners and players who want anonymity when gambling online or offline.in this article: https://igaming.org/casino/is-casino-coin-a-good-investment/You can see what I'm talking about, it raises crucial points that show the downside of investing in these casino tokens.Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AM• If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why? my answer is simple: no, this is not worth the time and risk, look for other altcoins or bitcoin to invest in, you said yourself that you had already invested in cryptos, is that not enough?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "gunhell16",
      "created_time": "January 09, 2023, 01:09:16 PM",
      "body": "Quote from: Crypt0Gore on January 09, 2023, 08:09:17 AMI am still building my long term crypto portfolio and I've add almost all available crypto genres to my wallet including • Play to Earn • Layer 0, 1, 2 • A.I Projects • Move to Earn • Storage & Data etcBut I have not add any gambling token to my list at all, I went on coin market cap and I saw many gambling tokens, I never knew they are that much in number. My questions is • Is there any reason to add gambling tokens to my crypto portfolio? What drives their value? Do they appreciate in value just like other altcoins whenever we are in a bull market? • If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why? If you really want to take a risk in the gambling token, I think I suggest you to add BFG(Betfury), because compared to other gambiing token this BFG for me has a good potentials to increase in the future especially when Bull run's back in the market. But this is just an opinion based on my experienced. However, You are focusing in the gambling token dude? Why not Bitcoin, Matic, Sol, BNB, and Ethereum?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Aanuoluwatofunmi",
      "created_time": "January 09, 2023, 01:09:31 PM",
      "body": "Quote from: Oshosondy on January 09, 2023, 09:58:11 AMQuote from: Crypt0Gore on January 09, 2023, 08:09:17 AM• Is there any reason to add gambling tokens to my crypto portfolio? What drives their value? Do they appreciate in value just like other altcoins whenever we are in a bull market? • If you are in my shoe right now, what gambling token do you think you can take a risk on and add to your crypto portfolio and why? None, I will not add any gambling token. The only reason I can have them is the reward or customer advantage of the user's that have it on the gambling site they are, aside that, I can not have it. Presently I am not having any gambling token. I do make research on coins, not because they are gambling tokens but about how their future can be is what I look into before taking any coin, no gambling token on my list as at now.Gamblers will not want to have this tokens with them for long provided that they were given into them as reward, also if we consider the numbers of the ones that have already existed but no more in place, no one will like to recommend one or even have them on the portfolio, just as you all have said, you can make more research on that but make sure you have it all that it has high disadvantage than you could see it presenting.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}