{
  "id": "topic_5406838",
  "title": "Kelvinid",
  "author": "Kelvinid",
  "created_time": "July 19, 2022, 11:37:35 AM",
  "content": "Who do we got here? Philipines has a very tempting odds with 6.81, what do you think, should we go with the ML or the handicap. Here's the spread Philippines +13.5Japan -13.5over/under 170.5Check it out. https://sportsbet.io/sports/event/basketball/international/asia-ch-ship/japan-vs-philippines-62d559770be0f8e06309b2d0",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5406838",
  "comments": [
    {
      "author": "Natalim",
      "created_time": "July 19, 2022, 12:07:18 PM",
      "body": "I'm rooting on the Philippines to win, I know they are not as good as they are before but Japan is a team where the Philippines can compete with, so I hope they have that eagerness to win and believe that they can upset the heavy favorite team. I'll put a bit of moneyline bet and betting a decent amount on the spread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 19, 2022, 03:36:48 PM",
      "body": "After I saw the previous match Japan vs. Iran with a score (88-76) and the Philippines had to lose against New Zealand with a score (75-92), it seems the Philippines should really prepare themselves in the FIBA ​​Asia Cup, to beat Japan today.What I saw both teams were both successful in basketball, but as far as I know the Philippines today will face different Japanese players, they have to work hard to fight and beat Japan, but Japan also doesn't stay silent.To be honest, for me personally the basketball match Japan vs. The Philippines today, I tend to believe that Japan has the highest score, this is my consideration.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "July 20, 2022, 05:54:55 PM",
      "body": "Quote from: YOSHIE on July 19, 2022, 03:36:48 PMAfter I saw the previous match Japan vs. Iran with a score (88-76) and the Philippines had to lose against New Zealand with a score (75-92), it seems the Philippines should really prepare themselves in the FIBA ​​Asia Cup, to beat Japan today.What I saw both teams were both successful in basketball, but as far as I know the Philippines today will face different Japanese players, they have to work hard to fight and beat Japan, but Japan also doesn't stay silent.To be honest, for me personally the basketball match Japan vs. The Philippines today, I tend to believe that Japan has the highest score, this is my consideration.Japan dominated the Philippines in the said match-up (102-81) and it was the reason why the Gilas Pilipinas didn't made to be in the Top 8, it was somehow clear that the Philippine team now wasn't that prepared to face other international teams this time. I mean, the Philippine team was good but clearly not enough to avoid elimination.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 20, 2022, 10:19:27 PM",
      "body": "What a game, no hope. The problem are not the players but the management and coaching staff. You know that there's an issue about it and it's all about Chot and his pride. Again, after so many years that Philippines have been dominant against Japan, they've lost.Well, Gilas still has Fiba world cup 2nd round and I hope that there won't be anymore politics about it. We all want the team to win and just like Japan's management, they've allowed their best players to play.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Baofeng",
      "created_time": "July 20, 2022, 11:41:48 PM",
      "body": "Quote from: blockman on July 20, 2022, 10:19:27 PMWhat a game, no hope. The problem are not the players but the management and coaching staff. You know that there's an issue about it and it's all about Chot and his pride. Again, after so many years that Philippines have been dominant against Japan, they've lost.Well, Gilas still has Fiba world cup 2nd round and I hope that there won't be anymore politics about it. We all want the team to win and just like Japan's management, they've allowed their best players to play.Oh well, we missed the top 8 and obviously, PH basketball has been going down, we lost the medal in the Sea Games against Indonesia and this one.I think heads should roll in this one, Coach Chot has lost it really and we should overhaul the system again so that we can go back and be competitive in the world level.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "YOSHIE",
      "created_time": "July 21, 2022, 02:47:59 PM",
      "body": "Quote from: Japinat on July 20, 2022, 05:54:55 PMthe Philippine team was good but clearly not enough to avoid elimination.The philippines have a lot of fans here, but i was already haunted by doubts, when they were beaten by a new zealand team in the FIBA ​​Asia basketball game yesterday.Unfortunately, I didn't place a bet for the Japan team vs. Philippines, I just watched it, I saw at the beginning of the match, I thought the Philippines was better, apparently not, Japan was stronger in the first quarter, two and three, which ended 102-81 yes, Japan to the final of FIBA ​​Asia Cup 2022 now.Honestly, I admit the Filipino team played they didn't give up and continued to improve and catch up, but fate willed on Japan for this FIBA ​​Asia basketball tournament/final, I also noticed in the first and second quarters, it seems that the Philippines is no longer possible.I'm curious as to @Kelvinid, did he bet for Japan yesterday or the Philippines on sportsbet.io.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Cointxz",
      "created_time": "July 21, 2022, 02:53:30 PM",
      "body": "^Simply because many Filipino user here that loves basketball, Honestly I really want to support the Gilas but there current roster is not on competitive level compared before plus the coaching style didn’t improved at all and just use the traditional way which is proven not working anymore, Before we have a lot of small shooter player but now we can’t compete anymore at that game.The odds is really tempting but it’s obviously a trap if you knew how bad the Philippines team right now.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 21, 2022, 08:43:59 PM",
      "body": "Quote from: Baofeng on July 20, 2022, 11:41:48 PMQuote from: blockman on July 20, 2022, 10:19:27 PMWhat a game, no hope. The problem are not the players but the management and coaching staff. You know that there's an issue about it and it's all about Chot and his pride. Again, after so many years that Philippines have been dominant against Japan, they've lost.Well, Gilas still has Fiba world cup 2nd round and I hope that there won't be anymore politics about it. We all want the team to win and just like Japan's management, they've allowed their best players to play.Oh well, we missed the top 8 and obviously, PH basketball has been going down, we lost the medal in the Sea Games against Indonesia and this one.I think heads should roll in this one, Coach Chot has lost it really and we should overhaul the system again so that we can go back and be competitive in the world level.And he's the best coach in the PBA. What a shame, even international commentators are telling what to do and was not liking the strategy of Chot. He's not giving a lot of playing time to those players like Lopez. He should do better and hopefully when the next round for Fiba world cup would come, he's not the one to coach the team. The SBP should hear the people out and remove this shit politics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Japinat",
      "created_time": "July 21, 2022, 09:44:55 PM",
      "body": "Quote from: YOSHIE on July 21, 2022, 02:47:59 PMQuote from: Japinat on July 20, 2022, 05:54:55 PMthe Philippine team was good but clearly not enough to avoid elimination.The philippines have a lot of fans here, but i was already haunted by doubts, when they were beaten by a new zealand team in the FIBA ​​Asia basketball game yesterday.Unfortunately, I didn't place a bet for the Japan team vs. Philippines, I just watched it, I saw at the beginning of the match, I thought the Philippines was better, apparently not, Japan was stronger in the first quarter, two and three, which ended 102-81 yes, Japan to the final of FIBA ​​Asia Cup 2022 now.Honestly, I admit the Filipino team played they didn't give up and continued to improve and catch up, but fate willed on Japan for this FIBA ​​Asia basketball tournament/final, I also noticed in the first and second quarters, it seems that the Philippines is no longer possible.I'm curious as to @Kelvinid, did he bet for Japan yesterday or the Philippines on sportsbet.io.For a long time, the Philippine basketball team has been dominating other teams in the FIBA Asia and in fact the team have always made it to the qualifying round or the top 8 for years and has been defeating the team of Japan for 19 years, this is the first time the team lost to Japan and Japan had a blowout win.There were many issues as why the Philippine team now didn't performed well and was eliminated recently. I can say that the players ain't the issue here and it's the coaches and staff's who is at fault, now, they are playing blaming each other.In any case, the Philippine team will recover and take this loss as a personal one to improve in the next years. Also, there's this rumor that Jordan Clarkson will play for the team next year but I think it's still premature to determine it this early.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "goaldigger",
      "created_time": "July 21, 2022, 09:53:33 PM",
      "body": "Quote from: Coin_trader on July 21, 2022, 02:53:30 PM^Simply because many Filipino user here that loves basketball, Honestly I really want to support the Gilas but there current roster is not on competitive level compared before plus the coaching style didn’t improved at all and just use the traditional way which is proven not working anymore, Before we have a lot of small shooter player but now we can’t compete anymore at that game.The odds is really tempting but it’s obviously a trap if you knew how bad the Philippines team right now.  The result is really bad and as expected, we loss to Japan in their last game. Though I’ve heard many good players to play with Gilas next especially with the NBA player Jordan Clarkson and I hope this is true because seriously, our basketball team needs to be more composed and a good player like JC can be a big impact to the team. I hope for our Gilas team to have more practice time and bond as a team not an individual player.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "serjent05",
      "created_time": "July 21, 2022, 10:04:49 PM",
      "body": "Quote from: blockman on July 20, 2022, 10:19:27 PMWhat a game, no hope. The problem are not the players but the management and coaching staff. You know that there's an issue about it and it's all about Chot and his pride. Again, after so many years that Philippines have been dominant against Japan, they've lost.Well, Gilas still has Fiba world cup 2nd round and I hope that there won't be anymore politics about it. We all want the team to win and just like Japan's management, they've allowed their best players to play.I hope the Philippine Basketball will come in the next cup more than prepared.  The Philippine Basketball team has the skill, the height, and strength I hope all of them will be properly used next time.  And yes it is due to politics that our players are unable to play at full strength.  I hope their scouts and coaches will do their best on scouting other teams' strengths and weaknesses and apply a proper gameplay strategy to outwit them.  They should also designate a proper team composition for each opposing team to stop their scorers and at the same time score for the team.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "crzy",
      "created_time": "July 21, 2022, 10:12:21 PM",
      "body": "We loss, despite of having a good players they are unable to showcase their real talents. I think the problem here is about the coaching staff and the system that we have right now, the mother teams of the players should allow their start player to easily practice with the national team but because of too much politics, we are seeing a bad standing of Philippine Basketball.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "jakelyson",
      "created_time": "July 21, 2022, 10:48:57 PM",
      "body": "Quote from: goaldigger on July 21, 2022, 09:53:33 PMQuote from: Coin_trader on July 21, 2022, 02:53:30 PM^Simply because many Filipino user here that loves basketball, Honestly I really want to support the Gilas but there current roster is not on competitive level compared before plus the coaching style didn’t improved at all and just use the traditional way which is proven not working anymore, Before we have a lot of small shooter player but now we can’t compete anymore at that game.The odds is really tempting but it’s obviously a trap if you knew how bad the Philippines team right now.  The result is really bad and as expected, we loss to Japan in their last game. Though I’ve heard many good players to play with Gilas next especially with the NBA player Jordan Clarkson and I hope this is true because seriously, our basketball team needs to be more composed and a good player like JC can be a big impact to the team. I hope for our Gilas team to have more practice time and bond as a team not an individual player. We are expecting Kai Sotto and JC to play on 2023 FIBA qualifier together with june mar, dwight and japeth. PBA will give way also so that they can have longer practice time together. Hopefully this is true so we can have a better chance in entering FIBA world cup. That is our chance to redeem ourselves. We are a proud basketball nation but indonesia and japan are beating us now. Those nations have improved a lot with their game and we are being left behind.Quote from: crzy on July 21, 2022, 10:12:21 PMWe loss, despite of having a good players they are unable to showcase their real talents. I think the problem here is about the coaching staff and the system that we have right now, the mother teams of the players should allow their start player to easily practice with the national team but because of too much politics, we are seeing a bad standing of Philippine Basketball. We did not send our best players because of pba have an ongoing conference. I think they have recognized that as a mistake and will have only two conference next season. Hopefully SBP and others involved will do away with politics as well so we can provide a better system and coaching staffs to our next gilas rosters.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "July 21, 2022, 11:54:06 PM",
      "body": "Quote from: Coin_trader on July 21, 2022, 02:53:30 PMHonestly I really want to support the Gilas but there current roster is not on competitive level The current roster is good and should be able to compete in Asian Basketball but their potential is not fully utilized because of poor coaching. Coach Chot uses the system back in the former Gilas he used to handle which is not effective now to young cores. He is not also good at rotating players because, in the first place, he really didn't know their respective roles.The same roster was handled by Coach Tab in the qualifiers but they shock the world with that young lineup.What's the problem now? Players or Coach? The answer is obvious.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 22, 2022, 08:28:36 PM",
      "body": "Quote from: serjent05 on July 21, 2022, 10:04:49 PMQuote from: blockman on July 20, 2022, 10:19:27 PMWhat a game, no hope. The problem are not the players but the management and coaching staff. You know that there's an issue about it and it's all about Chot and his pride. Again, after so many years that Philippines have been dominant against Japan, they've lost.Well, Gilas still has Fiba world cup 2nd round and I hope that there won't be anymore politics about it. We all want the team to win and just like Japan's management, they've allowed their best players to play.I hope the Philippine Basketball will come in the next cup more than prepared.  The Philippine Basketball team has the skill, the height, and strength I hope all of them will be properly used next time.  And yes it is due to politics that our players are unable to play at full strength.  I hope their scouts and coaches will do their best on scouting other teams' strengths and weaknesses and apply a proper gameplay strategy to outwit them.  They should also designate a proper team composition for each opposing team to stop their scorers and at the same time score for the team.We all want to but the problem is the coaching staff and their pool of talents are being limited because of the PBA. That's politics there and the SBP or the organization that manages the Gilas are playing politics into it. They don't want the team to prosper and all they do is allow this coach to replace the good one, CTB to coach the team. No doubt that CTB really wants to prosper the team since he's seen passion not just from the team and players but also in our country and that's why he's eager in aiming for top finishes in these leagues. But with their current coach? They should be able to see that all fans want him out.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "chaser15",
      "created_time": "July 23, 2022, 02:54:48 AM",
      "body": "Quote from: blockman on July 22, 2022, 08:28:36 PMWe all want to but the problem is the coaching staff and their pool of talents are being limited because of the PBA. In the next qualification next year, the Gilas will now be composed of PBA players. There should be no problem as these players are used to playing on Coach Chot's system and since it's PBA, they already know how Coach Chot is handling his players.But for some reason that the Gilas pool will be composed of young prospects, they shouldn't be handled by Coach Chot but instead, Coach Tab. However, that won't be possible without SBP's approval.To summarize:if PBA players = Coach Chotif Young pool = Coach TabThat should work.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "blockman",
      "created_time": "July 23, 2022, 08:42:26 PM",
      "body": "Quote from: chaser15 on July 23, 2022, 02:54:48 AMQuote from: blockman on July 22, 2022, 08:28:36 PMWe all want to but the problem is the coaching staff and their pool of talents are being limited because of the PBA. In the next qualification next year, the Gilas will now be composed of PBA players. There should be no problem as these players are used to playing on Coach Chot's system and since it's PBA, they already know how Coach Chot is handling his players.But for some reason that the Gilas pool will be composed of young prospects, they shouldn't be handled by Coach Chot but instead, Coach Tab. However, that won't be possible without SBP's approval.To summarize:if PBA players = Coach Chotif Young pool = Coach TabThat should work.Good idea, if SBP won't remove Chot as the main coach for the Gilas, they should make it comfortable for him to manage the players that he used to coach in the PBA.But if it's about the younger players, they should really consider changing it and replace him with CTB whom is more aware and better in managing those young talents.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Johnyz",
      "created_time": "July 23, 2022, 09:27:20 PM",
      "body": "Quote from: blockman on July 23, 2022, 08:42:26 PMQuote from: chaser15 on July 23, 2022, 02:54:48 AMQuote from: blockman on July 22, 2022, 08:28:36 PMWe all want to but the problem is the coaching staff and their pool of talents are being limited because of the PBA. In the next qualification next year, the Gilas will now be composed of PBA players. There should be no problem as these players are used to playing on Coach Chot's system and since it's PBA, they already know how Coach Chot is handling his players.But for some reason that the Gilas pool will be composed of young prospects, they shouldn't be handled by Coach Chot but instead, Coach Tab. However, that won't be possible without SBP's approval.To summarize:if PBA players = Coach Chotif Young pool = Coach TabThat should work.Good idea, if SBP won't remove Chot as the main coach for the Gilas, they should make it comfortable for him to manage the players that he used to coach in the PBA.But if it's about the younger players, they should really consider changing it and replace him with CTB whom is more aware and better in managing those young talents.Probably there’s an issue between the SBP and Coach Tab that’s why he will not come back despite of our calls for him to lead the team. There’s so much issues with the SBP, I think we need a total change if we want to back in a winning column again. There’s still time and we still have those good players, this is not an issue with the players anymore the coaching staff should be more aware of this. There’s so many disappointed losses with our Gilas, they should rise again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "harizen",
      "created_time": "July 23, 2022, 09:33:27 PM",
      "body": "Quote from: blockman on July 23, 2022, 08:42:26 PMGood idea, if SBP won't remove Chot as the main coach for the Gilas, they should make it comfortable for him to manage the players that he used to coach in the PBA.But if it's about the younger players, they should really consider changing it and replace him with CTB whom is more aware and better in managing those young talents.There was no sign that Coach Chot will be replaced. Therefore, it's good that Gilas will be full of PBA players in the next qualification that knows already how Coach Chot's system works. In that way, players will be comfortable as they are already being handled by Coach Chot. But most of these players are now veterans or currently on their post-prime status now. But if the wind changed that Coach Chot will be replaced by whoever, they should still force that said lineup and try to acquire the rights of Jordan Clarkson like what they did before. As for me, I'd rather like the young lineup that was handled by Coach Tab after their impressive performance on their FIBA debut. No one even thinks that they can be competitive like that in the international arena.There's also a concern that why PH is not using any naturalized players. I don't know the reason but since that issue was raised, there's now a call to immediately grant Justin Brownlee his naturalized player status where he shows interest in playing for the national squad last April.Anyways back to the topic, since this game already ends, OP can now consider locking the thread.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}