{
  "id": "topic_5410548",
  "title": "IustinVV",
  "author": "IustinVV",
  "created_time": "August 20, 2022, 12:40:19 AM",
  "content": "Hello. A day ago my laptop was stolen, we live in a small town (around 700 people) so it wasnt hard to find the thief with camera recording at all. In a few hours span ,he moved my coins from my ltc address to stake.com (around 450$) , I was able to only withdraw 60$ of the balance,at the time he was caught. Police cant do much since he is under 18 and they dont even know much about crypto ( small police department from another town,we dont even have one here). I tried to solve with him but he says he needed them money to pay someone and he did (bullshit in my opinion). I contacted stake.com live chat and they said they cant help, I tried talking with a manager maybe he will be able to help but I couldnt reach any of them. I know 450$ isnt much , I know it is partially my fault and not much could be done, but cant stake understand my situation? I can provide a police statement to them to see how it happened and video of my laptop being stolen, maybe that can help.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5410548",
  "comments": [
    {
      "author": "gumusi",
      "created_time": "August 20, 2022, 12:57:48 AMLast edit: August 20, 2022, 01:38:35 AM by gumusi",
      "body": "It would be very generous of STAKE.com to compensate you...Relying on a police report to verify the legality of a blockchain transaction is against the Raison d'être of crypto currencies. It can even be argued that part of the luxury crypto currencies afford is that you don't have to rely on a police force for your own security, in any case I hope you recover your stolen funds.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IustinVV",
      "created_time": "August 20, 2022, 01:09:18 AM",
      "body": "I mean a police reports that presents my case with the laptop being stolen,they dont involve in this crypto things. I am sure I can get a statement from them tomorrow",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Z-tight",
      "created_time": "August 20, 2022, 01:18:51 AM",
      "body": "You must first of all take it that bitcoin transactions are irreversible.Now, your funds were moved to a stake address, i don't know why the thief will do that, was he trying to use your stolen funds to gamble in a crypto casino, well it is not as easy as contacting stake to help you recover your funds, you will need a police warrant and a governement authorization to be sent to stake to provide more information about the owner of the account that received your stolen funds (that is if they have kyc procedure) so they can investigate the case, link the culprits and then request stake to give you your money back.If you had lost ~$30,000 and above, then what i said 'may' be possible, but for $450 it is impossible, and don't expect stake to just send you \"your\" money back without the due process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IustinVV",
      "created_time": "August 20, 2022, 01:22:12 AM",
      "body": "Quote from: Z-tight on August 20, 2022, 01:18:51 AMYou must first of all take it that bitcoin transactions are irreversible.Now, your funds were moved to a stake address, i don't know why the thief will do that, was he trying to use your stolen funds to gamble in a crypto casino, well it is not as easy as contacting stake to help you recover your funds, you will need a police warrant and a governement authorization to be sent to stake to provide more information about the owner of the account that received your stolen funds (that is if they have kyc procedure) so they can investigate the case, link the culprits and then request stake to give you your money back.If you had lost ~$30,000 and above, then what i said 'may' be possible, but for $450 it is impossible, and don't expect stake to just send you \"your\" money back without the due process.It was to my stake , as I said small city I know the thief personally ,he knows I use to bet/ have crypto. He actually tried to do coinmixing by trying to withdraw without betting, the transaction was canceled",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "DanWalker",
      "created_time": "August 20, 2022, 04:08:50 AM",
      "body": "I think this is not part of Stake's policy and they have no reason to refund you. They are just an online gambling service provider, they will not care about your careless actions. Obviously it's your fault, you didn't protect your property and now you're making them pay for the damage you've caused is absurd.If you want to get your money back then you should work with the police and the thief, he is the one who took your money and he is responsible for giving it back to you and not Stake.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "saxydev",
      "created_time": "August 20, 2022, 05:27:13 AM",
      "body": "They will give back your coins. First, contact them by email, on livechat are only idiots. As the problem stands probably they will look into the thief and they will realise he is under 18. By that the funds will be taken away from him.After that all you have to do is to prove to stake that the coins are yours, show the history of your transactions, a paper from the police, at least something and you go from there. It doesn't sound like a problem without a solution",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "bittraffic",
      "created_time": "August 20, 2022, 05:52:45 AM",
      "body": "Quote from: IustinVV on August 20, 2022, 12:40:19 AMhe moved my coins from my ltc address to stake.com (around 450$) Not sure what that means, did he just move the LTC to his own stake account?  I'm not sure if stake will have something to do with your situation but maybe that kid will have to verify his account and then ask that kid to send it back to your account. It's just $400 I think the stake will not even ask KYC from him. The funds are just too small for Stake to be bothered, you already caught the thief, if he bet the amount and loses then it's all gone.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Oshosondy",
      "created_time": "August 20, 2022, 06:33:14 AM",
      "body": "Quote from: IustinVV on August 20, 2022, 12:40:19 AMBut if he transferred the money to Stake, can't it be withdrawn directly? That can be done with the help of police. Or you have to bet with it first before it can be withdrawn?Quote from: gumusi on August 20, 2022, 12:57:48 AMIt would be very generous of STAKE.com to compensate you...Compensate for what? Because he transferred the money to his Stake account? He did not transfer money to his Stake account. What happened was that a thief transferred the the money to his own account (the thief's account).How would Stake know if he is telling the truth or not? He needs a legal action about it, there should be an organization he can report this to in his country, they will be the one to contact Stake, not him directly.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Pandu Geddon",
      "created_time": "August 20, 2022, 07:52:32 AM",
      "body": "Quote from: Oshosondy on August 20, 2022, 06:33:14 AMBut if he transferred the money to Stake, can't it be withdrawn directly? That can be done with the help of police. Or you have to bet with it first before it can be withdrawn?it should be doable. if there is a rule from Stake to make a bet first before withdrawing, I don't think it's a problem.but I guess that the money that has been deposited has been played by the thief first and is lost. and the rest is withdrawn by the account owner.if that's the case, I'm sure it's not Stake's responsibility. this should be communicated with the local police as well as the perpetrator's family (as they are still not of age)Refunds can only be made by the perpetrator, not other parties.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "FatFork",
      "created_time": "August 20, 2022, 11:20:28 AM",
      "body": "Quote from: IustinVV on August 20, 2022, 01:22:12 AMIt was to my stake , as I said small city I know the thief personally ,he knows I use to bet/ have crypto. He actually tried to do coinmixing by trying to withdraw without betting, the transaction was canceled So he transferred the coins to your Stake account? Why would he do that if he wanted to steal your coins? But anyway, since you claim he couldn't withdraw them from the Stake account, what happened to the coins next? Are they still in your Stake balance?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Google+",
      "created_time": "August 20, 2022, 07:56:01 PM",
      "body": "1. looks like this case is just bullshit. How could a thief send coins to the victim's (your) stake account? can you explain in detail and send tx here. Op must be transparent in explaining his case so that everyone here understands the situation you are in.2. Now for the security of your Stake account, I think you should install 2FA and do some other security, for example doing KYC to verify if something unwanted happens to your account such as a theft case.3. And from the title that you make as if you blame the Stake.Com company even though this is purely your own fault.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "JeromeTash",
      "created_time": "August 20, 2022, 08:54:04 PM",
      "body": "There's something amiss in this story, how could a thief transfer funds from your LTC wallet that has no password to your stake account, again that miraculously has no password on a laptop that for some reason is also not protected by a password?Worst of it, why did he send money to stake.com instead of an exchange where he could just cash out?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "dkbit98",
      "created_time": "August 20, 2022, 09:01:04 PM",
      "body": "Quote from: IustinVV on August 20, 2022, 12:40:19 AMI contacted stake.com live chat and they said they cant help, I tried talking with a manager maybe he will be able to help but I couldnt reach any of them. I know 450$ isnt much , I know it is partially my fault and not much could be done, but cant stake understand my situation? I can provide a police statement to them to see how it happened and video of my laptop being stolen, maybe that can help.You should really contact Stake directly, it's won't help much writing about that in some forum.I would suggest that you always do full disk encryption for your laptops and add reasonably strong password.Regular people won't be able to access anything on your laptop and you won't lost anything except device, but your files should be safe.Second thing you should use is password managers, so you don't keep browser website accounts logged in.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "IustinVV",
      "created_time": "August 20, 2022, 09:35:28 PM",
      "body": "Quote from: JeromeTash on August 20, 2022, 08:54:04 PMThere's something amiss in this story, how could a thief transfer funds from your LTC wallet that has no password to your stake account, again that miraculously has no password on a laptop that for some reason is also not protected by a password?Worst of it, why did he send money to stake.com instead of an exchange where he could just cash out?I am logged in on stake and my wallet can be directly opened without asking for a password since my laptop is not stolen on a daily basis( Its still dumb leaving them like this, I  know) I dont know why he went to go through stake as he needed to bet for withdrawing the money. As far as a response from stake they cant help. I am speaking with his parents since they are the one able to help",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "August 20, 2022, 10:03:54 PM",
      "body": "Quote from: IustinVV on August 20, 2022, 09:35:28 PMI am logged in on stake and my wallet can be directly opened without asking for a password since my laptop is not stolen on a daily basis( Its still dumb leaving them like this, I  know) I dont know why he went to go through stake as he needed to bet for withdrawing the money. As far as a response from stake they cant help. I am speaking with his parents since they are the one able to help I am smelling some bullshit here... The most likely scenario: You bet, you lost, and now you are making up stories to convince the casino for a refund. This much more convincing than your \"dog ate my homework\" story, right?And, change the thread title, Stake.com is not responsible here.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "noormcs5",
      "created_time": "August 20, 2022, 11:18:00 PM",
      "body": "Quote from: Stalker22 on August 20, 2022, 10:03:54 PMQuote from: IustinVV on August 20, 2022, 09:35:28 PMI am logged in on stake and my wallet can be directly opened without asking for a password since my laptop is not stolen on a daily basis( Its still dumb leaving them like this, I  know) I dont know why he went to go through stake as he needed to bet for withdrawing the money. As far as a response from stake they cant help. I am speaking with his parents since they are the one able to help I am smelling some bullshit here... The most likely scenario: You bet, you lost, and now you are making up stories to convince the casino for a refund. This much more convincing than your \"dog ate my homework\" story, right?And, change the thread title, Stake.com is not responsible here.Stake.com or any other site won't give him the money back if he lost the money in gambling and there is no point in complaining  There is no way to know if the fund transferred to the stake was his own or was it was done by a close friend. Whatever the case, the money is not coming back and there is no need to blame stake for his own mishaps.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "yahoo62278",
      "created_time": "August 21, 2022, 01:46:24 AM",
      "body": "It sucks to get robbed. Bottom line though, your coins your responsibility to protect those coins. Stake is not at fault here and if they decided to do anything it would be very generous of them but by no means obligated.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "GeorgeJohn",
      "created_time": "August 21, 2022, 10:46:44 AM",
      "body": "Quote from: IustinVV on August 20, 2022, 01:09:18 AMI mean a police reports that presents my case with the laptop being stolen,they dont involve in this crypto things. I am sure I can get a statement from them tomorrow from the look of things, it's very understandable that stake will not like to accept the prove from police because, statement of prove can be manipulated from any police head point. So from my perspective stake.com deserve the chance rejection  your proposal and also have the right to accept in any form.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "BitcoinGirl.Club",
      "created_time": "August 21, 2022, 08:18:33 PM",
      "body": "The thief is a stupid or what? LOLWhy did he not sold the LTC instead of sending them to Stake and even it's not his Stake account.It does not add up.By any chance are you trying to say that you sent money to Stake and lost before withdrawing 60$.Considering you did it by yourself or even if this was truly by a thief, I do not see any reason for Stake to give any money back that the account lost. They are not liable for your account security.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}