{
  "id": "topic_5468648",
  "title": "Disruptivas",
  "author": "Disruptivas",
  "created_time": "September 30, 2023, 11:43:36 AM",
  "content": "Essa semana me deparei com um gráfico que achei lindissimo:Basicamente é um gráfico que mostra o preço do hash em BTC e em USD e o histórico da receita que os minerações fazem ao longo do tempo em BTC e em USDPontos de destaque:- A recompensa em BTC caiu drasticamente enquanto a recompensa em USD escalou bastante. - Mas o que mais me surpreendeu e eu não tinha isso claro - mas talvez por falta de noçaõ minha mesmo - foi que o preço do hash caiu drasticamente. Como as ASICs lançadas sempre são cada vez mais caras, tinha a impressão de aumento desse preço. Mas é barateamento do hash em si e não do ''hash necessário'' pra fazer o que se fazia antes, né?",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5468648",
  "comments": [
    {
      "author": "tg88",
      "created_time": "September 30, 2023, 12:00:34 PM",
      "body": "Quote from: Disruptivas on September 30, 2023, 11:43:36 AM- A recompensa em BTC caiu drasticamente enquanto a recompensa em USD escalou bastante. - Mas o que mais me surpreendeu e eu não tinha isso claro - mas talvez por falta de noçaõ minha mesmo - foi que o preço do hash caiu drasticamente. Como as ASICs lançadas sempre são cada vez mais caras, tinha a impressão de aumento desse preço. Mas é barateamento do hash em si e não do ''hash necessário'' pra fazer o que se fazia antes, né?Bem interessante o gráfico, espero que ele continue se comportando assim no próximo halving e próximos anos.No caso dos preços o gráfico se refere ao custo de aquisição de 1 Exahash, que é o equivalente a 1 quintilhão de hashes por segundo. Atualmente as ASIC estão produzindo individualmente algo em torno de 140 T/hs (trilhões de hashes por segundo).Fazendo uma conta 1 exahash é igual a 1000000 T/hs então hoje para atingir 1 exahash precisaríamos de 7142 Antminer S19 XP. Então quanto mais eficiente as maquinas ficam teoricamente vai se tornando mais barato comprar 1 exahash.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Loganota",
      "created_time": "September 30, 2023, 03:06:14 PM",
      "body": "Quote from: Disruptivas on September 30, 2023, 11:43:36 AM- A recompensa em BTC caiu drasticamente enquanto a recompensa em USD escalou bastante. - Mas o que mais me surpreendeu e eu não tinha isso claro - mas talvez por falta de noçaõ minha mesmo - foi que o preço do hash caiu drasticamente. Como as ASICs lançadas sempre são cada vez mais caras, tinha a impressão de aumento desse preço. Mas é barateamento do hash em si e não do ''hash necessário'' pra fazer o que se fazia antes, né?Acho que esses dois pontos eram esperados. O primeiro é que o valor em USD \"precisa\" aumentar pra acompanhar pelo menos o gasto em energia que é usado para a mineração. Como a recompensa cai pela metade a cada 4 anos, há pelo menos o planejamento que o valor do BTC irá pelo menos dobrar para compensar os custos em energia. Logicamente não é simples assim porque o preço poderia ficar estável e o hashrate da rede diminuir pra acompanhar (gente parando de minerar) mas não é isso que acontece.O segundo ponto é a eficiência das novas máquinas mineradoras que está sempre aumentando com o tempo. Cada vez os caras conseguem aprimorar mais essas máquinas, então o custo pra fazer o cálculo dos hashs vai diminuindo com o tempo.Mas o gráfico é bem legal, obrigado por compartilhar",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}