{
  "id": "topic_5454787",
  "title": "Godlovesyou",
  "author": "Godlovesyou",
  "created_time": "June 01, 2023, 04:25:46 PM",
  "content": "Think of when you hit a jackpot, and some cool cash slide into your pocket, you feels better and step up some pride and involved arrogance, you feel like you can buy the world with your peanuts lol, bro, I little shopping out of it can makes you look like a poor man again. There is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. This money is never really enough, no wonder even the President of nations still fights to get money after office.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5454787",
  "comments": [
    {
      "author": "Wiwo",
      "created_time": "June 01, 2023, 04:45:50 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMFirst, you must know that money is limitless and the amount you own doesn't guarantee you a successful financial future unless you invest that money into something that will keep making you more money in the process, So the oil guy failed to invest his money properly and failed to keep servicing the oil well which is the reason for it drying up.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "aylabadia05",
      "created_time": "June 01, 2023, 04:51:46 PM",
      "body": "There is a sentence like \"money is not everything, but everything needs money\".When money is able to control us, that's when we feel that money will never be enough. On the other hand, if we are in control of money, then any amount will be sufficient.Arrogance and feeling the greatest when there are many sheets of paper is not something that needs to be done because it will not always be of value.When we are able to direct or arrange sheets of paper with different designs for each country so that they are always of value, then that's great.Sheets of paper that will become obsolete are like magic that will pull us into the abyss, so it's no wonder that in every country we always see many high-ranking officials involved in corruption cases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "X-ray",
      "created_time": "June 01, 2023, 04:53:43 PM",
      "body": "So, what's the main purpose for people to fight in politics? It's all about money. When you have the power to control everything through being a regulator and then you will able to make your way to get the money much easier than you think. Contesting in politics is not easy. You can imagine if there will be dark money that backed his opponent and his money will never be enough. He needs more than it to win in competing to get political power.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "June 01, 2023, 04:55:37 PM",
      "body": "You pointed out a great topic or i would say a moral topic on which we should spend some time thinking. Like, before turning 18, we have been taught to make money so that we could make a happy living some of us got the point and some of us ignores it because? Idk what is the reason. But i do know that, teaching the topic of \"Money is never enough\" is so necassary for all youngsters and i understood this point few years back due to some financial conditions. Which were repeating due to same mistakes made with money as you have mentioned a story of oil well owner, same as it is ours. I also spent a lot of time teaching the same thing to my you get brother that no wonder oldest will tell you to remain on earning more blah and blah but you have to give a thought to your own moral self and think about it for a second that how important money ks and how much important we should give it. Because, when we give more importance to money then it deserves we are ruining our life along with our loved ones because let say, your oldest (anyone) gave you money to get them something from the market and you are under 18 and lost the money. What do you think is gonna happen when you get home. (I know you will say a teenager deserves that) but he/she also deserves forgiveness which the money lover ignores as he love money more and gave money more importance than it deserves. I have seen many cases in my life, and understood this statement very well and i suggest all of in support of this statement that they should also adopt it in there livings and improve there life with this concept that money is not everything, even if you get a well of oil and get a 5$ from the road, it will never be enough until you satisfy your heart and control your wishes of getting more (not greed).",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Accardo",
      "created_time": "June 01, 2023, 05:03:04 PM",
      "body": "The love of money kept everyone poor. We can't have enough money because we love it, so a person can't get enough of what they love. Do you ask yourself why some fraudsters, atheletes and business men go broke? most of them get stuck and stop getting money after their big earning. If a person understands how money works, follows the right investment and is comfortable with what they have, they can manage money wisely. Out of greed people fail to manage money, like the mentioned guy, he got greedy out of his love for money now he's broke. If he knew the right candidate and invested the money on the person with a higher probability of winning the election, and eventually the person wins, he, the investor, will enjoy more and gain extra money as the person he sponsored will shower him with lots of opportunities and help his oil business.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "@forxample",
      "created_time": "June 01, 2023, 05:28:22 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThink of when you hit a jackpot, and some cool cash slide into your pocket, you feels better and step up some pride and involved arrogance, you feel like you can buy the world with your peanuts lol, bro, I little shopping out of it can makes you look like a poor man again. There is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. This money is never really enough, no wonder even the President of nations still fights to get money after office.you need to know that whatever amount of money we have is transitory, the more you have a lot of money, the lifestyle will increase so that you only waste money on things that are not important. but it does not apply to people who can take advantage of opportunities and can control themselves. so when you have a lot of money. the first is to immediately lend your money so that your money is still there. Second, immediately invest your money to keep your money and increase the wealth you have. third, immediately try to start your business so you can learn to manage money and even if you lose you will get expensive experience, so that later when you start another business it will be better because there has been an evaluation of the previous business so you don't experience losses.and the man who runs the oil industry fails to take advantage of the opportunities that come his way and cannot organize and manage what he gets.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Smartvirus",
      "created_time": "June 01, 2023, 05:32:16 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThere is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. This money is never really enough, no wonder even the President of nations still fights to get money after office.Owns an oil well you say...!Are you sure you know what means or entails?As little as trying to run for politics twice won't be enough to finish the money that could be generated by an individual with a single oil well. Come on, let's be more realistic about that.  Yeah, there would be other constraints to what might get the individual bankrupt but, am not so sure that individual owned an oil well in the first place.When we refer to money, we've got to understand that it diminishes with time. Money not well spent and by that mean invested would as well diminish. There is a reason why continual earnings is regarded as income. Its supposed to keep coming as you spend. If you aren't getting regular income, then you ought not to spending more.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "June 01, 2023, 05:49:44 PM",
      "body": "Maybe you've heard about lottery winners with jackpots that get up to hundreds of thousands of dollars and some even touch millions of dollars, they become arrogant because they buy whatever they want because they have a lot in their pocket, but in a few years the person is far poor again after do not use their money properly, then money that is never enough is for people who are greedy and can have control over their management.As for the oil dealer, then it will deal with politics/government whereas for me politics is cruel with every big opportunity he will enter and reap the money, so it's no wonder there will be a power struggle and whoever is tough will win.I don't know whether the oil source is owned by someone or the government because of political power, this is a struggle.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "uneng",
      "created_time": "June 01, 2023, 05:56:05 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThere is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything.Well, your story has come with a moral in the end: don't get engaged with politics! Especially if you consider yourself a threat to consolidated structures inside your local society. There will be retaliation later, without any doubts... We can't say with sure the intentions of your oil dealer friend on his political misadventures, but the chances are that a greedy, unscrupulous individual is more likely to win than to lose, and considering he has lost twice already, the chances are that he isn't on the level of cunning and trickery politics demands from a person.In your example, you have expressed money is never enough for the oil dealer, but thinking by the other side, he didn't have a spot in politics because money wasn't enough for his adversaries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "teosanru",
      "created_time": "June 01, 2023, 06:12:12 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThink of when you hit a jackpot, and some cool cash slide into your pocket, you feels better and step up some pride and involved arrogance, you feel like you can buy the world with your peanuts lol, bro, I little shopping out of it can makes you look like a poor man again. There is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. This money is never really enough, no wonder even the President of nations still fights to get money after office.This is true. Money can always satisfy you only upto a certain level after that you only want to reach to the next higher level. When a person doesn't have any money even a little salary is enough for him, but after he starts earning that little salary eventually that'll also not be enough and he'll want more because we humans have that tendency to increase our needs, lifestyle and wants with our increasing salaries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Zlantann",
      "created_time": "June 01, 2023, 06:17:41 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThink of when you hit a jackpot, and some cool cash slide into your pocket, you feels better and step up some pride and involved arrogance, you feel like you can buy the world with your peanuts lol, bro, I little shopping out of it can makes you look like a poor man again. I don't think money breeds pride because there many people that are poor but proud. The richest man in my country is one of the meekest personalities I have ever come across. He lives a modest life than many people that even depend on him to make money. Anybody that becomes proud when he becomes rich has some traces of pride before the money came. If we understand that money comes and goes we will be more humble. There is no need to be arrogant because of money because someone's earns in seconds what you have acquired throughout your lifetime.QuoteThere is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. Money is not enough for people that are not content with what they have. Based on your story the reason why this man went into politics is not to serve the people but to make more money and show off. He is a greedy folk that is not content with his income from the oil well. This is what happens to people that don't appreciate what they have so they end up losing what they had in the process of chasing what they don't have. QuoteThis money is never really enough, no wonder even the President of nations still fights to get money after office. Presidents of a country are not expected to amass wealth while in office. The only reason why they become super rich is because they steal from public funds. So it is not out of place for ex-presidents to go into business or other ventures to make money. It is only in some corrupt countries that past presidents are even richer than most global businessmen because of corruption.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "someone703",
      "created_time": "June 01, 2023, 06:51:20 PM",
      "body": "The desire to have money and accumulate wealth can vary from person to person. So there are many people who will never feel satisfied with the assets they hold, which leads to the relentless pursuit of more wealth. Even being arrogant and getting a sense of greatness just from material possessions won't be satisfying in the long run. The value of money is not fixed, and currency can fluctuate in value. Even so, there are still a lot of people pursuing it, which is why more and more people are pursuing this nature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "panganib999",
      "created_time": "June 01, 2023, 06:54:31 PM",
      "body": "Money is power, thus you'd understand that these people with money will always be vying for power the very chance they get. Only thing is that you'd have to be able to know when to stop and when to push through, seems like this guy is onto something, or he's just belligerent enough to think that losing the election once isn't indicative of something. Money doesn't breed pride, it just inflates it. People have inherent pride in them from the moment they grew consciousness in this planet and money just elevates that pride to a whole new level. I could also say that since there's a threshold to how much money will make you happy, and once you've reached that threshold earning more money wouldn't make you happier anymore I can see these people chasing that high, which then leads them to feats that are so stupid all for the love of money.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "usekevin",
      "created_time": "June 01, 2023, 06:57:56 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThink of when you hit a jackpot, and some cool cash slide into your pocket, you feels better and step up some pride and involved arrogance, you feel like you can buy the world with your peanuts lol, bro, I little shopping out of it can makes you look like a poor man again. There is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. This money is never really enough, no wonder even the President of nations still fights to get money after office.When the money we get from the jackpot,first we will do of satisfying all the old desire.It may be big or small,mostly big which fulfilled by the huge money from the jackpot.When you do fill the big desire,you will become a poor again.So you can get money from other people after the loss of complete fortune from the jackpot.When the oil dealer uses all money in the politics,he can earn more than the invested money from the politics alone.Incase he lost as though your opinion,then it will leads to poor condition and worst decision in his life time by choosing politics.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Silberman",
      "created_time": "June 01, 2023, 07:07:40 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThink of when you hit a jackpot, and some cool cash slide into your pocket, you feels better and step up some pride and involved arrogance, you feel like you can buy the world with your peanuts lol, bro, I little shopping out of it can makes you look like a poor man again. There is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. This money is never really enough, no wonder even the President of nations still fights to get money after office.What happens is very simple, no matter how rich a person becomes they will never generate enough money to buy every single thing the world has to offer, so when thinking about this is obvious that the answer to our problems is often not necessarily to earn more money but to limit our desires, and the example you give is a perfect illustration of this, the person you are referring to was fortunate enough to earn a lot of money, but due to his aspirations to have even more, now he has lost everything.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Hamphser",
      "created_time": "June 01, 2023, 07:18:39 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThink of when you hit a jackpot, and some cool cash slide into your pocket, you feels better and step up some pride and involved arrogance, you feel like you can buy the world with your peanuts lol, bro, I little shopping out of it can makes you look like a poor man again. There is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. This money is never really enough, no wonder even the President of nations still fights to get money after office.We humans are naturally greedy on which its no surprise that we would really be asking for more than on what we do currently have. We know that if we are financially capabled then we would really be touchingup things like that politics since we are really that aiming for having that power and influence.Yes,it is really that indeed peanuts considering that there are far more lot richer than us but if you are really that an owner of an oil well then this is something that isnt really anyone could able to attain on how much this guy is owning but same as you said that money sourcescant last up forever and this is why it would really be ideal that you should really know on making use of your money into much wiser way for you to sustain and wontreally be making yourself that poor again.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Crypto Library",
      "created_time": "June 01, 2023, 07:31:43 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThink of when you hit a jackpot, and some cool cash slide into your pocket, you feels better and step up some pride and involved arrogance, you feel like you can buy the world with your peanuts lol, bro, I little shopping out of it can makes you look like a poor man again. There is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. This money is never really enough, no wonder even the President of nations still fights to get money after office.It is true that money is never enough. We humans never sit with the peacefulness what we have, everyone wants to improve their status, and for this they make various efforts. Some are successful and some fail. And its negative aspect is tied to failing with the community person you know. It wouldn't have happened to him unless he was happy with what he had. However, the lesson we should learn from these incidents is that excess greediness is never good. Most of the time though, we humans don't follow this, and the reason for this reminds me of a saying that people's mouths are never filled unless it's the soil of the grave. Anyway, finally with our learning from these cases, our life should actually be passed in such a way that Simple Living High thinking.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Fortify",
      "created_time": "June 01, 2023, 07:38:09 PM",
      "body": "Quote from: Godlovesyou on June 01, 2023, 04:25:46 PMThink of when you hit a jackpot, and some cool cash slide into your pocket, you feels better and step up some pride and involved arrogance, you feel like you can buy the world with your peanuts lol, bro, I little shopping out of it can makes you look like a poor man again. There is this oil dealer guy in my community who happen to be hot market pro in the oil industry, he owns an oil well but this guy it gets to his head and start contesting for political power which he has lose twice now and the worst of it now is that the oil well is dried because suck the money into politics, loss everything. This money is never really enough, no wonder even the President of nations still fights to get money after office.What your rather short and condensed story tells me is that you need to diversify your income streams, while identifying potential leaks of your money. Everyone with a business mindset will always be looking for chances at new or improved revenue streams, it feels like he gambled his on the possibility that he could wield power into even more money. That is a very dangerous game, because if he had no charisma, had poor connections or the face simply didn't fit - then he was unlikely to transfer easily into the game of politics. He would have been much better off following and optimizing his original line of business, but then, he may have been bored of that and was looking for a new challenge, but he ultimately failed and wasted a lot of money in the process.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "alastantiger",
      "created_time": "June 01, 2023, 07:38:18 PM",
      "body": "I don't agree. Money is always enough, it is human greed and insatiatity that is not enough. The greed to accumulate more resources than you'll ever need that makes money seem like it is not enough.The person described in the story you narrated is just a rookie politician. Because if he is a veteran he'd know that campaigns are not funded from out of pocket. Isn't it?  Presidents of nations fight just like in Sudan not because of money but greed, deep seated evil greed. If it is not greed, then why is a country like Switzerland with all her riches not at war?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}