{
  "id": "topic_5409038",
  "title": "Mr.Luddite",
  "author": "Mr.Luddite",
  "created_time": "August 07, 2022, 08:28:25 PM",
  "content": "Hello,I found a old private key from 2013.  I want to double check it doesn't have a significant balance but i have only a few characters in the password.is there a way i can brute force this or figure out the password with minimal guessing myself crazy?it was a blockchain.info wallet i had way back, have the wallet id, private key and 3 characters out of a 12 character password.wallet id was recognized, private key wasn't, private key seemed to have some weird words maybe i wrote it down wrong.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5409038",
  "comments": [
    {
      "author": "hosemary",
      "created_time": "August 07, 2022, 08:37:51 PMLast edit: August 07, 2022, 08:47:53 PM by hosseinimr93",
      "body": "Quote from: Mr.Luddite on August 07, 2022, 08:28:25 PMI found a old private key from 2013.  I want to double check it doesn't have a significant balance but i have only a few characters in the password.If you have the private key, that's all you need and you don't need any password. Quote from: Mr.Luddite on August 07, 2022, 08:28:25 PMwallet id was recognized, private key wasn't, private key seemed to have some weird words maybe i wrote it down wrong.  Maybe, you are confusing the mnemonic phrase with private key.Isn't that a series of words? If so, that's called mnemonic phrase, not private key. The following link may be helpful to you. https://login.blockchain.com/wallet/forgot-password",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Stalker22",
      "created_time": "August 07, 2022, 08:57:14 PM",
      "body": "Quote from: Mr.Luddite on August 07, 2022, 08:28:25 PMwallet id was recognized, private key wasn't, private key seemed to have some weird words maybe i wrote it down wrong.  The private key should not have any words in it. If it is, as hosseinimr93 mentioned, a seed phrase or recovery phrase, it usually contains a series of 12 (or 24) words. Does your data look like a private key or a seed phrase?When you say that the private key is not recognized, what exactly do you mean? Where is it not recognized?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "hosemary",
      "created_time": "August 07, 2022, 09:35:38 PM",
      "body": "Quote from: Stalker22 on August 07, 2022, 08:57:14 PMit usually contains a series of 12 (or 24) words. If the wallet has been created in 2013, the seed phrase should contain 16-20 words. Blockchain.com wallet used to give users a seed phrase which isn't supported by any other wallet. They upgraded their wallet in 2016 and started to use 12 word BIP39 seed phrases.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.Luddite",
      "created_time": "August 07, 2022, 10:20:53 PM",
      "body": "hi everyone, thanks so much for the responses.i found this sitehttps://brutebrothers.com/wallet-recovery/blockchainit looks like there is certainly some way i can recover.the private key or phrase that i have, it is 18 words and 15 are regular words but there are a few words in there that look they aren't english,\"hambrecht\" for instance and a couple others that made me doubt what i wrote down but its clearly written really appreciate the responses thank you all",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "odolvlobo",
      "created_time": "August 07, 2022, 10:56:35 PM",
      "body": "Quote from: Mr.Luddite on August 07, 2022, 10:20:53 PMi found this site ...Is this whole thread just an ad for that site?If you have the blockchain.com mnemonic phrase, then don't use that site. Just go here:Quote from: hosseinimr93 on August 07, 2022, 08:37:51 PMThe following link may be helpful to you. https://login.blockchain.com/wallet/forgot-password",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Mr.Luddite",
      "created_time": "August 08, 2022, 12:18:26 AM",
      "body": "yeah i figured it out with the phrase, and recovered it from their site.sadly just $5 in dust and a long history from 2013 directbet action thats it, thanks for helping, had no idea that the phrase wasn't the private key!  learn something new everydya",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}