{
  "id": "topic_5450656",
  "title": "Odusko",
  "author": "Odusko",
  "created_time": "April 29, 2023, 11:36:15 PMLast edit: May 01, 2023, 07:42:08 PM by Odusko",
  "content": "As the crisis in  Sudan persisted and countries tried to evacuate their citizens in the troubled country, an unexpected event played out that Bitcoin become the only way to reach some victims who were trapped in the desert with no money or bank networks. This is the situation with some Africans who are currently trapped in the desert at the moment since the buses evacuating them stopped in the middle of the desert leaving the Nigerians who were running from the crisis to have no choice but to look for alternative ways to continue their journey back home or ease their pain while waiting for another rescue, the situation is more worst because most of those involved have no money left on them and they were relying on the government arrangement to get them back from Sudan to Nigeria but at the moment reports have it that the buses drivers have stopped the journey halfway and for the past 3 days most of the Nigerians have been left in the middle of deserts left to fend for themselves. The role Bitcoin played in Getting financial help to the victims:Some of those on the evacuation journey have to reach out to families and well-wishers seeking for funding to help ease their pain and since there are no bank networks in the desert and no way to send or receive fiat money, I suggested the use of Bitcoin to get money across to a friend who is stuck, and all we needed to do was to send the money to his Bitcoin wallet without any restrictions or delays.The Bitcoin was received within a short time, and this gave me more satisfaction using Bitcoin in the time of crisis, the only problem is how he can exchange the Bitcoin and make payments that will help his struggle in the desert but the joy is that he now has access to funds through Bitcoin, and the stress to exchange into any local available currency or using Bitcoin to make payment on p2p if he meets anyone that use and accept Bitcoin is far more better and lesser worries, than the troubles of not having access to money at all.Indeed Bitcoin is a life savior.For those asking for link, you can watch this video to get the clear picture of the nature of things with the Nigerians stranded im the deserts.https://twitter.com/nigeriantribune/status/1651601215019532290And as for those who doubt my write up, its all good since it was a personal friend's supports.I was just trying to portray the ability of Bitcoin to connect people financially even though the other party may not be able to use it to sort out they financial challenges at that point, but I guess having something to rely on is far better, were all hopes is lost and the person is vulnerable in time of crisis.",
  "score": 0,
  "upvotes": 0,
  "downvotes": 0,
  "url": "https://bitcointalk.org/index.php?topic=5450656",
  "comments": [
    {
      "author": "Yatsan",
      "created_time": "April 29, 2023, 11:47:23 PM",
      "body": "Quote from: Odusko on April 29, 2023, 11:36:15 PMAs the crisis in  Sudan persisted and countries tried to evacuate their citizens in the troubled country, an unexpected event played out that Bitcoin become the only way to reach some victims who were trapped in the desert with no money or bank networks. This is the situation with some Africans who are currently trapped in the desert at the moment since the buses evacuating them stopped in the middle of the desert leaving the Nigerians who were running from the crisis to have no choice but to look for alternative ways to continue their journey back home or ease their pain while waiting for another rescue, the situation is more worst because most of those involved have no money left on them and they were relying on the government arrangement to get them back from Sudan to Nigeria but at the moment reports have it that the buses drivers have stopped the journey halfway and for the past 3 days most of the Nigerians have been left in the middle of deserts left to fend for themselves. The role Bitcoin played in Getting financial help to the victims:Some of those on the evacuation journey have to reach out to families and well-wishers seeking for funding to help ease their pain and since there are no bank networks in the desert and no way to send or receive fiat money, I suggested the use of Bitcoin to get money across to a friend who is stuck, and all we needed to do was to send the money to his Bitcoin wallet without any restrictions or delays.The Bitcoin was received within a short time, and this gave me more satisfaction using Bitcoin in the time of crisis, the only problem is how he can exchange the Bitcoin and make payments that will help his struggle in the desert but the joy is that he now has access to funds through Bitcoin, and the stress to exchange into any local available currency or using Bitcoin to make payment on p2p if he meets anyone that use and accept Bitcoin is far more better and lesser worries, than the troubles of not having access to money at all.Indeed Bitcoin is a life saviorBy any chance, do you have a link on the article(if there is), regarding this? I'm a bit shocked that online payments are not accessible but Bitcoin is? As far as I know, cryptocurrencies are less accepted by majority of the countries unlike with fiat online banking as long as there is an internet connection. Offline transactions in Bitcoin network could only work through hard wallet but it sounds impossible with the given indtance since they are isolated. We all know how beneficial Bitcoin is as an investment and as a mode of payment but in times of an emergency such as with above, isn't it fiat based online payments would be more convenient?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Darker45",
      "created_time": "April 30, 2023, 01:34:23 AM",
      "body": "I don't know how Bitcoin is a life savior in your story. If you're stuck in the desert, Bitcoin can't actually help you. Water is your life-saver. A group of travelers is a life-saver. An oasis is a life-saver, but not Bitcoin. If I'm stuck in the middle of the desert for 3 days, Bitcoin won't probably give me joy. What will give me joy is that bus that will finally fetch me away from that hell and impending death. Actually, in circumstances like this, cash proves to be much better than Bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Iranus",
      "created_time": "April 30, 2023, 01:57:13 AM",
      "body": "Quote from: Yatsan on April 29, 2023, 11:47:23 PMQuote from: Odusko on April 29, 2023, 11:36:15 PMAs the crisis in  Sudan persisted and countries tried to evacuate their citizens in the troubled country, an unexpected event played out that Bitcoin become the only way to reach some victims who were trapped in the desert with no money or bank networks. This is the situation with some Africans who are currently trapped in the desert at the moment since the buses evacuating them stopped in the middle of the desert leaving the Nigerians who were running from the crisis to have no choice but to look for alternative ways to continue their journey back home or ease their pain while waiting for another rescue, the situation is more worst because most of those involved have no money left on them and they were relying on the government arrangement to get them back from Sudan to Nigeria but at the moment reports have it that the buses drivers have stopped the journey halfway and for the past 3 days most of the Nigerians have been left in the middle of deserts left to fend for themselves. The role Bitcoin played in Getting financial help to the victims:Some of those on the evacuation journey have to reach out to families and well-wishers seeking for funding to help ease their pain and since there are no bank networks in the desert and no way to send or receive fiat money, I suggested the use of Bitcoin to get money across to a friend who is stuck, and all we needed to do was to send the money to his Bitcoin wallet without any restrictions or delays.The Bitcoin was received within a short time, and this gave me more satisfaction using Bitcoin in the time of crisis, the only problem is how he can exchange the Bitcoin and make payments that will help his struggle in the desert but the joy is that he now has access to funds through Bitcoin, and the stress to exchange into any local available currency or using Bitcoin to make payment on p2p if he meets anyone that use and accept Bitcoin is far more better and lesser worries, than the troubles of not having access to money at all.Indeed Bitcoin is a life saviorBy any chance, do you have a link on the article(if there is), regarding this? I'm a bit shocked that online payments are not accessible but Bitcoin is? As far as I know, cryptocurrencies are less accepted by majority of the countries unlike with fiat online banking as long as there is an internet connection. Offline transactions in Bitcoin network could only work through hard wallet but it sounds impossible with the given indtance since they are isolated. We all know how beneficial Bitcoin is as an investment and as a mode of payment but in times of an emergency such as with above, isn't it fiat based online payments would be more convenient?I was also confused. If they can't use the network to pay online, how can it be easy to use bitcoin? And how all the people on that bus had no cash or bank accounts but most had bitcoins, I really doubt the story. I don't believe that people who are migrating will have no cash. I know bitcoin is bringing us many benefits and many use cases, it can be said to be the savior of many people. But this story is unrealistic and somewhat exaggerated and biased for bitcoin.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "traderethereum",
      "created_time": "April 30, 2023, 04:14:13 AM",
      "body": "Bitcoin can be a life savior but in that case, they will also find it difficult to exchange their bitcoins because they have to find a shop that accepts bitcoins, especially in the desert.Everything will be useless if he still won't able to use his bitcoins even though he managed to get a lot of bitcoins from donations that are very far from where they are.And this requires the government's participation to legalize bitcoin as an option for payment so that if people cannot access the bank and make transactions, they can still buy something at a shop that accepts bitcoins to survive.Bitcoin still needs approval from the government to be used more widely; hopefully, that will happen soon before the crisis hits all countries.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "cryptoaddictchie",
      "created_time": "April 30, 2023, 04:27:06 AM",
      "body": "Yes bitcoin maybe of help them but I literally find it useless on their situation. What actually they need are food and water and any means of supply for living. Cause their situation is a bit of hard, and having bitcoin on that place isnt much of help. Unless they can use that to order pizza delivery and sent to them isnt it.It may help on doing financial transaction but the adoption measures isnt appropriate with the story.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "SamReomo",
      "created_time": "April 30, 2023, 04:53:32 AM",
      "body": "That's a really inspiriting story but can you clear my mind out that how did they manage to receive the Bitcoin in desert? I mean in those areas there are no good networking facilities available then how did they got access to internet and received the Bitcoin?Other than those concerns I found the story really inspiring and astonishing. If they somehow received the Bitcoin then they might have access to smartphones and internet which would make it easy for them to convert the Bitcoin into digital fiat that they can use to purchase good from the people in the desert. I don't think that anyone in those deserts may have enough knowledge about Bitcoin and its usage and that's why those bitcoins are currently of no use to those Nigerians as they can not cash out those coins in the desert.  However, if they can convert those Bitcoin into digital fiat then there might be someone in the desert who may accept that digital fiat payment in exchange of cash or goods.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mendace",
      "created_time": "April 30, 2023, 05:50:11 AM",
      "body": "Bravo, this is the true mission of Bitcoin and it is precisely for these needs that it was created here.  I am sure (and in fact I have proof of it) that the industrialized world will arrive very late in using Bitcoin while the poorest countries such as Sudan will be among the first and will benefit from it in the future.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "mindrust",
      "created_time": "April 30, 2023, 06:03:44 AM",
      "body": "Quote from: Darker45 on April 30, 2023, 01:34:23 AMI don't know how Bitcoin is a life savior in your story. If you're stuck in the desert, Bitcoin can't actually help you. Water is your life-saver. A group of travelers is a life-saver. An oasis is a life-saver, but not Bitcoin. If I'm stuck in the middle of the desert for 3 days, Bitcoin won't probably give me joy. What will give me joy is that bus that will finally fetch me away from that hell and impending death. Actually, in circumstances like this, cash proves to be much better than Bitcoin.You have a point. I am sick and tired of seeing these pointless articles that picture bitcoin a solution to every world problem. There is war? Bitcoin solves it. There is drought? Bitcoin solves it… People won’t even think about buying bitcoin (and they won’t be able to) in these situations. And even if they did before these bad stuff happened, they won’t make a use of their coins till they move to another country. How are they gonna take care of themselves before that happens? Nobody in Sudan gives a damn about crypto probably. Can they even access an exchange and make trades?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "April 30, 2023, 06:12:06 AM",
      "body": "First, is it a Made up story or a real one? If it's a Made up story, It's unlikely to happen they will find someone in the middle of the desert to sell their Bitcoin. I am curious how they will have a Mobile network in the middle of the desert where they do not have access to a bank network. Mobile networks and the internet are everything there. If the Mobile network works, they can use mobile banking using the internet. If they don't have access to the mobile network, they cannot access Bitcoin either. This story may be interesting to hear for kids. But not who love realistic stories.Quote from: Odusko on April 29, 2023, 11:36:15 PMI suggested the use of Bitcoin to get money across to a friend who is stuck, and all we needed to do was to send the money to his Bitcoin wallet without any restrictions or delays. The Bitcoin was received within a short time, and this gave me more satisfaction using Bitcoin in the time of crisis. You have used \"I,\" \"we,\" and \"me\" in this story, and it looks like you were involved in this case. If you claim this is a real story, you were involved. I would say I don't believe you. Don't come up with made-up fake stories. I have some friends in Saudi Arabia, and I know the situation. Sometimes you won't see anyone in some deserts for a long time. In some places, You won't have access to the mobile network. Also, someone can't come to the middle of the desert and give them fiat money in exchange for Bitcoin. Stop lying.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Faisal2202",
      "created_time": "April 30, 2023, 06:14:57 AM",
      "body": "Quote from: Odusko on April 29, 2023, 11:36:15 PM and the stress to exchange into any local available currency or using Bitcoin to make payment on p2p if he meets anyone that use and accept Bitcoin is far more better and lesser worries, than the troubles of not having access to money at all.Indeed Bitcoin is a life saviorI think you just helped your friend partially because if buses are not moving due to money then BTC is of great help because they can use it as payment but as you mentioned there are no banks or BTC ATMs then the only way is they have to find a person who could accept there BTC and can give them fiat.Or they have to give their BTC directly to the bus drivers if they accept it. On the other hand, i wasn't aware of the situation can you please find me an article that could help me to know the whole situation? like which desert they are in? is there any network connectivity there, because if there is connectivity they can simply make an online transaction to the driver's account so that the driver could move instead of sticking to the long procedure of converting BTC into fiat where you have no access to the p2p feature.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "ImThour",
      "created_time": "April 30, 2023, 06:18:04 AM",
      "body": "Bitcoin as of now is the life savior of people with stupid governments and poor local currency, other than that it's just a financial investment.As everyone else mentioned, you didn't link up any article or anything to prove your claims which is very common here on this forum.Bitcoin does require the internet for payments and isn't modern banking include mBanking options too? Don't really understand how only BITCOIN solves this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "salad daging",
      "created_time": "April 30, 2023, 06:46:56 AM",
      "body": "Quote from: Odusko on April 29, 2023, 11:36:15 PMThe Bitcoin was received within a short time, and this gave me more satisfaction using Bitcoin in the time of crisis, the only problem is how he can exchange the Bitcoin and make payments that will help his struggle in the desert but the joy is that he now has access to funds through Bitcoin, and the stress to exchange into any local available currency or using Bitcoin to make payment on p2p if he meets anyone that use and accept Bitcoin is far more better and lesser worries, than the troubles of not having access to money at all.Indeed Bitcoin is a life saviorI read an article that the government has already banned the use of bitcoins in their country, even if someone deals with cryptocurrencies there is a risk of facing the law.At the moment Sudan is in an emergency crisis where there are two groups fighting for power when many people are trapped in this situation then bitcoin will not be able to save anything because I believe there are very few bitcoin users and it will be more difficult to make P2P transactions to exchange to local money especially to the bank of course it can not be done.The important thing now is saving every citizen, and evacuating as soon as possible, but what other people say is the staple food and bus pickup will be the real savior.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "John Abraham",
      "created_time": "April 30, 2023, 07:17:22 AM",
      "body": "Quote from: Faisal2202 on April 30, 2023, 06:14:57 AMlike which desert they are in? is there any network connectivity there, because if there is connectivity they can simply make an online transaction to the driver's account so that the driver could move instead of sticking to the long procedure of converting BTC into fiat where you have no access to the p2p feature.If they are in an area where a network connection is available. They can simply use mobile banking and transfer money where needed. I don't think any bus driver in Arabs will stop his bus because his passengers cannot pay because of the network connection. If passengers don't have a network connection, it will be the same for drivers as well. If they have money and can pay the driver once they reach the network, Arab drivers won't refuse to help them. It's basic things in Arab. They won't leave anyone in the middle of the desert for money. Quote from: ImThour on April 30, 2023, 06:18:04 AMBitcoin does require the internet for payments and isn't modern banking include mBanking options too? Don't really understand how only BITCOIN solves this.This is a made-up story, for sure. If they have internet access in the middle of the desert, they can do bank transactions or mobile transactions if they need urgent cash. As he said, there was no network; how is Bitcoin supposed to work there? How they communicated without the Internet or Mobile network? I am curious to see his answer regarding this.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Spaceman1000$",
      "created_time": "April 30, 2023, 07:52:55 AM",
      "body": "Your suggestion was good, but I'm a bit worried about the usage of bitcoin in the desert, Because at this point they need fiat currency to easily engage with whoever they might met to help them to a safe destination. And how possible will it be to have internet service in the desert before you even engage in P2P, because this is a warring situation and everybody scampering for safety.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "kryptqnick",
      "created_time": "April 30, 2023, 10:18:24 AM",
      "body": "I tried googling to find additional information about the op's story, but couldn't find anything. So I join others in saying that a link to a source would be much appreciated. If it's a true story, it's wonderful to see that Bitcoin was useful in an unexpected situation. However, I don't quite understand why online banking wasn't available (even though the Internet connection was okay, I assume, considering that Bitcoin could be sent and received)... I remember some stories from my own country, from the early days of the Russian full-scale invasion of Ukraine. Some people used Bitcoin to purchase a car, for example. So I do understand how a situation similar to the one described by the op could present itself, but I'd like to see more information about the Sudan-Nigeria case.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "lovesmayfamilis",
      "created_time": "April 30, 2023, 10:30:35 AM",
      "body": "OP, you can just as much enjoy sending Bitcoin to your friends at any time without having to make up stories about the desert. There is a big difference between having Bitcoin and being able to use it here and now. Give your friends your bitcoins, and then you can also consider yourself, along with bitcoin, a savior, since owning bitcoin is definitely better than not having it. It doesn't matter how or when it is used. The important thing is that your friends have it.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "stompix",
      "created_time": "April 30, 2023, 10:38:30 AM",
      "body": "Quote from: Yatsan on April 29, 2023, 11:47:23 PMBy any chance, do you have a link on the article(if there is), regarding this? I'm a bit shocked that online payments are not accessible but Bitcoin is? The source is trust me bro, I heard from a friend of a relative of a guy who meet his stepmom on Tinder that she once dreamt of this!The simple problem with this story is that if the guy who pays in Bitcoin does so because there is no access to other fiances, why is the other guy accepting it since he has no way of cashing out and how does he pay for the stuff? I met a ton of Ukraine refugees last year, they all were trying to exchange hrivnas for USD or euros, they all had either cash in USD or euros, and they had a few debit cards, in the tens of trips in welcoming centers, I've never heard on asking if he can pay in Bitcoin.It's a psychological thing, and it won't change in decades, when running for your life you want value you can touch and that can be easily changed in times of need, not something you like this. It's not Bitcoin's fault for being so perceived but it's hard to change how humans think, it will take a while.Quote from: Odusko on April 29, 2023, 11:36:15 PMSome of those on the evacuation journey have to reach out to families and well-wishers seeking for funding to help ease their pain and since there are no bank networks in the desert and no way to send or receive fiat money, I suggested the use of Bitcoin to get money across to a friend who is stuck, and all we needed to do was to send the money to his Bitcoin wallet without any restrictions or delays.Yeah, cool story, and what has he done with those bitcoins since he had no way to transfer them or exchange them to fiat?He paid who with coins, and why did those guys take coins when they also had nowhere to spend them, since, you said it, it was a desert, quite a funny looking desert with 5G poles every kilometer? And why did the guy abandon them and suddenly decided then to continue the trip when he got Bitcoins, why didn't they pay him in coins the entire sum from the start?Seriously, lock this farce!",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "boyptc",
      "created_time": "April 30, 2023, 11:02:39 AM",
      "body": "In that situation, while reading the OP, the problem was already built on my mind on how these people are going to exchange these bitcoins sent to them as aid if they're in the middle of nowhere?Yeah, they will receive it directly if they've got their phones and wallets and let's say that they're connected with their mobile networks. But then it can't be avoided that there will be problems like if they've been stuck for so long in the middle of desert or nowhere, they'll go lowbatt and then what's next with them?It's a tough situation to think of and yes, only P2P will be the solution on this one but if the merchant they encounter isn't aware of bitcoin and ain't willing to trade and accept payment in bitcoin, it's still no help IMO.",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Minecache",
      "created_time": "April 30, 2023, 11:08:25 AM",
      "body": "Quote from: mindrust on April 30, 2023, 06:03:44 AMQuote from: Darker45 on April 30, 2023, 01:34:23 AMI don't know how Bitcoin is a life savior in your story. If you're stuck in the desert, Bitcoin can't actually help you. Water is your life-saver. A group of travelers is a life-saver. An oasis is a life-saver, but not Bitcoin. If I'm stuck in the middle of the desert for 3 days, Bitcoin won't probably give me joy. What will give me joy is that bus that will finally fetch me away from that hell and impending death. Actually, in circumstances like this, cash proves to be much better than Bitcoin.You have a point. I am sick and tired of seeing these pointless articles that picture bitcoin a solution to every world problem. There is war? Bitcoin solves it. There is drought? Bitcoin solves it… People won’t even think about buying bitcoin (and they won’t be able to) in these situations. And even if they did before these bad stuff happened, they won’t make a use of their coins till they move to another country. How are they gonna take care of themselves before that happens? Nobody in Sudan gives a damn about crypto probably. Can they even access an exchange and make trades? I'm also a bitcoin investor, I really love it more than any other asset class, and it makes up the bulk of my asset portfolio right now. But I also get sick of seeing people exaggerate bitcoin so much, they see bitcoin as a god that can help them solve all problems in life. I don't want to exaggerate, but many people consider bitcoin as a religion, and they worship it more than themselves or their parents. Why can't people live more realistically but exaggerate things too much? Will that make them richer?I really don't believe the OP's story, how can people who can't use the internet in the desert use bitcoins?",
      "score": 0,
      "upvotes": 0,
      "downvotes": 0
    }
  ]
}